{"ref": "https://www.gamespot.com/reviews/rome-total-war-alexander-review/1900-6152960/", "date": "June 23, 2006", "game_name": "Rome: Total War", "text": "Alexander the Great supposedly once said, ~There is nothing impossible to him who would try.~ Well, he never played his namesake expansion pack for Rome: Total War. This latest, download-only addition to The Creative Assembly's long-running series of historic epics is so spectacularly difficult that even the legendary Macedonian conqueror would have a rough go of subduing those pesky Persians. The game provides an illuminating lesson on just how tough of a task the monarch set for himself when he journeyed out to conquer the known world in 335 BC, and it's a splash of cold Grecian wine in the face of Total War-series veterans who think they've done it all. The great man himself, about to ride Bucephalus into battle. The add-on's scope is a bit more limited than the previous Rome: Total War expansion pack, Barbarian Invasion, as befitting its download-only distribution at a cut-rate price of $14.95. For that fee, you get one campaign encompassing Alexander's blitz of the Near East, six historical battles from Alexander's early career, and new multiplayer options, where you can set up two-on-one and three-on-one matches and tournaments online. This content is more than enough, though, largely because the campaign is so challenging that most players will spend many, many hours experimenting with different ways to beat it. It changes the focus of the original Rome: Total War by dropping any pretense of building and diplomacy in favor of a 100-turn slugfest that favors battles over Rome's turn-based deliberation, so if you're expecting lots of political intrigue and empire-building, you might not find what you're looking for. This is a Macedonian rush to get Big Al roughly to the border of India while holding 30 provinces before the clock runs out and the gods spirit him away to Olympus (or he gets drunk and dies, depending on which version you want to believe). While you still can play around with fortifying conquered towns and setting up garrisons (there is no diplomacy available at all here), to do so means that you'll never occupy enough areas before the sands run through the hourglass and Alexander's life comes to a youthful end. Needless to say, getting to the promised land is not easy. The odds are stacked against you from the very start of the game. Play opens with the Macedonian treasury deep in the red and the capital, Pella, sandwiched between Persian armies on the eastern side of the Bosphorus and a pesky Illyrian barbarian force to the northwest. Go gung ho into Asia to take on the Persians right away (which you feel pressed to do, given you're on a clock and supposed to be heading east, not west) and the Illyrians can cruise in and take Pella. Devote too much strength to the Illyrians, and the Persian army and fleet to the east go on the offensive. It's tough getting established in Asia with a reasonably strong army, let alone blitzing all the way into India. Armies get whittled down constantly. Even though you start with a massive force, it gets hacked apart in short order since you're forced to fight one big battle after another. You have no way to properly rest and rebuild, either, as a scorched-earth policy is necessary to raise cash for troops and to ensure that you don't wind up with revolts in your rear that you have no time to go back and deal with. This is more than a bit ahistorical. History buffs might find it strange and off-putting to lead Alexander's armies to crush his neighbors, since this doesn't mesh with the mercy that the real Alexander showed to conquered cities or the conqueror's cultural-fusion policy (it's hard to merge Greece with Persia when you're slaughtering every Persian you lay your eyes upon). But there is no other way to wage war here. Play the benevolent conqueror, and you inevitably wind up fighting a war on two fronts later in the game. Gather enough phalangists, and you'll soon find out that the top Persian units aren't immortal after all, despite their name. For reinforcements in Alexander, you're stuck with either building and bringing up troops from core Greek cities such as Pella and Sparta or hiring mercenaries (after you sack enough cities to rebuild your treasury, of course). Neither option is entirely effective, though. By the time you get past turn 50 or so, your main army is so far to the east (or at least it should be) that it takes forever for troops from home to reach the front lines. And, as in all Total War games, mercenaries are often unreliable, especially in vast numbers. You can easily get to a position where you're fighting battles with just a few hundred Macedonians backed by four or five times that many mercenaries. Still, it isn't all bad. When you have them to deploy, Macedonian troops are the best in the game--their morale is superb, and they are universally good all-around units that can attack and defend extremely well. Two really stand out. The Companion heavy cavalry are absolute killers from the flanks and have solid armor that makes them better than average defenders against spearmen. And the phalangist spearmen are flat-out devastating against, well, almost everything. They never seem to break, and their long spears can chew up enemy infantry, cavalry, archers, and spearmen alike. Deploy enough of them, and they can make short work of even Persia's new Immortal heavy-infantry units and the Indian elephants. That said, the campaign remains tough. It's well worth playing, though. The focus on the battlefield arguably makes play a bit less engaging than the typical campaign in the original Rome: Total War, but the turn limit adds an incredible sense of tension to every single battle, right from the opening skirmishes. Games can be run through pretty quickly, too. So even though there is a lot of luck and experimentation required to get to India in one piece, you can zip through a full campaign in a couple of evenings of play. This really cranks up the replay value. New multiplayer and skirmish rules enhance the replay factor, too. Being able to set up lopsided battles and wage war in multibattle (best of three or best of five) tournaments adds new wrinkles to online play and solo skirmishes against the computer. Unfortunately, these rules can only be used with the expansion and its Macedonian, Persian, Indian, and Barbarian factions, not Rome: Total War or the Barbarian Invasion add-on. Illyrian barbarians are no match for Alexander's heavy-cavalry Companions. Of even more interest is the minicampaign depicting six of Alexander's earliest battles. You start by subduing the Greeks and then ravage the Anatolian coast to kick out the Persians. Like the primary campaign, the minicampaign offers battles that are incredibly tough, particularly the last two against the Persian king Darius III and his elephants. An added plus is that these battles are hosted by acclaimed British actor Brian Blessed (best known for his fantastic portrayal of Augustus in the BBC adaptation of I, Claudius). His lines lend a lot of drama to the overall presentation, even though he chews the scenery so much that battles veer toward the campy at certain moments, such as when units are routed. Alexander brings a lot to the table for its $14.95 price tag. Although the battlefield focus makes it a little too fast and furious for methodical conquerors who want their virtual empires to stand the test of time, this isn't what Alexander the Great was all about. So the expansion based on his exploits isn't about building something that lasts, either. Still, this is a must-play addition to the Rome: Total War family, especially if you're looking for a challenge."}