{"ref": "https://www.gamespot.com/reviews/heroes-of-might-and-magic-quest-for-the-dragon-bon/1900-2712934/", "date": "April 26, 2001", "game_name": "Heroes of Might and Magic: Quest for the Dragon Bone Staff", "text": "Heroes of Might and Magic: Quest for the Dragon Bone Staff is one of the few PS2 strategy games. While the game is similar to New World Computing's long-running PC series, the game has been given a bit of a face-lift in an attempt to make it a little more palatable for console players. Even though the formula and concept, whether or not they've gotten better or worse, are still up for argument, the console version of this strategy staple has several considerable redeeming points. The hero you select at the start of your journey, be it barbarian, paladin, knight, or sorceress, never appears during your journey, except as an iconic representative of your location on the world map. The differences between the characters are minor, but some are better moneymakers or magic users than others. You're limited to only the one hero, and even though you have the occasional nifty spells and leadership modifier, they have no direct effect on your army's success in battle. It's a bit of a shame the hero is always a no-show, since picking the barbarian sure gives the impression you'd be kicking some dragon tail firsthand and picking the sorceress implies maneuvering her to inflict some nasty fiery death. The absence of the hero on the battlefield strikes one as especially odd considering the game's title. After chuckling at the game's name and popping in the disc, the first thing that PlayStation 2 owners will notice is that much of this game is just plain old ugly. The units aren't much to look at, the world map is often far too bare and plain, and loading times are a bit of an annoyance when you try to access those much-needed army-status, world-map, and character-status screens. While there are varied battlegrounds reflecting the area of the current encounter, they're all far too bare and simple, with only a rock or two thrown in for measure. Sound effects, be they sword clashes, grunts, or blows, are decent and competent. The opening FMV sequence is just as unimpressive and tells an uninspired tale, in traditional sword-and-sorcery fashion, of a kingdom needing a mystical staff to destroy an evil dragon and elf wizard. To accomplish this task, you'll hire an army from the units available at the castle, in dungeons, forests, plains, and hills, and wage war against rival castles inhabited by villains across the land, many of whom have a bounty on their head. So the game boils down to raising capital by defeating villains and vanquishing foes to pay for magic training, more troops, and gear (like boats). The action gets a bit repetitive as you move from area to area, killing anything you see--just to build bigger and better armies. However, there's some enjoyment to be found by experimenting with units in order to find the optimal combination of power and morale. Sometimes this can be as much fun as completing your objectives. To find the hidden dragon bone staff, you'll have to clear all the elements of the puzzle map, which is made up of artifacts and villains you'll find along the way. The quest is very straightforward, and while you can go about accomplishing the tasks in a linear fashion, you're free to roam wherever you desire on the first continent, and you can move on to others as soon as you find the appropriate seafaring charts. If some of the series' conventions hadn't remained constant, players of PC titles wouldn't be able to readily recognize this game, since so much has changed in this console translation of the franchise. Movement on the overworld map is now in real time instead of turn based, making exploration via foot, horseback, or ship painless. Encounters aren't strictly mandatory--you're able to see enemies on the world map and avoid them if necessary. Of course, your score and cash flow are mainly dependent upon your success on the battlefield, so you'll want to clash swords as often as possible. Part of the annoyance in Heroes is that the enemy encounter areas don't replenish as time goes on. This does, however, make completing your tasks, capturing all the villains, and finding all the artifacts easier than it would be if the monsters were constantly respawning. While the package isn't visually impressive, the fun of combat is where Heroes shines. Each of the units is represented by a very large, polygonal character model, complete with choppy attack animation routines. Unlike your units in the very rigid structure of the Heroes of Might and Magic PC versions, your units in the PS2 version can negotiate terrain very fluidly, casting aside the harsh chess-styled movement in favor of a more analog approach. The grid overlay on the battlefields serves only for gauging distances and range, without hampering your control over the action. The aforementioned attack animations, as poorly executed as they are, are brief and, better yet, can be skipped with a tap of the attack button, simplifying combat to a fast-paced hackfest. The different units available are diverse and fun to experiment with. Demons, giants, trolls, archers, ghosts, and many other forces possess individual talents that you will want to try out firsthand. The many elements of Heroes of Might and Magic make for a satisfying strategic combat system that entertains as well as challenges. Overall, Heroes of Might and Magic: Quest for the Dragon Bone Staff has a few surprises and some significant flaws. While die-hard strategy fans and extreme fans of the Heroes series on the PC might get a kick out of this one, it's really a rental at best."}