{"ref": "https://www.gamespot.com/reviews/swords-and-soldiers-2-review/1900-6416148/", "date": "May 20, 2015", "game_name": "Swords & Soldiers II", "text": "Military skirmishes are never two-dimensional affairs. There is always a lot of politics involved, of course, but on a more primal level, there are concerns like unit formation and attack direction to command your attention--elements that most real-time strategy games try to emulate in one way or another when they depict war. Swords & Soldiers II does away with most of that unit management, boiling the RTS formula down to some of its barest essentials and leaving you with a deceptively simple side-scrolling strategy game. Imagine Age of Empires, flatten it against a cave wall, cut the time of most matches down to 10 minutes or less, and sprinkle in an array of character names that double as puns.Every battle in Swords & Soldiers II is a duel between two armies--one on the left side of the map and one on the right. Whenever you send out a combat unit from your base (whether its a slow but strong melee unit, an agile ranged unit, or something else entirely), that unit travels in a straight line toward the enemy's base until it encounters resistance. With rare exceptions, you have no real control over a unit's movement--most of the games controls center on buying soldiers, not commanding them. You can't tell a unit to stop, you cant tell it to ignore an enemy, you can't command it to shift focus ... it simply moves toward its goal, destroying everything in its way or dying in the attempt.As you play through the game's stages, you are steadily introduced to units and spells from each faction.Since you can't manage exactly when and where your troops will go, resource management is key. Swords & Soldiers II keeps this simple: you purchase most units with gold, and on most maps, you collect it from a mine located right next to your home base--no exploring required. The mine's supply of funds is infinite, so as long as you don't allow your worker units to die, you can easily maintain a steady supply of income. The only other resource you have to keep an eye on is mana, which dictates when you can use the various spells at your disposal. Typically, mana trickles in slowly but steadily, though there are ways to earn mana more quickly if you're proactive about accumulating it. For example, blocks of gold or mana occasionally parachute down from the heavens, which you can send a worker out to collect.Both gold and mana are important, but spells in particular often shift the tide of battle. They are your most direct way of influencing the action, like the hand of a god throwing down a bolt of lightning or cursing its enemies with fear. Unleashing the right spell at the right time can throw a major wrench into your opponent's plans. Say, for instance, that the other player has just sent a large group of fast-moving enemies your way. This could be devastating for your much smaller force if you simply allow the opposing units to duke it out head-to-head, but a properly placed blizzard spell can temporarily stop the entire cluster of enemies in its tracks, giving your own warriors time to whittle them down. Other times, success comes down to countering your opponent with a properly matched army. Is she sending flying units your way? Then dont lean too heavily on your short-range berserkers.All of this can be done with quick and easy touch controls on the Wii U GamePad, though this method means that you spend your entire time looking at the GamePads screen rather than the TV. If youd rather, you can play with an analog stick and button control scheme that swaps a command bar at the top of the screen for radial menus assigned to the Wii Us ZL and ZR buttons. You may lose a bit of speed when selecting units this way, but its a comfortable and easy-to-use setup.You only have to worry about the opposing army coming at you from a single direction, but that doesn't mean that you never lose track of what's going on. Because a complex battle is being flattened to 2D, there is usually a lot happening on the screen, making it easy to be overwhelmed by the action. Thankfully, Swords & Soldiers II's vibrantly chunky, fantastical art makes most of the game's units visually distinctive from one another at a quick glance. (Granted, it helps that there aren't too many units in the first place. Each faction has less than a dozen, not including spells and towers.)Swords & Soldiers II boils the RTS formula down to some of its barest essentials and leaves you with a deceptively simple side-scrolling strategy game.If you played the first Swords & Soldiers, most of these details are familiar, though in this case, familiarity does not breed contempt. It's been several years since the beloved original game was released, and this sequel is much improved not just in visual terms (it's a much better-looking game than its predecessor), but also in regards to campaign structure.The original game was separated into multiple short campaigns, each focused on one of the game's factions. Swords & Soldiers II instead has a single campaign that tells one large, unbroken story. As you play through the game's stages, you are steadily introduced to units and spells from each faction--such as the Vikings' snowstorm or the demons' skeleton-generating tower--allowing you to get a good grasp of all the game's strategic options without being overwhelmed right from the start. Intriguingly, those units are often mixed and matched throughout the campaign. A Persian Sand Witch can fight alongside a demonic Naga while being defended by a Viking guard tower, leading to greater variety in your potential strategies.This ability to create your own custom faction carries forward into the game's skirmish mode. Perhaps you have played StarCraft and thought, ~I really like playing as the Terrans, but it would be awesome if I had access to that one Protoss unit. Swords & Soldiers IIs response to that question is to invite you to build a dream team. Unfortunately, you arent able to show off that team to too many people. While Swords & Soldiers II has a great local two-player mode in which one player uses the Wii U GamePad's screen and the other player uses the TV, there is no online multiplayer mode. You can play against AI opponents of varying difficulty, but the AI is no substitute for a devilish human opponent.In fact, if you don't have people nearby to skirmish with, there's not a lot to keep you coming back to Swords & Soldiers II once you've finished the relatively brief (about four- or five-hour) campaign. There are bonus objectives and timed challenges to go for in each mission if you're a completist, but not much in the way of extra, replayable content. Yet Swords & Soldiers II is still impressive, bringing the depth of any properly balanced RTS to a two-dimensional plane. If youve got a few hours to kill, its campaign provides great strategic opportunities. And if youve got a friend nearby, you could be skirmishing for a long time to come."}