{"ref": "https://www.gamespot.com/reviews/battlefield-2142-review/1900-6159893/", "date": "June 25, 2007", "game_name": "Battlefield 2142", "text": "Baseball legend Yogi Berra once quipped that ~the future ain't what it used to be,~ which seems appropriate when describing Battlefield 2142, the fourth PC game in the best-selling action franchise. This new game attempts to follow up last year's superb Battlefield 2--and that's both a blessing and a curse, as 2142 will invite inevitable comparisons to Battlefield 2, even while it's busy trying to break new ground. Nevertheless, while a lot of the changes seem minor, there is enough new content in here to merit your attention. A different sort of Cold War rages in Battlefield 2142, as two factions battle for survival and a new home in the distant future. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Battlefield 2142 Video Review The plot of 2142 could best be described as Battlefield 2 meets The Day After Tomorrow, the 2004 movie where the world is suddenly encased in a present-day ice age. When billions of people are forced to flee the frigid Northern Hemisphere for the more hospitable Southern one, tensions escalate and shooting wars erupt for the last remaining bits of habitable land. In the game, this translates to the European Union battling the Russia-centered Pan Asian Coalition as they fight to flee Europe ahead of the ice and establish themselves in North Africa. The battlefields will shift from a wintry and war-torn European landscape to the arid sands of North Africa. This also means there are only two factions in the game, though why are the current inhabitants of North Africa sitting idly by while they're being invaded? In any event, these new factions are interesting, even if they are a bit hard to distinguish from one another. The soldiers of the future are clad in the same type of high-tech body armor, though the Russian armor is a bit blacker than the European version. If you've played Battlefield 2, then you'll feel quickly at home in Battlefield 2142. The future is a very familiar place, because the designers didn't go too exotic with the weapons and vehicles. There are no laser or beam weapons here; instead, you'll get futuristic versions of today's weapons. There's an assault rifle, a sniper rifle, a missile launcher, and a light machine gun to equip the game's four classes. That's right: There are only four classes in the game, down from the seven seen in Battlefield 2, though these new classes are a lot more flexible and customizable. The price is that you're going to have to play 2142 a lot to access most of these customization options, as this system is designed to encourage long-term play. The designers took the idea of weapon unlocks in Battlefield 2 and put it on steroids, so you can unlock up to 40 different weapons or pieces of equipment. Not only that, but each class has two different unlock tracks, which specialize in a different direction. For instance, the recon class can become a more powerful sniper or a more effective Special Forces operator, who can sneak around and blow up enemy ground stations, thus hampering the ability of the enemy commander to call in various forms of support. However, this also means that you might be in for some frustration in the beginning, as your character won't even have grenades until you unlock them, and you'll be at a disadvantage against those players who have access to the more powerful weapons and abilities. And while the promotions and unlocks come fairly quickly early on, the pace will slow down as each new unlock requires you to accumulate more and more points. So you'll need to play quite a bit to unlock a lot of what makes Battlefield 2142 so different from its predecessors. Or, you'll find yourself playing one class a lot more than the others, since that's where most of your early unlocks will go. This entire process is a bit confusing, as it's not enough to simply unlock new items, but then you must outfit your character when you join a battle for the first time. Of course, Battlefield games aren't just about infantry combat, as the series' engaging mix of infantry and vehicle combat is what makes it so addictive. If you're a Battlefield veteran, you'll find that the vehicles of the future are a familiar lot, save for the cool mechlike walkers, which are essentially walking tanks. Still, you have slightly tricked-out versions of today's buggies, armored personnel carriers, and tanks. Again, there are some new features to make these vehicles feel a bit different. The buggies can kick in a short turbo boost to speed out of the danger zone, while the APCs can launch infantry into the sky on assault pods. The PAC tanks float thanks to hover technology, while the EU tanks rely on conventional treads. If used properly, these new vehicles can be devastating, though they can be countered if infantry teams work together. Of course, getting people to work together has always been a major issue in Battlefield, so we can probably expect the same endless debates about balancing as before. And the big question is the airpower, which was overly dominant in Battlefield 2. Our experience with 2142 is that these aircraft aren't as devastating as those in Battlefield 2, since they're slower and less capable, plus there are more ways to take them out. Then again, we'll probably be proven wrong once ace pilots emerge and figure out how to make these aircraft do stunts that even the designers didn't envision. The unlock system is a lot more complex than in Battlefield 2 and it rewards long-term play, though it also means you won't have a lot to play with at the beginning. As you can probably tell by now, many of the gameplay concepts that were introduced in Battlefield 2 return in a slightly more evolved form. The squad nature of the gameplay is back, but now there are incentives in the form of ~field upgrades~ that reward players for squadding up and playing together. You get more points quicker if you follow orders, too. The commander role returns, and one player on each team can call in satellite scans and aerial drones to detect the enemy, as well as orbital strikes, which are a powerful form of artillery that take a long time to recharge. There's also an electromagnetic pulse strike that temporarily disables any vehicles in the blast radius, as well as scrambles the helmet-mounted displays of infantry. Still, there's a lot here that seems familiar, including the visuals, thanks to 2142 using a slightly enhanced version of the Battlefield 2 graphics engine. The engine is getting a bit dated at this point, and there's still no widescreen support, but the good news is that the system requirements haven't really changed, though the drawn-out load times of Battlefield 2 haven't been improved on, either. Thankfully, 2142 has a cool new feature in Titan mode to accompany the traditional conquest mode. This is the first new mode introduced in Battlefield since the series' inception, and it's a great one. Conquest mode requires you to capture and hold various control points on the map while at the same time trying to whittle down your enemy's respawn ticket count. Titan mode gets rid of the ticket count and changes the control points to missile silos. The goal is now to destroy the other team's Titan, which is a floating aircraft carrier/battleship defended by a powerful energy shield. This can lead to lots of frenetic battles to control the various missile silos, as they periodically loft up a missile that can damage the energy shield. Once the shield is down, you have to assault the Titan, either by flying over on a transport or rocketing up in an assault pod. The battle inside a Titan can be intense, as defenders seek to hold off the invaders in narrow corridor battles where the bullets and grenades fly. If the invaders can gain access to the reactor room by blowing up the four security terminals, they can blow up the Titan. Titan mode can be a nail-biter as you engage in desperate firefights in the narrow confines of a floating aircraft carrier. Titan mode requires a bit more coordination than conquest mode, but the results can be wild once people figure it out. What's great about Titan mode is that there are plenty of ways to win. If one team manages to get ahead big, it's still possible for the other team to catch up so long as the defenders onboard the Titan can buy enough time for the rest of their teammates to capture the now relatively undefended silos and knock down the enemy Titan's shields. Then it's a race between offense and defense on two different Titans. The dynamic of the game also shifts, as the boarding action is infantry only, and this means that you have to get out of your vehicles and slug it out the old fashioned way. When you toss in all the cool new toys that you can unlock, such as active camouflage to make yourself semiinvisible, sentry droids that can help cover narrow corridors, and healing stations that can patch up an entire squad at the same time, the action can get really crazy. The whole atmosphere is helped by the excellent quality of the sound production. First, there's the constant stream of chatter in the air, as teammates call out targets or issue orders. The EU forces speak with clipped English accents, while the PAC uses Russian. It'll take a while to recognize what the various Russian phrases mean, though some are instantly recognizable, such as ~big robot~ when referring to the walkers. The sound effects are also cool, as the weapons of the future sound distinct and unique, while also lethal. Then there's the bombastic and lumbering musical score that wouldn't seem out of place in a Michael Bay movie. Each level has its own rousing theme to get you psyched for the battle ahead. And while the graphics engine hasn't really changed, that's not to say that this isn't a pretty game. Each battlefield has a unique feel to it, from the futuristic fortress that guards Gibraltar to the gutted remains of Berlin. You'll go from picturesque European towns and villages to being surrounded by sleek steel towers to the arid wastes of North Africa. There's plenty of scenery to soak in, but it's the attention to detail that's worth mentioning. The cool little grainy video feed you get when you're manning the gun on a transport or APC, the way your tech garbles when you're hit by an EMP pulse, or just the sensation of being surrounded by a raging battle on the ground and in the skies above you all greatly enhance the atmosphere. The look of the game is impressive, even if the technology behind it is no longer cutting edge. On a peculiar note, even though the world is ending in 2142, it appears that advertising will still be around. Battlefield 2142 features in-game ads, though we didn't get to see them firsthand during our testing. Still, there is a printed disclaimer that comes with the game telling you that Battlefield 2142 will analyze certain ~advertising data~ on your machine to determine what ads to display to you. Ironically, EA says that if you don't want your data shared with its advertising partner then ~do not install or play the software on any platform that is used to connect to the Internet.~ But that would pretty much defeat the purpose of playing Battlefield 2142, wouldn't it? Of course, you could always play single-player against the artificial intelligence, though the AI won't be mistaken for human opponents any time soon, and the single-player is still limited to 16-player maps. Still, this is an example of things to come, as we begin to see dynamic in-game ads appear in more and more games. When you get down to it, Battlefield 2142 is a solid entry in the series, as it feels like a slightly more refined version of its popular predecessor. Aside from the new Titan mode, there's not a lot new here, though, so this doesn't feel anywhere quite like the leap that Battlefield 2 represented from its predecessors--it's more akin to what Battlefield: Vietnam was to Battlefield 1942. Still, if you're looking for more multiplayer mayhem, it's hard not to recommend Battlefield 2142. Thankfully, 2142 has a cool new feature in Titan mode to accompany the traditional conquest mode. This is the first new mode introduced in Battlefield since the series' inception, and it's a great one. Conquest mode requires you to capture and hold various control points on the map while at the same time trying to whittle down your enemy's respawn ticket count. Titan mode gets rid of the ticket count and changes the control points to missile silos. The goal is now to destroy the other team's Titan, which is a floating aircraft carrier/battleship defended by a powerful energy shield. This can lead to lots of frenetic battles to control the various missile silos, as they periodically loft up a missile that can damage the energy shield. Once the shield is down, you have to assault the Titan, either by flying over on a transport or rocketing up in an assault pod. The battle inside a Titan can be intense, as defenders seek to hold off the invaders in narrow corridor battles where the bullets and grenades fly. If the invaders can gain access to the reactor room by blowing up the four security terminals, they can blow up the Titan. Titan mode can be a nail-biter as you engage in desperate firefights in the narrow confines of a floating aircraft carrier. Titan mode requires a bit more coordination than conquest mode, but the results can be wild once people figure it out. What's great about Titan mode is that there are plenty of ways to win. If one team manages to get ahead big, it's still possible for the other team to catch up so long as the defenders onboard the Titan can buy enough time for the rest of their teammates to capture the now relatively undefended silos and knock down the enemy Titan's shields. Then it's a race between offense and defense on two different Titans. The dynamic of the game also shifts, as the boarding action is infantry only, and this means that you have to get out of your vehicles and slug it out the old fashioned way. When you toss in all the cool new toys that you can unlock, such as active camouflage to make yourself semiinvisible, sentry droids that can help cover narrow corridors, and healing stations that can patch up an entire squad at the same time, the action can get really crazy. The whole atmosphere is helped by the excellent quality of the sound production. First, there's the constant stream of chatter in the air, as teammates call out targets or issue orders. The EU forces speak with clipped English accents, while the PAC uses Russian. It'll take a while to recognize what the various Russian phrases mean, though some are instantly recognizable, such as ~big robot~ when referring to the walkers. The sound effects are also cool, as the weapons of the future sound distinct and unique, while also lethal. Then there's the bombastic and lumbering musical score that wouldn't seem out of place in a Michael Bay movie. Each level has its own rousing theme to get you psyched for the battle ahead. And while the graphics engine hasn't really changed, that's not to say that this isn't a pretty game. Each battlefield has a unique feel to it, from the futuristic fortress that guards Gibraltar to the gutted remains of Berlin. You'll go from picturesque European towns and villages to being surrounded by sleek steel towers to the arid wastes of North Africa. There's plenty of scenery to soak in, but it's the attention to detail that's worth mentioning. The cool little grainy video feed you get when you're manning the gun on a transport or APC, the way your tech garbles when you're hit by an EMP pulse, or just the sensation of being surrounded by a raging battle on the ground and in the skies above you all greatly enhance the atmosphere. The look of the game is impressive, even if the technology behind it is no longer cutting edge. On a peculiar note, even though the world is ending in 2142, it appears that advertising will still be around. Battlefield 2142 features in-game ads, though we didn't get to see them firsthand during our testing. Still, there is a printed disclaimer that comes with the game telling you that Battlefield 2142 will analyze certain ~advertising data~ on your machine to determine what ads to display to you. Ironically, EA says that if you don't want your data shared with its advertising partner then ~do not install or play the software on any platform that is used to connect to the Internet.~ But that would pretty much defeat the purpose of playing Battlefield 2142, wouldn't it? Of course, you could always play single-player against the artificial intelligence, though the AI won't be mistaken for human opponents any time soon, and the single-player is still limited to 16-player maps. Still, this is an example of things to come, as we begin to see dynamic in-game ads appear in more and more games. When you get down to it, Battlefield 2142 is a solid entry in the series, as it feels like a slightly more refined version of its popular predecessor. Aside from the new Titan mode, there's not a lot new here, though, so this doesn't feel anywhere quite like the leap that Battlefield 2 represented from its predecessors--it's more akin to what Battlefield: Vietnam was to Battlefield 1942. Still, if you're looking for more multiplayer mayhem, it's hard not to recommend Battlefield 2142."}