{"ref": "https://www.gamespot.com/reviews/sonic-heroes-review/1900-6086165/", "date": "January 6, 2004", "game_name": "Sonic Heroes", "text": "When the folks at Sonic Team were in the process of creating the original Sonic the Hedgehog, they knew they couldn't beat Mario at his own game. So, instead of cooking up another hop-happy Mario clone, they focused their efforts on speed. As a result, one of the most visceral franchises of the 16-bit era was born. However, the transition from 2D to 3D was a hard one for Sonic, and the series lost a lot of its focus in the process by trading in speed for action adventure elements and introducing an unnecessary--and unnecessarily large--supporting cast of characters. Sonic Heroes strips away a lot of the elements that slowed down the Sonic Adventure backpedals on a lot of the design decisions made in the Sonic Adventure games, and though it still exhibits many of the camera and control issues that vexed Sonic's previous forays into 3D, it's truer to its 2D roots than any other 3D Sonic game before it. Sonic Heroes drops the adventure and picks up some speed. Sonic Heroes strips out a lot of the shooting and hunting stuff found in the Sonic Adventure games, but it retains the large cast of characters. The game gets away with this by giving you control of three characters at once and dividing the characters up into four different teams--Team Sonic, Team Dark, Team Rose, and Team Chaotix. Each team member has his or her own strengths, and your abilities as a team change depending on which character you have set as the team leader. The team members are color-coded for easy reference, so blue characters have the most speed, yellow characters can fly, and red characters can bust through blocks that are otherwise impenetrable. The game makes it easy to switch your team leader on the fly, and you can cycle through team members by simply pressing the X and Y buttons. There are times, such as when you're in the air, that you're unable to swap out your team leader, which can lead to some awkward moments. It generally works well, though, and once you've mastered the different team formation abilities, swapping out team leaders becomes like second nature. The inclusion of the four different teams, however, seems a bit pointless since the game is virtually identical for all four of the teams, save for some different story elements in between levels. To be blunt, no one cares about these peripheral characters that Sonic Team seems hell-bent on pushing on gamers. People play Sonic games to play as Sonic the Hedgehog. There's a little bit of light combat, which requires only a modicum of skill and strategy for proficiency, but for the most part, Sonic Heroes tries its hardest to recapture the hectic pace of the classic Sonic the Hedgehog games. You'll race down lots of narrow paths that are loaded with speed strips, corkscrews, and loops; you'll bounce off of strategically placed bumpers; you'll grind along miles of rails that seem to be suspended in thin air; and you'll frantically try to outrun pursuing enemies and rising lava levels. The different level themes, which include Sonic staples like the sandy beach, the sparks-and-fire factory, and the ever-popular casino-inspired pinball machine levels, will feel familiar to Sonic fans. The levels are loaded with lots of different paths that cater to the strengths of the different team leaders, thus allowing you to lean on whichever of the three team formations you feel most comfortable with. The level designs are pretty straightforward, though you'll occasionally find portions that aren't entirely intuitive. Moreover, it's likely that you'll find yourself plummeting into a bottomless nothing without any idea of what you did wrong more than once. The game's not terribly long, and most players should be able to wrap it up in around six hours. Fortunately, it is free of the bad action adventure filler that made up large portions of the Sonic Adventure games, thereby providing a more satisfying experience overall. When Sonic Heroes works the way it's supposed to, the action is fast and exciting. Unfortunately, the game suffers from a problematic, finicky camera, occasionally spastic controls, and some bad clipping. The camera is largely stationary, and since the action in Sonic Heroes doesn't revolve around wide-open 3D environments, this works most of the time. But, on the off chance that you want to get a better perspective of your surroundings before you make a potentially death-defying leap, the camera is pretty uncooperative and will snap to a first-person perspective if you try to move it more than a few degrees, which doesn't necessarily give you the best view of your surroundings. Additionally, the camera will often snap to a dramatic, faraway angle when you're running along a giant loop or performing some other grand maneuver. Furthermore, the game is inconsistent about the relativity of the camera position to the controls, so it can be hard to know if pushing up on the analog stick will keep you moving forward or if it will cause you to fly off of the track. Aside from these camera and control issues, clipping difficulties will invariably leave you wedged behind some piece of level geometry, or--even worse--you'll be pushed through a platform, thus leaving you to fall to your doom. All of these problems should be pretty familiar to players who have gone through either of the Sonic Adventure games. It's really disappointing that in the past four years, Sonic Team hasn't figured out how to alleviate these problems, especially since there's a fun game buried underneath all of them. Sonic Team also hasn't bothered to do much with the graphics engine that powered the Sonic Adventure games--and now powers Sonic Heroes--so the whole thing still looks like a glorified Dreamcast game. To its credit, though, the levels seem bigger than before, and the frame rate is rock-solid. The two-player game, which is basically a split-screen race through levels from the single-player game, doesn't run quite as smoothly, though at least the choppiness is consistent. It's not a technically exciting game to look at, but what it lacks in polygons, high-res textures, complex particle effects, and bump mapping, it makes up for with consistent art design and an exceptionally vibrant color palette that lets you know you're playing a Sonic the Hedgehog game, even when you're standing still. It's far from perfect, but Sonic Heroes is the best 3D Sonic game to come along so far. Sonic Heroes plays the nostalgia card heavily in the aural design, which features loads of familiar sounds, from the whirling speed-up sound to the different chimes heard when you pick up or lose rings. Of course, there's also a bevy of classic Sonic tunes. This sort of heavy reliance on old sound elements may seem a little cheap, but these sounds are inexorably linked to the Sonic experience, and ultimately, they still work. In fact, the biggest misstep in the sound design for Sonic Heroes is all of the new voice acting that was recorded for the game. There's a lot of preteen anime-grade voice work here, with Tails' squeaky, cutesy voice being the most ingratiating. However, since every single character will shout one of three or four different exclamations every time he or she executes an attack, you'll learn to abhor all of them in good time. Sonic Heroes is the closest that Sonic Team has gotten to doing a 3D Sonic the Hedgehog game in the classic 2D fashion. What's most disappointing is that the problems in Sonic Heroes--which include the camera, the controls, and the clipping--are the kinds of things that could be remedied with a few extra months of fine-tuning. In the end, though, it's still a purer, more action-packed Sonic experience than either of the Sonic Adventure games. If you were able to overlook the problems found in those games, Sonic Heroes is easy to recommend. However, if you haven't already been acclimated to the quirks of the 3D Sonic the Hedgehog games, approach this one with a bit of caution."}