{"ref": "https://www.gamespot.com/reviews/worms-open-warfare-2-review/1900-6179677/", "date": "September 21, 2007", "game_name": "Worms: Open Warfare 2", "text": "After spending a few years trying to transition the Worms franchise into 3D, it would seem that Team 17 has come to terms with the fact that its good-humored strategy series is simply more appealing in 2D. Worms: Open Warfare 2 for the DS and PSP does little to tinker with the established formula, but what it does hold over the original Open Warfare is more content. Worms: Open Warfare 2 seems totally comfortable playing to the audience that's already got a taste for its particular brand of turn-based strategy. This is most apparent in the gameplay, which plays almost identically to any of the 2D Worms games released over the past five years. With a four-pack of worms at your command, you take on up to three other teams of worms, inching your way across a craggy landscape and hurling both conventional and unconventional weapons at one another. Open Warfare 2 raises the number of weapon types to just over 30, bringing back classic munitions like the concrete donkey while introducing a number of new, ridiculous pieces of weaponry like the explosive buffalo of lies. While the worms themselves are the source of much of the game's charm, it's the weapons that make Worms fun, and the arsenal in Open Warfare 2 is solid. Fried, baked, boiled--there are so many fun ways to prepare worms. There are a few different single-player options to choose from. Most significant is the campaign, which sees you guiding a team of worms through a series of increasingly challenging scenarios. The idea here is that you're taking on enemies from throughout history, which in practice means you'll get to see a number of differently themed backdrops over the course of the campaign. The one interesting kink is the introduction of what are effectively boss battles, which end up flexing a different set of muscles than your usual Worms game. This is also true for the puzzle mode, where the challenge is to not only kill all the worms, but to do it with a very limited arsenal. The puzzle levels are often designed in such a way that there's a right way to do it, which is almost in direct opposition to the usually improv-heavy Worms gameplay. Setting the PSP and DS versions apart, each gets its own side game. The PSP gets a simple time attack mode where your goal is to reach an exit point on a level as quickly as you can. On the DS you get the laboratory, a collection of three minigames that make some rudimentary use of the DS touch screen and microphone. While there are hours of fun to be had in the campaign and puzzle modes, neither the time attack nor the laboratory amount to much more than brief distractions. A game against computer-controlled opponents is never as unpredictable and exciting as when you're playing against a live opponent, which makes the inclusion of online play to Worms: Open Warfare 2 such a significant addition. In addition to regular matches, you can play a simple variant called forts, where the landscape consists of two giant forts on opposite sides of the screen, and rope race, a fun little event where you have to show your prowess with the ninja rope by swinging your way across a level faster than your opponents. Interaction with other players on the DS is limited to simple buddy list and leaderboard options, while the PSP version features voice chat support, clan support, and a messaging system. Worms are always better when your friends also have them. What might be Open Warfare 2's biggest strength is its customization options. As is standard for the series, when you first start the game, you'll be asked to create your own custom team of worms. In addition to choosing the team name, individual worm names, voice samples, and gravestones, you'll choose a team fort, color, victory dance, and flag. While there are a number of preset options for each of these, there's a simple graphical editor that lets you create your own custom flag. While that's all superficial, there's also plenty of customization that affects the gameplay. You can create custom schemes, which let you tweak the game settings in a ridiculous number of ways, from the types of weapons you'll start off with to the severity of fall damage. Longtime Worms fans will likely be most thrilled to learn that Open Warfare 2 marks the return of a proper level editor to the series, which is simple and effective. On top of all that, there's an in-game shop where you can use points earned in the single-player game to unlock additional weapons, background themes, headwear for your worms, and more. Both versions of Open Warfare 2 trade in the familiar kind of crisp, cheery cartoon look that has been with the series for years now, though like the original Open Warfare, the PSP version wins by virtue of a bigger screen, whose horizontal orientation is simply a better fit for your usual Worms level layout. The controls feel fine on both versions, which means that if you can overlook the somewhat confining screen size on the DS, you'll still have some fun. Across the board, Worms: Open Warfare 2 is an improvement over the original Open Warfare. There are lots of weapons, plenty of single- and multiplayer content to dig into, and enough customization options to really hook established fans. At the same time, efforts to diversify the Worms experience aren't mind-blowing, and the game doesn't go out of its way to reel in new players."}