{"ref": "https://www.gamespot.com/reviews/delta-force-task-force-dagger-review/1900-2874508/", "date": "July 16, 2002", "game_name": "Delta Force: Task Force Dagger", "text": "While Red Storm Entertainment's Rainbow Six series often gets all the credit for establishing the tactical shooter genre, games like NovaLogic's long-running Delta Force series deserve some credit too. With a focus on real-world weaponry, long-range sniping, and quick kills, the early Delta Force games helped create a new level of realism in shooters. Nevertheless, the Delta Force series has since been left limping along the gaming wayside, surpassed by superior tactical shooters like SWAT 3, Operation Flashpoint, and Ghost Recon. NovaLogic's latest release, Delta Force: Task Force Dagger, simply can't compare with these games and marks a real step backward for the Delta Force series. It may sound like doublespeak, but NovaLogic is billing Task Force Dagger as a ~stand-alone mission pack~ for 2000's once-decent but now-dated Delta Force: Land Warrior. This seeming contradiction means you'll get the same fundamental game engine featured in Land Warrior, but with 25 new missions and a bunch of new weapons. Unfortunately, none of them are particularly entertaining. In Task Force Dagger, you head to Afghanistan to fight in missions inspired by Operation Enduring Freedom--which may suggest to some that NovaLogic is simply trying to profit from tragic real-world events. NovaLogic touts the game as a tribute to the heroes of the conflict, but Task Force Dagger simply treats the subject matter with cold, boring sterility. As far as story and setting go, it's one of the most uninvolving tactical shooters in a long time. In Task Force Dagger, you'll head to places like Kandahar, where you'll destroy SAM sites. In Mazar-e Sharif, you'll try to capture an enemy commander. In Bagh-e Daud, you'll try to rescue a journalist. Despite this seeming variety, many missions play the same: Approach a compound, snipe a bunch of guys who are just standing around, move in, blast a few remaining guys who are just standing around, and grab some documents or blow something up. The fact that you do most of these things without any AI companions is both dull and unrealistic. As for multiplayer, it's decent enough for a short spell but ultimately just the same sort of thing you've played many times before: capture the flag, king of the hill, deathmatch, and the like. Delta Force: Land Warrior is probably most remembered for its atrocious enemy AI. The utter ineptitude of your opponents often made the game feel more like a glorified shooting gallery than a true tactical shooter. Task Force Dagger offers little, if any, improvement to the AI. If the enemy beats you, it's only because they grossly outnumber you. They're brainless pushovers who yell out for no reason, only drawing attention to themselves, or who stand motionless when you shoot one of their buddies in the same room. You'll get to ~fight~ these enemies as one of 10 different Special Forces groups, like the US Green Berets or the British SAS. Each force has special abilities, like enhanced swimming (not exactly in demand in the mountains of Afghanistan) or the ability to withstand more damage (apparently Marines have thicker skin). Each group also has its preferred weapons, though how exactly these preferences affect gameplay is never made clear, since it's easy enough to hit targets with any weapon. The overall selection of weapons in Task Force Dagger is enough to make a firearms fanatic giddy--at first. You'll get an alphabet soup of killing machines, including the cutting-edge OICW combination assault rifle/grenade launcher. Then there are the M24 and PSG-1 sniper rifles, the M249 SAW, and the M16A2 assault rifle with 40mm grenade launcher, among others. You'll also get plenty of secondary weapons like the HK MP5SD6 submachine gun, the SOCOM pistol, and the LAW antitank weapon. You'll even get to call in air strikes in some missions. An interesting nonlethal tool at your disposal is live, overhead video footage of the mission area from unmanned aerial vehicles. With an admirable nod to realism and player preference, Task Force Dagger offers toggles for crosshair spread, scope drift, recoil, and even the effect of wind on ballistics. Unfortunately, the way the game handles weapons isn't quite as admirable. Task Force Dagger gives you so many firearms that it becomes difficult to even tell the difference between them. It would probably have been better to offer fewer weapons and more strongly emphasize their tactical differences. Also, the game gives you precious little control over throwing grenades, and you can literally switch weapons instantly--an astounding trick that real soldiers would surely love to learn. What's even more ridiculous is that bombs from air strikes explode with about the same force as a grenade. An explosion right near a guard tower will leave both tower and guard miraculously unscathed. On top of that, the game's physics suffer from a severe lack of realism. You can fall great distances without so much as a sprained ankle, and when you jump, you seem to actually float through the air. When prone, you can casually and quickly move sideways for hundreds of yards without getting fatigued. Task Force Dagger features the same core graphics engine found in Delta Force: Land Warrior. This means that you're going to get a game with some dated, problematic visuals. On the bright side, the engine can render sprawling outdoor levels. Then again, the game's textures appear simple and boring, generic buildings tend to be inexplicably devoid of furnishings, explosions can look downright silly, and the terrain shimmers like mad whenever you move. The audio won't win any prizes, either. When you fire a gun outdoors, it sounds like you're shooting inside a cave. Enemy voices carry too far and too clearly, and the commander who briefs you at the beginning of each mission sounds oddly bored--maybe he just finished playing this game. Delta Force: Task Force Dagger offers one or two vaguely entertaining features, like aerial reconnaissance, but in the end these things are buried under the weight of the game's many disappointing traits."}