{"ref": "https://www.gamespot.com/reviews/sunless-sea-review/1900-6416086/", "date": "April 3, 2015", "game_name": "Sunless Sea", "text": "The wonder that exploration brings within a game is finite. Once we discover something, we can never discover it again even if we start over. A world fully revealed is suddenly a more static place than when it started. It's at this nexus point between the potential and the static that Failbetter's Sunless Sea finds itself in. Though it sports an immensely imaginative setting and fantastic writing, Sunless Sea's roguelike-inspired elements don't quite gel with the longform exploration you're meant to embark on.Built in the mold of such games as Sid Meier's Pirates and Koei's Uncharted Waters series, Sunless Sea sets you loose on The Unterzee with a simple ship, a crew, some supplies, and a blank sea chart that slowly fills in as you explore the zee. That last bit is crucial to understanding where Sunless Sea's heart lies, as your primary instinct in this game will almost always be to sail for the black spots to see what's there. Your reward? A cavalcade of islands and shoreline settlements, each with their own secrets and stories to tell, which takes the form of expertly-written text which occasionally lets you choose how you react to what you find. If you can imagine The Legend of Zelda: The Wind Waker was a visual novel with resource management set in a series of twisted British colonies, you'd be in the ballpark of describing the bulk of the Sunless Sea experience.Of course, it's the intriguing setting that makes you want to explore in the first place. The Unterzee itself is a strange, scary place that combines the unknowable dread of the works of Lovecraft with the diverse, normalized weirdness of Dungeons and Dragons' Planescape setting. London has sunk underneath the Earth's crust and serves as the principal port for the varied inhabitants and societies of the ocean below. Hell is real, and it just had a revolution to exile its aristocracy. Ships have the option of going to the surface, where human society still thrives, but their crews risk exposure from the sun, which can be deadly for inhabitants of the Unterzee (most of whom appear to be human themselves). Three mysterious, powerful beings are worshiped as gods of the zee--Stone, Salt, and Storm--but their influence is so vague and cryptic that you may not even know they're acting. Indeed, should you ever find yourself stranded without food or fuel, you can pray to one of them to give you a boon to tide you over until you make port. That doesn't mean they'll actually answer, mind. Or if they will even be kind rather than cruel. Even positive responses can be treacherous, as praying to Stone for fuel has been known to drop stalactites of coal from the ceiling, crushing crew members in the process. The rich, nuanced backdrop that the Unterzee provides is just begging players to explore its darkest corners.The real terror underneath this backdrop, though, is an elegant resource management game clashing against your desire to press your luck by pressing into the unknown further and further from London. Fuel and supplies are of extreme importance because if one of them depletes, it's game over. You'll also have to manage a third resource: terror. As you sail, you crew will get progressively more nervous about sailing the weird, treacherous waters. And the further you move from London, the quicker it will increase. Other actions you take in the text portions of the game will also increase or decrease this value. Should it ever hit 100, your crew will try to mutiny and will kill you if you don't calm them down. Returning to London will reset this value to 50 if you're already higher than that, encouraging you to return home every so often. Managing all three of these variables creates a nice tension during your voyage and really informs how far you want to venture out during each trek. And there's nothing like realizing you planned poorly for a voyage as you quickly scurry home, barely making it before your fuel bottoms out.But the big payoff in Sunless Sea is in the exploration. While you're scouring the zee and wiping out the black little by little from your sea chart, you'll often stumble across islands with ports you can stop at. Each one treats you to several different visual novel-like scenarios, many of which are tied to quests that grant echoes (the game's currency), fuel, supplies, or even different kinds of valuable artifacts or other assorted kinds of unknowable knowledge represented as items. The islands themselves all have their own stories to tell, and you'll feel compelled to unravel each and every one. And though it's thrilling to find out how all of these stories connect and intersect, the best by far are the ones that tell the stories of the societies themselves. One island, Visage, forces you to wear an animal mask and play the part it suggests while you're in the city proper--a frog mask indicates a bumbling tourist type. Playing your part correctly is more important than being polite or not being disruptive. Frog masks who aren't clumsy and thoughtless are immediately booted from the island. In this way, Visage speaks volumes about social interaction as performance and its role in determining identity. Another island, the Empire of Hands, is cultural appropriation taken to the extreme. It's made up of sentient apes obsessed with obtaining souls of their own so they can ~uplift~ themselves and take their places as humans' equals, even mimicking a melange of other cultures' structures and practices. Thing is, there's really no evidence that taking souls actually works, so it may just literally be a case of ~monkey see, monkey do.~ Not all of the islands offer such fleshed-out cultures, but those that do isolate different aspects of our own culture and put them under a microscope.These transcendent moments inevitably fade, however, when you begin to grapple with the game's recursive structure. Dying doesn't end your journey, but rather initiates the beginning of a new captain's. You essentially start over with a new character, though you do get to carry over a portion of your previous captain's stats provided they were high enough as well as half of their Echoes, an officer, or their entire revealed seachart. And if you don't accept the latter, all the islands outside of the starting area are randomized and placed in completely different positions, forcing you to find them again. In this way, your journeys form a seafaring lineage of sorts equipped with the knowledge of past triumphs and mistakes, giving the game's structure a roguelike feel with a slight cushion whenever you bite the big one. The problem is this structure is a mismatch for Sunless Sea's slow pace. Exploring the zee is a very methodical process as you watch your ship slowly slide along the dark green water like a slug. Many quests involve you taking one or several doodads from one island to another, further limiting feelings of progression.And then there's the game's possible victory conditions, which crib from strategy games like Civilization without taking into account how quickly progression scales in them. You can go to zee for the joy of discovery and experience all you can so you can write your masterpiece, but you're put in an awkward position no matter how you position your new captain. If you start with a blank map, you'll have to spend each new start building up your resources again near home waters, which is time-consuming and monotonous. If you utilize a previous map, however, you don't get any new fragments--essentially experience--for landmarks you already discovered, which hamstrings progress towards meeting the prerequisites for victory. You need to cash in a large amount of secrets here (which let you level up stats, but also serve as a resource), which is awkward because you get a secret every time you get a certain amount of fragments and relying on a revealed map means not getting very many in that playthrough. Rather than creating interesting tension, these two scenarios just exacerbate the game's slow pace to intolerable levels. You can also win by acquiring a lot of money, but this victory condition sidesteps the most interesting parts of the game, instead pushing you to either care about finding the most profitable trade routes or find an exploitable, repeatable way to make some easy scratch. Finding your father's bones, which is the other victory condition, is by far the sanest way to experience Sunless Sea, which gives you a tangible main quest while also giving you the freedom to explore the Unterzee at your leisure.Which brings us to the fatal flaw in the game's structure: the diminishing returns inevitably associated with exploration. In roguelikes, the procedurally-generated dungeons ensure that you'll always have a different experience each time you play through the game, but the reason for that was as an ultimate test of mastery. You play until you die, learn from your mistakes, and then try to get further based on your personal growth. Sunless Sea tries to do a similar thing by mixing up the islands every time you die. Each playthrough will feature different discoveries at different times, often mixing up the order you visited them last time in the interest of keeping the world from that inevitable state of being static. The problem is that the content of the islands themselves never changes. Sure, you can pick different options when the game lets you, but for the most part, everything that happens on the islands is the same as before. You're not really dealing with an uncertain, dynamic ocean voyage so much as you're living in a salty version of Groundhog Day where you have very little agency to change things. And though permadeath can be turned off in the settings, the game still encourages you to play many different captains so that you can reset all the quests and reap more rewards as you go when all you want to do is unravel the game's secrets you haven't yet discovered.Sunless Sea is an ambitious work that attempts to capture the sheer kinetic thrill of discovery in a bottle without the inevitable entropy of player completion depleting it, and falls well short. The promise of lengthened replayability only makes the methodical pace a joyless grind at times. But the things you're meant to discover truly defines the best of Sunless Sea. The stories you'll be able to tell from your journeys--that time you helped those rat mechanics defeat a bunch of guinea pig nobles; the creepy place you found yourself after sailing off the edge of the map; your continued struggles with managing your cannibalism--truly makes Sunless Sea a voyage worth taking for those with the patience to deal with the litany of structural issues. In asking how games can tap into our desire to discover, Sunless Sea proves that what we discover matters at least as much as how much we can discover."}