{"ref": "https://www.gamespot.com/reviews/story-of-seasons-friends-of-mineral-town-review-wh/1900-6417494/", "date": "July 14, 2020", "game_name": "Story of Seasons: Friends of Mineral Town", "text": "Harvest Moon, and now Story of Seasons, have thrived on their personality above all else. With each entry in the series offering fresh story and minimal improvements to gameplay, replaying one of the older titles is asking for disappointment, even if it has a new coat of paint. Story of Seasons: Friends of Mineral Town brings the 2003 Game Boy Advance title into 2020 with enjoyable cutesy graphics and personality, but does little to add depth to the already outdated gameplay..After choosing from an extremely limited set of character customization options, you set out to take over a farm left to you by your late grandfather, where you once spent the summer 20 years ago. It's unclear why your character left whatever life they had behind, but you are quickly thrust into the day-to-day work of maintaining a farm, starting with crops.Growing crops is one of the main methods of making money, but progression is slow. You can't improve your crop yields in any meaningful way until the option to buy better farm soil becomes available in the second year, which is 25 to 30 hours into the game. Upgrading the watering can allows you to tend to more crops at once, but the increased stamina usage makes for minimal improvement to your crop yield.Upgrading tools improves your ability to farm slightly, but the best way to maximize crop output is through the Nature Sprites that live in the town. Tucked behind the church, seven Sprites live in a hut, waiting for you to make friends with them. You gain their trust by speaking with them and giving them gifts that they like, similar to befriending people in town. Once a certain level of friendship is reached, you can request they help with one of three farm chores: watering crops, picking crops, and caring for livestock.The catch here is that the Sprites aren't very good at these chores to start with and need to be trained through playing minigames. Each chore has a corresponding minigame; the watering minigame and livestock minigame are both enjoyable, entailing tile memorization and frantic chicken feeding respectively, while the crop-picking minigame is a glorified button masher. But because you need to play the minigames dozens upon dozens of times to make meaningful progress, the novelty of them wears off quickly. And because all seven Sprites need to be leveled up individually, you could spend the majority of your playtime repeating these minigames with little in the way of a reward.There are no overall goals or quests for you to work towards, which leaves you lost as to exactly why you're putting all this effort into the farm except for personal satisfaction and the promise of getting rich. Your actions and progression have little impact on Mineral Town and the Nature Sprites, lessening the sense of accomplishment you could get from turning the abandoned land into a thriving farm.Farming isn't the only moneymaking avenue, as you can also spend your days mining and fishing. Unfortunately, neither activity pays very well nor are they actively enjoyable to do. Successful mining is based entirely on luck and an abundance of stamina recovery items. Every floor has a bunch of rocks you can break to try to find ore. The only way to progress further into the mine is by using a hoe on the dirt, and there's no indication of where the ladder might be. Using the hoe drains your stamina, and if you aren't lucky, you could easily waste the majority of your stamina bar searching for the way to descend, sending you out of the mine empty-handed and frustrated.Upgrading your hammer and hoe doesn't improve your mining skills, and there aren't checkpoints in the mine, so you have to start from the first floor every run. The ore itself doesn't sell for very much and you don't need more than a handful of each to upgrade all of your tools. Gems are worth more but can only be found in the lake mine, which is only available during winter. You never improve at mining and the payout doesn't make up for needing a ton of stamina items to get into the lower levels.In the same vein as mining, fishing is based mostly on luck. While upgrading the fishing rod does increase your chances of getting bigger and better fish, the entire mechanic is based on waiting for an exclamation point and pressing the action button, which isn't engaging and quickly becomes dull. If done correctly, you might catch a fish. Or a branch. Or a can. Or the fish might get away. All of this is a roll of the dice, on top of a mechanic that is fairly mind-numbing to start with. There are different species of fish that you can catch, but their sell value is only dependent on their size--small, medium, or large--which defeats the purpose of any species variety.Farming isn't the only moneymaking avenue, as you can also spend your days mining and fishing. Unfortunately, neither activity pays very well nor are they actively enjoyable to do.All of these activities are mainly there for the purpose of earning money, one of the primary barriers to progression. Nothing in life is free, and nothing in Friends of Mineral Town is cheap. Upgrading tools, farm buildings, and your house all cost thousands of in-game dollars, which is hard to come by for the majority of the first year. With crops yielding produce on a weekly basis and other income avenues not paying nearly as much, purchasing anything becomes a big decision, one that happens far too infrequently to keep you interested.Animals are equally expensive, to the point where you don't break even on the investment for at least one year. In addition to being a financial burden, the game discourages its own system of getting more animals for cheaper prices. While it costs less to impregnate a cow than it does to buy one, there are four variants of cows, and getting one pregnant just duplicates it, so all four variants must be bought at full price if you want to produce all four types of milk.Friends of Mineral Town really shines the most in the moments between the struggle for financial solvency. Mineral Town is quaint, full of characters that are full of personality and character. The majority of characters are tied to one of the many shops around town, most of which feature unique family dynamics that unfold for you as you become more acquainted with the townsfolk. The friendship system is the same as for the Nature Spirits, with daily gifts and interaction progressing friendship levels. Running around town to give out gifts to people is tedious and time-consuming, but the story scenes are more than worth it, offering interesting and funny insights.The bachelors and bachelorettes of Mineral Town also have a separate heart meter, that unlocks character events after reaching certain milestones. The events are tailored to each character and typically involve their family life and opportunities for you to side with them to gain bonus points. These play out like an enjoyable soap opera that provides light-hearted drama at every turn.Mineral Town captures the feeling and look of a happy small town well, and the moments spent with the people in town almost make the tedious work worth it.All romanceable characters have distinct personalities, likes, and dislikes--even the town doctor, fittingly named Doctor. The dialogue repeats frequently, usually dependent on relationship levels and location of the character. Despite this, each character speaks with distinct slang and style, which makes them feel unique. The game's charming art style and design create the feeling of pleasantness that interacting with townsfolk should. Mineral Town captures the feeling and look of a happy small town well, and the moments spent with the people in town almost make the tedious work worth it.Throughout each year, town events take place, ranging from horse derbies to cooking contests and even chicken fights. While these events are colorful and showcase the town, in the first year you frequently get sidelined for not having the proper upgrades or animals to participate, which is frustrating. The organizer of the event will usually guilt trip you in advance for not being able to participate, adding to the frustration.After an entire year has passed, new items and upgrades become available to you, but the timing of these items can be inconvenient. In Spring of Year 2, strawberry seeds become available in the general store, but not until halfway through the season. Strawberries produce multiple yields from one plant, so planting them halfway through the season feels pointless and you instead have to wait an entire year to actually plant them. Other issues, like the general store being closed the first two days of the season occasionally--so you can't buy that season's seeds until three days in--are frustrations that serve no real purpose.Story of Seasons: Friends of Mineral Town feels closer to a remaster than a remake, with the majority of in-game mechanics feeling antiquated by modern standards. Shallow systems combined with inflated upgrade prices makes progress a slow trudge, with the rewards rarely feeling worth it. Interacting with the people of Mineral Town offers a nice, romantic look at small-town farm life, but the rest of the game fails to sell it."}