{"ref": "https://www.gamespot.com/reviews/diluvion-review/1900-6416618/", "date": "February 17, 2017", "game_name": "Diluvion", "text": "Diluvion is in that most tragic class of disappointing game: the kind with great ideas. There's so much to love and appreciate on the surface that the game's profound awkwardness and convoluted mechanics just hurt to experience.It presents an unusual take on a post-apocalyptic society where humanity doesn't go to space or live in the nuclear wastes. Instead, they're forced to build civilization anew underwater, with steampunk-inspired submarines and habitats as their only means of shelter. Humanity's only hope of breaking through the oppressive ice above is a godlike ancient artifact lying at the bottom of the ocean.As the captain of your own tiny vessel, you are tasked with recruiting a capable crew, building a ship strong enough to withstand the crushing ocean depths, and locating the powerful artifact before anyone else. As you creep your way to the bottom of the ocean, you'll often have a checklist of parts to grab, people to see, and enhancements to make. Much of your journey is spent scavenging supplies and key items in uncharted danger zones infested with landmines and sea creatures--and it's hard not to be affected by seeing how many other vessels tried and failed to infiltrate the same areas. One of the more chilling commonalities along the way is finding merchants who were stranded in isolated areas, waiting for someone to come along to give them the jump they needed to escape.The game is at its unnerving best when it sends you into near-pitch blackness, with only the comfort of sonar to light the way toward your objective. Missions may be as simple as raiding a derelict ship, but even that might turn into a much different, frantic scramble away from unexpected danger. Being underwater, nothing in the world is particularly fast, but the management of resources to optimally escape a dangerous situation delivers great tension.Thankfully, Diluvion isn't always fear and dread. The journey's gentle pace leads you to treasure every new landmark you come across--many awe-inspiring in either scale or design. Towns are elaborate wonders of construction. Most checkpoints are man-made structures overtaken by ice or algae. Diluvion's most notable accomplishment is its score, a beaut symphony that haunts every mile you journey in-game, accentuating the wonder in one scene, ratcheting up the tension in another. The more shallow sections of ocean are bright, wondrous places that you can find yourself wandering around aimlessly with a sense of peace and calm.The ancillary, narrative experience of Diluvion is a fine one. It's the act of actually having to play the game that causes the whole thing to dissolve.Interacting with other characters takes on a lighter tone, with the view switching from the artfully rendered 3D ocean to 2D when docking at towns or with other subs. There's an element of repetition here, since many of the stock NPCs are copy-pasted throughout the entire game, and most of them are interactive only to issue random grunts and sighs. The ones who do talk, however, speak in snappy, often funny lines of dialogue, with more than few characters worthy of endearing themselves over time--especially your erstwhile crew, who will interact not just with their captain but with each other when they're docked. The relationships tend to fall by the wayside as exploration ramps up, but it's always welcome when the game takes a breath and allows your helmsman to give the history of a new area or lets your crazy gunner talk rings around the submissive sonar expert. The ancillary, narrative experience of Diluvion is a fine one. It's the act of actually having to play the game that causes the whole thing to dissolve.Diluvion is marred by unintuitive controls and one of the most needlessly convoluted user interfaces in recent memory. This is a problem that truly shows its ugly face when your sub is forced into a fight. Your attack options are limited to begin with: you can fire shrapnel--or later on, homing torpedoes--at your enemies, and maneuver slowly around them. That's about the extent of your tactics, and in practice, most naval battles in the game resemble less Assassin's Creed: Black Flag than a toddler crashing two submarine toys against each other going pew-pew! before eventually deciding one of them gets to win. Boss fights are well conceived, but once the initial shock of many of the creature designs fades away, you're left with the fact that all these problems multiply in the face of larger enemies. More powerful gun upgrades help later, but combat in general is a slapdash affair that builds dread for the wrong reasons.When you're not fighting, you're exploring. You'll get a constant, easy-to-follow list of tasks for every mission, most of which just revolve around traveling to an unknown area and scanning for a particular type of resource. Errand-running aside, the game completely flounders when it comes to the actual act of navigating Diluvion's vast ocean. There is an in-game map that doesnt actually show the player's location relative to any of the landmarks they've visited. Your waypoint function is a school of golden fish who come to help only when they feel like it and often swim through walls--something you cannot do. Checkpoints are frequently miles away from where you've traveled, and running out of air during the journey back is something that occurs frequently until you invest the hefty funds required to buy a new air tank. Occasionally, even if you are able to reach a specific location, the game has a nasty habit of not telling you that you need to hear a specific conversation before a particular event is actually triggered.For every one fresh, intriguing, and delightful element Diluvion brings to the table, the act of getting to experience any of it is an exercise in frustration. These are the problems that plague Diluvion, and far too often, the persistent state of your sub is hopelessly lost. The game tries to make you do some actual navigational heavy lifting, which is admirable, but you're stuck with a limited pool of resources (like air and food for the crew) that restrict how long you can spend out in the unknown before desperately needing to refuel.And therein lies the true tragedy of Diluvion. For every one fresh, intriguing, and delightful element it brings to the table, the act of getting to experience any of it is an exercise in frustration. And while the story answers the questions posed at the outset, more often than not those answers arent worth the Sisyphean effort it takes to find them."}