{"ref": "https://www.gamespot.com/reviews/final-fantasy-anniversary-edition-review/1900-6173084/", "date": "June 25, 2007", "game_name": "Final Fantasy", "text": "This is where it all started. The original Final Fantasy appeared on the Famicom in Japan 20 years ago and reached American shores three years later. Since then, it has appeared on a variety of systems, most recently as part of Final Fantasy I & II: Dawn of Souls on the Game Boy Advance. As a piece of nostalgia, Final Fantasy Anniversary Edition is a decent romp through a true classic, where random encounters rule and fetch quests are a way of life. If you haven't played it yet and can set aside modern expectations, you'll probably get a kick out of the earliest Final Fantasy game. The ci-ir-cle. The circle of life. On the other hand, if you have played it on another platform, there aren't enough extras here to make it worth another purchase, especially for a $30 price tag. The visuals are the obvious enhancement, and at least in this regard, FF lovers won't be disappointed. Backgrounds and characters are rendered in crisp, colorful detail. Some small touches are bound to catch your eye, such as the shadows of passing clouds moving across your view. Of particular note are the new boss designs: Marilith has never looked so gruesome. It's still the same 2D look, so you won't be blown away, but it's easy to appreciate the high resolution and clarity of the new sprites, as well as the environments. In other words, it's exactly what you would expect a PSP version of the first Final Fantasy to look like. The soundtrack has also been enhanced with better quality recordings. They're still synthesized, but they're nice re-creations of the tunes you may have heard hundreds of times already. There's an additional dungeon in this version, which is rather hard compared to the surrounding gameplay. You'll also be treated to the four extra dungeons featured in Dawn of Souls. But more random encounters and a shiny coat of paint do not add all that much value, especially when the game has been packaged with its sequel for other systems already. This is a remake of a remake of a remake of a remake, which is fine if you're aching for a trip down memory lane and dont already own the game in another package. But if you've got the GBA or PlayStation iteration, this stuff isn't going to quite do it for you. The game itself doesn't hold up terribly well in this day and age, but for patient gamers who know what they're in for, it manages to be fairly enjoyable. The Final Fantasy brand may be synonymous with great stories now, but you won't find one here. It's got the bare essentials: four heroes seek four crystals to fulfill a prophecy and save the world. This means you guide your heroes from quest to quest and area to area, fighting endless legions of random monsters until you reach eventual glory. Plenty of humor keeps things from getting too dry, but you shouldn't expect a deep narrative: This is role playing at its most basic. Newcomers may be surprised by the openness of the world. You'll spend a lot of time wandering, boating, and air-shipping aimlessly until you find your destination. Not that any of it is real downtime: You will be constantly attacked every four or five seconds during your travels, so if you're bothered by random encounters, you'll find Final Fantasy I especially frustrating and tedious. Also, there's no quest log, so you need to talk to as many non-player characters as possible and pay attention to every bit of dialogue to keep yourself on track. The questing is relatively intimidating if you haven't already experienced it. It's all fun and games until someone loses an eye. However, the combat isn't as daunting, though some purists might long for the battle system of the original release where party members could waste an attack on an enemy that was already defeated. Like prior remakes, the Anniversary Edition reassigns such attacks. It makes battling in this version relatively easy and magnifies how simple the system is by modern standards. You can attack, cast spells, or use items, but you don't have to worry about any fancy leveling schemes or special moves. It's also not that strategic because the turn order is kept secret, making it easy to waste a sleep spell on a single remaining enemy or a defensive spell that is never needed. Yet, as simple as it is, it's still solid enough to keep you gunning for a better sword, the next spell level, or a better piece of armor. Whether or not Final Fantasy Anniversary Edition is worth playing depends on your expectations. Like most anything viewed through the rose-colored glasses of nostalgia, Final Fantasy I was better in the past than it is now. If all you want to do is relive the good old days in widescreen purity, you'll get 40 or more hours of merry reminiscing out of it. On its own, it's all right, but there are more interesting RPGs on the PSP."}