{"ref": "https://www.gamespot.com/reviews/phantom-brave-review/1900-6105962/", "date": "August 27, 2004", "game_name": "Phantom Brave", "text": "Phantom Brave is the third strategy role-playing game from developer Nippon Ichi Software that the PlayStation 2 has seen in the space of a year, though, interestingly, it's the first to be self-published by the company. Those familiar with Phantom Brave's predecessors, Disgaea: Hour of Darkness and La Pucelle: Tactics, will find that this latest game is unmistakably similar in many ways. For example, the game's anime art style, presentation, and structure are all very much akin to Nippon Ichi's previous works. Phantom Brave has its own unique premise and plenty of original gameplay twists, but it nevertheless feels like familiar territory--too familiar, perhaps, if you've already poured dozens or hundreds of hours into building up your characters in those other games. At any rate, this latest game is charming and entertaining in its own right, though its appeal is mostly limited to hardcore fans of other strategy role-playing games and anime. The makers of Disgaea and La Pucelle are at it again--here's another charmingly cute, frightening complex strategy RPG to dig into. Strategy RPGs like Phantom Brave represent a very specific type of game in which you fight your way through one isometric-perspective battle after another, taking turns with your opponents as you move your fighting forces around a map, attacking foes, and healing your allies. Some of the particular mechanics of Phantom Brave are very unusual, but the core gameplay here is well-worn. Like Nippon Ichi's previous games, the strategy in Phantom Brave often takes a backseat to the necessity for RPG-style leveling--that is, no matter how ingenious of a tactician you may think yourself to be, unless your fighting forces are of a sufficiently high level for a given battle in the game, you're pretty much guaranteed to lose handily. So the best ~strategy~ in Phantom Brave is, actually, just to spend lots of time repeating battles over and over, thereby gaining more experience points and stronger abilities for your characters. To facilitate this, you can revisit any of the maps you've fought in as often as you like, and you may also freely teleport yourself to randomly generated dungeons to fight in (once a particular type of character has joined your group). Phantom Brave has an interesting story that can make the requirement of having to go out of your way to level up somewhat frustrating, since you'll want to keep proceeding from mission to mission in order to find out what happens next. The game's focal character is a young girl named Marona, who's eternally optimistic yet spited by society for being ~possessed~--a reputation that's not entirely unfounded, since she travels with a mostly invisible guardian, Ash, who once was a young warrior but became trapped in limbo between life and death. Marona can summon Ash to fight for her, and she gradually gains the ability to summon many other types of phantoms. She uses these powers to make money by taking mercenary-style jobs from people. Marona and Ash meet numerous odd characters on their journey, and in typical anime fashion, there's a lot of inner monologue to listen to and secrets waiting to be discovered as the tale unravels. The story is told mostly through meticulously animated sequences using 2D character sprites, and the story sequences themselves have full English voice-over (the original Japanese language track is also available for purists' sake). There's a lot of story to wade through in Phantom Brave, and it's paced quite slowly (you need to keep pressing the X button to advance the dialogue), but the characters are endearing and the story itself is often amusing, and so it helps keep you motivated to keep fighting. Don't let the cuddly graphics fool you. This game takes a while to wrap your head around, much less to finish. It seems that every strategy RPG from Nippon Ichi has to have a particular abstract twist to its gameplay. In Phantom Brave's case, that twist is Marona's ability to ~confine~ phantoms to certain objects. She cannot simply summon her allies into battle; she must instead target objects in the environment--anything from rocks to shrubs to weapons--and confine phantoms into them, which causes Marona's colorful band of phantom warriors, monks, magic users, monsters, and more to materialize in place of the object. You may then control these characters when their turn comes up, though be careful--each phantom has only a limited number of turns to spare before he, she, or it automatically dematerializes and can no longer be used in that battle. Marona may use her confine ability as many times as she wants to during a single turn, but since she can only bring a limited number of phantoms into battle, it becomes strategically important to ration your forces as you move your way across the map. What's also interesting is that, it depends on which type of object you confine your phantom into, because your phantom's core attributes will be affected in various ways. For example, phantoms confined to rocks will be tougher and stronger yet slower than usual. Phantoms confined to certain types of plants will, for whatever reason, be more intelligent or maybe faster. There's more weirdness to Phantom Brave, of course. The way you get more phantoms in your party is, you (as Ash) just ask Marona to make them. As you fight and win battles, more types of phantoms will become available to you, and you can choose to create them with a higher starting experience level (for a fee), or just start them out at square one and hope they survive some battles so that they can get up to speed with the rest of your crew. Another type of character can be asked to fuse different phantoms and/or items together into potentially stronger or different phantoms or items. Meanwhile, all the items themselves have levels. Characters may only have a single item equipped at a time, and regardless of whether that item is a sword or a bush or a book, the item can serve as a weapon--often with its own unique abilities. Confining phantoms to trees and rocks? Sure, sign us up. The esoteric design doesn't stop there. Much like in Disgaea, characters in Phantom Brave may pick up pretty much anything. For instance, you can grab an enemy and throw him off the side of the map or maybe use him as a weapon. You'll also need to keep a sharp lookout for objects on each map that offer what's called ~protection~--stat boosts or other special abilities linked to those objects. Destroying the source of the protection is key when fighting protected enemies. However, if you're on a map where protection is being cast on regular objects, you may confine your phantoms to those objects to get their beneficial effects for that battle. Also, unlike in Disgaea and La Pucelle, the turn-based system in Phantom Brave is based on the initiative of each of the characters in battle (as opposed to a strictly turn-based system in which you get to move all your characters in any order, then all the enemies get to move, and so forth). Faster characters get to move further and more frequently, which intuitively make sense--in contrast to many other aspects of the game--and it adds still another tactical element to the combat. Phantom Brave has some complex and interesting gameplay, and it also has some mechanical problems that get in the way of that gameplay and drag the pacing down. Not only is this the first among Nippon Ichi's crop of games to feature an initiative-based turn system, but it's also the first one that doesn't play out on a gridlike battlefield. Here, characters may move freely during their turns, and the range of their movement is represented by a colored circle surrounding them; the farther away the edge of the circle is, the farther the character can move. The problem with this system is that it's difficult to get a good feel for how to properly position your characters. In other strategy RPGs that use grid systems, it's always very clear how an area-effect attack will impact your foes, or whether or not you'll be able to move past a group of foes in close proximity. In Phantom Brave, it's all kind of a mess. Close-quarters battles invariably become annoyingly cluttered, as tons of characters run up against each other and slug it out. Unlike in previous Nippon Ichi games, the bodies of defeated characters don't just vanish in Phantom Brave, which ought to be a good thing; however, it just adds to the confusion here, since it can be hard to tell the living from the dead in some cases. The combat has sort of a slapdash feel to it in general. Strategy RPGs are supposed to feel tight and methodical, and predictable in how positioning and tactics on the battlefield will affect the outcome of the fight. In Phantom Brave, it can be hard to tell what's going on and what kind of trouble you're actually in at any given point. Invariably, as the story progresses and the battles become more challenging, you'll end up using trial and error in order to figure out how best to tackle each puzzlelike mission. The flow of the gameplay just isn't particularly quick, either. Having to nudge each character into what seems like the proper position to best attack his or her enemies can take a good few tries (at least you can cancel a move order if you don't end up positioning your character correctly), and having multiple characters to deal with in such a fashion can be a pain. For what it's worth, the enemy puts up a challenging fight. Though foes still act brain-dead sometimes, much like they did in Disgaea and La Pucelle, they'll usually do what they should: concentrate on beating up the weakest, closest members of your party. The combat could have felt a lot tighter, but it's still interesting. Phantom Brave doesn't have too much flash, but it's a good-looking game, and it features charmingly drawn and animated anime-style characters, despite the way in which the graphics can clutter up the screen during gameplay. The voice-over is probably the highlight of the game's audio--it's of the quality you'd expect from a typical cartoon show, and the inclusion of the Japanese language track is a nice touch. The game's sound effects, on the other hand, are mostly lifted straight from La Pucelle and Disgaea and contribute heavily to sense of dj vu you'll get from it if you've played those other games. The music is also very similar, with its heavy use of synthesized, whining strings. The music can actually get pretty irritating, as it loops multiple times during the course of a drawn-out battle; but, fortunately, you can turn it down. There's a lot of creativity in Phantom Brave, and the audience for whom it's intended will enjoy it for the most part. You could easily end up spending lots and lots of time digging into this game's complex mechanics, character classes and systems, and building up a pack of fighters who started out dealing a few dozen points of damage per attack, but eventually can crush their enemies for tens of thousands of points. That may not sound terribly exciting in theory, but in practice, it can hook you pretty easily and for many hours, especially if you haven't already had your fill of Disgaea and La Pucelle. There's more weirdness to Phantom Brave, of course. The way you get more phantoms in your party is, you (as Ash) just ask Marona to make them. As you fight and win battles, more types of phantoms will become available to you, and you can choose to create them with a higher starting experience level (for a fee), or just start them out at square one and hope they survive some battles so that they can get up to speed with the rest of your crew. Another type of character can be asked to fuse different phantoms and/or items together into potentially stronger or different phantoms or items. Meanwhile, all the items themselves have levels. Characters may only have a single item equipped at a time, and regardless of whether that item is a sword or a bush or a book, the item can serve as a weapon--often with its own unique abilities. Confining phantoms to trees and rocks? Sure, sign us up. The esoteric design doesn't stop there. Much like in Disgaea, characters in Phantom Brave may pick up pretty much anything. For instance, you can grab an enemy and throw him off the side of the map or maybe use him as a weapon. You'll also need to keep a sharp lookout for objects on each map that offer what's called ~protection~--stat boosts or other special abilities linked to those objects. Destroying the source of the protection is key when fighting protected enemies. However, if you're on a map where protection is being cast on regular objects, you may confine your phantoms to those objects to get their beneficial effects for that battle. Also, unlike in Disgaea and La Pucelle, the turn-based system in Phantom Brave is based on the initiative of each of the characters in battle (as opposed to a strictly turn-based system in which you get to move all your characters in any order, then all the enemies get to move, and so forth). Faster characters get to move further and more frequently, which intuitively make sense--in contrast to many other aspects of the game--and it adds still another tactical element to the combat. Phantom Brave has some complex and interesting gameplay, and it also has some mechanical problems that get in the way of that gameplay and drag the pacing down. Not only is this the first among Nippon Ichi's crop of games to feature an initiative-based turn system, but it's also the first one that doesn't play out on a gridlike battlefield. Here, characters may move freely during their turns, and the range of their movement is represented by a colored circle surrounding them; the farther away the edge of the circle is, the farther the character can move. The problem with this system is that it's difficult to get a good feel for how to properly position your characters. In other strategy RPGs that use grid systems, it's always very clear how an area-effect attack will impact your foes, or whether or not you'll be able to move past a group of foes in close proximity. In Phantom Brave, it's all kind of a mess. Close-quarters battles invariably become annoyingly cluttered, as tons of characters run up against each other and slug it out. Unlike in previous Nippon Ichi games, the bodies of defeated characters don't just vanish in Phantom Brave, which ought to be a good thing; however, it just adds to the confusion here, since it can be hard to tell the living from the dead in some cases. The combat has sort of a slapdash feel to it in general. Strategy RPGs are supposed to feel tight and methodical, and predictable in how positioning and tactics on the battlefield will affect the outcome of the fight. In Phantom Brave, it can be hard to tell what's going on and what kind of trouble you're actually in at any given point. Invariably, as the story progresses and the battles become more challenging, you'll end up using trial and error in order to figure out how best to tackle each puzzlelike mission. The flow of the gameplay just isn't particularly quick, either. Having to nudge each character into what seems like the proper position to best attack his or her enemies can take a good few tries (at least you can cancel a move order if you don't end up positioning your character correctly), and having multiple characters to deal with in such a fashion can be a pain. For what it's worth, the enemy puts up a challenging fight. Though foes still act brain-dead sometimes, much like they did in Disgaea and La Pucelle, they'll usually do what they should: concentrate on beating up the weakest, closest members of your party. The combat could have felt a lot tighter, but it's still interesting. Phantom Brave doesn't have too much flash, but it's a good-looking game, and it features charmingly drawn and animated anime-style characters, despite the way in which the graphics can clutter up the screen during gameplay. The voice-over is probably the highlight of the game's audio--it's of the quality you'd expect from a typical cartoon show, and the inclusion of the Japanese language track is a nice touch. The game's sound effects, on the other hand, are mostly lifted straight from La Pucelle and Disgaea and contribute heavily to sense of dj vu you'll get from it if you've played those other games. The music is also very similar, with its heavy use of synthesized, whining strings. The music can actually get pretty irritating, as it loops multiple times during the course of a drawn-out battle; but, fortunately, you can turn it down. There's a lot of creativity in Phantom Brave, and the audience for whom it's intended will enjoy it for the most part. You could easily end up spending lots and lots of time digging into this game's complex mechanics, character classes and systems, and building up a pack of fighters who started out dealing a few dozen points of damage per attack, but eventually can crush their enemies for tens of thousands of points. That may not sound terribly exciting in theory, but in practice, it can hook you pretty easily and for many hours, especially if you haven't already had your fill of Disgaea and La Pucelle."}