{"ref": "https://www.gamespot.com/reviews/gran-turismo-4-review/1900-6118988/", "date": "February 22, 2005", "game_name": "Gran Turismo 4", "text": "Not many game series can be referred to as genre-defining, but in the world of console racing games, Gran Turismo fits the bill. Since 1998, the GT series has aimed to bring the vivid world of auto enthusiasm to your PlayStation and PlayStation 2 through a combination of realistic driving physics, massive car rosters aimed at pleasing the obsessive collectors in all of us, and courses from around the world, all topped off with state-of-the-art graphics and sound presentation that's redefined the technical capabilities of the console each title has appeared on. With the fourth installment in the series, the aptly named Gran Turismo 4, we find the franchise at the peak of its quantitative powers in a game that makes superlatives such as ~big~ and ~sprawling~ seem somehow inadequate. Yet beneath all the considerable content, Gran Turismo 4 remains remarkably similar to previous iterations in the series, which, depending on your point of view, may or may not be a good thing. If you can't find your car here, chances are it's because your car sucks. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Gran Turismo 4 Video Review Gran Turismo 4 features more than 700 cars from more than 80 manufacturers. As you might expect, the lineup leans heavily toward American, Japanese, British, and German makes, though you'll also have access to cars from Belgium, Spain, the Netherlands, Sweden, and Korea, among other countries. This variety is not simply limited to country of origin, however. The cars found in GT 4 range not only in their power and prestige, but also in their ages. The game features cars from every major era of auto manufacturing: from 1960s muscle cars, to powerful Japanese turbo machines of the mid '90s, to one-off concept cars that won't see city asphalt for 10 years or more, to examples from the very dawn of the auto era (such as the Ford Model T and the Daimler Motor Carriage from 1886). While the game's roster is impressive both in its size and scope, it must be said that a good portion of the cars, such as the aforementioned Daimler, won't be of much use to you in terms of progressing in the game. Indeed, as you move through the career mode, known as Gran Turismo mode, you'll quickly find your garage piling up with cars from race and series wins; their only value to you will be as resells. On the plus side, a dramatically improved garage interface will let you quickly and easily sort through your car collection, no matter how large that collection becomes. Sorting through criteria such as country of origin, drivetrain, manufacturer, or power-to-weight ratio is a huge improvement from scrolling down an ever-elongating list while hoping to spot your car of choice based on model alone, as was the case in previous GTs. The available cars, of course, are only part of the attraction of GT4. The game also features more than 50 courses to drive, including a tantalizing mix of real-life racetracks such as Fuji Speedway, Suzuka, and Laguna Seca; a cosmopolitan array of city courses from metropolises such as Hong Kong, Seoul, and the Big Apple; rally courses on dirt and (new for this installment) snow and ice; and old fictional friends such as Grand Valley Speedway, Deep Forest Raceway, and Trial Mountain. Two particularly notable additions to the GT4 track roster are El Capitan, a three-mile behemoth designed around the imposing granite centerpiece of Yosemite National Park, and the Nrburgring Nordschliefe, which, at nearly 13 miles long, is imposing in its own right. The Circuit de la Sarthe, the annual site of the 24 Hour of LeMans race, makes an appearance in two flavors: the current track and the old configuration, which is thankfully free of the chicanes that currently mar the four-mile back straight. Detailed car models, gorgeous lighting, and an intense sense of speed... GT4 is the new PS2 standard-bearer for graphics. Beyond these impressive stats, the first thing any casual fan of the GT series notices are the graphics. The earlier GT games defined the technical reach of the PlayStation across two consoles, and this reach extends here. Car models look fantastic, and though only six cars are on-track at any time, the game suffers zero slowdown, even when things pile up in the corners or during drastic elevation changes. Lighting effects that were impressive in Gran Turismo 3 are stunning in GT4, both in terms of technical achievement (such as in the real-time reflections on car doors) and artistic aesthetic (the luminous George Paris street track or the neon-drenched section of the Hong Kong city course). The game only features three points of view when driving--and there is no cockpit view--but a tangible sense of speed is conveyed by all three angles. Small graphical touches this time around include 3D crowd models, which are most noticeable during the rally stages. Spectators will run out on the course to take pictures of your oncoming vehicle. Then they'll scurry out of the way at the last moment. Meanwhile, throngs of spectators will back up en masse as you speed by them on the dirt tracks. Though you can't hit these pedestrians, their collective presence on the courses adds a nice feeling of danger and claustrophobia to the rally stages. On the downside, an invisible barrier pervades the perimeter of many of the courses, which detracts from an overall feeling of immersion. As a result, it's impossible to careen off a cliff at the Grand Canyon, for example. In the absence of a damage model, GT4 now incorporates a blur effect when smacking into opponents or stationary objects. It's similar to the effect found in Colin McRae Rally 2005, but it doesn't last as long. Also, while the game supports both 480p and even 1080i resolution, its implementation does not prevent a few jaggies or blurring effects from appearing during replays. The two main modes in GT4 are arcade (where you can enter single races, time trials, two-player battles, or LAN races for up to five other competitors) and the aforementioned Gran Turismo mode (where you'll spend your time earning credits, buying, selling, and upgrading your stable of cars, as well as participating in series races from locales all over the world). The career mode is built around a map that will be familiar to anyone who's played the series in the past. New car manufacturers are organized by country of origin, though with the measly 10,000 credits you start out with, a new car capable of winning a race may be a bit out of your price range. Players with a save file from Gran Turismo 3 A-spec will be in luck, however, as GT4 gives you the option to transfer up to 100,000 credits to your GT4 career, as well as your A and B racing licenses. If you don't have access to this kind of cash, however, you'll be stuck hitting one of the two used-car showrooms, where you'll be able to find a variety of cars from throughout the 1990s. If you're looking to go back further in time, a historic showroom will give you access to ~classics~ from the '70s and '80s. Take a break from the stressful license tests by knocking down cones arranged to look like the Dreamcast logo. While a handful of races have no license restrictions, if you wish to move beyond used cars and an empty bank account, you'll need to earn a real racing license. Love them or hate them, the license tests return, and in GT4, the tests encompass many of the new features found in the game. There are five licenses to earn, and the tests include things like simple acceleration and braking, tackling complex sequences of corners, and hot laps on courses from throughout the game. The license tests also include a couple of new wrinkles. For one, you'll be racing behind a pace car on some of the hot-lap challenges, during which you are not allowed to pass or hit the pace car. While passing the pace car is a difficult task, it's by no means impossible, especially when heavily braking in approaches to hairpin corners. The other new facet to the license test is the coffee break, a lighthearted romp that usually involves either knocking down or avoiding orange traffic cones (mercifully, there is not a time limit) to earn a bronze medal (though silver and gold will require some speed). The ante is upped considerably in GT4's ~super license~ tests, because one simple mistake resulting in going off-track will lead to a failure, which is a harrowing thought when tackling a single lap at the Nrburgring, a track that comprises more than 170 turns. Lastly, because snow and ice racing is now part of the Gran Turismo track equation, you'll encounter several snowy, slippery license test courses, including a supremely challenging super license test that will evaluate either the upper limits of your driving skills or your patience. Once you've earned all your licenses, you'll want to begin earning real money. The easiest way to do so is by winning races. Race series are organized in individual halls on the main map (such as the beginners hall, the professional hall, and more) or by country of origin (the Japanese hall, European hall, or American hall). Each hall comprises a number of different series that further comprise a number of individual races. Each race has a set of requirements that must be met to gain entry. These can range from country of origin restrictions to drivetrain requirements to specifications on horsepower or car length. If you're new to the GT series or new to cars in general, this might be a bit overwhelming. Luckily, each race spells out in detail what specifications are required for it, sometimes going so far as to list the types of cars that are eligible. Enter a screen where you aren't eligible, and the relevant requirements will flash red, alerting you to go back and change cars. Most of GT4's menus have been dramatically improved and reorganized. Before lining up for the starting grid, you'll be able to make adjustments to your car's setup through an interface that, much like the home garage, has received a much-needed makeover. Parts are organized by relevant sections of the car, and pulldown menus let you quickly and easily switch out parts on the fly. If you're looking to do some fine-tuning of your car's setup, you can click on the wrench icon next to selected parts to tweak to your heart's content, though it should be noted that on most stock cars, you won't be able to adjust things like ride height, gear ratios, and brake balance without first purchasing the customizable parts at your local car shop. The availability of these components depends on the make and model of your car, so you won't be able to fit turbo upgrades on every car in the game, for example. Once your car is configured to your liking, it's time to hit the track. Here--where the rubber meets the road--is where Gran Turismo's brilliant strengths and most glaring flaws lie. On the positive side, the fourth iteration of GT captures the feel of tires gripping pavement like no other game in the business. Every in-car aspect of sensory input is carefully designed to provide the illusion that you are actually screaming down the streets of Paris or perilously teetering over the edge of a Grand Canyon cliff. From a driving standpoint, Gran Turismo 4 is in a class by itself, with rollicking, rocking physics that accurately convey a sense of weight and shifting balance on all four points of the driving surface. So convincing, in fact, is the sense of realism that you'll find yourself cocking your head in enthusiastic sympathy as you barrel your way around corners or up blind hills. There are too many highlights to list them all, but notable physics high points are the corkscrew at Laguna Seca, which wrenches your car from an uphill struggle immediately into a dramatic downhill drop-off combined with a dramatic left-right swing; the back straight at Circuit de la Sarthe, where, as your car approaches top speed, it loses adhesion to the tarmac and begins literally skipping horizontally across the width of the road; and, of course, the maddeningly accurate snow and ice courses, which require entirely new approaches to driving to succeed. The two main modes in GT4 are arcade (where you can enter single races, time trials, two-player battles, or LAN races for up to five other competitors) and the aforementioned Gran Turismo mode (where you'll spend your time earning credits, buying, selling, and upgrading your stable of cars, as well as participating in series races from locales all over the world). The career mode is built around a map that will be familiar to anyone who's played the series in the past. New car manufacturers are organized by country of origin, though with the measly 10,000 credits you start out with, a new car capable of winning a race may be a bit out of your price range. Players with a save file from Gran Turismo 3 A-spec will be in luck, however, as GT4 gives you the option to transfer up to 100,000 credits to your GT4 career, as well as your A and B racing licenses. If you don't have access to this kind of cash, however, you'll be stuck hitting one of the two used-car showrooms, where you'll be able to find a variety of cars from throughout the 1990s. If you're looking to go back further in time, a historic showroom will give you access to ~classics~ from the '70s and '80s. Take a break from the stressful license tests by knocking down cones arranged to look like the Dreamcast logo. While a handful of races have no license restrictions, if you wish to move beyond used cars and an empty bank account, you'll need to earn a real racing license. Love them or hate them, the license tests return, and in GT4, the tests encompass many of the new features found in the game. There are five licenses to earn, and the tests include things like simple acceleration and braking, tackling complex sequences of corners, and hot laps on courses from throughout the game. The license tests also include a couple of new wrinkles. For one, you'll be racing behind a pace car on some of the hot-lap challenges, during which you are not allowed to pass or hit the pace car. While passing the pace car is a difficult task, it's by no means impossible, especially when heavily braking in approaches to hairpin corners. The other new facet to the license test is the coffee break, a lighthearted romp that usually involves either knocking down or avoiding orange traffic cones (mercifully, there is not a time limit) to earn a bronze medal (though silver and gold will require some speed). The ante is upped considerably in GT4's ~super license~ tests, because one simple mistake resulting in going off-track will lead to a failure, which is a harrowing thought when tackling a single lap at the Nrburgring, a track that comprises more than 170 turns. Lastly, because snow and ice racing is now part of the Gran Turismo track equation, you'll encounter several snowy, slippery license test courses, including a supremely challenging super license test that will evaluate either the upper limits of your driving skills or your patience. Once you've earned all your licenses, you'll want to begin earning real money. The easiest way to do so is by winning races. Race series are organized in individual halls on the main map (such as the beginners hall, the professional hall, and more) or by country of origin (the Japanese hall, European hall, or American hall). Each hall comprises a number of different series that further comprise a number of individual races. Each race has a set of requirements that must be met to gain entry. These can range from country of origin restrictions to drivetrain requirements to specifications on horsepower or car length. If you're new to the GT series or new to cars in general, this might be a bit overwhelming. Luckily, each race spells out in detail what specifications are required for it, sometimes going so far as to list the types of cars that are eligible. Enter a screen where you aren't eligible, and the relevant requirements will flash red, alerting you to go back and change cars. Most of GT4's menus have been dramatically improved and reorganized. Before lining up for the starting grid, you'll be able to make adjustments to your car's setup through an interface that, much like the home garage, has received a much-needed makeover. Parts are organized by relevant sections of the car, and pulldown menus let you quickly and easily switch out parts on the fly. If you're looking to do some fine-tuning of your car's setup, you can click on the wrench icon next to selected parts to tweak to your heart's content, though it should be noted that on most stock cars, you won't be able to adjust things like ride height, gear ratios, and brake balance without first purchasing the customizable parts at your local car shop. The availability of these components depends on the make and model of your car, so you won't be able to fit turbo upgrades on every car in the game, for example. Once your car is configured to your liking, it's time to hit the track. Here--where the rubber meets the road--is where Gran Turismo's brilliant strengths and most glaring flaws lie. On the positive side, the fourth iteration of GT captures the feel of tires gripping pavement like no other game in the business. Every in-car aspect of sensory input is carefully designed to provide the illusion that you are actually screaming down the streets of Paris or perilously teetering over the edge of a Grand Canyon cliff. From a driving standpoint, Gran Turismo 4 is in a class by itself, with rollicking, rocking physics that accurately convey a sense of weight and shifting balance on all four points of the driving surface. So convincing, in fact, is the sense of realism that you'll find yourself cocking your head in enthusiastic sympathy as you barrel your way around corners or up blind hills. There are too many highlights to list them all, but notable physics high points are the corkscrew at Laguna Seca, which wrenches your car from an uphill struggle immediately into a dramatic downhill drop-off combined with a dramatic left-right swing; the back straight at Circuit de la Sarthe, where, as your car approaches top speed, it loses adhesion to the tarmac and begins literally skipping horizontally across the width of the road; and, of course, the maddeningly accurate snow and ice courses, which require entirely new approaches to driving to succeed. Naturally, there's more to the illusion of a great driving model than a car that simply rocks back and forth on its springs. Your ears need to be convinced as well. While GT4's musical soundtrack leaves something to be desired, the masterful score of tire squeals and engine whinnies makes up for it. Tire noise, in particular, is more prevalent than ever before in GT4, especially on high-performance machines. As an early warning system for adhesion loss, the squeal of rubber is nearly as important a driving input as the motion of the car itself. Sure, you drive with your hands and eyes, but the driver who gets his ears into the mix as well will benefit. The set of individual car engine noises, individually recorded from the cars themselves, have always been a highlight of the GT series for auto enthusiasts, and the same is true here in GT4. The menacing guttural roar of a 1970 Plymouth Super Bird is in stark contrast to the two-toned midrange groan of a Mini Cooper S, yet both sound utterly distinct and convincing. You'll also be keenly aware of any draft you pick up from a car ahead of you, as the violent whip of wind across the body of your car will diminish to utter silence as you enter your opponent's wake. Perhaps the only room for meaningful improvement here would be in the use of more transmission sounds, especially in high-performance cars, as well as in the sounds of underside scraping during particularly violent landings off jumps. GT4's car roster reaches all the way back to the dawn of the automobile industry. Controlling your car in GT4 is a pleasure, whether using the Dual Shock controller or a racing wheel. The cars are instantly responsive to even the slightest input from the controller, and if you're lucky enough to have a great racing wheel--such as the designed-for-GT Logitech Force Pro--you'll experience some of the greatest and most immersive driving thrills to be found on the PS2. Force feedback on the Logitech Force Pro is effective at conveying every imperfection and undulation on the asphalt, but the vibration support for the Dual Shock controller is surprisingly sensitive as well. Though the driving model in GT4 is exceptionally executed, as it should be in a game that bills itself as ~The Real Driving Simulator,~ that same level of detail and excellence doesn't always apply to the racing portions. While it is true that the further you progress, the tougher the races become, the simple fact is there are several shady methods to winning races, and not all of them involve being the best driver on the track. Techniques such as cutting across chicanes on Fuji Speedway or diving through the corkscrew at Laguna Seca are natural and obvious examples. After all, there's no time penalty for going off-course, and no damage is done if you misjudge the 'screw and slam into a wall. So what's the harm? Bumper car racing, so called because you use the artificially intelligent opponent cars as ~bumpers~ to scrub off speed and help position your car around tight turns, is alive and well in GT4. Heading too fast into right-hand turn one at Tokyo Route 246? Simply dive to the inside of the car in front of you, and watch in amazement as you not only make it around the curve unscathed, but also likely gain a position doing so. Unlike real competitors, your opponents in GT4 won't get upset at your underhanded style; in fact, they may just pull a few dirty tricks of their own as they make their ways around the track. For one thing, the opponents in GT4 are practically oblivious to your presence on the track, routinely ramming you from behind without making the slightest attempt to get around you cleanly. And while opponent cars don't seem preset to specific racing lines--we've seen them go wide on turns, misjudge braking distances, and even spin off-track completely--they are ruthlessly determined to holding whatever lines they currently possess, much to the detriment of everyone else on the road. If you want the maximum from your car, be prepared to spend the maximum amount of cash. If you want to make money, you've got to spend money...or so the old axiom goes. That is no truer than in GT4, where you'll be spending loads of credits to improve your cars with the latest and greatest upgrades. While many of the races have minimum restrictions to meet for entry, very few have maximum restrictions for things like horsepower. What this means in practical purposes is that if you want to win a good portion of the early races in GT4, all you have to do is build a car powerful enough to leave the competition in your dust. By using this ~might makes right~ approach, you'll be winning with ease practically from the outset, but you, perhaps, won't have much fun while doing so. In later championship series races, the difficulty level ramps up considerably, but not in the form of improved driving AI. Rather, the motorized playing field is leveled off because most of the cars are at the upper limits of performance. If you're tired of running laps, or just have achy thumbs, the inclusion of GT4's B-spec mode might be an interesting diversion. B-spec mode puts you in the role of a race manager, radioing instructions to your driver on the course. As a manager, you'll be able to give instructions on pace (speed up or slow down), when to attempt an overtaking maneuver, and when to come in for a pit stop. And that's pretty much it. Sure, you're also able to change the point of view from first to third person, and you can check out a handy race management screen that gives you sector times, distance between each opponent, and a track map, but the simple fact is you won't feel very engaged in B-spec mode, especially when compared to the thrilling sense of speed and ~place~ GT4's A-spec mode provides. As anything other than a hands-off approach to GT4's longer races (or an easy way to make some quick credits while keeping the television off), B-spec mode doesn't have what it takes, and by taking you out of the car, it's more akin to a pacifist mode in a fighting game or a flight sim during which you only get to play as a flight attendant. Naturally, there's more to the illusion of a great driving model than a car that simply rocks back and forth on its springs. Your ears need to be convinced as well. While GT4's musical soundtrack leaves something to be desired, the masterful score of tire squeals and engine whinnies makes up for it. Tire noise, in particular, is more prevalent than ever before in GT4, especially on high-performance machines. As an early warning system for adhesion loss, the squeal of rubber is nearly as important a driving input as the motion of the car itself. Sure, you drive with your hands and eyes, but the driver who gets his ears into the mix as well will benefit. The set of individual car engine noises, individually recorded from the cars themselves, have always been a highlight of the GT series for auto enthusiasts, and the same is true here in GT4. The menacing guttural roar of a 1970 Plymouth Super Bird is in stark contrast to the two-toned midrange groan of a Mini Cooper S, yet both sound utterly distinct and convincing. You'll also be keenly aware of any draft you pick up from a car ahead of you, as the violent whip of wind across the body of your car will diminish to utter silence as you enter your opponent's wake. Perhaps the only room for meaningful improvement here would be in the use of more transmission sounds, especially in high-performance cars, as well as in the sounds of underside scraping during particularly violent landings off jumps. GT4's car roster reaches all the way back to the dawn of the automobile industry. Controlling your car in GT4 is a pleasure, whether using the Dual Shock controller or a racing wheel. The cars are instantly responsive to even the slightest input from the controller, and if you're lucky enough to have a great racing wheel--such as the designed-for-GT Logitech Force Pro--you'll experience some of the greatest and most immersive driving thrills to be found on the PS2. Force feedback on the Logitech Force Pro is effective at conveying every imperfection and undulation on the asphalt, but the vibration support for the Dual Shock controller is surprisingly sensitive as well. Though the driving model in GT4 is exceptionally executed, as it should be in a game that bills itself as ~The Real Driving Simulator,~ that same level of detail and excellence doesn't always apply to the racing portions. While it is true that the further you progress, the tougher the races become, the simple fact is there are several shady methods to winning races, and not all of them involve being the best driver on the track. Techniques such as cutting across chicanes on Fuji Speedway or diving through the corkscrew at Laguna Seca are natural and obvious examples. After all, there's no time penalty for going off-course, and no damage is done if you misjudge the 'screw and slam into a wall. So what's the harm? Bumper car racing, so called because you use the artificially intelligent opponent cars as ~bumpers~ to scrub off speed and help position your car around tight turns, is alive and well in GT4. Heading too fast into right-hand turn one at Tokyo Route 246? Simply dive to the inside of the car in front of you, and watch in amazement as you not only make it around the curve unscathed, but also likely gain a position doing so. Unlike real competitors, your opponents in GT4 won't get upset at your underhanded style; in fact, they may just pull a few dirty tricks of their own as they make their ways around the track. For one thing, the opponents in GT4 are practically oblivious to your presence on the track, routinely ramming you from behind without making the slightest attempt to get around you cleanly. And while opponent cars don't seem preset to specific racing lines--we've seen them go wide on turns, misjudge braking distances, and even spin off-track completely--they are ruthlessly determined to holding whatever lines they currently possess, much to the detriment of everyone else on the road. If you want the maximum from your car, be prepared to spend the maximum amount of cash. If you want to make money, you've got to spend money...or so the old axiom goes. That is no truer than in GT4, where you'll be spending loads of credits to improve your cars with the latest and greatest upgrades. While many of the races have minimum restrictions to meet for entry, very few have maximum restrictions for things like horsepower. What this means in practical purposes is that if you want to win a good portion of the early races in GT4, all you have to do is build a car powerful enough to leave the competition in your dust. By using this ~might makes right~ approach, you'll be winning with ease practically from the outset, but you, perhaps, won't have much fun while doing so. In later championship series races, the difficulty level ramps up considerably, but not in the form of improved driving AI. Rather, the motorized playing field is leveled off because most of the cars are at the upper limits of performance. If you're tired of running laps, or just have achy thumbs, the inclusion of GT4's B-spec mode might be an interesting diversion. B-spec mode puts you in the role of a race manager, radioing instructions to your driver on the course. As a manager, you'll be able to give instructions on pace (speed up or slow down), when to attempt an overtaking maneuver, and when to come in for a pit stop. And that's pretty much it. Sure, you're also able to change the point of view from first to third person, and you can check out a handy race management screen that gives you sector times, distance between each opponent, and a track map, but the simple fact is you won't feel very engaged in B-spec mode, especially when compared to the thrilling sense of speed and ~place~ GT4's A-spec mode provides. As anything other than a hands-off approach to GT4's longer races (or an easy way to make some quick credits while keeping the television off), B-spec mode doesn't have what it takes, and by taking you out of the car, it's more akin to a pacifist mode in a fighting game or a flight sim during which you only get to play as a flight attendant. Fans of the GT series are probably not all that surprised at news of a sublime driving engine and a less-than-sporting racing model. The best racing found in GT4 is dependent on two things: a grid full of similarly powered cars and continual diligence, on your part, to maintain a clean race. The game lets you take advantage of both during a race, but it also suffers because of it. When you consider how long the series has been around and how much time Polyphony Digital takes between entries in the GT series, it's amazing how far the game has come from graphical and presentational standpoints, but it's simultaneously amazing how little the series has evolved in areas such as racing, damage modeling, and online support. Speaking of online support, it's a well-known fact that Gran Turismo 4 does not include the kind of online racing capabilities that most console racing games boast. It's disappointing, to be sure, but GT4 tries to make up for that omission with the inclusion of multiplayer support for up to six players via LAN. But that doesn't quite fill the gap. If you're going to attempt to play over a LAN, you should know that the LAN setup menu is not very user-friendly, and the manual is of absolutely zero help. Most modern racing games have online modes these days, and the absence of one here really sticks out. The photo mode will foster your artistic side with photo-realistic backgrounds from around the world. Beyond the scintillating driving model, one of the very best aspects of GT4 is the sheer amount of stuff to do in the game. In addition to driving scores of realistic cars in hundreds of races across any number of thrilling environments and conditions, GT4 is packed to the bits with a host of surrounding minimodes and features that go a long way toward creating a sense of GT lifestyle in the career mode. The photo travel mode, for example, is a fun, flexible feature that lets you place the ride of your choice in a number of photo-realistic locales, from Boston's Beacon Hill to the Las Vegas strip. You can also snap a picture or two and then save your best pictures to your PS2 memory card. While there are a lot of options for lens types, camera angles, and picture quality, you're only allowed to move the camera or car within a predetermined area. It can be a bit stifling at first, working within these constraints, but with a bit of practice, you can snap some truly impressive-looking photos. If you've got an Epson USB printer handy, you can even print your photos out and mail them to friends, who may wonder just how and when you were able to buy a Mercedes SLR McLaren and photograph it from Nanzenji Temple in Japan. The game also features a driving mission mode where you'll need to meet specific challenges, such as passing an opponent in a particular section of track, mastering the drafting feature, or tackling three-lap races against a full field of opponents. To further customize your ride, you can travel over to the GT auto shop, where you can choose from a plethora of custom wheels and wings and then give your car an oil change or car wash before your next big race. The Gran Turismo series is famous for its replay modes, which (even back in the PlayStation days) are visually impressive. GT4's replay mode has two modes on offer: standard, which features a variety of camera angles and cool background music, and dive, which packs on the filters and MTV-style cuts to add a truly dramatic flair. There's also a photo drive mode, which lets you take action shots of your car on any track in the game using the replay feature. Another cool use of the replay mode is the lap analyzer feature, which lets you compare car performance attributes, such as speed, braking, and acceleration, over multiple laps on a single course. If you're looking to directly compare the merits of two cars on the same track, you can load another lap time from a saved ghost replay in this mode to analyze the results. Despite the plethora of GT features, or perhaps because of them, it's worth mentioning the load times, which can be ugly and plentiful. Be prepared to spend a large chunk of your GT4 time staring at a mostly blank, black screen while waiting for menus, analysis windows, and replays to appear...or for races to begin. Another annoying aspect is the long prerace animations that run during rolling starts. These could easily be trimmed by five seconds or more to get you to the racing action right away. A sweet new car demands some sweet new wheels. The soundtrack in GT4 is sort of all over the place, as it always has been. There are moments of brilliance, such as the Bootsy Collins' ~Let's Roll~ or Joe Satriani's ~Summer Song,~ alongside less effective tunes, such as Judas Priest's ~Free Wheel Burning,~ which almost rocks too hard for its own good. The crown jewel in this soundtrack has to be Van Halen's ~Panama,~ a tune used to brilliant effect in the opening movie and one that remains a thrill to hear each time it appears in-game. A nice customization feature in GT4 gives you the ability to add or remove songs from your playlist, so if the Priest is rocking you too hard during another lap at Motegi, you can remove it for your next go-around. The menu music in GT4 is the standard up-tempo piano-tinged smooth jazz that has become a standard of the series. It's neither annoying enough to turn off when the game is on in the background nor catchy enough to be remembered after you've ended your play session. Gran Turismo 4 arrives as a game operating under heavy expectations, if only because each installment in the series has been such an epic event. Despite its numerous delays and some notable feature omissions, GT4 is a game that will keep enthusiasts busy for months. And due to its upgraded presentation, it will likely win some new fans as well. Though it suffers from a curious lack of evolution in terms of some of its central aspects, most notably its racing AI, when GT4 works to its strengths, it delivers like few games of this console generation. Fans of the GT series are probably not all that surprised at news of a sublime driving engine and a less-than-sporting racing model. The best racing found in GT4 is dependent on two things: a grid full of similarly powered cars and continual diligence, on your part, to maintain a clean race. The game lets you take advantage of both during a race, but it also suffers because of it. When you consider how long the series has been around and how much time Polyphony Digital takes between entries in the GT series, it's amazing how far the game has come from graphical and presentational standpoints, but it's simultaneously amazing how little the series has evolved in areas such as racing, damage modeling, and online support. Speaking of online support, it's a well-known fact that Gran Turismo 4 does not include the kind of online racing capabilities that most console racing games boast. It's disappointing, to be sure, but GT4 tries to make up for that omission with the inclusion of multiplayer support for up to six players via LAN. But that doesn't quite fill the gap. If you're going to attempt to play over a LAN, you should know that the LAN setup menu is not very user-friendly, and the manual is of absolutely zero help. Most modern racing games have online modes these days, and the absence of one here really sticks out. The photo mode will foster your artistic side with photo-realistic backgrounds from around the world. Beyond the scintillating driving model, one of the very best aspects of GT4 is the sheer amount of stuff to do in the game. In addition to driving scores of realistic cars in hundreds of races across any number of thrilling environments and conditions, GT4 is packed to the bits with a host of surrounding minimodes and features that go a long way toward creating a sense of GT lifestyle in the career mode. The photo travel mode, for example, is a fun, flexible feature that lets you place the ride of your choice in a number of photo-realistic locales, from Boston's Beacon Hill to the Las Vegas strip. You can also snap a picture or two and then save your best pictures to your PS2 memory card. While there are a lot of options for lens types, camera angles, and picture quality, you're only allowed to move the camera or car within a predetermined area. It can be a bit stifling at first, working within these constraints, but with a bit of practice, you can snap some truly impressive-looking photos. If you've got an Epson USB printer handy, you can even print your photos out and mail them to friends, who may wonder just how and when you were able to buy a Mercedes SLR McLaren and photograph it from Nanzenji Temple in Japan. The game also features a driving mission mode where you'll need to meet specific challenges, such as passing an opponent in a particular section of track, mastering the drafting feature, or tackling three-lap races against a full field of opponents. To further customize your ride, you can travel over to the GT auto shop, where you can choose from a plethora of custom wheels and wings and then give your car an oil change or car wash before your next big race. The Gran Turismo series is famous for its replay modes, which (even back in the PlayStation days) are visually impressive. GT4's replay mode has two modes on offer: standard, which features a variety of camera angles and cool background music, and dive, which packs on the filters and MTV-style cuts to add a truly dramatic flair. There's also a photo drive mode, which lets you take action shots of your car on any track in the game using the replay feature. Another cool use of the replay mode is the lap analyzer feature, which lets you compare car performance attributes, such as speed, braking, and acceleration, over multiple laps on a single course. If you're looking to directly compare the merits of two cars on the same track, you can load another lap time from a saved ghost replay in this mode to analyze the results. Despite the plethora of GT features, or perhaps because of them, it's worth mentioning the load times, which can be ugly and plentiful. Be prepared to spend a large chunk of your GT4 time staring at a mostly blank, black screen while waiting for menus, analysis windows, and replays to appear...or for races to begin. Another annoying aspect is the long prerace animations that run during rolling starts. These could easily be trimmed by five seconds or more to get you to the racing action right away. A sweet new car demands some sweet new wheels. The soundtrack in GT4 is sort of all over the place, as it always has been. There are moments of brilliance, such as the Bootsy Collins' ~Let's Roll~ or Joe Satriani's ~Summer Song,~ alongside less effective tunes, such as Judas Priest's ~Free Wheel Burning,~ which almost rocks too hard for its own good. The crown jewel in this soundtrack has to be Van Halen's ~Panama,~ a tune used to brilliant effect in the opening movie and one that remains a thrill to hear each time it appears in-game. A nice customization feature in GT4 gives you the ability to add or remove songs from your playlist, so if the Priest is rocking you too hard during another lap at Motegi, you can remove it for your next go-around. The menu music in GT4 is the standard up-tempo piano-tinged smooth jazz that has become a standard of the series. It's neither annoying enough to turn off when the game is on in the background nor catchy enough to be remembered after you've ended your play session. Gran Turismo 4 arrives as a game operating under heavy expectations, if only because each installment in the series has been such an epic event. Despite its numerous delays and some notable feature omissions, GT4 is a game that will keep enthusiasts busy for months. And due to its upgraded presentation, it will likely win some new fans as well. Though it suffers from a curious lack of evolution in terms of some of its central aspects, most notably its racing AI, when GT4 works to its strengths, it delivers like few games of this console generation."}