{"ref": "https://www.gamespot.com/reviews/ghost-rider-review/1900-6166015/", "date": "February 16, 2007", "game_name": "Ghost Rider", "text": "Just call it ~Devil May Ghost Rider of War.~ Based ever-so-loosely on the same-named upcoming Nic Cage movie (which, in turn, is based on the popular Marvel comic book), Ghost Rider isn't just inspired by such great action franchises as God of War and Devil May Cry, it practically robs those games blind of every gameplay mechanic it can get its grubby, demonic hands on. And yet, somehow, some way, despite the incredible pedigrees the developers were lifting from, Ghost Rider is completely bereft of the elements that made those games so much fun. It is a hollow, monotonous shell of those games, completely soulless in its execution and devoid of any unique or interesting qualities, much less any fun. Suffice it to say, no matter how much of an affinity you have for the titular hero, this game is not for you. How in the heck do you make a game about a dude with a flaming skull for a head so incredibly boring?!? Ghost Rider purportedly features a storyline penned by Marvel writers Garth Ennis and Jimmy Palmiotti, but the story feels less like a fully fleshed-out piece of comic fiction and more like leftover table scraps. The story doesn't even do a good job of tying in to the movie. It's told through some comic-paned cutscenes that feature just-different-enough-to-not- quite-look-like-real-actors drawings of all the major characters from the movie. A soundalike of Sam Elliott (apparently channeling his Big Lebowski character, with a spookier edge) narrates a few opening sequences just to get you up to speed, and eventually you figure out that the demon Mephisto needs Ghost Rider to head up to earth to stop his son, Blackheart, and his army of demons from getting their apocalypse on. It's a middling tale that's disjointed in its delivery and does a weak job of shoving in some familiar Marvel personalities (like Blade) just because it can. It also doesn't help that the audio mix on the cutscenes is so awful that you'll have to turn the volume on your TV way, way up just to hear what's going on, only to be brutally assaulted with the screechy in-game sound effects and soundtrack at much-too-high volume seconds later. Once you settle into the gameplay, you'll find an unholy combination of God of War's whip-heavy combat and Devil May Cry's ranking system. The game is all about you killing Blackheart's demonic forces with as much style and variety as possible, and to its credit, it does provide a decent number of combos to work with. You start out with almost none, but then, through a direct rip of God of War's upgrade system (right down to the sound effect it uses to fill up your various upgradeable meters), you can use souls you've collected to buy new combos and up your abilities. The problem, though, is that very few of the combos are actually worth using, and you get the most useful ones very early in the game. In fact, one combo in particular is so powerful, it kills just about any enemy in roughly three hits. All the other combos in the game tend to take much longer to fell any one foe, so there's not much incentive to ever use the other combos--except when the game forces you to. There are a couple of instances where enemies will pop up with shields that can only be broken by reaching a certain ranking on the combo meter. You can't build up your combo meter unless you throw in as much attack variety as possible, so you're arbitrarily forced to use as many different attacks as you can to eventually crack this shield. Trouble is, the meter fully resets any time you're hit, and enemies are just good enough at coming at you from offscreen and nailing you when you're not expecting it to make this whole process intensely frustrating. Apart from this one particularly stupid element, very little of the remaining components of Ghost Rider are frustrating, mainly because the game's really easy. You fight the same onslaughts of the same generic demons over and over again, and they never change up their attack patterns in the slightest. Not to mention the one-size-fits-all combo that eliminates practically any bad guy in just a few hits. You'll blow through the game in just a few hours, but it'll take some fortitude to not become desperately bored an hour into the whole thing. The combat goes absolutely nowhere, and the enemies are so dull to look at and fight that you can't help but wish the developer had gone the extra mile and just lifted enemies right out of DMC or GOW, since at least they'd put up a more interesting fight. Level designs add to the sense of monotony, not just through their constantly drab and grainy graphics, but also because the game frequently forces you to backtrack through the same territory again and again. Interspersed between the boring beat-'em-up levels are a number of motorcycle-riding sequences. These are pretty straightforward, sticking you on the Rider's flaming bike and tasking you with making it from point A to point B, all the while shooting away at bad guys that randomly pop up in your path. Periodically you'll need to get all Road Rash on them and swipe at some enemy bikers with your chains, or hop or slide your bike over or under some obstacle, but that's about it. The controls in these sequences are pretty loose, and there's even less variety to them than to the beat-'em-up portions of the game. And just like in the other levels, these sequences force you to backtrack frequently. Ghost Rider is out for both the PlayStation 2 and PlayStation Portable, and while the core gameplay is identical between the two, other details are quite different. The main story mode is structured differently between the two. You play in a much smaller area in the PSP levels, and each time you clear a section of enemies, you walk into a checkpoint, which then spawns another crop of bad guys. In the PS2 version, you travel from stage to stage, just as you would in a typical action adventure game. The PSP version also has quite a bit more bonus content, including a challenge mode and a multiplayer mode. The challenge mode includes a few different race modes, some of which include rule variations like elimination races and a survival mode, where all the racers have a quickly diminishing life bar and must get to the checkpoints to replenish themselves. Of course, the races suffer from the same bad controls as the story mode driving sequences, and the few weapons you can use to mess with your opponents don't help matters. Still, you can play these same modes in multiplayer, both with multiple copies of the game or with game sharing. Clearly someone went to a lot of trouble to make the PSP version's features more interesting--too bad the underlying gameplay of these features wasn't made better. The driving sequences would be pathetically easy if it weren't for the bad bike-handling controls. The PSP and PS2 games look practically identical, too--so much so that you'd actually have to say the PSP version is more impressive looking, just because so little seems to have been lost in translation. Of course, that's less a compliment to the PSP game and more an extreme knock against the PS2 game, as neither could be considered good looking by any stretch of the imagination. The graphics are terribly grainy and the level designs so blurry and ugly that they just become hard to look at after a while. Ghost Rider's been given a few stylish attack animations here and there, but none of it's all that impressive. The enemy designs are particularly lame; these generic bad guys could have been plucked from any bargain-basement action game, and couldn't be any less intimidating looking if they wore white sheets, rattled bike chains, and said ~boo~ a lot. On top of everything else, the camera and frame rate can't even hold up their end of the bargain. The frame rate chunks up badly in a number of seemingly random spots, and the camera tries to go for the whole God of War, fixed-angle thing, but it frequently kills your ability to properly see where enemies reside. The only control you have over it is to snap it behind you. Though it's hard to be shocked these days when a movie-licensed game isn't quite up to snuff, Ghost Rider is legitimately surprising in just how poor a game it is. That it goes so far out of its way to usurp qualities from multiple major action adventure franchises, then proceeds to trot out the dullest, blandest beat-'em-up possible with those lifted mechanics is mind-boggling. Fans of the comic will be depressed with how poorly their favorite hero is utilized here, and fans of action adventure games won't be able to shake the feeling that they're playing a bad bootleg of games they've already played before. Indeed, Ghost Rider is ultimately just another flaming corpse to toss on the pile of failed licensed action games."}