{"ref": "https://www.gamespot.com/reviews/assassins-creed-syndicate-review/1900-6416291/", "date": "October 30, 2015", "game_name": "Assassin's Creed Syndicate", "text": "After completing my second ghost hunt with Charles Dickens, I decided it was about time to shut down the last factory forcing children into labor. As I made my way across Westminster, zipping between rooftops with my rope launcher, a notice popped up indicating I was approaching a bounty hunt. The objective was simple--kill an important member of my rival gang--and I decided the children could wait a bit longer. I was in and out of the mission in under a minute after dropping hanging barrels on gang members, throwing down a smoke bomb and taking out the leader with a gun to the head. I ziplined out, stopping only once more to change my outfit to one that held more throwing knives, before dropping by a black market stall for a refill and dashing towards the factory. The children of London needed me.This is Assassin's Creed Syndicate's playground. One moment you're free-running through a borough towards the next story mission, the next you're sneaking through a dilapidated building picking off criminals as you find yourself irresistibly drawn to the promise of experience points and in-game cash--not to mention notoriety among the London underground. The organic way in which missions and side projects pop up is bolstered by their placement in a gorgeous rendition of 1868 London, complete with massive factories spewing smoke into the sky and intricately detailed copies of every major landmark you can think of--all climbable, of course. Overlaying all of this is one of the best stories the Assassin's Creed franchise has told in recent years, featuring dual protagonists that are relatable and lovable. Occasionally during climbing it can feel like your freedom of movement is limited, and controls will sometimes sabotage you with some unwieldiness and counterintuitive button placement. More of the environment has been made available for you to climb on, and the rope launcher can attach to nearly all ledges, so these small occurrences of flying off the rails are inconvenient at worst. But overall combat and movement feel great, and Assassin's Creed Syndicate's story is charming, while countless amusements will keep you lost in London for hours.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Assassin's Creed Syndicate ReviewSyndicate's story is an intimate, personal tale like that of last year's Assassin's Creed Unity mixed with older Assassin's Creeds' tendencies to pack in the historical figures. The modern day elements are more toned down than they were in previous Assassin games, so much so that they're barely present. You spend all your time as Jacob and Evie Frye, assassin twins who come to London in 1868. Under the leadership of Crawford Starrick, the Templars have a stranglehold on the city, and a sinister gang called the Blighters run things to their liking.The absence of any fiddling around in a present-day timeline is a boon to Syndicate's story, allowing laser-focus on the 1868 London plot. The story centers around the politics and policies of Industrial Revolution London, with Jacob and Evie fighting not only to dismantle the Templar conspiracy but also to bring justice and refuge to the city's downtrodden. Jacob and Evie also frequently fight each other, with disagreements about what it means to be an Assassin forming a tense undercurrent. Along the way, the two come into contact with a smattering of historical characters--ranging from Alexander Graham Bell (who gives the game's best items) to Charles Dickens and Karl Marx--making the Fryes tangential and sometimes integral to the great successes these individuals achieved. These interactions fit neatly into Syndicate's overall flow, and while it does seem like these figures are packed in a little too tight, the game gives breathing room to each individual story.London feels alive. Towers breathe smoke into the sky, stations bustle with passengers and passing trains, the homeless burn fires in trash cans in alleys, and stray cats pause to look at you while you lie in wait for your target. Bystander AI can be overdramatic at times, cowering in fear indefinitely after witnessing you murder someone in front of them, but those visceral reactions are what make starting fights in public such a delight. You throw a punch in a marketplace and crowds immediately vacate the area, fleeing from your wrath. Little boys and women run and scream as you sink your blade in someone's throat. NPCs also yell at you when you loot bodies, bid you good-day as you walk by, and make whispered comments to companions about your looks. And piled on top of it all is a brilliant soundtrack, a seamless sea of tunes that capture the sadness of the poor and the determination of the Fryes. In one instance, as you climb a spire to a viewpoint, a soft soprano-and-string number kicks in, painting a picture of melancholy for the past and hope for the future. Sights and sounds combine to create an irresistible portrait of London, and make exploring for every side quest and collectible an enjoyable experience.Moving and fighting in London is also a satisfying experience, at least when controls cooperate. Combat is fluid and simple and relies mostly on the D-pad, on which directions are mapped to attack, counter, stun and shoot. If you're quick, you can punch in combos that knock enemies over and trigger some final execution moves that are brutal and beautiful. It's undeniably satisfying to chain hits and kills until you're bopping around between enemies in a gang war, flying along a circle of combatants and systematically bringing them to their knees in one fell swoop.Free-running follows this same simplicity; hold down R2 while running and press one button to go up and another to go down. You can climb pretty much everything in London with relative ease, with the city's gorgeous details offering compelling arguments to eschew fast travel. But these controls take some time getting used to and feel counterintuitive, especially while climbing. Sometimes you'll kick off a wall when you meant to climb up or go up when you try to go down; this imprecision has characterized the series controls from the start. But in Syndicate this imprecision is infrequent, and while the controls aren't perfect they do feel much better and more fluid.Gone are the days of snapping to cover and blending into crowds. In Syndicate, a white ~Threat Ring~ appears around your assassin when enemies are near. Markings on the ring show you where enemies are relative to your position, which is helpful when you're crouching in an area and can't see much. This tool makes stealth much easier and allowed me to gauge who to take out first based on how close they were and whether they'd noticed me. Then you can determine which tools to whip out of your belt, be it electric bombs or throwing knives. Do I smoke bomb this group and take out the leader under cover? Or do I just escape to a rooftop and pick them off one by one with throwing knives? Or better, make them turn on each other with hallucinogenic darts? The tools at your disposal and how you combine them is entirely up to you, and Syndicate's mission design offers ample breathing room to complete each mission in your own way.I can recall only using Syndicate's fast travel points three times during my entire playthrough, because with the rope launcher in your toolbox, why would you take any other route through London? The setting is so lovely, and zipping across the city like a Victorian Spider-Man makes you truly feel like the city's protector, dropping to the streets every so often to air assassinate someone. In addition to setting up aerial kills, using the rope launcher instead of fast travel allows you to organically stumble upon one of London's many sidequests and make a pit stop for extra cash. Many times, on my way to a story mission, I would zipline over a side mission and think, ~Why the hell not, I'm here!~ One tool helps you traverse, discover, escape, and assassinate. The rope launcher is the thing this franchise so desperately needed, and now that it's here I don't ever want to be without it.Another new mechanic is the ability to drive carriages. I found Syndicate's vehicles relatively easy to handle. You can also do any number of things with these carriages, including hijacking them for your own purposes and hiding bodies in them. One string of side missions involved collecting wanted criminals for a policeman; I would knock them out, steal a carriage from an unwitting bystander, put the body in the car, and then drive away. In some instances the rival gang has carts on the road as well, which can devolve into some hilariously fun Grand Theft Auto-style chases. You can ram carriages as they ride up next to yours or climb up onto your own carriages roof to engage in fisticuffs with enemies. Hijacking moving carts is thrilling, and destruction is encouraged. There's an experience perk you can earn for destroying street lamps and other public property, so don't be shy about running people over.Combat, grand theft carriage, and bounties all play into the game's main story, and you'll be tasked with doing all of these things over the course of Jacob and Evie's adventures. While you can switch between the twins on the fly when playing side missions, you'll be locked into playing as a certain twin for specific story tasks. Each chapter has dedicated objectives for both Jacob and Evie. Jacob's tasks cause more mayhem and utilize his talent for close-quarters combat as he seeks to bring justice to London's underdogs, often resulting in explosions and other destruction. Evie's missions mostly require sneaking around without being detected. Her objectives feel closer to the traditional Assassin's Creed story, and you'll spend time with her doing the order proud while Jacob makes a mess of everything and invests in creating his own gang, the Rooks.In addition to differing personalities--with Evie constantly reprimanding Jacob while he rather humorously bumbles around achieving his squad goals--the twins have different unique skills that tie into their interpretation of what it means to be an assassin. Evie's special skills are stealth-based, with one incredibly useful ability allowing her to disappear completely while she's standing still in sneak mode. She can also hold twice as many throwing knives as Jacob and her stealth stats far exceed her brother's. She'll be the one you take with you on bounty hunting and liberation missions. Jacob is more suited for gang wars, a brawler who takes less damage and, with all skills unlocked, can bring enemies to near-death states quicker. Their differences are noticeable in gameplay, and rather than have one character you can customize either way, it's a brilliant touch to have two characters ready and available for different kinds of missions at any given time.I cannot stress enough how deeply likeable and relatable Jacob and Evie can be. Evie is serious but sweet, tough in battle but willing to pick up the scattered papers of a stranger she bumps into on the street. She acts more like an older sister than a twin, bossing her brother around and openly deriding his more destructive decisions. Jacob is goofy, flippant, cheeky, and is more concerned about his gang and toys while his sister fulfills her oath. He makes fun of Evie's belief in ghosts and her willingness to help everyone they meet, but under all that snark it's clear he loves his sister. Their banter is sweet and at times funny, and while they are two separate entities when it comes to combat, they truly feel like two parts of the same whole. Their story is a powerful one, about duty and family, and the ease with which they communicate and the believability of their relationship showcases the draw of Syndicate's narrative. Add to this a supporting cast filled with diverse, equally believable characters, and Syndicate feels a little bit like being at a party with all of your friends.In addition to leveling up Jacob and Evie, you can level up their green-clad gang, the Rooks. I became obsessed with tricking out my gang, because having strong fighters on the streets mean you'll always have backup in a fight. Using in-game currency, you can unlock perks for your gang, such as sturdier carriages and cheap access to hallucinogenic darts. You can even pay off policeman to turn a blind eye to some of your illegal activities and assemble an army of children to bring you crafting items on the streets. Micromanaging your gang is worthwhile because it completely changes your experience in London. Having this extra layer to deal with keeps you engaged in activities outside the main story and is another fun way to leave your mark on the world.Syndicate's story is a riveting tale of compassion and greed, but the mechanics of its climax don't carry enough urgency and drama. A final boss fight usually tests the skills you've learned throughout the game, but Syndicate's is a memorable for the wrong reasons. It's an anticlimactic scramble through moving environmental obstacles to reach the boss and trigger a quick time event. This sequence of events happens several times in order for you to beat the encounter. It's a frustrating setup that tosses all narrative tension out the window.But a disappointing final fight and some control hitches can't diminish the charms of Assassin's Creed Syndicate. The game is a triumphant return to form for the franchise, and presents a beautifully structured tale with heart and soul to spare. Ziplining through London is thrilling, and the game allows you to organically discover missions and leaves you open-ended solutions lets you to create a meaningful, personal experience within its world. Coupled with strong, loveable leads and a seemingly endless procession of ways to leave your (fictional) mark on London's history, Assassin's Creed Syndicate is a shining example of gameplay and storytelling."}