{"ref": "https://www.gamespot.com/reviews/wwf-smackdown-just-bring-it-review/1900-2824631/", "date": "November 14, 2001", "game_name": "WWF SmackDown! Just Bring It", "text": "WWF SmackDown! Just Bring It marks the series' transition from the PlayStation to the PlayStation 2, bringing with it the signature arcade-style gameplay and flashy, television styled presentation that sets it apart from the competition. The series' strength lies in its ability to accurately convey the emotion and adrenaline-pumping excitement that fans can feel when watching a great ring entrance, or when their favorite wrestler executes a trademark move. WWF SmackDown! Just Bring It improves upon the series' strong background with a more fleshed out story mode and more of the over-the-top WWF style.WWF SmackDown! Just Bring It has much of the SmackDown! 2 formula intact. The greatest Superstars of the WWF make up the cast, 36 of whom are available from the start, with more to unlock in the story mode. Wrestlers still have the ability to run, use weaponry, and perform a wide variety of strikes and grapple maneuvers. The key to success with the grappling system once again relies on timing and the proper gauging of distance between your wrestler and the opponent. Either you'll grab the opponent and perform your move, or you'll catch empty air, opening your defenses up to a retaliatory maneuver. Rounding out your abilities is the counter, which can be used to block and return punches, slide between your opponent's legs, leapfrog during a run, or reverse certain grapple attempts. Nailing moves on an opponent will generate momentum, which then powers finishing moves. The more fatigued an opponent is, the longer he'll stay down, and finishers just about guarantee a pin fall.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: WWF Smackdown! Just Bring It Video ReviewSmackDown! Just Bring It looks like and controls nearly identically to SmackDown! 2, albeit with a few key changes in certain areas. In addition to the standing and dizzy grapple moves, a new set has been added for when the opponent is picked up into a clinch. Each wrestler now has a pair of finishing moves, though wrestlers with only one finisher to choose from, like Stone Cold and his Stunner or Triple H and his Pedigree, are instead treated to a slightly different animation of the wrestler's one finisher. Another key change is JBI's use of a referee in the ring, notably Earl Hebner. Earl can be attacked during the course of a match and will then play favorites, but how he actually enforces the rules is most impressive. In previous wrestling games, when you would choose to interfere in a tag team match on your partner's behalf, a certain amount of time would pass and you would automatically return to your corner. Earl will now physically restrain you and through a series of gestures will explain how you need to get out of the ring, or else. He'll clap his hands, point at the corner, and even give you a shove or punch to prove his point. Adding even more to the new features is the ability to take the fight into the stands, where the crowd, made up of moving two-dimensional standees, will move aside and watch the fight from a safe distance. The contrast between the realistic wrestlers and the comically poor-looking audience makes you think that this feature should have been held off until technology can support interactive, three-dimensional crowds.Perhaps the most dramatic change has occurred with the story mode and how it has evolved since SmackDown! 2. No longer are you forced to sit through other matches that may take place during the course of an event, because the focus has been laid entirely on your chosen wrestler and his or her actions. Each event will open up with an in-game story sequence where your wrestler may interact with Vince McMahon or another wrestler. A selection of dialogue options is available, and they allow the storyline to branch in the direction you desire. When a key decision must be made, outside of dialogue, the game dramatically shifts into a first-person point of view, which lets you explore the arena and surrounding areas for a brief period of time. In this first-person mode, you can walk up to another wrestler or a personality such as Michael Cole to initiate the next story sequence, which can lead to a match or an interview. Progressing through the story mode as any single wrestler chronicles your quest for a title belt, and it can be any belt at all, from the Light Heavyweight title, to the Women's belt, all the way up to the WWF Championship. Many of the characters have individually scripted sequences, which were tailor-made to fit that character's style and personality. Some characters may become romantically involved, while others will put on an impressive performance during an interview. The drawback to such an in-depth, detailed story mode is that it isn't open-ended. Once you've reached the title belt, the credits roll, and you have the option to start anew with someone else or to simply try to defend the belt. A bit of extra life is added when you play through the story mode as a created wrestler, and the title history does go on indefinitely, but the repetitiveness of many of the story mode sequences can grow tiresome rather quickly. There's a definite incentive to keep playing, however, as you can collect SmackDown! cards that unlock many hidden features. The action is fast and furious in the 8-man survival match. On the graphical side, JBI both impresses and disappoints. The character models look nearly identical to those in SmackDown! 2, although they are smoother around the edges and feature some incredible likenesses to the real-life wrestlers. Due to limitations of the game engine, the hair is very flat and poorly done (wrestlers' predisposition toward long hair doesn't help any), and the aforementioned two-dimensional audiences take away from the otherwise impressive visuals. The engine's predisposition toward flat polygons is also readily apparent in the outdoor sequences, and in the Undertaker's entrance, where the wheels on vehicles don't spin as they move. The many different areas you can explore, which include the ring, backstage, dressing rooms, parking lot, and nearby restaurants, are nicely done and a pleasure to see for the first time. It's most impressive to see many of these locales up close and to be able to actually take a look at the smaller details like the designs on T-shirts in the concession stand or the miniaturized version of your current match as it plays on a television backstage. If there's something that the game engine genuinely excels at, however, it's that it can handle eight very well animated wrestlers fighting at once, with not a hint of slowdown. The action always moves at a very brisk pace, and the game just exudes energy. You can explore the arena in first person... The ring entrances are perhaps the most impressive part of the SmackDown! Just Bring It experience and are amazing to watch. The entrance videos look amazing as they stream off the DVD and onto the Titantron, and the music in most cases is spot-on. Some of the more popular characters, like Lita, The Rock, and Chris Jericho, have full-screen sequences that mimic the attention their entrances receive on television. An announcer calls out the wrestler's vital stats, including nickname, home city, and weight, adding nicely to the televised feel of the presentation. The animation is spectacular; each subtle movement made as the wrestler strolls to the ring seems to have been stripped directly from the real-world counterpart. Flashy-looking pyrotechnics are used, which in nearly every instance faithfully duplicate those used during the actual wrestlers' entrances. Topping off the excellent entrance routines is the great flashbulb effect that really brings it all together. Some of the entrances are pretty lengthy and may seem drawn out, but you can skip through them at any time.Perhaps the most dramatic change has occurred with the story mode and how it has evolved since SmackDown! 2. No longer are you forced to sit through other matches that may take place during the course of an event, because the focus has been laid entirely on your chosen wrestler and his or her actions. Each event will open up with an in-game story sequence where your wrestler may interact with Vince McMahon or another wrestler. A selection of dialogue options is available, and they allow the storyline to branch in the direction you desire. When a key decision must be made, outside of dialogue, the game dramatically shifts into a first-person point of view, which lets you explore the arena and surrounding areas for a brief period of time. In this first-person mode, you can walk up to another wrestler or a personality such as Michael Cole to initiate the next story sequence, which can lead to a match or an interview. Progressing through the story mode as any single wrestler chronicles your quest for a title belt, and it can be any belt at all, from the Light Heavyweight title, to the Women's belt, all the way up to the WWF Championship. Many of the characters have individually scripted sequences, which were tailor-made to fit that character's style and personality. Some characters may become romantically involved, while others will put on an impressive performance during an interview. The drawback to such an in-depth, detailed story mode is that it isn't open-ended. Once you've reached the title belt, the credits roll, and you have the option to start anew with someone else or to simply try to defend the belt. A bit of extra life is added when you play through the story mode as a created wrestler, and the title history does go on indefinitely, but the repetitiveness of many of the story mode sequences can grow tiresome rather quickly. There's a definite incentive to keep playing, however, as you can collect SmackDown! cards that unlock many hidden features.On the graphical side, JBI both impresses and disappoints. The character models look nearly identical to those in SmackDown! 2, although they are smoother around the edges and feature some incredible likenesses to the real-life wrestlers. Due to limitations of the game engine, the hair is very flat and poorly done (wrestlers' predisposition toward long hair doesn't help any), and the aforementioned two-dimensional audiences take away from the otherwise impressive visuals. The engine's predisposition toward flat polygons is also readily apparent in the outdoor sequences, and in the Undertaker's entrance, where the wheels on vehicles don't spin as they move. The many different areas you can explore, which include the ring, backstage, dressing rooms, parking lot, and nearby restaurants, are nicely done and a pleasure to see for the first time. It's most impressive to see many of these locales up close and to be able to actually take a look at the smaller details like the designs on T-shirts in the concession stand or the miniaturized version of your current match as it plays on a television backstage. If there's something that the game engine genuinely excels at, however, it's that it can handle eight very well animated wrestlers fighting at once, with not a hint of slowdown. The action always moves at a very brisk pace, and the game just exudes energy. The ring entrances are perhaps the most impressive part of the SmackDown! Just Bring It experience and are amazing to watch. The entrance videos look amazing as they stream off the DVD and onto the Titantron, and the music in most cases is spot-on. Some of the more popular characters, like Lita, The Rock, and Chris Jericho, have full-screen sequences that mimic the attention their entrances receive on television. An announcer calls out the wrestler's vital stats, including nickname, home city, and weight, adding nicely to the televised feel of the presentation. The animation is spectacular; each subtle movement made as the wrestler strolls to the ring seems to have been stripped directly from the real-world counterpart. Flashy-looking pyrotechnics are used, which in nearly every instance faithfully duplicate those used during the actual wrestlers' entrances. Topping off the excellent entrance routines is the great flashbulb effect that really brings it all together. Some of the entrances are pretty lengthy and may seem drawn out, but you can skip through them at any time.SmackDown! Just Bring It offers a huge assortment of different game modes to choose from, including such favorites as the hell in a cell matches (cage matches that come in the single, tag, and six-man varieties), TLC (tables, ladders, and chairs), survival matches (think battle royal, with up to eight men in the ring at once), royal rumbles (four men in the ring, a new wrestler joining every two minutes), and dozens more. Nearly every gimmick match ever witnessed (save perhaps the ever-popular and overused bra and panties match) can be re-created using the options available. Taking part in the larger matches is made easier than ever before with the color-coded facing indicator, which lets you select which enemy to target without need of a giant directional arrow to ruin the experience. It does become irksome at times when you're in the middle of a frenzied match--you still have to scroll through the referee and your tag team partner--and it would have been nice to be able to switch this off. ...or take in the view of the streets outside. Hard-core matches are fought out of the ring, either backstage or outside of the arena entirely, with the referee tagging along to make the count. You're free to perform aerial maneuvers off bookcases and can pick up nearly anything to use as a weapon, including potted plants, soda cans, fire extinguishers, and trash cans. Tables, ladders, and folding chairs return, with only a few minor adjustments. The larger objects still slide out of the way when pushed by the characters or when a move is performed near them. Interestingly enough, tables and other objects can now be stacked on top of each other, if done very carefully, and you can sit in folding chairs, although you can't perform drop toeholds into chairs or finishers through tables. Don't expect any blood, however--the violence stays clean. The addition of color commentary is perhaps the most notable change that has happened to the series. THQ acquired the voice talents of announcer Michael Cole and WWF Superstar Tazz, who has established himself as a hard-core legend, trainer of WWF prospects, and part-time announcer. Sadly, the commentary, albeit well intentioned, detracts from the experience. The inflection in Michael Cole's, and sometimes Tazz's, play-by-play is far from ideal for stringing together bits of dialogue into coherent sentences. The excited way Cole yells out the names of moves or WWF Superstars contrasts horribly with the tone of the corresponding statements they are attached to. For example, Cole may exclaim ~Lita (insert pause) is really a great person.~ Why he chose to relay this important bit of personal information during a match is not immediately apparent, and the scriptwriter could have easily come up with something more relevant. The same shout may also be repeated several times in a match, and you can get pretty tired of hearing ~Irish Whip!~ over and over again. Tables, ladders, and chairs, oh my! While this critique should not be misconstrued as a personal attack against the abilities of Michael Cole or Tazz, it is intended to strongly point out that the direction they were given could have benefited immeasurably from a few careful observations of the excellent commentary in some sports games, such as EA's Madden games or Sega's NFL 2K series. In fact, prolonged exposure to Michael Cole's and Tazz's remarks will not only put you off to the game but also may have you racing for the welcome option to toggle the commentary off completely. To top off the disappointment, when the game was first being developed, Michael Cole and Tazz were standing at ringside and could be attacked during matches, but this feature has been removed from the final version, along with the prospect of punishment that could have been doled out after particularly lousy calls. It's also worth noting that when Tazz makes a ring appearance, he still commentates his own match. Despite the negative aspects of the commentary, some of it can be pleasing the first time around. Although the game itself doesn't feature location damage, the announcers will allude to it with calls like ~Tremendous pain to the back of the head!~SmackDown! Just Bring It offers a huge assortment of different game modes to choose from, including such favorites as the hell in a cell matches (cage matches that come in the single, tag, and six-man varieties), TLC (tables, ladders, and chairs), survival matches (think battle royal, with up to eight men in the ring at once), royal rumbles (four men in the ring, a new wrestler joining every two minutes), and dozens more. Nearly every gimmick match ever witnessed (save perhaps the ever-popular and overused bra and panties match) can be re-created using the options available. Taking part in the larger matches is made easier than ever before with the color-coded facing indicator, which lets you select which enemy to target without need of a giant directional arrow to ruin the experience. It does become irksome at times when you're in the middle of a frenzied match--you still have to scroll through the referee and your tag team partner--and it would have been nice to be able to switch this off.Hard-core matches are fought out of the ring, either backstage or outside of the arena entirely, with the referee tagging along to make the count. You're free to perform aerial maneuvers off bookcases and can pick up nearly anything to use as a weapon, including potted plants, soda cans, fire extinguishers, and trash cans. Tables, ladders, and folding chairs return, with only a few minor adjustments. The larger objects still slide out of the way when pushed by the characters or when a move is performed near them. Interestingly enough, tables and other objects can now be stacked on top of each other, if done very carefully, and you can sit in folding chairs, although you can't perform drop toeholds into chairs or finishers through tables. Don't expect any blood, however--the violence stays clean. The addition of color commentary is perhaps the most notable change that has happened to the series. THQ acquired the voice talents of announcer Michael Cole and WWF Superstar Tazz, who has established himself as a hard-core legend, trainer of WWF prospects, and part-time announcer. Sadly, the commentary, albeit well intentioned, detracts from the experience. The inflection in Michael Cole's, and sometimes Tazz's, play-by-play is far from ideal for stringing together bits of dialogue into coherent sentences. The excited way Cole yells out the names of moves or WWF Superstars contrasts horribly with the tone of the corresponding statements they are attached to. For example, Cole may exclaim ~Lita (insert pause) is really a great person.~ Why he chose to relay this important bit of personal information during a match is not immediately apparent, and the scriptwriter could have easily come up with something more relevant. The same shout may also be repeated several times in a match, and you can get pretty tired of hearing ~Irish Whip!~ over and over again. While this critique should not be misconstrued as a personal attack against the abilities of Michael Cole or Tazz, it is intended to strongly point out that the direction they were given could have benefited immeasurably from a few careful observations of the excellent commentary in some sports games, such as EA's Madden games or Sega's NFL 2K series. In fact, prolonged exposure to Michael Cole's and Tazz's remarks will not only put you off to the game but also may have you racing for the welcome option to toggle the commentary off completely. To top off the disappointment, when the game was first being developed, Michael Cole and Tazz were standing at ringside and could be attacked during matches, but this feature has been removed from the final version, along with the prospect of punishment that could have been doled out after particularly lousy calls. It's also worth noting that when Tazz makes a ring appearance, he still commentates his own match. Despite the negative aspects of the commentary, some of it can be pleasing the first time around. Although the game itself doesn't feature location damage, the announcers will allude to it with calls like ~Tremendous pain to the back of the head!~Aside from the commentary, the rest of SmackDown! JBI's audio features are passable and occasionally pleasing. During matches, thuds, slaps, and crashing noises make up the bulk of the sound effects, while the wrestlers themselves are silent. You can hear the crowd come alive during ring entrances, although there are no chants or boos. The ring entrances themselves feature the correct music in most cases, including Limp Bizkit's rendition of ~Rollin'~ for the Undertaker entrance and the Disturbed theme for Stone Cold Steve Austin. The rest of the audio track is charged with plenty of energy and rock-heavy beats, which sadly get repeated a tad too often to be truly enjoyed. Smack talkin', hard-hitting WWF action. The create-a-wrestler feature is the most improved yet and matches up favorably with the create-a-wrestler features in games like the N64's WWF No Mercy. There are hundreds of moves to choose from, and you have a lot of leeway in the modification of your created wrestler's appearance. We were able to create a great facsimile of Metro City mayor Mike Haggar, of Final Fight fame, as well as extremely convincing duplicates of several popular personas not on the original roster, such as Bill Goldberg, Rob Van Dam, Booker T., and Kevin Nash. The tools you use to create these wrestlers are perhaps the most polished in licensed wrestling game history. You can preview your wrestler pulling off maneuvers as you scroll through the lists, and aside from the initial load times, wrestler creation is painless. Entrance movies can be watched on a viewer, which also allows for the sampling of entrance themes, including a series of original compositions that are perfect for gimmicky creations. Your created Superstar can then be assigned a premade taunt, or one can be custom-made in the create-a-taunt mode, where you can custom-mold your wrestler's movements through 15 frames of animation. Wrestlers can also be assigned to stables, whose rosters can also be edited to keep up with the constant changes in the WWF. Wrestling fans trying to anticipate how up to date the events and characters in the game are will find that the roster, hidden characters, and story mode sequences date the game at approximately two weeks before the infamous Invasion storyline. As the recent merger of federations can possibly be marked as the most influential and impacting event in wrestling history, it may be disappointing to find that very few of the ECW and WCW stars who have recently become so popular are available, and in the short time since this event, several wrestlers have moved on to new gimmicks. This has, of course, always been the case with non-fictitious wrestling games, and due to the inherent time constraints involved in development, they may always lag behind the real-world counterparts, and so this really can't be held against the game. Wrestling fans with an extra 50 dollars lying around, and who are still getting plenty of enjoyment out of playing SmackDown! 2: Know Your Role, should feel confident that Just Bring It will deliver. It can be amazingly fun at times, and the production value, laden with WWF panache, is top-notch. Those game enthusiasts not particularly enamored with the WWF may still enjoy what SmackDown! Just Bring It offers on a purely arcade level, but this is expressly a product made to appease fans of sports entertainment. In nearly all possible aspects, it's an improvement upon what we've seen before, even though it doesn't make the dramatic leap from PS1 to PS2 that some other classic PlayStation series' have made. There's no doubt that wrestling fans will eat this one up, but anyone who wants a game with lots of pick-up-and-play appeal may want to give SmackDown! Just Bring It a shot.Aside from the commentary, the rest of SmackDown! JBI's audio features are passable and occasionally pleasing. During matches, thuds, slaps, and crashing noises make up the bulk of the sound effects, while the wrestlers themselves are silent. You can hear the crowd come alive during ring entrances, although there are no chants or boos. The ring entrances themselves feature the correct music in most cases, including Limp Bizkit's rendition of ~Rollin'~ for the Undertaker entrance and the Disturbed theme for Stone Cold Steve Austin. The rest of the audio track is charged with plenty of energy and rock-heavy beats, which sadly get repeated a tad too often to be truly enjoyed. The create-a-wrestler feature is the most improved yet and matches up favorably with the create-a-wrestler features in games like the N64's WWF No Mercy. There are hundreds of moves to choose from, and you have a lot of leeway in the modification of your created wrestler's appearance. We were able to create a great facsimile of Metro City mayor Mike Haggar, of Final Fight fame, as well as extremely convincing duplicates of several popular personas not on the original roster, such as Bill Goldberg, Rob Van Dam, Booker T., and Kevin Nash. The tools you use to create these wrestlers are perhaps the most polished in licensed wrestling game history. You can preview your wrestler pulling off maneuvers as you scroll through the lists, and aside from the initial load times, wrestler creation is painless. Entrance movies can be watched on a viewer, which also allows for the sampling of entrance themes, including a series of original compositions that are perfect for gimmicky creations. Your created Superstar can then be assigned a premade taunt, or one can be custom-made in the create-a-taunt mode, where you can custom-mold your wrestler's movements through 15 frames of animation. Wrestlers can also be assigned to stables, whose rosters can also be edited to keep up with the constant changes in the WWF. Wrestling fans trying to anticipate how up to date the events and characters in the game are will find that the roster, hidden characters, and story mode sequences date the game at approximately two weeks before the infamous Invasion storyline. As the recent merger of federations can possibly be marked as the most influential and impacting event in wrestling history, it may be disappointing to find that very few of the ECW and WCW stars who have recently become so popular are available, and in the short time since this event, several wrestlers have moved on to new gimmicks. This has, of course, always been the case with non-fictitious wrestling games, and due to the inherent time constraints involved in development, they may always lag behind the real-world counterparts, and so this really can't be held against the game. Wrestling fans with an extra 50 dollars lying around, and who are still getting plenty of enjoyment out of playing SmackDown! 2: Know Your Role, should feel confident that Just Bring It will deliver. It can be amazingly fun at times, and the production value, laden with WWF panache, is top-notch. Those game enthusiasts not particularly enamored with the WWF may still enjoy what SmackDown! Just Bring It offers on a purely arcade level, but this is expressly a product made to appease fans of sports entertainment. In nearly all possible aspects, it's an improvement upon what we've seen before, even though it doesn't make the dramatic leap from PS1 to PS2 that some other classic PlayStation series' have made. There's no doubt that wrestling fans will eat this one up, but anyone who wants a game with lots of pick-up-and-play appeal may want to give SmackDown! Just Bring It a shot."}