{"ref": "https://www.gamespot.com/reviews/godzilla-unleashed-review/1900-6183950/", "date": "December 12, 2007", "game_name": "Godzilla Unleashed: Double Smash", "text": "Common thoughts when watching a Godzilla movie: ~If you told girls you were the guy in the rubber suit, would they believe you?~, and ~If Godzilla spit at King Kong, wouldn't all his hair catch on fire? How is that even a contest?~ A less common thought, on the other scaly claw, is: ~Man, Godzilla is pretty cool, but someone should let that guy off his leash!~ Don't tell this to Atari, though, because the company seems to be under the impression that it has finally liberated everyone's favorite fire-spitting lizard in its recent city-crushing romp, Godzilla: Unleashed. Ironically, Godzilla and company have never been as leashed as they are in this monster fighting game. Bound by wonky Wii controls, a terrible targeting scheme, a lame campaign, and generally terrible artificial intelligence, this game might be better served with a title like Godzilla: Hits Like A Wuss, Godzilla: Doesn't Want You To See Him Like This, or maybe just Godzilla: Leashed. However, at the very least you can still knock down Mothra with flame breath and then hit her with a small building while she's down. That counts for something, as does the fact that the game is mostly playable. In fact, at some points it even plays itself. Even Godzilla is impressed by Mecha Godzilla's robo-hops. But first, the god-awful plot. Giant, powerful crystals land on earth and drive most of its monsters insane. As Godzilla or one of a handful of good monsters, you have to travel to various locations, subdue rampaging titans, destroy crystals, and stop a crazy army guy from killing you. The whole campaign takes about three hours to beat, at which point you gain a certain number of store points you can use to unlock more monsters, even though they all play roughly the same. The idea is that you'll actually grind through story mode over and over to unlock the likes of Space Godzilla (which would take at least 10 hours). But really, after about two plays, you will have wrung every ounce of blood from this inert space rock. Your average level goes something like this: Several monsters duke it out in a bad approximation of a major city, and from the perspective of a camera that is completely out of your control. One of the monsters is you, and another might be juiced up as a result of scattered crystals. You can proceed by destroying the crystals (which can be difficult to hit if your monster thinks you're aiming for something else), by defeating the bad monsters, or by dying. However, only one of these options requires you to actually play. If you do nothing, there is a chance the bad monster will be defeated by the other CPU-controlled monsters, or that they'll come burn you down. Either way, the level is considered complete, and you move on--even if you die. Because, as you know, Godzilla never dies. If you decide to fight the other monsters (there are usually several), you can take one of two approaches to guaranteed victory. You can run circles around your foes until they inevitably turn on each other, and then pelt them with breath attacks until only one badly wounded monster remains. Or, you can just wade in like an idiot and die. If you elect to use the breath-attack strategy, you'll run into several interesting issues. For instance, every level is bustling with small, durable aircraft. Couple this with the fact that your monster automatically aims its blasts at the closest targets, and you'll end up firing straight up into the air when you meant to shoot straight into Megalon's face. You can attempt to steer your ray toward your opponent with the Nunchuk's analog stick, but this doesn't work all that often. But fret not; two factors make this situation bearable: You can always recharge more breath, and when you do make contact with a monster foe, you can potentially pelt it with your fiery wrath for about 30 whole seconds. The resulting breathfests are fun to look at but incredibly tedious to play. Charging your projectile attack to its fullest takes nearly a minute, and after all that, you can easily waste all four charges (each worth a good five seconds of firepower) on UFOs and warplanes, without actually hitting anything monstrous. Cue outraged Godzilla roar. Things go a little differently if you're fighting a monster one-on-one. The CPU AI tends to be very aggressive, as well as incredibly effective at countering any melee strikes you throw its way. However, this is okay because you can charge your breath attack while blocking. Normally, if you simply stood there and blocked, the CPU monster would run up and throw you. But if you charge your breath at the same time, it will usually just stand in place until you have a lungful ready to spit in its face. Another day in the life of Anguirus; stomped and lasered at the same time. When you do finally fire, one of two things will happen. You will either blast the creature for an extended period of time and damage, during which it will try in vain to walk toward you (rather than taking cover), or it will fire back with a beam of its own. When this happens, the beam attacks meet and initiate a minigame wherein a pulse travels ever faster back and forth between the monsters. To keep from eating the pulse and getting blasted, you have to swipe the remote as if you were hitting a tennis ball. It's Pong in one dimension, and it's also Godzilla: Unleashed's most engaging play mechanic. That's how bad this game is. At least it looks pretty. When you're far from other monsters and the camera pulls out to keep everyone on the screen, it really looks like you're watching a monster battle in a realistic cityscape from a bird's-eye view. The breath attacks cut through the air in bright oranges and yellow, wavy lines, and warplanes and UFOs shoot rockets and rays at all and sundry. Unfortunately, the sound bytes aren't great. Most (though not all) of the monster noises are here, but the music is bad, the voice acting is horrendous, and the effects are generic. We aren't sure why you'd try to inflict this disaster on multiple players, though that's an option. Really, though, you shouldn't even inflict this on one player: namely, yourself. Although Godzilla: Unleashed looks good, it's an incredibly boring game to play, with busted mechanics and short-bus AI. The short and wimpy single-player campaign doesn't help matters, nor does the fact that the game seems to expect you to play through it a dozen times to unlock some of the cooler monsters. All in all, you should let this sleeping dragon lie."}