{"ref": "https://www.gamespot.com/reviews/nascar-thunder-2002-review/1900-2818184/", "date": "October 16, 2001", "game_name": "NASCAR Thunder 2002", "text": "EA Sports' NASCAR Thunder 2002 is a racing game that's best enjoyed over time. Although it incorporates a slew of subtle updates and adjustments to last year's NASCAR 2001, you can't really gauge their full impact in a measure of hours. Stunted graphics aside, NASCAR Thunder 2002 is a Winston Cup fanatic's dream.As with last year's model, NASCAR Thunder 2002 is chock-full of options and features. A touching memorial to Dale Earnhardt opens the game and then gives way to three game modes: quick race, season, and career. In quick race, you have the option of choosing any of 36 real-life drivers and any of the 23 official NASCAR tracks in races consisting of between two and 400 laps. The season and career modes are nearly identical in that your goal is to win eight championships during a full 20-year profession, but the career mode is the only one where earnings and sponsorship enable you to purchase vehicle and handling upgrades. If you don't cotton to the likes of Dale Jarret, Bobby Labonte, Michael Waltrip, or the rest of the Winston Cup stable, you can always create your own driver and car using the game's totally revamped character editor. This year, four car types (Pontiac, Ford, Chevrolet, and Dodge) are available, as are a number of actual product sponsors, such as Nikon, Goodyear, and Outback Steakhouse. You can save an unlimited number of drivers and vehicles, provided you don't mind sacrificing 128KB each to the memory card demon.Whether you choose one of the season modes or partake of a quick race, the pleasure of NASCAR Thunder 2002 is its realism. The track physics are amazingly genuine, right down to the level at which tire wear and body aerodynamics degrade handing later in the race. Additionally, the draft effect in this year's edition is immaculate, giving the right amount of boost without seeming arcadelike. Although a number of assistance features are enabled by default, such as automatic shifting and CPU-controlled stabilizing, the in-game adjustments menu lets you adjust the game to your tastes--CPU difficulty, braking, damage, fuel load, and tire wear are all negotiable. Features such as transmission type, tire pressure, rear spoiler angle, suspension, wedge, and gear ratio can also be adjusted, if you're so inclined. If there's one Achilles' heel in NASCAR Thunder 2002, it's that the game lacks the wonderfully situational beat the heat mode found in EA's other recent NASCAR racer, NASCAR Heat 2002.As the season progresses, the game will track your accomplishments in six per-race and 16 overall statistics categories, such as finish position, margin of victory, winnings, laps led, and average finish. The game also records leader board and sponsorship winnings as well. This latter category, sponsorship, is new to NASCAR Thunder 2002, and it's a wonderful upgrade. When you sign with sponsors in season or career mode, they'll provide you with funds depending on your race position. The better and more aggressive you race, the more money you can earn. Perform exceptionally and you can even accept a package deal with a top-tier sponsor. This is in addition to the purses and bonus awards you can earn for top finishes during the season. Not only do these money-grubbing features match real life, but they also bear upon your success, as you can't purchase car upgrades without cash.Even though it's a lightweight simulation, NASCAR Thunder 2002's visuals are just as displeasing as last year's. The pixilated vehicles and jagged lines of NASCAR 2001 are gone, but not entirely erased, as the game still has a somewhat blocky feel to it. The frame rate is unsteady, often stuttering when more than 10 cars are onscreen at once. In terms of overall background detail, there isn't much past the grandstands and track vehicles to grab your attention, although this year's game benefits from the addition of real-time shadowing and ubiquitous skid-mark replication. The car models remain spectacular, while the new damage model lets you witness side panels and hoods fly apart with wild abandon. Still, considering the strides made by Gran Turismo 3 and Test Drive Le Mans, there's no reason NASCAR Thunder 2002 has to look so dated. However, in contrast to its visual shortcomings, NASCAR Thunder 2002 sounds great. Engine noises, collisions, and metal-on-cement sound samples are present for a variety of situations--some so subtle that you'll only hear them on specific tracks! Smartly, the daft announcer from last year's game has been replaced with a strong underlying soundtrack and a useful pit-crew radio. Pit-crew chatter is an invaluable part of this year's game, with such undeniably useful phrases as, ~Number seven edging up high,~ or, ~You're heading around too fast.~ Before and after each race, an announcer provides a commentary on the day's events, but it's not so longwinded as to become stale. As far as incidentals, the game supports up to four-players in the quick race mode, includes a few unlockable hidden cars, and sports video previews for FIFA 2002, F1 2001, Madden 2002, NHL 2002, NBA Live 2002, Triple Play 2002, and NCAA Football 2002. You can also replay the championship videos once you've unlocked them. If you can see past its crunchy visuals, NASCAR Thunder 2002 is absolutely the best NASCAR title available for the PlayStation 2. From the subtle to the garish, it just feels like you're in the middle of a deep Sunday race. NASCAR Heat 2002 may have the lock on exciting arcade-style NASCAR action, but for realism buffs and purists, NASCAR Thunder 2002 is where it's at.Even though it's a lightweight simulation, NASCAR Thunder 2002's visuals are just as displeasing as last year's. The pixilated vehicles and jagged lines of NASCAR 2001 are gone, but not entirely erased, as the game still has a somewhat blocky feel to it. The frame rate is unsteady, often stuttering when more than 10 cars are onscreen at once. In terms of overall background detail, there isn't much past the grandstands and track vehicles to grab your attention, although this year's game benefits from the addition of real-time shadowing and ubiquitous skid-mark replication. The car models remain spectacular, while the new damage model lets you witness side panels and hoods fly apart with wild abandon. Still, considering the strides made by Gran Turismo 3 and Test Drive Le Mans, there's no reason NASCAR Thunder 2002 has to look so dated.However, in contrast to its visual shortcomings, NASCAR Thunder 2002 sounds great. Engine noises, collisions, and metal-on-cement sound samples are present for a variety of situations--some so subtle that you'll only hear them on specific tracks! Smartly, the daft announcer from last year's game has been replaced with a strong underlying soundtrack and a useful pit-crew radio. Pit-crew chatter is an invaluable part of this year's game, with such undeniably useful phrases as, ~Number seven edging up high,~ or, ~You're heading around too fast.~ Before and after each race, an announcer provides a commentary on the day's events, but it's not so longwinded as to become stale.As far as incidentals, the game supports up to four-players in the quick race mode, includes a few unlockable hidden cars, and sports video previews for FIFA 2002, F1 2001, Madden 2002, NHL 2002, NBA Live 2002, Triple Play 2002, and NCAA Football 2002. You can also replay the championship videos once you've unlocked them. If you can see past its crunchy visuals, NASCAR Thunder 2002 is absolutely the best NASCAR title available for the PlayStation 2. From the subtle to the garish, it just feels like you're in the middle of a deep Sunday race. NASCAR Heat 2002 may have the lock on exciting arcade-style NASCAR action, but for realism buffs and purists, NASCAR Thunder 2002 is where it's at."}