{"ref": "https://www.gamespot.com/reviews/world-tour-soccer-2002-review/1900-2848725/", "date": "May 17, 2006", "game_name": "World Tour Soccer 2002", "text": "Despite being almost a year and a half old, the North American PlayStation 2 has yet to receive a soccer game from any developer besides EA. And while the FIFA series has always succeeded in supplying an adequate game of ~footie,~ the hard-core soccer fan--like any good fanatic--is always looking for grass-in-the-eyes realism. It is with this in mind that Sony has decided to publish World Tour Soccer 2002 in the US under the 989 Sports banner. Developed by soccer-loving European developer Team Soho, WTS 2002 places an emphasis on action on the pitch and supplies a few of the gameplay modes that are missing from EA's popular FIFA series.Despite the lack of a franchise mode, World Tour Soccer 2002 has a robust selection of gameplay options to explore. You can play an exhibition match against friends and choose from more than 300 teams in 23 international leagues. The FIFA license has been purchased for the game, so all the real players are included with their real names, but club teams such as Juventus and Arsenal will have to be renamed if you have a thing for authenticity. In addition to the rudimentary exhibition mode, you can choose from nine different international leagues to play, as well as adjust the length of the seasons and games to your tastes or enter a number of special competitions, such as super team championships, time warp cups featuring players of old, custom leagues, and a custom cup option that will satisfy those who were unhappy about the alteration of the tournament option in FIFA. As if these gameplay modes weren't enough, there's also a bevy of international competitions to enter, such as the World Cup and its qualifying matches on each continent. The only downside to the game's structure, besides the lack of a franchise mode, is that it tracks just four different statistics per player. Anyone who enjoys watching a player's tackles or steals pile up will be out of luck. But the list of gameplay modes is more than adequate, and for a first-time franchise, World Tour Soccer 2002 can already hang with the big dogs of its genre.Having plenty of gameplay modes to choose from is one thing, but making good use of them out on the pitch is another. World Tour Soccer 2002 can also compete in this regard. Passing is almost too easy, and it lacks the finesse of the passing system found in FIFA 2002, but its simplicity lets you make use of the game's many special dribbles instead of concentrating on passing to your teammates with just enough mustard on the ball. The special dribbles actually work in shaking defenders, provided you choose the right move for the situation, and performing a give-and-go is as easy as tapping the pass button again before your player receives the ball. Before each game, you're asked to enter your starting lineup and its field positioning before mapping up to four team strategies to the right analog stick. This makes it very easy to switch team strategy on the fly and quickly turn an intercepted pass into an all-out rush. The difficulty ramp as you scale the game's four difficulty settings is nearly perfect--each increase in difficulty gradually increases the pressure on the player until generating even a few shots can be almost impossible when the computer is set to master class difficulty. One major issue with the controls in World Tour Soccer 2002 is that controlling players can seem sluggish. Many times, you will make a cut, but it takes half a second before it takes place onscreen. You eventually learn to compensate for the delay, but more responsive controls would have been nice.If there's one chink in World Tour Soccer 2002's armor, it's the graphics. Player models have been crafted to emulate their real-world counterparts, and while some players look strikingly realistic, others could use a few more ~mulletgons~--or, in layman's terms, more polygons dedicated to their hairstyles. The models also appear a bit awkward around the shoulder region; it's as if their heads are trying to dislocate from the remainder of their bodies. Uniform textures are low resolution, which makes them appear blurry. There are just eight different stadiums to choose from, but their structural differences are so slight that only the flags waving in the crowd will give them away. Animation is smooth--especially for the special dribbles--but players almost always react to goals, argue calls, or anguish over near misses in the same manner. While the pitch appears worn-out around the goals, it does not deteriorate as the game wears on. The rain effects are also minimal. You won't find players sloshing through puddles when it's really coming down, and the ball seems to be unaffected by the inclement weather. The frame rates also tend to bog down when there's a great deal of action in front of the goal or during replays when players are shown up-close, but most of the time, it runs predominantly smooth. While it's no stunning graphical achievement, World Tour Soccer 2002's graphics convey just enough realism to keep your mind from having to fill in the blanks. Dry British announcer Peter Drury handles the play-by-play commentary, and his statements will repeat multiple times per game. His commentary generally lacks any sort of wit or insight into the game at hand or any past history between two clubs or countries. The ambient sounds in the game are adequate, but you won't find any of the little extras that really make a sports game sound immersive, like team-specific chants or onfield trash talking. Making matters worse, the crowd tends to cheer the same for both the visiting and home teams. In all, World Tour Soccer 2002's sound hovers in mediocrity and fails to impress. If you're not concerned with having the most technically advanced soccer game on the planet but demand more from gameplay than what the FIFA series is currently offering, World Tour Soccer 2002 is a wise choice. The gameplay is tight and intuitive, and the list of gameplay modes includes everything but the franchise mode. The graphics and sound fall short of the competition, but this is a worthy trade-off for those who spend a lot of time with their sports video games.If there's one chink in World Tour Soccer 2002's armor, it's the graphics. Player models have been crafted to emulate their real-world counterparts, and while some players look strikingly realistic, others could use a few more ~mulletgons~--or, in layman's terms, more polygons dedicated to their hairstyles. The models also appear a bit awkward around the shoulder region; it's as if their heads are trying to dislocate from the remainder of their bodies. Uniform textures are low resolution, which makes them appear blurry. There are just eight different stadiums to choose from, but their structural differences are so slight that only the flags waving in the crowd will give them away. Animation is smooth--especially for the special dribbles--but players almost always react to goals, argue calls, or anguish over near misses in the same manner. While the pitch appears worn-out around the goals, it does not deteriorate as the game wears on. The rain effects are also minimal. You won't find players sloshing through puddles when it's really coming down, and the ball seems to be unaffected by the inclement weather. The frame rates also tend to bog down when there's a great deal of action in front of the goal or during replays when players are shown up-close, but most of the time, it runs predominantly smooth. While it's no stunning graphical achievement, World Tour Soccer 2002's graphics convey just enough realism to keep your mind from having to fill in the blanks. Dry British announcer Peter Drury handles the play-by-play commentary, and his statements will repeat multiple times per game. His commentary generally lacks any sort of wit or insight into the game at hand or any past history between two clubs or countries. The ambient sounds in the game are adequate, but you won't find any of the little extras that really make a sports game sound immersive, like team-specific chants or onfield trash talking. Making matters worse, the crowd tends to cheer the same for both the visiting and home teams. In all, World Tour Soccer 2002's sound hovers in mediocrity and fails to impress. If you're not concerned with having the most technically advanced soccer game on the planet but demand more from gameplay than what the FIFA series is currently offering, World Tour Soccer 2002 is a wise choice. The gameplay is tight and intuitive, and the list of gameplay modes includes everything but the franchise mode. The graphics and sound fall short of the competition, but this is a worthy trade-off for those who spend a lot of time with their sports video games."}