{"ref": "https://www.gamespot.com/reviews/dead-space-extraction-review/1900-6230774/", "date": "September 30, 2009", "game_name": "Dead Space: Extraction", "text": "Most on-rails shooters are modeled after their arcade counterparts and deliver nothing but the bare minimum of story required, last shorter than a roll of quarters, and reward often-mindless spray-and-pray tactics. Not so in Dead Space Extraction, which has been built from the ground up to offer a more strategic, story-oriented experience that acts as a second meaningful entry in the Dead Space universe. Extraction pulls no punches and delivers an uncompromised horror experience, complete with the series' famous strategic dismemberment, spooky atmosphere, and intense action. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Dead Space Extraction Video Review When the miners on the remote planet Aegis VII uncover and activate an alien artifact referred to as the marker, they unwittingly set into motion a chain of events that proves to be their end. As the colony tears itself apart due to the relic's maddening effects, four unlikely allies band together to fight their way free from the planet and the horrific monsters known as necromorphs that begin to appear. As you follow their escape to apparent freedom aboard the USG Ishimura mining ship, you roam its familiar, haunted corridors and unearth all manner of intriguing information about the events that took place there, the truth about the marker, and the cult-like Church of Unitology. Though there are a number of in-game cutscenes for conversation and exposition, action is always just around the corner. The hideous necromorphs are ceaseless in their single-minded desire to consume and convert living flesh, and unlike with traditional zombies, headshots don't always take them down. Instead, necromorphs have to be dismembered, and lucky for you, a mining colony and its mothership are chock-full of tools just waiting to be misused for intentional industrial accidents. Most of the weapons from Dead Space return, and they're joined by several newcomers, including the P-SEC pistol, the arc welder, and the rivet gun. Necromorphs tend to be slow and deliberate in nature, and because their limbs are your targets, you must match their careful pace. Every shot count, because while you can have up to four firearms at any time, only the relatively weak rivet gun--your default weapon--has unlimited ammo. This looks awful familiar Aiming is as simple as pointing your Wii Remote at the screen, which displays a targeting reticle crammed full of information, such as your weapon's attack spray pattern and how much ammo you've got left in your current clip. While this is all generally useful to know, the cursor unfortunately has the habit of concealing what you're trying to shoot at, particularly when you're aiming at specific limbs on enemies in the far distance. A more minimal approach would have been welcome. Beyond mere aiming, Extraction takes advantage of the Wii's motion controls by using them in ways that make sense and don't come off as gratuitous. For example, the only remote waggling you'll be doing is to brush off a necromorph currently in the act of eating your face or to activate a glowstick in a dark hallway. Each weapon has an alternate-fire mode that's activated by simply rotating the controller onto its side, and even the controls for the ripper--a saw that thrusts forward a controllable, rotating metal blade--are intuitive. Extraction also includes some helpful secondary features straight from its precursor to make your life a bit easier. By using your built-in stasis module, you can temporarily freeze necromorphs and certain environmental obstacles in place to make de-limbing easier or to get through fast-moving objects like fan blades. Kinesis, on the other hand, lets you pick up items from a distance and toss them as weapons or add them to your inventory. One bit of weirdness about kinesis is that you can use it almost whenever you want, which allows for some possibly awkward cutscenes during which you can break immersion by telekinetically harassing a teammate or tossing objects around without any reaction whatsoever. As you progress through the 10 missions in Extraction, you can find a variety of hidden text, audio, and video logs that help to fill you in on the backstory. Though Dead Space veterans may be disappointed to find that some logs are recycled from the original, these intriguing elements help shed light on the mystery of the marker. Hidden power nodes are used automatically to upgrade your firepower, and new weapons are liberally scattered all over. After each level, your progress is tallied up, and you're awarded bonuses such as health upgrades and challenge levels, which are story-less runs through the various environments of the game focused on battling wave after wave of necromorphs for a high leaderboard score. The most interesting unlockable, however, is the series of fully voice-acted motion comics that tell an alternate storyline concurrent to your own that further fleshes out the events that unfold in the Aegis system. Finally, both the single-player game and the challenge levels feature drop-in co-op play at any time, though this introduces its own issues. Each player has a supply of ammunition, which encourages players to mash the kinesis button over and over again to compete over drops, often to the detriment of the action. Also, with two cursors onscreen and the potential for them to overlap, it's much more likely that you'll have trouble figuring out exactly what it is you're aiming at. Your aiming reticle displays a lot of good info, but it also takes up a lot of room. Dead Space was one of the best-looking games of last year, and Extraction adheres to these high standards. The environments are highly detailed, and the realistic-looking, impressively animated characters are further enhanced by a fantastic voice cast that really brings the story to life. The gruesome-looking necromorphs die gory deaths, and they attack en masse without any frame-rate slowdown. However, as good as Extraction looks, it does suffer from occasional issues with the camera: because it tends to focus on the closest attacker, it sometimes pans in such a way that aiming at your other threats is difficult or impossible, particularly when dealing with flying necromorphs. Though it suffers from an occasional misstep, Dead Space Extraction is a great on-rails experience that brings all of the action and dismemberment of its predecessor to the Nintendo Wii intact. Fans of Dead Space will appreciate the copious amount of backstory presented, but even if you're not a marker-head, this first-person portrayal of a descent into madness is enticing on its own. Between its intense combat, fantastic visuals, and deep story, Dead Space Extraction is one game you shouldn't miss."}