{"ref": "https://www.gamespot.com/reviews/crazy-taxi-review/1900-2885470/", "date": "October 14, 2002", "game_name": "Crazy Taxi", "text": "The original Crazy Taxi from Sega's internal team Hitmaker was released in arcades in 1999, and it was subsequently ported to Sega's Dreamcast video game console in 2000. Both versions of the game were simple, fun racing games that let you play as a cabbie in search of fares to transport to their destinations as quickly as possible, performing as many dangerous stunts (like narrowly scraping past oncoming cars) as possible to earn extra tips from your impatient, thrill-seeking passengers. Hitmaker went on to create two console follow-ups, the most recent of which is Crazy Taxi 3 for the Xbox. Yet, for some reason, the very first Crazy Taxi game has just now been ported to the PC, but considering how the port turned out, it probably shouldn't have been. Hitmaker put the ~crazy~ in the original Crazy Taxi by keeping the game's general graphical detail low so the game could run at blazing speeds. Your simple-looking yellow cab flew through plain-looking cities and picked up colorful but blocky and low-polygon passengers. And the PC version of Crazy Taxi is just as colorful, and at the highest graphical settings--1280x960 resolution at 32-bit color--the game's introduction movie, which features in-game scenes, looks even better than the Dreamcast version. Unfortunately, when you actually try to play the game at those settings, the game chugs along even on a fast computer. Actually, the game's frame rate chugs along at the minimum settings of 640x480 resolution, 16-bit color, and the shortest draw distance, often slowing down or missing frames of animation entirely, which completely breaks up the game's flow. Apparently, the PC version just wasn't optimized well, which not only makes the game look worse, but it also severely compromises the gameplay. Like the Dreamcast version, the PC version has both an arcade city map and an ~original~ city map to drive through, and while the PC version has a brand-new ~crazy box~ minigame mode that wasn't in the original game, you'll probably spend most of your time on the arcade and original courses. Both the arcade and Dreamcast versions of Crazy Taxi had extremely smooth frame rates that really helped convey the sense of tearing around a city at breakneck speeds. Though you'll occasionally be able to play through some relatively smooth spots, you'll find that the frame rate will often take a hit just as you're starting to enjoy yourself, especially if you happen to run into an oncoming car and knock it over. However, the PC version does offer a few surprising new features, including a new soundtrack and the aforementioned minigame mode. The minigames are generally rather shallow tasks that require you to complete a simple puzzle using your taxi, such as knocking over a lane of bowling pins or crashing into a number of oversized balloons to pop them. They're generally rather short, and they're not especially fun on their own, though they generally don't suffer from the same frame rate problems as the rest of the game. Otherwise, the PC version has a new rock and roll soundtrack that seems fitting for the game, though it reuses the same voice samples for the game's four drivers, Axel, Gena, Gus, and B.D. Joe, as well as the pushy, sometimes foul-mouthed passengers they pick up. Releasing the original Crazy Taxi on the PC at this point doesn't seem to make much sense. Considering that the game itself includes only the arcade and original tracks and the limited crazy box mode, it's not certain you'll get much out of the game before you get fed up with its problematic frame rate. Besides, the original game is over three years old, the series is now up to its third game, and you can enjoy much of what made the original Crazy Taxi fun by stealing a taxi cab and picking up passengers in a game of Grand Theft Auto III, Rockstar's multifaceted free-form action game, which was released earlier this year for the PC. Alternately, if you can find them, you'd be better off just buying a Dreamcast console and a copy of the original Crazy Taxi, since the 2000 Dreamcast version looks better and plays better than the 2002 PC port."}