{"ref": "https://www.gamespot.com/reviews/i-am-setsuna-review/1900-6416482/", "date": "July 18, 2016", "game_name": "I Am Setsuna", "text": "There are times when I Am Setsuna's mimicry is too obvious for its own good, when you immediately recognize that it's a deliberate effort to trigger nostalgia for classic Japanese RPGs. But these moments don't tell the whole story. Poignant events and some delicate writing lend distinction to the otherwise archetypal cast, and you grow to appreciate how tenets of the genre are ignored in favor of trying something new. The juxtaposition of I Am Setsuna's numerous inventions and references make for an eye-opening examination of Japanese RPGs, and a satisfactory debut from developer Tokyo RPG Factory.In a world blanketed in snow and overridden with beasts, young Setsuna sets out to reach The Last Lands. It is there that she will fulfill her duty as a human sacrifice--a ritual held every decade to keep wild threats at bay. With the help of like-minded adventurers, you accompany Setsuna through caverns and forests, fending off creatures and thwarting--or recruiting--humans that try to stand in your way.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: I Am Setsuna - Video ReviewSetsuna would be the first to admit that her fate is tragic, but she remains ever steadfast and resolute in her charge. You can say the same for her companions, some of whom face very different but equally somber realities with grace. I Am Setsuna expresses occasional jocularity through a corny joke or quippy NPC dialogue, but its story is dominated by hardship. Forget the perfunctory villains and other tangible obstacles that come up; it's the emotional baggage that your companions carry that's notable. There are secrets to keep, actions to regret, and bad luck to accept. Clocking in around 20 hours--moderately short by RPG standards, it's unfortunate that I Am Setsuna doesn't allow more time for backstory and character development, because there are a few moments that are begging for more attention.The majority of your adventure is steeped in combat, which is almost identical to Chrono Trigger's battle system and, thankfully, every bit as enjoyable. There are no random encounters in I Am Setsuna, and no enemies on the world map; battles begin when you bump into enemies visible in dungeons. When combat kicks off, enemies and your party members are arranged in starting positions. Different skills and attacks change your position on screen, although you never actually have control over movement  enemies are also in a constant state of motion. Positioning can be important when using certain skills or weapons that have areas of effect rather than single targets. Waiting for enemies to wander into an ideal arrangement can pay off, but it potentially comes with risks depending on which version of I Am Setsuna's turn-based combat you choose to play.Active mode allows each character's active time battle gauge to fill on a constant basis; when the ATB gauge is full, a character is able to act. Active mode brings the added challenge of time management, where you need to make a move quickly to avoid wasting time in menus--take too long and an enemy can potentially sneak in an extra turn. If you choose to play in Wait mode, all ATB gauges stop charging when you're picking an action from the command menu, affording you more time to plan your next move. Choosing between one or the other is an easy way to make the game more challenging or forgiving, but most common enemies rarely pose a threat. The only time you may desire to play in Wait mode is during some of the game's boss battles, where the difficulty abruptly spikes.Each character has an inherent strength, weapon type, and selection of skills, known as techs. Techs are a product of spritenite--magical stones slotted into talismans, I Am Setsuna's secondary equipment. Certain characters can combine techs in combat to dish out a devastating attack or a powerful recovery spell, so long as they both have full ATB gauges. With a limited number of slots, you have to carefully pick and choose which techs to carry. Doing so will help you form a well-rounded team, and ensure the availability of preferred combo attacks, which are tied to specific techs.When things are left to chance in an RPG, it can feel like all of the effort you put into planning and crafting your team loses some of its meaning.Every tech can be enhanced on-the-fly during combat when a character builds up enough Setsuna Points to trigger momentum--you earn SP when you attack, take damage, or hold your position with a full ATB gauge. Triggering Momentum bonuses requires you to press a button immediately after a flash of light that occurs just before a character takes an action. Managing your momentum opportunities is the most critical element during difficult fights, as it can effectively turn one action into two. You can occasionally trigger HP recovery after an attack, or spread an action that would typically impact one character to your entire party--or every enemy on screen. Momentum opportunities can mean the difference between a win or a loss, and seriously add to the tension of Active mode's already stressful time management.Triggering momentum during combat can also lead to singularities, seemingly random events that grant extreme benefits to your team. Despite the fact that you can influence the chance of singularities occurring, it's impossible to plan for them. They are, in effect, bonuses, but they are so overpowered that they can make a challenging battle feel like a walk in the park. It's refreshing to receive a helping-hand now and again, but some singularities limit your abilities in favor of boosting others--Chrono Burst makes your ATB gauge fill faster than usual, but it stops you from using combo moves, which isn't necessarily a welcome surprise. When things are left to chance in an RPG, it can feel like all of the effort you put into planning and crafting your team loses some of its meaning.In typical RPG fashion, characters earn experience from combat and level up, but rather than impact every stat, new levels only boost a character's HP and MP. In order to grow stronger and heartier, you have to seek out new weapons, which directly dictate a character's physical and magical strength, as well as both types of defense. Therefore, purchasing weapons becomes a habit the moment you discover a new town. But you can't buy anything in I Am Setsuna until you sell materials--objects earned in battle and found on the ground when exploring dungeons--because currency isn't doled out after fights or found in treasure chests.While this is a curious and unorthodox approach to dealing with in-game money, selling materials is needlessly laborious. When facing a list of dozens upon dozens of materials--some enemies can drop over ten different resources in a single battle--it would be great to have an option to sell everything at once. In practice, you have to go down the list, one by one, selling each type of material. In addition to earning you money, they end up in the hands of the merchants who sell spritenite, which becomes available for sale once you've traded in the appropriate items.I Am Setsuna walks in the footsteps of giants, and is thus dwarfed by the memories of games that inspired it.There's a lot to unpack when discussing combat and configuring your party, but it's not that complex in practice. You grow accustomed to managing your Momentum opportunities and configuring techs across your team. Again, some bosses pose a real threat, but by the end of the game, mobs of common enemies--even strong ones--can't stand up to a well-oiled party, and can be wiped with a single combo move and a little added Momentum. As such, it can feel like you're going through the motions when playing I Am Setsuna. This, paired with obvious references to well-known games, can make the game feel rote and at worst, boring.I Am Setsuna is an unapologetic homage to beloved Japanese RPGs that plays well but takes few risks. Tokyo RPG Factory has accomplished their implied mission statement: to make Japanese RPGs the way many of us remember them back in the day. As a result, I Am Setsuna walks in the footsteps of giants, and is thus dwarfed by the memories of games that inspired it. There are times when its familiar music and faces feel comforting, like returning to your hometown after a decade away, so as someone who grew up playing Japanese RPGs, I enjoyed my time with I Am Setsuna. It's like any trip down memory lane: it was nice to look back and remember the good times."}