{"ref": "https://www.gamespot.com/reviews/0-day-attack-on-earth-review/1900-6246344/", "date": "January 13, 2010", "game_name": "0 Day Attack on Earth", "text": "Screwing up a simple top-down shooter is quite the accomplishment, but Japanese developer Gulti has done a fine job of it with 0 Day Attack on Earth. This Xbox Live Arcade exclusive is a repetitive grind, stocked with annoying enemies and afflicted by dumb allied AI that makes the handful of levels featured here amazingly frustrating, as well as gamepad-smashingly difficult. Don't be lured in by the inclusion of a few potentially nifty co-op and multiplayer options--there are way too many serious problems here for the game to be worth anything close to its 1,200-point asking price. After standing for over 50 years, will the Tokyo Tower topple at the hands of alien invaders? Gameplay is a straightforward shot of dual-stick shooter action. Big nasty aliens have invaded the Earth, and our only hope is a guy in a little plane with three wingmen buddies. As usual with these sorts of games, you move with the left stick and shoot with the right. You also have access to three smart bombs per plane that blow up everything around you. Levels are set in the unfriendly skies above the ravaged metropolises of New York, Tokyo, and Paris. One of the game's claims to fame is accurately depicting each city, although there are so many aliens whipping around along with huge noxious clouds of some extraterrestrial chemical warfare project that it's impossible to take note of any buildings in the skylines save for iconic landmarks like the Tokyo Tower. The lone goal in each city level is to take down a specific number of massive boss aliens before a timer ticks down to zero. Other ETs also flit around getting in the way, however, and you typically have to spend a few moments in each level blasting them in order to earn power-ups needed to jazz up the weaponry on your aircraft (double shots, a spread of blaster bolts, that sort of thing). Without some extra oomph behind your gunplay, it can be nearly impossible to take out the bosses. But if you spend too much time on the small fries, you risk running out the clock. Sound simple? It is, but virtually nothing in 0 Day Attack on Earth has been implemented correctly. For starters, the allied AI of your wingmen is atrocious. They just fly around almost randomly, following you to the targets that you attack but then shooting in all directions and offering no help at all when taking down the alien boss ships. If this is the best that Earth can muster, we're screwed. After the first New York level, things get very difficult because of this absence of assistance. Tokyo bosses are insanely tough to take down flying solo, with defensive barriers that regenerate after a few moments and tons of help from their alien buddies. To get the most out of the game, you need to fill the wingman slots with other human fliers in multiplayer modes, such as co-op and Capture the Flag. This is harder than it sounds, though, because nobody seems to be playing online right now. Hours of trying to scare up a match resulted in just a couple of co-op games that lagged and teammates quickly abandoned. Smart bombs can be your best friend. They're also your only friend when you're playing solo with the brain-dead AI wingmen. Even if you can cajole some poor friend into playing 0 Day Attack on Earth with you, there isn't much here to keep anyone interested aside from creepy-looking alien ships and eerie music that can be downright chilling, especially during the assault on Tokyo. Levels are all virtually identical in how they play. While there is a varied lineup of helper goons that include massive tripods, triangular UFOs, and weird orange balls that swallow you up then go boom unless your buddies intervene with a few well-placed shots (good luck with that if you're playing with computer-controlled wingmen), the bosses are all lame motherships that just sit there while you blast away. Sure, these massive monstrosities have defenses like mile-long metal tentacles and rotating flame cannons. But the most reliable tactic is always to just set up shop on its doorstep then blast away with your main guns and smart bombs. Just one type of mothership is featured on each level, too. So you soon fall into a rut, using the exact same tactics to take down one vessel after another. The pace is very slow because you don't need to move all that much aside from circle-strafing. Action bogs down and gets very dreary in short order because after you've played one level, you've pretty much played them all. There are many, many better dual-stick shooters out there for the Xbox 360 than 0 Day Attack on Earth. Spend your points on them and give this poorly executed extraterrestrial invasion a pass."}