{"ref": "https://www.gamespot.com/reviews/driv3r-review/1900-6121167/", "date": "March 28, 2005", "game_name": "DRIV3R", "text": "Nine months separate the PC release of Driver 3 from the release of its console counterparts. A sane, logical type of person might assume that the large gap between the borderline-broken console versions and the newly released PC edition was used to fix the game's serious problems. But those people would be mistaken. Driver 3 for the PC is just about as broken as it was on the Xbox and PlayStation 2 last year, and thanks to the ill-conceived introduction of a mouse and keyboard into the mix, it manages to be even worse, overall. Driver 3's cutscenes are one of its few strengths. The Driver series is helmed by an undercover cop named Tanner. This time around, Tanner is trying to infiltrate a Miami-based car thief ring, which is working to steal 40 exotic cars and ship them out of Miami. Part of the game's story involves finding out who the thieves in the car ring are working for, where the cars are going, and who's double-crossing whom. You'll start out in Miami, eventually make your way to Nice for some French car chases, and you'll also spend some time in Istanbul. The story is mostly told via prerendered cutscenes that fall somewhere between a music video and a movie in terms of style and inspiration. Generally speaking, the cutscenes look pretty good. In fact, the cutscenes are probably the best part about Driver 3. Despite featuring three large cities to drive in, Driver 3's main mode is a linear, mission-based game that sends you on mission after mission until you've unraveled the game's story. Each mission has clear-cut objectives, like chasing after a guy who double-crossed your gang, stealing three cars and driving them into the back of a moving truck before the truck gets to its destination, or driving around on an enemy's turf and busting up the place by crashing through exploding barrels and other objects. At the end of every mission, you're given the option to save and then you can continue on to the next mission. The missions tend to vary from city to city, but the lackluster gameplay really prevents many of the missions from being much fun. For a game called ~Driver,~ you may be surprised to find yourself spending quite a lot of time out of your car, and that's where the first significant gameplay problem comes to light: The on-foot action is awful. Your control over Tanner is stiff, at best. You can fire weapons, you can halfheartedly jump, and you can duck to perform some pretty lame rolls. While you probably wouldn't expect much more from a gruff undercover guy like Tanner, all of his movements look stilted and jittery, and the gunplay--despite giving you access to a number of different pistols, submachine guns, an assault rifle, a shotgun, and a grenade launcher--is decidedly underwhelming. The combat in the game isn't tense at all, and it mostly consists of running up to enemies and blasting them...before they blast back, if possible. However, the game is pretty liberal with the health packs, so you can certainly trade shots with most of your foes without worrying too much. Since most of the game's artificial intelligence is incompetent, you can usually get the drop on the bad guys. Driver's technical issues really get in the way of the rest of the game. The game's driving portions are better than the on-foot stuff, but not all that much better. You're given a map of the city with a pretty clear indication of where to go, and you're usually in a hurry, so there isn't much time to explore the game's cities in the story mode. The physics behind the driving appear to be designed to give you that '70s-cop-show-car-chase feel, in that everything has been exaggerated. Even the slightest turn around a corner is a tire-screeching, sliding-out affair. Getting slammed hard by a cop car might send you flying into the air, causing you to barrel-roll a half-dozen times before crashing back to Earth. The problem is that the driving isn't especially fun, as you constantly feel more like you're fighting to stay in control of the car than skillfully outmaneuvering your pursuers. Sometimes you'll hit a ramp and land just fine; and sometimes you'll land differently and roll your car, forcing you to retry a mission. There are also some discrepancies between what you can and can't drive through. Some objects will let you drive right through them, while others will stop all of your forward progress with a loud, damaging crash. What's more, it's even occasionally possible to crash into objects like streetlights or trees, essentially making it look like the streetlight or other object is growing out of the middle of your car. This causes your car to become completely stuck. The AI routines make the game's cops look like complete idiots. The driving AI isn't much better than the on-foot AI, either. Police chases--which happen more often in the game's additional modes than they do in the main story--are especially ridiculous. Cops basically aren't smart enough to get out of their cars and shoot at you unless they can get close enough to you. So, for example, if you were to jump over a guardrail and swim out into the water surrounding Miami, a cop that's pursuing you would simply drive his car into that guardrail, back up, and then drive into that guardrail over and over again. If you can get the cops to get out of their cars, they aren't much smarter. A big part of the problem with Driver 3 lies in its control. Both on foot and in a car, your control over the action is limited, at best. The game supports analog gamepads as well as a mouse and keyboard. If you spend some time configuring the controls, you can get a dual analog controller to function much like it would in the console versions of the game, but your ability to turn with an analog controller is severely limited. Tanner turns very slowly, then suddenly accelerates his turning. This makes drawing a bead on anything nearly impossible. The mouse and keyboard might not have that problem, but they have plenty of others. Steering with keys on the keyboard simply isn't refined enough to deal with the game's sloppy car physics, making even the most rudimentary car chase a real chore. Also, if there were an award for ~worst default control scheme,~ Driver 3 would win it, hands down. Why, exactly, would anyone make the 5 key on the keypad the ~fire weapon~ button and leave the mouse buttons unmapped? The default control scheme is clearly an exercise in insanity. After some trial-and-error, it's possible to reconfigure the keys to make the game playable. Well, as playable as this game's going to get, anyway. Aside from the main story mode, the game also has a few secondary modes, though they really don't add much to the experience. You can opt to simply drive around a city in the ~take a ride~ mode. There are also some driving games to play, such as checkpoint races, a survival mode that forces you to last as long as possible against the game's dopey, crash-happy police AI, and so on. You can also save replays and edit them by inserting different camera angles, slow-motion effects, and so forth. A big part of what makes Driver 3 so bad is a series of technical, graphical glitches that make the game look like an absolute mess. You can run it in a wide variety of video resolutions, and you can fiddle with the draw distance and antialiasing, as well. When you get it all turned on, Driver 3 actually starts to look pretty good...provided you're standing still. In motion, Driver 3 is a flickery mess. After testing the game out on a few different video cards, it seems that the lighting has been programmed to flicker on and off everything. At times, Tanner's whole head is lit up like the sun is hitting it directly, while the rest of him stays dark. As you drive around the city, objects like trees and buildings flicker like crazy. And when you run the game in higher resolutions, the textures start to really look like trash. Driver 3's voice cast carries some Hollywood-caliber names, but no Hollywood-caliber performances. The sound side of things is pretty underwhelming. Car engines and the like sound appropriately throaty. But the game is missing a lot of the little touches that would help it sound more alive. When a car takes too much damage to continue on, the engine merely stops making noise and the car rolls to a stop. A more prevalent sputtering noise, or something to that effect, would have helped. Most of the gunfire is rather subdued and unimpressive--this only serves to make the on-foot combat seem even more ineffectual. Additionally, the game's voice work is quite stiff. Michael Madsen voices Tanner, and while his gruff, gravelly voice fits the character, the delivery is a little too flat and uninterested. Similar criticisms can be said about most of the voice cast, including Michelle Rodriguez, whose performance as Calita is phoned-in and wooden. Other voices on the cast include Mickey Rourke, Iggy Pop, and Ving Rhames, who plays your partner in the game and narrates most of the cutscenes. The game's music is most prevalent during the cutscenes, and it works with the action quite well, giving the game's noninteractive sequences a slightly more cinematic feel. Driver 3 is full of the sorts of glitches and problems that final retail products shouldn't have. On top of that, a recently released patch for the game doesn't fix many of its showstopping problems. The control is terrible, the visuals are buggy, and the AI is straight-up broken. Short of being threatened at gunpoint, there's no acceptable reason to play this game. The problem is that the driving isn't especially fun, as you constantly feel more like you're fighting to stay in control of the car than skillfully outmaneuvering your pursuers. Sometimes you'll hit a ramp and land just fine; and sometimes you'll land differently and roll your car, forcing you to retry a mission. There are also some discrepancies between what you can and can't drive through. Some objects will let you drive right through them, while others will stop all of your forward progress with a loud, damaging crash. What's more, it's even occasionally possible to crash into objects like streetlights or trees, essentially making it look like the streetlight or other object is growing out of the middle of your car. This causes your car to become completely stuck. The AI routines make the game's cops look like complete idiots. The driving AI isn't much better than the on-foot AI, either. Police chases--which happen more often in the game's additional modes than they do in the main story--are especially ridiculous. Cops basically aren't smart enough to get out of their cars and shoot at you unless they can get close enough to you. So, for example, if you were to jump over a guardrail and swim out into the water surrounding Miami, a cop that's pursuing you would simply drive his car into that guardrail, back up, and then drive into that guardrail over and over again. If you can get the cops to get out of their cars, they aren't much smarter. A big part of the problem with Driver 3 lies in its control. Both on foot and in a car, your control over the action is limited, at best. The game supports analog gamepads as well as a mouse and keyboard. If you spend some time configuring the controls, you can get a dual analog controller to function much like it would in the console versions of the game, but your ability to turn with an analog controller is severely limited. Tanner turns very slowly, then suddenly accelerates his turning. This makes drawing a bead on anything nearly impossible. The mouse and keyboard might not have that problem, but they have plenty of others. Steering with keys on the keyboard simply isn't refined enough to deal with the game's sloppy car physics, making even the most rudimentary car chase a real chore. Also, if there were an award for ~worst default control scheme,~ Driver 3 would win it, hands down. Why, exactly, would anyone make the 5 key on the keypad the ~fire weapon~ button and leave the mouse buttons unmapped? The default control scheme is clearly an exercise in insanity. After some trial-and-error, it's possible to reconfigure the keys to make the game playable. Well, as playable as this game's going to get, anyway. Aside from the main story mode, the game also has a few secondary modes, though they really don't add much to the experience. You can opt to simply drive around a city in the ~take a ride~ mode. There are also some driving games to play, such as checkpoint races, a survival mode that forces you to last as long as possible against the game's dopey, crash-happy police AI, and so on. You can also save replays and edit them by inserting different camera angles, slow-motion effects, and so forth. A big part of what makes Driver 3 so bad is a series of technical, graphical glitches that make the game look like an absolute mess. You can run it in a wide variety of video resolutions, and you can fiddle with the draw distance and antialiasing, as well. When you get it all turned on, Driver 3 actually starts to look pretty good...provided you're standing still. In motion, Driver 3 is a flickery mess. After testing the game out on a few different video cards, it seems that the lighting has been programmed to flicker on and off everything. At times, Tanner's whole head is lit up like the sun is hitting it directly, while the rest of him stays dark. As you drive around the city, objects like trees and buildings flicker like crazy. And when you run the game in higher resolutions, the textures start to really look like trash. Driver 3's voice cast carries some Hollywood-caliber names, but no Hollywood-caliber performances. The sound side of things is pretty underwhelming. Car engines and the like sound appropriately throaty. But the game is missing a lot of the little touches that would help it sound more alive. When a car takes too much damage to continue on, the engine merely stops making noise and the car rolls to a stop. A more prevalent sputtering noise, or something to that effect, would have helped. Most of the gunfire is rather subdued and unimpressive--this only serves to make the on-foot combat seem even more ineffectual. Additionally, the game's voice work is quite stiff. Michael Madsen voices Tanner, and while his gruff, gravelly voice fits the character, the delivery is a little too flat and uninterested. Similar criticisms can be said about most of the voice cast, including Michelle Rodriguez, whose performance as Calita is phoned-in and wooden. Other voices on the cast include Mickey Rourke, Iggy Pop, and Ving Rhames, who plays your partner in the game and narrates most of the cutscenes. The game's music is most prevalent during the cutscenes, and it works with the action quite well, giving the game's noninteractive sequences a slightly more cinematic feel. Driver 3 is full of the sorts of glitches and problems that final retail products shouldn't have. On top of that, a recently released patch for the game doesn't fix many of its showstopping problems. The control is terrible, the visuals are buggy, and the AI is straight-up broken. Short of being threatened at gunpoint, there's no acceptable reason to play this game."}