{"ref": "https://www.gamespot.com/reviews/skylanders-superchargers-review/1900-6416249/", "date": "September 20, 2015", "game_name": "Skylanders SuperChargers", "text": "Every year brings a new line of toys for the Skylanders franchise, with these real world toys tied to whatever new mechanic or gameplay gimmick the latest iteration of this hugely successful franchise has to offer. What's remarkable about the latest game--Skylanders SuperChargers--is that the brand new toy additions (racing vehicles) aren't the only things injecting fresh air into the series. Nearly every level in Skylanders SuperChargers comes with a different spin on the series' tried-and-true action adventure template, making the gameplay here the most varied Skylanders has been in years.And it's all still a joy to play, particularly if you've got a young one to take along. The toys-to-life category may be becoming increasingly crowded, but in the always delicate dance between the commerce of pushing new toys and providing great gameplay, Skylanders' focus on providing variety and fun is, admirably, holding fast.Of course, it's still very much about those shiny new toys, a fact the little ones in your life won't let you soon forget. This year adds vehicles to the mix, and there are are three types: air, land, and sea. You get a land vehicle in SuperChargers starter pack (along with two Skylanders), which will be enough to get you through the main story content in the game. You will, of course, be locked out of any content requiring a sea or air vehicle, and with an air/sea challenge prominently placed within each level of the game (along with a mouthy denizen of the Skylands pleading with you to complete it), the in-game push to buy new toys can sometimes feel a little heavy.There are two upsides to this, however. The first is that the land vehicle sections are, by a long stretch, the best to play out of the three types. There are straight up Mario Kart-like racing sections that provide a great sense of speed and chaos, with wide tracks, boost pads, collectibles, and branching paths that are a joy to speed through. Occasionally, you'll have to slow the pace down and drive around large arenas, taking on foes and environmental obstacles. In fact, some of the best boss battles in Skylanders take place when you're driving a land vehicle. One sequence had us (my six-year-old son ~drove~ while I controlled weapons) chasing a villain in a large airship, dodging mines and firing upon drones in a kinetic display of explosions and flying debris. Another boss fight had me using portals to warp from one large platform to another, chasing down another baddie who flitted from area to area.The other upside is somewhat more loaded, however. While there's a noticeable in-game push for the new vehicle types, previous locked levels based on Skylander elements seem to have disappeared almost entirely. No longer will you come across areas that only specific elemental Skylanders can open. The kid pestering will be all about getting an air or sea vehicle, and considering that buying one of each type allows you to access all of those levels within the game, this will probably prove to be less of a headache for parents (like me) who are budget conscious (like me).If you do end up spending the extra cash for sea or air vehicles, then the gameplay that's here is enjoyable enough that it won't be a regrettable decision. Both sea and air vehicles feature racing sections and arena-like battles, and each comes with interesting nuances that make them unique. Sea vehicles, for example, can dive underwater, forcing you to look for shortcuts or items underneath the waves. And all three vehicle types control remarkably well--experienced gamers won't have any troubles getting their heads around the controls, but it's notable just how well some of the touches here make it a more accessible game for younger players. Wide tracks that allow for plenty of error is just the start--everything from the sensitivity of vehicle handling to the stickiness of targeting is well calibrated to suit junior gamers.While the vehicles adds the most visible ~new~ element to Skylanders, there's plenty more here that expand upon the series' traditional action adventure (with a little puzzle solving) formula. Nearly every level and area you'll explore in Skylanders comes with a unique gameplay twist. One level screws around with gravity, forcing you to navigate your characters along walls and ceilings. Another introduces a Star Wars-like Force push/pull mechanic, while another arms you with a shrink/growth ray to mess around with. Each of the mechanics are wonderfully integrated within their own distinct areas, with puzzles, enemies, and even vehicle challenges all requiring you to tinker with said mechanics in different ways. In the shrink/growth ray section, for example, shrinking some enemies makes them less of a threat, while using the growth ray on another enemy's weapon may cause them to topple under the weight. There's even, for the first time in the series, online multiplayer races that you can take your vehicles on. These are fun, if not ever reaching the competitive highs of dedicated racers like Mario Kart. Skylanders Superchargers is a game that seems reluctant to stand still, and is constantly offering up interesting new challenges.Perhaps the only thing that's stayed the same from previous versions is the consistent high quality of the physical, real-world toys of Skylanders Superchargers. As with previous games, placing a toy on the game's physical portal (and the game still accepts all of the older generation Skylander toys) places it within the game world for you to play with. The level of detail on the toys remains impressive, and the vehicles (which often have moving parts like wheels or propellers) are similarly well built. If you're playing on a Wii U, the Nintendo-exclusive figurines double as amiibo, and are some of the best in the new series of toys (Bowser is wonderfully detailed). My litmus test for the appeal of these toys has always been whether my son will play with them even without the game turned on, and sure enough, I've seen him on more than one occasion running down hapless Skylanders with a vehicle. Test passed.Skylanders, too, continues to pass as one of the best kid-friendly games out there, and thankfully, it's appeal doesn't stop at puberty. Skylanders SuperChargers is a fast-paced affair, never lingering in one spot for too long, always offering something new and fun to do. It's a great game to play with kids, and one grown ups shouldn't be ashamed to try."}