{"ref": "https://www.gamespot.com/reviews/in-the-groove-review/1900-6128446/", "date": "June 30, 2005", "game_name": "In the Groove", "text": "When it comes to the dance mat genre, Dance Dance Revolution has pretty much remained the only game in town. But now that the genre's popularity has gently returned to niche status after a brief time in the limelight, Konami is down to making one or two dance games a year. And for some, it's just not enough. For those people, there's Red Octane's In the Groove, a dance game that, for the most part, re-creates the entire DDR concept and contains most of the familiar modes you'd expect from a DDR game. But with its own unique song list, well-balanced difficulty settings, and a few unique twists of its own, In the Groove is a solid addition to the genre, even if it is basically a DDR clone. Not exactly a Revolution, but close enough. There are multiple ways to play In the Groove, including a fitness mode that counts calories, a double mode that lets one player play with two dance mats, a nonstop string of four or five tracks called marathon, as well as practice and two-player options. Despite these different modes, the gameplay remains largely the same. You'll see arrows scrolling up the screen, in time with some music, and it's up to you to step on the correct arrow on the dance mat when it scrolls up your screen and hits the proper position. Stringing together good, well-timed steps will start a combo meter counting, but missing too many steps will end the game. Like the Dance Dance Revolution games, In the Groove offers multiple difficulty settings for each song. In the Groove's balance between its five difficulty levels is one of its best features. The first two settings are perfect for beginning players. Medium difficulty ups the challenge properly, but competent dancers should still be able to complete just about every song on this setting. Once you move up from there, things start to get really tough, and the hardest setting is truly for pros. By comparison, the DDR series has always offered a ridiculously easy setting for beginners, but the medium setting really tends to vary. Some medium tracks in DDR will be easy for average players, while others get too difficult. Evening the difficulty out gives In the Groove a smoother transition from song to song, which should be good for players who are looking to improve. Different arrow movement effects can add to the challenge. Music games need a good roster of music. That's hardly a surprise, right? In the Groove offers a good collection of high-energy, up-tempo dance tracks, including a few dance remix covers of songs you might remember, like ~Torn~ by Natalie Imbruglia and ~Mouth~ by Merril Bainbridge. The genres vary a little more than the average dance game. For example, there's a rap track that seems to serve as an unofficial theme song for the Web comic Penny Arcade. You won't recognize too many songs in the game, and there aren't too many standout hits, but they're functional and appropriate. In the Groove's graphics are pretty bare bones, but the utter lack of frills doesn't really get in the way of the gameplay or anything. The backgrounds, in particular, are awfully dull. In the Groove isn't really a game that's going to win you over and make you a believer in the dance game genre. However, if you're already a fan of Dance Dance Revolution and you're looking for some more steps and tracks for your PlayStation 2, In the Groove is a good addition to your hot-stepping library."}