{"ref": "https://www.gamespot.com/reviews/thrillville-review/1900-6162192/", "date": "November 21, 2006", "game_name": "Thrillville", "text": "Upon first glance, it would be easy to pass off Frontier's latest theme park-building management game, Thrillville, as a kid's version of its amusement park-management series, RollerCoaster Tycoon. Thrillville does not offer anywhere near the depth or complexity of the Tycoon series in terms of micromanaging resources to maximize profits and attract large crowds, and its presentation takes a page more out of Psychonauts' book than anything Will Wright would dream up. However, instead of targeting the niche business-management crowd with more of the same, or dumbing down the product for an equally niche children's market, Frontier seems to be going after more-casual players, by focusing more on easy-to-pick-up yet often surprisingly complex minigames, and by wrapping the experience up in a nicely put-together package. Fear the maniacal cork-gun-packing, cowboy-boot-wearing robots. Thrillville is better categorized as a compilation of minigames than a business-management sim or amusement-park builder, but it does have many elements of those two genres. You can choose to dive right into these minigames by yourself, or join a few friends in party play mode. One of the many excellent design choices that Frontier makes in Thrillville is that you'll find all of the 20-plus minigames ready to play here, save for a very select few that can be unlocked by playing through portions of the single-player mode. The amusement-park theme of Thrillville is reflected in nearly all of the minigames. For instance, you'll be able to pop cork guns off in themed shooting galleries, zip around custom-built go-kart tracks, get your bump on with bumper cars, and so on. What separates these games from the garden variety toss-away minigames that are often haphazardly shoehorned into other action adventure games is that they are all reasonably complex and control very well. For example, the shooting minigames contain many of the elements of a bona fide first-person shooter. If you shoot that jack-o'-lantern-headed scarecrow in its big pumpkin noggin, it'll immediately keel over and you'll reap the maximum amount of points. Also, cork-gunning those robots or scarecrows in vital areas such as the abdomen will score you more points than just blasting off their arms, which, incidentally, do fall off if you hit them. And these enemies are even smart enough to crouch and shoot around corners to evade your shots. Furthermore, scattered about these levels are several different gun types, such as double pistols, machine guns, and the like, as well as five fairly well dispersed treasure pickups to boost your score. Nearly all of the other minigames offer similarly layered gameplay that greatly ramps up their fun factor. As great as many of the minigames are, there are a few issues with them. While it's really neat to race around in go-karts on a track of your own design, a lot of the other games aren't particularly original, and a few are quite derivative. The worst offenders are a blatant 1942 knockoff and a top-down dungeon crawler that bears more than a striking resemblance to Gauntlet. Also--and this is more of an issue in the single-player mode--the pacing of some of the minigames doesn't quite seem right. Most have time limits in the neighborhood of two to three minutes and suitably fit in with the amusement park-building theme. However, a few last much longer, and since they're typically the ones that mimic other classic games, their length seems unnaturally disruptive. After all, the goal is to build a theme park, not dungeon-crawl through several stages of a Gauntlet clone. Also, though there's a good variety of minigames, several of them--the shooters especially--are essentially the exact same game wrapped up in a different theme. And as far as the PlayStation Portable version of the game is concerned, aiming is far from fluid in many of the shooting games, as you'll be moving around with the D pad and aiming with the face buttons. Anyone who's tried to play a shooter on the PSP ought to be familiar with this scenario, and to its credit, Frontier did try to compensate for this, at least, as this version is generally much more forgiving than the console versions when it comes to hitting your targets. A few of the minigames skimp on originality. If you're all by your lonesome and looking to contextualize those minigames into a story, you can dive into Thrillville's single-player mode. After being treated to the eccentric ramblings of your easily excitable Uncle Mortimer, you're commissioned to take over the management and maintenance duties of the Thrillville chain of amusement parks. This frees up Morty to concentrate on the R&D aspect of the business and stay one step ahead of the competition, a most sinister rival by the name of Vernon Garrison who has a penchant for filching Thrillville's innovations. To be clear, the story is mostly nonexistent, but it's coherent enough to glue the premise behind your tasks together, and Uncle Mortimer's ridiculous non sequiturs are nothing if not humorous. Since you're taking over his already-bustling enterprise, your job won't so much be building a theme park from the ground up as it will be maintaining the parks, updating them with new rides, and ensuring visitors are having a good time. Instead of getting bogged down in a more technical approach to running the park, you'll accomplish these goals by taking on a series of missions. Of the five total parks, only one will be unlocked when you begin, and you'll be able to sequentially unlock the others by completing a percentage of the 25 total missions per park. Though the two console versions share the exact same missions, the PSP version changes these up a bit. It doesn't add in any new minigames, though, so there's no real reason to spring for the PSP version if you have one of the others just to get a different take on the missions. The difficulty of the missions steadily ramps up in the later parks in both the console and handheld versions, both in complexity and in minimum achievement, and unlocking all of the parks will take you anywhere from eight to 10 hours if you're simply going for the minimum requirements. Missions are divvied up into five different categories: build, games, guest, upkeep, and business. You're ranked on how well you complete each mission on a gold-silver-bronze scale. Build and business missions are what you'd typically expect from a business-management sim, as they revolve around placing coasters, games, or other structures, and they often address one or more needs of your park, such as thirst, nausea, or thrill levels, as well as attracting new crowds. Games and upkeep missions are where you'll find the bulk of the minigames that are available in the party play mode. The games missions are usually played out against one of your guests. The competition here begins fairly easy, but the artificial intelligence does scale accordingly, so some of the later missions can be quite difficult. But since the minigames themselves are for the most part quite enjoyable, you probably won't mind going back and playing them a few times to get a gold ranking. Also, thankfully, none of the longer minigames are overly difficult, so you probably won't need to play those more than once, unless, of course, you want to. Don't worry, this kid will quickly become your BFF. The upkeep missions primarily involve you hiring and training the three staff members needed to maintain the park, and here you'll find both the best and the worst minigames. The worst minigame is by far the one for training your mechanics, as its difficulty begins trivial and stays that way. However, the best minigame is a really neat little rhythm game for training your entertainer. Here, you're given a song and, like most other rhythm games, you match button presses in time with the beat while pressing the thumbstick in the direction indicated onscreen. Each new park has a different song, and you'll be able to find even more in the party play mode. And instead of the ubiquitous pop-punk trash that seems to be invading video games soundtracks these days, you'll be treated to a few indie adult contemporary bands, as well as a few in-house-produced tracks, which are all quite good and work well in the game. Oh, and you'll clean up vomit in the groundskeeper training game, which is always a good time for everyone involved. Finally, guest missions, shockingly enough, involve interacting with your guests. Here, you'll engage park-goers in stimulating discourses on third-century athletics, and while these conversation starters would more likely get you stuffed in a locker in real life than help you ascend the social ladder, they do offer up some interesting and often entertaining tidbits. And you'll frequently cross paths with 5-year-olds who will both agree with you and then do you one better. These topics are broken up into various categories, such as science, history, food, or entertainment, and through trial and error you'll be able to figure out which topics to raise to build your friendship. By chatting up the guests, you'll build a rapport, and they'll in turn clue you in on where the park could go for some improvement. At least, theoretically. Unfortunately, aside from completing the guest missions, you'll never really want to converse with your patrons, mostly because there aren't that many dialogue choices, so you'll find yourself just spamming through the appropriate topic icons to build your friendships as quickly as possible. Also, you won't need to pump them for information, since the ambient chatter you'll hear as you run by patrons will be enough to fill you in on what needs to be done around the park. Ultimately, interacting with guests just doesn't feel quite right. Apart from some of these dubious design issues, Thrillville is a well-put-together game, in that there isn't much here that will aggravate or frustrate you. For instance, you're given a map of your entire theme park and can jump to any location whenever you wish, and you can switch between any of the parks you have unlocked just as easily. You're even given a run button to speed up your exploration of the park in search of pickups. Also, since missions are dispersed all over the park, finding them very easily could have been a real hassle, but thankfully that isn't the case. You can see exactly which missions you have yet to complete, and you can jump right into any mission wherever you are in the park with just a few button presses. Plus, you have access to a sizable amount of the minigames right off the bat in party play mode, as well as blueprint mode that lets you design any kind of coaster or racetrack right from the get-go. Aside from some sharp-looking cutscenes featuring Uncle Mortimer's stylish digs, Thrillville definitely has a dated, last-gen look to it. The game takes on a cartoonish look to mitigate its shortcomings in this respect, and for the most part it helps in deemphasizing the issue. It should be noted that the PlayStation 2 version looks significantly worse than the Xbox version, as a lot of the character models lose even more definition and are aliased to the hilt. In both versions, though, characters do animate well enough, there are absolutely zero frame rate issues, and there are no clipping issues or anything like that. Also, the game does a nice job of simulating motion on rides (enough to get us feeling a bit woozy, at least), and since you'll be able to ride any of the coasters you create (or race on any of your custom-built tracks), it's good to see that the game has no problem handling the visuals here. You can make your own coasters as convoluted as you like. Every aspect of the audio in Thrillville is great, ranging from Mortimer's loony ramblings to the ambient noise and radio DJ at the theme parks to the voice-over dialogue of guest conversations. The PSP version does lack a good deal of the voice work and in-game narration, but all of the music and ambient noise is still there, so it isn't a huge loss. The soundtrack in particular stands out as exceptional, both because it expands the repertoire of what's conventionally heard in video games and because the performances are really enjoyable. Plus, the music is incorporated into the gameplay seamlessly, cueing up in the background without being obnoxious and being a central aspect of the excellent rhythm minigame. It's just too bad that more songs weren't thrown into the mix, especially in the single-player mode. Aside from the mostly superfluous tourney mode, the PSP version has just as much content as the console versions. You'll find an equal number of minigames, parks, and missions, and by and large, the game looks and runs at least as good as the PS2 version, if not better due to the aspect ratio. The PSP version also features ad hoc play, so you can share your madcap coaster and racetrack designs with friends, or just battle it out in party play mode. The minigame format makes Thrillville great on the go. Thrillville is a nicely made game that offers enjoyable and often complex minigames, a diverse gameplay experience, and a great soundtrack. It might prove a bit too simplistic for some, and as tends to be the case with most minigame collections, not every one of them is a winner. However, the whole of the experience is a good one, and it makes for a nice change of pace from the usual style of theme park-management games. Missions are divvied up into five different categories: build, games, guest, upkeep, and business. You're ranked on how well you complete each mission on a gold-silver-bronze scale. Build and business missions are what you'd typically expect from a business-management sim, as they revolve around placing coasters, games, or other structures, and they often address one or more needs of your park, such as thirst, nausea, or thrill levels, as well as attracting new crowds. Games and upkeep missions are where you'll find the bulk of the minigames that are available in the party play mode. The games missions are usually played out against one of your guests. The competition here begins fairly easy, but the artificial intelligence does scale accordingly, so some of the later missions can be quite difficult. But since the minigames themselves are for the most part quite enjoyable, you probably won't mind going back and playing them a few times to get a gold ranking. Also, thankfully, none of the longer minigames are overly difficult, so you probably won't need to play those more than once, unless, of course, you want to. Don't worry, this kid will quickly become your BFF. The upkeep missions primarily involve you hiring and training the three staff members needed to maintain the park, and here you'll find both the best and the worst minigames. The worst minigame is by far the one for training your mechanics, as its difficulty begins trivial and stays that way. However, the best minigame is a really neat little rhythm game for training your entertainer. Here, you're given a song and, like most other rhythm games, you match button presses in time with the beat while pressing the thumbstick in the direction indicated onscreen. Each new park has a different song, and you'll be able to find even more in the party play mode. And instead of the ubiquitous pop-punk trash that seems to be invading video games soundtracks these days, you'll be treated to a few indie adult contemporary bands, as well as a few in-house-produced tracks, which are all quite good and work well in the game. Oh, and you'll clean up vomit in the groundskeeper training game, which is always a good time for everyone involved. Finally, guest missions, shockingly enough, involve interacting with your guests. Here, you'll engage park-goers in stimulating discourses on third-century athletics, and while these conversation starters would more likely get you stuffed in a locker in real life than help you ascend the social ladder, they do offer up some interesting and often entertaining tidbits. And you'll frequently cross paths with 5-year-olds who will both agree with you and then do you one better. These topics are broken up into various categories, such as science, history, food, or entertainment, and through trial and error you'll be able to figure out which topics to raise to build your friendship. By chatting up the guests, you'll build a rapport, and they'll in turn clue you in on where the park could go for some improvement. At least, theoretically. Unfortunately, aside from completing the guest missions, you'll never really want to converse with your patrons, mostly because there aren't that many dialogue choices, so you'll find yourself just spamming through the appropriate topic icons to build your friendships as quickly as possible. Also, you won't need to pump them for information, since the ambient chatter you'll hear as you run by patrons will be enough to fill you in on what needs to be done around the park. Ultimately, interacting with guests just doesn't feel quite right. Apart from some of these dubious design issues, Thrillville is a well-put-together game, in that there isn't much here that will aggravate or frustrate you. For instance, you're given a map of your entire theme park and can jump to any location whenever you wish, and you can switch between any of the parks you have unlocked just as easily. You're even given a run button to speed up your exploration of the park in search of pickups. Also, since missions are dispersed all over the park, finding them very easily could have been a real hassle, but thankfully that isn't the case. You can see exactly which missions you have yet to complete, and you can jump right into any mission wherever you are in the park with just a few button presses. Plus, you have access to a sizable amount of the minigames right off the bat in party play mode, as well as blueprint mode that lets you design any kind of coaster or racetrack right from the get-go. Aside from some sharp-looking cutscenes featuring Uncle Mortimer's stylish digs, Thrillville definitely has a dated, last-gen look to it. The game takes on a cartoonish look to mitigate its shortcomings in this respect, and for the most part it helps in deemphasizing the issue. It should be noted that the PlayStation 2 version looks significantly worse than the Xbox version, as a lot of the character models lose even more definition and are aliased to the hilt. In both versions, though, characters do animate well enough, there are absolutely zero frame rate issues, and there are no clipping issues or anything like that. Also, the game does a nice job of simulating motion on rides (enough to get us feeling a bit woozy, at least), and since you'll be able to ride any of the coasters you create (or race on any of your custom-built tracks), it's good to see that the game has no problem handling the visuals here. You can make your own coasters as convoluted as you like. Every aspect of the audio in Thrillville is great, ranging from Mortimer's loony ramblings to the ambient noise and radio DJ at the theme parks to the voice-over dialogue of guest conversations. The PSP version does lack a good deal of the voice work and in-game narration, but all of the music and ambient noise is still there, so it isn't a huge loss. The soundtrack in particular stands out as exceptional, both because it expands the repertoire of what's conventionally heard in video games and because the performances are really enjoyable. Plus, the music is incorporated into the gameplay seamlessly, cueing up in the background without being obnoxious and being a central aspect of the excellent rhythm minigame. It's just too bad that more songs weren't thrown into the mix, especially in the single-player mode. Aside from the mostly superfluous tourney mode, the PSP version has just as much content as the console versions. You'll find an equal number of minigames, parks, and missions, and by and large, the game looks and runs at least as good as the PS2 version, if not better due to the aspect ratio. The PSP version also features ad hoc play, so you can share your madcap coaster and racetrack designs with friends, or just battle it out in party play mode. The minigame format makes Thrillville great on the go. Thrillville is a nicely made game that offers enjoyable and often complex minigames, a diverse gameplay experience, and a great soundtrack. It might prove a bit too simplistic for some, and as tends to be the case with most minigame collections, not every one of them is a winner. However, the whole of the experience is a good one, and it makes for a nice change of pace from the usual style of theme park-management games."}