{"ref": "https://www.gamespot.com/reviews/skater-xl-review-too-little-to-skate/1900-6417529/", "date": "August 21, 2020", "game_name": "Skater XL", "text": "The world is full of spots. They invite you, seducing you into skating on them. A great skate spot encourages you to nail a line of tricks on it, pushing you to keep trying after every bail. An expertly placed ramp that leads you to a rail and down a flight of stairs is one of the many Mona Lisas that skaters strive for. The idea of successfully conquering said spot is what drives them to push themselves, learn from their mistakes, and grow. It's all about the location, something some skateboarding games have nailed for over two decades. And while newcomer Skater XL has a good foundation for its trick system, it fails to inspire the practice of those mechanics on its small number of largely lacklustre levels.Skater XL's trick system is easy to understand and rewarding to learn. Each analog stick is assigned to a foot, and your job is to twist and push those sticks to pull off a cavalcade of tricks. A kickflip requires you to pull the right stick (your right foot) back, snap it up for an ollie and then kick the board with your left stick (left foot) to cause it to flip. It's an engaging way to perform the simplest tricks, and while it may sound complicated, Skater XL's physics give you a lot of room for nailing tricks.At times, it feels somewhat weightless and more like you're controlling a board with no one on it than an actual person that has to twist their body and manipulate the board with their feet. This isn't necessarily a bad thing, as many games have utilized less-than-realistic physics to create great skateboarding power fantasies. Unfortunately, Skater XL's levels aren't the interesting playgrounds for your skateboarding endeavors that they need to be for a compelling experience.The limited number of levels exacerbates this issue. There are only five official ones created by developer Easy Day Studios, while the other three are community-made. These levels emulate typical skating locales, including a school, a small neighborhood, and several different skate parks. These locations are prime candidates for skating, and they do have some good spots--I personally loved skating the bowl at the California Skatepark. However, they largely feel bare, and no matter where you go, there's little to encourage you to keep exploring and searching for that next skate conquest.The lack of direction is another aspect of Skater XL that falters a bit. Normally, skateboarding games are satisfying enough to play without any real objective--the act of skating and landing difficult tricks is rewarding enough on its own. This can be attributed to great level design, something that Skater XL doesn't excel at with its base set of levels. Each level features challenges that you select from a menu, and these do a decent job of introducing you to an area's various spots, though they mostly just feel like tutorials as opposed to challenges. Skater XL's actual tutorial, meanwhile, is extremely basic and incomplete, as it doesn't detail grabs, manuals, reverts, and a number of other tricks. You simply learn the basest of basics and are then let loose into the world to do whatever you want with your board.The exploration of each level is stifled by the game's reliance on checkpoints. Unlike other skateboarding games where you can get back up in the spot you bailed, Skater XL is entirely governed by a checkpoint system. This normally works as an optional mechanic that lets you warp to a specific spot if you want to try a specific trick in a specific location. Unfortunately, you will always respawn where your checkpoint is located, forcing you to place them every now and then if you're just looking to free skate through a level to see what it has to offer.Another way to navigate each of Skater XL's levels is to press Y or triangle and then move a cursor around the world's geometry. This lets you transport yourself to any area of the map in a much quicker fashion--and in cases like rooftops, it's the only way to get there. This is a good way to get from one end of a map to the other, and while zooming out and moving up in elevation does take an unnecessarily long time, it works as it should. There were a few times when my cursor would end up outside of the map--or the map would be enveloped in a black abyss--but resetting the level was always possible and, because of the lack of objectives or progress, it was only ever a minor inconvenience.Similar controls for zooming around the map are used in Skater XL's Replay mode, which lets you shorten a clip of your gameplay and create a shot that could be seen in a skate tape. There are some great options, the best of which is a tripod movement mode that allows you to place the camera wherever you want and have it follow your skater's movements. This in particular can make even the most basic of tricks look like they belong in a skate compilation. These clips are saved as you create them, though the specific shots aren't. This lets you come back to specific moments to capture them from different angles, though you will need to rely on your specific platform's recording functions to set shots into stone and share them on the internet.Alongside the replay editor, Skater XL's character customization and music both make the package feel in touch with skate culture. While the menu design is spartan and uninteresting, the character creator is full of licensed clothing and skateboards that are fun to equip your skater with. This is accompanied by a soundtrack that's full of great skateboarding music from the 2000s forward, consisting largely of indie rock bands like Modest Mouse and Interpol. It's an excellent soundtrack, but it doesn't feel like a cohesive part of the game. Songs play uninterrupted and unchanged by loading a new map, changing modes, or even entering the pause menu. Everything from the rock bands to the short selection of hip hop and electronic music belongs in a skateboarding game, but it feels more like you're listening to a Spotify playlist than a game's soundtrack.If there's one thing Skater XL excels at, it's that it has a great foundation that shows Easy Day Studios knows how to make quality skateboarding mechanics. Unfortunately, the rest of the experience isn't quite there yet. The uninspired levels, barebones features, and overall unfinished-feeling state makes its 1.0 release look like it's still in Early Access. Its trick system deserves more, and with time, it could grow into a great experience. As it is now, Skater XL lacks spots worth conquering and fails to entice past this initial bail."}