{"ref": "https://www.gamespot.com/reviews/the-aquatic-adventure-of-the-last-human-review/1900-6416413/", "date": "April 20, 2016", "game_name": "The Aquatic Adventure of the Last Human", "text": "The post-apocalypse is often depicted as a barren, almost desert-like place where broken-down buildings and abandoned towns litter the land. The Aquatic Adventure of the Last Human flips this concept on its head and depicts a post-apocalyptic Earth covered in water long after the demise of humanity. You pilot a harpoon-equipped submarine through a vast ocean teeming with violent wildlife. But exploring does more than bridge the gap between each fight, as there are places to discover, upgrades to collect, and bits of story to piece together. The world's mystery, and its measured access, make the exploration thoroughly enjoyable.The ocean's settings range from lively, fish-inhabited areas to the polluted waters of the aptly-named Pipe Central. Music plays a big part in defining the atmosphere, aptly accenting the mood of each location. The bright and delightful Seaweed Forest is accompanied by happy music that ignites a sense of wonder, while the dark ambient noise of The Abyss instills the feeling that something big is lurking in the shadows.The mostly peaceful exploration contrasts the high-stress, intense battles with the game's bosses. These fights can be difficult, though they rarely feel unfair--and you can always leave and go somewhere else if you're having too much trouble dealing with one. Success requires concentration and carefully-timed attacks. Forge ahead with too much zeal and an enemy can easily catch you off guard, killing you in one swift motion. The boss battles themselves can be as simple as ~shoot a bunch of harpoons into them at the right time,~ but a couple have more varied solutions--some even have hidden exploits that can help turn the tables in your favor. Triumphing over the game's challenging bosses grants a feeling of immense satisfaction--your reward for patient, measured play.After finishing the main story, you get a second chance to face off against bosses in Boss Rush mode. It puts you back into battle with a completely fresh submarine, sans submarine upgrades, but you earn one back for every successful encounter. After playing through the game with a fully-upgraded ship, taking on Boss Rush is a thrilling undertaking. You're more adept at the game than you were when you faced each boss the first time, but you have significantly fewer tools and abilities.The scale of bosses and objects that litter the deep does a great job of communicating how small you are in this huge oceanic world. And the way the ocean life moves makes creatures like whales, jellyfish, and bosses stand out beautifully against their sleepy surroundings.Unfortunately, the game's pixel art doesn't always look fantastic. It can sometimes look a little muddy and the player-controlled ship lacks definition compared to the rest of the world--an issue that occasionally led to cheap deaths.All the creatures you encounter--and defeat--are added to your creature log, an encyclopedia filled with musings from the unnamed last human. Like the audio tapes you also find during your journey, these entries are written exceptionally well and add an appreciable amount of personality to the game. Some of the logs mirrored how I felt when firing harpoons into superior yet innocent beasts. It's a place I'm happy the game takes you to, as it organically makes you wonder whether the Earth would be in a better place if humans were out of the picture.That said, you don't need to ask yourself any thought-provoking questions to enjoy The Aquatic Adventure of the Last Human. Its story and themes are delivered well, but they don't come off as pretentious or preachy. The challenging boss battles deliver immense satisfaction, and the breaks of tranquil exploration offer delightful moments of discovery. The Aquatic Adventure's ocean can be a dark and scary place, but it's also undeniably alluring."}