{"ref": "https://www.gamespot.com/reviews/frank-herberts-dune-review/1900-2834202/", "date": "May 17, 2006", "game_name": "Frank Herbert's Dune", "text": "Frank Herbert's Dune is one of the towering monuments of imaginative fiction. This massive novel brings feudalism to the far future, creating an unforgettable story of a messianic hero, political intrigue and betrayal, mysticism, and more. Not surprisingly, Dune has spawned a number of games and films. On the gaming side, Westwood's Dune II helped create the real-time strategy genre on the PC back in 1992, and it was followed by a number of sequels, like the recent Emperor: Battle for Dune. With movies, Dune fans were first treated (or subjected as the case may be) to David Lynch's controversial 1984 adaptation, which was visually unforgettable but infamously incoherent. More recently, SCI FI Channel ran a six-hour miniseries called Frank Herbert's Dune. Directed by John Harrison, this Emmy-winning adaptation unquestionably stuck closer to the spirit, if not the letter, of the source material than Lynch's version did. It also featured some fine acting and high production values. Now Dune films and games meet in Frank Herbert's Dune, a tie-in for the miniseries. Unfortunately, it's a poorly designed 3D action-adventure game that actually has precious little to do with the miniseries and equally little to recommend it. In the game, you'll assume the role of young Paul Atreides, scion of a noble house that's been sent to administer the desert planet, Arrakis, also known as Dune. Dune is the source of the invaluable spice that lies at the core of civilization, commerce, and space travel. With the aid of the Emperor, the evil House Harkonnen plots against the Atreides family, resulting in the death of Paul's father the Duke, as well as most of the royal house. Paul and his mother, Jessica, survive by escaping to the desert. The game plays out during the time that Paul and Jessica spend among the fierce desert warriors known as the Fremen, as they bide their time for revenge against the Harkonnen. You'll lead Paul from a third-person viewpoint as he carries out raids on Harkonnen and spice smuggler bases. You'll quickly learn that just trying to move Paul during these missions can be a real chore. Throughout the game, he constantly gets caught on objects and other characters, even when he's only in their general vicinity, and the camera is often blocked by walls, rocks, and other objects. In the horribly ill-conceived second mission, you're forced to avoid a giant sandworm by actually running toward the camera, into its blind spot. That wouldn't necessarily be so bad--as awkward as it is--if it weren't for the fact the ground is littered with hard-to-spot patches of quicksand. That sort of poor design carries over to the majority of the game. To view detailed information about your inventory items, you need to cycle through a slow-moving, clumsily animated menu system. Just trying to start a new game can be a hassle because of the awkward interface for naming your game session. You have to scroll through letters like you do in a console game interface instead of just typing them in. The game is also beset with lengthy load times, a lack of difficulty levels, and the inability to save the game during the overly lengthy missions. The structure of the actual missions isn't handled well either. These story-based tasks contain a mixture of stealth, action, and light puzzle solving, and the tension from sneaking around can be genuinely enjoyable in brief spurts. However, instead of mainly having to use your head or your reflexes, you'll often need to resort to blind trial and error. You'll also find that the missions play almost identically every time: The utterly moronic guards will be standing in the same places and will appear out of thin air every time you activate a hidden trigger. The missions would play a lot better if the guards you needed to kill patrolled more, letting you gauge their movements so that you could sneak past them or eliminate them from behind. Many just stand there, though, forcing head-on confrontations.Once a guard starts firing at you, you inexplicably can't attack with your knife anymore, even if you're literally right next to him. When you're then forced to use a gun instead, get ready for one of the game's many letdowns. Ranged combat is so simplistic and unrealistic as to be comical, with two characters basically standing in place and repeatedly shooting at each other until one falls. The game also offers precious few opportunities to restock your ammo. Dune's graphics bear little likeness to the source material. During your missions, you'll need to watch Paul's life level, refilling it with a stock of water from his stillsuit, which is inexplicably called a ~distiller.~ (New names and spellings for Dune terms are common in the game.) By sneaking up on a guard and eliminating him with one quick knife blow, Paul can reclaim the guard's water. It's a clever twist on the usual med kit or health pack clich, and one that nicely ties into the Dune mythology, where water is the second most-precious thing on Dune after the spice. Between and during the missions, you'll watch lengthy, poorly directed, in-engine cutscenes that do a hit-and-miss job of explaining the situation and your goals. The dialogue is utterly boring or just plain silly, and the game takes major liberties with both the miniseries and novel. When you restart a mission, as you'll likely have to, you'll be subjected to all the cutscenes again with no way to skip them. Between missions, you're also forced to saunter around the Fremen hideouts, seeking new inventory items from other characters. The fact that you don't know what these characters look like or where to find them initially means you'll have to waste your time wandering in circles for no reason at all. You can also talk--using the term very loosely--to just about any Fremen, yet most of them will offer inane or even incoherent non sequiturs. Some of the characters' statements are so bizarre that they at least provide unintentional comedic relief. Characters will also mention events not shown or properly explained in the game. If you haven't read the novel, you'll likely have no clue what's being referred to part of the time. This all feels like some perverse way of stretching out a short game. As shown in both its film adaptations, Dune has enormous visual potential, though the game's graphics are merely average, often looking rather dull and dated. On the one hand, you'll see a few nice details like extremely realistic smoke effects, yet other effects, like weapons fire, look very bland. The environments don't adhere to the miniseries and are mostly forgettable both in look and layout, though they feature a few nicely painted textures, particularly the striated desert rocks. Dune's character designs and animations suffer from a bunch of problems. Characters move extremely stiffly and slowly. Paul runs as if he were utterly exhausted from a week of trudging across the desert, and dead guards casually crumble to the ground in slow motion. Up close, the characters' faces often look downright ugly, and lip-synching animations are poorly done too. You'll also notice right off that the characters bear no resemblance to those in the miniseries. With his black, jagged locks, the Paul of the game looks a lot more like a generic anime character than he does actor Alec Newman from the miniseries. It's a short, disappointing game. Like its visuals, Dune's sparse sound effects have little going for them. Weapons, for instance, sound underpowered and tinny. The voice-overs aren't handled by the actors from the miniseries, nor are they handled particularly well at all, for that matter. They're competent at best. For its music, the game wisely sticks with portions of Graeme Revell's evocative, elegiac orchestral score from the miniseries. It's sad that the music should be the high point of the game, though. Despite a couple of moderately nice touches, Frank Herbert's Dune is a dud of a game. Any strengths are marred by a long string of poor design decisions and equally poor execution. The game utterly fails to capture the majesty and mystery of the Dune universe, turning it into an interactive Saturday morning cartoon--and a bad one at that. Toss this one to the worms.Once a guard starts firing at you, you inexplicably can't attack with your knife anymore, even if you're literally right next to him. When you're then forced to use a gun instead, get ready for one of the game's many letdowns. Ranged combat is so simplistic and unrealistic as to be comical, with two characters basically standing in place and repeatedly shooting at each other until one falls. The game also offers precious few opportunities to restock your ammo. During your missions, you'll need to watch Paul's life level, refilling it with a stock of water from his stillsuit, which is inexplicably called a ~distiller.~ (New names and spellings for Dune terms are common in the game.) By sneaking up on a guard and eliminating him with one quick knife blow, Paul can reclaim the guard's water. It's a clever twist on the usual med kit or health pack clich, and one that nicely ties into the Dune mythology, where water is the second most-precious thing on Dune after the spice. Between and during the missions, you'll watch lengthy, poorly directed, in-engine cutscenes that do a hit-and-miss job of explaining the situation and your goals. The dialogue is utterly boring or just plain silly, and the game takes major liberties with both the miniseries and novel. When you restart a mission, as you'll likely have to, you'll be subjected to all the cutscenes again with no way to skip them. Between missions, you're also forced to saunter around the Fremen hideouts, seeking new inventory items from other characters. The fact that you don't know what these characters look like or where to find them initially means you'll have to waste your time wandering in circles for no reason at all. You can also talk--using the term very loosely--to just about any Fremen, yet most of them will offer inane or even incoherent non sequiturs. Some of the characters' statements are so bizarre that they at least provide unintentional comedic relief. Characters will also mention events not shown or properly explained in the game. If you haven't read the novel, you'll likely have no clue what's being referred to part of the time. This all feels like some perverse way of stretching out a short game. As shown in both its film adaptations, Dune has enormous visual potential, though the game's graphics are merely average, often looking rather dull and dated. On the one hand, you'll see a few nice details like extremely realistic smoke effects, yet other effects, like weapons fire, look very bland. The environments don't adhere to the miniseries and are mostly forgettable both in look and layout, though they feature a few nicely painted textures, particularly the striated desert rocks. Dune's character designs and animations suffer from a bunch of problems. Characters move extremely stiffly and slowly. Paul runs as if he were utterly exhausted from a week of trudging across the desert, and dead guards casually crumble to the ground in slow motion. Up close, the characters' faces often look downright ugly, and lip-synching animations are poorly done too. You'll also notice right off that the characters bear no resemblance to those in the miniseries. With his black, jagged locks, the Paul of the game looks a lot more like a generic anime character than he does actor Alec Newman from the miniseries. Like its visuals, Dune's sparse sound effects have little going for them. Weapons, for instance, sound underpowered and tinny. The voice-overs aren't handled by the actors from the miniseries, nor are they handled particularly well at all, for that matter. They're competent at best. For its music, the game wisely sticks with portions of Graeme Revell's evocative, elegiac orchestral score from the miniseries. It's sad that the music should be the high point of the game, though. Despite a couple of moderately nice touches, Frank Herbert's Dune is a dud of a game. Any strengths are marred by a long string of poor design decisions and equally poor execution. The game utterly fails to capture the majesty and mystery of the Dune universe, turning it into an interactive Saturday morning cartoon--and a bad one at that. Toss this one to the worms."}