{"ref": "https://www.gamespot.com/reviews/wwe-smackdown-vs-raw-2010-review/1900-6238092/", "date": "December 2, 2009", "game_name": "WWE SmackDown vs. Raw 2010", "text": "Just like the big-name pay-per-view events that regularly punctuate the WWE's show schedule, Smackdown vs. RAW is back for another year. The latest entry in the long-running series picks up where last year's game left off, continuing to focus on user creation and true-to-TV action. The biggest new additions this year are on the user creation side, but the action itself also benefits from some refinements. There are a lot of little touches that make matches feel more like those you see on TV, injecting some dynamic excitement into the proceedings. Yet what spices a match up can also make it last far too long and feel like a grind. The game also suffers from many perennial problems, such as weak sound effects, imperfect online play, and nagging animation issues. While this year's Smackdown vs. RAW is definitely better than last year's entry, it's more of an incremental improvement than a substantial upgrade. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: WWE Smackdown vs. Raw 2010 Video Review One of the first improvements you'll see is the training facility, which pops up at the beginning of the game. The controls are largely unchanged from last year, but the training facility is a great place to get familiar with how different moves work in different places in and around the ring. Smackdown vs. RAW's controls are largely dependent on position, and getting to know what moves character can perform in specific situations will not only make you a better wrestler, but it's also just plain fun. Characters have expanded move sets this year, and it is much easier to maneuver your opponent around the ring to take advantage of their repertoires. The training facility is also a good place to get familiar with abilities, which play a more concrete role this year. Each wrestler has certain abilities, ranging from passive ones (like being more resilient to pins and submissions) to active ones (like quickly escaping the ring or regaining some health by hitting yourself in the head with a chair). Using your character's special abilities can give you an edge in the ring, but odds are you won't need them much while playing solo. The computer doesn't put up much of a fight in one-on-one matches, and you'll easily dismantle opponents without taking too much damage. It's still fun to whale on another wrestler, but when your opponent sends you across the ring with an Irish Whip and then just stands there waiting for you to recover, you'll long for a more realistic challenge. When things do get tough, it's almost always because more wrestlers are in the mix. Two-on-one handicap matches, tag-team contests, and pretty much any other match with four or more wrestlers ringside are difficult to win. This is not because your opponents are tougher but because there are more of them, and they will vigorously try to break up any pin you attempt. These matches last much longer and capture that satisfying struggle that is characteristic of some of the most epic real-life matches. But when you've been beating on your opponents for upward of 30 minutes, it reaches a point where it stops being challenging and starts being frustrating. And because both manual and auto-targeting can be finicky, it can be even tougher to single out an opponent for a punch or a pin. Still, this move toward more thorough realism has many advantages. Aside from the astounding list of match possibilities, there's an interesting new rivals mechanic in place. Previously, you could move superstars between shows, change their crowd reaction, and make whatever tag team your heart desired. Now you can tweak each character's allies and enemies, which will affect who comes to help or hinder your character during matches. For example, in a normal one-on-one match between Triple H and Undertaker, Kane decided to show up and prevented Triple H from pinning Undertaker by distracting the ref. This random occurrence made a regular match feel more lively and dynamic, like an event on Smackdown or RAW. Any closer to the ropes and John Morrison is likely to make John Cena's life a little tougher. The action feels more fluid this year and characters generally respond better to each other's positions, so your high-flying attack off the turnbuckle is less likely to go wrong. There are fewer animation hang-ups and things tend to flow more realistically. Yet, there are still noticeable problems, especially when multiple characters are in the ring and you still have to endure your fair share of moves gone awry because of interrupted timing or awkward positioning. Though the mechanics have been refined, they haven't received a significant overhaul. Thus, the action has been improved, but it still relies on the same underlying system from previous years and suffers from the same inherent flaws. Smackdown vs. RAW's presentation continues to impress, with accurate character models and bustling crowds. The heads-up display is minimal, giving the game a more realistic feel. The crowds still don't look great upon close inspection and superstars do some strange things with their mouths, but on the whole, the game looks very good. The announcers are on point most of the time and inject the proceedings with some much-needed drama and flair. But even lively announcing can't mask the still-disappointing sound effects. A title match in the ring still manages to sound exciting, but if you're fighting in the parking lot or the locker room, all you're left with are limp smacking sounds and dull, muted thuds. Though these effects may be more realistic, they sound weak and out of place in a game that's all about loud, exaggerated action. Fortunately, the game knows its strengths and once again delivers a lot of content. From Superstar Careers to the Road to Wrestlemania, there are many hours of fights and melodrama to enjoy. Of the six Road to Wrestlemania paths, perhaps the most entertaining is the one you take with your created wrestler, which contains a good amount of humor and some clever gimmicks, as well as a lot of interesting match situations. Unfortunately, some of your matches have goals that are poorly stated, and it can sometimes be tough to know what you need to do to progress. In one early match, you can beat on your opponents all you want, but unless you destroy Vince McMahon's office in the process, you'll never progress. Though this lack of clarity can be frustrating, it's still a lot of fun to guide your superstar to WWE prominence. A 7-foot, 485-pound man steps on a 5-foot-6-inch, 175-pound man. You do the math. The stellar creation tools are back and as robust as ever, with expanded options and clothing customization. The ability to customize your own logos and tattoos adds a whole new dimension, and you can even compose your own entrance movie. But the addition that folks will get the most mileage out of is definitely the story designer. This mode lets you script shows over weeks, months, and years. You also get to choose which matchups happen when, who interferes, and who runs their mouth on the microphone. It's easy to create short sequences, and those who put a lot of time into longer arcs will be able to create some epic stuff. Fortunately, even if you aren't the time-investment type, you can download stories that other folks have uploaded and reap the benefits. It's easy to sign on and grab user-created content, but online matches are still a bit problematic. Matches often have a low level of lag that is just enough to disrupt your timing. And the single-player action does a poor job of preparing you for the online arena where opponents are fast and merciless. Though there are generally a fair number of games available to join, many of them don't have great connection speeds and players will often abandon lobbies while the host waits for the match to fill up. Still, if you are looking for some serious competition, you can definitely find it online. Smackdown vs. RAW 2010 offers a lot of subtle improvements over last year's game and includes a lot of new, diverse content. The story designer allows anyone to script their own road to Wrestlemania and could conceivably provide new storylines for as long as players embrace it. The game is still plagued by some lingering problems, however, and one has to wonder how much mileage this series can continue to get out of its current model before there isn't enough new stuff to entice players to make another purchase. Whether or not next year brings a significant overhaul remains to be seen, but until then, wrestling fans are sure to enjoy this well-rounded and entertaining product."}