{"ref": "https://www.gamespot.com/reviews/happy-feet-review/1900-6163350/", "date": "December 18, 2006", "game_name": "Happy Feet", "text": "Anyone who has watched the movie Happy Feet knows that animated penguins get around by sliding on their bellies and express their moods by tap dancing. It's no surprise, then, that Midway has produced a game based on the movie that focuses solely on these two activities. However, beyond its quirky design, Happy Feet for the Nintendo DS is cool as ice, and not in the good way. The rhythm levels are cute but are far too simplistic, while the sledding levels are boring and suffer from dodgy controls. A third of the game's missions are rhythm levels that involve tapping the screen in time with music. These levels feature roughly a half-dozen songs from artists like Gloria Gaynor and KC & the Sunshine Band, but apart from having a catchy playlist, they amount to nothing more than tapping dots on the touch screen over and over again. When a dot appears, it's surrounded by a large circle that quickly shrinks in size. The idea is to tap the dot with the stylus when the circle's circumference is the same size as the dot's. You get cheers and points for tapping the dots at roughly the right time, and jeers for tapping too soon or too late. That's all there is to it. There's no sliding or drawing with the stylus. You're always just tapping. All the while, a 3D rendition of Mumble the penguin performs a tap dance on the upper screen. These rhythm levels are nothing more than a watered-down, kid-friendly rip-off of Nintendo's Elite Beat Agents. Two-thirds of the game's missions are downhill sledding levels, where you have to maneuver Mumble around icy boulders and collect fish while he speeds down a lengthy course on his belly. In theory, moving Mumble is accomplished by dragging the stylus left and right on the touch screen. In practice, the game isn't consistent with how much dragging is required to steer the rocketing penguin. Sometimes, a slight drag will yank him sideways. Other times, you'll have to drag the stylus across the screen multiple times just to move him a little bit. Not that it matters much, since you can get through a number of sledding missions without ever touching the screen. The only missions that pose even a modest challenge are those that require you to pass through checkpoints to refill the timer. Visually, the 3D courses aren't all that interesting to look at, although the various hills, jumps, and snowdrifts do flex the system's polygon capabilities. In contrast to the real music used in the rhythm missions, the music in the sledding stages is merely Game Boy-quality stuff. Solo players can choose between a story mode and an arcade mode. The story mode presents 23 individual missions in sequential order and displays static scenes from the movie between each mission. The arcade mode lets you replay any of the missions you've already completed. Missions are brief and rarely take more than three minutes to finish, which means that the entire story mode can be completed in about one hour. That's pretty short for a full-priced game. If you invite a friend over who also owns the game, you can access the multiplayer mode. The multiplayer mode is identical to the arcade mode, except that you compete to see who can score the most points in dance missions or who can finish first in sledding missions. It's inconceivable that anyone would enjoy the missions in the multiplayer mode just because another player is sharing the same numbing experience. Midway and A2M had the right idea when they thought to produce a game based on Happy Feet that orients itself around sledding and tap dancing. They just didn't put enough effort into making either aspect any good."}