{"ref": "https://www.gamespot.com/reviews/woolfe-the-red-hood-diaries-review/1900-6416073/", "date": "March 19, 2015", "game_name": "Woolfe - The Red Hood Diaries", "text": "A game like Woolfe: The Red Hood Diaries was inevitable in a media landscape where a grim-and-gritty reboot is as common as films shot in color and in focus. That doesn't make another example of this trend an inherently bad thing, but the pitfalls of such an approach are numerous, and Woolfe provides a harsh lesson in how to fall into all of them.The pratfalling starts early as our heroine, an axe-wielding, platinum-haired, Amy Brown-meets-Assassins Creed-styled Red Riding Hood, states, ~This is no fairy tale, because nothing here is fair. She could've been warning everyone about the game's combat, but she's actually referring to the bustling city of Ulrica, which is currently falling to ruin at the hands of B.B. Wolfe, a steampunk Daniel Plainview who industrializes the tiny village and needn't associate with the unwashed masses again. Wolfe then puts the whole place under martial law enforced by an army of murderous tin soldiers designed by Red's father. After Red's father dies and her mother goes missing, Red, under the strict tutelage of her grandmother, takes it upon herself to infiltrate Woolfe's businesses and find the truth.The pitfalls of such an approach are numerous, and Woolfe provides a harsh lesson in how to fall into all of them.The elephant in the room must be acknowledged here, and it's named American McGee. The game feels like a story that'd be right in that designer's wheelhouse--and in fact, McGees game Akaneiro has already pursued the Red Riding Hood theme. (Tale of Tales The Path should also be acknowledged for having trod this ground as well, and with great style to boot.) Woolfe does look and act the part. The architecture and atmosphere of Ulrica are marvels of ruined, washed-out, Victorian splendor, with disorienting, flashy clockwork technology intrusively laid over it. This look is intentional, and it tells the story of this place much better than Red does. The impressive lighting effects in the town and forest only enhance it by imbuing everything with a natural magic, contrasting with the ruin instead of clashing with it. This is, in fact, the same marvel American McGee accomplished with the Alice games.Alice and Alice: Madness Returns work not because they overwrite Lewis Carroll but because they expound upon it. The young Alice in Carroll's story is found insane in the real world, and her being surrounded by mental illness influences the changes in Wonderland. It's an organic blossoming of classic ideas into something darker, and it requires a sure hand to pull it offone that Woolfe doesn't have. Instead, Woolfe settles for a lazy shorthand of fairy tale tropes but lacks the foresight to introduce any measure or promise of joy or catharsis worth running, jumping, or fighting for. The greed of the Big Bad Wolf is reduced to corporate greed. The sadness of a father forced to make toy soldiers into a real, unyielding military never has enough of a foundation in good times to stick. Red herself speaks in a mix of sub-Buffy the Vampire Slayer modern teenage one-liners and broken, self-loathing pseudo-poetry. Its a mess, needlessly dour and ~edgy~ for its own sake, an immature approach to subversive reimagining. The exhilaration starts and stops with the art design.Red herself speaks in a mix of sub-Buffy the Vampire Slayer modern teenage one-liners and broken, self-loathing pseudo-poetry.When the game leaves story behind in favor of player interaction, it involves competent platforming and puzzle solving with a small measure of 3D movement and backtracking, but its still fairly linear. It's also wholly unremarkable, marred by a score of tiny and annoying but not game-breaking bugs. A puzzle on the second stage requires Red to perform a relatively simple shimmy along a set of pipes to jump across a gap before being drowned in a pile of sludge from above; this stranded me 20 minutes longer than it should have because the game refused to recognize and grasp the pipes on the other side. Long stretches of running from enemies are aggravating because Red snags herself on the edges of walls.Combat is rather boring to begin with, with a light attack, heavy attack, and two magical attacks. Nothing works more effectively than just spamming heavy attack ad nauseum, especially at the frequent moments when hits don't register, which is especially frustrating in sections involving an evil Pied Piper who summons groups of rats. A ground pound attack, which is supposed to make quick work of the horde, rarely connects in the way you think it will, and the group can chip away at Red's energy far faster than she can readjust and aim for whatever's attacking her. Boss fights compound all these issues, with scripted events all suffering from occasional moments of glitchy failure.Woolfe barely comes into its own before it's over, with the entire game taking about 23 hours tops. It's apparently only half of a two-part experience, but the halfway mark of the game doesn't show much promise for the second. Adult takes on childrens' stories are a hard balancing act, and the moral of this particular take is perhaps in showing just how much a storyteller has to grow up to get it right."}