{"ref": "https://www.gamespot.com/reviews/phalanx-review/1900-2840620/", "date": "May 17, 2006", "game_name": "Phalanx", "text": "In Kemco's Phalanx, you pilot the A-144 Type-R Phalanx spacecraft on a suicide mission to defeat the evil Delia empire. Who cares about plot, right? Phalanx is a near-perfect port of the SNES game of the same name--a side-scrolling space shooter that's full of parallax motion scenery, tiny enemy aircraft, tons of power-ups, and gargantuan boss motherships. If you're into games like Gradius and Project S-11, and happen to possess twitch reflexes, Phalanx has your call sign, Ace.Phalanx is a single-player affair. Press start and you've got three ships with which to complete nine levels. Each level has between two and three stages, topped off with sub-bosses and end bosses. There are hidden secret areas within each level as well. In between are hordes of enemy fighters, deadly obstacles, and a decent number of useful power-ups. Of the 10 overall power-ups, there are such things as beam lasers, an energy cannon, and homing missiles to tickle your fancy, as well as nifty option pods to encircle your ship and bolster firepower. Additionally, each of the four gun weapons has four power levels to gather. There's also the matter of your ship's four-tank energy shield to consider--keep it replenished or you're toast on the fifth hit.As with most shooters in the genre, learning enemy attack patterns through repeat plays is a key strategy, but it also helps to know which weapons work best depending on the situation. For example, in the 2-Underwater stage, the green cyclical shot works best because it's versatile enough to hit enemies while you're dodging underwater pillars. On the other hand, 4-Deep Core lacks any obstacles, so fully powered laser items are apt to get the job done. Ship speed is adjustable with the select button, while the A and B buttons control bomb and laser items. Four weapon types may be stored and swapped with the R button, and a last-ditch death-blossom attack rests on the L button--provided you don't mind losing your current weapons and pods. Of course, Phalanx has most of the hip genre clichs, such as underwater currents, forced scrolling in caves, multisegmented bosses, and the occasional tentacled brain monster.If you want to know the main reason why Kemco ported Phalanx to the Game Boy Advance, you need only view the game. Visually, it's a gorgeous effort. Colorful planetary stages with multiple layers of scrolling flow by fluidly, many of which let you swoop high and low for variable terrain views. Worm- and fishlike bosses scale into and out of the foreground with lithe ease, while stalagmites and mounted turrets plummet below with the kiss of a missile. There's never any slowdown and not much flicker, either--not even with hundreds of bullets and a huge boss onscreen. Musically, the original SNES tunes are re-created decently on the GBA hardware, but not without flaw. High-pitched tones are even higher from the GBA speaker, while bass is nearly nonexistent. As such, the formerly inspiring music retains its emotion but loses some impact. Sound effects are ample, however--loud explosions, sweeping thrusters, and the occasional klaxon maintain the game's nervous progression.People who enjoy difficult shooters may balk at Phalanx's shield system, as well as its numerous clichs, but the game is a lengthy enough endeavor for shooter fans of a mildly forgiving disposition. Sometimes the tinier bullets are difficult to see, and sure, the game suffers from the GBA's dim screen, but overall, Phalanx is a remarkably solid SNES-to-GBA translation."}