{"ref": "https://www.gamespot.com/reviews/secrets-of-the-ark-a-broken-sword-game-review/1900-6166811/", "date": "March 5, 2007", "game_name": "Secrets of the Ark: A Broken Sword Game", "text": "Nine years after the debut of the Broken Sword series, and accidental adventurer George Stobbart is still getting into jams. The hero of one of the longest-running franchises in adventure gaming returns to delve into yet another of history's mysteries in Revolution Software's Secrets of the Ark (known in Europe as The Angel of Death). The game is a traditional point-and-click jaunt that doesn't break any new ground and has a few presentation problems, but it still reminds fans why they fell in love with these games in the first place. Great visuals, exotic backdrops, and a largely sensible lineup of brain twisters make this a must-play for anyone who likes adventures that follow the tried-and-true Sierra formula. This medieval manuscript is what all the fuss is about. Much of the storyline rolls out as a mirror image of the previous Broken Sword games. George has lost his patent business and now toils for a bail-bonds dump in the middle of the Bronx, but he still has the same luck with beautiful women. In this case, that woman is Anna Maria, and she arrives at Big Bros' Bail Bonds telling a story about a manuscript leading to a ~priceless treasure~ and being trailed by a pack of mob goons looking to kill her. She's a lithe, doe-eyed blonde, though, so George wastes no time helping her escape from the thugs. Soon after that, the two of you are away to hunt for a Biblical legend that takes you to exotic locales like Topkapi Palace in Istanbul, the catacombs beneath the Vatican in Rome, and, um, a massage parlor in Phoenix, Arizona. Gameplay in Secrets of the Ark is virtually identical to that in Broken Sword III: The Sleeping Dragon. This is an old-fashioned adventure with point-and-click mechanics where you scroll around every screen looking for hot spots and pick up everything that isn't nailed down. Almost all of the obstacles here are refreshingly straightforward and require little to bypass, aside from careful observation and use of common sense. Instead of crazy, all-too-typical adventure-game antics like the infamous ~tape on the cat~ puzzle from Gabriel Knight III, here you stick to sanity. Gimmicky goofiness regularly rears its ugly head in moments like the one where you swing across a chasm between buildings with a chain and a golf club, or the time when you use a toy to distract a guard, but the game requires relatively few leaps in logic for the genre. Adventure games generally aren't this sensible. Basic ~how do I get over there?~ challenges are spiced up by nifty logic brainteasers that both test you and build an Indiana Jones atmosphere. The catacombs beneath Rome are home to an elaborate system of puzzles where you arrange medieval coats of arms and walk on a map of the world to open passages and reveal secrets. Golden angels in the Vatican hold hourglasses that must be manipulated to access a hidden stairway. A bit of a Mission: Impossible vibe is also established courtesy of the frequent need to hack computer systems on your PDA and mess around with modern, high-tech security devices like laser beams. All of the above is accentuated by tremendous production values. The game uses 3D visuals that are on par with some of the better adventure titles in recent years. Characters look great, animations are realistic (even if the controls are a bit clunky and the pathfinding a little messed up, especially when you're dealing with doorways and pillars), and locations boast a lot of color and detail, along with superb use of light and shadow. The script and voice acting are excellent across the board. Rolf Saxon again does a great job with George, lending his lines a ~not this again!~ weariness that anyone would feel after being lured into yet another dangerous expedition by yet another mysterious dame. Regina Regan does mostly first-rate work with Anna Maria, as well, and even incidental roles like the thugs and guards are acted with a subtlety that you don't often find in games. Usually even the best-acted games feature what sounds like the developer's pals in the lesser roles, but every character here seems to have been voiced by a pro, or at the very least a first-rate amateur. And the musical score perfectly weaves in and out of the action just as if this were a movie--always adding to what's taking place onscreen, never interfering. Who wouldn't risk life and limb for her? Unfortunately, Revolution is a little too in love with what it has to show off here, and this gets in the way of playing the game. The camera is locked on your character at all times and is always too close to the action, which gives you a great vantage point when checking out George's chiseled features or Anna Marie's lovely eyes but puts you at a big disadvantage when it comes to scoping out all of the hot spots in various locations. Camera closeness even makes it a pain to just walk around. You usually can't see far enough away to get across a room in a couple of clicks, so you're often forced to stutter-step your way to and fro. Also, the dialogue and voice acting may be top-tier, but there is way too much of it. Conversations typically drag on forever, and many lines are there simply to add flavor and provide no pertinent information. Making matters even worse, you can't skip over any of this blah-blah-blah wordiness and often have to exhaust all of the dialogue options to open up new discussion topics or the ability to solve a problem. So even while you admire the script and acting, you soon come to almost dread having a conversation with anybody. While its old-fashioned flair means that Secrets of the Ark is less a modern adventure than an updated take on something that grandma used to make, this game doesn't feel like a relic. Revolution has done a great job blending new and old here, with gorgeous contemporary graphics and sound accompanying traditional puzzles that get back to common sense. You need some patience to deal with the visual problems and the wordy dialogue, but if you like adventure games, don't miss this one."}