{"ref": "https://www.gamespot.com/reviews/ncaa-football-07-review/1900-6154266/", "date": "July 18, 2006", "game_name": "NCAA Football 07", "text": "Though it's consistently one of the best-selling games each year, EA Sports' NCAA Football series has long languished behind its NFL big brother, the Madden NFL series, at least in terms of public perception. So while it was no surprise that Madden debuted first on the PlayStation Portable with last year's Madden NFL 06, the college-football faithful knew it was only a matter of time before their favorite sport made its way to handhelds. Here we are a year later, and NCAA Football 07 has arrived on the PSP. Though its atmosphere and gameplay don't quite match up to the consistent level of quality found in the console versions of the series, NCAA Football 07 is still a fine debut on the PSP. College football has finally arrived on the PSP. From the outset, NCAA Football 07 for the PSP has many of the hallmarks found in the console versions of the game: hundreds of teams to choose from (including teams from notable years such as the 2002 Ohio State Buckeyes, the 1990 Colorado Buffaloes, and all-time versions of major programs); playbooks that are nearly as unique to the schools as the teams' mascots; and a respectable, if not exactly overflowing, list of gameplay modes. When playing on the field, NCAA Football 07 will look and feel quite familiar. Indeed, even on the PSP's smaller screen and using the handheld's modified control scheme, it won't take long for you to get the game under your fingers. The passing and running-game controls are similar to those in the PlayStation 2 version of the game, with only a few exceptions--you might find your hand inadvertently reach for the nonexistent right analog stick when trying to pull of a juke with the ball carrier, for example, when, in fact, juke moves are controlled with a combination of the left trigger and face buttons. A few other key additions to NCAA Football 07 are significant, as well. Many of the changes have to do with special teams, including a new kick meter that is a significant improvement over the old three-button-press system found in older games. The new kicking system uses the analog stick to both aim and send the kick off, and it's a nice improvement on the old version--the variation on the mechanic for onside kicks is also well done. Instead of simply aiming your kick and giving the ball a light boot, you can now aim exactly where you like on the ball itself, giving you more control than ever on how the ball bounces when it leaves your foot. A couple of key changes add up to a lot more effectiveness on special teams. For one, a lower perspective on the field when returning punts and kickoffs adds a much more immediate feel to this exciting play. You won't have a complete view of the field; instead, you'll be focusing on the real estate more or less right in front of you. On the other hand, the holes that do open up seem that much bigger by comparison. When playing on defense, you can switch to a closer, isometric perspective of the player you are controlling by pressing the triangle button. Combine this more immediate point of view with another new addition to the controls--a ~jump-the-snap~ button that lets you get a good jump off the line if you time it just right--and you can pretty effectively put some pressure on the kicker lined up 10 yards deep. We won't go so far as to say that the jump-the-snap button will guarantee that you'll get a hand up in the kicker's face, but considering how rare blocked kicks have been in the past, it's a welcome addition to the game. It's a good idea to use the jump-the-snap option often in the game, as it's a good way to keep pressure up on the opposing quarterback, as well. Watch out that you don't use it as a crutch, however--it's easy enough to get caught if you abuse it, especially considering the artificially intelligent computer will make liberal use of a key weapon in its arsenal--the fake-snap camera, which can easily trick you into going offside by quickly pulling back the camera simulating the motion the game camera makes when the quarterback calls for the snap. What's more, the AI doesn't really abuse this ~feature,~ instead it tries the fake snap at the most opportune moments, such as third and short, when a five-yard offside penalty would keep its drive alive. It's devilish, and very authentic, stuff. Rivalries matter more in the college game than in practically any other sport. That said, there are a few areas in which the PSP version of NCAA 07 falls short. The most obvious area of trouble is in the ground game, specifically when running up the middle. All too often, when plowing your running back in between the tackles, he'll get stuck behind an offensive lineman and simply choose to run in place, rather than bounce to the outside. Arguably, this can be blamed on the player controlling that runner, but nonetheless, it simply doesn't feel, or look, right. Some of the most powerful running backs in the country should be able to burst through defensive lines and create some openings for themselves; this doesn't seem to happen nearly as much in the game as it should. Furthermore, ball carriers will often simply bounce off of defenders trying to tackle them, and a guaranteed loss turns into an unlikely gain. One or two instances of players breaking away from sure tackles and turning something into nothing would be exciting; it happens enough in NCAA 07 as to be annoying. Also, spotting the ball seems to be slightly off--a three-yard gain on the ground sometimes is spotted as no gain at all. When it comes to game modes, NCAA 07 for the PSP is missing the Campus Legend mode, as well as the minigames featured in the console versions. That's the bad news. The good news is that Dynasty mode--the central component of NCAA 07's success over the past few years--is in the game; in fact, it's more or less the centerpiece of the PSP game's gameplay. Yes, you can spend some time with a rivalry or mascot game in NCAA 07, but with such a deep and rewarding Dynasty mode available to you, why would you want to? Dynasty mode is the real meat that college-football fanatics will want to sink their teeth into, and for the most part, it's a tasty meal indeed. New control tweaks and camera perspectives help keep this year's game fresh. Whether you're looking to take on a program from scratch and raise it up to the level of national prominence or continue the winning ways of a Texas or a USC, Dynasty mode continues to be one of the more compelling ~general manager~-style modes in sports gaming. Forget dealing with salary caps and hot dog vending prices; in NCAA 07, your only job is dealing with high school talent and doing whatever it takes to get the five-star prospects to bring their game to your school. For the most part, the PSP presentation of NCAA 07's Dynasty mode is easy to follow and well organized. You'll always have access to your team's needs, so you'll know which positions need filling, and you get even better pitch feedback during the off-season, letting you know which subjects a recruit responds to and which ones he couldn't care less about. Dynasty mode isn't always perfect. The weekly recruiting model, for example, could probably stand to be overhauled. As it is now, you have just five scant weeks to work with during the off-season--five chances to get your recruiting right, use up all your available scholarships, and woo the talent you wish to lure. After you've completed that week's activities, you simply move forward to the next week and repeat the procedure. A daily format, combined with some more specific feedback from recruits on your program's chances, would make a good thing even better. Certainly, the ability to recruit year-round helps and lets you always have your finger on the future of your team's roster, but we're still waiting for that really big Dynasty-mode makeover that reinvigorates the series' best gameplay mode. The Xbox 360 version of NCAA Football 07 is certainly the graphical crown jewel of the series so far, but the PSP version is no visual slouch either. Though the player models aren't as sharp as you might expect, the game runs at a decent clip throughout. A few weird camera issues crop up from time to time--the camera never seems to get behind the player catching the ball fast enough when returning punts, for example--but for the most part, it's a good-looking game that has a respectable frame rate. It's too bad, then, that some of the stadiums found in the game are flat-out wrong--Auburn's Jordan-Hare Stadium and Washington's Husky Stadium spring immediately, and most egregiously, to mind--but the casual college-football fan might not even notice something like that. Then again, is there really such a thing as a ~casual~ college-football fan? The other half of the presentation equation--the game's sound--is a solid package. Kirk Herbstreit, Lee Corso, and Brad Nessler have added new lines to an ever-growing collection of witty (and sometimes insightful) commentary; the college fight songs are a marked improvement from the standard EA Trax audio drivel; and the crowd chants sound enthusiastic, if not huge, as they support their favorite team. We beat Alabama 48-3 in this game. Fear the thumb, suckers! Online play via both infrastructure and ad hoc mode is functional, but inconsistent. For games played via ad hoc, the game performs fairly well--there's a little lag in the menus and during some plays, but nothing that's going to bog the game down. Sadly, this isn't always the case in infrastructure mode--where games can be hampered by frustrating performance. It's especially noticeable in the kicking game, where timing is everything. Furthermore, we experienced several cases playing in both ad hoc and infrastructure games where plays didn't unravel as they should (the quarterback missed a handoff) or the player we controlled simply stopped responding to input when running the ball. On the plus side, the game offers a number of different options when creating your game--skill level, home field advantage, evening team performance--that will help keep multiplayer games fresh. In all, NCAA Football 07 is a good option for the devoted college-football faithful, and the PSP version brings more quality than quantity. Here's hoping future installments of the PSP series not only bring the game up to the console's standards in terms of sheer content but also make use of the inherent advantages of the handheld platform (such as letting you synchronize your dynasty between the PSP and console versions of the game). For now, it's nice to know that you can bring the passion of college pigskin with you, no matter where you go. When it comes to game modes, NCAA 07 for the PSP is missing the Campus Legend mode, as well as the minigames featured in the console versions. That's the bad news. The good news is that Dynasty mode--the central component of NCAA 07's success over the past few years--is in the game; in fact, it's more or less the centerpiece of the PSP game's gameplay. Yes, you can spend some time with a rivalry or mascot game in NCAA 07, but with such a deep and rewarding Dynasty mode available to you, why would you want to? Dynasty mode is the real meat that college-football fanatics will want to sink their teeth into, and for the most part, it's a tasty meal indeed. New control tweaks and camera perspectives help keep this year's game fresh. Whether you're looking to take on a program from scratch and raise it up to the level of national prominence or continue the winning ways of a Texas or a USC, Dynasty mode continues to be one of the more compelling ~general manager~-style modes in sports gaming. Forget dealing with salary caps and hot dog vending prices; in NCAA 07, your only job is dealing with high school talent and doing whatever it takes to get the five-star prospects to bring their game to your school. For the most part, the PSP presentation of NCAA 07's Dynasty mode is easy to follow and well organized. You'll always have access to your team's needs, so you'll know which positions need filling, and you get even better pitch feedback during the off-season, letting you know which subjects a recruit responds to and which ones he couldn't care less about. Dynasty mode isn't always perfect. The weekly recruiting model, for example, could probably stand to be overhauled. As it is now, you have just five scant weeks to work with during the off-season--five chances to get your recruiting right, use up all your available scholarships, and woo the talent you wish to lure. After you've completed that week's activities, you simply move forward to the next week and repeat the procedure. A daily format, combined with some more specific feedback from recruits on your program's chances, would make a good thing even better. Certainly, the ability to recruit year-round helps and lets you always have your finger on the future of your team's roster, but we're still waiting for that really big Dynasty-mode makeover that reinvigorates the series' best gameplay mode. The Xbox 360 version of NCAA Football 07 is certainly the graphical crown jewel of the series so far, but the PSP version is no visual slouch either. Though the player models aren't as sharp as you might expect, the game runs at a decent clip throughout. A few weird camera issues crop up from time to time--the camera never seems to get behind the player catching the ball fast enough when returning punts, for example--but for the most part, it's a good-looking game that has a respectable frame rate. It's too bad, then, that some of the stadiums found in the game are flat-out wrong--Auburn's Jordan-Hare Stadium and Washington's Husky Stadium spring immediately, and most egregiously, to mind--but the casual college-football fan might not even notice something like that. Then again, is there really such a thing as a ~casual~ college-football fan? The other half of the presentation equation--the game's sound--is a solid package. Kirk Herbstreit, Lee Corso, and Brad Nessler have added new lines to an ever-growing collection of witty (and sometimes insightful) commentary; the college fight songs are a marked improvement from the standard EA Trax audio drivel; and the crowd chants sound enthusiastic, if not huge, as they support their favorite team. We beat Alabama 48-3 in this game. Fear the thumb, suckers! Online play via both infrastructure and ad hoc mode is functional, but inconsistent. For games played via ad hoc, the game performs fairly well--there's a little lag in the menus and during some plays, but nothing that's going to bog the game down. Sadly, this isn't always the case in infrastructure mode--where games can be hampered by frustrating performance. It's especially noticeable in the kicking game, where timing is everything. Furthermore, we experienced several cases playing in both ad hoc and infrastructure games where plays didn't unravel as they should (the quarterback missed a handoff) or the player we controlled simply stopped responding to input when running the ball. On the plus side, the game offers a number of different options when creating your game--skill level, home field advantage, evening team performance--that will help keep multiplayer games fresh. In all, NCAA Football 07 is a good option for the devoted college-football faithful, and the PSP version brings more quality than quantity. Here's hoping future installments of the PSP series not only bring the game up to the console's standards in terms of sheer content but also make use of the inherent advantages of the handheld platform (such as letting you synchronize your dynasty between the PSP and console versions of the game). For now, it's nice to know that you can bring the passion of college pigskin with you, no matter where you go."}