{"ref": "https://www.gamespot.com/reviews/ncaa-football-07-review/1900-6154325/", "date": "July 19, 2006", "game_name": "NCAA Football 07", "text": "NCAA Football 07 is the sixth game to appear on the Xbox and the PlayStation 2 from EA Sports' long-running college football series, and it once again maintains the high level of quality the series has come to be known for. New control tweaks and a revamped career mode are highlights to a package that will undoubtedly be attractive to fans of the series and to college football nuts. Even those who are new to the sport, however, will find something to like about this approachable and depth-filled college football game. It's time to warm up your coach's poll: NCAA Football 07 is here. Because the series has been around for so long, it's natural to expect a lot from it, both in terms of quality and quantity. The modified Madden engine, which has served the college football series well for many years now, is further refined in NCAA 07. The result is a game that will feel familiar to veterans of the series while still being approachable to those who are new to it. Familiar controls, such as the precision passing mechanic--which lets you glide in a pass in front of, behind, above, or down low on a receiver--are still well intact. When running the ball, jukes are controlled with the left or right triggers, or with the right analog stick. By using the stick, you can dodge defenders left or right, as well as plow through them by pushing forward, or you can even pull off a tricky back juke (essentially stopping in place while the defender sails right past you). The slight delay between the input on the stick and the player's reaction on the field means you'll want to make your juke decision early, but you'll warm up to the timing pretty quickly. Most of the new control tweaks are found either on defense or on special teams. A new kick meter, for example, is a big improvement over the old three-button-press system. Here, you use the left analog stick to aim your kick before the snap and the right analog to send your kick flying by first pressing back on the stick to load up power and then forward to send the ball flying. Where your kick is aimed will determine what angle you use on the right analog stick. If, for example, you are kicking at more or less a 60 degree angle, you'll need to make sure your backward and forward path on the right analog stick follows that same degree. The description sounds more complicated than it is--once you get used to the timing of the kick, you've more or less got it. Onside kicks have a new mechanic as well. Instead of choosing a direction for your kick before kickoff, you choose exactly where you want the kicker to make contact on the ball. Kick it low to chip the ball into the air or kick it up high to keep it rolling along the field. Those aren't the only changes to the special teams, however. Blocking punts and field goals, which were more or less anomalies in previous versions of the NCAA series, are easier this time around, thanks to some new controls that add a real sense of drama and immediacy to the play. The first is an optional third-person isometric viewpoint, which you can switch to while on defense. From this vantage point, just over the shoulder of the defender, you can see a better path to the kicker in order to get your hands on the ball, especially if you use the jump-the-snap option. By pressing the A button (or X on the PlayStation 2 controller) at precisely the right moment, you can get a small jump on the snap and give your player that extra edge when making his way toward the ball. You can use the jump the snap on defense at times--it's a great way to put some extra pressure on the opposing quarterback. Momentum has been part of previous EA Sports titles, but the phenomenon of fortune swinging from one team to the next makes no better sense than in college football, where a game, a season, and the hopes of a fan base can be made or broken on a single play. It's not quite that dramatic in NCAA 07, but the game does a pretty good job of modeling these changes of momentum by giving each team a momentum bar that builds up with each successive play and is decreased for each negative result on the field. Gain enough momentum and you'll get incremental bonuses to your entire team's performance (and conversely, if you screw up enough, your opponent will reap the benefits). Another noticeable change to NCAA 07 is the playbooks, which have been beefed up considerably from previous entries in the series. Because college football playbooks vary so wildly from school to school (compare Air Force's option-heavy attack to the Nevada pistol, for example), this might seem like a small addition but, for the faithful, it's a compelling addition that brings even more authenticity to the game. The new kicking meter plays more like a golf swing in Tiger Woods. One thing's for sure: You won't lack for things to do when playing NCAA 07. In addition to the standard quick game, practice, rivalry, mascot games, and dynasty mode, the game also includes a number of new modes to check out--including new spring drill minigames, scrimmage mode, and campus legend mode. Spring drills are essentially position-specific minigames that let you test your skills as a quarterback, running back, or wide receiver on offense via drills such as the pass skeleton, rushing attack, and route running. On defense, you can practice being a lineman, linebacker, or defensive back on such positional drills as DB cover, rush the QB, and defending the option. You can even practice your punt and kickoff returns, if you're so inclined. Beyond being a short diversion from regular 11-on-11 games, these drills can help you hone your skills by playing in positions you might not be familiar with (we found the DB coverage drills to be especially challenging). Scrimmage mode gives each team five minutes of offense apiece to rack up as many first downs and touchdowns as it can before the other team gets the ball. The mode also serves as the all-important spring game in other modes to help you evaluate new, incoming talent on your roster. Technically, campus legend isn't an entirely new mode; it's really just last year's Race for the Heisman mode given a new name and a fresh coat of paint. You still start as an incoming freshman looking to make a name for yourself on campus--not just by performing well on the football field, but also by excelling academically and socially. When you create a player character and choose the position he will play, you're taken to a number of position-specific spring drills similar to the ones described above to determine your skill at your position. Campus legend mode is a twist of sorts to last year's Race for the Heisman mode. After filling out your player attributes, you're taken to your dorm room, where you'll be required to pick a school to play for, choose your major, and then proceed to the regular season. Along the way, you'll have daily practices, cram time with your tutors, and free time to study. You'll also hit the practice field for more drills or attend social activities to boost your popularity. You'll be able to keep track of your progress toward being a campus legend as you go--and how you balance your social, academic, and athletic performances is the key measure of success in the mode. Campus legend mode doesn't feel all that different from last year's Race for the Heisman mode. There are a few more things to do (choosing a major and taking tests is fun and vital to your career as a student-athlete, even if the questions in the test are, at worst, ridiculously easy and, at best, easily Google-able), but there still seems to be a lot of room for improvement. The more-holistic approach to college life featured in the mode still doesn't stop you from focusing solely on your individual player's statistics above all else when playing a game. Furthermore, playing any other position other than quarterback or halfback seems like a waste of time here. Still, it's certainly not a bad diversion from the other modes in the game. All of these extra modes are really icing on the cake that is NCAA 07's dynasty mode. Though it's basically unchanged from last year's game, dynasty mode remains one of the more compelling ~general manager~-style modes in sports gaming. Salary caps and player contracts have no place here. Instead, all you're concerned with is keeping your talent coffers filled season after season. The miniature dramas of the offseason--trying to convince players to sign letters of intent, and trying to find the perfect pitch during their on-campus visits--are almost as enjoyable as grinding it out on the field. While dynasty mode remains a lot of fun to play, it's about time that the development team at EA Tiburon shook things up a bit. For too long, the most compelling feature in the mode--the five-week recruiting period--has operated more or less the same from year to year: You talk to a bunch of recruits one week and then fast-forward to the next week, where you read their feedback and then start the process all over again. That isn't how it works in the real world--where coaches and recruits are in contact several times a week or more--and that needs to be reflected in future versions of the game. Here's hoping a more granular and detailed recruiting system in dynasty mode finds its way into the game in the near future. Online play on both the PS2 and the Xbox are both silky smooth in terms of performance, and beyond the occasional hiccup here and there, we experienced next to no lag in multiplayer games. Furthermore, playing against a compelling human foe is always more appealing than the more predictable artificial intelligence. It's too bad that EA is sticking with the annoying ESPN sponsorship program (which has you choose between either paying a $2 fee or allowing ESPN to spam you) in order to get the PlayStation 2 version of the game online. But, considering all it takes is a few button presses to get past, you can use that brief window of time to rest your eyes, formulate your evening grocery list, or ponder the meaninglessness of it all. It's up to you. Graphically, no one is going to confuse the Xbox or the PlayStation 2 version of NCAA 07 with the version found on the Xbox 360, though both current-gen versions are running at the same level of quality you're used to. Player models still animate well and, though the hits aren't as brutal as some of the ones found in the 360 version of the game, the occasional slow-motion, reverse-angle camera helps to spotlight some of the big plays. Oddly, these slo-mo perspective switches don't always highlight great plays--sometimes the camera will zoom in on a leaping defensive back, only to have the ball he's trying to intercept pass harmlessly over his head. Lee, Brad, and Kirk return for both duties and, yeah, Corso still puts on the mascot heads. Brad Nessler, Lee Corso, and Kirk Herbstreit once again populate the booth in NCAA 07. Herbstreit and Corso still gel well, not only with one another, but also with Nessler's solid play-by-play duties. You'll still hear lots of repetition from the likes of Corso, especially when you ask his advice on play calling, but for the most part, this trio is the best in the business. One strong change in the sound department is the removal of the contemporary rock and hip-hop tracks in favor of just focusing on the music that college football fans love--the fight songs. The sound and graphics add up to a truly authentic rendering of the college football experience, and it's an atmosphere that simply can't be found in any other sports game. There simply is no way to underestimate the passion fans have for the game of college football. By once again capturing that electric atmosphere in NCAA 07, and combining it with an ever-evolving set of control tweaks and gameplay modes, EA Sports has created a game that no fan of football video games--be they college or pro--will want to be without. Technically, campus legend isn't an entirely new mode; it's really just last year's Race for the Heisman mode given a new name and a fresh coat of paint. You still start as an incoming freshman looking to make a name for yourself on campus--not just by performing well on the football field, but also by excelling academically and socially. When you create a player character and choose the position he will play, you're taken to a number of position-specific spring drills similar to the ones described above to determine your skill at your position. Campus legend mode is a twist of sorts to last year's Race for the Heisman mode. After filling out your player attributes, you're taken to your dorm room, where you'll be required to pick a school to play for, choose your major, and then proceed to the regular season. Along the way, you'll have daily practices, cram time with your tutors, and free time to study. You'll also hit the practice field for more drills or attend social activities to boost your popularity. You'll be able to keep track of your progress toward being a campus legend as you go--and how you balance your social, academic, and athletic performances is the key measure of success in the mode. Campus legend mode doesn't feel all that different from last year's Race for the Heisman mode. There are a few more things to do (choosing a major and taking tests is fun and vital to your career as a student-athlete, even if the questions in the test are, at worst, ridiculously easy and, at best, easily Google-able), but there still seems to be a lot of room for improvement. The more-holistic approach to college life featured in the mode still doesn't stop you from focusing solely on your individual player's statistics above all else when playing a game. Furthermore, playing any other position other than quarterback or halfback seems like a waste of time here. Still, it's certainly not a bad diversion from the other modes in the game. All of these extra modes are really icing on the cake that is NCAA 07's dynasty mode. Though it's basically unchanged from last year's game, dynasty mode remains one of the more compelling ~general manager~-style modes in sports gaming. Salary caps and player contracts have no place here. Instead, all you're concerned with is keeping your talent coffers filled season after season. The miniature dramas of the offseason--trying to convince players to sign letters of intent, and trying to find the perfect pitch during their on-campus visits--are almost as enjoyable as grinding it out on the field. While dynasty mode remains a lot of fun to play, it's about time that the development team at EA Tiburon shook things up a bit. For too long, the most compelling feature in the mode--the five-week recruiting period--has operated more or less the same from year to year: You talk to a bunch of recruits one week and then fast-forward to the next week, where you read their feedback and then start the process all over again. That isn't how it works in the real world--where coaches and recruits are in contact several times a week or more--and that needs to be reflected in future versions of the game. Here's hoping a more granular and detailed recruiting system in dynasty mode finds its way into the game in the near future. Online play on both the PS2 and the Xbox are both silky smooth in terms of performance, and beyond the occasional hiccup here and there, we experienced next to no lag in multiplayer games. Furthermore, playing against a compelling human foe is always more appealing than the more predictable artificial intelligence. It's too bad that EA is sticking with the annoying ESPN sponsorship program (which has you choose between either paying a $2 fee or allowing ESPN to spam you) in order to get the PlayStation 2 version of the game online. But, considering all it takes is a few button presses to get past, you can use that brief window of time to rest your eyes, formulate your evening grocery list, or ponder the meaninglessness of it all. It's up to you. Graphically, no one is going to confuse the Xbox or the PlayStation 2 version of NCAA 07 with the version found on the Xbox 360, though both current-gen versions are running at the same level of quality you're used to. Player models still animate well and, though the hits aren't as brutal as some of the ones found in the 360 version of the game, the occasional slow-motion, reverse-angle camera helps to spotlight some of the big plays. Oddly, these slo-mo perspective switches don't always highlight great plays--sometimes the camera will zoom in on a leaping defensive back, only to have the ball he's trying to intercept pass harmlessly over his head. Lee, Brad, and Kirk return for both duties and, yeah, Corso still puts on the mascot heads. Brad Nessler, Lee Corso, and Kirk Herbstreit once again populate the booth in NCAA 07. Herbstreit and Corso still gel well, not only with one another, but also with Nessler's solid play-by-play duties. You'll still hear lots of repetition from the likes of Corso, especially when you ask his advice on play calling, but for the most part, this trio is the best in the business. One strong change in the sound department is the removal of the contemporary rock and hip-hop tracks in favor of just focusing on the music that college football fans love--the fight songs. The sound and graphics add up to a truly authentic rendering of the college football experience, and it's an atmosphere that simply can't be found in any other sports game. There simply is no way to underestimate the passion fans have for the game of college football. By once again capturing that electric atmosphere in NCAA 07, and combining it with an ever-evolving set of control tweaks and gameplay modes, EA Sports has created a game that no fan of football video games--be they college or pro--will want to be without."}