{"ref": "https://www.gamespot.com/reviews/ncaa-football-06-review/1900-6128862/", "date": "July 11, 2005", "game_name": "NCAA Football 06", "text": "Summer vacation has barely begun for many school-going football fans, but with the release of NCAA Football 06, EA Sports is looking to send you on an early trip back to campus. The game includes several major tweaks and upgrades, such as the race for the Heisman mode and in-season recruiting. Perhaps more importantly, the game balance, especially in the passing portion, is much improved over last year's edition. The improved game balance and new features make NCAA Football 06 arguably the best in the series, as well as a game that's a must-have for college football fanatics. You'll do one of these drills to start off your race for the Heisman. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: NCAA Football 06 Video Review EA took a major departure with the marketing of NCAA 06 by not choosing a member of the recent NFL draft class as its cover athlete. Instead, 1991 Heisman Trophy winner Desmond Howard, a wide receiver from the University of Michigan, was picked to grace the cover. Certainly, his memorable on-the-field pose played into that decision, as one of NCAA 06's primary new features is the race for the Heisman mode. The race for the Heisman plays out much like a football role-playing game, as you take the role of a fresh-faced high school recruit looking to break into the big time in college football. When you first boot up the game, you're actually dropped immediately into creating a character for the race for the Heisman. You'll select from one of eight different positions, including quarterback, running back, wide receiver, and even defensive positions, like linebacker and defensive back. From there you'll run a drill that will determine the starting stats of your created character, as well as generate scholarship offers from interested schools. This doesn't really matter though, as you're able to walk on to any school you please to take over the starting job. From there, the race for the Heisman plays out like dynasty mode, sans the recruiting and coaching decisions. You'll play up to four seasons of football while attempting to generate eye-popping stats that will attract the attention of Heisman voters. As you play and win games for your team, you'll accumulate trophies to view in your dorm room, as well as get fan mail. There's even a picture of your girlfriend that you can view on the computer. You'll start out with a rather homely looking lady, but as you become a bigger star, the girls in your pictures become more and more attractive. The fan mail and girlfriend pictures don't serve any real purpose aside from, perhaps, being a not-so-subtle social commentary. Getting back to the point of the race for the Heisman... The ultimate goal is to win the year-end award for being the best player in college football. This means that playing in this mode can skew how you normally play out games, as you'll tend to call your own number each down on offense, or you'll take more risks on defense in hopes of earning interceptions, forced fumbles, and sacks. This can be unrealistic. So, for example, if you're playing as a quarterback, and you're well ahead in a game, you'll be tempted to keep throwing the ball to pile on stats when the correct strategy is to run the ball to drain the clock. Despite these issues, the mode can be fun for those who seek individual glory, and it's a nice twist on the standard dynasty mode. Recruiting is a yearlong process in NCAA 06. Speaking of dynasty mode, a couple of new wrinkles have been added in NCAA 06, the most significant of which is the inclusion of in-season recruiting. Week by week, you can allocate a percentage of your recruiting clout to pursuing top high school players. Over the course of the season, recruits will cull their lists of prospective schools down, and if you can make it to their final three, you can invite them on campus for a visit and a hard sell. You'll want to pick a weekend where you play (and hopefully beat) a marquee opponent. If you're shrewd, you'll be able to pick up a few blue chippers before the real bulk of the recruiting happens in the offseason. The inclusion of in-season recruiting is a nice touch, giving you more to do during the season. But it's not perfect. For example, if you drop off of a recruit's list of prospective schools, you can't (for some unknown reason) pursue a new player that you didn't target at the start of the season. You must simply reallocate your points to one of your other preseason targets. The developer has also added the notion of recruiting pipelines into NCAA 06. If you have a good number of players from a certain state, that state becomes a pipeline for you, and it supposedly becomes easier--later on--to recruit players from that state. For most schools, only their home state and maybe a couple of neighboring ones are designated as pipelines. However, as you advance through the years of a dynasty and improve your school's standing, you'll create more pipelines in different states. It sounds nice in theory, but in our testing, we had a hard time discerning the tangible effects of creating a pipeline. Still, there have been other nice tweaks made, such as a running notebook that keeps track of which pitches you've already used on a recruit and how effective it was, as well as a scouting system that updates all of a recruit's vital stats (instead of just one at a time). As far as the actual gameplay goes, NCAA 06 is much improved over last year's version thanks to a refined balance in the passing game. One of the criticisms of last year's game was that it was all but impossible to throw a pass, as defensive backs reacted too quickly to balls in the air. Receivers in 05 would frequently drop passes as well. In NCAA 06, it's much easier to throw the ball with success. You'll still need skill to pass well, but good placement of the ball (and using highly rated receivers and quarterbacks) means you'll get away with throwing into coverage from time to time. Another change to the passing game is that you no longer need to bring down the passing windows to scramble. Simply hold down X on the PlayStation 2 (or A on the Xbox) and your quarterback will bring the ball down to move more quickly in the backfield. The passing icons stay up, so you can quickly flick a pass once you've stopped running. This tweak sounds subtle, but it makes rollouts much more effective. It's no longer impossible to pass the ball thanks to the refinements in game balance. It's also much easier to practice passing in NCAA 06 thanks to the inclusion of the passing skeleton minigame, where you can practice throwing passes against a coverage, but without the pressure of a pass rush. This mode is extremely useful for honing your coverage reading skills. There are three other minigames that can help you improve your skills in the running game, the option, and defense; all four are dubbed ~spring drills.~ These spring drills seem to have replaced the college classics mode, which is not included in NCAA 06. However, the spring drills do help you improve on different aspects of the game, so they're less of a gimmick than the college classics mode was. Other tweaks have been made to the control scheme in NCAA 06 relating to the right thumbstick. Though the series has yet to adapt the playmaker controls from Madden, NCAA has adopted the hit stick from the pro football sim. Now, as you close in on the ball carrier, you can tap the right analog stick in the direction of your target to apply a bone-crunching tackle, which increases the chances of a turnover. The swim, spin, and bull-rush moves for defensive linemen are also mapped to the right analog stick, making line play more intuitive than before. On the offensive side of the ball, you can use the right analog stick to juke or sidestep left and right as the ball carrier, or you can even do a little stop-and-go move if you tap in the down direction. That particular move is great for getting past defenders approaching you from a steep angle. Overall, the use of the right analog stick for various moves in NCAA 06 improves the game a great deal, making jukes and other spectacular plays more intuitive to pull off. Impact players are immediately noticeable because of the white shadows underneath them. The inclusion of impact players is also worth mentioning. Your impact players on both offense and defense are denoted by solid white shadows underneath them. These players are basically your go-to guys--the ones you turn to when you need an important first down or need to make a key stop. From time to time during a game, your impact players will get ~in-the-zone,~ and their white shadows will pulsate. It's never quite clear why a player will get in-the-zone when he does, because the timing seems unrelated to recent performance. It just seems to happen at random. But when it does happen, the player that's in-the-zone will be capable of performing even better than normal. A ball carrier, for example, may be able to break a tackle that he normally wouldn't be able to evade. A linebacker who's in-the-zone may be more likely to force a fumble upon contact. Sometimes these special plays will result in brief pauses in the action, and the camera will then zoom in to show off the feat. These Matrix-like camera tricks don't happen all too often, but when they do, they always highlight something pretty cool. Over the course of a dynasty, it's possible for impact players on a team to change. For example, while playing as Cal, the quarterback became an impact player in the middle of our season because he piled up great statistics over the first six games. As far as the actual gameplay goes, NCAA 06 is much improved over last year's version thanks to a refined balance in the passing game. One of the criticisms of last year's game was that it was all but impossible to throw a pass, as defensive backs reacted too quickly to balls in the air. Receivers in 05 would frequently drop passes as well. In NCAA 06, it's much easier to throw the ball with success. You'll still need skill to pass well, but good placement of the ball (and using highly rated receivers and quarterbacks) means you'll get away with throwing into coverage from time to time. Another change to the passing game is that you no longer need to bring down the passing windows to scramble. Simply hold down X on the PlayStation 2 (or A on the Xbox) and your quarterback will bring the ball down to move more quickly in the backfield. The passing icons stay up, so you can quickly flick a pass once you've stopped running. This tweak sounds subtle, but it makes rollouts much more effective. It's no longer impossible to pass the ball thanks to the refinements in game balance. It's also much easier to practice passing in NCAA 06 thanks to the inclusion of the passing skeleton minigame, where you can practice throwing passes against a coverage, but without the pressure of a pass rush. This mode is extremely useful for honing your coverage reading skills. There are three other minigames that can help you improve your skills in the running game, the option, and defense; all four are dubbed ~spring drills.~ These spring drills seem to have replaced the college classics mode, which is not included in NCAA 06. However, the spring drills do help you improve on different aspects of the game, so they're less of a gimmick than the college classics mode was. Other tweaks have been made to the control scheme in NCAA 06 relating to the right thumbstick. Though the series has yet to adapt the playmaker controls from Madden, NCAA has adopted the hit stick from the pro football sim. Now, as you close in on the ball carrier, you can tap the right analog stick in the direction of your target to apply a bone-crunching tackle, which increases the chances of a turnover. The swim, spin, and bull-rush moves for defensive linemen are also mapped to the right analog stick, making line play more intuitive than before. On the offensive side of the ball, you can use the right analog stick to juke or sidestep left and right as the ball carrier, or you can even do a little stop-and-go move if you tap in the down direction. That particular move is great for getting past defenders approaching you from a steep angle. Overall, the use of the right analog stick for various moves in NCAA 06 improves the game a great deal, making jukes and other spectacular plays more intuitive to pull off. Impact players are immediately noticeable because of the white shadows underneath them. The inclusion of impact players is also worth mentioning. Your impact players on both offense and defense are denoted by solid white shadows underneath them. These players are basically your go-to guys--the ones you turn to when you need an important first down or need to make a key stop. From time to time during a game, your impact players will get ~in-the-zone,~ and their white shadows will pulsate. It's never quite clear why a player will get in-the-zone when he does, because the timing seems unrelated to recent performance. It just seems to happen at random. But when it does happen, the player that's in-the-zone will be capable of performing even better than normal. A ball carrier, for example, may be able to break a tackle that he normally wouldn't be able to evade. A linebacker who's in-the-zone may be more likely to force a fumble upon contact. Sometimes these special plays will result in brief pauses in the action, and the camera will then zoom in to show off the feat. These Matrix-like camera tricks don't happen all too often, but when they do, they always highlight something pretty cool. Over the course of a dynasty, it's possible for impact players on a team to change. For example, while playing as Cal, the quarterback became an impact player in the middle of our season because he piled up great statistics over the first six games. Graphically, player models have been tweaked to look skinnier than players in Madden, which helps reflect the young age of college football players, most of whom haven't fully filled out yet. There have also been a lot of additions made to the animations in NCAA 06. Gang tackles, pancake blocks, and other new animations have been added, further refining the game's looks. The base engine remains pretty much the same, though, so don't expect quite the same level of visual polish as in the Madden games. A new College GameDay-like pregame show has been added, starring the announcers Brad Nessler, Kirk Herbstreit, and Lee Corso. While new commentary from the trio helps with the audio presentation, the actual character models for the three look rather rough, and they don't animate very well at all. NCAA 06 is a great game overall, and it belongs in every college football fan's collection. The sound effects in the game remain good overall, but, unfortunately, EA has decided to include EA Trax to score the menus. As a result, the songs in the soundtrack are a mishmash of different genres. You'll be grooving to De La Soul's ~Me, Myself and I~ one moment, and the next you're feeling angst while listening to the Clash's ~Train in Vain.~ How do those go together? We're still wondering. The other tracks are primarily commercialized pseudopunk that were probably rejected from the Burnout 3 soundtrack, as none of them evokes a college football mood. Thankfully, you can switch to traditional fight songs in the settings, but if you want to play the spring drills minigames, you're still forced to listen to the mess of EA Trax. Online play is included on both platforms, and it seemed to work well in our testing on empty test servers. Gameplay was generally responsive and lag-free, so hopefully this situation will continue on the retail servers as they fill up with players. You'll need to create a login on EA's servers, and there you'll be treated to the usual array of features, including ranked ladders, lobbies, news, periodic tournaments, and more. As far as the differences between the two platforms, the PS2 version has superior control over the Xbox version because all the buttons are more easily reachable. If you play a lot of option offense, for example, you won't like that the pitch and fake-pitch buttons are mapped to the black and white buttons on the Xbox controller. The control issues relating to button placement are, in fact, appreciable on both sides of the ball. However, the PS2 version of the game suffers from really long load times for menus, as well as when simulating weeks during the dynasty and race for the Heisman modes. The Xbox loads and simulates many times faster, so if you envision yourself spending a lot of time in the career modes, you may want to consider the Xbox version, even with its control issues. Finally, the PS2 version does suffer from slowdown in some circumstances. The frame rate drop seems to happen the most on kickoff returns and other low-angle situations, but in general, it's not nearly the big problem that the Xbox slowdowns were on last year's game. It's difficult for us to determine which version is better, so deciding between faster load times and slicker in-game controls is likely to be a more personal decision. The licensed soundtrack tends to take away from the overall feel of the game. While a bevy of nifty new features has been added to NCAA Football 06, the best aspect of the game is probably its re-tweaking of the usual NCAA game balance. The actual nuts and bolts of playing a game of NCAA 06 make it feel just right, and for veterans of the series, playing will evoke warm memories of NCAA 04. Combining that great gameplay balance with all the new features added over the past two years results in a game that every college football fan should have in his or her library. Graphically, player models have been tweaked to look skinnier than players in Madden, which helps reflect the young age of college football players, most of whom haven't fully filled out yet. There have also been a lot of additions made to the animations in NCAA 06. Gang tackles, pancake blocks, and other new animations have been added, further refining the game's looks. The base engine remains pretty much the same, though, so don't expect quite the same level of visual polish as in the Madden games. A new College GameDay-like pregame show has been added, starring the announcers Brad Nessler, Kirk Herbstreit, and Lee Corso. While new commentary from the trio helps with the audio presentation, the actual character models for the three look rather rough, and they don't animate very well at all. NCAA 06 is a great game overall, and it belongs in every college football fan's collection. The sound effects in the game remain good overall, but, unfortunately, EA has decided to include EA Trax to score the menus. As a result, the songs in the soundtrack are a mishmash of different genres. You'll be grooving to De La Soul's ~Me, Myself and I~ one moment, and the next you're feeling angst while listening to the Clash's ~Train in Vain.~ How do those go together? We're still wondering. The other tracks are primarily commercialized pseudopunk that were probably rejected from the Burnout 3 soundtrack, as none of them evokes a college football mood. Thankfully, you can switch to traditional fight songs in the settings, but if you want to play the spring drills minigames, you're still forced to listen to the mess of EA Trax. Online play is included on both platforms, and it seemed to work well in our testing on empty test servers. Gameplay was generally responsive and lag-free, so hopefully this situation will continue on the retail servers as they fill up with players. You'll need to create a login on EA's servers, and there you'll be treated to the usual array of features, including ranked ladders, lobbies, news, periodic tournaments, and more. As far as the differences between the two platforms, the PS2 version has superior control over the Xbox version because all the buttons are more easily reachable. If you play a lot of option offense, for example, you won't like that the pitch and fake-pitch buttons are mapped to the black and white buttons on the Xbox controller. The control issues relating to button placement are, in fact, appreciable on both sides of the ball. However, the PS2 version of the game suffers from really long load times for menus, as well as when simulating weeks during the dynasty and race for the Heisman modes. The Xbox loads and simulates many times faster, so if you envision yourself spending a lot of time in the career modes, you may want to consider the Xbox version, even with its control issues. Finally, the PS2 version does suffer from slowdown in some circumstances. The frame rate drop seems to happen the most on kickoff returns and other low-angle situations, but in general, it's not nearly the big problem that the Xbox slowdowns were on last year's game. It's difficult for us to determine which version is better, so deciding between faster load times and slicker in-game controls is likely to be a more personal decision. The licensed soundtrack tends to take away from the overall feel of the game. While a bevy of nifty new features has been added to NCAA Football 06, the best aspect of the game is probably its re-tweaking of the usual NCAA game balance. The actual nuts and bolts of playing a game of NCAA 06 make it feel just right, and for veterans of the series, playing will evoke warm memories of NCAA 04. Combining that great gameplay balance with all the new features added over the past two years results in a game that every college football fan should have in his or her library."}