{"ref": "https://www.gamespot.com/reviews/shadow-man-2econd-coming-review/1900-2854290/", "date": "May 17, 2006", "game_name": "Shadow Man: 2econd Coming", "text": "Though it fared decently on certain platforms, the original Shadow Man didn't quite realize the intentions of its developers. Its spotty overall performance and its weak graphical production held it back in a harsh way. Even its cool visual design and well-conceived story elements couldn't save it. Thankfully, this isn't the case with its PS2 sequel, Shadow Man: 2econd Coming. While the game does have a few kinks of its own, Acclaim's Teeside studio has definitely come a whole lot closer to realizing Shadow Man's seething, brutal world. This time around, you won't find the game's actual gameplay sequences to simply be onerous tasks necessary to advance the plot; since everything runs fairly smoothly, the game is much more playable than its predecessor. This makes everything about its cool world and story that much easier to enjoy. The Shadow Man games are designed around the travails of Mike LeRoi, a young man whose destiny took a very odd turn. Through some strange course of events, he became the bearer of the Mask of Shadows--an ancient artifact that grants its wearer the ability to travel in between the worlds of the living and the dead. The bearer of the Mask, though, is also charged with the responsibility of protecting the denizens of the living world from otherworldly assaults, and his destiny, more often than not, is tied to the whims of a voodoo priestess who fixed the Mask upon him. In Mike's case, the voodoo priestess in question is Mama Nettie, and, lucky for him, she's both canny and, for the most part, benevolent. As logic would dictate, the Shadow Man games are built around the sort of dual-world dynamics that you see in the Soul Reaver series, but 2econd Coming takes this even further by more greatly varying the precise netherworld locales you'll visit. The game also makes nice use of African spirituality--you'll get the impression that the story's writers did their homework, and the effect is strongly felt. The names of deities are cited during cutscenes, and some of your more mystical weapons have Creole names. All of this adds up to a world that's rich and inviting. Luckily, Shadow Man 2econd Coming has got enough in the way of gameplay for you to keep you caring about its world and events. It's a third-person adventure game of the sprawling, expansive variety, and it sets you loose on a series of huge, detailed worlds whose nooks and crannies you must explore in your quest to prevent a group of demons from reawakening their long-banished master. Just like in the first game, Shadow Man's current mission has apocalyptic ramifications--this cadre of demons intends to bring nothing less than Armageddon, and, if Shadow Man fails, that is precisely what happens. Preventing them from doing this, as you'd imagined, will involve a whole lot of combat, puzzle solving, and exploration--none of which are things that worked especially well in the previous Shadow Man game. 2econd Coming has improved upon most of these elements to some degree, though in some cases more satisfactorily than in others. Combat is one of the areas that has been much improved, though when you judge it on its own merits, it has a few notable kinks. Mike LeRoi/Shadow Man has a whole bunch of weapons at his disposal, all of which he can use in both of his forms. The persona you actually get to control depends on the time of day: Mike turns into Shadow Man at night, though as the game progresses, you'll find a reliable way to manipulate this. Certain weapons are considered ~voodoo weapons,~ and their effects are truly felt only when you wield them as Shadow Man. Conversely, you'll find little point to using some of your regular weapons when you have access to the uberpowerful voodoo artifacts. In either case, you'll have access to up to four weapons at any given time, which, given that the game has upward of 20 weapons available, is pretty essential. You basically map individual items to each of the PS2's shoulder buttons, with the L2 and R2 buttons serving as triggers for the active weapons and the L1 and R1 buttons acting as reserves that you can switch to instantly. A good deal of the time, this allows you to be prepared for whatever comes. When you actually engage a creature, though, things aren't quite so clean. If you're using a ranged weapon, the game's autotarget feature has you covered nicely--a reticle appears on the body of whoever last came within range, and you're free to fire upon it. Multiple targets don't fare as easily, as you're basically at the mercy of the game's targeting script, but given the pace of most battles, it probably won't be too much of a problem. Things are considerably less precise with melee combat, though. There is no command to ~lock~ on your enemies, so you'll constantly strafe right past them or else walk into them. The fact that you can attack with both arms independently helps this somewhat, but in the end, the lack of a lock-on seriously limits your ability to strafe effectively and, thus, fight in melee most of the time.Exploration is what the game focuses on the other 50 percent of the time, and while the environments themselves are well designed enough to make exploring them fun and interesting, the actual level layouts are often kind of insane. Some of the more organic areas--wilderness areas or stretches of the netherworld, for instance--are much more tricky to get through than interior environments, but overall you'll find that lots of things aren't as immediately evident and visible as they perhaps should be. Much of the gameplay involves finding the right items needed to bypass or eliminate certain environmental obstacles. The problem is that most of the time, these connections aren't immediately evident. Such is the case early in the game, when you find oil cans placed in front of certain doorways. You eventually realize, via trial and error, that you have to shoot these for them to disappear, but this is never made explicit. Some of the actual methods, though--like using a special voodoo artifact to travel instantly between two blazing fires--are pretty interesting. Once you get used to the way things work in the world, they'll really become a pleasure to travel through. The fact that you can teleport instantly to many of the game's key locations via a special item also helps a great deal. Shadow Man 2econd Coming has a very cool look to it. This is not to say that its technical production is especially jaw-dropping; rather, it's more accurate to say that its developers were well aware of the PS2's graphical limitations and worked around them very well. The character models are perhaps the most significant element in the graphical production, and Shadow Man himself is easily the standout of the bunch. His hollow eyes constantly fume with unholy energy, and his body is an odd and colorful mixture of jagged bone, sinew, and flesh that's awesomely detailed and superbly animated. Most of the major characters look almost as good, as well as some of the more imposing enemies. Impressive graphical effects abound; when you swing your weapons, a stylized tracer will follow its path in the air, and when Mike makes the transformation to Shadow Man (and vice versa), netherworld energy will crackle all around them. Many of the voodoo weapons have amazing effects as well; their outputs often look and feel as deadly as their manual's text purports them to be, which makes using them quite a pleasure. The environments, finally, are all quite well designed, and, given the tangible gloom that's present in the game (as a sort of GTA3-like ~noise~ effect), each one seems even more a part of its world. The texture quality is often suspect, to be sure, but the developers seem to have done a good job of diverting attention from them in many ways. The aural production is also quite impressive; the voice acting, in most cases, is simply superb, and the music is both atmospheric and rousing when it needs to be. So what's wrong with Shadow Man 2econd Coming? Well, aside from the kinks related to combat and level layout, the game's control feels a little bit loose when you're simply running around. You'll often find yourself edging toward the corners of tunnels when your sole intent was to continue forward, and, in cases when you're walking on precarious surfaces, this can get quite annoying. Further, the game's frame rate has a tendency to stutter a bit more often than we'd have liked. Though it's often locked in the neighborhood of 30fps, several things can cause it to drop dramatically, which is quite a shame. Despite its flaws, Shadow Man 2econd Coming will likely manage to draw you in, especially if you can get into the creepy aesthetics and earnestly engaging story. It gets pretty heavy and biblical rather quickly, but it's definitely several cuts above the typical video game narrative in terms of character development and thematic depth. There's also quite a bit of gore and several four-letter words spread throughout, so kiddies beware. So overall, if you were the least bit interested in the original Shadow Man, or if you're simply interested in checking out a mostly slick adventure that's perhaps a little rough around the edges, Shadow Man 2econd Coming might just be for you.Exploration is what the game focuses on the other 50 percent of the time, and while the environments themselves are well designed enough to make exploring them fun and interesting, the actual level layouts are often kind of insane. Some of the more organic areas--wilderness areas or stretches of the netherworld, for instance--are much more tricky to get through than interior environments, but overall you'll find that lots of things aren't as immediately evident and visible as they perhaps should be. Much of the gameplay involves finding the right items needed to bypass or eliminate certain environmental obstacles. The problem is that most of the time, these connections aren't immediately evident. Such is the case early in the game, when you find oil cans placed in front of certain doorways. You eventually realize, via trial and error, that you have to shoot these for them to disappear, but this is never made explicit. Some of the actual methods, though--like using a special voodoo artifact to travel instantly between two blazing fires--are pretty interesting. Once you get used to the way things work in the world, they'll really become a pleasure to travel through. The fact that you can teleport instantly to many of the game's key locations via a special item also helps a great deal. Shadow Man 2econd Coming has a very cool look to it. This is not to say that its technical production is especially jaw-dropping; rather, it's more accurate to say that its developers were well aware of the PS2's graphical limitations and worked around them very well. The character models are perhaps the most significant element in the graphical production, and Shadow Man himself is easily the standout of the bunch. His hollow eyes constantly fume with unholy energy, and his body is an odd and colorful mixture of jagged bone, sinew, and flesh that's awesomely detailed and superbly animated. Most of the major characters look almost as good, as well as some of the more imposing enemies. Impressive graphical effects abound; when you swing your weapons, a stylized tracer will follow its path in the air, and when Mike makes the transformation to Shadow Man (and vice versa), netherworld energy will crackle all around them. Many of the voodoo weapons have amazing effects as well; their outputs often look and feel as deadly as their manual's text purports them to be, which makes using them quite a pleasure. The environments, finally, are all quite well designed, and, given the tangible gloom that's present in the game (as a sort of GTA3-like ~noise~ effect), each one seems even more a part of its world. The texture quality is often suspect, to be sure, but the developers seem to have done a good job of diverting attention from them in many ways. The aural production is also quite impressive; the voice acting, in most cases, is simply superb, and the music is both atmospheric and rousing when it needs to be. So what's wrong with Shadow Man 2econd Coming? Well, aside from the kinks related to combat and level layout, the game's control feels a little bit loose when you're simply running around. You'll often find yourself edging toward the corners of tunnels when your sole intent was to continue forward, and, in cases when you're walking on precarious surfaces, this can get quite annoying. Further, the game's frame rate has a tendency to stutter a bit more often than we'd have liked. Though it's often locked in the neighborhood of 30fps, several things can cause it to drop dramatically, which is quite a shame. Despite its flaws, Shadow Man 2econd Coming will likely manage to draw you in, especially if you can get into the creepy aesthetics and earnestly engaging story. It gets pretty heavy and biblical rather quickly, but it's definitely several cuts above the typical video game narrative in terms of character development and thematic depth. There's also quite a bit of gore and several four-letter words spread throughout, so kiddies beware. So overall, if you were the least bit interested in the original Shadow Man, or if you're simply interested in checking out a mostly slick adventure that's perhaps a little rough around the edges, Shadow Man 2econd Coming might just be for you."}