{"ref": "https://www.gamespot.com/reviews/asemblance-review/1900-6416469/", "date": "July 7, 2016", "game_name": "Asemblance", "text": "From the interactive virtual art of Linger in Shadows to the more recent Everybodys Gone to Rapture, there have been some touching narrative-focused games released in recent memory. Asemblance follows in Rapture's footsteps, creating an interactive short story for players to experience without concern for taxing challenges; observation is the key.Waking up to the sounds of a blaring alarm and an AI voice telling you theres been an emergency, Asemblance shifts into a series of vignettes based on your character's memories. Youre a scientist trying to move through virtual reproductions of recorded events to discover the secret of a terrible trauma. Its a great set-up for a game that skirts the lines between science fiction, horror, and relationship drama.Environments have a wistful, almost retro look, but the era isn't clearly defined: there are flat screen TVs, old computer monitors, rotary dial phones, and even a reel-to-reel tape recorder to be found. Given that youre told by the omniscient AI that memories are inherently unreliable (and possibly outright false), this mix of technology adds to the moody, mysterious atmosphere. Likewise, the sound design mixes with shifting lights and colors that inspire distressing murmurs in the back of your mind.Unfortunately, any initial tension too quickly ends up in frustration and exasperation. Asemblance has huge narrative and flow problems. Finishing the game is a subjective concept--you can reach several different endings fairly easily and all of them are unsatisfying. Its not the dark subject matter of love, loss, and regret thats the problem. Its how the game fails to tell its story in any coherent way.Much of the time in Asemblance is spent combing every inch of each location to find something to read, see, or interact with. Interacting is done in one of three ways--pressing the X button, using the R2 button to zoom in on something, or simply walking up to something. Its vaguely reminiscent of old point-and-click-adventure games or hidden object games. After a while, youll be combing the same few areas over and over just to find something--anything--you might have missed to get the plot moving again. There are only a handful of events to witness and it becomes frustrating after a while to try uncovering something substantive.Thats unfortunate, because there are engaging, interesting, and even beautiful moments to behold. The sequence that feels ripped straight out of a Japanese horror film promises something dark and scary is coming. The forest path memory is a dreamy, wistful place with blooming flowers and fluttering butterflies. The use of jarring static to signify a glitch in the simulation is an effective trick as well.You don't feel connected to these memories as a result and instead feel like an interloper breaking into lives you know almost nothing about.Asemblance has the structure of a short, potentially fascinating interactive story, but the general lack of narration or direction doesn't work in its favor. For the most part, uncovering the events leading to the games present is done purely in the mind of the player. Zooming in on office desks to read memos, seeing a brochure in your apartment, or browsing intimate family photos. Outside of a few direct actions, the game seldom lets you know if anything you do is actually meaningful. You don't feel connected to these memories as a result and instead feel like an interloper breaking into lives you know almost nothing about.By the end of Asemblance, you're left with educated guesses based on hours of wandering through its few locations. Developer Nilo Studios says it wants this to be the start of a series of experiences reminiscent of the X-Files or the Twilight Zone. Unfortunately, theres so little pay off in Asemblance that its difficult to muster much excitement for its future."}