{"ref": "https://www.gamespot.com/reviews/fight-night-round-3-review/1900-6144804/", "date": "February 23, 2006", "game_name": "Fight Night Round 3", "text": "EA Sports' boxing franchise makes its handheld debut with Fight Night Round 3 on the PSP. Rather than attempting to cram a full port of the PlayStation 2 version of the game onto the smaller format, EA Chicago has built an entirely different game, specific to the PSP. The incorporation of some of the better elements of the console versions of Round 2 and Round 3, along with the addition of some all-new features, makes the PSP version a competent boxing game that doesn't make too many sacrifices for the sake of portability. Unfortunately, the sacrifices that are made will be sorely obvious to fans of the series, and the resulting experience is somewhat disappointing. Now you can take the fight with you and pound faces wherever you go. The most glaring absence in Round 3 for the PSP is the dual-analog Total Punch Control configuration that the Fight Night series is known for. Instead, the PSP version of the game relies on the analog stick for moving your boxer around the ring, and the face buttons for throwing punches. It's a difficult setup to get used to because there are a lot more punches and moves than there are buttons on the PSP, and for Fight Night veterans it will definitely feel like a step backwards. There are four control configurations to choose from, but they offer only slight variations on the same basic concept. You move with the analog stick, block with the R button, and lean with the L button. Each direction on the D pad also has a function. You can press up to clinch, left to taunt, right to throw an illegal blow, and down to throw a signature punch. The tricky part is throwing the four main punches in the game. As in the console versions of the game, you have a jab, hook, uppercut, and haymaker. The problem is that each of those punches can be thrown to either side, for a total of eight different punches, not including variations between head and body shots. That means that the four face buttons on the PSP have a lot of work to do. Many of the more powerful punches, like uppercuts and haymakers, require you to press two or three buttons, which just isn't intuitive enough to be effective. While throwing punches one after the other can and often will win you a fight, you occasionally have to defend yourself as well. You can defend four areas of your body, upper and lower and left and right. The basic block is assigned to the R button, but if you want to parry punches or change the position of your guard, you have to hold R and use a combination of the face buttons on the PSP. The complex control scheme makes it difficult to respond quickly to incoming punches, and your defense suffers as a result. It's nice to have such a variety of punches and defensive moves at your disposal, but in practice it's much easier to just learn one or two punches and forget everything else. If you try to get fancy you'll just end up stumbling over the controls. Limiting yourself to one or two punches isn't much of a handicap for most of the single-player game, though. The artificial intelligence-controlled fighters tend to throw the same two or three punches, in the same sequence, throughout an entire fight. Once you get the pattern down, you can simply parry each punch and throw a right hook again and again. In a career fight we were able to knock out our opponent early in the fourth round. The punch totals for the fight showed a 70 percent hit rate with 362 punches thrown--and 354 of those punches were right hooks. That wasn't even an irregular fight. You can pound an opponent with the same punch round after round, and he'll just keep throwing the same combos and forgetting to block. Later in the game the opponents do get tough, but the increased difficulty is a result of more-powerful punches and increased damage resistance, rather than improved fighting strategy. However, if you manage to work through the initial awkwardness of the controls, you'll find that Round 3 on the PSP has a lot to offer in terms of play modes. There's the obligatory play-now mode, in which you pair up boxers like Oscar De La Hoya, Muhammad Ali, Bernard Hopkins, Jake LaMotta, and Joe Frazier and then jump right into a fight in one of several venues ranging from the Staples Center to the county fairgrounds. This Fight Night is a button masher, but the control setup is too complex for its own good. If you're looking to add a bit of context to the action in the ring, you can create a boxer and take him through a career. You can create a boxer from scratch, or re-create a boxing legend. You start out career mode in the amateur ranks, where you fight small-time opponents in small-time venues for real small-time money. After a few fights you can take a shot at the amateur title and then turn professional. Unlike the console versions of Round 3, the PSP version features a structured ranking system. You start out as the 50th-ranked boxer in your class and you slowly inch closer and closer to the coveted number one spot as you win fights. In addition to ranked fights, you can also fight exhibition matches to earn extra cash and train your boxer. The basic flow of career mode breaks down like this: You sign a contract, hire a trainer and cutman, train your boxer, design your ring entrance, and finally, fight. There are no training minigames in this version of the game; instead, you simply choose one of three intensity levels and your fighter trains automatically. If you choose the most intense level of training you can get a greater stat benefit, but you also run the risk of injuring your boxer and actually decreasing his stats. The benefit you get from training is also dependent on your trainer, and there are plenty of different trainers with different specialties that you can choose from. The best trainers don't come cheap, though, and in addition to the up-front cost, they'll take a cut of your winnings while they work for you. You can also choose from several cutmen to assist you in the ring. Between rounds you can play the same minigame from Fight Night Round 2 where you choose one of four areas on your fighter's face and work on swelling and cuts. By keeping swelling to a minimum your fighter will be able to see--and defend against--incoming blows. Cuts are even more important to attend to, because a ref will often stop a fight if your boxer is bleeding profusely. There are no training minigames here, but it's really no big loss. In addition to increasing your boxer's abilities by training, you can purchase various items and services that will provide specific stat boosts. Before each match you can purchase intro music, special effects such as fireworks, and an entourage in the form of bikini-clad women. Each of these items boosts one of your stats, and the more expensive items have greater benefits. Music will increase your heart rating, special effects will allow you to get up from what should be a knockout, and the girls increase your stamina. You can also purchase trunks, shoes, gloves, foul protectors, and mouth guards, each of which provide stat increases. Unique to the PSP version of the game is a Rival Challenges mode. Similar to the ESPN Classic fights in the console versions of Round 3, this mode lets you re-create some of the most famous fights in recent boxing history. You are awarded one of three medals and a cash prize depending on the outcome of the fight. In the Ali vs. Frazier fight, for example, if you play as Ali and manage to KO Frazier, you'll earn a gold medal. You don't fight the entirety of each fight, though. Instead, you pick up the fight from a critical point in the match and attempt to change the way it ends. There's also a My History mode where you can learn a legend's style and try to overcome it. Again, you're rewarded medals and money for meeting certain goals. Joe Frazier was known for throwing a lot of punches, so you have to avoid his punches and keep him below a given hit percentage to earn a medal. Sugar Ray Leonard liked to taunt his opponents, so you have to hit him while he's taunting as many times as possible in a fight. The challenges are interesting and they offer a nice change of pace from the standard bouts. The money you earn by completing challenges can be spent to outfit your fighter in career mode, which is handy. Round 3 also features online and ad hoc multiplayer modes. To play online you need an EA Online account, so you either have to pay $2 or put up with some ESPN e-mails. There's really no reason to pay because there's nothing to stop you from providing a fake e-mail address. Once you get online you'll find plenty of stat-tracking and match options, just as in the console versions of the game. The online play is unfortunately extremely laggy. One round might move along smoothly, while another will be interrupted every few seconds as the game momentarily freezes. When it does run smoothly the online play is great, so hopefully the lag issues will be addressed quickly. The game looks great and runs smoothly on the PSP. The fighter models all look accurate, and even though the create-a-champ mode isn't nearly as in-depth as on the console versions of the game, you're still given plenty of options when building your boxer. More importantly, the slow-motion replays of boxers getting their faces crushed look as brutal and satisfying as ever. The blood streams freely from eyes, noses, and mouths as boxers take a beating, and the swelling and discoloration of the fighters' faces is particularly grotesque. The venues display plenty of variety and they all look great and provide fine backdrops for boxing matches. The brutally entertaining knockout replays look great on the PSP. The sound is taken directly from the console versions of Fight Night Round 3. The same hip-hop tunes play on all the menu screens, and they recycle frequently. The punch noises lack some impact on the PSP, but they still sound good. Joe Tessitore provides the commentary, which is intelligent at times, but is often redundant. It fills the need for chatter, though, and occasionally the commentary is actually a helpful indicator of how you're doing in the fight. You'll also hear some encouraging words from your trainers, but the voices are completely wooden, and they rarely have anything helpful to say. If you take the time to get a handle on its complex controls, Fight Night Round 3 on the PSP has enough options and game modes to keep you coming back for more. Unfortunately, if you've played any other Fight Night games, you might have a hard time settling for less-than-perfect control. Still, it's a decent choice if you're looking for a boxing game on the PSP--and not just because it's the only choice. There are no training minigames in this version of the game; instead, you simply choose one of three intensity levels and your fighter trains automatically. If you choose the most intense level of training you can get a greater stat benefit, but you also run the risk of injuring your boxer and actually decreasing his stats. The benefit you get from training is also dependent on your trainer, and there are plenty of different trainers with different specialties that you can choose from. The best trainers don't come cheap, though, and in addition to the up-front cost, they'll take a cut of your winnings while they work for you. You can also choose from several cutmen to assist you in the ring. Between rounds you can play the same minigame from Fight Night Round 2 where you choose one of four areas on your fighter's face and work on swelling and cuts. By keeping swelling to a minimum your fighter will be able to see--and defend against--incoming blows. Cuts are even more important to attend to, because a ref will often stop a fight if your boxer is bleeding profusely. There are no training minigames here, but it's really no big loss. In addition to increasing your boxer's abilities by training, you can purchase various items and services that will provide specific stat boosts. Before each match you can purchase intro music, special effects such as fireworks, and an entourage in the form of bikini-clad women. Each of these items boosts one of your stats, and the more expensive items have greater benefits. Music will increase your heart rating, special effects will allow you to get up from what should be a knockout, and the girls increase your stamina. You can also purchase trunks, shoes, gloves, foul protectors, and mouth guards, each of which provide stat increases. Unique to the PSP version of the game is a Rival Challenges mode. Similar to the ESPN Classic fights in the console versions of Round 3, this mode lets you re-create some of the most famous fights in recent boxing history. You are awarded one of three medals and a cash prize depending on the outcome of the fight. In the Ali vs. Frazier fight, for example, if you play as Ali and manage to KO Frazier, you'll earn a gold medal. You don't fight the entirety of each fight, though. Instead, you pick up the fight from a critical point in the match and attempt to change the way it ends. There's also a My History mode where you can learn a legend's style and try to overcome it. Again, you're rewarded medals and money for meeting certain goals. Joe Frazier was known for throwing a lot of punches, so you have to avoid his punches and keep him below a given hit percentage to earn a medal. Sugar Ray Leonard liked to taunt his opponents, so you have to hit him while he's taunting as many times as possible in a fight. The challenges are interesting and they offer a nice change of pace from the standard bouts. The money you earn by completing challenges can be spent to outfit your fighter in career mode, which is handy. Round 3 also features online and ad hoc multiplayer modes. To play online you need an EA Online account, so you either have to pay $2 or put up with some ESPN e-mails. There's really no reason to pay because there's nothing to stop you from providing a fake e-mail address. Once you get online you'll find plenty of stat-tracking and match options, just as in the console versions of the game. The online play is unfortunately extremely laggy. One round might move along smoothly, while another will be interrupted every few seconds as the game momentarily freezes. When it does run smoothly the online play is great, so hopefully the lag issues will be addressed quickly. The game looks great and runs smoothly on the PSP. The fighter models all look accurate, and even though the create-a-champ mode isn't nearly as in-depth as on the console versions of the game, you're still given plenty of options when building your boxer. More importantly, the slow-motion replays of boxers getting their faces crushed look as brutal and satisfying as ever. The blood streams freely from eyes, noses, and mouths as boxers take a beating, and the swelling and discoloration of the fighters' faces is particularly grotesque. The venues display plenty of variety and they all look great and provide fine backdrops for boxing matches. The brutally entertaining knockout replays look great on the PSP. The sound is taken directly from the console versions of Fight Night Round 3. The same hip-hop tunes play on all the menu screens, and they recycle frequently. The punch noises lack some impact on the PSP, but they still sound good. Joe Tessitore provides the commentary, which is intelligent at times, but is often redundant. It fills the need for chatter, though, and occasionally the commentary is actually a helpful indicator of how you're doing in the fight. You'll also hear some encouraging words from your trainers, but the voices are completely wooden, and they rarely have anything helpful to say. If you take the time to get a handle on its complex controls, Fight Night Round 3 on the PSP has enough options and game modes to keep you coming back for more. Unfortunately, if you've played any other Fight Night games, you might have a hard time settling for less-than-perfect control. Still, it's a decent choice if you're looking for a boxing game on the PSP--and not just because it's the only choice."}