{"ref": "https://www.gamespot.com/reviews/harry-potter-and-the-goblet-of-fire-review/1900-6140472/", "date": "November 28, 2005", "game_name": "Harry Potter and the Goblet of Fire", "text": "The magic of J.K. Rowling's universe makes its way once again onto the Game Boy Advance and Nintendo DS portable platforms, this time with Harry Potter and the Goblet of Fire. Like the console and PSP versions of the game, The Goblet of Fire on the DS and GBA follows the trio of Harry, Ron, and Hermione as they quest through a plotline that's similar to the one used in the book and film. Unfortunately, this adaptation of the adventure doesn't quite measure up to what you'd expect from a Harry Potter product. The Goblet of Fire video game follows the adventures of Harry, Ron, and Hermione. The GBA and DS versions of The Goblet of Fire are the same for the most part, with a few minor differences. Both games are played primarily from an overhead view, using a 2D action adventure engine. You'll explore a number of different areas from the book, including the Quidditch Cup campsite, the Forbidden Forest, Hogwarts school, the three Triwizard cup challenges described in the book, and more. Each area consists of a large, mazelike map that has simple environmental puzzles to solve. You'll need to use spells, such as the wingardium leviosa spell to lift obstacles out of pathways or to move platforms into place so you can climb to higher locations. You'll also use charms, such as the reparo charm to fix broken treasure chests for looting or the aqua eructo charm to put out flames. Some obstacles will require the simultaneous spellcasting of all three characters to lift heavier objects or put out larger flames, for example. The artificial intelligence in the game is generally smart enough to help you when needed, but you can always tap the left shoulder button to manually nudge the computer-controlled characters into following or assisting you. If you're playing the game in three-player cooperative mode, you and your buddies will need to work together. As you work your way through the levels, you'll pick up special collector's cards, beans that can be used to unlock cards, and Triwizard shields. The levels are surprisingly large in scale, but unfortunately they end up feeling like repetitive filler rather than compelling content. The types of environmental puzzles you face are limited, so when you do the same task for the umpteenth time to open yet another blocked pathway, it tends to be more tedious than satisfying. Opening new levels and discovering new spells does introduce some different gameplay principles, but this often requires you to go back to previous levels and go down pathways that were previously impassable to you. Various creatures will also fight you along the way. Burrowing dugbogs, vicious bowtruckles, and flaming fire salamanders are a few of the monsters lying in your path. The game does a pretty good job of varying the manner in which you have to dispatch the creatures. Red caps, for example, must be lured to you by turning your back to them until they get close--then you can lift them into a cauldron to kill them before they hide back in a cabinet. The fire crabs, on the other hand, are vulnerable only when their shells are open. The DS version of the game differs somewhat from the GBA version in that some of these creature fights will switch to a first-person dueling mode in the DS version. In this mode, you and the creature take turns firing spells at each other. You can choose different types of attacks--one requires you to trace an outline of various shapes onscreen, while another requires you to quickly connect dots that appear onscreen. Functionally these attack spells don't differ much, so you'll probably end up relying only on the one that's easiest for you to do. The method of defending against the attacks of the different creatures in this mode differs depending on the monster and also relies on using the touchpad, but for the most part, these duels play out the same every time and are more time-consuming than they are compelling. This of course also makes the Dueling Club multiplayer minigame included in the DS version of the game less appealing than it sounds on paper. The Triwizard challenges offer some respite from the regular levels. As in the book, the first one has you running from a Hungarian horn-tail dragon on your broom. The second has you diving into the Black Lake to rescue Ron, while the third has you exploring the forbidding hedge maze outside Hogwarts. These challenges also form the backbone of the GBA version's multiplayer aspect, as does the Dance Dance Revolution-like Yule Ball level, where you must press buttons in sync with the music to make your character dance with the beat. The DS version's multiplayer consists of the Dueling Club minigame, which we described earlier, and the Care of Magical Creatures minigame, which is sort of a Nintendogs-lite minigame where you take care of a niffler. This game mode is also accessible in single-player and requires you to watch the body language of your niffler to determine whether it's hungry, bored, or dirty. A number of objects, like vegetables, a wash scrubber, and toys, reside on the bottom screen, so you just toss whichever one is necessary up to the niffler on the top screen of the DS using your stylus. The happiness of your niffler depends on how astute you are at figuring out its needs. You can't play with your niffler for long stretches though. It eventually gets bored with you after you figure out what it wants, and you have to come back to it sometime later. The DS version of the game also includes a half-dozen minigames that make use of the DS's touch screen. Most of these are pretty amusing although rather simple, and they're unlocked as you make your way through the game's single-player campaign. Chocolate Frogs has you stamping out the slippery treats with your stylus as they hop from the top screen to the bottom screen. Bean Sorting requires you to grab beans from the bottom screen and toss them into the correctly colored jar at the top screen. Unfortunately those adventures tend to get somewhat repetitive in this version of the game. As far as presentation goes, The Goblet of Fire looks like your typical Game Boy Advance action adventure game, with its tiled environments and its character models that are small and distinguishable mostly by their clothing. The spell effects offer some pizzazz, but overall the game looks pretty run-of-the-mill on a Game Boy and less impressive on a DS, which is capable of delivering better-looking graphics. Aside from the orchestral music score, which is pretty good and plays both in menu screens and during gameplay, the sound effects seem pretty sparse. The monsters make appropriately threatening noises, and the spell effects are decent, but there's little voice acting in the game, because most cutscenes are subtitled. In the end, The Goblet of Fire on the GBA and DS doesn't seem much better than any other action adventure game. The minigames in the DS version offer some amusing diversions, and the designs attempt to leverage the touch screen with some success. But the core campaign where you'll be spending most of your time seems like standard fare and gets repetitive after a while. Hardcore Potter fanatics may find some redeeming value in collecting all the cards and exploring the levels, but those of us who haven't submitted an application to the Hogwarts School of Wizardry and Witchcraft will probably find better action adventure options elsewhere."}