{"ref": "https://www.gamespot.com/reviews/dishonored-definitive-edition-review/1900-6416231/", "date": "September 2, 2015", "game_name": "Dishonored", "text": "There is nothing a player should relish more in Dishonored than the opportunity to stare down the barrel of a loaded gun. Facing the very real, very quick possibility of being shot opens up a vast, bloody rainbow of possibilities, and theres very little that the imagination can conceive of that Dishonored does not provide the tools to achieve. You could stop time, and simply step out of the way. Or even better, stop time, possess the shooter, and walk him into the path of his own bullet. You could stop the bullet itself, load it youre your own gun, and shoot back before your enemy reloads. You could teleport behind the enemy and shove a blade through his last meal. Or strap a bomb to his back before he even realizes the bullet missed.To don the mask of Corvo Attano--a master assassin--is to invite a freedom of ingenuity the likes of which, one console generation and an actual Thief reboot later, remains an elusive, rare thing. Dishonored is a game that felt ahead of the curve three years ago, and only just now feels right at home. That just barely excuses just how little work went into improving Corvos second go-around.There is certainly an argument to be made that Dishonored didnt really need anything new to get a re-release. To those who will be taking their first voyage into Dunwall, Dishonored will be a revelation. On paper, its little more than a simple revenge tale: The Empress of a far away, sea-faring, steampunk kingdom has been assassinated, and you, her royal protector, has been framed for the murder. While rotting in jail, you're visited by a Satanic figure called The Outsider. He gives you supernatural powers, which will help you exact vengeance and liberate Dunwall from the usurpers who rule in the Empress stead.The devil is in the details. This isnt just an Assassins Creed situation of moving to the proper vantage point to make a kill, escaping and awaiting further orders after the coast is clear. Every murder and every mercy affects the world, brings fear or hope to the populace, feast or famine, peace or disease. While it is possible to barge through Dunwall, slaying everything in your path with extreme prejudice, youll find the task at hand becoming a bleak ordeal. It becomes a story of desperate public servants shattering under the weight of an unyielding zombie plague with no cure, of a frightened populace that shrieks at the sight of your mask, where recovery is impossible, with a new pile of corpses replacing the twice-killed ones faster than they can be removed.The game values the nuanced touch far more, as should the player. A straight up, face-to-face kill is tense and gratifying, but the game reveals its true nature in the avoidance, in the trapping, in the justice of the environment. Why kill what an angry mob, abused subordinates, or a jilted lover will do for you? Much of Dishonored rides on its characters. Voiced by a surprisingly diverse cavalcade of character actors, they are well-written, well-motivated aristocrats and poor, with no middle-class to work more effectively against the powers that be. The main targets stand directly in opposition of that, prime examples of the worst aspects of humanity. They may deserve to die, but you can deliver something worse, or at least something more apt if youre listening to their victims, if youve been paying attention to your environment, if youre truly and thoroughly exploring your world.For less vital enemies, teleportation ability Blink is the bread and butter for all things here, allowing you to reach new heights, traverse chasms, and vanish from harms way in an instant, as well as reach the hidden power-ups scattered throughout the game. Where you go from there is all a matter of need. Tired of having to hide the bodies when another guard comes snooping? Buy a power that turns victims to ashes. Need to weasel your way through a crowd of guards? Buy an ability to possess people and animals, walk through the trouble in your enemys skin. Need a distraction? Summon a swarm of plague-infested rats, watch your enemies squirm. Or, even better, get creative, slap an explosive device onto a rat, possess the rat to guide him into a circle of foes, and set off the boom.Dishonored isnt quite an open world game, but the streets, alleyways, and decadent mansions are so dense with traversable nooks and paths the relative linearity of the stages is completely obscured. It also helps that there isnt a side mission in the entire game that doesnt serve a greater purpose rather than just to fill empty space. The focus, instead, is in making the world feel lived in, practical, and used. Unlike most steampunk, Dunwall doesnt feel sterile, like a brand new appliance that just happens to have people living in it, but like a real city that has seen life, death, crime and providence. The city runs on its whaling industry, and the evidence of how its affected life is virtually everywhere. These are all important lessons in world-building many a developer has yet to truly learn, making Dishonored look like even more of a step forward. Its a game with flaws, for sure. The final third of the game is rather bland and flavorless compared to all the little captivating touches that grace the rest. The DLC switches gears from Corvo to rival assassin Daud, and its a very different feel, though on average, its not necessarily better (though the trippy and introspective second episode, The Brigmore Witches, fares better than the rather procedural and dry Knife of Dunwall). Still, the main event is a marvel of unique, engrossing game design.The problem, of course, is that this is a marvel millions of players have taken in before, and there isnt much here to make them take it again besides sheer nostalgia. Think of the other games donning the moniker of Definitive. Tomb Raider got a nice graphical uptick, a bump to 60fps, and an enhanced character model for Lara Croft. DmC: Devil May Cry got textural improvements, a slew of new game modes and features. Dishonored has gotten an uptick in resolution, and all three DLC packs are included. The one next-gen only innovation is on PS4: the voice of the Heart, an item allowing you to not only find power-enhancing runes and charms, but hear the thoughts and sins of anyone you points it at, now comes through the DualShock 4s speaker. The distressing, intimate, and creepy musings from the device are an awesome and unnerving part of the experience. Its a wonderful tweak to an existing feature, and in no way does it make the game worth another $20-$40 for someone who already owns it. Theres even a strange trade-off that cancels out even that minor addition: Load times for the game have gotten abnormally long. I played the game off of a completely digital copy, and loading a save sometimes took close to a minute, which would be fine for an initial load, but insanity considering the game throws up a loading screen for just about any major transition in or out of a building, or when you respawn after death.What were left with here is the best console version of Dishonored that money can buy--and make no mistakes, that still makes this the best version of a fantastic gamebut as a re-release on systems far more capable than their predecessors, this is a perfunctory release that doesnt justify the price tag except out of sheer convenience. Theres no in between here; theres either every reason to pick up this version if you've never played Dishonored, or no reason whatsoever if you've donned Corvo's mask before."}