{"ref": "https://www.gamespot.com/reviews/space-station-silicon-valley-review/1900-2545199/", "date": "April 28, 2000", "game_name": "Space Station Silicon Valley", "text": "Space Station Silicon Valley was one of those long-promised N64 titles that earned a nod of recognition, with an expression of ~we'll see,~ and not much else throughout the early months of its development. But at the Electronic Entertainment Expo last May, the game reared its head seriously for the first time, and what we saw, we noted to keep an eye on. Now, months later, SSSV is out, and while it's unmistakably a late-blooming first-generation N64 game, its charm and straightforward, if simplistic, delivery make up for the graphics and relatively easy gameplay. The SSSV story goes something like this: You're Danger Dan, a freelance adventurer from way off in the future - about 3000 AD. Danger Dan and his android sidekick Evo are on assignment to save Silicon Valley, a ~technologically advanced amusement park,~ when Evo gets kidnapped. As Danger Dan, you must rescue him and safeguard Earth by keeping Silicon Valley from smashing into your home planet. How? Employ the animals you encounter in Silicon Valley. These creatures you ~use~ (I'll get to that later) collectively have more than 90 different skills to help you fight your battle and find your MIA android. The game consists of four different environments with about seven levels in each, and each level represents an individual mission, such as raise the bridge, grow some carrots, and turn off the electric fence, to more technical tasks such as finding key cards and using computers to complete various objectives. The game is not entirely linear in that you don't have to complete an entire environment to move on to the next. Actually, if you make it about halfway through one, the next level becomes available to you, so you can move back and forth between them until you complete all the levels, and ultimately, the game. Graphically, though, the game is really nothing special. It's truly first generation, with big, spacious environments and large, blocky, colorful objects. Fortunately, you have a close-up ~look~ feature (the Z trigger button) to help you navigate the trickier environments and spaces, and a camera that moves somewhat intelligently with you from your third-person behind-the-creature perspective, allowing you a limited degree of control with the C buttons. The camera is far from perfect, with the typical standing-under-a-ledge cutaways and close-quarters visual range problems, but it is manageable. What really makes SSSV work as it does, however, are the animals. You don't physically play the game as Dan; you are a microchip, remotely controlled by Dan, to take on the functions of the animals in the game. You ~plant~ yourself in animal cadavers to reanimate them, using each respective character's unique skills to get through your missions. Sound gross? Sorry, but it's not. If you start as a fox, for example, and you attack and kill the racing dog with your tail, he'll fall to the ground like a boneless mutt in a trance. No blood; no guts (although if you manage to nail him under the bone-crushing barnyard smashing device, his eyes will bulge out each time it slams down on him, postmortem, until you turn it off). You move from animal to animal by attacking one creature with another and then hopping into the dead one's body using the shoulder button. And with the dozens of animals available, each has a survival rate, strengths, weaknesses, buoyancy, a special attack, a special move, and an alter ego, which is pretty fun. The key to getting through the game is to effectively use the animals' traits to your benefit. For example the sheep can inflate themselves to float across platforms and such, and they swim quite well, but they don't exactly move very quickly. Whereas the fox moves extremely quickly but can't jump to save his life. These characteristics are integrated into the gameplay and puzzle solving quite well.For as many animals as the game includes, you don't have to be a genius to figure SSSV out, and the AI isn't brilliant, as the animals tend to become predictable. The missions and puzzles within each are extremely simple, or perhaps uncomplicated, with subtle clues sprinkled throughout each level to assist more novice gamers. Oftentimes, you'll see what you have to do very clearly and early on, so the real effort comes in actually executing your skills and maneuvering through the obstacles, such as timing your jump from platform to platform just right, and so on.Ultimately, SSSV is a simple, moderately short game, with extremely engaging ~personalities~ that hit the game character target right on the mark. The sheep moves like a sheep. The elephant moves like an elephant. The kangaroo punches, and the scorpion stings just as you'd expect they would. So while SSSV isn't a Super Mario 64 by far, it actually does accomplish what it set out to do - entertain, amuse, and charm - even if it doesn't challenge you very much."}