{"ref": "https://www.gamespot.com/reviews/assassins-creed-valhalla-dawn-of-ragnarok-review-having-a-good-time/1900-6417841/", "date": "March 9, 2022", "game_name": "Assassin's Creed Valhalla", "text": "Assassin's Creed has long experimented with its protagonists having magic-like abilities, oftentimes explored in post-launch expansions. Dawn of Ragnark is the latest, adding to Assassin's Creed Valhalla by pivoting from Eivor to delve into the story of Havi, the sir who is most well-known as Odin. Dawn of Ragnark doesn't quite reach the highs found in Assassin's Creed's previous myth- and legends-focused expansions, falling short in both delivering a compelling narrative and fully embracing its initial open-ended gameplay loop. However, Dawn of Ragnark does satisfyingly evolve Valhalla's combat and navigation via a rewarding assortment of cool mythical powers.In Dawn of Ragnark, Havi travels to Svartalfheim to save his son from Surtr, the flaming Isu warlord of Muspelheim. Surtr has invaded the land of the dwarves with an army composed of giants from both the icy Jtunheim and fiery Muspelheim for some unknown purpose. Though Havi has no interest in learning what that purpose is, he still finds himself aiding the besieged dwarves in order to gather the necessary support to save his son.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Assassin's Creed Valhalla - Dawn of Ragnark DLC ReviewThe campaign attempts to navigate the complexities of Havi's abusive nature. So far, we've only seen a self-proclaimed god who's so self-assured that he can't find fault in any of his actions, reasoning that the mistreatment of his allies is a necessary evil for bettering Asgard and ensuring his survival for all time, even through the events of Ragnark and his predetermined demise. Dawn of Ragnark sees Havi come face-to-face with this aspect of himself, and the Isu is regularly presented with examples of how the ends don't always justify the means. It's an intriguing hook, but not one that gets a satisfying pay-off. His story just sort of ends.Instead, the final moments of the expansion explore Eivor, positing that the Viking manages to learn a lesson that Havi could not. And that would be an interesting development if Valhalla's base campaign hadn't already concluded with a similar finale. So in the end, Dawn of Ragnark's story feels a lot like the ones told in Wrath of the Druids and The Siege of Paris in that it doesn't explore narrative concepts beyond what's already touched upon in Valhalla; it instead retreads old ground and feels a bit same-y as a result.In terms of gameplay, however, Dawn of Ragnark introduces several new ideas for Valhalla's formula, transforming how you're able to navigate its world and fight enemies within it.Early into his journey across Svartalfheim, Havi is gifted the Hugr Rip, a gauntlet that allows him to rip the hugr (the mind and emotions of a creature's soul) from dead enemies and animals and inherit their forms and abilities. This offers new avenues of navigation (absorbing the hugr of a raven allows Havi to transform into one and fly across the world, for example), as well as combat (a Jtun hugr can coat Havi's weapons in ice, allowing him to freeze enemies) and stealth (using the hugr of a Muspel can give Havi the appearance of a fiery giant, allowing him to walk among the natives of Muspelheim without arousing suspicion).Each of the powers supports one of Assassin's Creed's core tenants--parkour, combat, and social stealth--creating engaging opportunities to experiment with how Havi can tackle a problem. Havi plays a lot like Assassin's Creed Odyssey's Kassandra, incorporating a combination of standard movements and god-like powers--if you're willing to engage with both movesets and carefully consider how to use each to your advantage, you can tear through encampments with an enjoyable ease and a fulfilling display of strength.One of my favorite moments in Dawn of Ragnark saw me needing to sneak into and join a Muspel ceremony. Hidden in a nearby forest, I transformed into a raven and flew above the enemy camp, reverting back into Havi in midair to air assassinate a guard on a watchtower. With my bow, I quickly dispatched other guards standing at attention on nearby rooftops before leaping into a bale of hay and whistling to attract one of the guards on the ground. I assassinated him and pulled his body into the hay, absorbing his hugr and transforming into a Muspel, exiting the cart to walk through a lake of lava damage-free and enter the ceremony, with no one the wiser. It felt incredible.Havi can only hold onto two hugr at a time and each ability needs to be charged before it can be used, encouraging you to be strategic in both what you choose to have access to and when you decide to utilize it. This additional consideration can lead to moments of rewarding adaptation--like my prior example, where I went into an enemy camp without the hugr of a Muspel on tap and had to incorporate my acquisition of it into my infiltration plan--but it too easily limits the experience. It's annoying to get to points in the story where you need a certain power to proceed, but you don't have it equipped, forcing you to backtrack and find an enemy with the hugr you need. It fortunately doesn't happen too often, but it occurs just enough to be noticeably irritating.The Hugr Rip isn't the only big change that Dawn of Ragnark implements. The expansion opts for a more open-ended approach to exploration in comparison to previous Assassin's Creed games. After a prologue, Havi emerges from a cave to find himself atop a cliff, presenting the player with a breathtaking view of the towering mountains, green valleys, and rolling hills of Svartalfheim. The game provides no waypoint at this moment, only loose directions to find a way to save Baldr and, if time allows, discover the hidden hideaways of the dwarves and aid them in their fight against Sutr--the hideouts of the Svartalfheim natives can be found by looking at the topography of the game's map and then following environmental clues.That moment emulates a scene that's become increasingly familiar in games in the years following the release of 2017's The Legend of Zelda: Breath of the Wild. Dawn of Ragnark does initially embody those clear inspirations, kicking off with a hands-off open world structure. You do get waypoints for your next mission once you discover a new narrative thread, but completing that thread leaves you once again devoid of any waypoint to chase after. And so in Dawn of Ragnark's early hours, progression is solely tied to your freedom to explore and discover--a first for an Assassin's Creed game. It's refreshingly novel for the series, and there are a few interesting things to find in those early hours to keep you excited as to what may hide beyond the next hill.However, Dawn of Ragnark reverts to Assassin's Creed's traditional structure about midway through. Once the story gets going, the expansion starts regularly supplying you with waypoints, including to locations you may not have had the pleasure of discovering on your own yet. This keeps the story of the campaign moving at a nice, brisk pace, but it undermines the sense of wonder and exploration the expansion cultivates in its early hours. And once that happens, Svartalfheim becomes a place of interconnected destinations, not a space to explore.By the time I finished Dawn of Ragnark, I was playing the game by climbing on my mount, telling it to follow the road to the next waypoint, and pulling out my phone to do a quick social media doomscroll while waiting for Havi to reach his destination on his own. That's a typical approach for getting around Valhalla, but a disappointing development given the initial promise of freedom that Dawn of Ragnark's early hours provided.Dawn of Ragnark is almost transformative for Assassin's Creed, teasing the possibility of what the series could become without the overt hand-holding that has defined it for almost two decades. However, after an intriguing opening, Dawn of Ragnark falls back on old habits, and that feeling--coupled with how the expansion's narrative themes feel too similar to the base game--creates an experience that too often resembles something you've already had once before. But Dawn of Ragnark is built on the bones of a great action-adventure RPG, and that carries much of the expansion, especially with the rewarding considerations introduced with the Hugr Rip. Only time will tell if Eivor and Havi's story continues beyond Dawn of Ragnark, but if this is the end, it's a fine-enough conclusion to the relationship between the two."}