{"ref": "https://www.gamespot.com/reviews/watch-dogs-bad-blood-review/1900-6415886/", "date": "August 5, 2015", "game_name": "Watch Dogs", "text": "Without Watch Dogs protagonist Aiden Pierce in the lead role, Watch Dogs: Bad Blood is less of an epilogue to the full game's story and more of an epilogue to the city of Chicago as a Watch Dogs setting. Aiden has long since vanished, shifting the focus to part-time collaborator T-Bone, who himself is working hard at his own disappearing act. He's more skilled than Aiden in the computer security infiltration arts, and he's almost as talented in combat as Aiden. Yet Bad Blood is the furthest thing from a collection of repurposed missions with a character reskin. It introduces a slew of new gameplay features that wouldn't feel out of place had these mechanics been introduced in the original game. That includes taking Watch Dogs' theme of surveillance to its natural next step: mounting guns on cameras.I appreciate that Bad Blood's premise is one involving the tying up of loose ends as opposed to the worn out one-last-job narrative at this story might have been. This DLC's three acts--strung together by 10 missions--effectively delve into one of T-Bone's many backstories. It's a history with significant baggage, tied to another familiar face: the affected Tobias Frewer. Tobias is crucial to Bad Blood, and his interactions with T-Bone reveal the depth of their shared past. Their sentimental conversations make for convincing exposition; the same can't be said of T-Bone's contrived thinking-out-loud narration when he's by himself. He sounds especially unnatural when he comments on radio reports that detail the aftermath of the events of the main game.Remember how Mission Impossible 2 wasn't so much a John Woo movie as it was a remixed greatest hits edition of John Woo's directorial trademarks? This came to mind as I considered Watch Dogs' mechanics as a collection of influences from other Ubisoft games. Whenever you make subtle pushing motions to negotiate past a crowd, think Assassin's Creed. Tailing targets? Also Assassin's Creed. Marking enemies? Splinter Cell. Taking over enemy-controlled territory? Far Cry. The frequent and obvious borrowing isn't necessarily a bad thing: it's sensible for projects and same-publisher studios to share design ideas, especially when they work as well as they do in Watch Dogs.Bad Blood ups the ante with a pimped-out remote-controlled car heavily inspired by the drones in Ghost Recon: Future Soldier. As T-Bone's sidekick and mechanical pet, the RC is a handy scout that can access ventilation ducts, and acts as T-Bone's eyes for discrete hacking opportunities. The car fits his known penchant for do-it-yourself gadgetry, right down to the RC's electric stun ability. It's an amusing, inventive toy that isn't intended to make up for T-Bone's shortcomings, because he doesn't have any (aside from his inability to fit in a vent). In fact, T-Bone is essentially a reskin of Aiden Pierce, except that the latter wields a retractable baton, while the former prefers a taser. Given Bad Blood's modest length, it's fitting that T-Bone's skill tree be limited, though T-Bone still has access to essential talents pertaining to crafting and firearms use.Aiden Pierce's steady hand and supernatural focus made the majority of Watch Dogs curiously easy. Given how T-Bone is endowed with similar time-bending talents, it is a welcome change to find some difficult combat challenges in Blood Bad's third and final act. I can't remember the last time I died this often but didn't suffer aggravation--probably because dying led to more time messing with the game's delightful gun-mounted cameras.Just as Watch Dogs and Bad Blood feature an amalgamation of Ubisoft game designs, this add-on is also an unsurprising compilation of mission types taken from the full game. These includes tailing, chasing, hacking, infiltrating, and escaping--familiar Watch Dogs objectives that occasionally feel different due to minor gameplay tweaks made to Bad Blood (e.g. T-Bone's RC). Hacking is given an augmented reality twist; the Watch Dogs minigame of digital pipe-routing can at times be found superimposed in the physical space. It's a new method of visual hacking that befits the Watch Dogs universe, and I'm betting that it will make a return in the inevitable sequel. Yet as much as Bad Blood makes use of many unexplored blocks and buildings in Chicago, it's puzzling that this DLC reuses at least one area featured prominently in the full game, when so many others would have minimized the sense of repetition. Lastly, the ability to lock enemies in rooms offers a new non-lethal way minimize potential hostilities. It's one of those seemingly sensible and obvious ideas that the main game lacked, and provoked the same ~Why didn't we have this before?~ feeling The Last of Us: Left Behind did when we finally saw hostile humans being attacked by the infected.After playing as the morally confused and inconsistent Aiden Pierce, it was easy to jump at the opportunity to play as any other member of Watch Dogs' ensemble cast, and I would not be opposed to another installment from the dark comedic perspective of fixer Jordi Chin. Bad Blood introduces new mechanics that fit snugly within an already fully-featured world. It's these qualities that make Bad Blood an essential purchase for Watch Dogs fans."}