{"ref": "https://www.gamespot.com/reviews/new-pokemon-snap-review-nintendo-switch/1900-6417668/", "date": "April 28, 2021", "game_name": "New Pokemon Snap", "text": "The Nintendo 64's Pokemon Snap has held a special place in my heart for over 20 years, partially because there's nothing else quite like it in the Pokemon franchise. Pokemon Snap has nothing to do with catching or battling with Pokemon, and humans aren't at the heart of its story. Instead, Snap has always been about the joy of discovery and uncovering the secrets of the Pokemon world without interfering with it. Its long-lasting charm has stemmed in part from emulating one of the greatest joys of photography: witnessing and capturing moments it felt like you weren't supposed to see, like a group of Charmander performing a synchronized dance inside a volcano. 20 years later, that same charm and mystique is present in New Pokemon Snap on Nintendo Switch. With even more courses and Pokemon to discover, New Pokemon Snap is a brand-new adventure that's absolutely delightful to embark on, incorporating newer generations of Pokemon and stunning environments that feel truly alive.Like the first game, New Pokemon Snap opens with you, a budding photographer, joining up with a Pokemon professor to snap some photos for his research. The mystery at the heart of the game is quickly introduced--Professor Mirror is investigating a strange Illumina phenomenon that's causing some Pokemon in the Lental region to glow, and you're here to catch it in action and discover its source. This sets up an overarching story--something that wasn't present in the first game--that slowly unfolds as you explore each island. The story itself isn't particularly deep and feels somewhat half-baked, but having the narrative reasons for continuing to explore each island does help progression feel natural and well-paced. Charming voice-acted cutscenes with Professor Mirror and the research team help draw you in and add to the overall presentation.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: New Pokmon Snap Video ReviewWhat you're really here for, though, are the new courses, which you explore in a pod-like vehicle known as the NEO-ONE. These take you through all sorts of natural Pokemon environments, from thick jungles to vast deserts and underwater caverns. Though some of them are thematically similar to courses that were present in the 1999 game, such as the beach level, New Pokemon Snap also takes you to brand-new environments. These feature a mix of Pokemon from all eight generations existing in their natural habitats. Each environment is full of life, with something happening in nearly every direction you look--it's almost a sensory overload the first time you load up a course. The thrill of discovery is still at the heart of its gameplay--that incredible feeling of spotting your favorite Pokemon out of the blue and snapping about 20 quickfire shots of it that all turn out terrible because you were just so excited and weren't ready for it. Whether you're photographing a Pokemon that burst out in front of you or zooming in to take a shot of one that's hidden in the distance, the sense of wonder and constant anticipation of what you'll see next in New Pokemon Snap is exhilarating.Like its predecessor, New Pokemon Snap is very much a game that revolves around capturing special moments, and making those happen is the game's core challenge. Though you initially start out with just your camera, you soon receive items from Professor Mirror that allow you to get a Pokemon's attention and evoke reactions from them, including Fluffruit (i.e. apples) that some Pokemon will eat, a flute for playing music, and Illumina orbs that can be thrown at a Pokemon or special flowers to make them glow. These tools are key to drawing Pokemon closer and triggering special reactions or poses that will give you better photos to show the professor. However, a constant level of experimentation is required, as each Pokemon will react to your actions differently. While Pikachu will run over for some Fluffruit, for example, there are certain Pokemon that turn their nose up at it. With a bit of planning, you can also trigger interactions between Pokemon, like creating a path of Fluffruits to reunite a Deerling with a Sawsbuck, or causing a fight to break out between Pinsir and Heracross. These memorable moments were hands-down my favorite to witness. As a result, you're motivated to keep using your items on Pokemon in new ways, and that trial-and-error approach keeps things fresh and interesting.Nighttime courses are a dynamic addition to the series in New Pokemon Snap. Not every course has separate times of day for exploration, but many of them do, which effectively expands the number of Pokemon and types of encounters you can find. Though each day and night course is on the exact same track, they feel distinctly different--during the day, the bustling jungle is alive with activity and sounds of Pokemon cries, while at night it's quiet, calm, and peaceful, with sights of Pokemon slumbering as you travel by. Nocturnal Pokemon come out to eat and play during this time--that Hoothoot curled up in the hollow of a tree during the day is wide awake when you return in the evening, for instance. These offer brand-new encounters for you to photograph while also giving you a fuller experience of each Pokemon ecosystem by letting you see what happens when the sun goes down.Whether you're photographing a Pokemon that burst out in front of you or zooming in to take a shot of one that's hidden in the distance, the sense of wonder and constant anticipation of what you'll see next in New Pokemon Snap is exhilarating.Of course, you're here to do a job as well--when you return from your excursions, Professor Mirror is waiting to score your photos. Each photo is scored on a scale of one to four stars, with criteria including a Pokemon's pose, size, the direction it's facing, other Pokemon in the photo, and more. Your long-term goal is to complete your ~Photodex~ by recording a photo of every Pokemon at each of the four star levels. Though what determines a good photo might seem fairly intuitive--you want to be able to see the Pokemon clearly, ideally facing your direction--the criteria can get a bit murky as you aim for photos with higher stars. The emphasis seems to be on behavior more than anything else--if a Pokemon is dancing or laughing, for instance--so a photo where a Pokemon further away is performing that action might rank better than a photo where the Pokemon is close-up but not engaging in special behavior. This can result in your Photodex having photos that you might not personally classify as ~good.~ I've had four-star photos where the Pokemon was barely in the shot simply because the camera registered it as performing a certain action in the photo, and while I was happy to file it away in my Photodex to fill that star requirement, it wasn't a photo I felt particularly proud of.That feeling is countered by the ability to save photos to your personal album, however, and this endeavor is where I felt particularly fulfilled in my efforts. After each scoring session with Professor Mirror, you're given the opportunity to go through and save any of the photos you've taken in your personal album. In this stage, you can re-snap the photo of a given moment--so if a Pokemon is half out of the frame, you can reposition the crop so that the entire Pokemon is in frame and visible. Other modern photo-editing features are available as well, letting you brighten or darken the image, add a filter, adjust the focus, and add a caption. This lets you build up an album of photos that have your personal touch on them, and it becomes a much more satisfying reflection of your excursions and discoveries. While filling out Photodex entries is driven by Professor Mirror's criteria (even though you can select which photo you want to use at each star level), the ability to edit and save personal photos allows space for creative expression. There's something especially satisfying about crafting a personal album of photos that's reflective of your own style and tastes--your own mini Poke-Instagram, if you will.And that's the core gameplay loop, just as it's always been: Venture out, take photos, then come back and have them scored by the professor. While repetitive in its structure, New Pokemon Snap is never boring, keeping its replayability high with courses that change over time. The more you visit a particular course, the more likely you are to see new Pokemon appear and opportunities for a new encounter, which keeps the experience exciting throughout. Each course can be leveled up three times with points that you earn from photos snapped there, providing a driving reason for you to keep revisiting the area and taking higher-quality photos. This keeps the sense of discovery alive--you may think you know a course down pat, and then you'll see a brand-new Pokemon come out of nowhere to surprise you.This is a big part of the post-game for New Pokemon Snap, as you likely won't have maxed out every course before seeing the story ending of the game. Even after credits roll, there will likely be plenty of Pokemon you haven't discovered yet, and there are some particularly exciting ones that made me gasp out loud--let's just say it's worth it to explore each course to its fullest. Longtime fans will be delighted by some fun throwbacks and references to the original game as well.A new feature known as ~requests~ assists with this ongoing discovery in a major way. Requests are basically little hints the research team gives you for discovering new Pokemon or behaviors on a given course--these range from vague observations to fairly specific directions that will cause something interesting to happen with a Pokemon or between a few of them. I largely ignored these for my initial playthrough, as I wanted to discover as much as I could on my own--and the game definitely enables you to do that. The requests aren't forced on you, and you're given very little direction at all as you explore an environment, save for a scanning feature that can prompt you to observe certain details or discover a new route through an area. However, it became apparent that requests are incredibly useful in the late game as you focus on maxing out each course and taking four-star photos of every Pokemon. Some of the encounters you can trigger are highly specific and not something you might discover on your own, so requests are a helpful tool in ensuring everyone is able to experience these moments for themselves. They also provide clearer goals for subsequent visits to a course, which could otherwise become frustratingly repetitive (a late-game ability to increase the speed of your pod vehicle makes these repeat visits easier as well). Unlike an initial visit to a course, when you're snapping photos at everything that moves, later visits may have you focusing on a few specific Pokemon so that you can capture a special behavior mentioned in a request. Requests ultimately help you achieve those four-star photos and experience some of the game's best moments. Though requests help you discover cool moments and snap high-star photos, signposting isn't as adequate when it comes to story progression. While you'll usually unlock what's needed to progress in the story naturally as you experiment with items and perform subsequent runs through a course, the game doesn't explicitly tell you what's needed to proceed to the next island. There's at least one situation where, in order to discover a new route, you have to perform a specific action on a Pokemon near the beginning of a course. Hints around this action are extremely vague, which can lead to general confusion about what you have to do to proceed. The existence of requests early on can mislead as well, as you may assume they're required for story progression when they're really intended to help you fill your Photodex. So it's easy to get caught up doing requests thinking you will eventually unlock a new route, when the game is actually expecting you to perform specific actions within a level that will reveal the path forward. Though I generally appreciated that New Pokemon Snap doesn't hold your hand and expects you to experiment and discover things for yourself, tying vague requirements to story progression can cause a frustrating stall for those trying to move forward.Fans clamored for a Pokemon Snap remake for years, and with New Pokemon Snap, we've gotten even more than we bargained for: a great sequel that pulls from all eight generations of Pokemon released so far, dynamic courses that can be explored during both daytime and nighttime, and the ability to create an album of edited, personalized Pokemon photos (which you can then print or post online, a fitting evolution of the game in the social media era). Though there's sometimes a disparity between photos that make it into your Photodex and the ones you like the most, the core motivation of catching a Pokemon doing something particularly cool remains the driving force and the satisfying draw of New Pokemon Snap. 20 years later, taking photos of Pokemon in the wild remains as fun and exhilarating as it always was, and though it's been a long time coming, New Pokemon Snap was worth the wait."}