{"ref": "https://www.gamespot.com/reviews/popeye-rush-for-spinach-review/1900-6126531/", "date": "May 17, 2006", "game_name": "Popeye: Rush for Spinach", "text": "Popeye: Rush for Spinach is an unsuccessful attempt to combine two disparate genres--racing and platforming--together into a single game. The graphics are slick enough, to the point that some people may be lulled into buying the game for themselves or their kids just from looking at the back of the box, but beyond that aspect, this game is an absolute disappointment. The graphics are sharp, but the game isn't any fun. The easiest way to describe Rush for Spinach is to say that it's a side-scrolling platformer that has been transformed into a racing game. After deciding whether to play as Popeye, Olive Oyl, Wimpy, or Bluto, you're tossed into a level that's not unlike the levels you'd find in a Mario or Sonic game. You have to work your way back and forth to locate the end of the level and deal with obstacles such as spike pits and switches along the way. The difference here is that there are also three other characters on your tail trying to do the same thing. So now, in addition to just finishing the level, you have to finish first to move on to the next one. Power-up items, such as spinach and curses, can give you a boost of speed or slow down your nearest opponent. The chicken curse is particularly amusing. It transforms one of your opponents into a chicken. There are also vehicle-type items, such as pogo sticks, cars, boats, and magical capes, that can help you move faster or bypass hazards more easily. It all sounds good in theory, but the combination of the genres just doesn't work here. The side-scrolling viewpoint is too cramped to give you a good view of the level. You can see only whatever is half a screen in front of or behind your character at any given moment, which often leads to nasty surprises. This also gives the CPU an unfair advantage right out of the gate, because it already knows where all of the traps and pitfalls are. The game's platforming aspects, meanwhile, are hampered by what its racing aspects bring to the table. CPU opponents are constantly on your tail, which means you never really get a chance to explore levels or scout ahead for traps. The game's platforming aspects are also woefully underdeveloped. Only a couple of the game's 12 levels require any backtracking at all. Most levels are just long stretches filled with surprise traps that ensure you'll need to attempt each race multiple times before developing the rote memorization necessary to win it. Occasionally, you'll come across a ramp that leads to a shortcut, or you'll smack into a door that will require you to backtrack and activate a switch to open it, but these clever features are rare compared to the constant litany of spike pits and lava pools. Interactions with your opponents are also fairly limited. Besides a grab move, which works only if an opponent is right in front of you, the only way to slow your opponents down is to activate power-up items. That's nice, but they target only the nearest opponent, and the effects are extremely short-lived. It's really too bad that the game itself is so weak and uninteresting, because there are definitely enough play options to keep a person occupied. There are four characters to pick from and 12 levels in all to play. The adventure mode chains the game's eight main levels together into one long quest, complete with a far-fetched story involving a power-hungry witch and time travel. There are quick rush, challenge, time rush, and team rush modes that let you play individual levels with any number of opponents. The team rush mode is kind of nice. You can pick a partner and try to beat the other team to the finish or pick two partners and gang up on a lonesome competitor. The team rush mode also supports link play for up to four players. Good luck finding other people to play with, however, since no one is going to want to play a game that's this lame, even if it does offer link play. For sure though, Popeye: Rush for Spinach looks nice. The characters are large, colorful, and loaded with funny animations. Some of the costume changes that the characters undergo when using certain items are priceless. The backgrounds, for the most part, are absolutely stunning. Artistically, the environments have the same exaggerated look that you'd expect to see in a cartoon on TV. One moment, you'll be running through a thick jungle. The next, you'll be riding atop a dinosaur, scaling up volcanoes and leaping across lava pits. The use of multiple scrolling layers gives the game a welcome sense of depth, which is good since the sight distance going from left to right is so limited. You'll sometimes notice events happening way back in the background, such as volcanoes erupting or leaves falling to the ground. At the same time, objects in the foreground, such as trees and light poles, will obscure the characters when they run past them. About the only thing wrong with the graphics is that many of the obstacles and traps are recycled constantly. After seeing the same fire hydrant, open manhole, and spike pit 20 times in a single level, it just gets tedious. Characters can hop into vehicles to move faster. Popeye fans will also enjoy the game's audio. The music underpinning each level is active and catchy, and each piece seems to suit the overall look and design of the level. The majority of the sound effects are voice clips that were recorded directly from the cartoon. The clips are crystal clear, and there are lots of them. Every character has a different comment for each individual action, power-up, and pitfall. Historically, the racing and platforming genres haven't been comfortable bedfellows, except in rare cases like the time-attack levels featured in Sega's Sonic the Hedgehog games. The key there is that Sega simply took an excellent side-scrolling platformer and added a split-screen race mode to it. Popeye: Rush for Spinach is a mediocre platformer, and its racing aspects just make things worse."}