{"ref": "https://www.gamespot.com/reviews/mtv-music-generator-2-review/1900-2777068/", "date": "May 17, 2006", "game_name": "MTV Music Generator 2", "text": "MTV Music Generator 2 is based on the original music-making program from 1999, and it once again lets you create music, piecemeal, using a fairly intuitive graphical interface and a library of canned riffs. This new installment adds more of the same sort of features created for the original product, including riffs from new types of music genres such as garage and R&B, support for a greater number of simultaneous music channels, some more graphical bells and whistles, and other such advantages made possible by the PlayStation 2's superior memory and storage capacity as compared with its predecessor. MTV Music Generator 2 also sports the endorsement of the music producer Funkmaster Flex, who says on the back of the box, ~Get MTV Music Generator 2 and be a platinum producer like me.~ Flex chose his words carefully, as this bold-sounding statement actually doesn't necessarily imply any correlation between achieving success in the music industry and purchasing MTV Music Generator 2. In fact, despite the program's relative success at lessening the learning curve and the cost of entry required for composing music electronically, MTV Music Generator 2 is still a relatively difficult program to use, and one whose lessons won't necessarily translate if you wish to go further with your music-making endeavors. The 40-page manual packaged with MTV Music Generator 2, some encouraging words from Funkmaster Flex in the game's opening sequence, and a splash screen showing you what does what on your Dual Shock 2 are all the help you'll get trying to get the hang of the program. Actually, the product also comes packaged with more than 20 finished songs from various electronic music artists, which you can load into the program and try to learn from by example. While MTV Music Generator 2 is certainly easier to use than all the instruments and the software suites used by actual electronic music composers, the program could have been considerably friendlier if it had offered a more in-depth tutorial and more step-by-step instruction within the program itself. As it is, you'll invariably take some time getting acquainted with the controls and all the various onscreen icons. If you don't like the layout of the screen or the glossy default look of the program, you can actually change the superficial appearance of the entire interface using one of the nine available custom skins, which offer such colorful graphical themes as ~submarine radio~ and ~post apocalyptic.~ Fortunately, the program makes good use of floating help labels, which reveal what all the different indicators actually mean. After a few hours, you should get the hang of what's what, and you'll find that the interface is functionally sound, no matter how it looks. The program works like its predecessor. You can select from multiple rhythm, bass, melody, and vocal riffs from a total of eight music genres like breakbeat, house, college, pop, rock, and trance. The game visually depicts these riffs using color-coded rectangles that you drop onto the screen in the order in which you want them to play. There's no clear visual difference between the various riffs of a particular type--for instance, all bass riffs are blue--so if you mix up your riffs a lot, and you want to do some editing, you'll just have to float your cursor over the various riffs to distinguish one from the next. It's easy to listen to sample riffs, and you can listen to your work in progress at any time, so MTV Music Generator 2 ends up working fairly well by trial and error--you just drop riffs that sound good into your composition and see if the composition ends up sounding better for it. You can undo your last action if you ever change your mind.The problem is, despite the program's seemingly extensive library of 1,200 different riffs, you'll probably find that a lot of these really don't sound particularly good to you. Many of the riffs sound generic at best; they simply sound too electronic. Even the rock, garage, and college bass and rhythm riffs often sound tinny, artificial, and subdued. The canned vocals--mostly just ~oohs,~ ~aahs,~ and ~babies~--aren't particularly satisfying either. If putting together a piece of music in MTV Music Generator 2 were like playing a game of Tetris, then almost all of the riffs would be those irritating Z-shaped pieces. Furthermore, since the game features eight distinct genres of music, the selection of riffs in any one genre isn't particularly large. It's true that there's no restriction on mixing different elements from different genres, but you'll naturally be inclined against mixing and matching many of the disparate genres. Needless to say, the simple lack of a wide variety of good-sounding riffs can severely dampen your enjoyment of MTV Music Generator 2. The program does include options for editing and even making your own riffs, but these approach the level of complexity found in more-professional music programs and thus aren't really suitable unless you can read (and write) sheet music. It's easier to add effects to your riffs, and you can also tweak individual volume settings and beats-per-minute settings to customize your tracks. You can even add video effects to your work, which basically end up looking like fancy screensavers. You do this by combining various lighting effects, camera angles, and other visual touches, and you can cue up the elements in your video sequence in time with the music. MTV Music Generator 2 lets you create your own riffs from scratch either by sampling directly from CDs or by using the supplemental sampler kit (available for about 20 British pounds from the Codemasters Web site), which even lets you sample audio straight into the program using a microphone. These more-advanced features of MTV Music Generator 2 are actually quite powerful. You can save several of the songs you've created to a standard PlayStation 2 memory card; again, this is an area in which the PlayStation 2 hardware lends a clear advantage over the original product for the PlayStation, where storage memory was at a premium. Unfortunately, as with the original MTV Music Generator, besides saving your work, you can't really do much else with it. That is, in order to play back your song, you first need to load up MTV Music Generator 2, then load up your song in turn. This may seem obvious, given the nature of the product. But the PC version of the original MTV Music Generator let you export your songs to MP3 format, which made the prospect of pouring hours into creating a decent piece of music seem more reasonable--at least you could then easily share it with your friends. MTV Music Generator 2 also features a jam session mode, where up to eight people can get together and pump out music riffs and video effects on the fly. This mode doesn't lend the program much additional value, and it seems like it was included just to make MTV Music Generator 2 seem like a party game. Rather, MTV Music Generator 2 demands long, solitary hours for best results. The overall value of the program can be significant if you're inclined to invest a lot of your own time in it, especially since it costs much, much less than professional-quality software. If you're an aspiring music maker, then stringing together good sounds from its libraries of various riffs should make for some good practice in developing a good ear and allow you to learn some of the complexities of the trade. Furthermore, if you were satisfied with the original program for the PlayStation, then you'll likely find that MTV Music Generator 2's more-extensive set of features and its use of the superior PlayStation 2 hardware will make it worthwhile as a sequel. But like its predecessor, MTV Music Generator 2 walks a very fine line in its efforts to simplify the process of music making. It's not suitable for everyone, and it will require considerable time and effort on your part in order to produce satisfying results. This same time and effort could just as well be spent learning the actual tools of the trade, rather than the proprietary controls found in the self-contained, self-styled MTV Music Generator 2.The problem is, despite the program's seemingly extensive library of 1,200 different riffs, you'll probably find that a lot of these really don't sound particularly good to you. Many of the riffs sound generic at best; they simply sound too electronic. Even the rock, garage, and college bass and rhythm riffs often sound tinny, artificial, and subdued. The canned vocals--mostly just ~oohs,~ ~aahs,~ and ~babies~--aren't particularly satisfying either. If putting together a piece of music in MTV Music Generator 2 were like playing a game of Tetris, then almost all of the riffs would be those irritating Z-shaped pieces. Furthermore, since the game features eight distinct genres of music, the selection of riffs in any one genre isn't particularly large. It's true that there's no restriction on mixing different elements from different genres, but you'll naturally be inclined against mixing and matching many of the disparate genres. Needless to say, the simple lack of a wide variety of good-sounding riffs can severely dampen your enjoyment of MTV Music Generator 2. The program does include options for editing and even making your own riffs, but these approach the level of complexity found in more-professional music programs and thus aren't really suitable unless you can read (and write) sheet music. It's easier to add effects to your riffs, and you can also tweak individual volume settings and beats-per-minute settings to customize your tracks. You can even add video effects to your work, which basically end up looking like fancy screensavers. You do this by combining various lighting effects, camera angles, and other visual touches, and you can cue up the elements in your video sequence in time with the music. MTV Music Generator 2 lets you create your own riffs from scratch either by sampling directly from CDs or by using the supplemental sampler kit (available for about 20 British pounds from the Codemasters Web site), which even lets you sample audio straight into the program using a microphone. These more-advanced features of MTV Music Generator 2 are actually quite powerful. You can save several of the songs you've created to a standard PlayStation 2 memory card; again, this is an area in which the PlayStation 2 hardware lends a clear advantage over the original product for the PlayStation, where storage memory was at a premium. Unfortunately, as with the original MTV Music Generator, besides saving your work, you can't really do much else with it. That is, in order to play back your song, you first need to load up MTV Music Generator 2, then load up your song in turn. This may seem obvious, given the nature of the product. But the PC version of the original MTV Music Generator let you export your songs to MP3 format, which made the prospect of pouring hours into creating a decent piece of music seem more reasonable--at least you could then easily share it with your friends. MTV Music Generator 2 also features a jam session mode, where up to eight people can get together and pump out music riffs and video effects on the fly. This mode doesn't lend the program much additional value, and it seems like it was included just to make MTV Music Generator 2 seem like a party game. Rather, MTV Music Generator 2 demands long, solitary hours for best results. The overall value of the program can be significant if you're inclined to invest a lot of your own time in it, especially since it costs much, much less than professional-quality software. If you're an aspiring music maker, then stringing together good sounds from its libraries of various riffs should make for some good practice in developing a good ear and allow you to learn some of the complexities of the trade. Furthermore, if you were satisfied with the original program for the PlayStation, then you'll likely find that MTV Music Generator 2's more-extensive set of features and its use of the superior PlayStation 2 hardware will make it worthwhile as a sequel. But like its predecessor, MTV Music Generator 2 walks a very fine line in its efforts to simplify the process of music making. It's not suitable for everyone, and it will require considerable time and effort on your part in order to produce satisfying results. This same time and effort could just as well be spent learning the actual tools of the trade, rather than the proprietary controls found in the self-contained, self-styled MTV Music Generator 2."}