{"ref": "https://www.gamespot.com/reviews/mega-man-zero-review/1900-2882128/", "date": "October 1, 2002", "game_name": "Mega Man Zero", "text": "Mega Man Zero is the third Mega Man game released for the Game Boy Advance, and like the other two, it's a departure from the roots of the series--only less so. The previously released Mega Man Battle Network games are role-playing games rather than the sorts of platform shooting games that Capcom's famous blue hero is best known for. Meanwhile, this latest game doesn't even feature Mega Man at all. However, Mega Man Zero is a platformer through and through, and fans of the series will be instantly at ease with the game and its new features. And they're likely to be struck not just by Mega Man Zero's great graphics and design, but also by its challenge. Mega Man Zero takes place far in the future of the Mega Man X storyline, when characters Zero and X have come to be known as legendary reploids. X is nowhere to be seen and is believed to have turned evil and to be up to all sorts of evil affairs. Zero, on the other hand, is found abandoned and nonoperational in a mine by a young scientist named Ciel, who awakens the famous reploid in an attempt to save the world from all its problems. From here, you take control of Zero to protect Ciel in the initial stage of the game. The game follows the traditional formula of nearly every Mega Man game that has come before it. From the beginning, you'll have the usual mega buster cannon to shoot foes as well as your z-saber as your primary weapons. Later in the game you'll also wield new weapons, such as the triple rod and the shield boomerang. What sets Mega Man Zero apart from previous Mega Man games is that now you can level up your weapons simply by using them during the game. For instance, the mega buster starts out being able to shoot only in three-shot bursts, but after a few levels, you'll be able to shoot four shots at a time, as well as charge up your weapon for a more devastating blast. While the weapons are easy enough to get a handle on, the controls require a bit more practice. You press the A button to jump, press the B button to attack with your primary weapon, press and hold the right shoulder button and B to use the secondary weapon, and press the L button to dash. Because Mega Man games, this one included, tend to always require a firm grasp of just about every move at your disposal, getting used to the control scheme is a little problematic at first, particularly the secondary-weapon command. As you fight your way through the game, you'll find a brand-new addition to the series in the form of the ~cyber elf~ system. Throughout each and every level, Zero will find these cyber elves by eliminating enemies, or he'll find them tucked away in hidden areas. Upon successfully besting the level and returning to base, you can then take a look at what your newly found cyber elf can do for you. There are more than 70 different elves to collect and bring to life, each with different abilities, such as slowing down enemies, damaging boss characters, and refilling Zero's health. To make matters a little more interesting, after you put an elf to use, it disappears. This requires you to think carefully about using some of the more powerful ones that you'll come across. Longtime fans of Mega Man games are undoubtedly familiar with the method of picking which level to proceed to next by selecting its boss character from a central screen. Mega Man Zero adjusts this system by putting you back at base in between missions, where you can move around and speak to other members of the resistance, select a new mission, or save your game by speaking to Ciel. The actual levels in the game are a little different from the typical side-scrolling or vertical-scrolling Mega Man level, although they're still rooted in that style. In one case, you make your way through a level like you normally would, fighting a boss at the end, but afterward you have to escort an injured ally back to the beginning of the level. Other levels are timed, and some are slower paced. No matter how you look at it, there is a great deal of variety to the missions in the game. Mega Man Zero also happens to be one of the most difficult games to come around for the system in a while. It's so hard, in fact, that those unfamiliar with the series may find themselves completely unable to get very far in the game at all. Mega Man Zero requires you to be on your toes at all times and, most importantly, to be able to recognize patterns in enemy movement easily and use them to your advantage. In addition to the sheer difficulty of the game, Zero also has only one life at a time, so if you die during a level, you'll be forced to use a continue. Fortunately, extra continues can be stockpiled by killing various enemies. However, extra time spent in a level will lower your rating for that level, so you'll have to put on a real show to get the highest score. The game is surely difficult, but nevertheless, it's still one of the better platformers yet to grace the small screen. The Mega Man series once was known for its beautiful 2D graphics, and this game is a reminder of why. Zero is very detailed and fluidly animated, and every one of his moves is hand-drawn to perfection. The game's levels and enemies are also quite detailed, especially the huge boss characters, which can sometimes take up half of the screen and have multiple death animations depending on the weapon you use to defeat them. In a day and age when 2D bitmapped graphics have all but become a lost art, this game shows that drawing every detail by hand still pays off. Simply put, this is one of the best-looking Game Boy Advance games out there. In addition to having beautiful graphics, the game also sounds great. The musical accompaniment hearkens back to the days of the SNES, when the Mega Man X games were popular. Anyone who has played a modern Mega Man game before will fall in love with the new songs in Mega Man Zero. Overall, Mega Man Zero is an impressive action game that definitely isn't for everyone. Younger or more casual players may find the game way too hard and may be better off with something less difficult. However, fans of the series or experienced gamers should not hesitate to pick this one up. While the Game Boy Advance still doesn't have a traditional Mega Man game starring Mega Man himself, Mega Man Zero will definitely provide you with more than enough challenge to keep you busy until then."}