{"ref": "https://www.gamespot.com/reviews/rayman-2-the-great-escape-review/1900-2540494/", "date": "April 28, 2000", "game_name": "Rayman 2: The Great Escape", "text": "After patiently waiting more than a year between the announcement of the release date of Rayman 2 for the N64 and the actual release last November, fans eager for another serving of Ubi Soft's jointless platform hero were rewarded with an amazing platforming experience that truly showcased the N64. But what really surprised the gaming populace was the announcement that Rayman 2 was also in development for the Dreamcast and the PlayStation. And while the PlayStation version has yet to be released, the Dreamcast version is currently the best Rayman 2 available. Rayman has finally made the transition into a fully 3D realm, and although not as well known as Sonic or Mario, Rayman 2 proves that you don't have to have a hugely popular character to make a great 3D platform game. Evil mechanical pirates led by the maniacal Razorbeard are enslaving the population of Rayman's world. It's up to our jointless hero to collect four magical masks that, once united, will awaken a sleeping god who will help Rayman defeat the pirates. Along his quest he'll pick up lums, which are magical fragments of the world's energy core. He'll also free creatures enslaved by the evil pirates and run into a host of friends who will help him achieve his goal. Rayman 2 really immerses you in Rayman's world. The game offers stunning graphics, incredible sound, and tons of opportunity to interact with other characters. Almost immediately you'll run into Globox, an old friend who helps you escape from the pirate ship. From there, you'll encounter a cute fairy, a collective of tiny magical beings, a muscle-headed giant, an imprisoned whale, a polite water snake, and a few other surprising characters. They'll help you along the way by opening new routes, pulling you across chasms, giving you new powers, or even volunteering information.The graphics are simply astonishing. People taken aback by the N64 or PC versions of Rayman should really see him on the Dreamcast. The environments are lush, the colors are vivid, and the graphics are extremely crisp. There's absolutely no pop-up anywhere in the huge levels, and the game flows smoothly from one part to the next. You won't be truly impressed until you stand atop a ledge and switch to a first-person view, in which you'll be able to look down on the entire level without any hint of fog. Rayman himself looks great, and the character design is wonderful. The robo-pirates have just the right combination of menacing and doltish, Ly, your fairy friend, looks positively elfish, and Jano, the Keeper of the Cave of Bad Dreams, looks like he belongs in a nightmare.Rayman 2 is one of the most creative games to come along in a great while. Most platform games give you tons of ledge jumping and room exploring, with little deviation. Rayman 2, however, is packed full of different modes and minigames. From waterskiing, to swimming alongside a whale, to riding a rocket-powered horse, to flying a flaming powder keg, Rayman 2 is full of gameplay surprises. Indeed, there's plenty of platforming in Rayman 2, but the frequent use of different gameplay elements keeps the game fresh and exciting. Also, the game is very good at surprising you. While there are not a lot of objects in the game, there are several ways to use each. A powder keg can be tossed at bad guys, thrown at doors, used to break open cages, and even lit to create a rocket. This system always keeps you wondering what, exactly, you're going to do with an item you run in to.Rayman 2 is not only a treat to the eyes, but also to the ears. All the characters in Rayman 2 speak in their native language - a sort of quasi-French that comes out sounding more like gibberish than anything positively discernable. While each level has its own distinctive tune running in the background, certain scenarios will cause the music to change tempo, or even switch to a different track altogether, giving the game a truly interactive sound system. And if that weren't good enough, the music is actually really good. But that's not all the sound department has to offer. The sound effects in this game are great too. Detailed down to your footsteps, you'll hear every snoring pirate, every plink of your shoes hitting hollow metal pipes, every swinging cage, and everything else you'd expect if you were actually Rayman. Playing Rayman 2 without any sound is a difficult task indeed, as it's absolutely essential to the game.The control is so intuitive you'll wonder why other games even bother with bogging down the player with complex control schemes. You can jump, use your helicopter move to glide, shoot purple rings to swing, hold the left trigger to lock onto a target a la Zelda, and stand next to an object to pick it up. That's all you must do to get you through every level of Rayman. You won't need a complex item inventory screen, a lives count, or even much of a life bar, for that matter. With the wonderfully simple control and nothing more, Rayman 2 still manages to be a challenge without frustrating you with complex button presses or making you figure out what item to use where.Ubi Soft wasn't satisfied with simply porting the code over to the Dreamcast. Not only does it look better than the PC version, but it's also obvious the developers took their time making Rayman really take advantage of what the Dreamcast has to offer. There are new extra features, and Rayman 2 is now a multiplayer game. And if you explore the game's web site through the Dreamcast's browser, you'll find clues that lead you to a hidden Gloobox village, where you'll be able to play the Gloobox Disk - a multiplayer maze game.Rayman 2 is one of the best platforming experiences available today. By including a wonderfully humorous story, excellent game mechanics, and perfection in almost all other categories, Ubi Soft has created a game that appeals to all types of gamers. There are many versions of Rayman to choose from, but the extra features crammed into this version plus the Dreamcast's superior graphics and sound make this the Rayman game of choice for choosy gamers."}