{"ref": "https://www.gamespot.com/reviews/rayman-2-review/1900-2622126/", "date": "August 30, 2000", "game_name": "Rayman 2: The Great Escape", "text": "Despite huge delays and release dates for different platforms that spanned almost a year, Rayman 2 has finally landed on every platform. With the PC, Dreamcast, and N64 versions of Rayman 2, Ubi Soft introduced us to an incredibly lush world where not only do the graphics raise eyebrows, but amazing audio and truly complete gameplay also prove that sometimes a good thing is well worth a wait. It's because of this exceptional level of detail that fans were surprised when Ubi Soft announced that its limbless hero was also making an appearance on the less powerful PlayStation. So the question is, was Ubi Soft able to pour Rayman's magic into a smaller bottle? It was, but it spilled plenty. Rayman has finally made the transition into a fully 3D realm, and although he's not as well known as Sonic or Mario, Rayman 2 proves that you don't need a hugely popular character to make a great 3D platform game. Evil mechanical pirates led by the maniacal Razorbeard are enslaving the population of Rayman's world. It's up to our jointless hero to collect four magical masks that, once united, will awaken a sleeping god who will help Rayman defeat the pirates. In his quest, he'll pick up lums, which are magical fragments of the world's energy core. He'll also free creatures enslaved by the evil pirates and run into a host of friends who will help him achieve his goal. Rayman 2 does an incredible job of immersing you in Rayman's world. While the environments somehow retain an oddly familiar feel, everything takes place in a magical, almost fairy-tale world. The game uses plenty of unique textures, which, when combined with the innovative level design and lighting, keeps the levels fresh and alien. The game also throws plenty of crazy characters into the mix, and this time around they're actually voiced in full English, instead of the psuedo-French mumbling that's in the other versions. Almost immediately you'll run into Globox, an old friend who helps you escape from the pirate ship. From there, you'll encounter a cute fairy, a collective of tiny magical beings, an imprisoned whale, a polite water snake, and a few other surprising characters. They'll help you along the way by opening new routes, pulling you across chasms, giving you new powers, or volunteering information. While not as clean or detailed as any of the other versions of Rayman 2, the PlayStation version still does an amazing job with the graphics. The environments are ripe with detail and sport plenty of vivid color. There's occasionally some polygonal breakup, but for the most part, pop-up, fog, and loading time have all been eliminated. The backgrounds in the levels have been conveniently hidden, and you can no longer stand on a ledge and simply look out over the whole level - now you'll find that all sorts of suspiciously placed objects keep you from noticing the sometimes plain backgrounds. Rayman himself looks great, and the character design is wonderful. The mechanical pirates are just the right combination of menacing and doltish; Ly, your fairy friend, looks positively elfish; and Jano, the keeper of the Cave of Bad Dreams, looks like he belongs in a nightmare. Rayman 2 is not only a treat to the eyes, but also to the ears. Not only do the characters now speak English, but the voice work is also truly excellent and really helps breathe life into the characters. While each level has its own distinctive tune running in the background, certain scenarios will cause the music to change tempo or even switch to a different track altogether, giving the game a truly interactive sound system. The sound effects department has definitely taken a hit in the PlayStation version, though. Most of the important effects are still there, but you no longer hear the little things like ambient sound or Rayman's footsteps. The control is so intuitive you'll wonder why other games even bother with bogging down the player with complex control schemes. You can jump, use your helicopter move to glide, shoot purple rings to swing, hold the left shoulder button to lock on to a target  la Zelda, and stand next to an object to pick it up. That's all you must do to get you through every level of Rayman. You won't need a complex item inventory screen, a lives-remaining count, or even much of a life bar, for that matter. With the wonderfully simple control and nothing more, Rayman 2 avoids frustrating you with complex button presses or making you figure out what item to use where - but still manages to challenge you. Rayman 2 is one of the most creative games to come along in a great while. Most platform games give you tons of ledge jumping and room exploring, with little deviation. Rayman 2, however, is packed full of different modes and minigames. From waterskiing, to swimming alongside a whale, to riding a rocket-powered horse, to flying on a flaming powder keg, Rayman 2 is full of gameplay surprises. Indeed, there's plenty of platforming in Rayman 2, but the frequent use of different gameplay elements keeps the game fresh and exciting. Also, the game is very good at surprising you. While there are not a lot of objects in the game, there are several ways to use each. A powder keg can be tossed at bad guys, thrown at doors, used to break open cages, and even lit to create a rideable rocket. This system always keeps you wondering what, exactly, you're going to do with any item you run in to. Taking everything the N64 and Dreamcast versions have to offer and squeezing it into the PlayStation was no easy task, and there have definitely been some changes. Aside from the obvious graphical and audio hits, the gameplay simply isn't a detailed as it was in the other versions. The levels have been shortened significantly, and some are even broken up into several areas that load as you progress through them. Additionally, several of the game's levels have been completely reworked, and as a result some major gameplay elements from the levels of the other versions are simply missing in those of the PlayStation version. Most of the levels are simpler and don't offer anywhere near the challenge the other versions' levels did. The PlayStation version of Rayman 2 almost feels like a CliffsNotes version of the Dreamcast or N64 game at times - the basic plot and gameplay is still there, but you lose a lot of the subtle nuances that really make playing the game worthwhile. Still, Rayman 2 is one of the best platforming experiences available on the PlayStation. As long as you're not directly comparing it to the other versions of the game, the PlayStation Rayman 2 is an excellent, worthwhile game that is not only challenging, but is also rewarding. But when compared directly to the other versions, it's easy to see that this Rayman is the runt of the litter. By including a wonderfully humorous story, excellent game mechanics, and solid graphics and sound, Ubi Soft has created a game that appeals to all types of gamers and shouldn't be overlooked by gamers who only own a PlayStation. But those of you who own multiple platforms should definitely pick up the N64 or Dreamcast version instead."}