{"ref": "https://www.gamespot.com/reviews/castlevania-order-of-ecclesia-review/1900-6200084/", "date": "October 27, 2008", "game_name": "Castlevania: Order of Ecclesia", "text": "As brilliant as Castlevania: Symphony of the Night was when it was released 11 years ago, Konami has done little to keep things fresh with the five subsequent releases. With Order of Ecclesia, they have successfully revamped a formula that was creeping dangerously close to stale territory. By breaking free from the predictable confines of a dusty castle, they have injected much-needed variety to the level design, almost eliminating the exhausting backtracking that has plagued the series. Ecclesia is an eminently enjoyable romp through the decaying ruins of a dying world. Some brutal boss encounters will derail neophytes unaccustomed to Castlevania's punishing difficulty, but that is the only serious flaw in this package. Order of Ecclesia is one of the finest entries ever in this venerable franchise. Even the horses in Order of Ecclesia are freaky looking. Dracula never seems to stay dead. Ecclesia has you once again hunting down the dapper count, but the story is largely irrelevant. Do you really need a reason to kill a bloodsucking vampire? The only thing you need to know about the story is that, as Shanoa, you are not part of the Belmont clan. This means you won't have access to that legendary whip that has been paramount to Dracula's defeat so many times in the past. Instead, you steal magic from the bodies of vanquished foes in the form of glyphs. These glyphs take the form of traditional melee weapons such as lances and swords, along with powerful spells that let you control elements, pass through walls, and even imbue yourself with batlike abilities. The glyph system is similar to Dawn of Sorrows' soul-stealing technique, but this is much more versatile. Because you can equip a glyph in each hand, you'll have to experiment to find the most destructive combinations. Also, enemies have resistance to certain weapons, so you can't just rely on one superpowerful glyph to tear down everything in your path. The ultraprecise controls bring this complex system together. Seamlessly swapping weapons on the fly while you slide under the searching tongue of a foul cave troll is so satisfying, especially when you proceed to turn him into a lifeless husk with your superior rapier. As engaging as the tweaked combat mechanics are, the revamped level design is what separates this from the glut of other Castlevania titles. For the first time in what seems like forever, your journey is actually broken up into levels. No longer must you endlessly scour the castle looking for the one path that will take you to a new area; backtracking has been made optional this time. You can plow through levels with little deviation if you choose, or you can revisit stages to collect new glyphs and find every secret buried within. When you do decide to explore, it will be with a purpose, as rescued villagers will give you optional side-quests that reward you with new items or equipment in the general store. Freed from forced backtracking, the pace moves continually forward, ensuring you are always exploring previously unseen sections and encountering grotesque new creatures. The most memorable enemy confrontations come in the form of brutal boss challenges. While the first one is a pushover, allowing you to feel like a powerful slayer as you plunge your dagger through the brittle shell of a hideous lobster/baby monstrosity, the difficulty quickly ramps up. Bosses each have specific patterns that can be learned after dying one or two times at their hands, but their inflated health points make some fights drag on far too long. It's hard enough to avoid screen-filling blows from a giant enemy, but it can get extremely tedious when you are asked to perform the same dodge technique for 10 consecutive minutes. The later bosses are much fairer, though they still serve as formidable roadblocks along the way, halting your progress before you master their attack patterns. The cleverest bosses force you to dispatch them in creative ways that will make you use your mind more than your chosen glyphs. That is one repulsive lobstrosity. The art design has never been stronger in the Castlevania series. The enemies are positively creepy, ranging from floating heads with prehensile tongues to a twisted take on the classic butterfly. The bosses are large and imposing, bellowing nerve-wrenching screams while they spew out gastric juices and make you thankful they don't exist in real life. The environments create an air of foreboding doom. The fog engulfing some areas adds a layer of tension without obscuring your view, while the underwater sections are fertile ground for the unchecked breeding of some truly vile creatures. Though it reuses some sprites from older Castlevania titles--a distraction for series veterans--the sheer variety of new graphics seen in both the lands you'll traverse and the enemies you'll face off against more than make up for some recycled content. Order of Ecclesia oozes personality and will urge players to explore all that it has to offer. The streamlined level design and versatile combat system make this the most engaging Castlevania game in years. In both technical prowess and artistic valor, this is one of the most accomplished games in the series. The unholy visual design, jarring sound effects, and wonderfully composed score create a mood unmatched in the portable realm. If you can get past the overly difficult boss battles, you'll be treated to an extremely rewarding adventure. Games like this make you thankful that Dracula has a penchant for resurrection."}