{"ref": "https://www.gamespot.com/reviews/illbleed-review/1900-2709643/", "date": "May 17, 2006", "game_name": "Illbleed", "text": "Most horror-themed video games tend to be straight-faced and humorless about their macabre themes, almost to the point of seeming canned and ill conceived at times. Horror games that deviate from the hard-boiled Resident Evil approach are very rare, and good games that distance themselves from that style are even rarer. Climax Graphics--the developer of the Dreamcast launch title Blue Stinger--attempted to capitalize on this dearth of lighthearted themes with Illbleed, a horror game that is decidedly light and self-conscious. Whether this is a good or bad thing depends both on your affinity for slapstick horror and your tolerance for tedium. Michael Reynolds, a mentally deranged theme park entrepreneur, is offering $100,000,000 to anyone able to make it through his latest theme park alive. Called Illbleed, the park in question is supposedly loaded with all manner of features and attractions designed to literally scare its visitors to death. Enter the Castle Park School horror club, a group of sassy high schoolers led by gore-enthusiast Eiko Christy. Eiko is an outspoken young woman, the president of the Castle Park student council, and an avid employee in her family business--a traveling haunted house. Coolheaded Eiko is rather dismayed when her fellow club members approach her with the prospect of venturing into Illbleed and sacking the hefty reward. However, when her friends disappear for days after their supposed trek, brave Eiko ventures into Illbleed after them, with the hopes of both rescuing them and collecting the cash.From a gameplay standpoint, Illbleed is dramatically different from the slew of horror games released in recent years. The game puts even less of an emphasis on combat than Resident Evil-style games; instead it focuses more on the process of identifying, and subsequently neutralizing, traps. Traps are everywhere in Illbleed, and they take a variety of forms: Some will cause apparitions to materialize out of thin air, to scare the heck out of you, while others will have loose pieces of wood fall on and injure you. Others will even summon forth grizzly monsters to try to dismember you. To circumvent any potential hazard, Illbleed gives you detailed access to all of your character's faculties. Onscreen gauges represent your character's sight, hearing, smell, and her mystical sixth sense. When you're in close proximity to a potential hazard, the appropriate gauge will spike. As it's often impossible to proceed through the game's levels and circumvent a given hazard, you're given access to a device that lets you effectively neutralize hazards: the horror monitor. Basically, the horror monitor is a set of odd goggles that your character wears, which apparently pick up paranormal activity in her vicinity. Once you've found the horror monitor, you activate it by going into the first-person-view mode, through which you scan your environs for possible traps. The monitor will automatically zero in on areas that are possibly booby-trapped, and by pressing the A button, you can mark suspicious zones. The catch, as you'd imagine, is that most of the zones the horror monitor zeros in on aren't actually booby-trapped. What's more, marking zones costs you adrenaline points, which are often in short supply. As a result, playing through Illbleed's levels is often very much a guessing game, and if you're too careful and squander your adrenaline points early on, you'll have to blindly face the level's later phases. Conversely, if you hoard adrenaline points and run blindly into hazards early on, you'll probably be too wounded to successfully meet the stage's completion criteria. And the fact is, there are a host of ways to die in Illbleed. Each character has hit-point, heart-rate, and ~bleeding~ ratings. Basically, they're all slightly different life ratings, and when any of them goes critical, you die. Different types of traps affect different ratings; traps that strike you physically, obviously, will cause your hit points to drop, while sneak-scares will affect your heart rate. If you get too injured, you can also bleed to death. Luckily, the game's pharmacy is stocked with items that will restore your life and adrenaline and calm your heart rate. Finding the money with which to buy them, though, is another matter entirely. Each of the game's stages takes the form of an attraction in the park. The park's grandstand serves as the game's hub, from which you access further stages, swap characters, purchase items, and upgrade your characters. Upon entering each stage, you're shown the objectives you must fulfill to complete it. On top of fulfilling any narrative-related objectives, most stages will require that you get through them under a set amount of time, with your health ratings over a certain number. How completely you actually fulfill these objectives determines just how much prize money you'll earn after completing the stage.Overall, the game puts a large focus on a kind of stop-and-go gameplay: To safely traverse each stage, you'll have to constantly scan your environs, gauge potential hazards, and proceed as your instincts dictate. More often than not, this leads to some very deliberate pacing--some sequences do get rather crowded, but they tend to be the exception rather than the norm. This considered, Illbleed's saving grace is definitely its batty presentation. While the game is graphically pretty bare, its off-the-wall production and gratuitous use of luscious, spurting blood sets its B-movie tone perfectly. It's not only the blood either--some of the traps you'll trigger are downright goofy and will surely elicit belly laughs from even the most jaded ~gorephile.~ The game also features a good number of crazed, murderous crash-test dummies.It seems almost miraculous that Illbleed actually made it to the Dreamcast. Admittedly, the game's mechanics aren't entirely sound. However, the game does have a unique, quirky character that might perhaps warrant a look, albeit a quick one. Because its core play mechanics start to wear on you after even a few hours of playing, anything beyond a quick look makes little sense."}