{"ref": "https://www.gamespot.com/reviews/syberia-review/1900-6073002/", "date": "August 5, 2003", "game_name": "Syberia", "text": "The adventure game genre was one of the first on the PC, and, at one time, it was one of the most popular. That's no surprise, since the best adventure games take you to unforgettable worlds, introduce you to strange characters, and let you solve all kinds of intriguing puzzles to win the day. But old-school point-and-click adventures are uncommon on the PC now, and they're even rarer on consoles, so it's great to see games like Syberia make it to the Xbox. Created by the acclaimed author and illustrator Benot Sokal, Syberia received glowing praise when it was first released on the PC last fall. Aside from some small rough spots, Syberia is a superb adventure with an engrossing story, a truly imaginative gameworld, and stunning visuals. Syberia earned glowing praise when it was first released on the PC last fall. Syberia's opening scene lets you know you're in for a gaming experience that's out of the ordinary. On the quaint, aged streets of a tiny town in the French Alps called Valadilene, an eerie funeral cortege makes its way through the rain toward the local cemetery. A metallic clockwork drummer clomps along the slick paving stones, followed by an ornate horse-drawn carriage bearing a coffin. Slowly following the carriage are a handful of life-size metal automatons wearing top hats and carrying umbrellas. They continue their solemn, silent march through the cemetery gates while a lone young woman watches. This woman turns out to be your alter ego in the game, Kate Walker. Kate is an associate with a New York law firm, and she's been sent all the way to Valadilene to secure a major business deal. Valadilene's one claim to fame is that it's served for centuries as the home of the Voralberg family, makers of exquisite clockwork toys and automatons. While these marvelous mechanical creations have been sought by collectors and even emperors for centuries, the days of the Voralberg toys are seemingly numbered. Syberia plays out in the present day, so electronic toys and video games are all the rage, and there's little demand for mechanical contrivances, however ornate and imaginative. Young people have been emigrating from Valadilene in growing numbers, seeking their fortunes elsewhere, since there's no longer work to be had at the Voralberg factory. Kate has arrived to facilitate the buyout of Voralberg Manufacturing by a massive and modern multinational competitor, the Universal Toy Company. While the sole remaining member of the Voralberg clan, the aged Anna Voralberg, has agreed to the takeover, the deal quickly goes awry when Kate learns that the funeral procession she just witnessed was for Anna. Kate soon learns that there might be an heir, though, and a most unexpected one at that. Thus begins the adventure of Syberia, as Kate travels to far-flung locales across Eastern Europe and Asia in search of this heir and clues to his mysterious life. Syberia features animated characters moving in front of largely static yet gorgeous 2D backgrounds. To move Kate, you simply press the D pad or analog stick in the desired direction. A context-sensitive cursor appears to let you know when you can look closer at certain items or manipulate them. When Kate encounters people during her journeys, she can ask them questions--you just click on one of a few possible topic choices listed on a notepad to hear what the character has to tell Kate. Unfortunately, the interface has suffered a bit in the translation from the PC to the Xbox. On one hand, you can zoom in on the detailed documents you find, which lets you read them easily on a standard TV screen. On the other, it can now sometimes be harder than necessary to make Kate move to a particular area. You might need to press the same button a couple of times or move Kate back and forth carefully near the edge of the screen first. A bug will sometimes make her repeatedly exit one particular area as soon as she enters it. It's a shame that such a simple and effective interface was somehow botched in this port. Syberia's beautiful and wonderfully imaginative world is enough to make the game worth your while. At least the story and characters are all intact and identical to their PC counterparts. You'll encounter some truly unusual characters throughout Syberia, like the crazed administrator of an abandoned Soviet industrial town who obsesses over an elderly opera soprano who once visited the place during its heyday. Anna Voralberg's interesting life is fleshed out through a diary, a series of voice recordings, and captivating flashbacks. You learn about Kate and her journey of self-discovery not merely through other onscreen characters' reactions to her, but also from her cell phone conversations--some of them very strained--with her fianc, her boss, her mother, and a friend back in New York. These calls help ground Kate in reality while setting up an even greater contrast between everyday life and the dreamlike settings and surreal predicaments she finds herself in. Some of Syberia's lesser characters feel more like caricatures than real people. The fact that some of the dialogue is clunky and the voice-overs rarely rise above mediocrity doesn't help. Despite its unevenness in character building and a few clumsily handled plot twists, Syberia's main characters are memorable, and the melancholy story feels unusually rich, a true cut above your typical gaming fare. Syberia's gameplay is rather like the Voralberg toys: something of a pleasant holdover from a bygone age. Like most traditional adventure games, Syberia is essentially an interactive picture book where you need to solve puzzles or dilemmas before turning to the next ~chapter.~ The game features a casual pace that will, depending on your disposition, either put you off or offer a bit of gaming that's relaxing yet very engaging. After all, we already have plenty of games where you constantly run, shoot, fly, drive, or otherwise interact incessantly, so it's nice to be able to stop and smell the virtual roses once in a while. Syberia's graphics are engaging and enchanting. For all that it does well, Syberia does include some of the potentially annoying elements that have come, for better or worse, to define the traditional adventure genre. The first time Kate explores an area, it's a welcome thing to be able to watch her slowly meander down a street, savoring the scene. At times, though--particularly in the somewhat tedious second act of the game--you'll have to make Kate walk through the same areas numerous times, which can grow old in a hurry. (Kate Walker's last name is certainly apropos.) At least Syberia sometimes displays a wry sense of humor about adventure game clichs to lighten some of the potential frustrations. You'll come upon a massive hedgerow maze stretching off into the distance, a sight sure to make you want to reach for the ~off~ button. You quickly learn, though, that most of the maze is gated shut, and the object you need there is very easily found. The challenges you face tend to revolve around simple and logical object manipulation or interactions with other characters. Early in the game, for instance, you'll need to figure out how to work a sort of automaton doorman. Fiddling with its mechanical levers gives you the impression that this device is supposed to look at whatever you put in its hand. This suggests a calling card or a certain document in Kate's possession that might do just as well. Other challenges you'll need to overcome before progressing to new areas simply involve common sense--when you first spot new characters, you should talk with them for clues or assistance. If you get some important news about Kate's assignment early on, have her call her boss back in New York on her cell phone for instructions. It's all fairly straightforward stuff, and the puzzles don't tend to be too tough overall. Unlike a lot of adventure games, Syberia's puzzles generally feel believable, too, at least in the context of the game's dreamlike world. They often shed light on the game's characters or the workings of the Voralberg toys, instead of just offering totally arbitrary or silly challenges. Just as importantly, the order and manner in which you complete many of the puzzles sometimes makes the game feel rather less linear than it actually is. It's certainly nice to feel like you're exploring a world rather than being led through it on a leash. And what a world it is! Syberia's graphics are engaging and enchanting, with many backdrops and cutscenes that will leave you wide-eyed with wonder and admiration. Syberia may not feature cutting-edge 3D graphics technology, but it has something far more important: superb artistry. Around every corner, there's a gorgeous scene to relish or an almost otherworldly flight of fancy offered by the animated Voralberg automatons. Syberia features animated characters moving against largely static yet gorgeous 2D backgrounds. Indeed, it's the game's unique ambience that truly sets it apart. Valadilene and the Voralberg factory, for instance, seem like remnants of a nearly forgotten era, a little world where time stopped around the turn of the 20th century. A towering wrought-iron-and-glass railway station, for instance, calls to mind the proud stations of the Victorian era, while the Voralberg factory is a wonderland of fanciful industrial-age machinery driven by waterwheels and massive gears. Outdoors, you're treated to equally beautiful scenes of mountain trails bordered by crystal-clear icy waters and stone bridges arching over quaint little canals. All these scenes are further invigorated by just the right amount of animation, like birds soaring overhead. Simple and effective sound effects and an evocative musical score with themes that suit the locales further bring the gameworld to life. Syberia's beautiful and wonderfully imaginative world is enough to make the game worth your while, but when you couple that with a moving story, memorable characters, and puzzles that are usually more fun than frustrating, you get a great gaming experience. It's true that Syberia's interface could have used more polishing, and that the game's slow pace won't be for everyone. It should take you some time to solve Syberia, but once you do, there's not much reason to replay it, since the game is ultimately quite linear and has one fixed ending. You do at least get some ~making of~ extras to watch. Still, despite its weaknesses, Syberia generally shines as it takes you on a truly captivating journey. Syberia's gameplay is rather like the Voralberg toys: something of a pleasant holdover from a bygone age. Like most traditional adventure games, Syberia is essentially an interactive picture book where you need to solve puzzles or dilemmas before turning to the next ~chapter.~ The game features a casual pace that will, depending on your disposition, either put you off or offer a bit of gaming that's relaxing yet very engaging. After all, we already have plenty of games where you constantly run, shoot, fly, drive, or otherwise interact incessantly, so it's nice to be able to stop and smell the virtual roses once in a while. Syberia's graphics are engaging and enchanting. For all that it does well, Syberia does include some of the potentially annoying elements that have come, for better or worse, to define the traditional adventure genre. The first time Kate explores an area, it's a welcome thing to be able to watch her slowly meander down a street, savoring the scene. At times, though--particularly in the somewhat tedious second act of the game--you'll have to make Kate walk through the same areas numerous times, which can grow old in a hurry. (Kate Walker's last name is certainly apropos.) At least Syberia sometimes displays a wry sense of humor about adventure game clichs to lighten some of the potential frustrations. You'll come upon a massive hedgerow maze stretching off into the distance, a sight sure to make you want to reach for the ~off~ button. You quickly learn, though, that most of the maze is gated shut, and the object you need there is very easily found. The challenges you face tend to revolve around simple and logical object manipulation or interactions with other characters. Early in the game, for instance, you'll need to figure out how to work a sort of automaton doorman. Fiddling with its mechanical levers gives you the impression that this device is supposed to look at whatever you put in its hand. This suggests a calling card or a certain document in Kate's possession that might do just as well. Other challenges you'll need to overcome before progressing to new areas simply involve common sense--when you first spot new characters, you should talk with them for clues or assistance. If you get some important news about Kate's assignment early on, have her call her boss back in New York on her cell phone for instructions. It's all fairly straightforward stuff, and the puzzles don't tend to be too tough overall. Unlike a lot of adventure games, Syberia's puzzles generally feel believable, too, at least in the context of the game's dreamlike world. They often shed light on the game's characters or the workings of the Voralberg toys, instead of just offering totally arbitrary or silly challenges. Just as importantly, the order and manner in which you complete many of the puzzles sometimes makes the game feel rather less linear than it actually is. It's certainly nice to feel like you're exploring a world rather than being led through it on a leash. And what a world it is! Syberia's graphics are engaging and enchanting, with many backdrops and cutscenes that will leave you wide-eyed with wonder and admiration. Syberia may not feature cutting-edge 3D graphics technology, but it has something far more important: superb artistry. Around every corner, there's a gorgeous scene to relish or an almost otherworldly flight of fancy offered by the animated Voralberg automatons. Syberia features animated characters moving against largely static yet gorgeous 2D backgrounds. Indeed, it's the game's unique ambience that truly sets it apart. Valadilene and the Voralberg factory, for instance, seem like remnants of a nearly forgotten era, a little world where time stopped around the turn of the 20th century. A towering wrought-iron-and-glass railway station, for instance, calls to mind the proud stations of the Victorian era, while the Voralberg factory is a wonderland of fanciful industrial-age machinery driven by waterwheels and massive gears. Outdoors, you're treated to equally beautiful scenes of mountain trails bordered by crystal-clear icy waters and stone bridges arching over quaint little canals. All these scenes are further invigorated by just the right amount of animation, like birds soaring overhead. Simple and effective sound effects and an evocative musical score with themes that suit the locales further bring the gameworld to life. Syberia's beautiful and wonderfully imaginative world is enough to make the game worth your while, but when you couple that with a moving story, memorable characters, and puzzles that are usually more fun than frustrating, you get a great gaming experience. It's true that Syberia's interface could have used more polishing, and that the game's slow pace won't be for everyone. It should take you some time to solve Syberia, but once you do, there's not much reason to replay it, since the game is ultimately quite linear and has one fixed ending. You do at least get some ~making of~ extras to watch. Still, despite its weaknesses, Syberia generally shines as it takes you on a truly captivating journey."}