{"ref": "https://www.gamespot.com/reviews/syberia-review/1900-2879350/", "date": "September 5, 2002", "game_name": "Syberia", "text": "If you've heard that adventure games are dead, you've heard wrong. Sure, this once-dominant game genre is now just a shadow of its former self, but it's a genre that nevertheless manages to produce one or two really impressive games each year. This year, adventure game fans get treated to Syberia, a product of the fertile imagination of comic book author and illustrator Benot Sokal, the man behind the 1999 adventure game Amerzone. Aside from a few little rough spots, Syberia is an adventure-game tour de force, with an engrossing story, a truly imaginative gameworld, and stunning visuals. Syberia's opening scene lets you know you're in for a gaming experience that's out of the ordinary. On the quaint, aged streets of a tiny town in the French Alps called Valadilene, an eerie funeral procession makes its way through the rain toward the local cemetery. A metallic clockwork drummer jerkily clomps along the slick paving stones, followed by an ornate horse-drawn carriage bearing a coffin. Slowly following the carriage comes a handful of life-size metal automatons wearing top hats and holding umbrellas. They continue their solemn, silent march through the cemetery gates as a lone young woman watches. This woman turns out to be your alter ego in the game, Kate Walker. Kate is an associate with the New York law firm of Marson and Lormont, and she's been sent all the way to Valadilene to secure a major business deal. Valadilene's one claim to fame is that it's served for centuries as the home of the Voralberg family, makers of exquisite clockwork toys, puppets, and automatons. While these marvelous mechanical creations have been sought by collectors and even emperors for centuries, the days of the Voralberg toys are seemingly numbered. Syberia plays out in the present day, and as such, electronic toys and video games are all the rage, and there's little demand for mechanical contrivances, however ornate and imaginative. Young people have been emigrating from Valadilene in growing numbers, seeking their fortunes elsewhere since there's no longer much work to be had at the Voralberg factory. As a matter of fact, Kate has arrived to facilitate the buyout of Voralberg Manufacturing by a massive and modern multinational competitor, the Universal Toy Company. While the sole remaining member of the Voralberg clan, the elderly Anna Voralberg, had already agreed to the takeover, things quickly go awry when Kate learns that the funeral procession she just witnessed was for Anna. However, Kate soon learns that there might be an heir, and a most unexpected one at that. Thus begins the real adventure of Syberia, as Kate travels to far-flung locales across Europe and Asia in search of this heir and the clues to his mysterious life. Syberia features animated characters moving against largely static yet gorgeous 2D backgrounds. You control Kate by simply moving the cursor and clicking once to make her walk to a location or twice to make her run. The cursor is context-sensitive, changing shape to let you know when you can investigate, manipulate, or pick up an item, or when you can speak with another character. This system and the inventory screens are largely intuitive and easy to use. Everything is just a point and a click away. When Kate encounters people during her journeys, she'll typically exchange a bit of dialogue with the other character. If the other character is more than just window dressing, so to speak, you'll get to instruct Kate to ask the character questions. Again, this is simply done--just click on one of a few possible topic choices listed on a notepad to hear what the character has to tell Kate. Overall, the dialogue tends to sound pretty convincing, despite the occasional poor translation, like ~hangover~ instead of ~holdover.~ At times, you'll hear some silly or clichd lines, to be sure, but the dialogue is certainly an enormous leap in quality over the barely coherent nonsense that we've seen in many other adventure games. You'll encounter some truly unusual characters throughout Syberia, like the crazed administrator of an abandoned Soviet industrial town who obsesses over an elderly opera soprano who once visited the town during its heyday. On one hand, some of Syberia's lesser characters seem more like caricatures than real people, and the fact that the voice-overs rarely rise above mediocrity doesn't help. On the other hand, the main characters receive much better treatment. Anna Voralberg's interesting life is fleshed out through a diary, a series of voice recordings, and flashbacks. You learn about Kate and her journey of self-discovery through other onscreen characters' reactions to her and from her cell phone conversations--some of which are very strained--with her fiance, boss, mother, and friend back in New York. These calls help ground Kate in reality while setting up an even greater contrast between her everyday life and the dreamlike settings and surreal predicaments she finds herself in. Despite its uneven character development and occasional clumsy plot twists, Syberia's melancholy story feels unusually rich, a true cut above the stories in most other games of this sort. As for the gameplay, Syberia is rather like the Voralberg family's toys--something of a pleasant holdover from a bygone age. Syberia, like most recent adventure games, is essentially an interactive picture book in which you need to solve puzzles or dilemmas before turning to the next chapter. The game offers a casual pace that will, depending on your disposition, either put you off or offer a bit of gaming that's relaxing yet extremely engaging. There are already plenty of games that require you to constantly run, shoot, fly, drive, or otherwise interact incessantly. It's nice to be able to stop and smell the virtual roses once in a while. For all that it does well, Syberia does include some of the potentially annoying elements that have come, for better or worse, to define the adventure genre. The first time Kate explores an area, it's a welcome thing to watch her slowly meander down a street, as it gives you time to savor the scene. At times, particularly in the somewhat tedious second act of the game, you'll have to make her walk through the same areas numerous times, which can grow old in a hurry. (Kate's surname, ~Walker,~ is certainly apropos.) On the other hand, Syberia sometimes displays a wry sense of humor about adventure-game clichs. You'll come upon a massive hedgerow maze stretching off into the distance, a sight sure to make you want to reach for the ~quit~ button to avoid having to struggle through such a potentially tiresome task. But you quickly learn that most of the maze is gated shut, and the object that you need there is very easily found. However, you'll sometimes need to look really closely at your surroundings if you want to find necessary objects and clues. Considering Syberia's visual beauty, that's not a completely terrible thing, and the game generally doesn't require nearly the level of pixel hunting you find in lesser adventure games. The challenges you'll face tend to revolve around simple and logical object manipulation or interactions with other characters. Early in the game, for instance, you'll need to figure out how to work a sort of automaton doorman. Fiddling with its mechanical levers gives you the impression that this device is supposed to look at whatever you put in its hand. This suggests a calling card or a certain document in Kate's possession that might do just as well. Other challenges you'll need to overcome before progressing to new areas simply involve some gaming common sense. When you first spot new characters, for instance, you should talk with them for clues or assistance. If you get some important news about Kate's assignment early on, call her boss back in New York using her cell phone. It's all fairly straightforward stuff, and the puzzles don't tend to be too tough overall. Rather, they offer just enough challenge keep you interested. Most importantly, Syberia's puzzles generally seem plausible, at least in the context of the game's dreamlike gameworld. They often shed light on its characters or the workings of the Voralberg toys, instead of just offering the totally arbitrary or silly challenges found in some adventure games. Just as importantly, the order and manner in which you complete many puzzles sometimes makes the game seem rather less linear than it actually is. It's certainly nice to feel like you're exploring a world rather than being led through it on a leash. And what a world it is. Visually, Syberia is always engaging and often enchanting, with many backdrops and cutscenes that demonstrate nothing less than sheer artistry. Syberia is one of those rare games that moves beyond entertainment and begins to encroach upon the realm of fine art. That's not to say it's burdened by the stuffy atmosphere of some hushed museum (though part of the game actually plays out in a museumlike university). Rather, Syberia's world is captivating to look at and explore, with a unique and unforgettable visual style. Around every corner, there's a gorgeous scene to relish or an almost otherworldly flight of fancy offered by the animated Voralberg toys and automatons. Indeed, it's the game's unique ambience that truly sets it apart. Valadilene and the Voralberg factory, for instance, seem like remnants of a nearly forgotten era, a little world where time stopped around the turn of the 20th century. A towering wrought-iron and glass railway station, for instance, calls to mind the proud stations of the Victorian era in Britain, while the Voralberg factory is a wonderland of fanciful industrial-age machinery driven by steam and gears. Outdoors, you're treated to equally beautiful scenes of high mountain trails with crystal-clear icy waters and stone bridges arching over small canals. All these scenes are further invigorated by just the right amount of background animation, like soaring birds, as well as simple but effective sound effects and an evocative musical score with themes that suit the locales. Syberia's beautiful and wonderfully imaginative world alone is enough to make the game worth your while, but when you also factor in the game's moving story, memorable characters, and enjoyable puzzles, you get a superb gaming experience. Syberia proves beyond a shadow of a doubt that the adventure game genre is still full of life."}