{"ref": "https://www.gamespot.com/reviews/spider-man-battle-for-new-york-review/1900-6163526/", "date": "December 20, 2006", "game_name": "Spider-Man: Battle for New York", "text": "It's amazing how one or two problems can totally ruin an otherwise decent game. The Game Boy Advance version of Spider-Man: Battle for New York wouldn't have won any praise for originality or for its audiovisual presentation, but it would have been a solid action romp, if only the hit detection weren't so broken and enemies weren't placed in surprise spots that make cheap damage the norm. For every moment you'll spend punching thugs and swinging through the air, you'll spend equal time being knocked back by hazards that aren't even close, being attacked by enemies you can't even see, and watching your attacks whiff. You can play through some levels as Spider-Man and others as Green Goblin. The overall design is solid, if unoriginal. You'll spend roughly half of the game's approximately 30 side-scrolling levels controlling Spider-Man and the other half controlling his nemesis, the Green Goblin. Goblin's levels focus on trashing the environment and beating up on S.H.I.E.L.D. agents, while Spidey's levels are more oriented around putting out fires and rescuing people. The two characters are also vastly different in what they're able to do. Spidey doesn't dole out a ton of damage or have much health, but he can use his webbing to trap enemies and swing through the air. Goblin, meanwhile, isn't very quick or agile, but he's built like a tank, his attacks are strong, and he can hurl explosive fireballs. Each level generally does a good job of balancing fisticuffs and exploration. While there's a fair amount of beating on cookie-cutter enemies, there's also a good amount of exploration, usually in the form of swinging between buildings, climbing up walls, and smashing through steel doors. Unfortunately, no matter how much skill you develop, getting through the levels is nearly impossible. First off, the hit detection is unreliable, and the hit zones for some hazards are too big. Punches and fireballs frequently pass through enemies, and when you try to jump over a bullet or swing over the top of a flaming pile of rubble, you'll take damage even if the hazard didn't come close to touching your character. To make matters worse, enemies and turrets are frequently positioned in spots whre you can't see them until you're right on top of them. Sometimes, a ball of energy will come flying toward you and warn you that there's an enemy lurking nearby. Many times, though, you'll end up face-to-face with something dangerous and have only a split second to react. As it is, the levels are loaded with hazards, and the game is set up such that you have to restart a level from the beginning when you run out of health. That's enough challenge to acclimate to without the broken hit detection and cruel hazard placement ratcheting up the frustration tenfold. Attacks often pass through enemies, and you'll frequently take damage from hazards that aren't actually touching your character. Adding a little insult to injury, the graphics and audio don't live up to the standards that were set by previous Spidey games on the GBA. A limited range of colors were used to paint the backgrounds and characters, probably to emulate the look of a comic book, but the result is that everything appears washed out and devoid of detail. Spider-Man and Green Goblin have a healthy variety of moves and animate fluidly, but enemies mainly just walk around and raise their weapons in robotic fashion. There's also not much happening in the background, apart from the occasional mound of fire or dangling electrical wire. The accompanying audio is similarly bland. Music and sound effects fit the action, but the music loops constantly, and the same few generic sound effects are heard over and over again. In some previous Spider-Man games, Spidey would yell out ~yeah,~ or civilians would voice a brief thank-you when he rescued them. Those recorded speech comments helped inject some life into the goings-on. In this game, there's not a peep to be heard from Spider-Man or the citizens of New York. When people shell out money for a Spider-Man game, they expect to bring home something that pleases the senses and can be played without incurring too much frustration. The GBA may not be a powerhouse with regard to hardware horsepower, but that doesn't fully explain why Spider-Man: Battle for New York looks and sounds as apathetic as it does. Worst of all, though, the crummy hit detection and poor placement of hazards transform what would otherwise be a straightforward action romp into minute after minute of cheap hits and unfair deaths."}