{"ref": "https://www.gamespot.com/reviews/dungeon-siege-legends-of-aranna-review/1900-6083528/", "date": "November 13, 2003", "game_name": "Dungeon Siege", "text": "More than a year and a half after its release, Dungeon Siege is still a game that provokes a mixed response from gamers. Microsoft's highly anticipated 3D Diablo-killer met with completely different reactions from different players, some of whom were highly impressed by the game's visuals and advanced artificial intelligence, and some of whom felt the game went overboard with the AI--which ended up doing most of work without direct involvement from the player. At any rate, clearly the game had some room for improvement, and one would hope that the significant time that elapsed between the original release and the release of the game's first expansion pack would have been spent addressing some of these issues. However, if you were expecting Dungeon Siege: Legends of Aranna to shatter the status quo, you're going to be disappointed. Legends is a 15- to 20-hour long expansion that packs more of the same type of dungeon-crawling gameplay from the original--with an emphasis on the ~crawling~ part. Welcome back to the world of Aranna. Some of the grumbling about Dungeon Siege stemmed from the fact that, while it's hardly a bad game, it is one that can get old quickly, depending on how much control you hand over to the AI. Since the AI handles most of the combat, by default, it's easy to feel like you're not doing much...in terms of actually doing anything. It didn't help that the levels were designed in a way that limited any sense of exploration or adventure, as most of them were just narrow, linear paths that you couldn't stray from. In essence, Dungeon Siege basically felt like the rail shooter of Diablo clones, with the added disadvantage that you weren't really doing anything besides watching your characters do all the cool stuff while you were left to smash ton of crates. And we mean a ton of them! Since Gas Powered Games and creator Chris Taylor are busy working on Dungeon Siege II, Mad Doc Software (Star Trek: Armada II and Empire Earth: The Art of Conquest) handled the yeoman's work on Legends of Aranna. Mad Doc played it safe with the expansion by sticking to the original formula and offering the obligatory new campaign, creatures, and items that are expected in an add-on. You still control a party of characters, slay monsters left and right, pick up lots of loot and gear, and then repeat the process over and over again. The campaign story in Legends should sound familiar to PC role-playing fans: An ancient evil has reawakened and seized the McGuffin it needs to take over the world. Naturally, your job is to neutralize this threat, and along the way you must discover whatever happened to your parents, who left you behind years ago. It's a fairly standard setup that quickly sets up the game, but it provides little motivation to keep you churning through the dungeons. As Legends was designed for beginning characters, you can't import your existing high-powered Dungeon Siege character, so you're basically starting from scratch once again. This will probably annoy Dungeon Siege fans who were hoping for an add-on campaign that would challenge their 40th- and 50th-level characters. It's a beholder-like creature but with laser beams! The level design remains true to the original; it still feels like you're being guided through the world with the designer holding your hand, as opposed to actually getting to explore the world on your own. It's somewhat frustrating because there are times when you'll feel that this could be a great engine if it actually presented you with a world that gave you choices on where you'd like to go, as in most other role-playing games. As you travel down the path, you'll run into groups of monsters every 50 yards or so. This is a Diablo clone, after all, so you'll cut through about a regiment or two's worth of monsters every hour, and though there's a huge variety of monsters in the game, it tends to throw waves of the same type of monsters at you at one time. The enemy AI in Legends remains as it was in Dungeon Siege; monsters will ignore you until you trigger them. Then they'll charge at you. There's no sense of actual intelligence or tactics by the enemy--or even awareness, for that matter. Combat only gets difficult when it overwhelms you with numbers, but the system is so easily manipulated that all you have to do is just trigger a small group of monsters and take care of them while the rest of their buddies stand idly by. After every battle, there's a ton of stuff on the ground to sort through. The party system is one of the strengths of Dungeon Siege versus Diablo, especially since Dungeon Siege is capable of creating a large and varied team. Of course, this can be a double-edged sword because it's possible to create a huge and powerful combat team that simply bulldozes through the entire game. You can pause the game during combat to give orders to your units, but, once your party is powerful enough, it's easier to let them hack-and-slash on their own. Your only real role during combat is deciding when to hit the healing potion button. The only time that pausing and giving orders actually plays a role is during the final boss fight and a few other boss engagements. Once again, the game throws a gazillion different items and weapons at you, each with its own unique characteristics. Unfortunately, it just feels like overload. In the overall scheme of things, does it really matter that one sword does 420 points of damage every 90 seconds while another does 425? There's no palpable sense of difference between a character with a melee skill of 14 and a melee skill of 15, so does it matter that this sword adds a plus-one to melee attacks? The sheer amount of detail is bound to please statistics hounds, but it doesn't make that much of a difference in gameplay for the rest of us. Multiplayer remains pretty much the same as the original Dungeon Siege, and players can set up a cooperative multiplayer server that they can explore as a group or separately. Legends plays relatively smoothly over the Internet, though we did notice a slight little stutter over a network game. The once-remarkable graphics still look rather impressive, and the combat retains that fluid and chaotic feel that reminds you why people loved the original game early on. The sound effects and music also remain top-notch. We were stunned, though, by some of the technical issues in the game. Legends refused to load properly on three different computers, and we used both Nvidia and ATI cards. With the Nvidia system, Legends loaded up to a blank screen. Meanwhile, on two separate ATI systems, it actually rebooted the computers! We managed to fix that by upgrading to the newest ATI drivers. However, we couldn't fix the problem we had with the Nvidia system--even with the latest drivers. If you somehow manage to get past these glaring problems, though, the rest of the game is stable and appears relatively bug-free. This is a serious problem, however, given that Nvidia and ATI are pretty much the only two brands that gamers use. A gigantic tentacle, or, ~When Plants Attack.~ Put it all together, and Legends turns out to be an exercise in tedium. There are whole stretches of the game when you're just steamrolling through monsters, smashing boxes, and then moving on to the next room so you can kill more of the same monsters and smash even more boxes. Repeat this about 20 or 30 times per chapter, and it begins to feel more like Dungeon Crawl rather than Dungeon Siege. Couple this with the game's frustrating hardware problems, and this is an expansion that you're better off skipping. Instead, we recommend that you wait for some of the promising mods that are being developed by the Dungeon Siege community, or you can just wait for Dungeon Siege II and hope that the next time around the gameplay will have more to offer. As you travel down the path, you'll run into groups of monsters every 50 yards or so. This is a Diablo clone, after all, so you'll cut through about a regiment or two's worth of monsters every hour, and though there's a huge variety of monsters in the game, it tends to throw waves of the same type of monsters at you at one time. The enemy AI in Legends remains as it was in Dungeon Siege; monsters will ignore you until you trigger them. Then they'll charge at you. There's no sense of actual intelligence or tactics by the enemy--or even awareness, for that matter. Combat only gets difficult when it overwhelms you with numbers, but the system is so easily manipulated that all you have to do is just trigger a small group of monsters and take care of them while the rest of their buddies stand idly by. After every battle, there's a ton of stuff on the ground to sort through. The party system is one of the strengths of Dungeon Siege versus Diablo, especially since Dungeon Siege is capable of creating a large and varied team. Of course, this can be a double-edged sword because it's possible to create a huge and powerful combat team that simply bulldozes through the entire game. You can pause the game during combat to give orders to your units, but, once your party is powerful enough, it's easier to let them hack-and-slash on their own. Your only real role during combat is deciding when to hit the healing potion button. The only time that pausing and giving orders actually plays a role is during the final boss fight and a few other boss engagements. Once again, the game throws a gazillion different items and weapons at you, each with its own unique characteristics. Unfortunately, it just feels like overload. In the overall scheme of things, does it really matter that one sword does 420 points of damage every 90 seconds while another does 425? There's no palpable sense of difference between a character with a melee skill of 14 and a melee skill of 15, so does it matter that this sword adds a plus-one to melee attacks? The sheer amount of detail is bound to please statistics hounds, but it doesn't make that much of a difference in gameplay for the rest of us. Multiplayer remains pretty much the same as the original Dungeon Siege, and players can set up a cooperative multiplayer server that they can explore as a group or separately. Legends plays relatively smoothly over the Internet, though we did notice a slight little stutter over a network game. The once-remarkable graphics still look rather impressive, and the combat retains that fluid and chaotic feel that reminds you why people loved the original game early on. The sound effects and music also remain top-notch. We were stunned, though, by some of the technical issues in the game. Legends refused to load properly on three different computers, and we used both Nvidia and ATI cards. With the Nvidia system, Legends loaded up to a blank screen. Meanwhile, on two separate ATI systems, it actually rebooted the computers! We managed to fix that by upgrading to the newest ATI drivers. However, we couldn't fix the problem we had with the Nvidia system--even with the latest drivers. If you somehow manage to get past these glaring problems, though, the rest of the game is stable and appears relatively bug-free. This is a serious problem, however, given that Nvidia and ATI are pretty much the only two brands that gamers use. A gigantic tentacle, or, ~When Plants Attack.~ Put it all together, and Legends turns out to be an exercise in tedium. There are whole stretches of the game when you're just steamrolling through monsters, smashing boxes, and then moving on to the next room so you can kill more of the same monsters and smash even more boxes. Repeat this about 20 or 30 times per chapter, and it begins to feel more like Dungeon Crawl rather than Dungeon Siege. Couple this with the game's frustrating hardware problems, and this is an expansion that you're better off skipping. Instead, we recommend that you wait for some of the promising mods that are being developed by the Dungeon Siege community, or you can just wait for Dungeon Siege II and hope that the next time around the gameplay will have more to offer."}