{"ref": "https://www.gamespot.com/reviews/the-moment-of-silence-review/1900-6141525/", "date": "December 19, 2005", "game_name": "The Moment of Silence", "text": "Tomorrow looks a lot like today in The Moment of Silence. This verbose adventure from House of Tales Entertainment may be set in a vaguely fascist America circa 2044, but you'd barely know it based on a lukewarm plot that never rises to potboiler temperatures. Character development, puzzles, and the look and sound of the game are all above average, although there is a certain superficiality to everything that prevents you from getting totally immersed in the story. In the future, there will be robots. Perhaps the biggest problem is a lack of buildup. The game starts abruptly, tossing you into the sneakers of despondent New York communications designer Peter Wright shortly after the death of his wife and son in a plane crash. This tragedy isn't the focus of the plot, though. Everything gets rolling after Peter's neighbor, a journalist by the name of Graham Oswald, is mysteriously abducted by what looks to be a police SWAT team. Only problem is that the cops have no record of bringing the man into custody. So you take on the task of finding him, and you'll soon get wrapped up in what plays out as a futuristic X-Files episode decked out with shadow government nastiness and intimations of ETs. This saga never gets beyond a Mulder and Scully rip-off, but House of Tales has put together an interesting future where the entire world is wired and Big Brother is watching you. Fossil- fuel consumption has been banned, so everyone gets around in satellite cabs. The Net has seemingly replaced all other forms of communication, to the point where Peter's contacts with other people come primarily via online chats and a super video-phone/PDA called a messenger. Big TV screens are even mounted on street corners and in homes, pumping out some kind of feel-good propaganda to the citizens. Unfortunately, the game scratches the surface of this believable world. It only hints at issues like censorship and government control in a tech-driven society before backing off so you can save the world in stereotypical adventure game fashion. Not enough attention has been paid to fine details, which means that the world of 2044 looks a lot like the world of 2005. And some of the niftier story aspects are ignored for odd trivia. So while you get The Jetsons-style names for candy bars and notice that the New York Knicks now exist as a computer simulation, nobody comments on the bizarre JumboTron propaganda videos that consist of nature scenes and stock footage like rocket ships blasting off. This is actually really disappointing, because there has to be a cool story behind the powers that be that are broadcasting what looks like outtakes from Koyaanisqatsi to the masses. This makes it difficult to think of The Moment of Silence as taking place in the future, and it can be jarring when something like a trip to the moon from JFK International Airport is presented as a mundane excursion. Far too many settings are sterile and remote, too. Downtown New York makes Dubuque, Iowa, look like a 24-hour carnival, and farther-flung locales, like the Arecibo SETI Institute in Puerto Rico, are even more deserted. Most scenes boast no more than two or three slack-jawed onlookers, and, even stranger for New York, no cars at all. Perhaps this is intentional, a way for the developers to emphasize a future world where everybody orders in food and sends instant messages all day. But since the absence of people on the streets is never mentioned, this just cheapens production values and calls attention to the fact that you're playing a game. Gameplay, however, is a pretty compelling blend of old-school pick-up-everything-that-isn't-nailed-down adventuring and more modern puzzle-solving in the tradition of Myst and its successors. As Peter, you collect objects, quiz the locals on tasks and objects, and solve brainteasers like inputting codes to power an elevator and figuring out how to point parabolic satellite dishes. Much of the game is fairly easy, although too many screens turn into pixel hunts where you need to find small objects like pills or cables, and too many quests are of the ~sure I'll get you the framistat if you give me the whatsit~ variety. You also need a lot of patience to get through the loads of conversation trees that need to be accessed to trigger new plot developments. Most characters in the game go on and on and have to be repeatedly prompted to get through all of their dialogue. And there are many moments--most notably Peter's interminably long encounter with the security robot in his office building--where you want to scream at the game to hurry the hell up. Some of these conversations are rather goofy, too, and they have been clearly put in place to build the plot rather than focus on realistic characters. Although, getting a geopolitical lecture from a guy running a newsstand is at least unintentionally funny. The look and sound of the game is impressive overall, negating some of the above quibbles. Visuals are a touch on the dated side, but no more so than in any other contemporary adventure. The only real irritant here is the lack of people and cars on the New York streets, as mentioned above. Voice acting is competent to very good, although the game is hampered with a dozy lead who at times sounds barely coherent enough to bag groceries, let alone unravel a nefarious global plot. The piano- and techno-based score sets a great noir mood, too. One good thing about life in New York City in 2044--there arent any traffic jams. Youre the only one on the block in most parts of the city. At times, the interface isn't quite up to the tasks at hand. The camera system often doesn't provide good views, so you have to walk around to make sure that you've spotted everything in a room. Objects have to be dragged onto non-player characters to move the plot and open up new conversation strands, which can result in you emptying your pockets to strangers in order to be sure that you aren't missing something. Many screens are so big that it takes nearly a minute to run from one side to another. And some scenes are pointless wastes of time, like when you have to wait while the elevator slowly moves up to Peter's 23rd-floor apartment every time he goes home, and during the card-swiping animation every time he hops into a cab. All in all, the design could have benefited from a lot more automation. Basically, The Moment of Silence is a near miss. It has virtually everything that fans want in adventures, including an interesting sci-fi story and sensible puzzles. But barren scenery, occasionally wonky plot development, and clogged-up mechanics make it something of an ambitious flop."}