{"ref": "https://www.gamespot.com/reviews/rumble-roses-review/1900-6113042/", "date": "November 12, 2004", "game_name": "Rumble Roses", "text": "The idea of an all-girl wrestling game based on the Yuke's SmackDown! engine sounded like a great concept. A wrestling game featuring women doing something other than the sort of halfhearted, lingerie-sporting slap fights you typically find on WWE television these days could have been a refreshing change of pace. Unfortunately, Rumble Roses, Konami's all-female grappler, doesn't pull it off. While the game's wrestling mechanics are sound, the game's overwrought method of titillation gets completely in the way of the action, and the game's campy-to-a-fault story mode is just plain terrible. Perhaps if there were more to the game beyond these obnoxious aspects, it might have fared better, but sadly, there isn't. Finally, a game that answers the age-old question of: 'How many panty shots can you fit into a wrestling game?' You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Rumble Roses Video Review There are 10 main combatants in Rumble Roses, each of which has an unlockable, alternate persona, making for about 20 playable characters in all. Each of the game's lovely ladies is based on one tired stereotype or another: there's the Ryu-like Reiko, determined and focused solely on her wrestling; the Texas-born cowgirl Dixie Clemets; and the dark and mysterious female ninja, Bloody Shadow. However, many of the other characters transcend mere stereotypes, and they actually seem to more closely represent a number of seedy fetishes. There's the disciplinarian school teacher; the naughty, pigtailed school girl; the deviant nurse (complete with plenty of medical-based puns); and the latex-sporting S&M slave, featuring the ultimate ~where in the hell did they come up with this?~ costume of the year. Each and every one of these girls is designed with one sole purpose: to give you as many T&A shots as possible. Every outfit features plenty of opportunities for panty shots, chest jiggling, and all manner of backside glances. After a while, the game almost ceases to be a wrestling game and instead resembles some sort of soft-core bunny brawl. To be fair, the game is absolutely honest about its intentions from the get-go, and it never aspires to be anything other than what it ultimately is. Unfortunately, all but the most sexually frustrated of players will probably quickly tire of staring at the repetitive and blatant boob shots after a while, as there really isn't much else to the game beyond them. There are only a few modes of play to choose from, including a basic exhibition match, an absolutely pathetic story mode (which we'll get to in a moment), and a gallery mode, where you can basically sit there, voyeuristically ogling a grappler of your choice while she sits in a locker room, stretching and gyrating in all sorts of downright creepy ways. The exhibition mode only features a basic single-versus-single match and a mud wrestling match. There are really no fundamental gameplay differences between the mud match and a normal match, though. The mud match looks horrible, like you're wrestling on some kind of thin, brown sheet of rubber that you can sink into. The only notable aspect of exhibition matches is that you can set up a number of ~vows~ for your wrestler to achieve before you wrestle. These vows play into a sort of face/heel rating that each wrestler has. So, if you want to boost your face status, set up a couple of face vows, like playing through a whole match without using weapons or taunting your opponent multiple times. The only reason this system exists is because in order to play a title match against the Rumble Roses champion, your face or heel meter has to be maxed out. Once you've done that for each wrestler, it never changes, so it's only useful until you've maxed out each wrestler. While the exhibition mode is certainly lacking, it looks like money in the bank compared to the game's story mode. The fact that this game even has a story at all is kind of silly to begin with, but the one it concocts for its characters is crazy. Basically, the nurse character, Anesthesia, is some sort of evil scientist who has created a powerful cyborg with DNA implanted from Kamikaze Rose, one of the most legendary female wrestlers of all time. Anesthesia is looking to take over the world, or something--actually, it's never really explained what the point of it all is (just that she's totally evil)--and you have to stop her; or something to that effect. Each character has its own little story to play through, and most of the stories are centered on other, specific characters. The school teacher is trying to track down one of her students (unsurprisingly, the naughty schoolgirl); Reiko is out to prove herself as a wrestler, and she is also on the hunt for her sister (Evil Rose, the bondage freak); and Anesthesia just kind of wants to either kill everyone or use them as donors for her cause. Eventually you'll find yourself tied up in this mess with Anesthesia and her cybernetic lady friend, Lady X, though that usually doesn't come into play until you're more toward the end. The whole thing plays out through a series of painfully terrible cutscenes, with dialogue that quickly goes from laughable to insufferable in a matter of about 30 minutes. In fact, 30 minutes is about all you'll need to beat each character's particular story, as each story only consists of about seven matches total--five if you're playing through as one of the alternate personas. Of course, in order to unlock the alternate personas and costumes, you'll have to play through every story--a much harder task than the relative brevity of each storyline would seem to suggest. The first character you pick, no matter who it is, will likely have you rolling in stitches through each horrible cutscene. But, once you've moved to the second character, it becomes decidedly less funny, and more and more pathetic, until eventually, you're barely through your fourth or fifth character's story before all the camp value totally wears off. The whole thing comes off like some kind of horrible crossover fan fiction that has been written by a teenage kid with an unhealthy obsession for WWE divas and really terrible anime, and it just doesn't work on any level. What is perhaps saddest of all is that deep down, Rumble Roses is a pretty good wrestling game. As mentioned before, the game uses a variation of the Yuke's SmackDown! engine, and despite being somewhat dumbed down from the standard engine, it's totally decent wrestling. Each wrestler has some basic strike combos and a number of grapple moves at her disposal as well as a few different special moves, including a ~humiliation move.~ Humiliation moves are sort of like unique submission holds, which can only be performed by filling up your opponent's humiliation meter, done by just beating up your opponent with specific moves from your repertoire. The moves featured in the game are far better than you're ever likely to see in American wrestling, including some really brutal, yet not totally over-the-top (save for, perhaps, the cyborg girl's moves) slams, pile drivers, and suplexes that look very cool. Unfortunately, the actual move sets for each girl are somewhat limited, so it won't take you long to encounter every move the game has to offer. There are some annoying gameplay issues to deal with, like occasionally spotty artificial intelligence, and a couple of moves that can fall into inescapable loops when executed with the right timing. Still, the actual grappling in the game is better than the rest of the game's content might lead you to expect. Graphically, there's no denying that Rumble Roses is an impressive-looking game. The character models are still extremely well made--if a bit proportionately improbable. Loads of detail has gone into the character modeling, from the faces right down to the smallest of details in the costumes. The game also animates smoothly, and save for some occasional clipping issues, much of the action moves quite seamlessly. There are, unfortunately, only four wrestling environments in the game, three of which are similar-looking arenas and the last is the badly designed mud pit. At the very least, the arenas are decent looking, and each wrestler has her own nicely choreographed and totally over-the-top entrance sequence that makes good use of the scenery. Wrestling fans might appreciate the game's fully decent wrestling engine, but they probably won't appreciate much else. On the other hand, Rumble Roses' sound design pretty much falls flat. As we said previously, the voice acting in the game goes well beyond the realm of atrocious. These are just random girls with no previous knowledge of the script, and they're just reading lines off of paper, and poorly at that. Actually, we only hope this is the case, because if it isn't, then somehow Konami managed to track down the most horrifically bad voice actresses working in the business today. Granted, the script that the actresses were given isn't any good either, but the acting itself is definitely the worse of the two. The rest of the game audio isn't quite as bad as the voice acting, but none of it is good. The in-ring sound effects are mostly tinny and generic, and the soundtrack is made up of a lot of weird J-pop and J-rock songs, some of which are interpretations of songs like Van Halen's ~Hot for Teacher~ and David Lee Roth's ~Yankee Rose.~ Those songs are great and everything, but these versions are most certainly not. If you had to compare Rumble Roses to anything at all, it would basically be the gaming equivalent to one of those naked lady novelty pens you buy at gas stations as a dumb gag gift. There are certainly ways to make a game titillating without pushing it totally over the line, but Rumble Roses doesn't seem to be aware of this. Plus, when you factor in the unlikable story mode and the fact that it will only take you a few matches to pretty much see everything the game has to offer, it becomes readily apparent that Rumble Roses simply doesn't come together as a particularly appealing product. It's a shame too, because the wrestling and graphical engines the game employs are both decent, but there are just too many aggravating things in the game to have to sift through before you can even begin to truly appreciate either the actual wrestling or the graphics. If nothing else, Rumble Roses is proof that you can make a mechanically sound game, yet still miss the mark."}