{"ref": "https://www.gamespot.com/reviews/art-of-fighting-anthology-review/1900-6171986/", "date": "June 22, 2007", "game_name": "Art of Fighting Anthology", "text": "It's well known that Capcom's 1991 arcade classic Street Fighter II made one-on-one fighting games the phenomenon they were back in the '90s. But developer and NeoGeo hardware creator SNK also released several sprite-based 2D fighting games of its own, eventually garnering a loyal following by creating fighting games with a unique sense of style. The Art of Fighting series, which arguably stressed innovation over solid gameplay, was among that portfolio of great fighting games--but the games in this series never enjoyed the success and notoriety of SNK's King of Fighters and Samurai Shodown. Unfortunately, time has passed, and many more-evolved, better-balanced fighting games have since been released, so the series doesn't hold up very well in 2007--especially not in the bare-bones Art of Fighting Anthology for the PS2. Though they have some old-school arcade game appeal, the Art of Fighting games generally haven't aged well. Sadly, the fact that the Art of Fighting series was one of the real innovators in the world of fighting games is little known. Game features that fighting game enthusiasts have come to expect from their favorite games, such as taunting, character-specific introduction sequences, and yes, even ~super moves,~ first made their debut in the original Art of Fighting from 1992. The first two Art of Fighting games also featured bodily damage on characters as the fight progressed, and all three games featured one of the most infamously misunderstood gameplay systems of all time, the ~spirit meter,~ which at once prevented players from repeatedly abusing powerful ~special~ maneuvers...but also caused these maneuvers to fizzle out once your meter was empty. This effect was later parodied by Capcom in that company's most unwittingly popular fighting game character, Dan Hibiki, a weakling who wasn't able to hurl an energy projectile attack across the entire screen. History aside, once you pop your Art of Fighting Anthology disc into your PS2, you'll find that these games just haven't held up well. The collection offers the three games in the series (Art of Fighting, Art of Fighting 2, and Art of Fighting 3) as no-frills emulated versions of the original NeoGeo games. The first Art of Fighting game lets you play only as one of the series' two main characters, Ryo Sakazaki or Robert Garcia, in single-player mode, and the control scheme is extremely clunky and unresponsive. It's likely that most discerning fighting game fans might find the first Art of Fighting game to be all but unplayable--and they'll likely have trouble with 1994's Art of Fighting 2 as well. Unlike conventional fighting games, which often emphasize memorized combinations of attacks, Art of Fighting 2 focuses on smart use of normal attacks and carefully managing your spirit meter by charging and taunting. But both the first and the second game feature heavy use of the scrolling and zooming camera effects that were hallmarks of the NeoGeo hardware--yet these effects make both games feel jerky and stilted. Art of Fighting 2's single-player game is also insanely difficult unless you exploit certain patterns in your enemies' behavior, which means that the second game in the anthology is also pretty much a losing proposition for most fighting game enthusiasts. Like the previous games in the series, Art of Fighting 3 is very different from conventional fighting games, but it also breaks away from the previous two games in the series with a brand-new look and feel. The third game does away with the bodily damage and jerky camera cuts of the previous games and instead offers up a completely new game system based on multiple attacks strung together, as well as on ~juggle~ attacks you perform after launching your opponent in the air. Also, unlike almost any other 2D fighting game ever made, Art of Fighting 3 featured three levels of attacks (high, low, and mid), with mid attacks that can't be defended while crouching. This makes the game much closer to something like the 3D polygonal game Tekken than to any other 2D fighting game. This fighting system, while interesting, definitely carries a learning curve that many players may not find worthwhile, because although Art of Fighting 3 had the best animation quality in the series, the game's fluid, almost slippery animation doesn't pack much of a punch. Also, Art of Fighting 3 was clearly released in an unfinished state back in 1996; only Robert and Ryo have ending sequences, and many characters lack dialogue. If you had played the game 10 years ago on the NeoGeo, you would've gotten the sense that it could've used some more time in the oven; you'll feel the same way playing it on your PS2 now. Art of Fighting 3 features fluid animation and a great soundtrack, but the game is clearly unfinished. Despite the gameplay issues with the series, time seems to have been a bit kinder to its presentation. The games all have a bright, colorful look, and the characters in each game are huge onscreen compared to the smaller sprites you may have come to expect from the Street Fighter and King of Fighters games. The first two games also feature upbeat music that may bring back nostalgic memories of any time you might've spent in arcades. The first two games even have simple ~bonus~ minigames between rounds, like those older arcade fighting games of yore. Also, Art of Fighting 2's single-player game, which features prefight dialogue between your character and the opponent, has some of the snappiest patter you could find in a video game from the 1990s (and at that period, many of SNK's games had extremely funny, clever dialogue, so that's saying a lot). However, all three games also have some minor translation issues that you may find either annoying or ironically funny. All three games can be played either with the original arcade soundtrack or the arrange soundtrack that appeared on the CD-based home versions of the games. Art of Fighting 3's arrange soundtrack features an amazing, eclectic combination of straight-ahead jazz, salsa, world music, rock and roll, and blues that fits remarkably well with the game's premise of a side story in which Robert and Ryo take a trip south of the border to Mexico. Unfortunately, this minimalist collection features only the three games emulated directly from original NeoGeo versions, and barely anything in the way of extras. It does let you switch between the original arcade soundtrack and the arrange soundtrack as mentioned, and it has a throwaway option that lets you edit color palettes for your characters in Art of Fighting 2. That's it. There are no additional play modes for any of the games, such as a survivor mode or training mode, and no extras--SNK Playmore could've included the hilariously campy Japanese TV commercials for each game, for instance--so this collection just offers the bare minimum of content for a series that really could've used some window dressing. As it stands, Art of Fighting Anthology is really only for fighting game historians or loyal SNK fans looking to add to their collection. Despite the game's budget price tag, there are other, better choices for fighting game enthusiasts. Editor's Note: This review previously contained incorrect information about an in-game reset option, and about Art of Fighting 3's characters. GameSpot regrets the error."}