{"ref": "https://www.gamespot.com/reviews/skies-of-arcadia-review/1900-2641052/", "date": "October 16, 2000", "game_name": "Skies of Arcadia", "text": "In its first year of life, Sega's Dreamcast has offered something for nearly every type of game player. Fans of fighting games got the remarkable Soul Calibur at the system's release. Old favorites such as Sonic and Rayman have satisfied players who like platform action games. Even original games like Seaman and Chu-Chu Rocket, which defy simple classification, have found their audiences. But in the midst of the steady supply of high-quality games for the Dreamcast, there hasn't been a great role-playing game until now. There hasn't been anything on the order of Final Fantasy for the Dreamcast until Skies of Arcadia. Skies of Arcadia is a classical role-playing game at its very core, and it uses a lot of the conventions you may be used to. Its hero is Vyse, a valiant but mischievous young air pirate who sails the skies of Arcadia with his pirate clan, the Blue Rogues. Arcadia is an unusual land - its continents are actually giant landmasses suspended high up in the sky, and magic-powered sailing ships are used by its inhabitants to traverse the vast expanses between these islands. As Skies of Arcadia opens, Vyse and his friend Aika come upon a small, defenseless ship under attack by one of the warships of Arcadia's big, bad empire, Valua. It seems the pilot of this tiny ship is of great interest to Valua's ruler, and rather than watch the girl fall into evil hands, Vyse and Aika get to her first. They underestimate the stranger's importance, and by rescuing her, they involve themselves in an epic plot that threatens the existence of their entire world. Such a setup is par for the course. Initially, so is the rest of the game. The first couple of plot sequences give the impression that Skies of Arcadia is merely a standard, derivative role-playing game that's just like countless others. But Skies of Arcadia quickly takes off, and the further it progresses, the more impressive it becomes. What seems like a straightforward story soon becomes much more interesting, and it begins to take many unexpected turns as Vyse and his companions are whisked off to lush new areas. Skies of Arcadia's environments seem like some of the most painstakingly detailed ever seen in a role-playing game. For instance, its first dungeon is an old temple surrounded by a large moat. A falling meteorite has opened a hole in the temple's side that has allowed in a lot of the moat's water, so the interior is flooded. It's up to Vyse and Aika to drain the temple and retrieve the precious moonstone that caused the damage. This lavish flooded temple provides just a sample of the even more impressive areas that follow. Such intricate and graphically impressive dungeon designs prevail throughout Skies of Arcadia, and each dungeon is more satisfying to play than the last. Fortunately, the game's many towns are just as beautiful as its dungeons. Rather than use the conventional overhead perspective of most role-playing games, Skies of Arcadia uses a third-person chase camera view that's more common to action games like Mario 64. This third-person view works great for navigating the game's towns and dungeons, and it lets you see a lot more detail in the surrounding environments.A fundamental component of most any console role-playing game is random monster encounters, and Skies of Arcadia has them in droves. At first, the battles seem to occur in excess. Vyse and crew can be attacked at any time while flying a ship through the skies, as well as while traveling in dungeons or certain other locations. But as the party gains experience, it will gain special attacks that make the flow of battle much smoother, thereby alleviating the stress that comes with the constant random attacks. These supermoves use spirit points, a concept very similar to the supermeters found in many fighting games. As the party does battle, the spirit meter charges up, and supermoves can be performed based on the amount of spirit charged up. Magic and other special attacks also require small amounts of spirit, and so the spirit meter becomes the centerpiece of the Skies of Arcadia battle system. Otherwise, the game's battles are fairly run-of-the-mill - there's elemental magic and a variety of weapons and armor to use against enemies. The many different attacks and spell combinations remain interesting throughout the game. Skies of Arcadia is the product of a legacy of role-playing games that hearkens back to Sega's earliest days in the home console market. The game's developer, Overworks, was responsible for the first, second, and fourth games in Sega's classic Phantasy Star series, which is partly why Skies of Arcadia got so much attention when it was first announced last year. Yet the game lives up the high expectations. It's the Dreamcast role-playing game you've been waiting for. A fundamental component of most any console role-playing game is random monster encounters, and Skies of Arcadia has them in droves. At first, the battles seem to occur in excess. Vyse and crew can be attacked at any time while flying a ship through the skies, as well as while traveling in dungeons or certain other locations. But as the party gains experience, it will gain special attacks that make the flow of battle much smoother, thereby alleviating the stress that comes with the constant random attacks. These supermoves use spirit points, a concept very similar to the supermeters found in many fighting games. As the party does battle, the spirit meter charges up, and supermoves can be performed based on the amount of spirit charged up. Magic and other special attacks also require small amounts of spirit, and so the spirit meter becomes the centerpiece of the Skies of Arcadia battle system. Otherwise, the game's battles are fairly run-of-the-mill - there's elemental magic and a variety of weapons and armor to use against enemies. The many different attacks and spell combinations remain interesting throughout the game. Skies of Arcadia is the product of a legacy of role-playing games that hearkens back to Sega's earliest days in the home console market. The game's developer, Overworks, was responsible for the first, second, and fourth games in Sega's classic Phantasy Star series, which is partly why Skies of Arcadia got so much attention when it was first announced last year. Yet the game lives up the high expectations. It's the Dreamcast role-playing game you've been waiting for."}