{"ref": "https://www.gamespot.com/reviews/galaga-review/1900-6169166/", "date": "April 16, 2007", "game_name": "Galaga", "text": "Galaga's most famous form is as a classic arcade shooter that built upon Namco's Galaxian, which, of course, built on Taito's Space Invaders. Galaga has been reissued for Nintendo's Wii as part of the downloadable Virtual Console service. But this is one of those cases where you wish that it were called the Virtual Arcade service, because playing the subpar NES port of Galaga only makes you want to play the arcade version that much more. No--for the last time, there's no way to combine all three ships into some kind of crazy triple ship. It's not that the emulation is inaccurate. Nope, this seems to be the same version of Galaga that Bandai and Namco teamed up to release in the US with the needless subtitle ~Demons of Death~ attached to it. And most of the arcade gameplay is intact. Alien craft dive-bomb in your ship's direction, laying down bullets all the while. And the nefarious leaders can cruise down and attempt to capture your ship, turning it against you. Of course, that's where you really turn the tables on the invaders by freeing your captured ship and docking it with another, giving you double firepower. The challenging stages-- bonus levels that ask you to shoot down waves of nonfiring enemy ships that approach in formation--are also intact. While it sounds good on paper, the execution was lacking back in the 1980s, and it's still lacking today. Enemy movement doesn't look smooth at all. The sound gets the same basic notes down, but the NES hardware sounds more stripped-down than that of the original arcade game. So, yes, this is a complete port of the arcade game, but none of it captures the feel of the arcade game. The result is a passable shooter that comes across as completely ordinary and charmless, devoid of the nostalgia that makes the coin-op game worth playing today. You could probably spend 500 Wii points in a more careless fashion, but this one's definitely down toward the bottom of the list. If you're absolutely bent on playing Galaga on your Wii, you're going to have trouble finding something that's absolutely perfect, but your best bet is to sidestep this pale imitator and get something a little closer to the real deal, which is contained on Namco Museum 50th Anniversary for the GameCube."}