{"ref": "https://www.gamespot.com/reviews/fullmetal-alchemist-and-the-broken-angel-review/1900-6116567/", "date": "January 18, 2005", "game_name": "Fullmetal Alchemist and the Broken Angel", "text": "Fullmetal Alchemist and the Broken Angel brings the recent anime hit to the PlayStation 2 as an action role-playing game. While the temperamental Edward and his patient, tragically transmuted brother Alphonse bring some of the series' personality to the game, some awkward controls and the lack of any real challenge or longevity relegate this title to rental status at best. The brothers Elric team up for some alchemical mayhem. The Elric brothers are young, gifted alchemists, individuals with the power to transmute common objects into a variety of different creations. Trouble came when they attempted a forbidden human transmutation to try to resurrect their deceased mother. As a result, Edward lost both an arm and a leg (now replaced by the metal auto mail), and Alphonse lost his whole body, his soul now transmuted into a giant suit of armor. The siblings are out to find the fabled Philosopher's Stone, which is said to have the power to restore their bodies to normal. The game operates as an enclosed side story to the series' narrative, and between the text-dialogue cutscenes and the occasional scene of voiced FMV-animated sequences, there's quite a lot of exposition to break up the action. You'll be reading and watching events unfold nearly as much as you'll be participating in them. The main combatant here is Edward, who plies his alchemy skills against waves of enemies with stalwart Alphonse in tow. Ed can leap and strike at his foes with his bladed metal arm, and you can charge his alchemical abilities by holding down the circle button. You can use those abilities to pound enemies with a sudden outburst of magic (science?), or you can transmute objects in Ed's vicinity into a variety of weapons and other items. Depending on the level of alchemy you use, you can change objects like crates, signposts, and garbage cans into cannons, swords, lances, flamethrowers, bombs, gun turrets, and more. The levels are frequently densely littered with such items, so transmuting and grabbing a new weapon for Ed or Al is often possible and allows for some variety in how you assail large packs of enemies. However, your opponents in the game are, in the great majority, brainless. Even without a powerful alchemical arsenal, you can frequently paste the majority of your foes simply using Ed's most basic abilities. The areas in the game feature a wholly linear layout, so it's just a matter of getting from point A to point B while erasing enemies that tend to show up in crowds. Fighting and defeating enemies earn experience points and accessory items that you can use to level up and refine Ed and Al to make them even stronger. You don't directly control Alphonse, the hulking giant who speaks meekly and follows his brother around everywhere. You have three commands you can issue to Al: you can call him to you, you can order him to perform a driving tackle on enemies, and you can instruct him to guard you. It's a good thing that Al is so big and strong, because his artificial intelligence isn't particularly good; he moves sluggishly, he tends not to attack nearby enemies very aggressively, and his tackle ability is unreliable. The button you use to order Al around (R1) often can't be used in conjunction with your normal string of attacks, so you'll have to pause to get him to come closer or to ask him to tackle. The tackle itself doesn't seem to auto-target, and frequently you'll order Al to perform this attack, only to have him shoulder-slam his way into a nearby wall, well past any monsters. One thing the lump of metal is good for, though, is for the combo attacks he can perform with Ed. These are sweeping, deadly attacks that pummel every foe within a certain radius, and they're great for wiping out the mindless crowds you'll inevitably be surrounded by on your way to the next cutscene. There's a reasonable variety to the places you'll visit in Fullmetal Alchemist, but for the most part, all the caves, train yards, cathedrals, and countryside you'll roam have a very spare, basic look to them. The humanoid enemies you meet all look like they were cut from either the ~skinny henchman~ or ~bulky henchman~ cloth, but the chimera (monsters created by alchemy) you'll face have enough crazy creature combinations to make them pretty cool to look at. Visually, the effects shine mostly in the combo attacks by Ed and Al; they tend to spike nearby enemies in quite a satisfactory fashion. Otherwise, though, the game doesn't provide very much graphical flair. Enemies challenge you only with sheer numbers; they're all dumb as rocks. Ed and Al have a small number of voice clips for certain battle actions, and by the time you've beaten the first couple of levels, you've have heard them far too much. The only spoken dialogue in the game is during the animated cutscenes, and the delivery of such is fairly solid, without any real horrors or bright points to speak of. While you won't find yourself humming much of the music in the game, what music there is shapes itself to the action well--though there's a very limited variety of it. Fullmetal Alchemist can be beaten handily in about 15 hours or so, and much of that time is spent waxing thoughtless streams of unchallenging opponents as you steadily move through each linear area. The transmutations you can perform give this game an interesting twist, but with few strategic applications for them, they lose their novelty fairly quickly. The Fullmetal Alchemist anime is gaining in popularity, but aside from some amusing interplay between Ed and Al, this game is a bland use of the license. Fans of the show (and those of mindless hack-'em-ups) who are determined to give this game a try will be served better by a rental than a purchase."}