{"ref": "https://www.gamespot.com/reviews/star-wars-starfighter-review/1900-2687127/", "date": "February 16, 2001", "game_name": "Star Wars: Starfighter", "text": "Star Wars Starfighter is LucasArts' first title for the PlayStation 2. The game takes the concepts put forth in the company's N64 Star Wars games--Rogue Squadron and Battle for Naboo--and kicks them up a notch, adding a deeper, more enjoyable story, more solidified flight mechanics, and, of course, spectacular graphics. Starfighter's storyline runs concurrently with the events that took place in Star Wars: Episode I, but rather than focus on the existing story from the movie, Starfighter instead tells the tale of three unlikely allies united by a common foe, the evil Trade Federation. The three lead characters, created specifically for the game, are the rookie Naboo fighter pilot Rhys Dallows, a female mercenary named Vana Sage, and Nym the pirate. The story is quick to jump from one pilot to another as you progress through the game's 14 missions, which is initially very confusing. But as you move toward the later levels, the story's loose ends tie up rather nicely, and the resulting story is a fairly good one. Starfighter is a mission-based game. Each level opens with a set of objectives, and you'll typically be given a new objective or two as the level progresses. Mission objectives range from destroying shield generators to conducting rescue operations and protecting all sorts of carriers and bases. In fact, the game seems to gravitate more toward defensive missions than offensive missions, especially in the first half. Each mission also has a set of bonus goals, which, if completed, earn you medals. Earning medals unlocks bonus missions, such as fighter and bomber training, which take place outside of the main storyline. Each mission has three difficulty settings, and they're accurately named. The easy difficulty is an absolute cakewalk right up until the last mission, and the hard mode is an excellent challenge in the later missions. Craft control in Starfighter is a lot more stripped down than the control in most space sims. Each ship has two weapons, basic targeting, and a no-frills HUD that points you at your next target and gives you stats on your shield and hull strength. Boost and brake buttons take you between each of your ship's three speeds, and an auto-level button quickly rights your craft when you're upside-down. All three ships turn pretty slowly, which is understandable for Nym's bulky bomber, but Rhys' Naboo fighter, which is built for superiority against flying targets, can't spin around fast enough when dogfighting. Boosting then braking lets you gain some turning speed by powersliding, which makes up for a bit of the deficiency and can be useful in the tight trenches of the canyon levels or the small passageways in the game's final mission. You can also order your wingmen around with four commands--status, attack, defend, and cancel previous order. The wingmen are extremely useful, but the two or three voice responses they'll give you after every order will become extremely annoying after only a couple of missions.While there's something to be said for the no-frills, almost arcade-style approach of Starfighter, a few too many corners have been cut. While the game has an arrow that will point you toward objectives, there is no radar screen in the game. Given the game's slant toward defensive missions, knowing where the item you're supposed to be defending is and knowing where all the enemy craft are is vital. Also, there's no easy way to know how many enemies are in the area. For instance, one mission has you defending a base that is under assault by tons of different enemies. However, the most dangerous type of enemy in the group is the bombers. You'll hear radio chatter warning you of new bombers in the area, but since there's no way to know where they're coming from, you have to hit the triangle button over and over again, cycling through 10 or 20 targets, just to find the bombers. Needless to say, the flaws in the targeting system can waste valuable time. Starfighter has both deep-space and planet-surface missions. The deep-space missions look amazing, some of them featuring planets, asteroid fields, and other great-looking objects. The planet missions usually look pretty good, though a couple of them suffer from repetitive textures and some pretty close pop-up. Also, the planet missions place an annoying invisible ceiling above the planet's surface. You can see and shoot the enemy dropships that are above the ceiling, but you'll only crash against the boundary if you try to get up close and personal. The soundtrack has that typical Star Wars flair. The music is great, the sound effects are exactly what you'd expect from a Star Wars game, and the voice work is pretty good, as well. When all is said and done, space sims come down to two variables: mission design and control. While Starfighter could have used a little more polish in both departments, the game presents a compelling story, excellent presentation, and gameplay that will surely satisfy fans of LucasArts' N64 shooters."}