{"ref": "https://www.gamespot.com/reviews/counter-strike-condition-zero/1900-6092063/", "date": "March 23, 2004", "game_name": "Counter-Strike: Condition Zero", "text": "When Counter-Strike: Condition Zero was first announced three years ago, it seemed like a decent enough idea. The definitive first-person shooter mod was at the height of its popularity, so having a single-player game based on the winning formula sounded like a good way to win a new following and perhaps entice even more people to venture online. However, those who have been reading up on the game over the years know that development has been a bumpy ride. The duty of making Condition Zero has practically been passed around more than the collection basket at Easter Mass. What started internally at Valve Software quickly moved to Gearbox, then to Ritual Entertainment, and finally over to Turtle Rock Studios. Given such an unusual development path, Condition Zero is surprisingly enjoyable, thanks mostly to some remarkable artificial intelligence. Unfortunately, the game will be remembered as a victim of its own delays. While the core gameplay is timeless, Condition Zero's release is overshadowed by no fewer than three technologically advanced, highly anticipated shooters, which all cast a harsh light on what is essentially a 6-year-old game--albeit a classic one. Bombing maps are one of the classic gameplay types available in Condition Zero. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Counter-Strike: Condition Zero Video Review By now, most FPS fans at least know what Counter-Strike is and have likely played it or have seen it. For those of you who have recently been paroled from a lengthy incarceration or have awakened from a coma, Counter-Strike is a team-based tactical shooter that pits terrorists versus counterterrorists in round-based match play. In the game's current incarnation, there are two game types--bombing and hostage rescue. Bombing maps require the terrorist team to plant and detonate a time bomb in one of two bombing areas while the counterterrorists guard these sites. Hostage rescue involves having the terrorists guard computer-controlled civilians while the counterterrorists try to rescue them. In practice, both game types often result in one team or the other being eliminated in bloody, fast shoot-outs. Players earn money based on their performances in the previous rounds, and with this money, they can buy weapons at the beginning of each subsequent round (and those who survive the last round keep their guns). The game's arsenal is based on real-life weapons, including Desert Eagle pistols, pump-action shotguns, AK-47 assault rifles, and even some exotic equipment, like tactical shields that deflect bullets. Single-player Condition Zero is just like the multiplayer version of Counter-Strike that's been played for years, only your teammates and the enemies are replaced by computer-controlled bots. You assume the role of the commander of a counterterrorist force, and you choose your teammates from a menu of named bots. The bots vary in skill, aggressiveness, choice of weapon, and tendency to cooperate with the rest of the team. Those with greater skill and more-powerful weapons cost more points to hire, but you'll earn points steadily as you make your way through the game's campaign. You'll choose your teammates from a menu before each map. The campaign is divided into six ~tours of duty,~ each of which consists of three maps, thus offering you a total of 18 maps for gameplay. Most of the maps are drawn from Counter-Strike's classic collection, so veterans will be familiar with classics such as Dust, Aztec, and Italy. Some of the maps have been tweaked greatly, however. For example, Militia is now vastly different from the map longtime CS players are familiar with. The above-land approach from the counterterrorist spawn area to the house has been shortened and adorned with additional rocks to hide behind, thus making life more difficult for terrorist snipers. A handful of new maps have also been included, like Stadium, a multilevel demolitions map that features a lot of narrow hallways and stairwells. Fastline should also be new to PC players, since it was borrowed from the Xbox version of Counter-Strike. It's a very small bombing map, set in a Tokyo subway, that encourages quick rounds and a frenetic pace. Beating each map requires you to win at least three rounds against the terrorists, and you must be ahead of the terrorists by at least two successive wins while also completing a number of special challenges. These challenges usually involve getting a certain total number of kills, getting kills with a specific weapon, rescuing hostages, and/or winning a round under a certain amount of time. You don't have to complete all these challenges within the three rounds, so if you're beating the terrorists 3-1 and still have a challenge left unfulfilled, the match will continue until you've satisfied all the requirements. The challenges vary with the difficulty level, as does the rate at which the terrorist team ramps up in skill and number. At the easiest difficulty level, you'll have few prerequisites, and the ones that are there are simple to accomplish. At the expert difficulty level, however, you'll be asked to perform some particularly tough feats, such as getting a knife kill and surviving the same round. For veterans of CS, the normal difficulty level won't be much of a challenge, but the two higher difficulty levels offer some pretty decent challenges, thanks to the surprisingly good bot AI. The bots are surprisingly lifelike in Condition Zero. The bot AI in most first-person shooters is laughably bad. Counter-Strike provides even more challenges for programmers who are attempting to design capable bots because of the relatively complex tasks these bots must perform. At any rate, we were pleasantly surprised by how clever the bots on both sides were in Condition Zero. Teammates communicate with you constantly by voice by telling you where they are, what they're doing, and if they've spotted an enemy. If the bomb carrier falls, bot CTs know to camp the dropped bomb, and the remaining terrorists are aware that they need to pick up the bomb to complete the mission. Terrorists on hostage rescue maps know that once a certain amount of time has elapsed, patrolling or camping hostage rescue points is an important strategy. They'll also plant bombs behind boxes and other defensible positions. All the bots seem to be programmed to know each map intimately and will crouch on top of good spots or will lie in wait behind strategic corners, just like an experienced human player would. Even more remarkable is that you'll see bots breaking windows and jumping down from high ledges to purposely reach other areas more quickly--even at the expense of incurring a bit of falling damage. The bots aren't infallible, though. Occasionally you'll spot one getting hung up temporarily on some geometry. We've also seen the terrorist bots abandon planted bombs, thus allowing CTs to sneak in and defuse them without a fight. To be fair, we've also seen many human players make the same boneheaded mistakes over the years. Overall, the bots are remarkably human--and varied--in their behaviors. Some teammates will respond to your commands, while others insist on forging their own paths, which isn't terribly different from human teammates either. It's too bad there's no way to play as the terrorist side on these maps, but assuming you're willing to retry the game on higher difficulty settings after beating it on normal, there's decent value here. Adding to the game's aesthetic significance is the fact that a special ~deleted scenes~ mode has been included. These deleted scenes actually comprised the single-player campaign that Ritual was working on before game development was handed off to Turtle Rock. While the 12 missions here are pretty fleshed-out--with scripted sequences and dense amounts of action--the deleted scenes, as a whole, feel like clichs. To anyone who's played shooters for years, the deleted scenes seem like flashbacks to the shooters of 1999 and 2000, so you'll immediately know why Ritual's project was canceled. While it's nice to have this extra content, your decision on whether to buy Condition Zero shouldn't hinge on it. The deleted scenes aren't a bad way to kill time if you have nothing else to play, but they're certainly not great. As far as multiplayer goes, the game is the same Counter-Strike that most of us have been playing for years. There's not much else to say about it other than that it's still the world's most popular shooter for a very good reason--it's got a classic, timeless design. However, the fact remains that it's still a freely downloadable mod for Half-Life owners, so it's difficult to say that multiplayer here is much of a value-added element. The highlight of Counter-Strike: Condition Zero is clearly the bot AI. The bot behavior, while not perfect, is remarkably lifelike. And at the higher difficulty settings, it will provide at least a decent challenge for most shooter fans. Unfortunately, you're limited to playing as the counterterrorist side in the tour of duty campaign. While some maps have been prettied up a bit, the graphics are still basically the same as ever, which is to say, they're dated. At least the sound has held up well and is still great. In the end, Condition Zero is a product that will appeal most to those players who haven't tried CS yet (and how many of them are there?), those who don't want to deal with the hassles of playing the game online, and those who just want to have some offline practice. For those of you who are already playing Counter-Strike online (let alone finished with playing Counter-Strike online), there isn't much reason for you to own Condition Zero, because it's basically the same thing you're already playing. The challenges vary with the difficulty level, as does the rate at which the terrorist team ramps up in skill and number. At the easiest difficulty level, you'll have few prerequisites, and the ones that are there are simple to accomplish. At the expert difficulty level, however, you'll be asked to perform some particularly tough feats, such as getting a knife kill and surviving the same round. For veterans of CS, the normal difficulty level won't be much of a challenge, but the two higher difficulty levels offer some pretty decent challenges, thanks to the surprisingly good bot AI. The bots are surprisingly lifelike in Condition Zero. The bot AI in most first-person shooters is laughably bad. Counter-Strike provides even more challenges for programmers who are attempting to design capable bots because of the relatively complex tasks these bots must perform. At any rate, we were pleasantly surprised by how clever the bots on both sides were in Condition Zero. Teammates communicate with you constantly by voice by telling you where they are, what they're doing, and if they've spotted an enemy. If the bomb carrier falls, bot CTs know to camp the dropped bomb, and the remaining terrorists are aware that they need to pick up the bomb to complete the mission. Terrorists on hostage rescue maps know that once a certain amount of time has elapsed, patrolling or camping hostage rescue points is an important strategy. They'll also plant bombs behind boxes and other defensible positions. All the bots seem to be programmed to know each map intimately and will crouch on top of good spots or will lie in wait behind strategic corners, just like an experienced human player would. Even more remarkable is that you'll see bots breaking windows and jumping down from high ledges to purposely reach other areas more quickly--even at the expense of incurring a bit of falling damage. The bots aren't infallible, though. Occasionally you'll spot one getting hung up temporarily on some geometry. We've also seen the terrorist bots abandon planted bombs, thus allowing CTs to sneak in and defuse them without a fight. To be fair, we've also seen many human players make the same boneheaded mistakes over the years. Overall, the bots are remarkably human--and varied--in their behaviors. Some teammates will respond to your commands, while others insist on forging their own paths, which isn't terribly different from human teammates either. It's too bad there's no way to play as the terrorist side on these maps, but assuming you're willing to retry the game on higher difficulty settings after beating it on normal, there's decent value here. Adding to the game's aesthetic significance is the fact that a special ~deleted scenes~ mode has been included. These deleted scenes actually comprised the single-player campaign that Ritual was working on before game development was handed off to Turtle Rock. While the 12 missions here are pretty fleshed-out--with scripted sequences and dense amounts of action--the deleted scenes, as a whole, feel like clichs. To anyone who's played shooters for years, the deleted scenes seem like flashbacks to the shooters of 1999 and 2000, so you'll immediately know why Ritual's project was canceled. While it's nice to have this extra content, your decision on whether to buy Condition Zero shouldn't hinge on it. The deleted scenes aren't a bad way to kill time if you have nothing else to play, but they're certainly not great. As far as multiplayer goes, the game is the same Counter-Strike that most of us have been playing for years. There's not much else to say about it other than that it's still the world's most popular shooter for a very good reason--it's got a classic, timeless design. However, the fact remains that it's still a freely downloadable mod for Half-Life owners, so it's difficult to say that multiplayer here is much of a value-added element. The highlight of Counter-Strike: Condition Zero is clearly the bot AI. The bot behavior, while not perfect, is remarkably lifelike. And at the higher difficulty settings, it will provide at least a decent challenge for most shooter fans. Unfortunately, you're limited to playing as the counterterrorist side in the tour of duty campaign. While some maps have been prettied up a bit, the graphics are still basically the same as ever, which is to say, they're dated. At least the sound has held up well and is still great. In the end, Condition Zero is a product that will appeal most to those players who haven't tried CS yet (and how many of them are there?), those who don't want to deal with the hassles of playing the game online, and those who just want to have some offline practice. For those of you who are already playing Counter-Strike online (let alone finished with playing Counter-Strike online), there isn't much reason for you to own Condition Zero, because it's basically the same thing you're already playing."}