{"ref": "https://www.gamespot.com/reviews/nascar-08-review/1900-6176000/", "date": "August 1, 2007", "game_name": "NASCAR 08", "text": "NASCAR 08's box touts the fact that EA's NASCAR series is the number one selling NASCAR franchise. Nowhere on the packaging does it tell you that it's the top-selling franchise because it's the only NASCAR franchise. However, the fact that there's no competition is made apparent as soon as you play. It's extremely light on features, online play is lacking, and its visuals do little to take advantage of the power of the Xbox 360 or PlayStation 3. NASCAR 08 is a competent racing game, but you can't shake the feeling that it would have been a whole lot better if there had been a competing NASCAR game out there. NASCAR 08 features a solid number of tracks and almost every driver you'd want. The only major driver who's missing is Carl Edwards, but there are some notable track omissions, including Mexico City and Montreal. You can race a full, half, short, or custom season in the Nextel, National (Busch), or Craftsman truck series. You can race a season in the Car Of Tomorrow--but it's just one and done--there's no career mode. The cars show a lot of damage. Instead, there's a new mode called the chase. You start the chase as an unknown driver and your goal is to earn a contract by completing license tests. Each license is separated by track type. There's a license for super speedway, speedway, Car Of Tomorrow short track, Car Of Tomorrow speedway, Car Of Tomorrow road course, and Car Of Tomorrow super speedway. To earn a license you must complete 10 tasks, which teach you the basics of NASCAR racing. You'll learn how to draft, slingshot, and avoid wrecks, follow racing lines, as well as how to maintain your speed through difficult turns. The game uses some handy visual aids that show a car's draft and the optimal line around the track, so it feels very friendly to beginners. Once you've completed a license, you'll be offered a two-race contract with a racing team, and if you fulfill that contract, you can then race a season with that team's car. The chase is certainly a good way to introduce the sport to newcomers, and it's nice not to have to race through all of the lower-tier circuits as in previous years, but it's still no substitute for a proper career mode. It's a good thing the chase is such a good teaching tool because actual races can be quite challenging--for both good and bad reasons. One area where NASCAR video games differ from most racing games is that one small mistake can mean the difference between finishing first and finishing last, even if you have damage turned off. This makes every lap important and maintains the intensity of the races. Never has the ability to be perfect been more important than in NASCAR 08. The game is best played with a steering wheel because the default controls are extremely touchy, making it nearly impossible to race in a pack. If you don't have a steering wheel, you can adjust the linearity and responsiveness of the controls to make them more forgiving. This makes the game much more playable. You can also use the Sixaxis' motion controls to steer. This works OK, but isn't a substitute for a wheel. Unfortunately, there's nothing you can do about the game's artificial intelligence, which is quite poor. Drivers don't seem to have personality as they did in previous games, but they do all seem hell bent on wrecking you. Depending on which course you're on, opposing drivers will just as soon run into the back of your car as they will pass you. This isn't bump drafting either. They'll do it when they're clearly the faster car, they'll do it in turns, and they'll do it when you're racing three wide. They say ~rubbing is racing,~ but when it routinely costs you the race, it gets pretty frustrating, especially when the CPU doesn't seem to wreck very often. Once you've come to grips with the controls and have gotten used to the CPU's ~love taps,~ there's a solid racing game to be found. Races are generally close and though some may dismiss NASCAR as ~just turning left,~ you can really feel the difference from one track to the next, so it pays to practice. If you do make it into victory lane, you can choose to celebrate by tearing up the infield and doing doughnuts on the track. That never gets old. There's also a fair amount of tweaking you can do to squeeze the most performance out of your ride. You can even share setups online, but these adjustments are mostly optional, though they are beneficial against tough competition. It's too bad that the ability to customize your car's looks isn't as deep as your ability to customize its performance. You can choose from a handful of different paint schemes and colors, but once again, you can't pick a number under 100 or create custom designs. One area that really should have benefited from the move of one generation of consoles to the next is online play, but that didn't happen. There are leaderboards, but there are no leagues. You can race against up to 11 other players on the Xbox 360, but we were unable to connect with another player on the PlayStation 3. Should you connect with another player on either system, you'll find that it's rare to find a full field and that it seems to take a very long time to start a race. Eventually you'll get to actually race, which is a good thing, because the racing is solid and lag isn't a huge problem. One small issue from the offline mode, which is exacerbated during multiplayer because of the tendency to wreck more often, occurs when the game waves the yellow flag before wrecks are actually finished. This means that unless a wreck occurs right in front of you, you won't have to deal with trying to weave in and out of it, which is kind of fun. More importantly, it means that you never get to pass the wreck, and as a result, you'll be behind the people who just wrecked during the following restart. GPS isn't needed; you probably want to turn left. The other area where you'd expect NASCAR 08 to really take advantage of the Xbox 360 and PS3 hardware is its visuals. But that didn't really happen either. The frame rate is nice and smooth, with day turning to night during some races. The smoke and dirt effects are also pretty good, but mostly everything else is underwhelming. The tracks look decent but come off as rather bland, and they don't look much better than they did on the last generation. There's quite a bit of aliasing on both the tracks and cars. Cars look OK, especially when you can check out all 43 of them in line during a restart, but you rarely get to enjoy them much. Car damage looks nice during replays where you can really watch the cars fall to pieces, but because every little bump causes your car to suddenly show damage, it doesn't look very realistic when you're racing. The audio isn't much different from before. The cars sound great, while your crew chief does an adequate job, even if he sounds bored and routinely falls behind the action. NASCAR 08 isn't a bad game; in fact, it's fun once you get the hang of it. Its biggest problem is that it's not noticeably better than last year's game and there aren't any compelling new features. If really want a NASCAR game and it has to be on the PlayStation 3 or Xbox 360, then NASCAR 08 is worth a look because, quite frankly, it's your only choice. But if you own any NASCAR game from the past few years, you might as well stick with that one."}