{"ref": "https://www.gamespot.com/reviews/metro-2033-review/1900-6253762/", "date": "March 17, 2010", "game_name": "Metro 2033", "text": "Beneath a frozen city ruined long ago by its own weapons of destruction, humankind clings to survival. In dirty overcrowded stations, women haggle for scraps at the market as old men mourn the world they lost and children run underfoot, knowing no life beyond their meager subterranean existence. The hardier souls stand at the gates, vigilant against the beastly offspring of Armageddon, while the bravest venture out into the tunnels to trade, scavenge, and scout the dark reaches of the man-made underground wilderness. The rich world of Metro 2033 is not free of technical flaws, but the oppressive atmosphere is so well cultivated that it successfully draws you in and spurs your onward. Your journey is a lengthy and intriguing one, full of dramatic moments and tense action. The relentless gloom can be wearying, and the shooting and movement mechanics feel a bit dated, but the overall experience endures despite these blemishes. The immersive world of Metro 2033 is not for the faint of heart or short of patience, but those whose brave it will find a fresh and entertaining new adventure into the postapocalyptic future. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Metro 2033 Video Review And make no mistake, this future is bleak. The aforementioned station-villages are dreary, but you'll come to regard them as welcome beacons of light in the pervasive darkness of the tunnels. As you venture away from the comforting firelight and busy soundscape of the crowded stations, you enter tunnels that echo with the howls of murderous beasts, where the only illumination is provided by glowing radioactive fungi or your own headlamp. Light, or lack thereof, plays a huge role in creating Metro 2033's engaging atmosphere. Passing through a dark, foggy tunnel can be harrowing, and entering the warm glow of an electric lamp can relieve the palpable tension, until you look down and see a freshly mutilated body at your feet. Grim scenes, inescapable shadows, and an omnipresent sense of desperation help create a powerful sense of gloom and doom. Though this world is not without hope, it is a dark one, and it can be overbearing at times. Soldiering on can be difficult, but sometimes all it takes is a worn out record player to lighten your spirits. Darkness can also be your ally, providing you have some night-vision goggles handy, allowing you to sneak past foes or position yourself for a silent kill. Lightscape is just as important as landscape in Metro 2033, because not only do they combine to create the rich subterranean atmosphere, but each is an important tactical consideration. Though much of your adventure plays out in the subway, don't expect to see the same tunnels over and over again. Human outposts are cobbled together from scrap and salvage, but there's a big difference between a bandit settlement and an entrenched military outpost. Some areas you traverse belong to the beasts, as evidenced by chewed corpses and ominously narrow dirt tunnels. Still others belong to neither men nor mutants, and the eerie silence will make you wonder what has kept them away. And just when the endless tubes are becoming too oppressive, you strap on a gasmask and venture out onto the surface to pick your way through the frigid skeleton of Moscow. Thoughtful details make exploration tempting, as does the prospect of stumbling across a dead adventurer or ammo cache ripe for the looting. Though Metro 2033 rewards you for paying attention to the little things, doing so is also likely to reveal graphical imperfections that may dilute your immersion. Environmental textures, character models, and animations all suffer technical oddities, but none of these issues are truly jarring. It's more of a general graphical roughness that makes the game's visuals feel a bit dated. The grimy tone does a fair job of covering up these blemishes, though, and you'll usually be too busy worrying about what's coming out of a hole to lament the odd textures in and around it. Eerie green mist and otherworldly fungus? Better juice up the old headlamp, things are about to get weird. Nasty things that crawl out of holes are only some of the nightmarish creatures you have to contend with on your journey. Winged fiends and quasi-yetis get very territorial, while loping, long-nosed beasts stage regular assaults on humans in most areas of the Metro. As you travel the tunnels from station to station on your quest to deliver an important message, you have to fend off these fierce mutants who would like nothing more than to rip your flesh from your bones. Combat can be challenging, but you have a good array of weapons at your disposal. Powerful prewar weapons are rare and valuable, and clever postwar improvisations provide intriguing alternatives. Shooting mechanics aren't particularly satisfying, and it can sometimes be tough to tell if your shots are actually hitting the fast-moving beasts. In the heat of combat, the slightly ungainly enemy animations become more noticeable, injecting the frantic action with a mild dose of awkwardness. This feeling is likely to get rolled in with the general discomfort of fighting for your life, but there are times when it can sap some of the excitement from combat. Still, there are some fun guns (like the pneumatic crossbow/revolver), and the action usually is solid enough to make combat enjoyable. Some of your fiercest enemies are your fellow men who are spurred to violence by ideology or desperation. Using stealth is a great way to get the drop on or just sneak by human enemies, and the quiet approach allows you to overhear some fascinating conversations that add interesting layers to the world. Movement mechanics are also solid, though even if you are careful to avoid making noise, shining light, and triggering traps, your movements may still alert the enemies for reasons unknown. Startled foes launch scrambled attacks that can showcase some pretty wonky AI, but for the most part you are dealing with competent foes that will vigorously try to put bullets in you. It's not the tightest action you've ever seen in a shooter, but it is fittingly tense and immediate. The reason for all your under- and aboveground adventuring is established early on, but the vague urgency doesn't coalesce into a clear mission until much later. Though the narrative can be patchy, Metro 2033 fills in the blanks by slowly unveiling its rich, multifaceted world. Everywhere you go, from bustling stations to lonely tunnels, you will find clues that broaden and enrich your understanding. Eavesdropping on an enemy conversation will shed light on Metro mythology, while bioluminescent flora raises questions about postnuclear biology. You glean a lot of information from just paying attention, and through this observation you create a kind of patchwork, discovery-fueled narrative that eventually comes to an intriguing conclusion. Not a great time to take a nap, comrade. Metro 2033 is a well-paced shooter that will likely take you more than 10 hours to complete. It is punctuated by emotional and dramatic moments (a surprising encounter with a child, a few intense railcar sequences), though these aren't without their own idiosyncrasies (the immersion-busting ~quickly tap x~ prompt). Many elements of Metro 2033 aren't quite up to modern shooter standards, but taken as a whole, they come together nicely. The pervasive atmosphere is largely responsible for this cohesion, creating a grim, enthralling world that you feel compelled to explore. Though it is not without its perils, Metro 2033 is a very worthwhile game for anyone craving a uniquely rewarding journey into man's dark future."}