{"ref": "https://www.gamespot.com/reviews/windjammers-2-review-spin-to-win/1900-6417815/", "date": "January 20, 2022", "game_name": "WindJammers 2", "text": "The competitive disc-flinging of Windjammers is uniquely appealing. I've long heard of its majesty from the anime/alt-fighting game community (and particular game media figures). and a few heated sessions of high-speed dashing, tossing, and lobbing was all it took to be won over. Over the decades, this once-obscure arcade game has gained a reputation and a devoted competitive scene. And now, almost 30 years after the original game's debut, Windjammers 2 has emerged to show why old and new players alike should explode with excitement over the prospect of throwing a virtual frisbee.The core concepts of Windjammers 2 are the same as its much-loved predecessor: Take the basics of Pong (throw the disc into an opponents goal space to win as they attempt to block and launch it back), add an international cast of characters with unique abilities, throw in a bunch of offensive and defensive options, then toss them all in one of several varied arenas to fight in the most intense, high-powered disc-tossing competition you've ever seen. The combination of skills, quick reactions, mind games, and clever movement make for a fast-paced experience with a broad appeal and surprisingly high skill ceiling.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Windjammers 2 - Announcement TrailerIt's not all the same as before, however. Windjammers 2 adds four new selectable characters to the cast, ranging from the super-speedy Jao Raposa to the hulking disc-chucking powerhouse Max Hurricane. Each character comes with unique super shots to dazzle and confuse opponents. New offensive and defensive maneuvers have been added, such as a button that immediately smashes a disc back at the opponent at high speed, and the ability to jump, intercept, and counter-throw a high-flying lobbed disc. These skills, combined with the unique characteristics and special attacks of each character, add a satisfying new layer of competitive depth and strategy to an already intense competitive game.Finally, there are several new courts with unique rules: floors that award double points when a player drops a disc, trajectory-altering obstacles in the middle of the arena that get pushed around when you smack them with the disc, high-scoring goal zones that grow larger each time that side's player gets points, even a gaudy casino stage where each serve is a different, random point value. Learning the ins and outs of each court is as crucial to securing victory as movement and character knowledge. Will the obstacles in the center of the arena mess up the planned trajectory of your shot? Is it better to try to get your foe to drop a disc, or aim for their goal with a fast trick shot and hope they cant react in time? If you try a power disc shot, can they retaliate with a reversal? Youll need to analyze and make decisions quickly to grasp the win, and seeing how well you can get into the opponents head while reacting to their throwing assault is all part of the fun.With so much effort put into refining and bolstering the one-on-one gameplay mechanics, Windjammers 2's core focus is being a player-versus-player competitive game. Online multiplayer is placed front and center from the moment you click past the title. While immediately jumping into the fray is tempting, newcomers to Windjammers will likely check out the ~how to play~ section hoping for a nice tutorial. Instead, you're presented with a sequence of illustrated images and control diagrams that showcase various offensive and defensive skills with little context about when or how they should be used. Windjammers certainly isn't the most difficult-to-learn game out there, but there is a lot of skill and strategy underneath its veneer of simplicity. Even a basic playable tutorial would go a long way to easing new players in, but instead, you're going to have to learn skills like the timing of blocks, options after charging, the purpose of lobs, and all of the offensive and defensive options with the super meter with only a control diagram you can't even check mid-play. Making the player dig to fully understand tech is one thing, doing it in a way thats unfriendly and off-putting is another.You can attempt to practice by going up against the CPU, however. CPU opponents are selectable in versus mode, but the main mode most folks who want to play against the AI will gravitate to is arcade mode, as it is the only real viable option. Here, you choose a character, then select an opponent and location to battle on an overworld map for a total of five bouts (plus two bonus stages). The number of continues you are afforded depends on the difficulty level you pick--easy gives two, normal gives one, hard starts you with zero--but you can earn more credits with points you get from gameplay.Even on easy difficulty, however, the CPU can be surprisingly mean, predicting your reactions and performing perfect counters with disturbing frequency. If you're totally new to Windjammers, you're in for a trial by fire--but even experienced disc-flippers will likely find themselves annoyed when the CPU opponent just happens to be standing directly in the center of the arena, the ideal position to easily dash and block a power disc shot, for the umpteenth time.Once you manage to (somehow) learn the various gameplay nuances of Windjammers, it's time to savor the meat of the game: versus play. Playing against human opponents is a lot more fun and satisfying than the CPU, as you can now factor fun mind games and individual player quirks into your overall game plan. In my review play, it was quite easy to hop into an online match through player invite and quickly get to lobbing discs. The rollback-based netcode also felt buttery-smooth--though I was mostly battling other west coast players. There are some strange omissions--the game doesn't track session win/loss stats, there's no quick rematch option, and you can't deselect a character chosen by mistake--but the power-flinging action itself felt great. Ranked mode was unavailable to test for this review.It's a good thing that the on- and offline versus play is solid because there's not a whole lot else in the Windjammers 2 package. Arcade mode has some funny illustrated character endings--and arcade nerds will get a kick out of some of the references to other classic titles--but once you've seen all the endings and acquired all of the achievements, there's little to hold your interest. It's unfortunate how bare-bones Windjammers 2 feels--even little things like an art/sound gallery, an arcade score challenge, or the ability to play for high scores on the bonus stages outside of arcade mode would have made it feel more substantial.Windjammers 2 is a fine evolution of a formula that's only become more beloved over time. The action's intense, the online's excellent, and the new characters, skills, and levels build well upon the foundation of the original. It's a wonderful competitive experience, but a lack of guidance for new players and a serious dearth of single-player content will turn some folks off of what should be a triumphant comeback. If you're planning on being a flying disc jockey, you'd better make sure you're prepared to fight online."}