{"ref": "https://www.gamespot.com/reviews/pangya-fantasy-golf-review/1900-6213258/", "date": "July 10, 2009", "game_name": "Pangya Fantasy Golf", "text": "Here on earth, the origins of golf are still up for debate, but on Pangya Island--a world of dreams and fantasies that exist in an alternate dimension--the sport's history is well documented. Known as Pangya by the island's inhabitants, golf was invented as a way to pay tribute to a hero who, not too long ago, defeated the dark lord by hitting a ball into a hole. Clearly Pangya: Fantasy Golf is no ordinary sports game, but regardless of how you feel about its colorful characters and fantastical fairways, there's no shortage of good golfing here. Early courses look a lot like those in conventional golf games Pangya Island's nine golf courses support single-player tournaments and ad-hoc matches for up to eight players, but those are best left for when you've already spent some time with the lengthy Story mode. In this mode, you'll get familiarized with the traditional three-click control system, you can (after about 15 hours or so) unlock all 18 of the players on the roster for use in other modes, and you will inevitably accumulate plenty of Pang to spend on new outfits and better equipment for your favorite golfers. There's also a story in there, of course, and while the dialogue between characters is rarely compelling, it at least makes a stab at explaining how magical Pangya natives, anthropomorphic dragons, a large white bear, a young pirate girl, and a pro tennis player named Max have come to be playing golf together. The story is good for a chuckle every now and then, but you won't miss much if you opt to skip all of that stuff and just stick to playing golf because the objective is always to beat your opponent, regardless of whether or not he or she is a love interest, an adoring fan, a criminal, a mortal enemy, or a member of a rival island tribe. If you've ever played any golf game before, you should have no problem getting into Pangya. You select clubs with the shoulder buttons; aim your shots using the D pad; and with the benefit of an overhead map, you take differing elevations and weather conditions into account; then, you click the shot button three times to start your swing, set the power, and strike the ball as cleanly as possible. As you progress through the Story mode, you're introduced to more advanced techniques, such as a topspin and backspin, power curve (applying exaggerated draw or fade to play around corners), and shots with such names as tomahawk, cobra, and spike. The controls for performing some of these spectacular shots are more demanding, though remembering when to press which buttons is more difficult than actually doing so. On a regular golf course, shots like these would be considered overpowered, but they're practically a requisite for playing some of the holes on Pangya Island. Early courses have a conventional feel and pose few problems outside of the bunkers and water hazards that you'd expect. It doesn't take long for realism to give way to fantasy, though, and fairways atop narrow columns of rock, greens situated on small islands, and obstacles that include everything from windmills to volcanoes become commonplace. There's certainly no shortage of variety as far as the course designs are concerned, and while the visuals are the most obvious difference between courses that are covered in snow rather than volcanic ash, the environments have some impact on how the holes play as well. On a frozen fairway, for example, your ball will travel a little farther after its initial bounce than it will on a sun-drenched one, and when water hazards freeze over, they become targets as viable as the fairways and greens--there isn't even any penalty for playing your subsequent shot from the ice. but later you'll feel like you're teeing off in the bowels of hell. Even shots played from the rough suffer a distance penalty of only 5 percent, so provided you steer clear of water hazards, bunkers, and areas that are designated out-of-bounds, Pangya: Fantasy Golf feels very forgiving. With the default settings, the effects of the wind are negligible, the hole cups are much larger than in real life, and mistakes made on the power gauge while attempting to strike the ball result in shots that are only slightly off target rather than in dramatic hooks or slices. If you take a trip to the options screen and turn off the ~Beginner Mode~ option, though, the level of challenge rises significantly. There's no option to tinker with the unpredictable AI of Story mode opponents, who will play like geniuses one moment and gorillas the next, but they at least become more formidable and consistent as you progress. Incidentally, in one-on-one games, you get to watch your opponent taking his or her shot with a welcome option to fast-forward through it, whereas in tournaments, all players take their shots simultaneously and small portraits show the positions of their respective balls. Outside of the Story mode, Pangya: Fantasy Golf offers a satisfying Pangya Tour mode in which you must obtain course licenses before you're permitted to compete in tournaments. That might sound like a lot of work, but the license tests are actually a lot of fun. Challenges include achieving scores on specific holes, playing better approach shots than an opponent on all of six holes, and having 10 attempts to sink either a chip-in shot or a hole-in-one. Those last two are pretty intimidating, but a marker showing the exact location of your previous attempt makes it relatively easy to adjust your aim for the next one. With a license in hand, you're free to enter several different tournaments at each of the nine courses for a chance to win both currency and new outfits for characters. Between the Story and Pangya Tour modes, you can spend dozens of hours playing solo without ever repeating a challenge or a competition, though you're obviously going to see the same 162 holes over and over again. There are loads of different outfits and pieces of equipment to unlock. The entire time you're playing solo, you can expect to unlock new characters, new outfits, new balls (known as Aztecs in-game), and new clubs--many of which have novelty appearances, such as baseball bats, swords, and umbrellas. Many of these items alter your character's attributes when you equip them, and they look good to boot. There are no restrictions on using items when you enter multiplayer games with friends, which is a good incentive to unlock powerful gear, but it's unfortunate that your friends never actually get to see the cool shades you're wearing or that you're playing as a dragon whose woods are actually double-headed axes. Rather, they only see a small character portrait at the location of your ball because in multiplayer games, you all take shots simultaneously and there's no option to alternate as you would in real life. The complete lack of online play or leaderboards is also disappointing because if you lack local friends with their own copies of the game (or at least an interest in yours), there's no way for you to show off your golfing accomplishments and gear whatsoever. That's a shame because many of the unlockables, like other visual aspects of the game, are nicely detailed with a colorful anime-style aesthetic that really pops off the PSP screen. The character animation in Pangya: Fantasy Golf adds a good deal to its anime feel, with expressive celebrations and reactions to failure that give the golfers plenty of personality beyond what's apparent in the text-based dialogue of the Story mode. There's no voice acting in the game save for the excited yells of ~Pangya!~ that characters seemingly can't contain whenever they hit a ball straight and true. The chirpy soundtrack isn't particularly memorable, but it's also not irritating, and it complements the visual style very well. The talking shopping bag is watching the putt intently because it's also the caddy. Pangya: Fantasy Golf is a great package with a lot of content. The time it takes to unlock all of the characters and collectibles is best measured in days rather than hours, and even if those things don't interest you, there's no reason you can't enjoy Pangya as you would any other golf game. Clearly, you're not going to find an accurate re-creation of St Andrews on Pangya Island, but you'll be too busy wondering if your tomahawk shot is going to make it over the windmill and onto the green that's protected by a river of lava to give it a second thought. Outside of the Story mode, Pangya: Fantasy Golf offers a satisfying Pangya Tour mode in which you must obtain course licenses before you're permitted to compete in tournaments. That might sound like a lot of work, but the license tests are actually a lot of fun. Challenges include achieving scores on specific holes, playing better approach shots than an opponent on all of six holes, and having 10 attempts to sink either a chip-in shot or a hole-in-one. Those last two are pretty intimidating, but a marker showing the exact location of your previous attempt makes it relatively easy to adjust your aim for the next one. With a license in hand, you're free to enter several different tournaments at each of the nine courses for a chance to win both currency and new outfits for characters. Between the Story and Pangya Tour modes, you can spend dozens of hours playing solo without ever repeating a challenge or a competition, though you're obviously going to see the same 162 holes over and over again. There are loads of different outfits and pieces of equipment to unlock. The entire time you're playing solo, you can expect to unlock new characters, new outfits, new balls (known as Aztecs in-game), and new clubs--many of which have novelty appearances, such as baseball bats, swords, and umbrellas. Many of these items alter your character's attributes when you equip them, and they look good to boot. There are no restrictions on using items when you enter multiplayer games with friends, which is a good incentive to unlock powerful gear, but it's unfortunate that your friends never actually get to see the cool shades you're wearing or that you're playing as a dragon whose woods are actually double-headed axes. Rather, they only see a small character portrait at the location of your ball because in multiplayer games, you all take shots simultaneously and there's no option to alternate as you would in real life. The complete lack of online play or leaderboards is also disappointing because if you lack local friends with their own copies of the game (or at least an interest in yours), there's no way for you to show off your golfing accomplishments and gear whatsoever. That's a shame because many of the unlockables, like other visual aspects of the game, are nicely detailed with a colorful anime-style aesthetic that really pops off the PSP screen. The character animation in Pangya: Fantasy Golf adds a good deal to its anime feel, with expressive celebrations and reactions to failure that give the golfers plenty of personality beyond what's apparent in the text-based dialogue of the Story mode. There's no voice acting in the game save for the excited yells of ~Pangya!~ that characters seemingly can't contain whenever they hit a ball straight and true. The chirpy soundtrack isn't particularly memorable, but it's also not irritating, and it complements the visual style very well. The talking shopping bag is watching the putt intently because it's also the caddy. Pangya: Fantasy Golf is a great package with a lot of content. The time it takes to unlock all of the characters and collectibles is best measured in days rather than hours, and even if those things don't interest you, there's no reason you can't enjoy Pangya as you would any other golf game. Clearly, you're not going to find an accurate re-creation of St Andrews on Pangya Island, but you'll be too busy wondering if your tomahawk shot is going to make it over the windmill and onto the green that's protected by a river of lava to give it a second thought."}