{"ref": "https://www.gamespot.com/reviews/gotham-knights-review-knightfall/1900-6417983/", "date": "October 20, 2022", "game_name": "Gotham Knights", "text": "Batman is dead. With so few words, Gotham Knights is instantly intriguing. What does Gotham look like without its Dark Knight perched over the rotten city? What do his nemeses--many of whom exist in some way because Batman did--do without him? Most importantly, what impact does his death have on Robin, Batgirl, Nightwing, and Red Hood, the so-called Bat-family? Their leader's sudden demise leaves a massive hole in the heart of Gotham, and Gotham Knights is the story of sidekicks stepping out from his shadow. Although the new guard fares well from a narrative standpoint, the gameplay systems built to serve their 30-hour campaign to reclaim Gotham let the team down.This isn't an Arkham game, though Gotham Knights does use the beloved series as a jumping-off point. In a totally open-world version of Gotham City, the Bat-family will still spend much of their time swooping down on enemies from gargoyles overhead and chain attacks with stylish combat moves as they dispatch packs of gangsters. They'll still crawl through vents to get the drop on baddies who are feeling empowered by Batman's sudden departure. The open world is also structurally familiar in the way it carries the player through the game. It is full of icons ranging from main story beats to one-off time trials and challenges, so at first glance this version of Gotham doesn't seem all that different from other versions of it, or other open-world games for that matter.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Gotham Knights Video ReviewThough it looks the part, with its stark class divide, constant crime sprees, and neo-noirish intentions, patrolling the urban sprawl is sadly a chore. Because Gotham Knights trades the tried-and-true action-adventure roots of recent Batman games for a loot-focused brawler, the cadence of action foregoes compelling storylines that complement the main campaign for rote and repetitive street brawls that reward you with crafting resources. The game starts really strong, with several authored story missions that feel nearly as big and bold as you'd expect, given the last 15 years of Gotham-set games. After that intro, however, the game settles into unremarkable and unfilling gameplay loops driven by awkward games-as-a-service design principles.This is most evident in how each character's unique traversal tool and fourth skill tree is unlocked as part of their Knighthood challenges. Batgirl glides, Nightwing has a mechanical drone, and so on. But you can't use any of those items until you complete 10 Premeditated Crimes with each hero. These are merely scattered street crimes found around the city and repopulated constantly. The issue won't be a shortage of them, but rather a lack of intrigue around any of them. To unlock these Premeditated-class street crimes, you have to find clues by first completing smaller, quicker street crimes. Almost immediately, this chain of events gets boring: Spam street crimes where enemies number around a half-dozen to unlock bigger versions of, essentially, the same content.You'll want to get these out of the way quickly to earn the unlocks waiting for you, so after a hot start including a memorable scene where Harley Quinn is taunting the heroes while almost grieving Batman, it soon descends into hours of completing 40 forgettable side missions, all built on a procedurally-generated mission structure that varies slightly in objective but never in practice: Go here, beat up anyone glowing red in your augmented reality vision mode, complete any additional objectives or challenges to get bonus experience, and you're done. If I were being charitable I could argue that this is a realistic portrayal of Gotham. It would be exhausting to patrol such a relentlessly troubled city each and every night, knowing there's really no end in sight, no grand reward for your efforts. But that likely wasn't the intention, and it doesn't make a good video game.Worse, once you have those Knighthood challenges completed, you'll still bump up against these forgettable side missions frequently. Boss storylines are level-gated so you can't quickly see the end of any questline, and to level up in between major boss missions, you'll often be doing more of these street crimes. Meanwhile, iconic characters like The Penguin and Lucius Fox are made to be nothing more than immobile quest-givers doling out missions that are more like basic challenges to earn a new suit blueprint or a mess of crafting resources. Becoming Gotham City's watchful protector should be a meaningful journey for the characters and the players controlling them, but it rarely amounts to feeling like anything more than busywork.Boss battles are where excitement should be expected, but there are too few of them and they lack the variety and ingenuity of past showdowns, even in developer WB Montreal's past Bat-effort. Aside from the main storyline that heavily involves The League of Shadows and The Court of Owls, you'll do battle with Harley, Clayface, and Mr. Freeze. Each of these questlines is started very early on in the game, so it was a surprise when no more appeared before the credits rolled. I'd have less of an issue with this number if the final battles within each of them were more diverse or interesting, but they each inevitably devolve into an arena battle against a damage-spongey villain and maybe an intermittent horde of goons. There's nothing memorable about any of them.Although there are a sparse number of puzzles to solve in addition to the meager amount of bosses to fell, combat is the game's central system that everything is built upon. You'll be driving, gliding, or sprinting around the streets and off the rooftops of the city each night, looking for heads to crack. Like the mission design and writing, combat initially makes a strong impression by being distinct from previous Batman games. The problem, however, is it fails to evolve as the game goes on.It swaps out the active counter-heavy model for something more RPG-like, where cooldowns and a ~Momentum~ meter lord over your capabilities, and it can look cool for a while. You'll stylishly take down foes of a few different classes, like big brutes with shields or molotov-tossing ne'er-do-wells, but rather than Arkham's very defensive-minded combat, where you systemically had an answer to everything thrown your way, here it's more about keeping the pressure on and always hitting something--it's the difference between action and reaction. It emphasizes the Momentum meter over the actual learned techniques that Batman must've taught the foursome, and seemingly all in the name of being an RPG that demands sturdy enemies who can't be dispatched with the same ease that Batman has shown before.None of these characters are Batman, so them being more acrobatic, like Nightwing, or bone-crushing, like Red Hood, is a fine change of pace aesthetically. But as it plays out, it reveals a lack of variety. Moves look different for each character, but the button presses you'll perform nearly follow the same script the whole game no matter who you are. Each character's unique special moves are the only thing that really separates the heroes from each other.The Court of Owls, perhaps the biggest and most beloved new addition to the Batman mythos in a long time, fails to live up to the potential of its comic book source material. In the comics, the Court is a creepy, ever-present threat whose existence is up for debate; merely whispering about them could get you killed, or so say the dark nursery rhymes. That element of the villainous secret society is touched on here, but it all feels like lip service via a few lines of dialogue that aren't supplemented by what is shown. In practice, the Court feels like any other faction of enemies, especially when you so often come across them taking part in street crimes, thereby totally neglecting the cabal's most important characteristic: their working from the shadows.That's not to say WB Montreal misunderstands its cast of characters. Although the Court is narratively fumbled, the game's brightest spot is certainly its foursome of heroes. Batgirl, Red Hood, Robin, and Nightwing are handed the keys to the city without warning, and they're not sure how to fill Batman's boots. As you progress, you'll unlock character cutscenes in their base of operations, the Belfry, or out in the city. Tonally, these are very often somber and serious, and help characterize the heroes as the grieving, unsure group of orphans they have essentially become. These moments are my favorite scenes in the game. Batman meant something different to each of them, and the writing captures this excellently. For example, Robin is grieving the loss of an idealized version of Bruce, while Nightwing's relationship was more complicated and not always amicable, which leaves him feeling oddly conflicted.Their emotional and personal growth is a rare bright spot in Gotham Knights, and their mechanical growth is also well-considered. Leveling up and playing with any one of them unlocks the same skill points for the others, which invites mixing in time with each of them. Swapping between characters doesn't just give you a new skill tree; it gives you a new perspective on this larger-than-life figure who has loomed over each of them for years, and is now suddenly and irreversibly absent. It lands as hard as intended, and it's compelling to see them pick up the pieces and grow together.That growing together is best done in co-op, where the game can be played with one other person. Although the lack of a four-player mode sticks out, playing with a friend is still a more enjoyable experience. This version of Gotham is not its best rendition, but it is massive and benefits from the basic video game truth that most everything is better in co-op. Gotham Knights smartly accounts for co-op play in a number of ways, too. Main story progress follows the host's lead, so opening the map as either player will reveal the host's current to-do list.However, anything the second player does carries over into their native saved data, including gear they've found and even story missions they've completed. If you join a friend for a while, then revert back in the campaign on your own save, you'll have the option to skip and get credit for missions you've already completed in co-op. This is a great detail that too few of these co-op-optional games overlook, so even though Gotham Knights isn't a great game in most respects, it does at least reveal a better path forward for games like it.It's too bad the city isn't more exciting, because with a welcome lack of co-op tethering, the head-canon of figuratively carving the city in half, each person declaring a territory and saying ~Good luck, see you in the morning~ could be a really fun way to role-play as these heroes. Instead, there's little reason to separate, as the peripheral content is so rote that you'll want to only do what's required of you to unlock the next major story beat, nothing more.There's even a peculiar lack of endgame content. Normally these loot-centric games are built on the long haul, but here the game has all the markings of a loot grind without any purpose to perform it. If my gear is good enough to beat the final boss--and it was--then what incentive do I have to keep playing to improve that gear? I suspect the forthcoming four-player co-op Heroic Assault mode launching in late November may better answer this question, but waiting five weeks to go back to a game that isn't very good in the first place isn't in my plans.By the end, the project as a whole feels a bit compromised, and instead of feeling the triumphant journey of iconic heroes, the lasting impression is one of a difficult development cycle. The sudden cancellation of the last-gen versions was perhaps the first sign, but more appear as you play. This includes a lack of a 60fps support on consoles, frame drops in solo or multiplayer, and an oddly high number of hidden loading screens. It feels old already, even as it can still look quite lovely when perched high above the city as its tireless guardian. Under the hood, I suspect this game is chugging along to make ends meet. It certainly feels that way to play it.Gotham Knights acts as more of a cautionary tale than the logical next step for this storied universe. For a long time no one knew how to make a compelling Batman game, and then we got four of them in seven years. Taking what worked before while seeking to evolve it is admirable, but the obsession over loot is ill-conceived, cynical, and tasteless. It feels as though volume of content is given precedence over meaningful content, and for those that might enjoy the grind, the endgame's absence will be noticeable.It's these rinse-and-repeat objectives that feel like they're made to fill time and push the loot that ultimately hamper the experience more than any other misstep. The game seems built to serve an almighty hours-played statistic that has lately felt frighteningly ubiquitous. Strong character work and a well-considered co-op experience can't save all that ails Gotham Knights, leaving this experience neither the one fans deserve, nor the one they need right now."}