{"ref": "https://www.gamespot.com/reviews/bolt-review/1900-6202601/", "date": "December 19, 2008", "game_name": "Disney Bolt", "text": "Bolt is the ideal canine companion: He's loyal, intelligent, obedient, and can shoot lasers from his eyes. Unfortunately, this superdog doesn't get the superstar treatment that he deserves on the Nintendo DS. The shallow plot makes it hard to care about the story's outcome and the repetitive gameplay sucks all the substance out of the action. It's a shame that Bolt doesn't use his talents more, because this pound puppy is incredibly cute. However, not even his laser beam vision can solder these crummy parts into something worth playing. The dynamic duo are off to rescue Penny's dad from the evil Calico. It's probably for the best that Bolt on the DS doesn't follow the movie's storyline. In the movie, Bolt doesn't actually have superpowers; he's merely an actor on a television show. Instead, the DS game is one of the action-packed episodes in which Penny, Bolt's owner, must save her father from the sinister, green-eyed Calico. You'll travel to five exotic locations, taking out along the way what seems like an army of cloned henchmen, until your final showdown with Calico. The story is told with still images and minimal dialogue, none of which is voice acted. These sequences feel more like a PowerPoint presentation whose sole purpose is to break up the monotonous gameplay. Through the game's 30 missions, you'll rotate between playing as Penny and Bolt, neither of whom is particularly exciting. Penny swings her wheel bar, a device that also lets her scale walls and use a zip line, and Bolt bashes enemies with his forehead. Using the X and Y buttons, you can attack and do various combos, but you'll never need to know more than one combo. Energy atoms can be collected by breaking crates and by fighting the limited assortment of bad guys. Atoms are so plentiful, you'll max out your four-legged friend's abilities well before the ending credits. The ability to customize and enhance your characters is a great feature, except once you're capped out, you have no reason to fight or explore anymore. Though the majority of the gameplay is button-mashing, you do spend time with some brief minigames. The brave young Penny has the ability to hack computers, represented by a quick but mildly entertaining minigame in which you draw lines to connect symbols to match the pattern in the top screen. Unfortunately, this is the most exciting action Penny has in her repertoire. She's a clever girl, but walking from one end of the map to the other, clobbering enemies, and jumping over gaps gets old really fast. Bolt, on the other hand, is able to use his laser vision when the situation calls for it. An arrow pops up on the touch screen for you to trace. These are scripted moments, which is disappointing because it would have been nice to use this ability at your leisure to mow down an entire row of Calico's followers. The biggest problem with Bolt is the camera, which zooms in much too close at the most inconvenient angle, making it difficult to see what's around you. It's not even worth using the L and R buttons to rotate the camera, because it not only doesn't pan far enough, it abruptly pauses the action as well. In light of the awkward camera, you'll often find that if you don't line up Bolt and Penny carefully, your attacks will miss their target completely. Bolt fares a bit better because he jumps in the air, which sometimes lets the camera back off enough for you to get a better view. The top screen can be switched to an overhead map on which you can view the enemy's location. This makes battles slightly less frustrating, but you have to hit select to switch to this screen several times in a level because the game automatically goes back to the mission display every time a brief cutscene occurs. It's annoying having to hit select to keep the map visible, given that it's the best way to scout enemies before they're on top of you. Even with these issues, you'll never find yourself in danger of losing. The game is so incredibly easy that you have to go out of your way to fail a mission. The storyboards that detail Penny and Bolt's adventure are well drawn and able to convey some of the story's emotions. Other than the nicely drawn still art, Bolt's visuals in some areas are very bland, and the level designs aren't that creative, either. Whether you're in Russia or China, the environments may look different, but because you're doing the same thing over and over again, they all feel the same. The music will alter slightly, and it does a decent job of setting the mood, but there aren't any memorable melodies. There are no distinct sounds when you hit the generic enemies, which makes it difficult to know whether or not you've made contact. Bolt is a good dog. He head-butts bad guys. As you progress through the game, you unlock a number of items (mainly outfits) that can be accessed via DGamer, Disney's social-networking service for its DS games. This may be worth it for those who play Disney DS games and want to expand their online wardrobe. There are a couple of multiplayer features, which include the hacking game that can be played against a friend, and you can also go through a small handful of missions together in the Battle Arena mode. Banding together as Bolt and Penny to take on Calico's henchmen is a good idea, but you can complete the levels within 15 minutes and there's no reason to want to do it again. Not to be forgotten is Rhino the hamster, who gets his share of the spotlight as the star of his own side game. With a setup similar to Super Monkey Ball, you tilt the level to roll the encapsulated Rhino to the finish line. But due to stiff controls and repetitious level design, this side game--like the main dish--feels like a missed opportunity. Clumsy controls, lackluster story, and a bad camera make Bolt difficult to recommend. The game is limited in every aspect, which doesn't make it fun for very long; young gamers can find much better alternatives. The sweet, adorable, snow-white German shepherd is a great new addition to Disney's animated cast, but his talents are much better suited on the silver screen."}