{"ref": "https://www.gamespot.com/reviews/zeno-clash-ultimate-edition-review/1900-6263229/", "date": "May 21, 2010", "game_name": "Zeno Clash: Ultimate Edition", "text": "Zeno Clash debuted on the PC last year and was memorable more for the supersized serving of weirdness it dished up rather than its gameplay. Zeno Clash: Ultimate Edition comes to the Xbox 360 with a few additions, including some combat tweaks and a two-player mode, which lets you take on the game's challenge levels with a friend. But the new offerings don't change what Zeno Clash is at its core--a simplistic first-person beat-'em-up that's a strange experience but not an altogether compelling one. Featuring a story that is surreal and at times nonsensical, Zeno Clash puts you in the role of Ghat, a bare-knuckle brawler on the run from his tribe. Ghat is fleeing after committing a terrible sin against Father-Mother, the birdlike hermaphrodite who is parent to all. You have to face off against a multitude of your own brothers and sisters, as well as a wide array of other creatures using mainly your fists and feet as weapons. Narrative cohesion isn't a strong point of Zeno Clash. The story--which jumps forward and backward in time as it explores the events leading up to your original assault on Father-Mother--doesn't make much sense. It's also filled to the brim with strange dialogue and even stranger characters. This strangeness permeates the game's design as well, with your various brothers, sisters, and other creatures in this weird world all looking like they've stepped out of someone's fever dreams. You encounter ratlike humans, squirrels with explosive barrels strapped to them, mothers with pigs for babies, and more. The world, too, is all sorts of crazy, particularly the main city of Halstedom, which features some rustic yet decidedly weird architecture. Zeno Clash is proud to show its oddities at every opportunity, but there's never any real internal logic to what's happening. The game seems to be strange purely because it can be, and while it's interesting to come across a game that eschews cookie-cutter narratives, it still becomes grating after a while. The gameplay in Zeno Clash is much more grounded than its story and is, in essence, a first-person brawler. Punches and kicks are your basic attacks, but the game allows you to perform combos when you properly time your attacks in conjunction with dashes, blocks, or parries. You also find weapons ranging from basic clubs to firearms (with Ultimate Edition adding a few not seen in last year's PC release), but they're universally slow to use, meaning it's much more effective to rely on your fists. Landing hits in Zeno Clash feels appropriately vicious, and it's fun delivering wicked-looking knees, uppercuts, or elbows to the various freaks you find in the game. The controls are quite solid and feel more natural than the keyboard/mouse setup of the PC version. Your light and strong attacks are mapped to the controller's triggers, while blocking and fending is easily done using the A button in conjunction with the thumbstick. Unfortunately, picking up objects and targeting foes are mapped to the same button, which can prove tricky when you're surrounded by enemies. This pretty little thing is just one of the freaks you come across. Just like that of its off-the-wall narrative, the appeal of Zeno Clash's combat doesn't last too long. You're able to rely on the same few moves for the entire game, and most of the challenge comes not from increasingly tough or wily opponents, but from the fact that they almost always come at you in groups. Even the biggest enemies aren't too taxing to beat individually, but you're usually attacked by groups of three or four at any one time. Your opponents are happy to take cheap shots from behind or keep their distance using projectile weapons, and the game can become frustrating because of this, especially in its later levels. The PC version's challenge levels make a return in Zeno Clash: Ultimate Edition, and this time, you have the option to tackle them with a partner through Xbox Live or locally via split-screen. These challenge levels are a series of arenas with increasingly tougher groups of enemies, although tackling them with a second player significantly ramps down the difficulty. It's a pity, then, that you can't increase the toughness of these levels. It's even more disappointing that a two-player option wasn't included for the main campaign, which seems like a natural option given the fact that you're accompanied by a fellow tribeswoman throughout most of the single-player story. If the game's oddball nature and average gameplay don't turn you off, then Zeno Clash: Ultimate Edition's single-player campaign will take you about three hours to complete on the first run-through. When you throw in the extra few hours the challenge levels add, the game is fair value for its 1,200 Microsoft points asking price. Strangeness aside, Zeno Clash: Ultimate Edition is an average brawler at best and definitely more of a curiosity than a classic."}