{"ref": "https://www.gamespot.com/reviews/double-dragon-review/1900-6103568/", "date": "July 27, 2004", "game_name": "Double Dragon", "text": "Billy and Jimmy Lee's struggle against Machine Gun Willy and his gang of thugs began back in 1987, when the game Double Dragon was released in arcades. The arcade game featured a surfeit of fighting moves and great weapons, and has since gone on to spawn a number of home releases, few of which came close to capturing the things that made the original game so great. Now, one of the greatest games of all time is available for mobile phones. Like the NES version before it, though, Bandai's mobile version of Double Dragon doesn't do the original justice. This game may share the classic's title and some of its superficial trimmings, but it's been badly marred by slowdown and monotonous gameplay. There are plenty more bad guys where these came from. As the ~protectors of South Town,~ the Brothers Lee put the fear into assorted riffraff and street scum by way of their advanced martial arts skills. One particularly pernicious thug, Machine Gun Willy, has made off with Billy's fiance Marion, prompting the Dragons to both declare war on his gang and invade his turf. Your job is to guide Billy (though there's no good way to implement a two-player mode on mobile, the game doesn't pit you against your brother at the end, as some other versions do) through four levels of punk-trashing action until you reach Willy's inner sanctum, where you'll attempt to put the scoundrel down for the count. There's a ton of bad guys to be dealt with between South Town and Willy's hideout, so it's a good thing that your Lee brother has access to several punishing fighting techniques. You can pummel criminals using kick or punch combinations, you can knock enemies to the ground using elbow punches, you can polish opposition foreheads with your kneecap by using a hair-pull kick maneuver, you can toss adversaries over your shoulder, and you can even launch a devastating, special spin kick on enemies on all sides (at the cost of a health point). In addition, your brawler can pick up and use several different weapons, such as bats, shovels, bombs, and even an odd television-like appliance. Although you can run from side to side, jump attacks are conspicuously missing. It's certainly nice to have these myriad fighting options, but their impacts are profoundly diminished by Double Dragon's slow-paced gameplay. The game runs at a snail's pace on the LG VX6000, with incredibly jerky animation that often makes the game feel almost turn-based. For example, you can't simply hold down a directional key to move. A single press of the direction key in question will move you two spaces using two frames of animation. Furthermore, you have to keep pressing keys to move around the screen and to activate your attacks, which are frustratingly slow-paced in their executions. This slowdown, in combination with very dull enemy artificial intelligence, turns Double Dragon's all-important combat experience into a joyless slog. The intention of beat-'em-up games is to make you feel like you're skillfully defending yourself against impossible odds. Instead, Double Dragon's adversaries seem lethargic and uninterested in attacking you intelligently. They will generally approach you two at a time, angling to walk right up to you to punch you in the face--unless there are weapons on the ground. In this case, they'll make automatic beelines for them. If you simply time your kicks to catch your enemies as they enter your combat range, you can defeat them without much trouble. The only real challenge comes when enemies approach you from both directions, which means that you may have to use a superkick to knock them down to get them in front of you. If Double Dragon weren't unresponsive enough to occasionally prevent you from placing your attacks correctly, you could fly through the game by standing in one place and jamming on the attack keys as enemies walked right into your flurries of blows, even on the hardest difficulty level. Although there are four or five different types of enemies, they are all functionally similar, really differing only in their special attacks. Some baddies will give you a nasty backflip kick, while Abobo-like bruisers will hit you with a high-energy ground-pound. However, it's all essentially the same stuff. Double Dragon looks OK, aside from its moribund rate of animation. The characters and background art are derived from the original version of the game, and though everything's pretty small, the graphics look good. Spit will fly from the mouths of enemies who have been punched in the face, and they will also double over when kicked in the stomach. Double Dragon's sound does the job of getting the action across, but the game could have used a few additional, varied effects--such as groans from expiring gutter trash--like in the classic version of the game. The title theme is spot-on, thankfully. Double Dragon looks good, but it doesn't deliver the fighting goods. Overall, the mobile version of Double Dragon ranks as a disappointment. This iteration of Double Dragon is missing all of the interesting gameplay features that made the original so cool. There are no ladders or terrain to use to your advantage, the screen doesn't scroll, and, ultimately, there are no real reasons to trudge through dozens of identical enemies to reach the game's final confrontation. All told, you're better off leaving this version alone."}