{"ref": "https://www.gamespot.com/reviews/double-dragon-advance-review/1900-6081705/", "date": "November 10, 2003", "game_name": "Double Dragon", "text": "There was no greater time for the genre of arcade beat-'em-ups than the late 1980s, and, for its time, there was simply no greater arcade beat-'em-up than Technos' Double Dragon. Originally released in American arcades in 1987, Double Dragon was the benchmark for what all subsequent entries in the genre tried to be, mixing a healthy dose of addictive one- or two-player beat-'em-up gameplay with a cool story and great visual style. A year later, Tradewest released a watered-down, though still fun, rendition of Double Dragon for the NES, thus introducing home audiences to a series that would continue on home consoles all the way through the 16-bit era. Now, many years after the last Double Dragon sequel, Atlus (along with developer Million), has picked up the Double Dragon name and released Double Dragon Advance for the GBA. Double Dragon Advance is equal parts nostalgia and new, mixing the core gameplay and many key elements from the classic arcade title with a host of upgrades to the fighting system, roster of enemies, and intrinsic art style. Ultimately, it does a fantastic job of bringing Double Dragon into the 21st century. The brothers Lee are back--and they're kicking Shadow Warrior ass up and down the streets of New York City! Even if you think you're not initially familiar with Double Dragon Advance's story, you probably actually are, as it's essentially a form of the same story that every arcade beat-'em-up has enlisted over the years. The game's premise is fleshed out a bit further here than it has been previously. The game's heroes, twins Billy and Jimmy Lee, live in something of a postapocalyptic version of New York City, which has become overrun with crime. There, they run a small kung fu gym, teaching the city's residents how to protect themselves. One day, a mysterious note appears, notifying them that Billy's girlfriend, Marian, has been kidnapped by a gang known as the Shadow Warriors. The letter demands that they hand over the secret book that teaches the secrets of their particular brand of kung fu, known as Sou-Setsu-Ken. Rather than do so, Billy and Jimmy pick up their fists and take to the streets, fighting their way through the roving gangs of Shadow Warriors. Upon first play, anyone familiar with classic Double Dragon will be right at home playing Double Dragon Advance. The basic controls and attacks are still there, as Billy and Jimmy can punch, kick, and jump (and also block) at the press of their respective buttons. The brothers can also grab opponents while stunned and can either toss them over their shoulders, or the brothers can hit them with repeated knee strikes to the head. Aside from these classic maneuvers, multiple new types of attacks are available in Double Dragon Advance. By double-tapping left or right on the directional pad, you'll start to run in either direction. This run function can be capped off with a running punch or kick for a little added damage. Additionally, a running jump can be used for getting over extended gaps. You can now attack downed opponents as well. Simply pressing both attack buttons while standing over a grounded opponent will cause you to perform a brutal-looking double stomp to your foe's chest. Pressing up and down on the D pad in the same position will allow you to mount your opponent's chest, and repeated taps of the punch button will yield a hefty barrage of punches to the bad guy's helpless face. Weapons are also a big part of Double Dragon's combat, and Double Dragon Advance includes all the classics, like baseball bats, throwing knives, whips, and even dynamite. As with the rest of the combat system, Double Dragon Advance also includes a host of new weapons. At various points of the game, you'll have access to a pair of sticks and some nunchakus for fast flurries of attacks, a large battleaxe that works similarly to the baseball bat, and a hefty mace that works like a larger-scale whip. As well and good as the combat is, really, what kind of a Double Dragon game would this be without the usual roster of Shadow Warrior baddies? Well, thankfully, they're all along for the ride. Every classic bad guy, from the lowliest of petty thugs to the ever-popular, bald-headed badass Abobo to the very top rung of the Shadow Warrior ladder, Machine Gun Willy, makes an appearance in Double Dragon Advance. Additionally, many new characters show up in the game, like a pair of speedy twin martial artists (complete with palm strikes and whirlwind kicks) and some suit-sporting thugs who move and look just like the evil agents from The Matrix movies. Double Dragon enthusiasts may also take note of the first boss from Double Dragon II: The Revenge as he makes his presence known in the game as well. While Double Dragon Advance is a blast to play, unfortunately, that blast is all too brief. As this is essentially a remake of a very old arcade title, the game suffers from what practically every arcade beat-'em-up suffers from in that it's simply a very short game. Though challenging, after a few tries through, you're likely to be able to get through the whole game on the normal difficulty in about an hour or so. That may seem shockingly short to anyone less familiar with how notoriously short many classic games of this genre tend to be, but, fortunately, there is a silver lining to be found. Double Dragon Advance features a few other modes of play, besides the standard single-player story mode, including a two-player co-op version of the story mode that uses the GBA connectivity feature (which can only be played if both players own the game), a survival mode where your goal is simply to beat as many enemies as is possible without dying, and a unique mode where you can actually play as both Billy and Jimmy Lee. In this mode, you toggle between characters by pressing the select button, and the uncontrolled character simply stands idly by (as an open target). While this is an interesting idea, it isn't especially well executed, due largely to the clumsy nature of trying to move two characters--one at a time--through a level. Perhaps an AI-controlled ~other~ character would have been a better solution. Double Dragon Advance's upgrades to the classic combat system and its roster of bad guys add greatly to the experience without compromising what made the original game so great to begin with. What Double Dragon Advance may lack in depth, it more than makes up for in sheer style. While the game is largely based off of the arcade version of Double Dragon, the graphical style of the game is somewhat different, looking far more reminiscent of Toei Animation's classic anime Fist of the North Star. It's a great look, and it really comes into play in the game's cutscenes, which, though told through single static shots of each character, look really good. The remainder of the game is vintage Double Dragon through and through, with some slightly altered--though still great-looking--levels, appropriately menacing enemies (especially Abobo, in his many forms) and some very solid, if not terribly fluid, sprite animation. The game's audio is also of excellent quality, with some great combat sound effects and near-perfect interpretations of the ultra-catchy Double Dragon level and menu music. Double Dragon Advance is a great achievement and should serve as an example for any developer who is looking to create a remake of a classic title, as it shows that you can mix both old and new into something extremely playable. While Double Dragon Advance may prove to be a bit too fleeting for anyone seeking a long-lasting gameplay experience and the additional gameplay modes are a bit too restrictive in the design for what they're supposed to be, the game is still great fun and is definitely worth playing through long after you've beaten it the first time. Whether you're a longtime arcade beat-'em-up fan or a younger gamer who's new to the genre, Double Dragon Advance is just what you're looking for."}