{"ref": "https://www.gamespot.com/reviews/dual-hearts/1900-2882481/", "date": "October 4, 2002", "game_name": "Dual Hearts", "text": "Dual Hearts is a new action RPG for the PlayStation 2 from Atlus that bears no relation to the other recently released ~Hearts~ game, Kingdom Hearts. It seems strange, if not downright coincidental, that two action RPGs with such similar names could come out just a couple of weeks apart, but that's exactly what has happened. This fact is unfortunate for Atlus, because Kingdom Hearts' attachment to the Square and Disney names means it will far exceed Dual Hearts in hype, sales, and attention. Dual Hearts may not have such an impressive pedigree, but it does have a fanciful quest, endearing characters, and solid Zelda-style gameplay, and this should more than satisfy true fans of the genre. Dual Hearts casts you in the role of Rumble, the game's token spunky treasure hunter. Rumble has journeyed to Sonno Island to find the Dream Stone, the ultimate in hard-to-find relics, and while searching for the shiny rock, he runs into Tumble, a piglike creature called a baku. Tumble is from a world made up of dreams, and like all baku, he can enter anyone's dreams at will. He has traveled to the real world to protect nine keys that seal an ancient, nightmarish evil away inside a temple, but as fate would have it, he loses track of the keys and they are dispersed across Sonno Island. Tracking down the keys is made a bit more difficult by the fact that they are hidden not in secluded areas of the island but actually inside the dreams of its inhabitants. Tumble needs help finding the keys, and Rumble sees in the quest an opportunity to find the Dream Stone, and so the game begins. Initially, you'll notice that Dual Hearts is set up very much like The Legend of Zelda: Ocarina of Time on the Nintendo 64. Sonno Island is the game's overworld, which you'll traipse around during a built-in day-night cycle as you look for the residents whose dreams have captured the temple keys. Unlike in Zelda, you don't do any fighting in this overworld--your weapons aren't even available there. You can interact with townsfolk, however, and visit a variety of locations looking for new characters to talk to and items to collect. When you find a sleeping person whom Tumble suspects has a key, you can use his powers to enter that person's dream and search for it. These dreams are what make up the game's dungeons, or action stages. Once you've entered someone's dream, you'll encounter the combat-oriented part of Dual Hearts, which is the real meat of the game. The dream stages are also set up mostly like the N64 Zelda games in terms of controls and objectives, but there is also a healthy dose of Mario 64-style platforming and item collecting thrown in. The primary goal in each of the main dreams is to locate the key hidden therein, and to do this, you'll have to fight enemies, solve puzzles, and complete some platforming challenges. At the end, you'll battle a boss monster, also in the Zelda spirit, for possession of the key. In true platforming spirit, however, the dreams contain a lot of items to collect, such as rings, dream energy orbs, and other such tokens. The game keeps track of the percentage of items you've recovered from each dream, and true platforming completists will of course want to revisit each dream to find every item. Each time you recover a key, you can use it to open a new door in the Temple of Dreams, and behind each door, you'll find another of the orbs called holy instruments. In the real world, these are just simple colored balls that don't do much of anything, but in the dream world, they transform into weapons and other useful items. Rumble can be equipped with two of the holy instruments at a time, which allows for some rudimentary combo possibilities. You start out with a sword and a spear, both of which have charge attacks and level-up combos, and you'll gain other items like a bow, a remote bomb, and a ~draw card~ that lets you harness elemental powers. Attacking enemies is made somewhat easier by a lock-on system very similar to those found in other recent games like the Zelda series and Star Fox Adventures. The lock is sometimes difficult to maintain and can be ineffectual when the camera angle changes too quickly, but overall it makes the combat more manageable. Dual Hearts uses something of a buddy system in the combat stages, as Tumble is always close by to provide support during battle. For one, he can be ridden, which allows for improved jumping, flying, gliding, and dashing. He can also refill your life, attack enemies, and perform a ~butt stomp~ maneuver. Most of these actions come at the cost of esamons, which are sort of like Tumble's fuel. Esamons are small flying creatures that Tumble can eat and keep in reserve. Every time you refill a container of life, dash, fly, or perform almost any other Tumble-related action, you use up one esamon. More esamons can easily be obtained from slain enemies and by cutting tufts of grass, though, so you'll have no problem keeping Tumble full. Overall, having a useful sidekick around adds a nice extra dimension to the action. Dual Hearts has a few minor issues, but certainly nothing that will stop you from enjoying it. The graphics aren't the greatest thing you'll ever see on the PlayStation 2, and they're occasionally hit by some frame rate problems, but overall the visuals are nothing to worry about. The control can also take some getting used to, but it becomes second nature after a little while. Also, the game is rather on the easy side. Most of the combat, including the bosses, will present no problems for seasoned players, and the puzzles are often absurdly easy. The platforming elements do provide a decent challenge, though, and overall the game is satisfying despite the ease of some of its elements. Dual Hearts will probably be overlooked by many gamers simply because its release came just days after that of Kingdom Hearts. That's a real shame, because Dual Hearts is well-made and enjoyable enough that anyone who likes action RPGs should have a good time with it. It may not be the most original game, since so many of its elements are lifted directly from Zelda and Mario, but that doesn't stop Dual Hearts from being a lot of fun."}