{"ref": "https://www.gamespot.com/reviews/exit-ds-review/1900-6202080/", "date": "December 9, 2008", "game_name": "Exit DS", "text": "Exit DS is a refreshingly different action-puzzler that should interest puzzle fans bored with positioning awkwardly shaped falling objects onto color-coded grids. The series has met with success on other platforms, thanks to simple but challenging gameplay couched in an aesthetically pleasing comic-book style. Unfortunately, poor controls, a few AI hiccups, and the game's tendency to misinterpret commands mar Exit's DS debut. The game casts you as Mr. Esc, a professional escapologist called upon whenever civilians are trapped inside burning buildings, sinking ships, or any number of life-threatening, collapsible structures. There's very little in the way of a plot, given that Mr. Esc's sole objective is to rescue civilians from impending disaster, although the game does provide some variety by using ~situations.~ These are simple stage settings that range from frozen shopping centers to a UFO, with each containing 10 stages. Manipulate the environment to clear a path for survivors. Gameplay is straightforward and revolves around you guiding Mr. Esc through obstacles on a simplistic 2D side-scrolling field with the help of a handy top-screen map. This usually involves manipulating the environment by activating switches, pushing barrels, stacking boxes, or removing any hazards that might harm you or any civilian companions, whom you can spot by scrolling across the field with the D pad. The stage ends when you've successfully transported all characters to the exit, and a single injury to anyone means a restart. You're given more than enough time to escort everyone to safety, and though the time limit does apply some urgency in the later areas, the lack of pressure throughout most levels may disappoint those looking for a more intense experience. The game's seemingly simple objective belies its difficulty which, despite the forgiving time limit, steadily increases as you progress. Most puzzles require that you use a specific item to remove a threat or reach a certain area, and though juggling items poses its own hardship, the true challenge comes in managing your civilian companions. The companions feature unique abilities that will help you navigate through any peril as well as limitations that will undoubtedly affect your strategic planning. For example, large adults, who are most useful for pushing large boxes, also cause certain floor panels to break under their weight; children, meanwhile, are great at squeezing into tight areas that their heftier counterparts can't reach, but can't climb up or down ledges without an adult's help. Dogs, which have an easy time making long jumps and swimming, are at their best when fetching hard-to-reach items but have limited vertical range. You'll also run across artificial restrictions, such as the companions' inability to operate elevators, as well as injured companions that you'll have to carry to the exit. Furthermore, item usage and level mechanics are slightly adjusted for each situation to increase variety by adding new limitations, such as aliens that can't carry items but can walk through flames. These restrictions significantly impact gameplay, making companions valuable assets as opposed to mere key snatchers. Although the puzzles are challenging, you'll probably experience more difficulty in maneuvering Mr. Esc due to finicky controls that require precise movement and character positioning. For example, to attach a ladder to a hook so you can descend a floor, you'll first have to position Mr. Esc immediately next to a hook, precisely select the hook, and then carefully select the ladder; if you target air instead of the hook, select the incorrect portion of the ladder, or happen to be standing just an inch too far away, Mr. Esc may very well walk right off the edge to his doom. The D-pad controls are slightly better because you don't have to worry so much about precise targeting, but they're also much slower and make for cumbersome character shuffling and instruction, extending the game's already slow pace to the point that it's just easier to stick with the stylus controls. It's possible to issue a string of commands to speed up progression instead of guiding characters through a puzzle element by element, but the game so often misinterprets instructions that you're better off issuing orders individually. Even if you position Mr. Esc at the bottom of a set of stairs and specifically target the top, he'll occasionally stand there stupefied or read the command horizontally instead of vertically, wandering off into a nearby fire. Likewise, he might waste time crawling around on all fours because he misinterprets a simple hang-and-drop command, or break his leg by ~forgetting~ to jump a gap you've ordered him to cross, which makes for especially frustrating stage restarts that aren't your fault. Though companions are usually intelligent enough not to attempt jumps they're destined to fail, they'll still blindly follow you into fires or other hazards if you forget to cancel the ~follow me~ command before navigating through a danger zone. You may also spy them wandering into trouble while carrying out your orders, so it's best to keep a sharp eye on their activities, even if it means tedious babysitting. Manage your companions to form a route to the exit before time is up. The 2D stages consist of simple black silhouettes that achieve a slightly cartoonish look, but you'll find a few bright bursts of color in fires, flooded areas, and other threats. Character models appear rather primitively as anonymous, blocky shadow people, though they do feature small details such as hats or bows, and even Mr. Esc looks dashing in his bold red tie. Characters also move fluidly and add to the game's unique comic-book influence, which keeps the game visually appealing even if it's graphically sparse. You'll find the frequent calls for help from companions waiting to be saved very annoying, but its jazzy background music more than makes up for it. It should take roughly 10 hours to rescue every companion and clear all of the stages, of which there are more than 100. You might enjoy replaying stages to increase your score, which is determined by how quickly you finish a stage, but one play-through is probably more than enough unless you're submitting scores to the game's global ranking via the Nintendo Wi-Fi Connection. Exit DS is challenging and unique, with a great comic-book flair that should please those seeking an unconventional puzzler, but some may be highly disappointed by its finicky controls and frequent command misinterpretation."}