{"ref": "https://www.gamespot.com/reviews/star-trek-d-a-c-review/1900-6242836/", "date": "December 11, 2009", "game_name": "Star Trek: D-A-C", "text": "Deathmatch, Assault, Conquest: These game modes form the acronym in Star Trek: D-A-C's unusually uninspired title. While the game was first released to Xbox Live Arcade in May of 2009, the more recent PlayStation and PC versions add new ships and other new features in an apparent effort to enhance the shallow original. (It's worth noting that the Xbox 360 version has since been updated to include all of the features of the more recent versions.) The additions are welcome, in particular the single-player Survival mode that pits you against increasingly more challenging waves of enemies. However, the D-A-C experience is still characterized by its bland top-down space combat, which is pleasant in small doses but lacks the thrills of other shoot-'em-ups. Furthermore, the game does not reflect the wonders of the franchise, thus making the license seem less of an inspiration and more like window dressing. Survival mode features some pretty backgrounds. Basic gameplay is standard fare for a shoot-'em-up. The three ships of the original Xbox 360 release--the fighter, the bomber, and the flagship--appear in this edition. Fighters shoot lasers, bombers drop bombs behind them that explode a moment later, and flagships let you hover a reticle over your target and let loose a blast of energy. The two additions for the new version are the missile cruiser, which moves slowly and fires balls of energy that may be charged up to do even more damage, and the support frigate, which emits a steady beam that can damage enemies but is more useful for restoring health and power to other ships. In most modes, you choose to fight for either the Federation or the Romulans, but while the ship designs are different for each faction, the ship classes play the exact same way. Once you choose a ship type and a faction, you do battle with AI-controlled enemies or fellow human combatants. The two new ships bulk up the possibilities, but they don't do much to energize the action. The new missile cruiser moves slowly and shoots slowly, and while its laserballs do a lot of damage and even hit enemies offscreen, it controls too sluggishly to feel satisfying. In fact, that looseness is part of the experience regardless of the ship you select. The floaty controls might be meant to approximate what it would be like to fly in the vacuum of space, but their imprecision saps much of the excitement. Rather than the quick and accurate moving and shooting you would hope for, you get loose turning and a slower rate of fire than you would expect, which is further limited by your ship's quick-to-diminish power reserves. Power-ups add a bit of variety, letting you create a clone of your ship to fight alongside you or giving you a temporary cloak, among other possibilities. But the power-ups do little to make the action more compelling, so while you might get enjoyment out of two or three successive matches, Star Trek: D-A-C gets tiresome quickly. The Romulans are coming. Quick, look busy! Team Deathmatch is the most predictable and least exciting of the three competitive modes, because it relies solely on the dull shooting to entertain. Conquest and Assault modes are a better source of amusement. In Conquest, you take over the map by capturing rings, which keeps the action concentrated on a small number of hot spots. Assault works similarly, only an assaulting team must capture the rings in sequence on its way to the defending team's base, while the defenders must thwart the assaulting team's plans. The newer version gives Assault mode a twist, adding turret defenses and a final base assault that the attacking team must undertake, assuming it makes it that far. Unfortunately, it's difficult to find many competitors on either the PC or the PS3, which means that available slots in online games will be filled by AI players. Star Trek D-A-C's AI isn't very good. This is most noticeable in Conquest, where the entirety of your computer-controlled team will clump together in a single capture ring and ignore what is happening elsewhere, and multiple AI-controlled support frigates may follow you about and restore your health at the expense of other ships in greater need. The most notable addition to this version is that of Survival, which is a single-player mode in which you fend off waves of enemies that become harder and harder to defeat. It's the new D-A-C's best add-on, because the action occurs at a faster pace than in other modes and leads to attractive displays of laser fire and explosions. But Survival also highlights the floaty controls, which make it difficult to evade the balls of energy that missile cruisers lob at you and to grab the power-ups and point-increasing drops that destroyed ships leave behind. Nor is there any context for this mode, or any other mode. There is no story, no introduction, nor even a voice-over telling you to boldly go where no man has gone before. It's just one-off matches, and were it not for the naming conventions, ship designs, and melodramatic soundtrack, you'd never know this was a Star Trek game. Expect to have the AI fill most of the slots when you play online. Star Trek: D-A-C's sole spark of originality is that upon defeat, you eject a speedy escape pod that you can control. If you can avoid enemy fire for a few seconds, your ship will spawn back onto the battlefield more quickly than if your pod is destroyed. Otherwise, this is a humdrum top-down shooter that neither takes advantage of its illustrious license, nor supplies the explosive joy you'd seek from the best shoot-'em-ups. The mild pleasures D-A-C initially offers are soon replaced with apathy for its shallow and repetitive gameplay. The improvements over the original release are notable, but they don't remove the game's fundamental flaws--they only veil them."}