{"ref": "https://www.gamespot.com/reviews/headlander-review/1900-6416484/", "date": "July 25, 2016", "game_name": "Headlander", "text": "If you've ever stepped into Samus Aran's boots for a Metroid adventure, you'll instantly recognize parallels in Headlander's world structure, outfits, and animations. It doesn't beat around the bush: you shoot laser guns, explore sprawling maps, and hunt for hidden power-ups--Metroid in a nutshell.On the other hand, years of experience with Samus can't prepare you for Headlander's lead character: a head in a rocket-powered jar. Without a body to call home, you have to decapitate robots and steal their bodies to fight back. This is but one of many refreshing concepts on display, not the least of which is a stylized 70s sci-fi aesthetic that's immediately appealing. Headlander is dripping with color, laced with humor, and anything but typical.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Headlander - Video ReviewThis side-scrolling adventure takes place in a world populated by hedonist robots, who at any given moment are tripping out, trying to get laid, or dancing--just another day in the Pleasure Dome. The denizens' penchant for all things pleasurable is Headlander's primary source of humor, but you find that even service robots--that provide maps and dust floors--offer multiple lines of entertaining dialogue. That said, I could do without the sardonic AI that mans the game's security doors: I know you lead a repetitive life, but don't poison the Pleasure Dome's inkwell with your attitude.You're guided through this world by a man named Earl--a voice on the other side of your communication equipment--who's trying to help you escape the clutches of the lead AI, Methuselah. Earl's southern drawl and lackadaisical personality are a breath of fresh air, portraying a level-headed and helpful gentlemen in a sea of far-out characters. Methuselah fills the perfunctory antagonist role, but your interactions with him are minimal. Headlander puts gameplay and moment-to-moment interactions with quippy NPCs ahead of its overarching story, but the game as a whole is so delightfully entertaining that it's hard to feel too bad about that.When Earl first jars you from a deep sleep, you awake in a state of shock. Without a body, you can't speak or fire back at gun-toting robots. As you venture through the Pleasure Dome and beyond into the belly of Methesula's fortress, you take over robot bodies to gain access to weapons and security doors. Robot bodies are color-coded to security levels, and with each new level, the shots from those robots' laser rifles bounce off one additional surface. Lasers can be used to open doors if you can't walk up to them with a body intact, which becomes necessary for one very important reason: you can't jump. It's a weird omission at first blush, but once you get used to flying your head around in low gravity--a satisfying experience on its own--you quickly forget why you cared about the lack of jumping in the first place.Your head has unlimited propulsion and vacuum power, and it is graceful in flight, carrying momentum and turning on a dime if it needs to. To take over a new host, you can either propel into them to knock their head off after you've upgraded your helmet's thrusters, or use your vacuum ability to pull it off. When you've upgraded your abilities further by collecting scattered bits of energy, you can head-butt other robots to swap heads in a flash. Every victim you possess has its own life bar, but the one associated with your helmet is the one that really matters. Thankfully, it replenishes automatically over a short period of time, so it's easy to recharge if you can fly into a corner and tuck yourself away for a few seconds. Even if you manage to die, Headlander is extremely forgiving, allowing you--in most cases--to respawn in the same room.Multi-stage boss fights and objectives are the only exception, where you are forced to restart from the beginning of your task upon death. This is only troublesome during the game's two boss fights, where death comes at the drop of a hat should you fly erratically and wander into a projectile. The last boss is especially frustrating because it's uniquely challenging--remember, Headlander is typically forgiving, allowing you to play fast and loose--and despite clearly providing tools during the fight to inflict damage, the best way to fight that boss boils down to ramming your head into his weak point and retreating for cover.On your way to Methuselah's doorstep, you are sent on a lot of fetch quests, but it isn't as bad as it sounds: paths contain battle sequences and puzzles that require you to deftly swap bodies and survive stretches of hazardous corridors to arrive at your destination with a specific type of robot. While the shooting could be better, its twitchy nature isn't damning. You control the trajectory of your shots by aiming with the right analog stick, and there are many puzzles and fights that require you to angle your shots just so. Frustration is inevitable when you're carefully aiming shots and enemies keep respawning and firing at you, but these occasions rarely require more than two attempts to overcome.In many cases, you can resort to using your head when a gun proves difficult in the moment; outside of clearing security doors, your head's capabilities are adequate the majority of the time. This flexibility is greatly appreciated, allowing you to run and gun or zip around and decapitate enemies as you wish.When you aren't dead set on accomplishing a mission, you can veer to the corners of maps and hunt for upgrades, or for large doses of energy that you can invest into abilities that manifest when you inhabit a body. The biggest upgrade your head gets is a powerful dash, but there are numerous powerful upgrades that activate when you pilot bodies, which include a rainbow-colored armor aura and the ability to abandon bodies that continuously fire their weapons--essentially turning them into turrets. It will take the entire game to gain enough energy to unlock every upgrade, but it seems like incremental upgrades for your helmet lie in wait around every other corner. The result is an experience like Metroid where your desire to explore is handsomely rewarded, but the pace is sped up, making for an ever-present reward loop.The 10 or so hours it takes to beat Headlander are packed with glimmering visual effects and great tunes that range from light-hearted lounge music to overbearing synth tracks. It's a weird and infectious world that feels like the perfect playground for Headlander's quirky and engaging action. Minus one boss fight and an odd instance of major slow-down in a treacherous labyrinth filled with bouncing lasers, there's rarely a bump in the road that proves significant enough to disrupt the joys of flying around as a head, decapitating robots, and taking over bodies against the game's absurd and colorful backdrop.From its odd mechanics to its captivating presentation, Headlander's parallels to Metroid bubble under the surface; it's the game's fresh qualities that grab your attention and make it one of the most delightful takes on the well-worn formula in years."}