{"ref": "https://www.gamespot.com/reviews/band-of-bugs-review/1900-6173025/", "date": "June 22, 2007", "game_name": "Band of Bugs", "text": "On the surface, spending 800 points on Xbox Live Arcade for a seemingly full-featured turn-based strategy game seems like a good deal. Band of Bugs has a solid single-player campaign, a number of multiplayer modes, and a bunch of maps. The problem isn't that there aren't enough ways to experience the gameplay as much as it is that the gameplay isn't satisfying enough to be worthwhile. If you're a strategy enthusiast, you might be able to look past the simplicity to find some enjoyment in here. But more casual fans of Ninja Bee's prior efforts will probably be surprised by the inconsistent pace and frequently frustrating story mode. Eight-player matches prove that it's a bug-eat-bug world out there. The incoherent story isn't going to involve you, though it features cute dialogue that is good for a few chuckles here and there. There's some stuff going on with special crystals, unusual black bug jelly, and a powerful boss bug that wants to crush your little band of warriors. But it's merely a backdrop to a series of missions that pit your small force of insects against teems of creepy crawlies by dropping everyone onto a grid-based map and letting you have it. In each round, your bugs get one turn, and you can use them in any order you want. A typical turn involves moving your unit to the best square available, attacking an enemy or casting a spell, and then rotating your unit to face the direction that leaves it least vulnerable. Wait for your opponent to take a turn; then, rinse and repeat. You don't have a lot of units at your disposal, but they're well rounded. Your hero unit has a strong melee attack, while your grasshopper archer does decent damage from a distance. Other units include a healer for support, as well as a fire mage for distant attacks and other capabilities. Actual unit abilities aren't especially complex; instead, the variety comes from map geography and additional mission objectives. You'll need to keep your typical turn-based tactics under consideration, such as which direction the enemy bug is facing or whether it's at a lower elevation than your own unit. However, your only goal isn't always destroying annoying arthropods. Every so often, you will have to destroy artifacts, collect eggs, or avoid drifting sand. Sometimes, these objectives are a welcome addition to the ordinary gameplay because they add some needed complexity to the straightforward tactics. But at other times, the added objectives are just an annoyance. For example, in one late mission, you need to move your bugs to a finish line while battling spiders and crossing a path that drops two sections of the gameplay grid at the end of each turn. The mission doesn't require real strategy as much as it plays like a puzzle, requiring you to repeat it multiple times until you get the turns and attacks in just the right order. Many missions require the same kind of trial and error, and they seem out of place on the heels of easier ones that barely tax your strategic wits. You'll usually figure it out after a few tries, but it doesn't feel all that tactical as much as it seems like the game needed to cover up for its undemanding and exploitable artificial intelligence. There are multiple instances where particular unit placements will cause enemy bugs to simply pass their turns repeatedly until you move a unit. This lets you deliver the beatdown with any units in attack range until you're forced to make a move and jump start the gameplay. Band of Bugs is better as an online game, plus you can fool around with a good number of maps and gameplay tweaks. Depending on the options you choose, up to seven other players can join you via System Link or Xbox Live. The options let you take on other players in free-for-all combat or earn points as you fend off spiders--and each other. This is where the good casual fun missing in the campaign comes into play, but also where the bare simplicity of the gameplay is most noticeable. The short turn window and relatively low health of your bugs help make up for it a tad, but it's not all that fulfilling. It's also glitchy. Trying to view the in-game leaderboards caused multiple test machines to lock up every single time, and hosting multiplayer matches often had the same result. As of this writing, it looks like the issue is widespread. Waiter--there's a fly in my soup. Fortunately, Ninja Bee has a way of making its games look appealing, and Band of Bugs is no exception. Insect units aren't all that detailed, but they are vibrant and adorable--for insects. Some of the spell effects are nice, while map features are clear and uncluttered. The sound is functional, with a pleasant soundtrack and a silly brand of gibberish used in lieu of voice acting. But some of the attack noises sound too dinky for their own good. On top of everything else, there's an easy-to-use map editor that's enjoyable to fool around with and a few standalone single-player missions that will also occasionally test your patience. There was an obvious amount of effort given to Band of Bugs, which does have a certain amount of charisma, but the game feels lost in the abyss between mass appeal and cult favorite."}