{"ref": "https://www.gamespot.com/reviews/ncaa-gamebreaker-2003-review/1900-2878015/", "date": "May 17, 2006", "game_name": "NCAA GameBreaker 2003", "text": "NCAA GameBreaker 2003 is in a similar position to that of its professional football counterpart, NFL GameDay, in that the competition is so incredibly strong that it doesn't offer enough to garner your attention. Though, GameBreaker has more than its fair share of problems, not the least of which is an overpowered offensive game that will have you dominating any defensive scheme regardless of the difficulty level. GameBreaker offers all the typical football-game modes. There's a scrimmage option if you want to jump right into a game, as well as a few season options that allow you to lead your team to one of the bowl games or to a championship tournament. The coaching career option offers an interesting take on the typical franchise or dynasty mode. Instead of simply becoming the head coach of any team, you have to scour the country for open coaching positions, which may range from defensive coordinator at Ohio to special teams coach at Navy. The position you take has an impact on what sort of involvement you'll have in the off-season when it comes to recruiting new players. Of course, in some cases, this somewhat defeats the purpose of a dynasty mode, since it can prevent you from taking full control of your favorite program if the only job it's offering is that of the special teams coach. Regardless of the position, you'll still have to take your team through an entire college season in an attempt at making it into one of the bowl games. If you don't perform well enough to make a bowl, then you'll receive a really poor-looking replica of an e-mail from a member of the school's administration stating that the program is disappointed with your performance and that the alumni are really pushing for a winning season next year. However, we also saw an instance in which a particular team had a poor season and received a similar letter and then had even worse season the next year but received a letter congratulating the coach on showing that the team has potential. At the end of the season, you'll get a list of the players who are graduating or moving on to bigger and better things, and you'll have to adjust your scouting accordingly. If you're losing a quarterback or a halfback, then you'll need to focus on those particular areas. When the scouting session starts, the game divides the country into different sections and gives you a limited number of scouting points. Scouting in your home territory costs fewer points, while scouting outside that area costs much more, so you need to make sure that you're looking in the right areas or you'll run out of points rather quickly. When you're done with that particular task, you'll have to arrange phone meetings with individual players, but once again, you'll be limited to a certain number of calls, so you'll need to scour the list of players you've received and choose the most capable players. Next, you'll see a list of players who have joined the program, and you'll be ready to start yet another season. If you fail to perform to the administration's standards, you can be fired from the program, but you can always find a job at another school without any hassle. NCAA GameBreaker 2003's gameplay is completely oriented toward the offense. So much so, in fact, that there might as well not even be a defense out on the field. In the running game, it's incredibly easy to get 13 or 14 yards on a run up the middle thanks to enormous holes in the offensive line and the linebackers' failure to track the running backs--usually it's the safety who will make the stop on a running play. Granted, there are a few times when the defense will stop you for a loss, but it doesn't happen as frequently as you might think, so you're pretty much free to run the ball all day. But you don't really need to since the passing game is equally overpowered. You successfully can throw 10- to 15-yard passes all day long into double and sometimes triple coverage, regardless of the route that the receiver runs--though you'll find that the out passing routes will almost always guarantee you several yards. Just to give an indication of how absurd the passing game is, you can run the fake punt pass play several times over the course of a series and have more than reasonable success with it. As previously mentioned, one of the biggest problems with the defense is the fact that linebackers won't track the running back. You'll see the halfback take the ball right up the middle, but there will be no linebackers to be found, and the cornerback or the safety will end up making the tackle. In addition, while the cornerbacks are usually good about sticking to their coverage assignments, most of them are completely inept when it comes to swatting the ball down or stepping into passing routes for the interception. In fact, most interceptions seem to happen completely by accident. Clearly, some more work could've gone into balancing the game. GameBreaker 2003 looks similar to GameDay 2003, which is to say that it's really lacking in visual appeal. The players are a little blocky, and they're not animated particularly well. However, the player faces do look decent, and there's some nice facial animation, which helps give life to the players. The stadiums are accurate for the most part, but they suffer from a relatively low polygon count and the same generic 2D crowd that the developers have been using for the past few years. The sound in the game is solid, with the commentators providing adequate play-by-play and color for the action occurring down on the field. There's also some nice interaction between the two, but their comments are repeated quite a bit over the course of the game, and the actual audio quality of the commentary isn't all that good, giving it an almost robotic tone. In a college football game, you'd expect to hear plenty of fight songs and marching-band music (a key aspect of the college football experience), and while GameBreaker does have a few tunes, it doesn't seem to have any actual school fight songs. There are just too many problems with GameBreaker to really recommend it to anyone, especially when there are better alternatives available. The gameplay is incredibly unbalanced, the graphics are dated, and, most importantly, the game fails to capture the essence of the college football experience."}