{"ref": "https://www.gamespot.com/reviews/saints-row-review-open-world-nostalgia/1900-6417945/", "date": "August 22, 2022", "game_name": "Saints Row", "text": "It's been nine years since Saints Row IV was released, pitting the 3rd Street Saints against an alien invasion that featured superpowers, time-travel, Matrix-style simulations, and the complete destruction of Earth. Where do you go after a game so ridiculous and outlandish? After a period of absence, rebooting the series sounds like a logical next step, and that's exactly what developer Deep Silver Volition has done with this new, stripped-back Saints Row.It's still not ~realistic~ by any stretch of the imagination, but it is slightly more grounded. However, you still shouldn't envisage finding many of the modern trappings of open-world games. For as much as Saints Row differentiates itself from the bombast of its past few entries, it still closely resembles a game from the same era, leading to an experience that often feels stale and dated.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Saints Row Video ReviewFor the most part, this isn't something you could level at Saints Row IV's approach to freedom around character identity and gender, and this has carried over into the rebooted Saints Row. The character creator lets you design pretty much any person you want. There's a broad range of prosthetic options, various types of vitiligo, a number of sliders for body options that do away with binary gender selection, a choice of six distinct voices, and the ability to make an asymmetrical face, to name just a few of the available options. You can also hop back into the character creator at any point and change your entire look. This sounds like an insignificant feature, but it isn't always a given and speaks to Saints Row's focus on inclusivity.You can create a character that represents you, or simply delve into some of the more eccentric customization options and devise a creation with metal skin, demonic eyes, and glowing red hair. There are already some fairly accurate recreations of Shrek being shared, just to give you an idea of how exhaustive the process is.Once you've finished creating your ideal gang boss, you're thrown into a story centered around four young friends who share a dingy apartment and commit crimes to try and make rent. Saints Row adopts an anti-capitalist stance and touches on some socially conscious issues throughout its first few hours, with characters bemoaning their crippling student debt and lack of health insurance, while also taking a satirical swipe at toxic corporate culture. Alluding to these issues makes the cast somewhat relatable, but it doesn't take long before you're building a criminal empire and discarding these topics in favor of more outlandish endeavors.While the main character is a self-described murder machine, the rest of your friends are well-rounded and avoid falling into a pitfall of homicidal archetypes. The perpetually shirtless Kev, for instance, is obsessed with food and music, regularly talking about the kitchen appliances he hopes to buy when not busy DJing a party. Neena, on the other hand, is a mechanic who loves restoring classic cars but also has an appreciation for art and an interest in gallery curation. Then there's Eli, the strategist and aspirational entrepreneur of the group. He's averse to violence but spends his off-hours LARPing in the desert and shooting like-minded individuals with foam bullets.The heart of Saints Row has always resided in its characters, and the dynamic and playful banter between the friendship group is the highlight of the story. They may be violent criminals, but they're the kinds of people you wouldn't mind hanging out with and provide a bright spot in an otherwise unfulfilling narrative. The overarching plot is fairly boilerplate and plays out as you would expect. It's anticlimactic, too, as most problems are solved with relative ease, adversaries are simply dealt with, and more than a few loose ends remain unresolved. After the previous two numbered games in the series were imbued with such creativity, it's disappointing that the storytelling in this reboot is so humdrum.While the story does touch on some modern social trends, the gameplay feels dated. Much of Saints Row feels like a throwback to the open-world design of a decade ago. Its third-person shooting is adequate, but it's tough to get a good feel for the aiming when playing on a controller. The reticle is always slightly too finicky, even after fiddling with the sensitivity settings to try and find a sweet spot. It's something I grew accustomed to over time, but the best way to approach combat is by making liberal use of the auto-aiming assistance that locks onto targets when aiming down sights. This makes it easier to execute headshots and trigger the satisfying splat that accompanies them.The arsenal of weapons at your disposal is rather lackluster, however. There's the usual assortment of pistols, SMGs, and shotguns, but there's little reason to deviate from the starting assault rifle. The inaccuracy of the SMGs only compounds the game's awkward aiming, and the shotguns feel decidedly weak and are irritatingly slow to fire--an issue when most enemies soak up damage. The base assault rifle excels in any situation, so it quickly became my go-to for the majority of the game, especially since neither of the upgrades for it were all that appealing due to their slower rate of fire.Fortunately, the addition of whimsical skill moves does spruce up combat quite a bit. By completing missions and earning experience points, you level up along a linear progression path where each level unlocks a new skill move. You can assign up to four at once and utilize them in combat by killing enemies to accrue the Flow points you need to activate them. These points fill back up relatively quickly, so it's unlikely you'll ever be left wanting for a chance to use one of these skills.For as much as Saints Row differentiates itself from the bombast of its past few entries, it still closely resembles a game from the same era, leading to an experience that often feels stale and dated.The first one you unlock lets you grab an enemy and stuff a grenade down their pants before heaving them back towards their buddies, which is especially useful for crowd control, on top of just being fun to do. Other skills range from a powerful flaming punch to an anti-gravity device that launches enemies into the air and leaves them defenseless. The standard weapons are lacking, but these skills add some much-needed variety to combat that shake up the familiar routine.For the most part, these skills also incentivize you to push the attack and mix it up in combat, and this is something the game factors into its health system. Your health bar is divided into separate chunks. Your health will recharge automatically if you don't sustain damage for a few seconds, but it will only refill up to the nearest checkpoint--whether that's one-third of your health, two-thirds of your health, and so on. To get more health back, you need to kill enemies by getting up close and performing a stylish execution. You can only use these cinematic takedowns once before the ability needs to charge, but kills recharge the meter much more quickly, so you're encouraged to create mayhem in order to better heal yourself.There's no cover system, only a roll that can help you avoid weapon fire, so combat is all about staying on the front foot and being aggressive to survive. It's at its best when things are frantic and you're overwhelmed by enemies converging on you from all sides. This happens more often on higher difficulties, but the checkpoints in campaign missions are so unforgiving that the tradeoff doesn't seem worth it.When not shooting people, most of your time is spent behind the wheel of various vehicles. Driving in Saints Row feels overly floaty, but this was never a hindrance to my enjoyment of cruising around the city. There's a dedicated drift button that lets you swerve around corners with ease, and the addition of a sideswipe attack makes vehicular combat more exciting. Having to shoot and drive at the same time has never felt good in these types of open-world games, so being able to shunt cars off the road and watch them explode in a fiery blaze is a marked improvement on what's come before.It helps, of course, that the fictional city of Santo Ileso is so visually appealing, mixing towering skyscrapers with quiet suburbs and large swaths of desert. Set in the United States' Southwest, it calls to mind places such as Albuquerque and Reno while being distinctly its own. You can see the influence of Mexican culture in some of its architecture and the beautiful murals adorning certain buildings, while the neon lights of its casinos cast a seedier vibe. It's a shame, then, that the city doesn't produce the emergent action that would give it life. This goes back to the game's archaic feel, where you spend much of your time simply driving back and forth between missions.A significant part of Saints Row's campaign revolves around various Criminal Ventures. Once your startup is up and running, you can purchase these ventures to generate more money and gradually grow your business. You start off with a car dealership before being able to acquire a restaurant, laundromat, toxic waste disposal service, and more. Obviously, each one is a front for illicit activity, and it's your job to help out with that side of the business.You need to steal food trucks full of drugs for the Chalupacabra restaurant, for example, while the car dealership tasks you with jacking specific vehicles around the city. These missions initially seem optional, providing you with another avenue to earn some cash. Before long, however, your progress through the campaign is gated by missions that require you to have purchased and completed a number of these Criminal Ventures. I always had multiple missions available, so it never felt like this halted my progress; the main issue is that these ventures are decidedly milquetoast.Each one usually involves driving from A to B with only minor variations between them. Sometimes you're being chased, other times you have to avoid the police by dodging their big red circles on the mini-map. Either way, it's a lot of driving from point to point, over and over again, and it doesn't take long to become tedious. Some of the ventures offer a little variety, like the clothing brand that asks you to take pictures of different materials, or the medical clinic where you commit insurance fraud by throwing yourself into moving vehicles. The latter has featured throughout the series before and is the best of the bunch; the rest are just bland.The traditional story missions add more impetus by engaging in action-movie hijinks, but the mission design still feels like a relic of the past. One early mission sees you assaulting a convoy by leaping from car to car to make it up the line. This sounds like an exciting set-piece, but in practice, you're just shooting static enemies before watching a short cutscene of your character making an untroubled jump. These missions are still enjoyable at times, but there's always this nagging feeling of dj vu because it all feels so familiar.Even when its creativity shines, it's let down on the gameplay side. One of the Criminal Ventures you can purchase involves Eli's Mad Max-inspired LARPing exploits. These missions are combat-focused and stand out because everyone is committed to role-playing. Your previously violent executions now consist of fake punches and pretend-chest-bursting, and your arsenal is replaced by toy weapons that fire foam projectiles. Later on, there's a giant cardboard worm that knocks people over with its roar, and there's an excellent recreation of the greatest death scene in movie history. I loved everything about this quest line except playing it. Despite all of these changes, combat is very much the same, only you're forced to use bad weapons that take twice as long to kill people. Saints Row has a lot of good ideas, but it restricts itself by not being ambitious enough from a gameplay perspective.It's also worth noting the open-world jank that comes with the territory. There's everything from characters that appear as floating heads to NPCs getting stuck in walls, broken vehicle physics, and enemy AI falling apart to the point where they don't realize you're there. For the most part, these are minor oddities that don't significantly hamper the game, but I also ran into a few more serious issues. During one mission, the scripting failed and left me trapped with no door to go through, while restarting at the nearest checkpoint caused the game to crash. There was another instance where a vehicle I had to destroy was indestructible, and a few other cases where a mission wouldn't progress.Saints Row reins in the absurdity to a fairly significant degree but still manages to indulge in some of the chaotic action and silly hijinks the series is known for. Its story is simple and fairly predictable, yet spending time with its diverse and well-rounded characters makes it worth seeing through to the end. It's a shame the gameplay isn't quite as progressive, opting instead for out-of-date mechanics and level design. Combat is decent, and the story missions are enjoyable when at their most over-the-top, but there's too much bland filler in between. Rebooting the series made sense, yet in many ways, Saints Row is still stuck in the past and struggling to live up to its legacy."}