{"ref": "https://www.gamespot.com/reviews/ninja-blade-review/1900-6241087/", "date": "November 23, 2009", "game_name": "Ninja Blade", "text": "When an action game lets you dress up in pink pinstripes before carving up hordes of gruesome mutants, you know it doesn't take itself seriously. Ninja Blade is such a game, but it's so ridiculously over the top, so rambunctiously insane, that it's hard not to get a total kick out of it. It's an uneven product, both technically troublesome and derivative to the bone. And yet Ninja Blade maintains a breakneck pace while throwing you into one preposterous scenario after another until you need to catch your breath, simply because the onscreen action is so absurdly dazzling--or because you're laughing too hard. So don't expect deep combat, extreme visual prowess, or a finger-breaking challenge. Instead, just prepare for lots of good, frivolous fun that will keep you entertained in spite of some technical flaws. One leg down, seven to go! You should also prepare for more memorable moments than you can shake a katana at. Ken, the star of Ninja Blade, is so sensationally acrobatic that he makes Dante's antics in Devil May Cry seem practically mundane. During the course of the game, he'll sky-surf on missiles, perform gravity-defying stunts on a motorcycle, and ride a wrecking ball to glory, among many other gymnastic feats that would make even Ninja Gaiden's Ryu green with envy. These glitzy, cinematic scenes are laughably ludicrous, and yet they're an absolute hoot to watch and bound to get your pulse pounding. However, you aren't relegated to being a simple observer. Most of this visual insanity is accompanied by quick-time button events, which means that you'll need to keep your eyes glued to the screen even when you'd rather than sit back for a breather. A close-up of Ken's keen eye signals these events, so they'll never catch you off guard--and should you miss a button press, the scene will rewind (a cool-looking effect) and let you try again. Unfortunately, Ninja Blade's QTEs are all too frequent, taking up a huge chunk of gameplay time and all but requiring you to use a controller (hammering on keys and mouse buttons isn't very satisfying). These are fine-looking QTEs, but as well implemented as they are, the game relies on them so often that they become tedious after a while. You'll thankfully spend plenty of time wielding some powerful blades and wreaking havoc on the rooftops of Tokyo. Using the titular single katana, a pair of fast-acting blades, or a heavy but effective sword, you'll slice up a variety of mutated meanies as you seek to liberate Tokyo from a nasty epidemic of demonic, symbiotic worm thingies. Ninja Blade is a fairly straightforward button masher, so you can string your two main attacks, blocks, and jumps into various combos that you unlock as the game progresses. The combat system isn't terribly deep; you won't perform Ninja Gaiden II's wall-leaping slices or use Devil May Cry 4's numerous fighting styles. However, the action delivers a nice feeling of impact and fills the screen with a lot of flashy visual effects. It doesn't deliver much of a challenge, though, and you could finish the game without exploring some of the more snazzy-looking moves. That doesn't mean you can choose a single weapon and mash your way to triumph; some enemies need to be softened with your heavy blade, whereas the speedy dual blades are more effective against certain foes (and helpful when trying to block oncoming projectiles as well). Nevertheless, if you want a decent challenge, you should crank the difficulty up to the highest available setting from the get-go. This is where the wax-on, wax-off training pays off. This kind of button mashing may seem par for the course, and it's derivative to the extreme, but what Ninja Blade lacks in originality, it makes up for with its snappy, enthusiastic pace. The action moves quickly from one scenario to the next, mixing in one boss fight after another and reveling in its gleeful cinematic excess. You'll fend off winged demons in freefall, operate turrets in a number of on-rails shooting sequences, and slice up ghastly fiends on the wings of a soaring airplane (don't ask how Ken defies the laws of physics--he just does). It's all larger than life, particularly when you face the various bosses liberally thrown your way. Many of these encounters are fun, or at least they are the first time around; you'll battle a few of them several times during the course of the game. Some of them, such as a beast-riding femme fatale, are even legitimately challenging. Others aren't tough but require you to whittle away at their health, testing your patience if not your skill. There are other activities that help alleviate any potential tedium. You can run up or along certain walls Prince of Persia-style, though these moments are highly scripted and can't be mixed into battle. Nevertheless, they control pretty smoothly for the most part, and the minor bullet-time effect makes it fun to watch Ken leap from one wall to another. In some places, you'll use a grapple wire to zoom to your next location, or break through walls with your giant sword. You can also enter ninja vision (yes, it sounds cheesy), which slows down time and lets you inflict more damage and see potential spots of interest in the area. More notably, you can unleash the wrath of three different types of spinning blades: fire, wind, and electricity. You'll need them to solve certain types of puzzles (for example, the wind shuriken douses flames), though they can come in handy during battle, if not always because you need them, but because they light up the screen with vibrant special effects. Ninja Blade's visual splendor comes from its boisterous special effects, fantastic in-engine cinematics, and some sparkling city environments. That's not to say that the game is a technical powerhouse, however. The repetitive environments aren't all that imaginative or detailed, and the animations are good but not as slick as in other similar games. Furthermore, technical flaws occasionally intrude on the hacking and slashing. The frame rate tends to dip when battles heat up, and trying to quit the game from the main menu may cause the game to freeze. The audio is equally lively and inconsistent. Ninja Blade sounds appropriately loud and rambunctious, but dialogue cuts out every so often. In addition, sometimes there is an odd delay between the onscreen action and the accompanying sound effects. Riding a missile is awesome, but not the most awesome thing you do. Really. And then you have those unlockable costumes, a common extra found in these types of action games, but delivered here in an uncommonly hysterical manner. You can dress Ken up as an evil ninja and scowl while you play if you prefer, but for a curiously ridiculous treat, don the clown costume and mess around with its color scheme. Such a look doesn't befit a proper ninja, of course, but then again Ken does prefer to leap around Tokyo with flair, so unless you insist on high levels of seriousness in your ninja games, you'll enjoy kicking bad-boy butt in purple paisley. But even if you keep Ken looking prim and proper, Ninja Blade is so much fun you'll want to return once you've vaulted your way through the eight or nine hours it takes to complete it. Even if the amount of content here doesn't rival what you can find in the best action games, Ninja Blade still delivers plenty of boisterous entertainment. This is derivate fun, delivered with panache and a touch of lunacy. While it suffers from a few too many technical flaws, Ninja Blade is still a blast to play."}