{"ref": "https://www.gamespot.com/reviews/ncaa-football-08-review/1900-6175523/", "date": "July 23, 2007", "game_name": "NCAA Football 08", "text": "By now PlayStation 2 and Xbox owners have a pretty good idea of what to expect when it comes to the latest version of their favorite sports franchises. They know the games will look and play pretty much the same as they did the previous year, but there's always the question of what features from the current generation have trickled their way down to these older console versions. When it comes to NCAA Football 08, the answer to that question is, ~Not much.~ If you've been away from the series for a while or you're new to it entirely, NCAA 08 is worth a look, but there's very little here to warrant a purchase if you already own last year's game. NCAA 08 plays as great as ever. When compared to the Xbox 360 and PlayStation 3 versions of the game, NCAA 08 on the Xbox and PS2 gives you quite a bit to do; however, you're looking at pretty much the same options as last year's PS2 and Xbox games. You can play a rivalry or mascot game, scrimmage, practice, and participate in spring drills. The spring drills, which test your skills in nearly every position, are a great way to learn the game, but they're old hat for NCAA Football veterans. New this year is points pursuit, which is basically football with an arcade twist. You'll see more over-the-top plays here, and you're awarded points for big plays on both offense and defense. It's interesting, but it doesn't add much to the game as a whole. You can try to become an all-time great in campus legend mode. Here you start with a high school player, perform a series of drills in front of scouts, pick your school, and then try to balance academics and athletics by playing games, going to practice, taking tests, and choosing how you spend your free time. Again, it's fun but nothing really new. Online play is back, and it's largely unchanged. There are a healthy number of options, and you can even check out the latest sports news via the ticker that runs across the screen or by reading articles from ESPN.com. Online play works well, though we did suffer a bit of lag that made it tough to kick accurately. Dynasty mode has received some tweaks and changes, but in what's a recurring theme for the game, it doesn't play much differently. In the preseason you pick a school, redshirt some players, adjust your schedule, and then run some drills. These drills, which are the same as the spring drills mentioned earlier, will let you boost the attributes of a select few players. That means you'll have to decide whether to give that senior QB a shot at improving his accuracy with the hope that he'll be able to bring home the title, or if you should plan for the future and let that redshirt freshman get a shot. Speaking of redshirts, you can now request a medical redshirt for a player who is injured early in the year. It's a minor addition, but one that hardcore fans will appreciate. Recruiting didn't get the same makeover as the PS3 and Xbox versions. You'll pick players to focus your efforts on and divvy up how many hours you want to spend interacting with each player. You can even make promises to players such as a particular jersey number or position, but unless you want them to transfer to another school you'll want to keep your word. During the season you'll be able to keep tabs on your team as well as the other top teams in the nation and even the Heisman race in the ESPN The Magazine feature. Winning the Heisman and other awards is more meaningful than ever this year, because you can now admire the fruits of your labor in your school's shrine--a large trophy room that displays your trophies, unlocked pennants, and even snapshots you've saved from in-game replays. On the field NCAA 08 shows the benefit of being the eighth game in the series on the PS2 and Xbox. The gameplay is very refined and in many ways is better than that of the 360 and PS3, even if it is more arcadelike. The game moves at just the right speed; it's neither too fast nor too slow, but lots of points are scored. On the offensive side of the ball you now have the ability to run trick plays like the hook and ladder and the Statue of Liberty. These are mostly novelties, though, since busting them out against the CPU is usually a disaster. Other than the trick plays, the playbooks are largely unchanged. This is good because there are tons of plays, but after seeing how well-organized they are on the 360 and PS3 it's disappointing that the play-calling interface wasn't improved here. The controls are tight, and the ability to shrug off would-be sacks by flicking the right analog stick is a nice touch (if you're the QB--it's superfrustrating if you're the person who missed the tackle). There haven't been a lot of changes to how the game plays defensively. You can actually block field goals and punts, which is nice. Before the snap you can move defenders to protect the area around the first down maker; this alleviates those frustrating moments where the soft part of your defense always seems to be where the first down is. Scrambling quarterbacks are still tough to deal with, but you can instruct your linebackers to shoot around the offensive line to keep the QB in the pocket. Sadly, super sim, one of the best features of the 360 and PS3 version because it lets you skip ahead one play, a whole possession, quarter, or even an entire game, is nowhere to be found here. Visually, NCAA 08 doesn't look much different from last year, but that's OK because it really captures the college football atmosphere. The stands are packed with rabid fans who can shake the screen when they get fired up; marching bands that blare their school's fight song; and cheerleaders who jump, cheer, and even fire off cannons. Even the pregame, where Lee Corso dons the mascot's head of the team he's predicting, is here. None of this is new, but these little touches are what set the game apart from Madden, and they're a big reason why NCAA 08 is great. The players look very nice, too. There's a wide variety of body types, so it's easy to tell the difference between a running back, offensive lineman, and tight end. But even more impressive than how they look is how they move. Player animation is outstanding, even if it doesn't look much different than before. Both the Xbox and the PS2 versions have a widescreen option, but only the Xbox has progressive scan support. The Xbox game also has better-looking players and an overall cleaner look, making it the better looking of the two. NCAA 08 does a great job of capturing the excitement of a big college football game. Did you like how last year's game sounded? If you did, and you weren't sick of the commentary from Lee Corso, Kirk Herbstreit, and Brad Nessler, you'll like how 08 sounds because it's pretty much the same. The trio has nice chemistry and offers a bit of in-depth analysis, though they do get behind from time to time. Corso's goofiness has also been toned down a bit. This means you're less likely to hear him repeat his silly sayings, but those sayings are kind of his appeal, so it's a bit disappointing. As usual, the fight songs in the game sound great, though you might go insane by the time you hear your school's fight song for the 200th time. Thanks to the fact that it doesn't do much new, NCAA Football 08 is one of those rare great games that's difficult to recommend. There's simply not enough new here to justify the $40 price tag on the Xbox and $50 (!) on the PlayStation 2. It's hard to imagine there are many Xbox and PS2 owners who have never played the series and are now suddenly curious about college football--but if you do fall into this category, NCAA 08 is a great game that's worth a look."}