{"ref": "https://www.gamespot.com/reviews/ncaa-football-08-review/1900-6175449/", "date": "July 20, 2007", "game_name": "NCAA Football 08", "text": "NCAA Football 07 was a great game but it suffered from many of the same problems that other series experienced in their transition from one generation of consoles to the next, most notably a lack of game modes and features. That's not a problem in NCAA Football 08. Even if the presentation is largely unchanged, there's no shortage of ways to stay occupied. The new campus legend mode and super sim are also nice additions to an already great-playing game. Running the option never gets old. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: NCAA Football 08 Video Review 1 Last year's relatively light list of game modes is a thing of the past. You can play a quick game, hop online for an unranked or ranked game, play a few minigames, take over a college program in dynasty mode, or try to become an all-time great player in campus legend mode. NCAA 08's minigames are the same as 07's minigames. Tug-of-war, bowling, and option dash are a lot of fun if you didn't play them to death last year, but it would have been nice to have something new. Online play is OK, but lag makes it consistently difficult to tackle and kick. Though online play and minigames are underwhelming, the rest of the game modes make up for the underwhelming parts. If you're online, you can use the new Weather Channel feature to play in the same weather as the real stadium in which you're currently playing. You could always change the weather on your own before, but this is a cool addition especially because playing in rain and snow really affects how players move more than ever. At first glance, dynasty mode isn't terribly different from last year's mode. You still pick a school (you can't create your own), set your lineup, adjust your schedule, and try to lead your team to a national championship or win as many games as possible so you can earn offers from a more prestigious school. To find success on the field, you'll need to work hard off the field recruiting, and this is where you'll notice the biggest change to dynasty mode. Recruiting now has a lot more of a hands-on feel to it. You select 35 players to focus your efforts on, rank them, and then call them on the phone to establish a relationship. Once you've got them on the phone, you choose from a variety of topics to discuss with your recruit. You can talk about your school's fans, TV coverage, athletic facilities, tradition, and more. Your school is ranked in each category, so you'll want to pick your program's strengths and hope they match the interests of your player. If he's feeling your pitch, a football icon at the top of the screen will smile; if you're not on the same wavelength, the icon will frown, and eventually, the player will hang up on you. Once you've garnered significant interest from the recruit, you can schedule a campus visit and up to three activities during the visit. You'll want to pick the things the recruit is most interested in, which is why you should find out what the player feels is important about his college experience when you've got him on the phone. But you've only got 10 hours per week to talk, and each pitch you select takes several minutes off the clock, so you'll need to budget your time wisely. You can offer a scholarship at any time, which the player can accept right away, mull over, or reject based on his interest level. If you're having a hard time nailing down a commitment, you can make promises to the player. This option is only available in the offseason and lets you promise playing time, personal accolades, or even championships to the player. If you make good on a promise, your integrity rating goes up and you're given access to more promises. If you fail to keep your promise, your integrity goes down and your promises won't carry much weight. This new recruiting system is a lot of fun for a while, and you really feel like your decisions are affecting each player's interest in your school. But by the end of the first season, you'll start to notice that you're just doing the same thing over with each player, and that yapping on the phone with 35 players is rather time consuming. It takes a lot of work to build a college football dynasty. If you're not in the mood to take the reins of an entire program, you can create a high school player in campus legend mode. Once you've picked your position and school, you'll find yourself in your state's playoffs. You've got extra incentive to win and play well because scouts are at each game rating your performance. When the playoffs are over, you're presented with a list of schools that are interested in your services, as well as where you rank on their depth chart. At first, you're not going to be a starter at a top-25 school. To move up the depth chart, you'll have to attend practice. Here, you're given 10 reps and you earn points for successful plays. When you've got enough points, you'll move up on the depth chart. This might sound like a lot of work, but even if you're the fifth-ranked player at a position, you can take the starting spot in a matter of weeks, and once the job is yours, you can't lose it. Not only will you have to attend practice, but you'll also have to make decisions on how to spend your free time. These choices are presented in a ~choose your own adventure~ format. You will have you decide what to eat, whether or not to play darts, how long to study, and when to hang out with your friends. If you make a good decision, you'll often be rewarded with attribute boosts, but if you choose poorly, you can find yourself with bad grades or even injured. This is an interesting concept, but you never know what the ~right~ decision is, and many of the situations are just plain goofy (like when you burn your hand frying pickles). Thankfully, actually playing in games makes up for the somewhat uninteresting time between them. You'll only play when your player is on the field, which is nice because you can breeze through games in no time at all. Because you're the player and not the coach, you might not get the ball every time, but it's always fun to get it through a key block that springs another player for a touchdown. The camera focuses on your player, and while it does a decent job of keeping up with you, it often doesn't show enough of the field around you, which is frustrating when it causes you to run into a defender just offscreen. The game's action on the field during regular game modes, such as exhibition and dynasty, doesn't feel much different from last year. For the most part, this is a good thing. The controls are tight, and it's easy to quickly adjust your defense or call hot routes on offense thanks to clever use of both analog sticks. The right analog stick is also used to nice effect during plays. On offense, you can flick the stick to juke and use it to go high or low to deliver bone-crushing big hits. The game moves at just the right speed; not too fast and not too slow. One of the best things about playing college football games is running the option, and NCAA 08 does it well. However, quarterbacks almost never make a bad pitch, even when they're being hit by two players and flinging the ball backward over their shoulder. Hold on tight to the ball because there are enough turnovers without you being careless. But you'll come to appreciate this because there are so many other ways to turn the ball over. Even with gameplay sliders changed to prevent them, there are an inordinate amount of fumbles and interceptions--sometimes as many as 10 per game with five minute quarters. Raising the difficulty to Heisman alleviates this problem a bit, but most people aren't good enough to play on this setting, so it's little consolation for the average Joe who's frustrated by turnovers. The playbooks are deep, but because you can pick plays based on Lee Corso's recommendation, play type, and formation, it's not too tough to navigate. It's not quite as easy on defense, but it's still not bad. If you dig deep enough into the playbook, you'll find that trick plays have been added this year. Like play action, these trick plays stand a decent chance of working against a human opponent but are worthless against the CPU. The biggest change to how the game plays actually has to do with how it lets you not play. At any point during the game, you can choose the super sim option and skip a single play, an entire possession, quarter, or game. If you choose to simulate more than one play, you can interrupt at any time should things start to go poorly. This is a fantastic option for people who don't like playing defense (or offense), as well as those who want to skip the end of blowouts. It's also great for people who enjoy playing multiple years of dynasty mode, but who don't necessarily want to simulate an entire game or play every snap of every game either. Visually, NCAA 08 doesn't look much different from last year, which includes the obnoxious sponsor logos that stick out like sore thumbs. There are more stadiums included this time around. While there are some inaccuracies here and there, the stadiums look great. The stands are packed with rabid fans, and mascots still patrol the sidelines. But it's what's not here that makes NCAA 08 feel a lot like a pro game; namely referees, marching bands, fans with signs or painted faces, and cheerleaders that detract from the college football feel. Other than some nasty clipping issues, the players look great. There are a wide variety of body types, so it's easy to tell the difference between a running back, offensive lineman, and tight end. But even more impressive than how they look is how the players move. Player animation is outstanding, and you'll be seeing moves for the first time a dozen games into your first season. Running backs will slink through the grasp of would-be tacklers; defensive players will team up for vicious gang tackles; and wide receivers will leap, snag the ball with one hand then crash to the ground. Thanks to a faster, smoother frame rate and better-looking player shadows, the 360 version of the game gets the nod over the PS3, which struggles to run smoothly even at half the frame rate. The main menu screen is home to the biggest change in the game's presentation this year. The background screen is your school's trophy room, complete with trophy cases, video screens, and banners. You can fill this shrine by winning titles, individual player awards, and rivalry games. Each trophy is re-created with a detailed 3D model that you can view from all angles while Chris Fowler gives you a bit of history about the trophy. The main video screen shows in-game highlights that can be saved at any point during a game, and the screens on either side show still photos that are acquired the same way. The trophies and highlight reels are a cool way to remember great plays from the past, as well as a welcome addition to the series. Did you like how last year's game sounded? If you did, and you weren't sick of the commentary from Lee Corso, Kirk Herbstreit, and Brad Nessler, you'll like how 08 sounds because it's pretty much the same. The trio has nice chemistry and offers a bit of in-depth analysis, though they do get behind from time to time, particularly during punts. Corso's goofiness has also been toned down a bit. This means you're less likely to hear him repeat his goofy sayings, but his goofy sayings are kind of his appeal, so it's a bit of a Catch 22. As usual, the fight songs in the game sound great, though you might go insane by the time you hear your school's fight song for the 200th time. The stadiums look great, but the game's atmosphere is still lacking. Almost across the board, the new content EA added to NCAA Football 08 makes it a better game than last year. The ability to sim all or portions of a game at any time is fantastic and feels like such a no-brainer you may wonder why it didn't happen before 2007. Campus legend mode is fun, even if it is a bit shallow, as is the recruiting, which could be great if it were fleshed out a little more. It's also cool to be able to check out your highlights and trophies in your school's shrine. While these additions are welcome, it feels like EA skimped a bit on the stuff that happens after the kickoff. The in-game presentation doesn't have much of a college football feel to it, and the amount of turnovers will likely frustrate many hardcore fans. But even with these issues, NCAA Football 08 is a great game and another step in the right direction for the franchise. The game's action on the field during regular game modes, such as exhibition and dynasty, doesn't feel much different from last year. For the most part, this is a good thing. The controls are tight, and it's easy to quickly adjust your defense or call hot routes on offense thanks to clever use of both analog sticks. The right analog stick is also used to nice effect during plays. On offense, you can flick the stick to juke and use it to go high or low to deliver bone-crushing big hits. The game moves at just the right speed; not too fast and not too slow. One of the best things about playing college football games is running the option, and NCAA 08 does it well. However, quarterbacks almost never make a bad pitch, even when they're being hit by two players and flinging the ball backward over their shoulder. Hold on tight to the ball because there are enough turnovers without you being careless. But you'll come to appreciate this because there are so many other ways to turn the ball over. Even with gameplay sliders changed to prevent them, there are an inordinate amount of fumbles and interceptions--sometimes as many as 10 per game with five minute quarters. Raising the difficulty to Heisman alleviates this problem a bit, but most people aren't good enough to play on this setting, so it's little consolation for the average Joe who's frustrated by turnovers. The playbooks are deep, but because you can pick plays based on Lee Corso's recommendation, play type, and formation, it's not too tough to navigate. It's not quite as easy on defense, but it's still not bad. If you dig deep enough into the playbook, you'll find that trick plays have been added this year. Like play action, these trick plays stand a decent chance of working against a human opponent but are worthless against the CPU. The biggest change to how the game plays actually has to do with how it lets you not play. At any point during the game, you can choose the super sim option and skip a single play, an entire possession, quarter, or game. If you choose to simulate more than one play, you can interrupt at any time should things start to go poorly. This is a fantastic option for people who don't like playing defense (or offense), as well as those who want to skip the end of blowouts. It's also great for people who enjoy playing multiple years of dynasty mode, but who don't necessarily want to simulate an entire game or play every snap of every game either. Visually, NCAA 08 doesn't look much different from last year, which includes the obnoxious sponsor logos that stick out like sore thumbs. There are more stadiums included this time around. While there are some inaccuracies here and there, the stadiums look great. The stands are packed with rabid fans, and mascots still patrol the sidelines. But it's what's not here that makes NCAA 08 feel a lot like a pro game; namely referees, marching bands, fans with signs or painted faces, and cheerleaders that detract from the college football feel. Other than some nasty clipping issues, the players look great. There are a wide variety of body types, so it's easy to tell the difference between a running back, offensive lineman, and tight end. But even more impressive than how they look is how the players move. Player animation is outstanding, and you'll be seeing moves for the first time a dozen games into your first season. Running backs will slink through the grasp of would-be tacklers; defensive players will team up for vicious gang tackles; and wide receivers will leap, snag the ball with one hand then crash to the ground. Thanks to a faster, smoother frame rate and better-looking player shadows, the 360 version of the game gets the nod over the PS3, which struggles to run smoothly even at half the frame rate. The main menu screen is home to the biggest change in the game's presentation this year. The background screen is your school's trophy room, complete with trophy cases, video screens, and banners. You can fill this shrine by winning titles, individual player awards, and rivalry games. Each trophy is re-created with a detailed 3D model that you can view from all angles while Chris Fowler gives you a bit of history about the trophy. The main video screen shows in-game highlights that can be saved at any point during a game, and the screens on either side show still photos that are acquired the same way. The trophies and highlight reels are a cool way to remember great plays from the past, as well as a welcome addition to the series. Did you like how last year's game sounded? If you did, and you weren't sick of the commentary from Lee Corso, Kirk Herbstreit, and Brad Nessler, you'll like how 08 sounds because it's pretty much the same. The trio has nice chemistry and offers a bit of in-depth analysis, though they do get behind from time to time, particularly during punts. Corso's goofiness has also been toned down a bit. This means you're less likely to hear him repeat his goofy sayings, but his goofy sayings are kind of his appeal, so it's a bit of a Catch 22. As usual, the fight songs in the game sound great, though you might go insane by the time you hear your school's fight song for the 200th time. The stadiums look great, but the game's atmosphere is still lacking. Almost across the board, the new content EA added to NCAA Football 08 makes it a better game than last year. The ability to sim all or portions of a game at any time is fantastic and feels like such a no-brainer you may wonder why it didn't happen before 2007. Campus legend mode is fun, even if it is a bit shallow, as is the recruiting, which could be great if it were fleshed out a little more. It's also cool to be able to check out your highlights and trophies in your school's shrine. While these additions are welcome, it feels like EA skimped a bit on the stuff that happens after the kickoff. The in-game presentation doesn't have much of a college football feel to it, and the amount of turnovers will likely frustrate many hardcore fans. But even with these issues, NCAA Football 08 is a great game and another step in the right direction for the franchise."}