{"ref": "https://www.gamespot.com/reviews/star-trek-bridge-commander-review/1900-2854221/", "date": "May 17, 2006", "game_name": "Star Trek Bridge Commander", "text": "For more than a decade, Larry Holland and the team of developers at Totally Games have consistently released acclaimed simulations. After releasing a trio of critically and commercially successful World War II combat flight sims, Totally Games abandoned realistic simulations and opted to produce the X-Wing and TIE Fighter Star Wars sims for LucasArts. Given its history and expert handling of the Star Wars license, Totally Games was a natural choice to produce a space sim based on science fiction's other famous franchise, Star Trek. While some gamers cynically believed that the slow-paced capital-ship battles of the Star Trek universe could never be effectively translated into an enjoyable space sim, Totally Games has convincingly disproved those beliefs in its latest effort. Despite its short length and a few other problems, Star Trek Bridge Commander is an innovative, entertaining simulation that adapts its licensed subject material in a manner that should satisfy even the franchise's most zealous fans. Bridge Commander isn't the first space sim set in the Star Trek universe, but it is undoubtedly the best one. Previously released games such as Starfleet Academy and Klingon Academy just supplied ammunition to those who believed that the nature of combat in the Star Trek universe couldn't be translated into an interesting game. The Star Trek universe minimizes the role of small fighter craft and focuses on large, durable starships, and yet vessels in previous Star Trek sims handled like fighters instead of like more-formidable craft. The Academy games inappropriately tried to pigeonhole the fast-paced dogfights of conventional space sims like X-Wing and Wing Commander into games based upon the Star Trek universe. And although Totally Games helped to fashion many of those conventions through its work on the X-Wing games, it has avoided making the same mistakes made by the creators of those earlier Star Trek space sims. In Bridge Commander, battles are slow-paced tactical contests in which success doesn't depend upon quickly lining up targets for your ship's forward guns. Combat perfectly resembles the battles depicted in the various TV series and in movies like Star Trek II: The Wrath of Khan. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Star Trek Bridge Commander Video Review Totally Games did make some gameplay compromises in order to permit Bridge Commander's battles to be so similar to those in the Star Trek movies and series. As you'd expect given their immense size, ships change directions sluggishly, but generally movement also just doesn't seem to flow smoothly, and it's sometimes inordinately difficult to close range or effectively outmaneuver even slower vessels. While there are computer-controlled assists available to let you better intercept targets, it still seems as though the developers were so determined to prevent battles from devolving into turning chases that they artificially crippled your ability to track and circle enemies. Even if that's the case, those compromises were worthwhile, since they make these Star Trek vessels feel like large naval ships instead of fighter planes. All space sims to date have been primarily focused on combat, and that tradition continues with Bridge Commander since the game is essentially a linear series of combat missions. However, unlike other space sims, Bridge Commander occasionally throws in noncombat solutions to confrontations and requires you to spend a significant amount of time doing activities that are ancillary or unrelated to the game's battles. Bridge Commander casts you in the role of a nameless, faceless, and voiceless commander of a couple of the Federation's most powerful starships shortly after the end of the Dominion War depicted in Star Trek: Deep Space Nine. Set entirely within an inhospitable region of space called the Maelstrom, Bridge Commander has a detailed storyline that involves investigating the cause of a mysterious supernova and uncovering the involvement of the region's Cardassian, Klingon, Ferengi, and Romulan inhabitants. Bridge Commander consistently requires you to interactively advance the story by investigating events and discussing events with various nonplayer characters. There isn't a lot of depth to those interactions, and the apparent ability you are granted to influence events or nonlinearly explore the region is illusory, but the noncombat portions of Bridge Commander are sufficiently engaging to make it seem almost as much an adventure game as it is a space sim. It also seems appropriate that the game isn't entirely focused on combat, given Star Trek's emphasis on exploration and the Federation's peaceful intentions. Presumably to make you personally identify with your character, your character is nondescript and never even speaks in the game, but each of your bridge crew members is given a colorful personality. Missions seamlessly blend into each other, and during the course of missions your crew will discuss events among themselves and provide you with appropriate advice and direction. Star Trek mainstays Commander Data and Captain Picard both make appearances in the game, voiced by their real-life alter egos, Patrick Stewart and Brent Spiner. Consistent with its inclusion of adventure game elements, Bridge Commander lets you play the entire single-player game from the perspective of the captain's chair on the bridge. You can use the mouse to look around at the other crew members and to bring up command menus at each crew member's station, or you can just rely on hotkeys to immediately bring up those menus. Playing from the captain's perspective definitely offers an unusual simulation experience, since you'll be entirely reliant on the skills of your computer-controlled crew to maneuver your ship and effectively target opponents. When played from that perspective, the game seems uniquely suited for voice-recognition control software such as Microsoft's Game Voice and Game Commander 2, and Totally Games had the foresight to include custom-made profiles for use with these.While solely commanding from the bridge is a viable option, as the AI is just adept enough to get the job done without more direct guidance, the game is considerably easier if you take advantage of the tactical, behind-your-ship perspective that is also available. From that perspective you can still issue commands from any of the bridge stations, but you can also directly control your ship's maneuvering and aim its weapons. Perhaps hoping to avoid the commercial curse infecting recent joystick games, Bridge Commander doesn't even include an option to play the game using a joystick. Instead, you control your ship in the tactical perspective using the keyboard commands typically used by first-person shooters, while relying upon the mouse to aim and fire weapons. The tactical control scheme works well, and the game is easier to play from that perspective, which is also the only viewpoint offered in the multiplayer version of the game. Your crew members do a good job of following orders. Combat is definitely tactical, although it's repetitive since there are only a handful of enemy types and each ship essentially has only one beam weapon and one set of missile weapons. Since ship shields are very powerful, battles take a long time to resolve, and you'll have to be diligent about focusing your weaponry on previously damaged enemy shields in order to inflict meaningful damage. Targeting subsystems is also very important, since you can defang even formidable opponents by destroying their weapon systems, and it's difficult to prevent target ships from fleeing unless you first take out their warp drives. Maneuvering your ship is important both to ensure that your craft's strongest shields are absorbing the brunt of enemy attacks and to be able to bring fully charged phaser banks into range. You can also control the sequence in which damaged systems are repaired, and you are required to shift your ship's allocation of power in response to changing needs. Totally Games did an excellent job at ensuring both that there is a lot of tactical depth to the gameplay and that the control scheme is relatively simple to manage once you acquire some familiarity with it. Graphics and sound effects are both excellent in Bridge Commander, effectively re-creating the sights and sounds of the Star Trek universe. There are a variety of graphical options to tune that allow the game to play smoothly even on lower-end machines meeting the game's requirements, although there are some glitches with the current Nvidia card drivers that cause occasional problems. The game suffers from a significant memory leak, which may be related to the Nvidia driver problems, that results in performance gradually degrading after playing for a couple of hours until you reboot the game. A variety of graphical resolutions up to 1600x1200 are supported, and unlike in many games that support such high resolutions, the interface readouts have been customized to ensure that they are still easily readable regardless of resolution. Area-specific damage is modeled, letting you occasionally, although infrequently, take significant pieces out of enemy ships, which looks great. Unfortunately, the damage-modeling system wasn't ported to the multiplayer version of the game. The characters have digital face textures, so recognizable characters in the game like Data and Picard look as you'd expect. Characters' lips move out of sync with their dialogue, though, which looks pretty goofy unless you're a devoted fan of Japanese monster movies. This is the first Star Trek sim to truly capture the feel of the series. The game's campaign is relatively brief, which significantly affects the game's longevity since the linear nature of the missions offers limited replayability. The game's multiplayer options do little to add replayability, although they do give you the opportunity to pilot a greater variety of ships. Multiplayer battles are straightforward single deathmatches, team deathmatches, or simplistic base-defense battles, and the multiplayer code is so flaky that it regularly causes crashes. Also, the single-player campaign's linearity can frequently cause some frustration, since failing to complete a mission goal will usually require you to repeat the mission. You can never directly choose to save the game, and although the game automatically saves itself after each mission, it's tedious to replay missions since many of them are very lengthy. Since each battle usually takes at least five minutes, and missions are often broken into several encounters, you'll occasionally have to replay lengthy sequences just to try to accomplish a goal that previously eluded you. The game should have either automatically saved after each encounter or given you the option of saving during a mission by returning to your starbase. You can, at least, return to your base during missions to repair damage from previous encounters. With a couple of notable exceptions, the individual missions are also not very difficult on the default difficulty level. None of the missions are as difficult, or as puzzle-oriented, as some of the more notoriously challenging missions in Totally Games' X-Wing games. While its short duration and limited replayability may prevent it from enjoying a sustained life on your computer's hard drive, Bridge Commander is the first Star Trek space sim that actually feels like it's set in the Star Trek universe. Totally Games has managed to accurately translate the slow-paced tactical battles of the Star Trek universe into an interesting game.While solely commanding from the bridge is a viable option, as the AI is just adept enough to get the job done without more direct guidance, the game is considerably easier if you take advantage of the tactical, behind-your-ship perspective that is also available. From that perspective you can still issue commands from any of the bridge stations, but you can also directly control your ship's maneuvering and aim its weapons. Perhaps hoping to avoid the commercial curse infecting recent joystick games, Bridge Commander doesn't even include an option to play the game using a joystick. Instead, you control your ship in the tactical perspective using the keyboard commands typically used by first-person shooters, while relying upon the mouse to aim and fire weapons. The tactical control scheme works well, and the game is easier to play from that perspective, which is also the only viewpoint offered in the multiplayer version of the game. Combat is definitely tactical, although it's repetitive since there are only a handful of enemy types and each ship essentially has only one beam weapon and one set of missile weapons. Since ship shields are very powerful, battles take a long time to resolve, and you'll have to be diligent about focusing your weaponry on previously damaged enemy shields in order to inflict meaningful damage. Targeting subsystems is also very important, since you can defang even formidable opponents by destroying their weapon systems, and it's difficult to prevent target ships from fleeing unless you first take out their warp drives. Maneuvering your ship is important both to ensure that your craft's strongest shields are absorbing the brunt of enemy attacks and to be able to bring fully charged phaser banks into range. You can also control the sequence in which damaged systems are repaired, and you are required to shift your ship's allocation of power in response to changing needs. Totally Games did an excellent job at ensuring both that there is a lot of tactical depth to the gameplay and that the control scheme is relatively simple to manage once you acquire some familiarity with it. Graphics and sound effects are both excellent in Bridge Commander, effectively re-creating the sights and sounds of the Star Trek universe. There are a variety of graphical options to tune that allow the game to play smoothly even on lower-end machines meeting the game's requirements, although there are some glitches with the current Nvidia card drivers that cause occasional problems. The game suffers from a significant memory leak, which may be related to the Nvidia driver problems, that results in performance gradually degrading after playing for a couple of hours until you reboot the game. A variety of graphical resolutions up to 1600x1200 are supported, and unlike in many games that support such high resolutions, the interface readouts have been customized to ensure that they are still easily readable regardless of resolution. Area-specific damage is modeled, letting you occasionally, although infrequently, take significant pieces out of enemy ships, which looks great. Unfortunately, the damage-modeling system wasn't ported to the multiplayer version of the game. The characters have digital face textures, so recognizable characters in the game like Data and Picard look as you'd expect. Characters' lips move out of sync with their dialogue, though, which looks pretty goofy unless you're a devoted fan of Japanese monster movies. The game's campaign is relatively brief, which significantly affects the game's longevity since the linear nature of the missions offers limited replayability. The game's multiplayer options do little to add replayability, although they do give you the opportunity to pilot a greater variety of ships. Multiplayer battles are straightforward single deathmatches, team deathmatches, or simplistic base-defense battles, and the multiplayer code is so flaky that it regularly causes crashes. Also, the single-player campaign's linearity can frequently cause some frustration, since failing to complete a mission goal will usually require you to repeat the mission. You can never directly choose to save the game, and although the game automatically saves itself after each mission, it's tedious to replay missions since many of them are very lengthy. Since each battle usually takes at least five minutes, and missions are often broken into several encounters, you'll occasionally have to replay lengthy sequences just to try to accomplish a goal that previously eluded you. The game should have either automatically saved after each encounter or given you the option of saving during a mission by returning to your starbase. You can, at least, return to your base during missions to repair damage from previous encounters. With a couple of notable exceptions, the individual missions are also not very difficult on the default difficulty level. None of the missions are as difficult, or as puzzle-oriented, as some of the more notoriously challenging missions in Totally Games' X-Wing games. While its short duration and limited replayability may prevent it from enjoying a sustained life on your computer's hard drive, Bridge Commander is the first Star Trek space sim that actually feels like it's set in the Star Trek universe. Totally Games has managed to accurately translate the slow-paced tactical battles of the Star Trek universe into an interesting game."}