{"ref": "https://www.gamespot.com/reviews/drill-dozer-review/1900-6143274/", "date": "January 27, 2006", "game_name": "Drill Dozer", "text": "Game Freak is probably best known as the creator of the wildly popular Pokmon games for the Game Boy platform. After about a decade of cranking out dozens of Pokmon games, the developer has broken out of its mold with a traditional side-scrolling game called Drill Dozer. It has certainly made the most of the opportunity. Drill Dozer proves to be a great action game for the Game Boy Advance thanks to some creative, well-designed platforming elements and a number of classic-style boss battles, which keep the game uniformly intense throughout. Numerous cutscenes keep the story flowing along in Drill Dozer. You play the game as a precocious little girl named Jill. Jill's father is a mafia boss of sorts, heading up a friendly band of thieves called the Red Dozers. The Red Dozers get dealt a blow after their rivals, the Skullkers, ambush Jill's father and steal the family heirloom, a red diamond. With her father out of commission, Jill takes it upon herself to pilot the gang's drill dozer and exact payback on the Skullkers. The game's campaign takes you through six different areas ranging from the Skullkers' hideout to an art museum to a prison. The drill dozer itself is an interesting piece of equipment. It's basically a piece of powered armor that lets Jill walk and jump, and it also lets her duck inside it for protection or to use it to slide across gaps and underneath low walls. The dozer is equipped with a large drill bit that lets you create paths through soft bits of wall and through blocks of stone and brick. There are reinforced blocks of metal that you can't immediately drill through, but you'll be able to upgrade the drill bit later for added power. At the start of each stage, your drill has only a single gear, but you'll uncover upgrades in each level that allow you to shift your drill into higher gear for more drilling power. The cartridge includes a rumble feature, which kicks in and intensifies as you spin up your drill dozer. You can switch off the rumble in the menu, if you prefer. The shoulder buttons control the direction you drill in--clockwise or counterclockwise. In most cases, the direction doesn't matter, but certain aspects of the environment or the enemies require you to choose the correct direction to drill. Threaded air-conditioning ducts, for instance, require you to activate your drill in one direction to advance through and in the other direction to go backward, depending on the direction of the threading. Direction indicators are color coded, so you'll instantly know which button to press. There are quite a few other interesting platforming elements that keep Drill Dozer feeling fresh as you continue through the campaign. There are conveyor belts that you'll drill into to latch on for a ride--but be careful, because transferring between these can be tricky. Later levels turn your versatile drill dozer into a submarine or a helicopter when you find special propeller upgrades. The underwater sequences, set in ancient ruins, do a good job of mimicking the inertia you'd expect from a prop-powered ship. You'll have to compensate accordingly by spinning the drill. The airborne level lets you spin the drill to control your altitude like a helicopter. The designers have done a great job of throwing these different platforming twists at you over the course of the campaign. Later levels will require you to make your way quickly through certain areas while trying to beat a countdown timer, adding further tension to an already intense game. You're not just exploring environments, though. There are a number of different enemies and hazards that exhibit an equal amount of variety and creativity as platforming aspects. You'll see enemies carrying shields to block frontal attacks, others that hover and shoot from above, and several that have an exposed screw, which you'll need to unscrew to make them vulnerable. Some turrets in later levels spit a green goop at you, which renders your drill worthless until it dries off. The boss fights are particularly fun and creative. One boss shoots missiles that spin in either direction at you. You'll need to spin up your drill correctly to bounce the missiles back at the robot. Just about all the bosses exhibit the classic design sensibilities of finding patterns and exploiting weaknesses, but it's worth noting that the final boss fight is disappointingly easy compared to the rest of the game. In between levels, you have the ability to upgrade your drill dozer by purchasing items from a store with currency you collected in the levels. Drill bit upgrades allow you to forge new paths through certain levels, which gives you the ability to get through blocks and walls that you couldn't previously drill through. You'll probably spend most of your money on energy tank upgrades, though, which allow you to soak up more damage. You can always go back and replay levels for more cash, and the game extends its eight-hour campaign by allowing you to purchase ~maps~ that unlock secret levels in each of Drill Dozer's six stages. These secret levels are generally quite difficult, but they hide most of the collectible treasures that can be found throughout the game. While the store-bought upgrades feature is an interesting idea, it feels a little underdeveloped, as there aren't many options, and it's quite possible to get through the game purchasing nothing but energy tanks. Drill Dozer is pretty varied and inventive when it comes to level and enemy design. Drill Dozer has a fun, cartoony art style, reminiscent of something similar to the Powerpuff Girls TV show. The story is pretty simple but is fleshed out well due to the numerous cutscenes and the ample dialogue between the various characters. The 2D sprites look great, and the bosses are very well articulated--some of them are so large that they take up about half the screen. The sound effects are also quite good, especially the music, which offers a fast-paced superhero motif that matches the pace of the gameplay. Drill Dozer does a great job of showing you the basics of how the drill dozer works and then slowly ramping up its difficulty with progressively more complicated levels and enemies. It's not the longest game, but if you intend to find all the hidden treasures in the levels, there's plenty of gameplay to be had. With presentation that matches the quality of the overall product, Drill Dozer should definitely not be missed by fans of classic side-scrolling action games."}