{"ref": "https://www.gamespot.com/reviews/soldier-of-fortune-ii-double-helix-review/1900-2868322/", "date": "May 29, 2002", "game_name": "Soldier of Fortune II: Double Helix", "text": "Toward the middle of Soldier of Fortune II, there's a scene in which a character commits suicide by shooting himself in the temple with a handgun. Just as he pulls the trigger, the camera tastefully cuts away to spare you the sight. It's a shocking moment of restraint in a game whose primary focus is the explicit depiction of people getting shot in the face. Rest assured, though, that this brief foray into good taste is the exception rather than the rule. Soldier of Fortune II remains a well-made meat-and-potatoes shooter with a keen eye for the forensic pathology of head wounds. Though it introduces a few new features that don't quite work, it retains and improves upon virtually every element of the original, both in its single-player campaign and in its multiplayer mode. A really nice feature of the game's story is that--pretty much any time you see it creaking to life--you can press a key to put it out of its misery and move on. The plot doesn't make a lot of sense, the dialogue is absurd, and, even given the unlimited possibilities of a completely artificial environment and a free-roaming camera, the developers usually can't think of anything better to fill the time between head explosions than with long scenes of people having boring meetings. This much is clear: You're still professional soldier John Mullins, and pretty much every other character is someone trying to kill you. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Soldier of Fortune II: Double Helix Video Review Soldier of Fortune II is actually one of the few games in which skipping the plot actually makes the gameplay portions clearer. Both the training and the early cutscenes imply that you're going to need to resort to stealth to successfully navigate the first mission. If you skip the plot, you'll miss this part and probably just go in shooting, which is actually the only practical way to approach the game. It appears that the developers planned to incorporate some sneaking elements into Soldier of Fortune II and then somewhere along the line gave up--but then never managed to completely remove the essentially nonfunctioning stealth features. Generally, you can sneak up on the first enemy in a level. Once you've successfully snuck up on him, you can decide to never move again and stay hidden forever--or you can decide to kill him, at which point it's time to stop sneaking and start shooting. A completely superfluous prone stance, an unnecessary option for picking up dead bodies, and the enemies' ability to see you even if you're lying in tall grass all contribute to the half-finished feeling of the stealth mechanic. However, aside from one small section of the first mission, the game never requires you to sneak around. Soldier of Fortune II is quite long as a single-player shooter--it should take somewhat less than 20 hours to finish--or more than that if you don't disable the limited save option. As the game progresses, you can almost sense the developers figuring out what works and what doesn't. The early missions include a lot of references to stealth and offer a few not-very-interesting gameplay sequences set on rails. Happily, the final two-thirds of the single-player game focuses almost exclusively on what Soldier of Fortune II does best: wild gunfights. Enemy artificial intelligence is much better than the original game's. Characters no longer fail to react when the guy standing right next to them has his brains blown out. Though they don't exhibit much squad coordination, they use cover extremely well. Enemies will often find a spot and stick to it, poking their heads out to take potshots at you. They're also deadly with grenades, which keeps you from staying in one location for long and encourages accuracy on your part, as headshots will immediately drop an enemy. Along with explosive grenades, the computer opponents have some ability to use flashbangs, though they're a bit less successful with these. Sometimes it appears as if they're actually coordinating an attack by throwing a flashbang at you and then advancing through the cover of smoke. Other times, they'll toss a flashbang two feet away from themselves and in the opposite direction of your position. Still, it adds an interesting wild card to the combat. You'll quickly learn to run as soon as you hear the clinking sound of a bouncing grenade. Since the AI tends to run from grenades as well, you'll sometimes be sprinting neck and neck with a fleeing enemy soldier, both of you temporarily united in your desire to escape the impending explosion.The environments are bland. Basically, you'll visit warehouses on three continents, plus a warehouse on a ship. The most visually interesting level, a South American village experiencing an outbreak of a deadly Ebola-like virus, unfortunately exists only as part of an interactive cutscene. No level approaches the original Soldier of Fortune's slaughterhouse for appropriately gory ingenuity. Apart from a mission that takes place in a jungle filled with swaying trees and thigh-high grass, the environmental visuals tend toward a boxy look reminiscent of games using older technology than the Quake III engine that powers Soldier of Fortune II. Luckily, plenty of attention has been lavished on populating these environments with lots of objects that shatter, explode, spin around, or fall over when shot. Explosions immediately shatter every pane of glass in their vicinity, which is a hugely satisfying effect that henceforth should be included in every game that revolves around things getting blown up. In fact, the uninteresting environments are redeemed by the sheer number of breakable objects they contain. The long-range battles aren't as good as the close-quarters ones. In sharp contrast with the environments, the character models are uniformly terrific. Everything from their expressive faces to their body language under fire is exceptionally well animated. The GHOUL system that was introduced in the original Soldier of Fortune--which permits body parts to be blown off individually, supposedly for heightened realism--has undergone some major upgrades. For better or worse, heads can now be removed from bodies in various brain-exposing chunks, rather than as a single unit. Neck, arm, and leg stumps now pump spurting arterial fountains of blood. After abdominal wounds, characters make an effort to hold in their guts, and the sounds of death include an aqueous gasp as your victim's throat fills with blood. It's all very advanced, and it will hopefully lead to someone finally making a realistic Itchy and Scratchy game. The sound effects that aren't some form of death gurgle are also well done. Bullets slam into a wide variety of various materials with appropriate accompanying noises, guns all sound appropriately powerful, and for once, here's a game that includes the sound of footsteps over broken glass. Enemies all speak in their native tongue, which is a great touch. By the end, you'll know the word and correct panicky inflection for ~Grenade!~ in four languages. In addition to the main single-player campaign, the game includes a random mission generator that creates unique goal-oriented single-player levels. It's a great idea, but in practice, it doesn't work so well. The levels it makes are all similar-looking, foggy outdoor scenes in one of four environments: hill, jungle, desert, and snow. The game's AI appears to work well at medium distances with lots of intervening cover. Unfortunately, the mission generator generally sets up long-distance firefights with sparse cover, a scenario that the AI doesn't handle so well. Enemies in the generated levels tend to forgo the use of grenades, run straight at you, stand still while people around them are killed, and be especially susceptible to sniping--all traditional AI shortcomings that the single-player campaign largely manages to avoid. The random mission generator ends up simulating an ugly, mediocre shooter with a billion levels. A lengthy campaign and good multiplayer provide plenty of value. Considering that the game was originally going to ship without a multiplayer component, it's surprising that Soldier of Fortune II packs in one of the most stable and addictive multiplayer modes in any shooter so far this year. Though it includes the standard deathmatch, team deathmatch, and capture-the-flag modes, as well as a last-man-standing team-deathmatch variant called elimination, the real standout is a mode called infiltration. It's a version of capture the flag in which one team must defend an object while the other team attempts to grab it and then escape with it. As in Counter-Strike, once you die in this mode, you're out for the round. Each round is short enough that dying isn't too much of a penalty, and the excellent character animation system actually makes watching the rest of the round pretty interesting. It's not as tactically complex as Ghost Recon, Global Operations, or even Return to Castle Wolfenstein, but it's fast-paced and incredibly satisfying. Five Infiltration levels are included, the best one of which is the Shop Under Siege level from the multiplayer demo. The random mission generator creates multiplayer maps as well. As with the single-player version, the maps are pretty similar and not always well laid out, especially in the number and positioning of choke points. But though they can't compete with the hand-made levels, they provide a decent occasional diversion. Though the plot, the sneaking, and the environments don't amount to much, about 90 percent of Soldier of Fortune II consists of gunfights. And, as in the first game, the developers definitely get that part right. Besides which, the infiltration mode alone is enough reason to recommend Soldier of Fortune II, a sequel that succeeds more on solid improvements than innovation.The environments are bland. Basically, you'll visit warehouses on three continents, plus a warehouse on a ship. The most visually interesting level, a South American village experiencing an outbreak of a deadly Ebola-like virus, unfortunately exists only as part of an interactive cutscene. No level approaches the original Soldier of Fortune's slaughterhouse for appropriately gory ingenuity. Apart from a mission that takes place in a jungle filled with swaying trees and thigh-high grass, the environmental visuals tend toward a boxy look reminiscent of games using older technology than the Quake III engine that powers Soldier of Fortune II. Luckily, plenty of attention has been lavished on populating these environments with lots of objects that shatter, explode, spin around, or fall over when shot. Explosions immediately shatter every pane of glass in their vicinity, which is a hugely satisfying effect that henceforth should be included in every game that revolves around things getting blown up. In fact, the uninteresting environments are redeemed by the sheer number of breakable objects they contain. In sharp contrast with the environments, the character models are uniformly terrific. Everything from their expressive faces to their body language under fire is exceptionally well animated. The GHOUL system that was introduced in the original Soldier of Fortune--which permits body parts to be blown off individually, supposedly for heightened realism--has undergone some major upgrades. For better or worse, heads can now be removed from bodies in various brain-exposing chunks, rather than as a single unit. Neck, arm, and leg stumps now pump spurting arterial fountains of blood. After abdominal wounds, characters make an effort to hold in their guts, and the sounds of death include an aqueous gasp as your victim's throat fills with blood. It's all very advanced, and it will hopefully lead to someone finally making a realistic Itchy and Scratchy game. The sound effects that aren't some form of death gurgle are also well done. Bullets slam into a wide variety of various materials with appropriate accompanying noises, guns all sound appropriately powerful, and for once, here's a game that includes the sound of footsteps over broken glass. Enemies all speak in their native tongue, which is a great touch. By the end, you'll know the word and correct panicky inflection for ~Grenade!~ in four languages. In addition to the main single-player campaign, the game includes a random mission generator that creates unique goal-oriented single-player levels. It's a great idea, but in practice, it doesn't work so well. The levels it makes are all similar-looking, foggy outdoor scenes in one of four environments: hill, jungle, desert, and snow. The game's AI appears to work well at medium distances with lots of intervening cover. Unfortunately, the mission generator generally sets up long-distance firefights with sparse cover, a scenario that the AI doesn't handle so well. Enemies in the generated levels tend to forgo the use of grenades, run straight at you, stand still while people around them are killed, and be especially susceptible to sniping--all traditional AI shortcomings that the single-player campaign largely manages to avoid. The random mission generator ends up simulating an ugly, mediocre shooter with a billion levels. Considering that the game was originally going to ship without a multiplayer component, it's surprising that Soldier of Fortune II packs in one of the most stable and addictive multiplayer modes in any shooter so far this year. Though it includes the standard deathmatch, team deathmatch, and capture-the-flag modes, as well as a last-man-standing team-deathmatch variant called elimination, the real standout is a mode called infiltration. It's a version of capture the flag in which one team must defend an object while the other team attempts to grab it and then escape with it. As in Counter-Strike, once you die in this mode, you're out for the round. Each round is short enough that dying isn't too much of a penalty, and the excellent character animation system actually makes watching the rest of the round pretty interesting. It's not as tactically complex as Ghost Recon, Global Operations, or even Return to Castle Wolfenstein, but it's fast-paced and incredibly satisfying. Five Infiltration levels are included, the best one of which is the Shop Under Siege level from the multiplayer demo. The random mission generator creates multiplayer maps as well. As with the single-player version, the maps are pretty similar and not always well laid out, especially in the number and positioning of choke points. But though they can't compete with the hand-made levels, they provide a decent occasional diversion. Though the plot, the sneaking, and the environments don't amount to much, about 90 percent of Soldier of Fortune II consists of gunfights. And, as in the first game, the developers definitely get that part right. Besides which, the infiltration mode alone is enough reason to recommend Soldier of Fortune II, a sequel that succeeds more on solid improvements than innovation."}