{"ref": "https://www.gamespot.com/reviews/kirby-and-the-amazing-mirror-review/1900-6110816/", "date": "October 18, 2004", "game_name": "Kirby & the Amazing Mirror", "text": "If there's any mascot in Nintendo's stable who most deserved a moment to shine, it's most definitely Kirby. The pink puffball has been around since the days of the NES, but he has never quite had a breakout title in the ensuing generation of consoles. Fortunately, the little guy seems to have caught a break with his latest adventure, Kirby & the Amazing Mirror for the Game Boy Advance. This original title, developed by Japanese studio Flagship under the watchful eye of Hal Laboratories (Kirby's originators), offers a fresh spin on the franchise's trademark gameplay. While the game isn't as slick as it probably could be, it still offers an engaging platforming experience that makes for a great time. Kirby is back and he's bringing some friends to save Dreamland. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Kirby & the Amazing Mirror Video Review Kirby & the Amazing Mirror's story is taken straight from the old-school canon of plots: trouble comes to our hero's homeland and he must save the day. However, there's a Four Swords-like twist to the proceedings that keeps the game from being yet another by-the-numbers platformer. The story begins in Dreamland, Kirby's home, or rather, in the sky above it. A magical mirror, which usually reflects people's wishes, is invaded by a dark force that causes it to reflect only bad things. One of Dreamland's local heroes, Meta Knight, heads into the mirror to set things right. The end result? One shattered mirror and a dark version of Meta Knight, who stumbles into our rotund hero as he goes about his happy business. Kirby finds himself split into four different-colored versions: pink, green, yellow, and blue. Despite the unsettling turn of events, the hero takes his colorful trio with him into the mirror to make things right and to collect the shards of it that have fallen off. The basic structure of the game takes an open-ended approach to the adventure that's big on variety and thin on linearity. You'll start out in a hub and you will have to enter smaller mirrors that serve as portals to the different levels in the game. Within each level in the game you'll find different paths that lead to other mirrors, which send you to new sections of the level or to entirely new areas. While the mazelike layout can be a bit daunting, a map feature will let you get your bearings, although it won't shed any light on finding the alternate paths within each level. As you make your way through, you'll face off against assorted bosses, each of which holds one of the shards you need to collect. As always, Kirby will come packing a modest arsenal of moves that can be upgraded to suit any challenge. Kirby's core moves are as basic as it gets for action heroes: he can jump, fly for short periods of time, blow air puffs, and inhale objects and enemies. But when his inhalation ability lets him absorb the abilities from certain enemies, the little unassuming puffball becomes a butt kicker of Terminator-like proportions. You'll find more than 20 enemies in the game whose abilities you can hoover up and use in your adventure, which will offer you a good degree of freedom in how you tackle the game. The new twist to the formula is that the three other Kirbys will be along for the ride. You'll be able to use your cell phone to call them in for a helping hand when you're in a bind, provided you have enough battery power and reception. Your trio of helpers varies in usefulness, depending on the situation and due to their lack of smarts when you're playing in single-player mode. Your pack of Kirbys don't handle like the extra Links in Four Swords (you can't really take manual control of them individually or get them to move in formation), but you'll find places where you'll need the extra bodies to trigger switches or deal with enemies. The situation is improved somewhat when you're playing cooperatively with a friend, but then you have to deal with lending your friend extra lives out of your stockpile if they run out of theirs. In addition to the robust single-player game, you'll find minigames to play for a change of pace. There are three minigames in all to choose from: Speed Eaters, Crackity Hack, and Kirby Wave Ride, which all have selectable difficulty. Speed Eaters is a twitch game that challenges you to hit the A button as soon as the lid is taken off a platter of food so you can suck it up before your three opponents. Crackity Hack is a game to test your reflexes--you attempt to build Kirby's power by pressing A while an onscreen meter ebbs and flows. The key is to stop the meter at its fullest in order to build up enough force for the second part of the game, which has Kirby attempting to smash a boulder and send a long crack down into the earth. Finally, Kirby Wave Ride is a simple racer that requires you to perform timed jumps, which yield speed boosts, in order to beat your opponents to the finish line. The minigames are a nice diversion from the main game and they are certainly appealing when played on your own. However, their charm increases exponentially when you play with friends via the Game Boy Advance link cable, which lets up to three other friends join in, much like in the main game. The graphics in the game are well-done and stick to the brightly colored and upbeat approach that is one of the hallmarks of the series. Despite their modest size, Kirby, his friends, foes, and the environments he'll journey through are all detailed and well-animated. As always, Kirby is the epitome of cute, as his appearance changes to reflect the powers he has absorbed, whether it's the wings and halo he sprouts when gaining his cupid ability or the red bandana he sports after absorbing the fighter ability. Even the large bosses manage to have an ~aww~ factor mixed in with their menace. You wouldn't think that a rotund, pink puffball could kick tail, but there you go. The audio in the game is what you'd expect out of a Kirby gang: peppy tunes and sound effects. While we didn't hear anything as catchy as some of the tunes in the earlier games in the series, Kirby & the Amazing Mirror's soundtrack is still a fine accompaniment to the action. The sound effects are a mix of the staple Kirby sounds, such as the whine from his inhalation and the short theme you'll hear as he gains powers and bits created to reflect the new faces and places you'll encounter. All told, Kirby & the Amazing Mirror is a great entry in the Kirby library of games. The platform mechanics are solid, as always, and the adventure is certainly fun. The single-player game is engaging; it features a wealth of items to collect and it rewards you with an extra minigame mode as well as a new accessory once you've finished it. The four-Kirby mechanic is interesting and it works well in multiplayer. If you're looking for pure platforming action with plenty of variety, Kirby's latest adventure most certainly fits the bill."}