{"ref": "https://www.gamespot.com/reviews/restricted-area-review/1900-6127566/", "date": "June 19, 2005", "game_name": "Restricted Area (2005)", "text": "Restricted Area's heart is certainly in the right place. This cyberpunk-themed action-role-playing game draws its inspiration from at least a couple of most-deserving sources. One is Blizzard's Diablo series, which popularized the action RPG genre nearly 10 years ago with its addictive blend of combat and the search for better and better stuff. And the other is Interplay's postapocalyptic Fallout series, one of the best things to happen to role-playing games in the past 10 years, or ever. William Gibson and the makers of the quintessential cyberpunk RPG, Shadowrun, would probably also be at least a little flattered. The game doesn't seem to presume to try to outdo either of its influences, and instead comes across as an homage. On its own merits, it's a fairly simple and repetitive action RPG experience that's rough around the edges, yet it's not without a certain homegrown charm that should appeal to fans of the genre who don't expect too much. It's Diablo with shotguns and mutants. But it's not quite as great as that makes it sound. In the grim future of 2083, you get to play as one of four different freelancers who's trying to find his or her way in the world, as well as settle a score. There's Johnson, a trench coat and sunglasses-sporting Neo knockoff; Kenji, a tattooed, shirtless, sword-swinging yazuka; Victoria, a buxom woman with psionic powers (magic, that is); and Jessica, a spunky hacker. Each of these characters will spend the vast majority of the game running through mazelike environments, dispatching tons and tons of mutants, robots, high-tech guards, and more, while finding new stuff and gaining experience. In a nice touch, each one also has certain parts of the story that are unique to him or her. You spend the majority of the game fighting through missions on your own, but during key moments, the different storylines intersect, and the main characters interact. Despite some so-so voice acting, an awkward English translation, and the fact that the plot sequences are relatively few and far between, Restricted Area's traditional cyberpunk story works to the game's advantage: It packs a few genuine surprises. As you might expect from having played other action RPGs, the four characters in Restricted Area are superficially different but basically play alike at first. But as they gain experience from defeating foes and accomplishing missions, you'll be able to both develop them in unique ways and discover their various specialties. Some of the differences between characters are obvious right away, such as how Kenji is the only character of the bunch capable of using close-ranged weapons, such as katanas and claws. He's also the only character who can wield two pistols at the same time, though since there's no fast way to switch between close and ranged weapons, you're better off sticking to one combat style or the other. Johnson is uniquely capable of wielding heavy weapons like flamethrowers and plasma guns. Victoria's psionic spells let her heal herself, immobilize and damage her foes, and more. And Jessica fights alongside a powerful spherical droid and is uniquely capable of entering into cyberspace through terminals strewn about the environment. Through cyberspace, Jessica can recharge the droid's energy reserves and gain access to other useful items and information. Certain basic skills--health regeneration, faster running, weapon proficiencies, and so on--are common to all four characters, but each also has his or her own tree of 15 unique skills. Not all the skills are necessarily useful, but one of the nice things about Restricted Area is that leveling up (or finding new equipment, for that matter) tends to have a noticeable and immediate impact on your character. Unlike in most other action RPGs, where skill increases tend to yield only marginal gains, here you often get the instant gratification of a significant boost to your ability to deal damage, take damage, or otherwise survive. The combat is pretty good. Well, it's all right. A simple interface of clean blue lines makes it easy to use your health packs and combat drugs to aid you in a pinch, in addition to making it easy to remap the functions of your mouse buttons around your favorite abilities. As for the actual look and feel of the combat, you'll find that the process of dishing it out is more satisfying than the process of taking it. Foes bleed rather profusely as you lay into them with shotguns and submachine guns and such, though it can be difficult to tell when your own character is taking damage. The game's got a nice look to it overall, though the prerendered 2D sprites will seem dated compared to the 3D graphics you're probably used to seeing by now. A solid soundtrack is the highlight of the audio, which mostly consists of lots of groans and gunfire. Restricted Area benefits from not being technologically cutting-edge by being able to throw lots of enemies at you without any slowdown, even on modestly equipped systems. The loading times are awkwardly long, though, and you'll probably spot some noticeable bugs along the way, such as occasional crashes to the desktop or side quests that apparently can't be solved. And, for all the crowded corridors filled with foes, the game seems to inexplicably slow down at times. For what it's worth, such technical issues didn't seriously impact our enjoyment of the rest of the game. Structurally, the game throws you into a hub area from which you get to sell and buy stuff and agree to undertake missions. There are a relatively small number of main story missions, as well as a huge number of rather generic, optional side missions in which you can gain experience and find loot. Variety isn't the game's strong suit. It's initially fun to try out all the different characters and realize that Restricted Area's equivalent of armor pieces, like helmets and chain-mail vests, are bio-engineered and consist of cybernetic implants for your legs, arms, eyes...and even your skin and heart. Ridiculously, it's possible to swap these in and out at any time, as if changing brains were as easy as changing shirts. The variety of weapons, foes, and environments also feels fairly limited, which diminishes the sense of continuous discovery that generally helps make action RPGs exciting. Have a heart. Restricted Area lets you swap out body parts as easily as armor pieces in other action RPGs. Still, between the different characters and the multiple levels of difficulty--the toughest of which, like Diablo II's hardcore mode, permanently deletes your character if he or she gets killed--Restricted Area could theoretically keep you busy for a long time if the repetitious action doesn't overstay its welcome (which it probably will, especially since you've probably played this type of game before). Restricted Area also includes a rudimentary two-player cooperative mode, which is playable on a LAN or through a direct IP connection. You can only play the generic side missions in two-player mode. You get the sense that the developer probably would have preferred to have been able to offer more on the multiplayer front. Restricted Area's instruction manual lists just two people from Germany-based Master Creating in the developer credits. Regardless of whether they're the only individuals who created this game, Restricted Area has the feel of a small, humble project. It borrows liberally from older games that have since influenced much-more-technologically sophisticated examples of the role-playing genre, and Restricted Area's relative lack of audiovisual punch, combined with its straightforward action RPG gameplay, means it's only suited for avid fans of other games in this style. If you're up for a decent cyberpunk-style Diablo clone and are tolerant of technical issues, though, look no further."}