{"ref": "https://www.gamespot.com/reviews/naruto-uzumaki-chronicles-review/1900-6164107/", "date": "January 11, 2007", "game_name": "Naruto: Uzumaki Chronicles", "text": "Naruto Uzumaki, ninja-in-training and container of the nine-tailed demon fox, brawls his way through countless ninjas, bandits, monkeys, and more in Naruto: Uzumaki Chronicles for the PlayStation 2. There have been a number of straight one-on-one Naruto fighting games released in the US over the past few years, so this single-player action game, which usually pits you against a number of enemies at once, is a nice change of pace. The combat is accessible enough, and the game's unique skill-customization system can appeal to one's obsessive tendencies. A lack of variety both in the missions you take on and the actual combat, though, hurt the game's broader appeal. There's no shortage of generic-looking ninjas to beat the snot out of in Uzumaki Chronicles. Uzumaki Chronicles sees Naruto and his fellow Leaf Ninja trainees having their skills tested with more-serious missions as the more experienced ninjas of Leaf Village find themselves busy with the threat of invaders. The setup is quick and dirty, rightfully assuming that the player is already familiar with the characters and settings. The game features a nonlinear mission structure, allowing you to choose from a number of available missions at your base of operations in Leaf Village before heading out into the overworld. Your travels across the land are presented with a large static map like you'd expect to see in a traditional Japanese RPG. Also like in a traditional Japanese RPG, you'll have random encounters with a variety of villains while traveling across the overworld, and you'll have to clear the area of enemies before you can continue on your mission. The missions are often self-contained tasks, such as delivering supplies, foiling bands of thieves, helping a local shopkeeper, and training even younger, less experienced ninjas. They can occasionally seem kind of petty, but there's some good variety between the individual plots. When you get down to it, though, you'll regularly find yourself surrounded by enemies and forced to clear the area, just like in the random encounters, and it gets old well before the six or so hours it should take you to get to the end. At its core, Uzumaki Chronicles is a pretty straightforward brawler, giving you two hand-to-hand attacks that can be strung into combos, the ability to use ranged weapons like kunai, shuriken, and firebombs, and the ability to jump. Your special abilities, or ~jutsu,~ are what make the combat exciting. You can hold R1 to charge up the shadow clone jutsu, which unleashes several autonomous Naruto clones who will attack targeted or nearby enemies. R2 produces the power strike, an energy attack that launches you forward, and holding both R1 and R2 simultaneously activates the sexy jutsu, which temporarily turns you into a bikini-clad girl, a technique more distracting than damaging. You have a special meter that builds up while you fight, and once it's filled you can activate it to tap into some of the power of the nine-tailed demon fox, which makes Naruto incredibly powerful and nigh-invincible for a short time. Specific missions will allow you to bring along additional characters that you can tag into battle for a short period of time by tapping the R2 button, and though the controls are roughly the same, these support characters can have pretty wildly different abilities from Naruto. Still, Naruto's skill set is pretty limited and doesn't change enough over the course of the game. All the fights start seeming the same before long, causing the action to grow stale. Probably the most intriguing aspect of the game is the skill plate system, which lets you augment Naruto's innate abilities. As you beat down enemies, you'll pick up health- and stamina-replenishing items, ranged weapons, as well as virtue orbs. These orbs can be spent like cash to increase your health and your stamina, and can also be spent on skill chips, which come in a variety of polygonal shapes. Skill chips can have a range of effects, from improving your resistance to certain attacks to increasing the number of clones that appear when you use the shadow clone jutsu. To use the skill chips, you'll have to arrange them on your skill plate, which itself is imprinted with a unique pattern. Since skill chips can only fit within this pattern, it limits the number and types of chips you can use at one time, and it's not hard to spend a lot of time rearranging skill chips to try and cram in as many as you can. Typically speaking, the more powerful skill chips are larger and come in more obtuse shapes, making them harder to arrange on your skill plate. You'll also get bigger, more involved skill plates as you progress. The skill plate system is a little more convoluted than it ought to be, with too much awkward menu navigation, but the meta-puzzle-game aspect of it makes it fun to play around with, and when used correctly it can make Naruto a much more potent fighter. Playing with the skill plate can be more interesting and challenging than the actual combat. Naruto isn't a terribly attractive game. Naruto and his pals definitely resemble their anime and manga counterparts, but they look flat and lack detail, having looked much more impressive in past Naruto games. The environments where the action takes place are small and plain-looking. There aren't many of them, either, so you'll see the same few over and over again. The sound design, while not impressive, is at least authentic, with plenty of original voice work from the American anime cast and background music that matches the vaguely feudal Japanese feel of Naruto. Naruto: Uzumaki Chronicles isn't an aggressively bad game, but there's just something rather bland and generic feeling about a lot of it. It's just not interesting enough to warrant attention from anyone not already devoted to the Naruto franchise. It offers something a bit different from the past few Naruto games released in the US, but even devotees have seen Naruto games with better production values."}