{"ref": "https://www.gamespot.com/reviews/nba-ballers-phenom-review/1900-6147194/", "date": "April 5, 2006", "game_name": "NBA Ballers: Phenom", "text": "The original NBA Ballers brought a breath of fresh air to the arcade basketball genre in 2004 with its focus on one-on-one play and a story mode that glamorized the bling-bling lifestyle of NBA players. Two years later, the NBA has outlawed gaudy hip-hop style on the sideline, and NBA Ballers Phenom has also scaled back its fashion sense accordingly, showing Chauncey Billups in business casual on the cover instead of an iced-out Stephon Marbury wearing a velour warm-up suit. Phenom has also added a two-on-two mode and a free-roaming story mode to its repertoire, but underneath those additions is a game design that hasn't changed much and a graphics engine that is beginning to show its age. Once again, it's time to make a name for yourself as an elite baller. The core of Phenom is its story mode, which portrays you as an up-and-coming street baller looking to make a name for himself during the week leading up to the NBA Finals in Los Angeles. Apparently, Midway didn't get the memo that Kobe's now all by himself in Tinseltown, and the Finals in LA is a bit of a stretch unless they think the Clippers are going to make a Cinderella run this year. You've got revenge on your mind for this week, as you've recently been jilted by your one-time partner, Hot Sauce (the slick-handling guard who made a name for himself with And1). You and Hot Sauce were once partners on the blacktop, but when the endorsement offers came rolling in, Hot Sauce convinced the suits that he was the true talent behind the twosome and left you high and dry. Not only did he take the money and the glory, but he also had the gumption to steal your girl along with everything else. The NBA-sponsored streetball tournaments during the Finals festivities are your chance to exact a little payback and earn a little glory and money of your own along the way. The story mode is set up as a hub system in and around Los Angeles. After creating your own baller and customizing from a satisfying array of appearance and skill options, you can travel to different areas of LA, including Hollywood and Beverly Hills. Once there, you'll find yourself in a free-roaming, third-person mode where you can walk around a neighborhood. Each area includes a number of tournaments that you can enter, and you'll play against random streetballers and/or NBA players. There are dozens of different players in Phenom, ranging from current superstars, such as LeBron and Dwyane Wade, to legends, such as Magic Johnson. The other hook to the story mode is the array of side quests you can find and do besides playing ball. You'll find non-player characters who'll give you tasks, such as putting up promotional posters around town or finding diamonds that you can turn in to a store for jewelry. You'll also find other things to do, such as battle rap with Jin (the one-time star of BET's 106 & Park) in a DDR-like minigame or a spelling bee where you have to try and puzzle out how to spell the names of (mostly European) NBA stars with complicated surnames. There are even kiosks with trivia challenges that require you to know NBA lore, such as which high school Kevin Garnett attended and which NBA star earned the nickname Mr. Clutch. Most of the NPCs in the game that have tasks for you have a yellow exclamation point over their head (World of Warcraft, anyone?), but some are hidden, so it pays to try and talk to everyone you see. The neighborhoods and character models look pretty basic, and the areas aren't particularly large either, so you shouldn't expect this wide roaming, Grand Theft Auto-like experience. The roaming portions really feel more like a side-scrolling experience, with the ability to move into or out of the screen at certain junctures, like in River City Ransom. Thou hast found the +15 Magic Kicks of Mad Ups. Winning tournaments and participating in side quests earns you credits, which you can use to buy new moves and purchase gear from stores you find in the neighborhoods. Like a role-playing game, you'll find that some gear offers you stat upgrades if you wear it. But instead of two-handed flaming broadswords, you'll find stuff like shoes that can give a boost to your rebounding or a hat that gives you better touch on your shooting. You'll naturally gravitate toward these items, but you'll find that the progression of your character goes fairly quickly with how many stat points you're awarded after each tournament. Over the course of the week, you'll advance the storyline and build up a reputation for yourself with either the entertainment industry or the NBA. Depending on the tournaments you choose to enter, you could find yourself beating the game as a Hollywood star or as the NBA's hottest rookie. In either case, you'll end up with a nice mansion of your own design after all is said and done. You'll also unlock more NBA players, cribs, and tons of other content along the way. The problem with all of this content in the PS2 version, though, is navigating it all. The loading times for the PS2 version take noticeably longer than on the Xbox, and they're annoying enough to discourage you from browsing through gear or even checking tasks and messages and dealing with other menu items. If you're looking for a differentiator between the two versions, the lengthier loading times on the PS2 might be a good reason to shy away from that version and pick up the game on the Xbox instead. The basic gameplay design of Phenom doesn't change much from the original Ballers. Half-court one-on-one is still the primary gameplay mode, and you'll take on an opponent to up to 13 points in a best-of-three match, losers out. You'll find variations on the theme as you play through the campaign, such as first one to reach 30 or goaltending and fouls allowed, and you can set rules in quick play and multiplayer modes. If you're a guard, you'll probably try to use ball-handling tricks to free yourself up for a shot or a dunk. You can do some basic jukes by toggling the right analog stick, or you can do more forceful jukes by combining one or more of the juice (turbo) buttons and the juke button. You can put the slip on your opponent by doing an act-a-fool move, which engages a slow-motion effect to show off some truly nutty ball-handling animations, which look great in Phenom. You earn the most credits by stringing together multiple jukes and punctuating it with a made shot, dunk, or alley-oop. These combo scores build up the house meter. Fill that house meter, and the next alley-oop dunk you make will break the backboard and win the match for you, regardless of the current score. Many of the other nifty tricks in the game, such as passing the ball to a friend out of bounds, tip dunks, and stunt dunks (where you climb up an opponent to throw down on him), remain in Phenom. All these animations still look great and are the highlight of Phenom's graphics, along with the detailed player faces. Unfortunately, the rest of the graphics engine seems to have aged quite a bit, as player models don't seem that detailed anymore, and the courts and backgrounds offer fairly average detail. Back 'em down--Phenom now lets you drop step or fade away out of the post. There's a post game integrated into Phenom as well, and it's similar to the original game in that the offensive player can engage the defender, and then it becomes a button-mashing affair to see who can push whom out of position. A new twist has been added, where the offensive player can execute a fade away or drop step right out of the post-fighting interface. While it's nice to have a special mode that favors the big men in the game, in general it's still more fun to play Phenom as a slick-handling guard, especially because the players with handling ability tend to more easily build up ~house~ than the low-post bangers who have less handling ability. Despite this small balancing issue, Phenom is still good fun to play, and the story mode ought to keep you occupied for around 12 to 15 hours, depending on how much time you want to spend doing all the side quests. The one-on-one-on-one mode is also available, and while a two-on-two mode has also been added, we find that Phenom's strength remains in its primary one-on-one mode, limiting the value of the two-on-two action. Once you're done with the single-player, you can take your created baller online or choose from any unlocked NBA stars for some one-on-one action online. There, you'll find a pretty basic online setup, with a leaderboard and the ability to create or search out games on a number of criteria, including opponent skill level, score limits, and time limits. The online action is generally pretty smooth, and it's fun to see what sorts of crazy ballers other people have made, but it's unfortunate that you're limited to only one-on-one play online. Offline, up to four people can play at the same time in a 2 on 2 matchup. Or if you don't have that many friends you can play one-on-one-on-one or just a one-on-one game. The sound in NBA Ballers Phenom is pretty good overall. People will complain and react to you as you bump into them in the free-roaming portions, while the on-court announcer and sound effects from dribbling and dunking hit all the right notes. The NBA Jam-esque ~sparkling~ sound effect from a steal or block is in full force and adds to the satisfaction of a great defensive play. There's a sizable hip-hop soundtrack included that's listenable if you're into that style of music, but as is becoming the trend for basketball game soundtracks, the song lyrics are often too self-referential about the video game you're playing. It's not dramatically different from the first game, but the core design in Phenom still holds up pretty well. Phenom is a good overall sequel to the original Ballers. The free-roaming story mode isn't quite what it's cracked up to be, and some of the quests and minigames can be cheesy, but the plot is interesting enough to warrant a play-through, and the story mode is definitely a more-fun way to build up a created character than playing a series of tournaments. There's a ton of content to unlock and explore, and the online mode is a nice, simple complement to the single-player gameplay. While the core game feels too similar to the original, if you've never played a Ballers game, or you liked the original a lot, you'll likely find Phenom to be a worthwhile experience. The basic gameplay design of Phenom doesn't change much from the original Ballers. Half-court one-on-one is still the primary gameplay mode, and you'll take on an opponent to up to 13 points in a best-of-three match, losers out. You'll find variations on the theme as you play through the campaign, such as first one to reach 30 or goaltending and fouls allowed, and you can set rules in quick play and multiplayer modes. If you're a guard, you'll probably try to use ball-handling tricks to free yourself up for a shot or a dunk. You can do some basic jukes by toggling the right analog stick, or you can do more forceful jukes by combining one or more of the juice (turbo) buttons and the juke button. You can put the slip on your opponent by doing an act-a-fool move, which engages a slow-motion effect to show off some truly nutty ball-handling animations, which look great in Phenom. You earn the most credits by stringing together multiple jukes and punctuating it with a made shot, dunk, or alley-oop. These combo scores build up the house meter. Fill that house meter, and the next alley-oop dunk you make will break the backboard and win the match for you, regardless of the current score. Many of the other nifty tricks in the game, such as passing the ball to a friend out of bounds, tip dunks, and stunt dunks (where you climb up an opponent to throw down on him), remain in Phenom. All these animations still look great and are the highlight of Phenom's graphics, along with the detailed player faces. Unfortunately, the rest of the graphics engine seems to have aged quite a bit, as player models don't seem that detailed anymore, and the courts and backgrounds offer fairly average detail. Back 'em down--Phenom now lets you drop step or fade away out of the post. There's a post game integrated into Phenom as well, and it's similar to the original game in that the offensive player can engage the defender, and then it becomes a button-mashing affair to see who can push whom out of position. A new twist has been added, where the offensive player can execute a fade away or drop step right out of the post-fighting interface. While it's nice to have a special mode that favors the big men in the game, in general it's still more fun to play Phenom as a slick-handling guard, especially because the players with handling ability tend to more easily build up ~house~ than the low-post bangers who have less handling ability. Despite this small balancing issue, Phenom is still good fun to play, and the story mode ought to keep you occupied for around 12 to 15 hours, depending on how much time you want to spend doing all the side quests. The one-on-one-on-one mode is also available, and while a two-on-two mode has also been added, we find that Phenom's strength remains in its primary one-on-one mode, limiting the value of the two-on-two action. Once you're done with the single-player, you can take your created baller online or choose from any unlocked NBA stars for some one-on-one action online. There, you'll find a pretty basic online setup, with a leaderboard and the ability to create or search out games on a number of criteria, including opponent skill level, score limits, and time limits. The online action is generally pretty smooth, and it's fun to see what sorts of crazy ballers other people have made, but it's unfortunate that you're limited to only one-on-one play online. Offline, up to four people can play at the same time in a 2 on 2 matchup. Or if you don't have that many friends you can play one-on-one-on-one or just a one-on-one game. The sound in NBA Ballers Phenom is pretty good overall. People will complain and react to you as you bump into them in the free-roaming portions, while the on-court announcer and sound effects from dribbling and dunking hit all the right notes. The NBA Jam-esque ~sparkling~ sound effect from a steal or block is in full force and adds to the satisfaction of a great defensive play. There's a sizable hip-hop soundtrack included that's listenable if you're into that style of music, but as is becoming the trend for basketball game soundtracks, the song lyrics are often too self-referential about the video game you're playing. It's not dramatically different from the first game, but the core design in Phenom still holds up pretty well. Phenom is a good overall sequel to the original Ballers. The free-roaming story mode isn't quite what it's cracked up to be, and some of the quests and minigames can be cheesy, but the plot is interesting enough to warrant a play-through, and the story mode is definitely a more-fun way to build up a created character than playing a series of tournaments. There's a ton of content to unlock and explore, and the online mode is a nice, simple complement to the single-player gameplay. While the core game feels too similar to the original, if you've never played a Ballers game, or you liked the original a lot, you'll likely find Phenom to be a worthwhile experience."}