{"ref": "https://www.gamespot.com/reviews/tales-of-arise-review-wake-me-up-inside/1900-6417727/", "date": "September 14, 2021", "game_name": "Tales of Arise", "text": "As the first major original JRPG on new consoles and the latest installment of a very long-running series, Tales of Arise comes with a lot of expectations attached. Arise sets out to refresh its visual presentation and gameplay to appeal to a new audience, but it also tries its best to retain what has made the Tales series so beloved among its longtime fans: fun characters, fast-paced combat, and an epic sense of scale. While it manages to succeed admirably at most of what it tries to do, a few shortcomings keep it from being the new standard-bearer for RPGs to come.300 years ago, the planet Dahna was invaded by the people of their neighboring star, Rena, and crumbled beneath the might of the Renans' advanced technology and knowledge. Since their conquest, the Renans have destroyed the once-vibrant Dahnan culture and enslaved the planet's people. One day, a nameless, amnesiac slave known only as Iron Mask finds himself caught up in a supply train hijacking by rebel forces--and discovers that the freight is a Renan woman with a strange curse. As he gets swept up in a Dahnan rebellion, Iron Mask discovers new powers, his true name--Alphen--and a connection to the Renan girl, Shionne. But this tiny slave rebellion grows into something much bigger.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tales Of Arise Video ReviewThe beginning of Tales of Arise is a marked departure from the chipper banter and adventuring most Tales games lead off with. With heavy topics like slavery and oppression taking center stage in the narrative, the overall tone of Arise's story for the first several hours is quite dour, drilling into you the sheer misery and desperation of the Dahnan people. Fortunately, once your party fills out, the familiar Tales party dynamics come back in full force, with characters' personalities bouncing off each other in numerous entertaining dialogue exchanges. The rapport among your teammates--and watching their interactions change as they go through individual character arcs--is a major draw, and you'll find yourself eager to keep playing just to see the team react to the latest turn of events around the campfire or complain about the latest broken dungeon elevator.It's good that the characters are so likable because they really help carry the story through some rough patches. The abuse and liberation of oppressed peoples is very challenging and prescient subject matter to tackle, and generally, Tales of Arise handles the material well--but at times it disappoints by not diving beyond a superficial level into some of the difficult moral issues the story presents. The pacing can also feel rushed, as the plot frequently introduces characters who we don't get to know well but are suddenly rendered very important to the current events, and then quickly exit the narrative after contributing their major story beat. While the narrative in Arise's latter half shifts thematically, many of the same issues remain throughout.Like most JRPGs, the narrative in Tales of Arise is very linear. That isn't a bad thing, however, as the constant promise of new lands to explore or new dungeons to delve into is a strong impetus to keep moving. You are also presented with numerous optional side quests to tackle, should so you so choose, and a very convenient fast-travel system makes it easy to return to previous areas should you want to do additional exploration or resource gathering for crafting and cooking. (There's also a surprisingly satisfying fishing minigame at ponds throughout Arise that, if you're not careful, will consume far too much of your playtime.)But as beautiful as Arise's environments are, the big gameplay draw lies in its battles. The Tales series has always leaned heavily on the appeal of its robust, action-oriented combat, and Arise is no different in this respect. When you encounter enemies during exploration, you'll be spirited off to a combat screen where you'll go toe-to-toe with foes in a small arena. During combat, you can move freely and execute a variety of normal and special attacks called Artes, which you assign to controller buttons. Naturally, you can also jump and guard/dodge enemy attacks. Heavy emphasis is placed on positioning, dodging, and chaining attacks together to land massive combos, breaking down foes' resistances to set up a team-based finisher called a Boost Strike. While you can only directly control one character at a time, you can give your three companions detailed strategies to follow, and their AI tends to function quite well.There's always something fresh and new being added to combat ... making Tales of Arise's battles feel consistently excitingThere are some interesting new twists to combat this time around, however. Offensive and restorative Artes no longer use the same resource pool, as healing spells (and environmental interactions) now utilize a separate, party-wide Cure Points stock. This separation allows for all characters to focus more heavily on offense during battle, as there's no need to worry about saving a specific character's Artes for healing in emergencies--though characters like Shionne will still need to be ready to switch between fighting and healing when needed, and the Cure Points pool always needs to be carefully monitored.Each character is also given unique perks that differentiate themselves and establish their particular roles in battle, making each of them play wildly different from each other. Alphen can sacrifice HP after using Artes to deal extra damage; sprightly mage Rinwell can charge and hold her magical Artes to chain together combos more easily; elegant knight Kisara guards with her massive shield rather than dodging and performs enhanced Artes out of her guarding stance; and so on. Each character also has a unique, limited-use Boost Attack that serves a distinct purpose, like Law's armor-shattering punches or Dohalim's movement-restricting vines.Many of these layers to combat aren't revealed or aren't obvious right away, instead being rolled out over the course of the game. A good chunk of each characters' skills will need to be opened up as you play through the Skill Panel system, where you spend SP earned throughout the game to enhance your characters' abilities in combat. There's always something fresh and new being added to combat as a result, making Tales of Arise's battles feel consistently exciting.When Tales of Arise's combat is at its best, it feels like a well-oiled machine, with Artes flying, enemies being smacked around and juggled through the air, armor being crushed, and guards being broken, all topped off by a spectacular finishing Boost Strike or Mystic Arte to crush foes into oblivion. But it's not always that smooth and satisfying--sometimes there is just so much happening on-screen at once (with much of it out of your control) that it's difficult to keep track of what Artes your squad is tossing at the enemy and what attacks they're flinging back at you, particularly during boss fights or when you're taking on a large enemy pack. It's not uncommon to find yourself severely damaged or KO'd without fully understanding why in these cases--and while it's fairly easy to pick yourself back up, it's still frustrating. There were numerous times when I felt like I was playing at my best and still getting pummeled for reasons that were unclear. Unlike many other Tales games, Arise doesn't offer any co-op play, so you can't rely on a buddy to help keep things under control, either.And then there's the DLC problem. While Tales of Arise offers some paid cosmetic DLC--extra costumes and decorations, which don't change gameplay--it also offers gameplay boosting packages that grant bonuses like permanent EXP and SP boosts, massive shop discounts, reducing all crafting and cooking materials needed to 1, and so on. While this is an optional purchase, the fact that it exists at all constantly made me second-guess the game's design decisions: are healing items expensive to teach me to take less damage, or to get me to buy a shop discount DLC package? Are boss fights so much harder than standard fights because the designers really want to test my skills, or because I didn't get that EXP boost DLC? I often felt like money and resources like SP were kept scarce, so instead of focusing completely on having fun and exploring Tales of Arise's various gameplay systems, I was often wondering if I was being subtly pushed to buy gameplay advantages.Taken as a whole, Tales of Arise is a very good RPG, boasting beautiful visuals, a wonderful cast of characters, and engaging combat mechanics--but its flaws (and that odious DLC) are also difficult to ignore. If you're looking for a lengthy, charming, and engaging JRPG to play on your shiny new console or PC gaming rig, Tales of Arise is certainly a fine choice. Just don't go into it expecting an all-time classic."}