{"ref": "https://www.gamespot.com/reviews/war-rock-review/1900-6166494/", "date": "February 27, 2007", "game_name": "War Rock", "text": "It's true what they say about getting what you pay for. Well, at least some of the time. You can still download War Rock for free, much as you could when the online first-person shooter was in its official beta stages. As a free game, it's a serviceable Battlefield-series substitute with a surprisingly large community and enough decent qualities to make it worth the download. But in a retail package that costs money, its appeal spirals downward fast, thanks to its broken features, bland shooting action, and weak production values. In War Rock, you don't purchase new weapons--you lease them. And like that Audi you couldn't afford, the repo man will come for it unless you shell out more cash. Like most online shooters, there's a shell of a story behind War Rock. In this case, civil war in the fictional country of Derbaran has erupted. The rebels of the National Independence unit have taken up arms against the Derbaran army, and there's apparently some kind of conspiracy involving a meteor driving the action, at least according to the game's official Web site. Not that any of this has any bearing on the game. In War Rock, your goal is to shoot guys in the face. It's a little more complex than that, actually. There are a couple of different modes of play, depending on whether you like your shooters to be small, medium, or large. Counter-Strike players will take to the close-quarters-combat option, which features the game mode ~explosive.~ On these maps, the Derbaran team plants and protects an explosive in a designated spot, while the NIU team must defuse it. The urban ops and battle-group maps, on the other hand, rip a page right out of the Battlefield 2 template. Here, each team fights over an assortment of flags that function as spawn points. Your goal is to whittle down the opposing team's score by capturing flags and killing enemy players. Some of the basic elements of the maps and modes are solid in and of themselves. The maps are well made, with a good assortment of open areas and confined spaces. Conturas features a central island connected to the mainland with four bridges and focuses on vehicular transport and combat; Alberon is set in a historical ruin where most of the action rages over a central area of ravaged stone pillars. Like the other maps, they are organized well and keep firefights focused in the right places. The problem with War Rock isn't so much in the setup as it is in the execution, starting with the core shooting mechanics and balancing. There are five professions to choose from: assault, medic, engineer, sniper, and heavy trooper. They all have their ostensible uses, but snipers and assaults drive combat to the extent that medics and engineers are rare commodities, and the woefully underpowered heavy troopers simply can't hold a candle to the armored vehicles they're supposed to defend against. There's nothing intrinsically satisfying about shooting in War Rock. The sound effects are tinny and ineffective, and whether you're the victim or the victor, there's no real feeling of impact when bullets find their target. The lack of a secondary fire on most weapons is yet another factor that points to the game's low-budget roots and stripped-down nature. The vehicular combat is a bit more balanced, and most of the game's rewarding moments are in the fearsome tank showdowns or in the air. Ultraforgiving controls give helicopters and bombers an arcadelike feel, and all of the vehicles control smoothly with a mouse and keyboard, so you shouldn't feel the need to break out the joystick once you leave the ground. You aren't stuck with the meager weapon loadout you start with. As you play War Rock, you level up and earn dinar, the in-game currency, which you then use to lease other weapons or items. No, you don't get to purchase them. Instead, you rent them for a week or a month, and when your lease is up, they're removed from your arsenal. The higher your level, the better the weapons you have to choose from. It's an interesting way to encourage player loyalty, since you need to keep playing to earn more currency, but it's also a great way to frustrate new players. Even if you're an experienced online soldier, you'll often fall victim to the overpowering weaponry of higher-level players when you first begin. When you combine this system with real-world money, it's hard to shake the feeling that you didn't buy a mediocre game as much as you invested in a shady pyramid scheme. The retail version of War Rock includes a nice set of maps, a couple of cheap dog tags, and a few in-game goodies, like the mostly pointless M134 minigun. But you also get a free one-month subscription to the game--which makes you wonder exactly what you are subscribing to. As it turns out, signing up with your credit card earns you XP bonuses, a monthly allotment of dinar, the ability to create password-protected servers, or even another weapon slot, depending on which service you subscribe to. You can even purchase in-game currency with real money. But when you pay, you aren't paying for the game or the privilege of playing: You're paying either to gain an advantage because you get the good weapons, or to access features you'd expect to already be included in an online FPS. And in some cases, you're paying for features that don't work. Nonfunctional features are a hallmark of the War Rock experience. Paying the monthly fee earns you the ability to register a clan, yet the clan system hasn't actually been coded into the game yet, so all the promises in the manual and on the official Web site of clan tournaments and player rankings are currently empty ones. There's apparently a Battlefield-inspired squad system in there somewhere, too, but it doesn't work, so unless you're playing with friends using a TeamSpeak server or somehow find an orderly team with a strong leader, everything's a disorganized madhouse. Even an entire game mode that's evidently supposed to exist, the free-for-all mode described in the manual, is nowhere to be found. This is all in addition to the frequent and severe lag and numerous crashes that will have you pulling your hair out several times during any given gaming session. Heavy weapons aren't very effective, but at least you can use the scope to check out this guy's hat. Until a recent patch, the shader options in the retail release didn't work on multiple test systems. Unfortunately, the game was better off without them. No amount of bloom lighting or star glow can make War Rock look attractive, and turning them on just makes everything look blurry and run poorly. Textures are low resolution and weapon and vehicle models are chunky--more on par with Joint Operations than more modern games. War Rock's not exactly ugly, but it is noticeably dated, although its low system requirements allow it to run on a variety of systems without many performance issues. The limp sound effects don't do the game any favors either, since the audio doesn't scream Saving Private Ryan as much as it says GI Joe. The menu music and voice-over cues that inform you of events like a flag capture are fine, though. There are some quality gaming moments to be had in War Rock, though that's more due to the proven gameplay that made Counter-Strike and Battlefield successful than anything new that War Rock brings to the table. And thanks to its nonpaying player base, the game's large community isn't apt to diminish anytime soon. But as a retail product, it's too broken and derivative to be worth purchasing over its superior competitors. Just bear in mind that if you buy the retail box, you aren't getting an inherently better game than the free version--you're purchasing the chance to get better weapons and items than the players that didn't spend a nickel. You aren't stuck with the meager weapon loadout you start with. As you play War Rock, you level up and earn dinar, the in-game currency, which you then use to lease other weapons or items. No, you don't get to purchase them. Instead, you rent them for a week or a month, and when your lease is up, they're removed from your arsenal. The higher your level, the better the weapons you have to choose from. It's an interesting way to encourage player loyalty, since you need to keep playing to earn more currency, but it's also a great way to frustrate new players. Even if you're an experienced online soldier, you'll often fall victim to the overpowering weaponry of higher-level players when you first begin. When you combine this system with real-world money, it's hard to shake the feeling that you didn't buy a mediocre game as much as you invested in a shady pyramid scheme. The retail version of War Rock includes a nice set of maps, a couple of cheap dog tags, and a few in-game goodies, like the mostly pointless M134 minigun. But you also get a free one-month subscription to the game--which makes you wonder exactly what you are subscribing to. As it turns out, signing up with your credit card earns you XP bonuses, a monthly allotment of dinar, the ability to create password-protected servers, or even another weapon slot, depending on which service you subscribe to. You can even purchase in-game currency with real money. But when you pay, you aren't paying for the game or the privilege of playing: You're paying either to be better at it than everyone else because you get the good weapons or to access features you'd expect to already be included in an online FPS. And in some cases, you're paying for features that don't work. Heavy weapons aren't very effective, but at least you can use the scope to check out this guy's hat. Nonfunctional features are a hallmark of the War Rock experience. Paying the monthly fee earns you the ability to register a clan, yet the clan system hasn't actually been coded into the game yet, so all the promises in the manual and on the official Web site of clan tournaments and player rankings are currently empty ones. There's apparently a Battlefield-inspired squad system in there somewhere, too, but it doesn't work, so unless you're playing with friends using a TeamSpeak server or somehow find an orderly team with a strong leader, everything's a disorganized madhouse. Even an entire game mode that's evidently supposed to exist, the free-for-all mode described in the manual, is nowhere to be found. This is all in addition to the frequent and severe lag and numerous crashes that will have you pulling your hair out several times during any given gaming session. Until a recent patch, the shader options in the retail release didn't work on multiple test systems. Unfortunately, the game was better off without them. No amount of bloom lighting or star glow can make War Rock look attractive, and turning them on just makes everything look blurry and run poorly. Textures are low resolution and weapon and vehicle models are chunky--more on par with Battlefield Vietnam than with Battlefield 2. War Rock's not exactly ugly, but it is noticeably dated, although its low system requirements allow it to run on a variety of systems without many performance issues. The limp sound effects don't do the game any favors either, since the audio doesn't scream Saving Private Ryan as much as it says GI Joe. The menu music and voice-over cues that inform you of events like a flag capture are fine, though. There are some quality gaming moments to be had in War Rock, though that's more due to the proven gameplay that made Counter-Strike and Battlefield successful than anything new that War Rock brings to the table. And thanks to its nonpaying player base, the game's large community isn't apt to diminish anytime soon. But as a retail product, it's too broken and derivative to be worth purchasing over its superior competitors. Just bear in mind that if you buy the retail box, you aren't getting an inherently better game than the free version--you're purchasing the chance to be better at it than the players that didn't spend a nickel. You aren't stuck with the meager weapon loadout you start with. As you play War Rock, you level up and earn dinar, the in-game currency, which you then use to lease other weapons or items. No, you don't get to purchase them. Instead, you rent them for a week or a month, and when your lease is up, they're removed from your arsenal. The higher your level, the better the weapons you have to choose from. It's an interesting way to encourage player loyalty, since you need to keep playing to earn more currency, but it's also a great way to frustrate new players. Even if you're an experienced online soldier, you'll often fall victim to the overpowering weaponry of higher-level players when you first begin. When you combine this system with real-world money, it's hard to shake the feeling that you didn't buy a mediocre game as much as you invested in a shady pyramid scheme. The retail version of War Rock includes a nice set of maps, a couple of cheap dog tags, and a few in-game goodies, like the mostly pointless M134 minigun. But you also get a free one-month subscription to the game--which makes you wonder exactly what you are subscribing to. As it turns out, signing up with your credit card earns you XP bonuses, a monthly allotment of dinar, the ability to create password-protected servers, or even another weapon slot, depending on which service you subscribe to. You can even purchase in-game currency with real money. But when you pay, you aren't paying for the game or the privilege of playing: You're paying either to be better at it than everyone else because you get the good weapons or to access features you'd expect to already be included in an online FPS. And in some cases, you're paying for features that don't work. Heavy weapons aren't very effective, but at least you can use the scope to check out this guy's hat. Nonfunctional features are a hallmark of the War Rock experience. Paying the monthly fee earns you the ability to register a clan, yet the clan system hasn't actually been coded into the game yet, so all the promises in the manual and on the official Web site of clan tournaments and player rankings are currently empty ones. There's apparently a Battlefield-inspired squad system in there somewhere, too, but it doesn't work, so unless you're playing with friends using a TeamSpeak server or somehow find an orderly team with a strong leader, everything's a disorganized madhouse. Even an entire game mode that's evidently supposed to exist, the free-for-all mode described in the manual, is nowhere to be found. This is all in addition to the frequent and severe lag and numerous crashes that will have you pulling your hair out several times during any given gaming session. Until a recent patch, the shader options in the retail release didn't work on multiple test systems. Unfortunately, the game was better off without them. No amount of bloom lighting or star glow can make War Rock look attractive, and turning them on just makes everything look blurry and run poorly. Textures are low resolution and weapon and vehicle models are chunky--more on par with Battlefield Vietnam than with Battlefield 2. War Rock's not exactly ugly, but it is noticeably dated, although its low system requirements allow it to run on a variety of systems without many performance issues. The limp sound effects don't do the game any favors either, since the audio doesn't scream Saving Private Ryan as much as it says GI Joe. The menu music and voice-over cues that inform you of events like a flag capture are fine, though. There are some quality gaming moments to be had in War Rock, though that's more due to the proven gameplay that made Counter-Strike and Battlefield successful than anything new that War Rock brings to the table. And thanks to its nonpaying player base, the game's large community isn't apt to diminish anytime soon. But as a retail product, it's too broken and derivative to be worth purchasing over its superior competitors. Just bear in mind that if you buy the retail box, you aren't getting an inherently better game than the free version--you're purchasing the chance to be better at it than the players that didn't spend a nickel."}