{"ref": "https://www.gamespot.com/reviews/wta-tour-tennis-review/1900-2873449/", "date": "May 17, 2006", "game_name": "WTA Tour Tennis", "text": "WTA Tour Tennis is Konami's latest bid at a licensed sports game, although it approaches the genre in a somewhat retro manner. WTA Tour Tennis stars the women of professional tennis, including Serena Williams, Martina Hingis, and Jennifer Capriati, who are part of a cast of 20 representing today's top pro players. Interestingly enough, these stars have been drawn in a style reminiscent of Japanese animation, contributing to the game's colorful, lighthearted feel. While the game may seem like a pop version of a pro tennis game, the solid gameplay mechanics and simple controls allow it to appeal to casual players, as well as the devout followers of the women's pro tour. The graphics in WTA Tour Tennis are highly reminiscent of some of the Super Nintendo tennis games of old, with superdeformed characters facing off on a vertically oriented court. During serves, the Game Boy Advance screen almost seems to be too small for the picture--the player serving from the far court barely appears onscreen, meaning that you can easily lose track of the ball as it's tossed into the air. Aside from this minor quibble, the game looks relatively smooth, and the ball is easy enough to keep track of. A nice contrail appears behind a ball that's been hit hard, and bright, attractive colors are used for the various courts and character outfits. The sounds are passable, and some upbeat music and the judge's digitized voice calling of the game score round out an audio presentation that doesn't disappoint. The characters seem to move a bit too slowly, although the context-sensitive B button swings let you compensate for some errors in movement and judgment, since the correct swing for any occasion is always used. That way, your athlete will automatically perform a forehand or backhand swing or even dive for the ball if it's just out of reach. You can jump right into WTA Tour Tennis, and the game would be an ideal choice for younger players, while more experienced gamers can find considerable challenge in the competition to be found late in the tournament scene. WTA Tour Tennis is a solid, if somewhat simplistic, tennis game that uses a real-world license in an original and refreshing manner. While the various elements that make up the game aren't spectacular in any way, the sum of WTA Tour Tennis is quite well done and worth checking out by anyone who enjoyed or would like to experience the gameplay of classic tennis games."}