{"ref": "https://www.gamespot.com/reviews/kholat-review/1900-6416167/", "date": "June 8, 2015", "game_name": "Kholat", "text": "Shadowy conspiracies, supernatural voices, and fearsome blizzards. Mass murder, wandering spirits, and glimpses of a world beyond our own. These are Kholat's ingredients--ingredients that could have comprised an enthralling story, and one that Kholat itself doesn't tell. This exploration adventure squanders its foreboding icy atmosphere on a nonsensical tale that mixes age-old cliches like secret experiments and government cover-ups into narrative mud. Trudging through this mud proves exhausting; every story morsel is another bog to traverse, and the impenetrable ending is pure quicksand, sucking you and the hours you spent to reach it into a vortex of nothingness.Story and atmosphere are all Kholat has, making its poor storytelling all the more egregious. The ~based on a true story~ setup is promising, at least: in 1959, nine hikers exploring the chilly Ural mountains died in bizarre circumstances, inspiring years of speculation, along with numerous novels, films, and television inquiries. Kholat has you retracing those real-life hikers' steps from a first-person view, taking its cues primarily from games like Dear Esther in which your primary way of interacting with the world is to wander through it and read the diary entries inexplicably littered throughout. I say ~inexplicably,~ though I presume there is a reasonable explanation for why these pages haven't become sodden by the falling snow or blown away by the howling winds of Dyatlov pass. Kholat's final moments have the air of a grand reveal; the cryptic narrator makes a resounding declaration, as if he is providing an answer to the game's mounting questions. This is to be the ~a ha!~ that ties it all together, but after two entire playthroughs, I'm not sure I can tell you what all the questions are, let alone make sense of the narrators answer. The clues are found in the pass itself, where metaphysical sights appear before you in eerie shrines and dark caves. They are also found in the diary entries left in the snow and tacked to trees, of course, which divulge confessions and weird science experiments in far more words than is necessary. In mystical stories like this, not everything requires easy explanation, but there's nothing to invest in when you can't make out a basic shape amidst the static.You're left with snow, and lots of it. You cover a lot of uninterrupted space as you make your way around the pass, seeking the nine landmarks earmarked on your map. This map is Kholat's most promising aspect. The game does not feature a traditional interface; there are no waypoints leading you to your destinations, the map doesn't show you your current location, and you are given no standard quest objectives. Instead, you have a layout of the area, markers that show you the camps (that is, save points) and notes you have already found, and a sequence of geographic coordinates that indicate where you can find the vital landmarks. You journey forward based only on your reading of the map, and the occasional map coordinates that someone has scrawled across the rocks and walls throughout the region. Navigation thus requires patience, thoughtfulness, and an appreciation for a measured pace. These aren't unreasonable things for a game to ask of you. However, Kholat doesn't progress at a pleasant adagio, but at an excruciating largo. The success of a slow pace rests on the impact of the moments that break it, yet such key moments are too rare, too broken, and too annoying to make exploration worthwhile. A few central revelations bring some percussion to the minimalist droning, including an event in which you flee danger amid a mass of glowing figures. The rest, however, prove problematic.There are the ghostly silhouettes that roam a few of Kholat's areas, for instance, which kill you should you make contact with them. Sometimes, you collide with a spirit you couldn't have been expected to see; Kholat springs the entire mechanic on you without warning, and doesn't provide proper audiovisual cues to communicate when there is immediate peril. A couple of traps you couldn't have seen--or even suspected would exist--can have you falling onto wooden spikes and cursing at the 30 minutes you lost due to the infrequent save points. (You may also lose progress to the game's occasional hard crashes, an equally curse-worthy event.) Some ledges you are meant to drop down onto; other ledges of similar distance are off limits, and send you sliding into oblivion. ~Gotcha~ deaths are difficult to get away with in games, because they often feel unfair, but they can serve a purpose if used as a learning tool. In Kholat's case, there's nothing to learn from some of these deaths, because it isn't clear enough what you did wrong in the first place. In many stories, blizzards and the frigid cold provide a specific kind of terror, and Kholat's moaning winds cry out tales of lost souls that the game ignores in favor of shapeless nonsense. Its ideas reveal the game Kholat wanted to be, but its aspirations soar far higher than the game it became. What good is a mystery if you don't care about what it might tell you?"}