{"ref": "https://www.gamespot.com/reviews/the-bards-tale-review/1900-6111387/", "date": "October 25, 2004", "game_name": "The Bard's Tale", "text": "Despite the fact that it bears the name of a much-loved mid-'80s computer role-playing game, and despite the fact that it's the handiwork of one of that game's creators, InXile's reenvisioning of The Bard's Tale is not a nostalgia piece for fans of old PC RPGs. Borrowing Snowblind's Baldur's Gate: Dark Alliance engine, as well as its overall structure, The Bard's Tale is a decent dungeon crawler that invests some energy into lampooning RPGs and high fantasy in general, but like a stand-up act about airline food or the line at the post office, its perspective isn't very interesting, and it lacks any real follow-through. If you're not looking for the sequel to Monty Python and the Holy Grail, and can see your past a few problems, you'll find that The Bard's Tale is a fair action RPG. The Bard is back, and he has a really bad attitude. The game puts its best foot forward at the start, opening with a cinematic sequence in which The Bard, a traveling musician of flexible morality who has no interest in noble adventure or becoming a celebrated hero, tries to con his way into a free meal by using his lute to conjure up a rat in a rural pub, and then strolling in and offering to get rid of it in exchange for a bed and a hot meal. He ultimately ends up getting more than he bargained for when he's subsequently sent into the cellar to face a more serious vermin problem. From here The Bard is launched on a series of archetypal quests, ultimately getting locked into a quest the requires him to climb a series of ominous towers to fight wizards and rescue a fair princess, all the while making snide comments. The Bard comes off as kind of a jerk, and his nonstop sarcastic barbs ride the line between being funny and mean, often leaning toward plain old nastiness. But, even though The Bard's Tale would like to mock the conventions of wizards, warriors, dungeons, and dragons, it ultimately ends up relying on the things it's supposedly trying to make fun of. Most of the people you meet, places you visit, and enemies you encounter wouldn't be at all out of place in a straightlaced high-fantasy RPG, making the somewhat half-hearted humor often feel like an afterthought. There are a few genuinely funny moments, though they're usually thanks to the talented voice-acting cast, rather than the writing. There are scores of missed opportunities for puns and silly names, and yet the game manages to find the time for a head-shakingly out-of-place reference to You Got Served. The Bard's Tale finds its own jokes funnier than you likely will. As a hack-and-slash dungeon crawler, though, it's not so bad. It has much in common with the likes of Baldur's Gate: Dark Alliance or Champions of Norrath, which is unsurprising, considering that it's running on the same game engine as those titles. So, from an overhead perspective, you'll play as The Bard, battling wolves, boars, kunal trow, finfolk, evil druids, various forms of the undead, and a few different types of elementals as you make your way from one dungeonesque environment to another. This hacking and slashing makes up the bulk of the game, and for the most part, the action feels pretty familiar. You are presented with a few side quests in each town that you visit on your journey, but even if you aim to complete every side quest, unlock every unlockable, and see all the different endings, the game shouldn't take more than 16 hours of your time. There's no multiplayer component, so once you're done with The Bard's Tale, there's no real reason to come back. The game does add a few of its own unique twists to the genre's gameplay, most of them ostensibly for the sake of streamlining the experience. For instance, The Bard has no inventory to speak of. Any items that you liberate from a fallen enemy or find in a treasure chest are either automatically converted into silver, or automatically equipped (in which case the gear it replaces is automatically converted into silver). The upside is that there's no worrying about your carrying capacity or whether you'll regret selling that morning star later down the road. The downside is that it basically takes all the fun out of hunting for treasure and buying new equipment. There are only a few shops where you can spend your silver in the game, and their inventory is extremely limited. The game also gives you an inordinate amount of money, so when you do happen upon a shop, you'll basically have enough money to buy whatever you please. The intent behind this simplification is admirable, but as it turns out, a good dungeon crawl actually benefits from a bit of micromanagement. As it is, it feels like there's something missing. The Bard himself is pretty proficient with melee weapons, and you'll pick up swords, flails, axes, and bows over the course of the game. If you have a proclivity for magic users, this may be a little disappointing, though The Bard's musical talents do allow him to conjure up fighters to aid him. You'll pick up tunes to learn how to summon a total of 16 different companions over the course of the game, and each serves a fairly unique purpose. You'll occasionally come to a point where you'll need to summon a specific companion to move forward, but for the most part, it's up to you to choose who fights alongside you. At the beginning you can summon only one companion at a time, but by the end you'll have a full-fledged fellowship to help you cut a swath through the forces of evil. Though these companions have trouble avoiding traps and navigating the occasional narrow doorway, they're quite competent. This companion system is easily the most unique thing The Bard's Tale has to offer, and it's done pretty well. Despite a few tweaks, The Bard's Tale is a pretty straightforward hack-and-slash RPG. With no proper inventory, The Bard doesn't have anywhere to keep any sort of healing potions, which leads to one of the more ham-fisted parts of the game. You have two options for regaining health. One is the crone, a companion you can call upon who will periodically cast healing spells on The Bard and any companions who are in need. The other is Princess Caleigh, the very princess you are trying to rescue, whose spirit you can call upon to restore all party members' health. The problem with both of these options is that neither is a particularly good option for instantly healing yourself when you're in a tight spot--which is, arguably, the time that you need healing the most. Summoning Princess Caleigh requires a series of three button presses, and the action doesn't stop while you're accessing this on-the-fly menu, which can make for some frustration. In addition, once you've actually summoned her, all the action comes to a halt while an overly long and unskippable sequence in which she floats down from the sky and heals you plays out. The fact that there is no way to instantly heal yourself, and yet one of the face buttons is dedicated to the completely and utterly useless jump maneuver, leads one to believe that, though there are some interesting ideas here, not all of them have been thought all the way through. The Bard's Tale makes pretty good use of the Snowblind engine, though it doesn't look quite as clean as Snowblind's own Champions of Norrath, which came out earlier this year. The game covers a great variety of environments, from light, breezy forests to dank Viking tombs, and the scenery changes up often enough that there's always something new to look at. One of the more unique touches in the graphics is the way that the taller trees feel like they're almost brushing up against the camera, which adds some depth to the gameworld. The textures are generally clean, and seem to have some actual texture to them, though we did notice some abnormally blurry textures, as well as some glitchy textures. Everything animates pretty well while you're in the actual game, but the characters look jerky and mechanical during the cutscenes. The Bard's Tale looks about the same on both the Xbox and the PlayStation 2, though the Xbox version looks a little bit cleaner and the load times are a little bit shorter. Ultimately, there are better games of this kind to be found. There are quite a few cutscenes in The Bard's Tale, and during these sequences, the game's voice acting--arguably its biggest strength--is allowed to shine. Cary Elwes does a fine turn as The Bard, a real devil-may-care scoundrel. He affects a thicker British accent than you might be used to hearing from him, which is fine, though it might have been more fun to hear him as The Bard with his full-on Princess Bride level of upper-crust pomposity. Tony Jay has a perfect voice for a medieval fantasy adventure, and he does a good turn as the antagonistic narrator for the game. The background music kind of comes and goes as you play the game, usually relying on lots of lutes, flutes, and harps, ultimately something you'd hear in an Irish pub, which isn't entirely unfitting. The game also features several full-on musical numbers, some of which pop up multiple times. Musically they're fine, but they often go on for too long, and their humorous elements aren't as funny as the game seems to think. The in-game sounds of hacking and slashing are OK, but most of the death knells for the monsters sound a bit too much like regular guys with some weird vocal filters over them. The Bard's Tale has some genuinely good ideas, but much of its execution falls short. The funny stuff isn't as funny as it needs to be, and at its apex it's just kind of amusing. The straight high-fantasy stuff it employs is actually pretty good, and the game might've even been better if it had played it straight all the way through. The core hack-and-slash stuff is solid, and the changes it makes to the genre's formula, though not entirely successful, do help give the game a bit of its own personality. It's certainly not an out-and-out failure, but in light of the legacy created by its namesake and the previous landmarks in the genre, The Bard's Tale is a disappointment. The Bard himself is pretty proficient with melee weapons, and you'll pick up swords, flails, axes, and bows over the course of the game. If you have a proclivity for magic users, this may be a little disappointing, though The Bard's musical talents do allow him to conjure up fighters to aid him. You'll pick up tunes to learn how to summon a total of 16 different companions over the course of the game, and each serves a fairly unique purpose. You'll occasionally come to a point where you'll need to summon a specific companion to move forward, but for the most part, it's up to you to choose who fights alongside you. At the beginning you can summon only one companion at a time, but by the end you'll have a full-fledged fellowship to help you cut a swath through the forces of evil. Though these companions have trouble avoiding traps and navigating the occasional narrow doorway, they're quite competent. This companion system is easily the most unique thing The Bard's Tale has to offer, and it's done pretty well. Despite a few tweaks, The Bard's Tale is a pretty straightforward hack-and-slash RPG. With no proper inventory, The Bard doesn't have anywhere to keep any sort of healing potions, which leads to one of the more ham-fisted parts of the game. You have two options for regaining health. One is the crone, a companion you can call upon who will periodically cast healing spells on The Bard and any companions who are in need. The other is Princess Caleigh, the very princess you are trying to rescue, whose spirit you can call upon to restore all party members' health. The problem with both of these options is that neither is a particularly good option for instantly healing yourself when you're in a tight spot--which is, arguably, the time that you need healing the most. Summoning Princess Caleigh requires a series of three button presses, and the action doesn't stop while you're accessing this on-the-fly menu, which can make for some frustration. In addition, once you've actually summoned her, all the action comes to a halt while an overly long and unskippable sequence in which she floats down from the sky and heals you plays out. The fact that there is no way to instantly heal yourself, and yet one of the face buttons is dedicated to the completely and utterly useless jump maneuver, leads one to believe that, though there are some interesting ideas here, not all of them have been thought all the way through. The Bard's Tale makes pretty good use of the Snowblind engine, though it doesn't look quite as clean as Snowblind's own Champions of Norrath, which came out earlier this year. The game covers a great variety of environments, from light, breezy forests to dank Viking tombs, and the scenery changes up often enough that there's always something new to look at. One of the more unique touches in the graphics is the way that the taller trees feel like they're almost brushing up against the camera, which adds some depth to the gameworld. The textures are generally clean, and seem to have some actual texture to them, though we did notice some abnormally blurry textures, as well as some glitchy textures. Everything animates pretty well while you're in the actual game, but the characters look jerky and mechanical during the cutscenes. The Bard's Tale looks about the same on both the Xbox and the PlayStation 2, though the Xbox version looks a little bit cleaner and the load times are a little bit shorter. Ultimately, there are better games of this kind to be found. There are quite a few cutscenes in The Bard's Tale, and during these sequences, the game's voice acting--arguably its biggest strength--is allowed to shine. Cary Elwes does a fine turn as The Bard, a real devil-may-care scoundrel. He affects a thicker British accent than you might be used to hearing from him, which is fine, though it might have been more fun to hear him as The Bard with his full-on Princess Bride level of upper-crust pomposity. Tony Jay has a perfect voice for a medieval fantasy adventure, and he does a good turn as the antagonistic narrator for the game. The background music kind of comes and goes as you play the game, usually relying on lots of lutes, flutes, and harps, ultimately something you'd hear in an Irish pub, which isn't entirely unfitting. The game also features several full-on musical numbers, some of which pop up multiple times. Musically they're fine, but they often go on for too long, and their humorous elements aren't as funny as the game seems to think. The in-game sounds of hacking and slashing are OK, but most of the death knells for the monsters sound a bit too much like regular guys with some weird vocal filters over them. The Bard's Tale has some genuinely good ideas, but much of its execution falls short. The funny stuff isn't as funny as it needs to be, and at its apex it's just kind of amusing. The straight high-fantasy stuff it employs is actually pretty good, and the game might've even been better if it had played it straight all the way through. The core hack-and-slash stuff is solid, and the changes it makes to the genre's formula, though not entirely successful, do help give the game a bit of its own personality. It's certainly not an out-and-out failure, but in light of the legacy created by its namesake and the previous landmarks in the genre, The Bard's Tale is a disappointment."}