{"ref": "https://www.gamespot.com/reviews/painkiller-hell-wars-review/1900-6154859/", "date": "July 28, 2006", "game_name": "Painkiller", "text": "Originally released for the PC in 2004, Painkiller distilled first-person shooter gameplay down to its rawest essentials. It was a throwback to the halcyon days of id Software's Quake, the 3D first-person shooter that started it all. But Painkiller also featured spectacularly impressive graphics and amazingly realistic physics, so it was much more than just homage to a classic game. Now Painkiller has finally reached the Xbox in a game that's like a ~director's cut~ version of the original PC game and its expansion pack. Some technical performance issues and the passing of time make this version of the game less remarkable now than the original was when it was released, but Painkiller: Hell Wars is still a fun and viscerally satisfying shooter that has a lot to offer. Blowing tons of enemies to bloody bits is the name of the game. This action is simple but satisfying. The game's disposable plot casts you as Daniel Garner, who meets a tragic death in a car accident with his wife one night. Next thing you know, he's in purgatory with a shotgun. A representative from heaven explains to him that he'll get on the express elevator, going up, if he'll be willing to do the Big Man Upstairs a solid by eliminating Lucifer's generals and their minions, who have taken up residence nearby. Garner reluctantly agrees, and this gives Poland-based developer People Can Fly the license to create an interesting mishmash of completely disconnected levels. Hell's minions, in this case, definitely aren't your typical fire-spewing demons, and the entire game deliberately avoids falling into the clichs used to depict the afterlife. Instead, Painkiller: Hell Wars has you stomping through everything from orphanages filled with murderous children to zombie-infested medieval towns to ninja-infested opera houses to World War II-era Leningrad, complete with undead Nazis. This is inspired stuff, and the complete lack of cohesion from one level to the next ends up working to the game's advantage. The single-player campaign spans more than 20 unique levels, spread across five chapters, each one culminating in a battle against a gigantic boss opponent of some sort. These boss fights are quite impressive but also oddly puzzlelike for a game that's mostly pure run-and-gun action. They still make for memorable encounters and provide a good sense of contrast and closure within each chapter. As mentioned, Painkiller: Hell Wars combines levels both from the original game and its expansion pack, though it leaves some levels on the cutting-room floor. That's a good thing, because the expansion pack's levels were hit or miss, so the developers deserve credit for editing out the misses in this release and leaving only the good levels behind. The expansion pack's best levels are packed together in the game's final chapter, and they help make the last few hours of Painkiller stand out in comparison to most other shooters. In particular, the final battle, while frustratingly obscure, takes place in one of the most remarkable last levels ever put in a first-person shooter. While the levels in Painkiller: Hell Wars often look wildly different from one to the next, the underlying action remains firmly intact. This is a pure run-and-gun shooter, realism be damned. You run at what seems like 90 miles per hour and never need to reload your various overpowered weapons. What happens is, you run into a new area, heavy-metal music starts thrashing, enemies start spawning in from all over the place, and you run around (often in circles) killing them. Most enemies just run straight at you, though there are plenty of neat little twists, like shotgun-wielding skeletal thugs who grab nearby chaingun-wielding biker punks and use them as human shields, or flamethrowing mercenaries who purposely set their bayonet-carrying frontline assault troops on fire (it makes them run faster). When the dust settles, you've got an onscreen compass to point you in the direction of the next checkpoint, and so you move on. Beware of boss. Most first-person shooter bosses are lame, but you've got to hand it to Painkiller's assortment. There's a relatively small number of guns in the game, but most of them are versatile and very satisfying to use, offering up two completely different firing modes. One is a combination chaingun/rocket launcher, for instance. The best weapon from the expansion pack also made it in here: a combination flamethrower/submachine gun. However, Painkiller's defining weapon has to be the stakegun, which fires huge, pointed stakes that impale their victims, rip them apart, or pin them against a wall. When it first came out, Painkiller featured easily some of the best-looking physics effects of any game before it, and the stakegun really shows this off. These effects still look great on the Xbox, especially since the game does a lot more than just make its enemies flail around like rag dolls. A good, solid hit causes the typical foe to burst into steaming, bloody chunks, which then flail around like pieces from a rag doll. Explosive barrels often cause gleefully destructive chain reactions, and some levels feature huge set pieces that get torn apart as the combat unfolds. Unfortunately, all this carnage does take its toll on the Xbox, as the game's frame rate is prone to seizing up when the action gets very hot. The game also has a washed-out look to it, especially in comparison with the PC version. Since so much of Painkiller's entertainment value is tied to the quality of its presentation, you'd probably have a better experience playing the original version of the game on a good PC, even though the level variety is better here. The visuals look great in spots, but they don't move along as smoothly as you'd hope. As for the other differences, the game controls fine, though a few sequences require precision long-range shooting and it can be irritating trying to line up these shots. Another annoyance is the weapon-switching system, which forces you to go into a menu to choose up to two weapons at a time from your arsenal (the game's unique starting weapon, a combination spinning blade/laser, is always at hand). There's a slight, jarring pause as you go into and out of this menu, as if the game simply can't hold all the different weapons in memory at once like it could on the PC. You'll get used to this in time, but it feels like a compromised solution in a game that really ought to let you quickly switch between all your available guns. One other issue held over from the PC version is that the onscreen compass sometimes stops pointing you to your destination for some reason, forcing you to wander around looking for the next checkpoint. This dampens the game's otherwise exciting pace. Though Painkiller: Hell Wars is a simple action game at heart, it does have some depth and unique features in its single-player mode. For instance, throughout the game you may earn special ~black tarot~ cards, which can give you special abilities for subsequent levels. Some cards give you permanent bonuses while others have temporary effects that may be triggered in a pinch. You don't strictly need these cards to make it through the game, and indeed, you probably won't find many of them unless you go out of your way. But they help give incentive to go back through the levels more than once. Multiple difficulty settings are also available, though experienced players should be sure to start out at the ~nightmare~ setting, the toughest available setting at the beginning (the others are a little too easy and not as intense). Another interesting aspect of the game is that most killed enemies turn into green, swirling souls that you can collect to restore a tiny bit of health--often, it'll be just enough to keep you alive for the next battle. After you collect enough of these, you temporarily transform into an invincible demon that can obliterate anything that moves. The first few times that you see the strange red-and-white look of this effect, it's quite striking. If you've never played the PC version and you like gory shooters, then don't miss Painkiller for the Xbox. The single-player portion of Painkiller feels dense with content due to the level variety and the relentlessness of the combat. There's reason to go back through the levels more than once, and Painkiller: Hell Wars also offers a complete multiplayer mode, playable over Xbox Live or system link. Up to eight players can compete in conventional modes like deathmatch and team deathmatch, capture the flag, last man standing, and duel (for one-on-one battles). A couple of quirky modes are available as well, including ~voosh,~ which causes all players' weapons to automatically change every few seconds; and ~the light bearer,~ where players compete to keep control over a damage-boosting power-up. Up to eight players can compete in most of these modes, and the assortment of maps seems well designed to promote fast-paced carnage and surprise ambushes. We found a fair number of people playing online in the various modes, and performance seemed solid overall, though not quite as responsive as the single-player game. Painkiller's multiplayer is a throwback to the pure intensity of the original Quake, so don't expect much more than a solid, pure deathmatch game. It's nothing fancy, but it can still be fun, especially when you nail somebody with a perfectly timed stakegun shot. With the Xbox 360 out there stealing the original Xbox's thunder, it may seem difficult to drum up a lot of excitement about a new first-person shooter for the old 'box. But if you're one of the many who hasn't yet splurged for Microsoft's new console, you might just find that Painkiller is a refreshingly uncomplicated and fun example of running and gunning done right. Unfortunately, all this carnage does take its toll on the Xbox, as the game's frame rate is prone to seizing up when the action gets very hot. The game also has a washed-out look to it, especially in comparison with the PC version. Since so much of Painkiller's entertainment value is tied to the quality of its presentation, you'd probably have a better experience playing the original version of the game on a good PC, even though the level variety is better here. The visuals look great in spots, but they don't move along as smoothly as you'd hope. As for the other differences, the game controls fine, though a few sequences require precision long-range shooting and it can be irritating trying to line up these shots. Another annoyance is the weapon-switching system, which forces you to go into a menu to choose up to two weapons at a time from your arsenal (the game's unique starting weapon, a combination spinning blade/laser, is always at hand). There's a slight, jarring pause as you go into and out of this menu, as if the game simply can't hold all the different weapons in memory at once like it could on the PC. You'll get used to this in time, but it feels like a compromised solution in a game that really ought to let you quickly switch between all your available guns. One other issue held over from the PC version is that the onscreen compass sometimes stops pointing you to your destination for some reason, forcing you to wander around looking for the next checkpoint. This dampens the game's otherwise exciting pace. Though Painkiller: Hell Wars is a simple action game at heart, it does have some depth and unique features in its single-player mode. For instance, throughout the game you may earn special ~black tarot~ cards, which can give you special abilities for subsequent levels. Some cards give you permanent bonuses while others have temporary effects that may be triggered in a pinch. You don't strictly need these cards to make it through the game, and indeed, you probably won't find many of them unless you go out of your way. But they help give incentive to go back through the levels more than once. Multiple difficulty settings are also available, though experienced players should be sure to start out at the ~nightmare~ setting, the toughest available setting at the beginning (the others are a little too easy and not as intense). Another interesting aspect of the game is that most killed enemies turn into green, swirling souls that you can collect to restore a tiny bit of health--often, it'll be just enough to keep you alive for the next battle. After you collect enough of these, you temporarily transform into an invincible demon that can obliterate anything that moves. The first few times that you see the strange red-and-white look of this effect, it's quite striking. If you've never played the PC version and you like gory shooters, then don't miss Painkiller for the Xbox. The single-player portion of Painkiller feels dense with content due to the level variety and the relentlessness of the combat. There's reason to go back through the levels more than once, and Painkiller: Hell Wars also offers a complete multiplayer mode, playable over Xbox Live or system link. Up to eight players can compete in conventional modes like deathmatch and team deathmatch, capture the flag, last man standing, and duel (for one-on-one battles). A couple of quirky modes are available as well, including ~voosh,~ which causes all players' weapons to automatically change every few seconds; and ~the light bearer,~ where players compete to keep control over a damage-boosting power-up. Up to eight players can compete in most of these modes, and the assortment of maps seems well designed to promote fast-paced carnage and surprise ambushes. We found a fair number of people playing online in the various modes, and performance seemed solid overall, though not quite as responsive as the single-player game. Painkiller's multiplayer is a throwback to the pure intensity of the original Quake, so don't expect much more than a solid, pure deathmatch game. It's nothing fancy, but it can still be fun, especially when you nail somebody with a perfectly timed stakegun shot. With the Xbox 360 out there stealing the original Xbox's thunder, it may seem difficult to drum up a lot of excitement about a new first-person shooter for the old 'box. But if you're one of the many who hasn't yet splurged for Microsoft's new console, you might just find that Painkiller is a refreshingly uncomplicated and fun example of running and gunning done right."}