{"ref": "https://www.gamespot.com/reviews/syphon-filter-logans-shadow-review/1900-6180591/", "date": "October 8, 2007", "game_name": "Syphon Filter: Logan's Shadow", "text": "Without a shadow of a doubt, Syphon Filter: Dark Mirror was one of the most impressive sleeper hits of 2006. It combined a decent single-player campaign with robust online multiplayer and rejuvenated an aging PlayStation series all while scoring a headshot for the struggling PSP. So its recently released sequel, Syphon Filter: Logan's Shadow, has a heck of an act to follow, which is exactly what it does. From the structure of the single-player campaign and the enemies to the puzzles and the online multiplayer, Logan's Shadow follows in its predecessor's footsteps like a sneaking spy. While it isn't likely to catch you unawares, you'll still be happy to act surprised. Just don't expect anything resembling great spy fiction here. Oh, Gabe and company have been asked by a creepy spook to take on a dubious mission with no intel? You don't say! This time the ~pencil neck~ from the government is a Lex Luthor look-alike named Cordell. He wants Gabe to extract precious cargo from a besieged ship but refuses to say what's on board. At first, Gabe refuses, but then Cordell says the magic words: ~You're the only option I've got!~ Gabe responds the only way a superspy can: ~I'll do it, but on my terms!~ And so begins your globe-trotting mission to discover the boat's contents, thwart terror, and strike a blow for freedom all while saving multiple damsels in distress. Throughout your travels and travails, a badly tangled plot unfolds that fiddles with themes of trust, as well as identity, but mostly just fumbles around in the dark like a novice burglar. Don't tase me, bro. Yeeaarrgh! Confusing plot and awkward dialogue aside, Logan's Shadow is full of the same solid combat you probably enjoyed so much in Dark Mirror. There are three control schemes, including a good one, a decent one, and a horrible one. The worst setup treats the face buttons like a second analog stick, which feels too imprecise. The middle one is a reversal of the first scheme, except that the face buttons act as a left analog stick (movement) and the nub acts as the right (free look). This can work, though it's hard to rewire your brain that way. The best sets lock-on, manual aim and strafe buttons, attributes basic movement to the thumb nub, and mostly gets out of your way. For easy mobility and straightforward sniping from behind boxes or around corners, this scheme is the most elegant. Oddly, the entire tutorial is geared toward the worst one, so it's kind of hard to figure out how the best one, called ~classic,~ works. Once you do, though, you'll have no problem hiding behind walls or boxes, blasting bad guys, and working your way through sticky situations with the help of your pretty sidekicks, as well as your infrared goggles. Most of the action is identical to what you saw in Dark Mirror. You hide behind boxes or walls and pop out to shoot bad guys. You'll do this with a variety of weapons, including pistols, submachine guns, shotguns, and assault rifles that become gradually more powerful toward the end of the game. Shoot-outs usually see you facing off against a corridor full of baddies who hide behind boxes and periodically peek at you. When they do, you shoot them in the head then move on. The bad guys never get smart, but they do get the next best thing: helmets. You'll also encounter enemies in electromagnetic suits who are impervious to bullets. These guys were also in Dark Mirror and have been greatly improved. Before, killing them was a horrible process involving EMP grenades, frantic shooting, and frustrated tears (not always in that order). But in Logan's Shadow, you just shoot them in the knees and shoot their exposed air tanks. It makes less sense (why are their knees exposed?) but is definitely more fun. There is one little catch, though. If you're manually aiming when you shoot their knees--and you probably will be--the game takes you out of aiming mode. You can compensate for this when you know it's going to happen, but there's no reason you should have to, and it will definitely cost you a life here or there. The sequences where you cooperate with a non-player character by sending signals return in Logan's Shadow and are mostly well done. Most of these rely on infrared vision, but a few are pretty original, such as a fight against a chopper. Here, you and a rocket launcher-wielding vixen are pinned behind a wall. You must pop out and draw the chopper's fire, then tell her to shoot when the gunship is focused on you. Fight fire with blind fire. There are also a couple new gameplay tweaks, but these are minor. Logan can now blind fire over obstacles, so if enemies seems to be right on the other side of something, you can take them out without engaging in headshot whack-a-mole. You can also grab enemies and use them as shields. Then again, if you can grab enemies, you can also shoot them, which will probably be your preference in nearly every case. The other noticeable gameplay tweak was taken from God of War's scripture. Now, whenever Gabe has to do something tricky or adroit, you'll be prompted to hit a sequence of buttons. It's never difficult or overwrought, although it won't blow you away with originality either. Gabe can swim this time around, although these sequences are some of the weakest in the game. In fact, the most frustrating moment of all comes underwater, when your comrade tells you he needs a valve to fix a submarine. So, you search a huge underwater sea base for the darn thing while the guy yells ~Where are you going?~ every five seconds into your speakers. Yes, that means you're going the wrong direction, but he shouts it no matter which way you go if you aren't right near the discrete brown mass on the sea floor that magically holds the valve. It doesn't help that swimming is a clunky, awkward process involving multiple button presses at all times. For the most part, though, the single-player campaign is entertaining. After beating it once, you can also replay any episode to unlock new bonus levels, guns, and abilities. Additionally, you unlock a demo for Syphon Filter: Combat Ops, an upcoming multiplayer PSP game that includes a rudimentary map editor, one customizable stage, and five playable levels for up to 10 ad hoc players. As far as bonus content goes, Logan's Shadow contains some great stuff. And that's not including the actual multiplayer, which can be enjoyed ad hoc or online. There are seven maps, and they're all compatible with the five match types, two of which are new. The match types include deathmatch, team deathmatch, rogue agent, sabotage (where teams search for launch codes then try to detonate their opponent's nuke), and retrieval (capture the flag). You can set up clans, known as cells, compete in cell-only matches, and communicate with your cellmates via voice over IP. There are also robust filtering options, so you should be able to find matches with good latencies. That is, if you can access the lobby server, which was by no means guaranteed during our tests of the game. You've been in fire fights, now try water fights. Regardless of where or how you play, the graphics are solid in Logan's Shadow. It looks good all the way through, with several well-rendered bright spots and some absolutely amazing-looking cutscenes. The production values are simply excellent. The score by Azam Ali matches the feminine-mystique angle that plays a role in the plot, but it doesn't always match the general gameplay. That aside, this game looks and sounds very good. The story won't win any awards, but Syphon Filter: Logan's Shadow may, with its decent campaign, high replay value, robust online content, and Combat Ops demo. No, this game doesn't do anything radically different, and no one piece is staggeringly brilliant or inspired. But taken altogether, Logan's Shadow envelopes dozens and dozens of hours of solid play time, making it one of the best buys for your buck. On top of all that, the graphics are solid and the load times are relatively short. While it may not be your only option this holiday season, it's still a mission you should gladly accept."}