{"ref": "https://www.gamespot.com/reviews/tiger-woods-pga-tour-2005-review/1900-6128022/", "date": "May 17, 2006", "game_name": "Tiger Woods PGA Tour 2005", "text": "On mobile, the Tiger Woods franchise, like the man himself, has stagnated for quite some time. Last year's Tiger Woods PGA Tour 2004 even took several backward steps, as its laggy graphics and gameplay made it completely unplayable. With the 2005 edition, I-Play is back in the swing of things, and it has produced a game with some fun new features. Last year's Tiger was broken, but this year's isn't. Buy the new edition. Tiger Woods PGA Tour 2005 uses a gameplay system that will be familiar to mobile golfers. Your primary shot-control mechanism is the classic swing meter, which requires two timed button presses on each swing. It's possible, of course, to adjust your shot trajectory from the default, so you can either play more conservatively or aggressively. You can also switch clubs or shot types (a chip is sometimes more effective than a full stroke). Your in-game caddy will give you advice based on your ball's lie and the obstacles on the current hole. New to Tiger 2005 is the ability to earn money by performing specific feats, such as breaking your tee, or simply by golfing well in the single-player mode. Or you can download tournament challenges and then put your lowest scores into contention on the I-Play servers. Success there will net you yet more cash. You can upload your total earnings for viewing by other players, and you'll win friends and admirers. Alternately, you can use the cash to upgrade your character or unlock golfing legends to play against, such as the peerless Jack Nicklaus. These online features might sound insignificant, but they actually go a long way toward incentivizing dedicated play. The game uses scaled sprites to create the illusion of depth on the course. Every part of a course is viewable, although the environmental features are simplified to the point of being symbols. The game's frame rate is a huge improvement over the 2004 edition, and on the LG MM-535 we didn't encounter any slowdown. The short game is represented nicely, and it's clear from the moment you hit a shot whether or not it's heading for the pin. Break your tee, and win $2,500. Not a bad deal! Golf is a relatively quiet sport, and it's therefore not a huge hardship that Tiger Woods doesn't have much to offer in the way of sound. A sort of hip-hop backbeat plays over the title menu. In the game, you'll hear a fairly realistic pop when connecting with the ball, and a small thud when your well-placed shot meets the fairway. Tiger Woods PGA Tour 2005 fixes the previous edition's most egregious problems, and it's therefore more than just an incremental update. Between the unlockable legend characters, online tournament play, and a revamped graphics engine, there are plenty of reasons to upgrade to this year's Tiger."}