{"ref": "https://www.gamespot.com/reviews/wolfenstein-the-new-order-review/1900-6415765/", "date": "May 19, 2014", "game_name": "Wolfenstein: The New Order", "text": "It's 1960, and the Nazis have taken over the world. Once-beautiful cities like Berlin and London have been transformed into oppressive urban landscapes. Propaganda posters are plastered over miles of depressing concrete, while loudspeakers echo the doctrine of the Nazis' totalitarian regime and the punishments that follow for breaking it. The streets are patrolled by technological terrors--Nazi mechs and robotic guard dogs, whose imposing grey forms against the drab grey concrete are broken only by the deep red of Nazi banners. This is the world of Wolfenstein: The New Order, a world where resistance seems futile. But there is one man who is up to the task: William ~BJ~ Blazkowicz--the same Blazkowicz who escaped Castle Wolfenstein, shot a lot of Nazis, and took down Mecha Hitler in 1992's Wolfenstein 3D.But what is Wolfenstein's place today? The series spawned the first-person shooter genre, but like The New Order's alternate-history setting itself, times have changed. Can a Wolfenstein game in 2014 marry the bombastic action and narrative drive of today's shooters with the series' own simple pleasure of shooting Nazis in the face? With this fresh and interesting setting, powerful and satisfying weapons, and a new, robotics-focused take on the Nazi war machine, developer MachineGames, formed by ex-Starbreeze veterans, has figured out how to answer these questions.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Wolfenstein: The New Order - Video ReviewThe first few hours of The New Order take place in 1946. Despite the Fuhrer's demise, the Allies are losing. Blazkowicz spearheads a last-ditch assault on the new, heavily fortified headquarters of the Third Reich. The operation goes awry, and Blazkowicz takes a piece of shrapnel in the head. He spends the next 14 years in a vegetative state, recovering in a Polish mental institution.The Blazkowicz that emerges into this strange new world is still the same Blazkowicz of Wolfenstein 3D: a blunt instrument.This isn't just a convenient plot device to bring the majority of the game's action into the Nazi-controlled world of 1960. You see, the Blazkowicz that emerges into this strange new world is still the same Blazkowicz of Wolfenstein 3D: a blunt instrument. He isn't tormented by a dark past like BioShock Infinite's Booker DeWitt; he does not suffer a deep-seated sense of loss like The Last Of Us' Joel; and he has no trouble reconciling his nature as a killing machine like Spec Ops: The Line's Martin Walker. He is a man who, as a side character excitedly exclaims, ~was born to kill Nazis.~ Though Blazkowicz emerges from his vegetative state fully functional, he still doesn't know how to view the world unless it's down the twin barrels of assault rifles akimbo. If a switch needs a gentle press, Blazkowicz punches it. If a door needs opening, Blazkowicz kicks it down. For as much as The New Order's plot is about Blazkowicz rebelling against the Nazis' iron grip on the entire planet, it's also about the friction created when the original first-person shooter protagonist drops into a first-person shooter designed for 2014.~Nazis dead. Nazi robot dead. Broke all your shit. Helicopter secured.~As Blazkowicz escapes the institution and contacts the resistance, its members give him highly technical objectives--patch this module into the control tower so we can hijack this helicopter--as he stares back at them, dumbfounded. Blazkowicz's inner monologue upon completing such an objective offers cogent insight into his thought process: ~Nazis dead. Nazi robot dead. Broke all your shit. Helicopter secured.~ Friendly side characters describe him as ~ape-like~ and ~the crazy American.~ A Nazi who attempts to subdue Blazkowicz with what he describes as ~enough tranquiliser to put an elephant to sleep~ exclaims in shock, ~There must be something wrong with your cerebral cortex,~ as Blazkowicz simply walks it off.But there is nothing wrong with Blazkowicz's brain. He simply says and does things a shooter protagonist from 1992 would say and do were complete motion capture and voice acting available at the time--most of which is shooting Nazis. Blazkowicz is positioned as a lens through which you see how the nature of first-person shooters has changed since his first appearance. Tonally, the result is an overarching sense that the world has left Blazkowicz, and his intentional lack of nuance, behind.In combat, Blazkowicz even functions like a 1992 shooter protagonist--he needs health and armour pickups to stay alive, and he can carry all of his guns at the same time. This immediately allows for a wider range of options in any particular combat situation than a shooter with a weapon carry limit would offer. Those guns are big, loud, and satisfying to shoot. Most weapons can be dual-wielded, which works well because you don't lose any accuracy by not aiming down the sights, a tweak that lends the combat a sense of finesse despite its fast pace. Individual enemy AI isn't particularly complex, but it works in the context of this kind of shooter. Instead, larger enemies like Nazi robots add variety to combat through their increased threat and the fact that different tactics are required to take them down, such as using Tesla grenades to stun them, or shooting off specific pieces of armour. All the while the combat feedback is dialled to 11, with effects like near-comedic squelching sounds as stick grenades shatter Nazis into tiny giblets.There is enough variety in the combat spaces, and the enemy combinations within, that The New Order's levels feel well paced, and combat feels tense without being unmanageable or overwhelming.Levels flow back and forth between tight corridors and wide, open arenas. A lunar museum sees Blazkowicz running through backstage passageways and around large, spacious exhibits. A level set on a massive, destroyed bridge requires Blazkowicz to squeeze through train carriages precariously dangling over the edge, whilst crossing back and forth over the larger, open structure of the bridge itself. Though enemy numbers never reach those of the Doom or Serious Sam-like hordes, there is enough variety in the combat spaces, and the enemy combinations within, that The New Order's levels feel well paced, and combat feels tense without being unmanageable or overwhelming.Some rudimentary yet functional stealth mechanics allow The New Order to craft entire levels where Blazkowicz is armed with nothing but a knife. These are interesting because they add variety to the game's pacing, providing quiet, tense moments in which you are required to pay attention to enemy patrols and lines of sight, but which don't end in a ~game over~ screen if you get spotted. Nazi commanders, who can call in reinforcements if they detect you, create a hierarchy of high-value targets in a single room. When those commanders are present, the interface shows your distance to them, but not their exact location. It's rewarding to feel like you're stealthily stalking them, taking them out silently, and then are free to pull out the big guns to clear an area in the most efficient manner possible. With these mechanics, along with some interesting mission locations and stellar environmental design, The New Order offers a wide variety of combat experiences.In an effort to further allow for play style personalisation, a perks system lets Blazkowicz gradually unlock both stealth and combat abilities. However, the tasks required to unlock individual perks--such as stealth-killing a certain number of Nazis--are mostly actions that you perform naturally over the course of the game. Combine that with the fact that the majority of the perks themselves have only subtle effects, such as slightly extra ammo, and you'd be forgiven for forgetting the system exists at all. Outside of the perks system, weapon upgrades can be found throughout the game's levels and permanently attached to your guns. Assault rifles can be upgraded to fire underslung rockets, and shotguns can be made to fire shells that bounce off walls, effectively turning them into Unreal Tournament's flak cannon. The upgrades are useful, opening up new avenues for tactical approaches to taking down the tougher Nazi foes.The New Order also requires Blazkowicz to make regular use of a laser cutter. It is both a weapon and a utility that can manipulate the environment. However, its use is mostly relegated to cutting Blazkowicz-sized holes in the only pieces of metal grating that are blocking forward progress in the first place. There are a few panels which hide secret areas containing health and ammo pickups, but although you can cut any shape you like, unless it's a square you won't fit through it.The game is both a celebration of the Wolfenstein series and what feels like a fitting send-off for it.Both the laser cutter and the perks system feel like missed opportunities at worst, because even aside from them, The New Order's combat intensity and variety have granted the Wolfenstein series a breath of fresh air, whilst still managing to hit the nostalgic highs that I expect from the series. It has injected some substance into the primal pleasure of shooting Nazis by way of an interesting tone that addresses the changing roles of first-person shooter protagonists. Through this, the game is both a celebration of the Wolfenstein series and what feels like a fitting send-off for it. The New Order could be the last hurrah of William ~BJ~ Blazkowicz, an outing which, for all its excess and bombast, is far from mindless."}