{"ref": "https://www.gamespot.com/reviews/dragon-ball-z-budokai-2-review/1900-6085051/", "date": "December 4, 2003", "game_name": "Dragon Ball Z: Budokai 2", "text": "After over a decade of poorly realized Dragon Ball Z fighting games, Atari and little-known developer DIMPS surprised many people in 2002 when they released Dragon Ball Z: Budokai for the PlayStation 2. Amazingly, it wasn't half bad. The action wasn't complex--as it valued accessibility over depth--but the visuals had a sharp, clean look to them. Surprisingly, the game made excellent use of the license, with the crowning achievement being a story mode that reenacted many of Dragon Ball Z's most memorable moments. Now, about a year after Budokai hit shelves, DIMPS has churned out a better-looking sequel, but this time around it lacks the compelling story mode that distracts you from the rather basic gameplay. The new Dragon World mode isn't as engaging or entertaining as the original game's story mode. In place of Budokai's story mode, Budokai 2 features the new Dragon World mode, which is essentially a board game where you control a team of Dragon Ball Z heroes as they move around on a series of maps while fighting bad guys and collecting dragon balls. The story for the Dragon World mode takes some liberties with the Dragon Ball Z continuity by fashioning a tale that has many of the series' different villains teaming up to collect the dragon balls. Unfortunately, after a few levels, the overlying story just sort of derails. The fundamental problem with the Dragon World mode is that there's really no point to it. With your sole objective, on most maps, being to just find the bad guys and fight them, the board game format doesn't bring a lot of strategy to the table. Also, you have to fight the same enemy several times before he is permanently vanquished, in most cases, and that just isn't any fun. Unfortunately, if you want to get the most out of Budokai 2's multiplayer game, you really need to play through the Dragon World mode, as it's the only way to unlock many of the game's characters and stages. Beyond the Dragon World mode, Budokai 2 offers a duel mode (where you can fight against the CPU or another player in a one-off match), a single-player, ladder-style World Tournament mode, and a training mode. Whether you're already familiar with Budokai or not, the training mode is worth going through, as it explains the mechanics that are new to Budokai 2 and explains those that make the series different from other 3D fighters. The fighting system in Budokai 2 isn't too different from last year's Budokai, though it does add a few new bells and whistles. The game still plays like a stripped-down 3D fighter, with basic punch, kick, and energy attacks that can be strung together for more powerful combos. Players can't actually jump, but there are certain attacks that will launch your opponent into the air, at which point you can fly up to him or her and continue your battle in the sky. If you and your opponent both try to attack each other at the same time (with certain moves), you'll enter burst mode. Here, both characters unleash a flurry of punches and kicks--and mashing buttons is the only way to come out on top. The most significant addition that Budokai 2 makes to the fighting system is the fusion technique, which allows you to merge your fighter with another for a short period of time while in midfight, thus greatly increasing your power. While the fusion technique is definitely a nice touch, the game still lacks any sort of power-struggle mechanic--where players just try to overpower one another by using huge beams of energy. Budokai 2 really outdoes its predecessor in the graphics department, which appears to be where DIMPS spent a majority of its development time. Budokai had a fairly cartoony look to it, but Budokai 2 ups the ante by rendering all the characters with a cel-shading effect. Though it's not the greatest looking cel shading we've seen, it definitely works to the game's advantage by giving the characters even more of a hand-drawn feel. The character models appear slightly more detailed and display more prominent creases in skin and cloth. A little bit of the glossy shine effect, which the characters took on in the latter parts of the series, is even apparent. The game also features actual shadows, which replace the black dots that the characters cast in the original Budokai. The visuals aren't entirely new, though, and the game borrows a fair amount from its predecessor. Virtually all the in-game animations are reused from the first game, and many of the characters themselves share identical animations. The game also recycles sound from the first game pretty liberally, and players of the first game will probably notice a lot of familiar music, menu sound effects, and voice clips. To its credit, though, the game does include a fair amount of new voice acting--all provided by the American voice actors from the Dragon Ball Z cartoon. The cel-shading effect makes Budokai 2 look even more like the source material. The first Budokai was total fan service, and, really, Budokai 2 isn't that radically different. However, it feels rushed and doesn't quite exude the same level of care that the first installment does. The omission of a story mode is Budokai 2's biggest misstep, and the Dragon World mode simply isn't a suitable replacement. The improved visuals are nice, and some of the additions made to the fighting system are fun, but Budokai 2 still comes out as an underwhelming sequel."}