{"ref": "https://www.gamespot.com/reviews/superhot-mind-control-delete-review-hack-n-slash/1900-6417505/", "date": "July 14, 2020", "game_name": "SUPERHOT", "text": "You gotta respect a game that tells you exactly what it is upfront. Within minutes of starting Superhot: Mind Control Delete, you're told, in those now infamous subliminal text cards that pop up from time to time in the previous games, that yes, this game will give you more. No story. No closure. No long-winded explanation of what happened in the last two games. Just more senseless shooting, and then it'll be over. And to Superhot Team's credit, they deliver on their promises. This is, definitely, a lot more Superhot. But it's also a few other things that aren't nearly as welcome.Mind Control Delete is still fundamentally following the same mantra as the other two games: Time Moves When You Do. It's still a first-person shooter that places you in sparse, stark white, and self-contained little killzones, against a small group of keen-to-kill goons made out of, seemingly, fragile red glass. Your job is to John Wick your way out of whatever wild scenario you've been placed in, using objects in your environment to your advantage. There are guns, but with very limited ammo. So, when you don't have a gun, grab a sword. If you don't have a sword, grab a knife. If you don't have a knife, grab a book, a pen, or a teacup. Even with a relatively limited moveset, the time mechanics at play turn what would be a breathless massacre at full speed into a sort of kinetic chess game, allowing you the ability to plot every maneuver down to the millisecond. While gunplay is certainly your bread and butter in Superhot, there's a maniacal glee that comes with taking out a guy wielding a katana by throwing a typewriter at him in Superhot that makes it truly special. That winning formula is still very much in full effect here in Mind Control Delete, but a few new ingredients have been added to the concoction: rogue-lite elements. And while the formula hasn't been ruined in the least, the effectiveness has been lessened a tiny bit.For starters, the game's levels, which were once all unique, impeccably staged setpieces, are now relegated to around a dozen or so themed rooms--such as lab, disco, prison, or casino--with enemy/item placement and your own start point randomized each time. There's more variety to be had than one might think in that randomization. The environments are elaborate and full of tiny, devilish design elements for you to mount for a better vantage, mail slot-sized holes to shoot through, or daredevil jumps to make out of windows to stomp an enemy from above. Even despite the minimalist aesthetic, these are still impeccably designed, functional places that still evoke the tense feeling of getting into a shootout in a place clearly meant for public use. The environments follow real world placements for everyday objects, which means using them to your advantage--using an open car door to evade a bullet, grabbing the handle off a slot machine to use as a weapon, or getting behind a DJ booth to take cover behind a speaker. Suspension of disbelief in the sparseness of it all tends to vanish in the moment. There are vast, glorious opportunities for you to surprise your enemies, or vice versa, and it takes hours to get to a point where things start to wear thin.Unfortunately, that's exactly what ends up happening as the game goes on. Each stage--represented as cursor nodes on an MS-DOS prompt screen--is typically between five and 10 of these levels, strung together. The fewer there are to tackle at once, the less likely it is for a particular node to wear out its welcome, but by the time you reach the final grouping of nodes, you're doing runs of up to 15 stages at once, with no way to save progress if you fail or need to duck out. Superhot's always been a game best enjoyed in small doses, and having to plow through such long stretches of gameplay in the same grouping of stages every time feels like forced gluttony.That's a problem exacerbated by the game's permadeath. As opposed to the other Superhot games, where youre just as fragile as your enemies, you can take two hits during the course of a node. Thats a good change; it encourages taking risks you might not have when taking one bullet was game over. But theres a catch: You're also sent all the way back to the beginning of a node if you lose the second of your two hearts--again, not a huge deal when you've only got five stages to work through, but utterly demoralizing when it's 15.The good news is that the game provides ample opportunity to temper some of those problems with hacks, game-breaking ~cheats~ unlocked during the course of gameplay. Once unlocked, every two or three nodes or so, you can choose one from a random pair of your hacks to apply for the rest of that node. Running low on hearts? You could choose to heal up, or even raise the number of hearts to a maximum of five. Tired of having to disarm an enemy for a weapon? There's a hack to start with a random gun. That's before you get to the wild, Matrix-y hacks, like deflecting every bullet currently in the air back at enemies with one sword swipe, headshots that ricochet towards the next nearest enemy if they land, and having your own body explode with shurikens whenever you take a hit. Despite breaking the game, using the hacks effectively still takes timing, strategy, and smarts. That's especially the case once the game decides to start cheating back, introducing spiked enemies and proximity mines to the mix. The fact that the game still feels mostly balanced and fair despite all that is impressive. The hacks arent a fix-all solution to the games rogue-lite issues, however. The hacks are there, but getting the exact combination of benefits that work within your particular playstyle is a matter of luck rather than skill. Slowing down bullets before they get too close to you can be great, but if you dont see the bullets coming to begin with--a bigger problem in Mind Control Delete due to the sheer number of enemies that spawn in later stages--youre still taking a hit, and taking the wrong hit at the wrong time can still send you rocketing back to the start of a node.The problem with the game isn't whether it's fun; it's maintaining that fun in the later, vicious hours, when Superhot is less about being a wild user-friendly powertrip and more about surgical precision at all costs. There are surprises up the game's sleeve from time to time. The most effective of them are some new, terrifying enemies with their own hacked powers who cannot be harmed, only avoided. What little the game has for a story pertains to them as well, and despite being sparse, what's there is subtly creepy. The meta commentary is much less subtle, but there's also not really enough of it to get annoying.The best things about Mind Control Delete are the ones that enhance what made Superhot stand out as a cunning deconstruction of action games and those who play them. There's quite a ton of that here, and, as mentioned, in small doses, it's a pulse-pounding, worthy companion to both Superhot and Superhot VR. But if there was any common element to both those titles, it's in examining why other games do things the way that they do. The fundamental flaw of Mind Control Delete is that it's adding complication to a game premise that works largely because of its simplicity. That complexity hasn't ruined Mind Control Delete. There's still a ton of enjoyment to be had, and there's still nothing else quite like it out there. But without a doubt, it's fun that expires a lot faster than the original."}