{"ref": "https://www.gamespot.com/reviews/fur-fighters-review/1900-2605049/", "date": "July 18, 2000", "game_name": "Fur Fighters", "text": "Fur Fighters has all the trappings of a first-person shooter - it controls like an FPS, features FPS-style puzzles, and has items that you'd expect to see in an FPS. But there's only one catch: Fur Fighters isn't a first-person shooter. And unfortunately, the game's third-person perspective introduces a lot of problems that could have been easily avoided. Those problems aside, Fur Fighters has a fun premise and very good gameplay. The Fur Fighters are a small team of gun-toting creatures, including a dog, a cat, a kangaroo, a baby dragon, and so on. All the babies in their village have been captured and dispersed throughout the game's levels. So it's up to you, as the team of fighters, to get the babies back and stop your evil enemy from taking over the world. Instead of choosing just one of the Fighters, you'll have to play as the entire team to get through the game's numerous puzzles. For starters, each animal has his or her own special ability. Tweek, the dragon, can glide for short distances. The dog can burrow underground in some areas, the cat can climb walls, the kangaroo can jump higher than the rest, and so on. To facilitate the character changing, the game is filled with teleporter balls - when you touch the teleporter, you'll change Fighters. While each Fur Fighter has individual health statistics (so you can change to a new character when one is getting pummeled), inventory and ammo are shared. Much like many modern-day 3D platformers, Fur Fighters has a collection aspect to it. You must collect a certain number of babies before the next level opens up, and there are gold icons that provide you with additional transporter energy spread throughout the game, as well. Plus, you must obtain special items to gain entry into some levels. For instance, you need a subway token to ride a train that takes you to the first level, and you'll need an access pass before you can enter the Beaver Dam level. Each level is filled with lots of evil drones that pretty much line up and wait for you to shoot them. With the game's lock-on aiming style and a little bit of dodging and circle-strafing on your part, you can come away from most firefights almost totally unscathed. Graphically, the game pulls off the cutesy look it's trying to achieve. Stuffing flies out of enemies when you defeat them, and the babies have that wide-eyed cartoon look to them. Overall, the environments look sharp, with a varied use of textures to keep things looking fresh. The sound is tolerable, with one major problem: Instead of going the extra mile and recording voice-overs, the game adheres to the Starfox method of voice work. So while you're reading text at the bottom of the screen, you're listening to meaningless jabbering. It's cute at first, but it quickly becomes way, way annoying. While the control is spot on, and the game has more than enough going on in the level department, forcing the game into the third-person perspective really causes trouble, as the camera angle is marginal at best. Between the fact that your character occasionally gets in the way and prevents you from seeing what you're aiming at and the fact that the game sometimes requires you to do some precise platform jumping, the frustration added by the third-person perspective is something that can, depending on your patience, completely ruin the single-player mode. What's even stranger is that the multiplayer mode gives you the option of third-person or first-person, which is significantly easier to play with. The multiplayer mode, called fluffmatch, is really where the game earns most of its points. Since the four-player split-screen deathmatch can be played from a first-person perspective, most of the camera problems of the single-player game are totally eliminated. The game is your standard deathmatch, with up to four-players on the same screen. While the level design is a little basic in the multiplayer mode, it's definitely functional and definitely a lot of fun. As a multiplayer game, Fur Fighters is about as close as Dreamcast owners can get to playing a GoldenEye or Perfect Dark-esque game - at least until the big guns, like Quake III Arena, are released. So, whether or not you'll really enjoy Fur Fighters is dependent on what type of game you're after. If you're looking for a multiplayer first-person shooter, it should definitely keep you satisfied. If you're after a good single-player game, rent Fur Fighters first to see if you can look past the game's camera problems."}