{"ref": "https://www.gamespot.com/reviews/gladiator-sword-of-vengeance-review/1900-6077988/", "date": "November 1, 2003", "game_name": "Gladiator: Sword of Vengeance", "text": "Ancient Rome and, more specifically, Roman gladiators have always made interesting subject matter for various mediums of entertainment. Throughout the years, numerous films, including the Academy Award-winning classics Ben Hur and Gladiator, featured some of the most epic gladiatorial action sequences every created and made heroes out of these enslaved Roman warriors. Strangely enough, however, there haven't been many good action games to feature Roman gladiators in any really serious capacity. Recently, this has all come to change, thanks to Acclaim's Gladiator: Sword of Vengeance, an action adventure game rooted deeply in a style that combines Ridley Scott's Gladiator with some of the more mythical aspects of Roman history. Gladiator does have some shortcomings, as its simplistic and frequently flawed gameplay can prove to be problematic. However, some excellent production values and an intriguing plot ultimately make the game most certainly worth checking out. What Gladiator: Sword of Vengeance is essentially a simple hack-and-slash action game but with a great story, graphics, and sound. Sword of Vengeance focuses on the life of one Invictus Thrax, a Roman born into slavery, who eventually rose through the ranks of gladiator battle to become the champion of all gladiators. He was also once favored by the Roman emperor, who promised him his eventual freedom. However, at the beginning of the game, we learn that the emperor was mysteriously killed and replaced by Arruntius, a sinful, vice-driven madman who has plunged Rome into its darkest times. Arruntius has decided to demolish the city of Rome in favor of a new capital city named Arruntium, to further commemorate its unholy leader. To celebrate the demolition, Arruntius stages a grand gladiatorial event, with Thrax at its epicenter. Thrax fights valiantly but is inevitably killed at the hands of an unseen and seemingly inhuman opponent. Upon his entry into the afterlife, Thrax is accosted by a pair of twin boys dressed in theater masks. They are revealed to be the sons of the Roman god Jupiter: Romulus and Remus. They explain to him that the gods are greatly displeased with Arruntius' ascension to power and reveal that all of this is largely due to assistance from Phobos and Deimos, the gods of fear and terror, respectively, who are also the sons of Mars, the god of war. Thrax is charged with the task of restoring Rome to its past glory and eliminating Arruntius--a task that Thrax is only too happy to accept. Gladiator is, essentially, a beat-'em-up game with swords. At your disposal, you have two basic attack buttons, which can initially be strung together into some rudimentary combos. You also have a magic button and an all-purpose action button. The action button comes into play in any number of different ways. Some examples include situations where Thrax must jump across a ledge, glide down a rope, use a key in a lock, pull a lever, and so on. Any time one of these actions is performed, it is done through an in-engine cutscene, so the action itself doesn't actually require any skill on your part. The game's basic attacks and magic attacks can be upgraded and earned through challenges. Challenge points are scattered pretty much throughout the game and usually entail slicing up a specific number of enemies or breaking a number of different objects in a set time frame. Through these challenges, you'll earn new magic attacks, like Herculean battle magic, which makes you much stronger and faster. You can also earn the power of Pluto, which brings up spirits from the underworld to assist you in battle. Other items, like new axes, better swords, and the like, can also be earned, in addition to improved combo attacks. The vengeful, reincarnated Thrax doesn't mind brutally slaying any foe who stands in his way. While all of these upgrades are certainly nice, they don't add a whole lot to the overall flow of the action. Most of Gladiator's combat sequences pretty much consist of you mashing the two attack buttons until you've cleared the area of all your foes. While this can be fairly repetitive, the action itself is still not bad, and, periodically, the repetition is broken up by the ability to perform an execution move. After wearing certain opponents' life meters down, the meter will turn red, and by pressing the action button, you'll enact an execution. The game will then switch to a cutscene where Thrax--depending on what weapon he is wielding--will kill his foe in one of several, brutal ways. Executions are contextual, depending on what type of enemy you're up against, and can only be performed on some of the tougher enemies in the game. However, when the opportunity arises, they're most certainly worth pulling off, as the sheer brutality of them, along with the heavy smattering of blood provided, makes them entertaining. Sadly, Gladiator's gameplay is bogged down by some rather significant problems. The first and most irritating of issues comes in the form of the game's enemy targeting system. When surrounded by a group of enemies, Thrax will automatically lock on to the enemy closest to him. You can cycle through the available enemy targets or unlock yourself from an enemy target by pressing the primary target button. If you want to stay locked on one enemy but want to quickly reverse your direction to face another opponent, pressing the secondary lock button will do so. While this is all well and good in theory, trying to switch between locked enemies while being stabbed at repeatedly doesn't go nearly as quickly as you'd like, and often you'll find yourself taking a lot more damage simply because you can't get yourself unlocked from one guy fast enough. As you can imagine, this can become quite frustrating. It's too bad that the gameplay of Gladiator didn't offer more depth. Another problem is the game's somewhat peculiar level design. Or, to be more specific, its unrelenting obsession with backtracking. Every puzzle in the game includes at least one section where you'll have to go back to one or two areas you've already been to, defeat an onslaught of slightly different enemies than you defeated the previous time, and then do a slightly different action than you did before. Additionally, the puzzles themselves aren't terribly challenging at all and are actually a bit on the mundane side. While this might not be quite so damning had there been a little less of an emphasis on them, unfortunately, you'll find that the game is absolutely rife with copious amounts of these puzzles, and it's hard to go far in the game without encountering one. While the gameplay does have its share of shortcomings, Gladiator's production values are really quite impressive. The overall look and feel of the various environments in the game are really something, using some great lighting effects and plenty of rich, colorful set pieces and textures throughout. Nowhere is this more evident than in the game's afterlife level, Elysium, which also acts as a hub level between missions. The grass textures found there are impressive by themselves, but the overall art design is also really spectacular. Gladiator also has a pretty impressive array of characters, ranging from various types of opposing gladiators to monsters ripped right out of Roman mythology, like cyclopes, demons, skeleton warriors, and, of course, the previously mentioned gods of fear and terror, Phobos and Deimos. While some of the character design is a bit derivative, the visual effects used for some of them--especially some of the ~shadow demons~--are pretty awesome looking. This is not to say that the game is flawless looking by any means. The game's cinematic camera can be a bit of a pain in certain situations (especially when surrounded by a number of enemies), and the game's frame rate has a very unpleasant tendency to severely drop when too much is occurring onscreen, especially on the PlayStation 2 version. Overall, though, both versions of the game look pretty great. The high production value of Gladiator doesn't stop with visuals, as the game's audio presentation is equally impressive. Though you won't find any famous voice actors speaking for the characters in the game, nearly all of the voice work in Gladiator is excellent. Additionally, save for a few cheap lines here and there, the dialogue is very well written and does a fantastic job of driving the game's story along by managing to keep you interested. The game's soundtrack is reminiscent of Hans Zimmer's score from the movie Gladiator and runs the gamut from ethereal and mellow to exciting and frenzied, providing just the right level of atmosphere for each situation. The game's sound effects are generally less impressive than the rest of the sound, with your standard fare of hack-and-slash effects, as well as the groans and screams of fallen opponents. It's not bad stuff, by any means, it's just not terribly impressive either. The action could have been better, but Gladiator is still worth checking out. Certain things that Gladiator: Sword of Vengeance does well, it does very well. The graphics and sound are of great quality, and the story that Acclaim Studios Manchester has created for Invictus Thrax is an entertaining one that most any action game fan should find intriguing, if not captivating. It's unfortunate that the gameplay isn't nearly as interesting or well-put-together as the rest of the game, and it's equally unfortunate that there isn't any sort of multiplayer component to go along with the story mode, which leaves you with nothing to do in the game once the story mode is complete. Ultimately, however, if you can look past some of the game's mechanical shortcomings, you'll likely be pleased with what Gladiator: Sword of Vengeance has to offer. Sadly, Gladiator's gameplay is bogged down by some rather significant problems. The first and most irritating of issues comes in the form of the game's enemy targeting system. When surrounded by a group of enemies, Thrax will automatically lock on to the enemy closest to him. You can cycle through the available enemy targets or unlock yourself from an enemy target by pressing the primary target button. If you want to stay locked on one enemy but want to quickly reverse your direction to face another opponent, pressing the secondary lock button will do so. While this is all well and good in theory, trying to switch between locked enemies while being stabbed at repeatedly doesn't go nearly as quickly as you'd like, and often you'll find yourself taking a lot more damage simply because you can't get yourself unlocked from one guy fast enough. As you can imagine, this can become quite frustrating. It's too bad that the gameplay of Gladiator didn't offer more depth. Another problem is the game's somewhat peculiar level design. Or, to be more specific, its unrelenting obsession with backtracking. Every puzzle in the game includes at least one section where you'll have to go back to one or two areas you've already been to, defeat an onslaught of slightly different enemies than you defeated the previous time, and then do a slightly different action than you did before. Additionally, the puzzles themselves aren't terribly challenging at all and are actually a bit on the mundane side. While this might not be quite so damning had there been a little less of an emphasis on them, unfortunately, you'll find that the game is absolutely rife with copious amounts of these puzzles, and it's hard to go far in the game without encountering one. While the gameplay does have its share of shortcomings, Gladiator's production values are really quite impressive. The overall look and feel of the various environments in the game are really something, using some great lighting effects and plenty of rich, colorful set pieces and textures throughout. Nowhere is this more evident than in the game's afterlife level, Elysium, which also acts as a hub level between missions. The grass textures found there are impressive by themselves, but the overall art design is also really spectacular. Gladiator also has a pretty impressive array of characters, ranging from various types of opposing gladiators to monsters ripped right out of Roman mythology, like cyclopes, demons, skeleton warriors, and, of course, the previously mentioned gods of fear and terror, Phobos and Deimos. While some of the character design is a bit derivative, the visual effects used for some of them--especially some of the ~shadow demons~--are pretty awesome looking. This is not to say that the game is flawless looking by any means. The game's cinematic camera can be a bit of a pain in certain situations (especially when surrounded by a number of enemies), and the game's frame rate has a very unpleasant tendency to severely drop when too much is occurring onscreen, especially on the PlayStation 2 version. Overall, though, both versions of the game look pretty great. The high production value of Gladiator doesn't stop with visuals, as the game's audio presentation is equally impressive. Though you won't find any famous voice actors speaking for the characters in the game, nearly all of the voice work in Gladiator is excellent. Additionally, save for a few cheap lines here and there, the dialogue is very well written and does a fantastic job of driving the game's story along by managing to keep you interested. The game's soundtrack is reminiscent of Hans Zimmer's score from the movie Gladiator and runs the gamut from ethereal and mellow to exciting and frenzied, providing just the right level of atmosphere for each situation. The game's sound effects are generally less impressive than the rest of the sound, with your standard fare of hack-and-slash effects, as well as the groans and screams of fallen opponents. It's not bad stuff, by any means, it's just not terribly impressive either. The action could have been better, but Gladiator is still worth checking out. Certain things that Gladiator: Sword of Vengeance does well, it does very well. The graphics and sound are of great quality, and the story that Acclaim Studios Manchester has created for Invictus Thrax is an entertaining one that most any action game fan should find intriguing, if not captivating. It's unfortunate that the gameplay isn't nearly as interesting or well-put-together as the rest of the game, and it's equally unfortunate that there isn't any sort of multiplayer component to go along with the story mode, which leaves you with nothing to do in the game once the story mode is complete. Ultimately, however, if you can look past some of the game's mechanical shortcomings, you'll likely be pleased with what Gladiator: Sword of Vengeance has to offer."}