{"ref": "https://www.gamespot.com/reviews/tiger-woods-pga-tour-07-review/1900-6167350/", "date": "March 13, 2007", "game_name": "Tiger Woods PGA Tour 07", "text": "Golf and the Wii's motion-sensing capabilities seem like a match made in heaven. Wii Sports Golf was shallow, but the potential for a fun game was there. Super Swing Golf was plenty deep, but the controls and pacing left something to be desired. Now EA Sports has stepped up to the tee to take a shot at becoming golf's first hole in one on the Wii. Tiger Woods PGA Tour 07 doesn't score an ace, but its accessible controls, large number of courses, and plethora of game modes put it squarely on the green. The new controls are surprisingly easy to learn. For the most part, the Wii version of Tiger Woods 07 is a lot like the PlayStation 2 version, though it has a whole-new swing mechanic that replicates a real golf swing and lacks some game modes. Swinging your ~club~ is very simple. You hold the Wii Remote with both hands and press and hold the B button when you're ready to swing. The power of your swing is determined by how far back your backswing goes, as well as how hard you swing. You can boost your shot's power (up to 10 percent more) by swinging harder. As it is in real golf, your follow-through is very important. Twisting your wrists to the left or right will add a slice or a fade. You'll find that if you have a propensity toward one or the other in real life, you'll probably have it here as well. If you're struggling to keep your shot on the course, an easier difficulty setting lets you hit the ball straight every time. Adding spin to your shot after you've hit the ball is as easy as pressing a direction on the D pad and wiggling the Wii Remote back and forth. The controls work really well, with a few caveats. Putting is sometimes problematic because you need to perform a practice swing to judge the power level you need and then try and replicate that with your actual swing. It's tough to be consistent, and the motion sensing is rather finicky when putting. There are some issues off the green, too, where sometimes the ball just doesn't go as far as it should, and a shot that reads 100 percent will travel just a fraction of the distance it was supposed to. But these problems are the exception, and for the most part, the game takes the occasionally imprecise controls into account and is very forgiving. Even little things like viewing your landing area and changing clubs can be done with ease while facing the TV or as you prepare to address the ball. If you aren't a fan of the motion-sensing controls, or you just get tired of standing, you can select an alternative control scheme where you swing by pressing down and then up on the Nunchuk's analog stick (which isn't used at all in the default scheme). This works just fine, except that there doesn't appear to be any way to add power to your shot. The ~true aiming~ system from the other versions of 07 has been implemented here, and it makes shot selection a less by-the-books affair by replacing the cursor that essentially pinpointed where your shot would land with a large circle that covers a much wider area. If you hit your shot just right, the ball should land somewhere in that circle. Should you miss, however, you're likely to end up in serious trouble. When using golfers with higher levels of skill, the circle doesn't come into play too often, but anyone playing with a new golfer will frequently find themselves questioning if the extra 10 yards of distance on a club is worth the increased size of the landing zone. You can still take huge risks--you're just more likely to pay for them now. There's certainly no shortage of ways to occupy yourself with Tiger Woods PGA Tour 07. You can select from a number of different match and scoring modes, including stroke play, match play, skins, and alternate shot. New to the series are bloodsome and greensome matches, both of which are team-based best-ball events. After you and your teammate hit your shots in greensome, you get to pick which ball you're going to play; in bloodsome, your opponent will choose which lie you'll use. One-ball is another new game, where you and your opponent share the same ball and alternate shots. The strategy in one-ball lies in trying to set your opponent up with difficult shots so that you're the one left with a makeable putt. This play mode is great for learning how to recover from bad shots, but it can be frustrating to play against the tenacious CPU and is best played against another person. Most of the new events this year are featured in the Tiger Challenge, where you'll travel the world, taking on fictitious golfers and PGA professionals in a series of matches. But if your interests lie in more traditional golf, the PGA Tour season offers plenty of challenge in its 29 multiday events. The thing that makes these game modes so addictive year in and year out is the ability to create a golfer and make him the greatest golfer on the planet. Tiger's unrivaled character creation mode is back and is as deep as ever. If realism's what you want, it's a breeze to create a golfer in your spitting image, and you're limited only by your imagination when it comes to making zany, off-the-wall characters. After completing a round or challenge, you're given points for individual attributes, based on your performance. These points can then be used to upgrade your golfer's power, accuracy, putting, short game, luck, and more. You'll also earn money for your wins, which allows you to purchase new clothes and equipment. You can outfit your gear and clothing with equipment modifiers, giving your stats a slight boost. If you just want to stick to the pros, there are 20 professional golfers (35 total golfers) in Tiger Woods PGA Tour 07. The list includes the likes of Tiger Woods, Stuart Appleby, John Daly, Jim Furyk, Retief Goosen, Vijay Singh, and Mike Weir, among others. For the first time, there are two LPGA golfers to pick from--Natalie Gulbis and Annika Sorenstam. Also, there are 18 different golf courses, both real and fantasy. This number is less than what was found on the PS2 and Xbox, but more than the PS3 and Xbox 360 versions of 07. Most of the courses return from previous versions, but there are some noteworthy additions--Aviara, Riviera, The National, The K Club, and the ocean course at Kiawah Island. Once again, there's no course designer--still a glaring omission after all these years. The one area where Tiger Woods 07 fails to impress is its graphics. The game doesn't look terrible, but even though it supports widescreen and progressive scan, it's not impressive. The courses are faithfully replicated, but thanks to low-quality textures, pixelated trees, and some terrible-looking water, they aren't much to look at. The backgrounds are desolate, too, often completely void of any scenery whatsoever. The Wii isn't a graphical powerhouse, but it's certainly capable of better than what's here. Fortunately, the created characters and the professional golfers look quite nice. The golfers each have a unique swing, which makes them not only look different but also play different. Like Jim Furyk's swing, Tiger Woods 07's graphics aren't pretty, but they get the job done. Most of the audio in Tiger Woods 07 sounds good--or as good as can be expected from a golf game. The sound effects are fine, and you'll hear a ~ping~ through the Wii Remote's speaker as your club hits the ball. The crowds are lively and react with enthusiasm to a great shot. David Feherty and Gary McCord are back and seemingly have nothing new to say. The commentary plays it too straight in a game that's otherwise full of personality. Their negative comments appear to have been toned down a bit, but the duo still drinks ~Haterade~ and just loves to rub it in after a poor shot. Should you choose to forgo the announcers, there are lots of ambient noises to listen to instead. You'll hear birds chirping, planes flying overhead, and on Pebble Beach, the sea crashing into the cliffs. If you own Tiger Woods 07 on another console, there's little reason to pick it up again on the Wii because there isn't any new content. However, it's certainly the best golf game available for the Wii at this time, and there's plenty here to keep you busy. Tiger Woods 07 does a fine job replicating the feel of actually swinging a golf club, and just as impressive is the fact that the control scheme is accessible to both golfers and nongolfers alike."}