{"ref": "https://www.gamespot.com/reviews/van-helsing-review/1900-6098717/", "date": "May 18, 2004", "game_name": "Van Helsing", "text": "The game based on the new action horror blockbuster Van Helsing doesn't earn too many points for originality--but the same can probably be said of the movie. Likewise, the game can make for a pretty entertaining time if you don't go in expecting too much and just want a few hours of none-too-serious, gothic-styled action. This action adventure casts you as Hugh Jackman's titular character from the movie--a monster hunter with a mysterious past--and sends you through about a dozen levels filled with lots of ~things that go bump in the night,~ as well as a few noteworthy boss opponents such as the Wolf Man, Frankenstein's monster, the sadistic Igor, Dracula's gargoylelike brides, and the vampire lord himself. In your battle against these foes, you'll use Van Helsing's various supernaturally imbued firearms as well as his close-range blades. The action is fast and basically satisfying, resulting in what's a simple but fairly good game all around. Castlevania already put Dracula, Frankenstein's monster, Igor, and the Wolf Man all in the same game, but Castlevania didn't have Hugh Jackman. Van Helsing the game doesn't include any full-motion video sequences from its cinematic counterpart, but it re-creates some sequences from the film in cutscenes using the game's 3D graphics engine. The main character does bear Hugh Jackman's voice and likeness, and the plot of the game mimics that of the movie. This is a linear, single-player action adventure game that primarily involves you fighting your way from one screen to the next by rapidly firing or swinging your weapons. Much like Capcom's influential Devil May Cry, Van Helsing allows you to pull off some fancy combos, first by using your melee weapons to pop enemies into the air or to smash them to the ground and then by finishing them off with a hail of gunfire. Also like Devil May Cry, Van Helsing affords you with no control over the game's camera angle, which automatically shifts perspective as you run through the game's environments. Sometimes the camera angles can be pretty awkward or even frustrating, such as when you find your character concealed behind a foreground object or so far in the background that it's difficult to distinguish your character from his enemies. However, this is more of an occasional nuisance than a real problem, since Van Helsing--who is such a skillful monster hunter and everything--can automatically aim at any foes in his vicinity as long as you press and hold the targeting button. At first, Van Helsing has dual pistols, which can fire about as quickly as you can tap the attack button, and he has his spinning buzz saw-like tojo blades. During the course of the adventure, you'll find several other weapons, such as a shotgun, a crossbow, and twin scimitars. The weapons each have a distinctly different feel to them, and most of them are pretty effective, except for maybe the very slow-firing lightning gun. To the game's credit, certain weapons are logically better suited against certain foes. For instance, the powered-up shotgun blast causes explosive damage, which is devastating against the stone statues you'll be fighting later in the game. Meanwhile, the crossbow's bolts are excellent against unarmored targets. You can easily switch weapons in midbattle using the directional pad. In addition to his primary weapons, Van Helsing has a grapple gun that he can use to either quickly drag himself from danger (by firing the device at a nearby obstacle) or effortlessly pull a pesky foe toward him (to set up a powerful combo). The grapple gun is also used for navigating specific parts of the environment. The device looks great in action but ultimately doesn't have a significant role during gameplay. Van Helsing has a few other moves, such as the abilities to double-jump off of obstacles and execute lateral dives to avoid danger. Some other moves may be unlocked in between levels by cashing in the green power glyphs you earn from defeating foes, and while some of these moves are pretty cool, you could just as easily get through the game without them. The game's controls are just responsive enough. The action is never perfectly smooth, but precision targeting is never an issue--due to the auto-aim feature. Additionally, there tend to be more than enough bad guys to fire at and avoid, which keeps the game's pace up. To add a bit of variety to all the hacking and shooting, the game involves some light puzzle-solving and encourages you to try to explore a bit off the beaten path--for there are a few secret areas to be discovered. Meanwhile, it's nice that there are numerous boss battles against the game's main villains, though these battles themselves are very straightforward and basically involve laying into the enemy with everything you've got while jumping over or sidestepping their attacks. There are two difficulty modes available from the outset, and once you finish Van Helsing the first time, you can start again at the newly unlocked hard difficulty mode using the weapons, moves, and optional cheats you've already discovered. All told, you could probably squeeze about 10 hours out of this game, though it'll probably last you maybe three quarters of that amount. Van Helsing the game doesn't look particularly impressive, but it doesn't look bad. That's true of both the PlayStation 2 and Xbox versions of the game, which look and play roughly identically, though the PS2 version of the game actually features slightly richer colors and higher contrast. Hugh Jackman's character looks like him, but his clothes can be seen clipping through his body during close-ups (one nice touch, though, is that he can lose his hat if knocked down by a powerful attack). Most of the other character models are simple and blocky, and, unfortunately, there's no blood or foul ichor spilled, despite all the monster-slaying going on. The game's environments aren't especially detailed either, but they do capture the movie's gothic look. Things would have looked much better, overall, had it shared Devil May Cry's smooth frame rate in addition to some of its gameplay mechanics. Get ready to give your index finger a workout from all the shooting you'll need to do in Van Helsing. Meanwhile, the audio is dominated by the rattle of Van Helsing's weapons, as well as by an instrumental soundtrack that roars into life when enemies are around. The music cuts off rather abruptly once the last foe in the vicinity has been defeated, but it tends to fit the action well. Also, there's a fair amount of decent voice acting in the game, highlighted by Hugh Jackman's own dialogue for the starring role. The plot here isn't given much time to develop, though, but that's probably for the best. In general, movie games have a bad reputation for cashing in on successful film properties, but the stigma just might go away, in time, if movie games like Van Helsing become the standard. A good rule of thumb should be, if you can strip the movie license away from a movie game and still be left with something worthwhile, then you've got yourself a game that isn't using its movie license as a crutch. This is fortunately true of Van Helsing, which isn't a great game but can still be fun while it lasts."}