{"ref": "https://www.gamespot.com/reviews/tony-hawks-project-8-review/1900-6162883/", "date": "December 7, 2006", "game_name": "Tony Hawk's Project 8", "text": "Tony Hawk's Project 8 is the first game in the series to be designed from the ground up for the Xbox 360 and PlayStation 3. But Tony's not quite ready to leave the old systems behind just yet, so a version of Project 8 has also been released for the Xbox, PlayStation 2, and PlayStation Portable. The game has the same sort of skating goals that you'd expect from the series, but it makes a number of seemingly arbitrary control changes that'll stand out for you whether you've played other versions of Project 8 or not. The end result is a game that feels like some kind of crazy hack or bootleg version of the original game. Will this be Tony Hawk's last run on the old consoles? The game might make you wonder if the developer, Shaba Games, was left to its own devices when it came to fitting Project 8 onto these less-powerful platforms. It's implemented most of the features found in the other version of the game, as well as come up with some ideas of its own. ~Nail the trick~ is the big new feature for Project 8, and there's an implementation of it in these three versions, as well. The feature lets you drop into slow motion any time you're in the air. Your control switches from controlling the skater to controlling his feet using the two analog sticks on consoles, or the D pad and buttons on the PSP. By moving the skater's feet, you cause the board to flip. By moving your feet at different times, you can segue into other tricks or plant your feet back on the board to snap back into real time and get on with it. It's a slick new idea that works really well on the 360 and PS3. Over on the old consoles and PSP, though, the timing is less precise, and it just doesn't work quite as well overall. Most of the other changes aren't found in the other versions of the game, and some of them change fundamental things that have been with the series for years. To name one, you can now manual by just pressing the flip trick button while you're on the ground. You can still do manuals the normal way, but this seems designed to make it easier to manual. In practice, it sort of gets in the way, causing you to manual when you didn't mean to do so. Also, to further make things easier, you now get a combo timer that appears when you stop doing tricks. If you can get tricks going again before the timer expires, it all counts as part of one big combo. The last movement change requires you to tap up on the D pad a couple of times to gain speed when you start skating. When your special meter is full, pressing up gives you an extra speed boost. These are all decent changes that don't necessarily break the game, but to make such arbitrary changes to things that worked perfectly well in the past is pretty weird. The rest of the controls also feel really sketchy. Turning feels imprecise, which makes lining yourself up kind of a chore, especially on the PSP, where the D pad seems to make it more difficult to turn while stopped. That can get frustrating fast. While the levels in these versions of Project 8 are very similar to the ones found in the lead releases, they're all broken up into individual areas, so you'll have to load up each new area whenever you want to change, as opposed to the seamless world offered on newer platforms. Each level has its own set of goals, including basic things like trying to grind from one chalk mark to another, or touring around an area and doing a specific trick on each one. Each area also has a classic goals mode, which gives you a two-minute run timer and 10 goals to get through, just like the old Tony Hawk games. There are plenty of goals to try in each area, and you don't necessarily have to accomplish all of them to open up the next stage. The end goal of the career mode is to make it onto Project 8, Tony Hawk's new scheme that has him out looking for the eight best skaters around. Along the way you'll run into a handful of pro skaters and they'll have their own goals for you to take on. The career mode is about as lengthy and varied as you'd expect from the series. In addition to the career mode, the game has a set of offline multiplayer options, including the same set of modes that you've seen in previous Tony Hawk games, like trick attack, graffiti, slap, combo mambo, and so on. Nail-the-trick attack is a new mode that only counts points earned during nail the trick. And the PSP version has a new mode called obstacle course, which is a racing mode. The PSP version of the game also has its own separate classic mode, which lets you take timed runs through levels taken from Tony Hawk history. You'll see the mall from the first game, the Chicago skate park level, the ruins from American Wasteland, and more. There are eight levels in this mode, and you can choose from three difficulty settings to make things super easy or quite difficult, if the default middle setting isn't enough. This is a pretty nice addition that gives the PSP more content to play through than its console brethren. Project 8 has a really weird feel to its controls that can screw with your timing if you've been playing this series for a while. Graphically, the game looks roughly the same on the PS2, Xbox, and PSP. The Xbox version is a bit cleaner, and the PSP version's frame rate isn't as good. Of course, all three versions pale in comparison to the 360 and PS3 versions of the game, but that's to be expected. The game looks good, but most of the animation and models feel as though they've been lifted directly out of previous versions of the game. Considering Project 8 redid most of its animations on the 360 and PS3, that's a little disappointing, but again, it's to be expected at this point. The sound also feels as though it's been recycled from previous games, though it does have some passable voice acting and the soundtrack has a good amount of variety. Even if you haven't seen Project 8 on the PS3 or Xbox 360, it's hard to shake the feeling that this isn't a complete Tony Hawk game. Sure, most of the pieces are in place, but it just doesn't feel quite right. The changes made to the gameplay feel weird and arbitrary, and the levels don't work quite as well when they aren't part of one big world. While it's still a fairly impressive technical achievement on the PSP, none of these versions of this game play well enough to warrant picking them up, unless you're a diehard fan of the series who doesn't plan on getting a new console any time soon."}