{"ref": "https://www.gamespot.com/reviews/killzone-2-review/1900-6205274/", "date": "February 26, 2009", "game_name": "Killzone 2", "text": "No one could have suspected that the sequel to 2004's Killzone would be this good. Killzone 2 is a tremendous package, offering an exciting campaign and terrific competitive online play, neither of which create new paradigms for first-person shooters, but rather set new standards in subtle but significant ways. From groundbreaking visuals to well-crafted multiplayer maps, most of Killzone 2's individual elements stand out in a crowded genre, making its meager attempts at storytelling easy to ignore. PlayStation 3 owners looking for a shooter to keep them busy for the rest of 2009 and beyond need look no further: The fierce action will keep you glued to your television screen for some time to come. The M82: Is there nothing it can't do? You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Killzone 2 Video Review What makes Killzone 2's single-player campaign so much fun? First and foremost, the weapons are a lot of fun to shoot, even the standard assault rifles that form the core of your loadout. The M82's effective scope makes zooming in on your target a breeze, yet this rifle is effective at close range as well, establishing itself from the beginning as a formidable firearm. The LS13 shotgun is also powerful and rewarding to fire; though you may only shoot off a foe's helmet with other weapons, you'll watch entire heads explode with a single blast from this close-range powerhouse. The bolt gun is another favorite, skewering enemy soldiers onto surfaces and exploding a short moment later. Though you're traversing a sci-fi setting, your weapons are decidedly modern-day, from the sniper rifle to the vicious flamethrower, with one exception: the lightning gun. This mighty instrument showers enemies with overpowering jolts of electricity, and though it's not available for long, it makes short work of robotic and humanoid foes. Each of these weapons feels just right; fantastic spurts of blood, outstanding animations, exquisitely detailed weapon models, and explosive sound effects fuse seamlessly and give a satisfying sense of impact every time you land a shot. Although there's a great variety of weaponry, you won't encounter that many different kinds of enemies as you fight your way across the war-torn landscapes of the planet Helghan. As in the original Killzone, your enemies consist largely of Helghast soldiers, yet though this limited selection led to monotony in the past, an assortment of factors in the sequel hold tedium at bay. The action is constantly pushing forward, leading you from one quality scripted event to the next and pitting you against bright AI opponents that have a remarkable grasp of battlefield tactics. These soldiers put up a fight and exhibit authentic behavior as you rain bullets on them. If you set your sights on a soldier peeking from behind cover and fire off a few rounds in that direction, he'll patiently wait until all signs of fire have vanished. Helghast will flank you and shoot blindly from behind cover, and should you toss a grenade in their direction, they'll quickly scatter. You'll normally be fighting alongside a computer-controlled teammate or even entire squads of fellow infantry. Enemy AI is just as concerned with your comrades as it is with you, so you'll never feel as if you have a bull's-eye plastered on your forehead, as is common with many other team-based shooters. As a result, Killzone 2's thrilling large-scale battles unfold dynamically and offer a legitimate challenge while rarely feeling unfair--a frustrating rocket-heavy final battle serving as the only exception. Some excellent turret sequences and other segments also provide welcome variations on the shooting theme. At one point, you'll climb into a robotic shell and mow down infantry and tanks with machine gun fire and rockets. The way your transparent protective shield exhibits cracks as you take damage and the remarkable fire and smoke effects that light up the screen add to the excitement of the level. In another fun and visually stunning sequence, you'll use an antiaircraft turret to take down squadrons of enemy fighters. Even operating a standard turret is more appealing than you would expect, which is a result of great map design and well-scripted enemy entrances. If you're just using your standard arsenal, missions are diverse and engaging. You'll take aim at tanks (and in one boss fight, a hovering aircraft) using Killzone 2's potent rocket launcher, and you'll fight your way through a besieged air base in which winding corridors and intersecting passages have you battling multiple enemies on multiple levels. Most levels take their cue from the usual first-person shooter formulas, and though it takes place in the spacefaring future, Killzone 2 feels more akin to a modern-day FPS by way of its standard weapons and mostly humanoid enemies. It's an interesting blend of two disparate sensibilities that works far better than in the original, and it's further ripened by gameplay touches that feel authentic within that framework. Movement and turning speeds have a real feeling of weight, which is appropriate considering the heavy armor burdening you. This can make the controls feel somewhat sluggish at first, given that you take a moment to gather momentum. It doesn't take long to get accustomed to this sense of overall bulkiness, though, and it's consistently delivered across multiple mechanics. For example, when you jump, the way that you bend into the leap and cushion the landing with another slight crouch feels surprisingly realistic. That weight also informs movement in and out of cover. Killzone 2's cover system is solid, and it never removes you from a first-person viewpoint. Though some objects can obscure your view if you try to take potshots from behind them, sticking to cover and leaning out from behind walls is generally effective and intuitive. This armored suit is the ultimate death machine. Whether you go for a pop-and-shoot approach or just gun your way through, the mission design keeps you constantly moving from one objective to the next. The quick pace is one of Killzone 2's finest facets; battles don't wear on too long, and they aren't so brief as to be anticlimactic. Like many other shooters, mission objectives often involve turning a crank or pushing a button. In Killzone 2, this may mean rotating the controller to simulate the onscreen activity. These moments feel unnecessary and ironically disrupt the sense of immersion, but as tacked-on as they are, the actions are too brief to be especially annoying. You'll also use your gamepad's motion sensitivity to stabilize the sniper rifle, though the implementation here is subtle and therefore relatively harmless. It's a real pity that there is so little context for the exceptional action. If you're familiar with the original Killzone, you'll at least have an idea why the ISA (International Strategic Alliance) is attacking the Helghast homeworld; if not, it's clear that as Thomas Sevchenko, you are on the side of the good guys--just not clear why they are the good guys. The dialogue is rudimentary (a discussion regarding sandwiches jumps immediately to mind), the characters forgettable, and the plot serves purely as a thin framework to move you from one environment to the next. Yet the cutscenes are top-notch, and unlike their counterparts in fellow PS3 shooter Haze, there's nothing intrinsically offensive or wearisome about the fist-pumping grunts at the core of the story. The story isn't deep or involving--it's just there, neither enhancing nor diminishing Killzone 2's action. That action is enhanced by groundbreaking visuals that elevate Killzone 2 to the head of its class. Both technically and artistically, this is a real stunner. You'll first notice the obvious expressions of its technical prowess: environments jam-packed with objects and textured architectural details, pipes and crumbling rebar jutting from dilapidated buildings, and gorgeous lighting that drenches market squares and sandy battlefields with an incandescent glow. As you peel away the visual layers, your appreciation will only grow. Soldier animations are the best in the genre: Enemies move so fluidly during battle, and shift from cover to firing stance so smoothly, it's clear that meticulous attention was given to making each limb move authentically. Even the smallest details are striking. Raging fires react to the wind as it blows through the level, lightning flashes across the gloomy skies, and billows of smoke so thick you could choke on them cloud your view--but never so much as to be a gameplay annoyance. The environments are dripping with grim ambience. These visuals coalesce beautifully to give Killzone 2 a cohesive look that relies as much on its art design as it does on its technology. A subtle grain filter, a good amount of motion blur, and deep color saturation give most levels a dank, overcast ambience, and asymmetrical architecture and other small stylistic touches make Helghan feel more like a grim alternate-universe Earth than a completely foreign world. The sound design offers an equally intense palette. Explosions are obnoxiously loud, and the din of gunfire spreads across the map. The largest battles, such as one that rages across a decrepit bridge, sound intensely chaotic, and the crack of lightning bolts on Blood Gracht may cause you to jump out of your seat. The stormy soundtrack rages at all the right moments but gets a bit overwrought, which befits the hammy voice acting more than it does the layered sound effects. Although the campaign is over in eight or nine hours, many levels are eminently replayable thanks to tough enemy AI and multiple difficulty levels, and the game makes it easy to revisit specific sequences within its mission menu. But what gives this shooter legs is its fantastic online play, a fun and competitive extravaganza that issues a constant stream of benefits. Like the most recent Call of Duty games, Killzone 2 rewards you with bonuses as you play, which in this case can mean new weapons, extra grenades awarded upon respawning, and most intriguingly, entire classes. This is done not only via a leveling system that pushes you ever closer to the next reward, but also with ribbons earned by completing specific tasks, such as getting a certain percentage of your team's kills. These bonuses are earned separately from leveling, which makes for two layers of online play enhancements to keep you ever addicted. These dividends flow in a seemingly endless current, though they aren't the only facet of online play that will keep you gripping your controller; the team-based gameplay itself is outstanding, which serves as reason enough to stick with Killzone 2. The modes themselves offer few surprises, what with variants on Team Deathmatch (Bodycount), Conquest (Capture and Hold), and Capture the Flag (Search and Retrieve), among others. Rather, matches are unique because these modes are strung seamlessly together, forcing teams to move from one objective to the next with barely a breather in-between. Up to five modes mesh into a single game, which keeps teams on their toes and spreads hotbeds of action about the maps. In a single match, you're likely to band with teammates in an exposed courtyard, navigate tight walkways as battles rage in the artificial gulley just beyond, and defend an objective in a claustrophobic alcove. It's unlikely that you'll have trouble finding players online to join you in one of Killzone 2's 32-player engagements, but should you be so inclined, you can fill out the games that you host with up to 15 AI-controlled bots. You can even practice offline in one-off matches with those same bots if you prefer. The eight maps included are exceptional, largely because they are flexible enough to make every mode feel like a natural fit for the precise layouts. Aspects such as the varying spawn points of the propaganda speaker in Search and Retrieve, and the vulnerable locations of capture points in Capture and Hold, provide focused hot spots and send you to every nook and cranny of the maps. Be prepared to think vertically because the pathways wind up stairwells, through hidden tunnels, and across balconied walkways. The addition of techniques available to each of Killzone 2's seven classes makes the ensuing action even more dynamic. An engineer's turrets can make Pyrrhus Rise's natural chokepoints even more treacherous, whereas a cloaked enemy may pounce on you as you navigate Tharsis Depot's constricted walkways. All the while, visual flourishes such as floating embers on Visari Hammer and distant artillery fire on Salamun Market keep the mood oppressive. Online play offers an embarrassment of rewards. Additional features flesh out the robust online play. You can join other teammates in a squad, a la Battlefield 2 and Enemy Territory, a feature that lets you coordinate attacks with ease. Full support for clans and clan challenges should make Killzone 2 a natural destination for competitive teams, and you can use killzone.com to schedule clan matches and tournaments. But whether you're a lone wolf or a clan enthusiast, you'll be happy to find a mostly smooth online experience, with only rare and short bouts of visual slowdown and online lag. In light of this extraordinary suite of online options, it's a pity that there is no cooperative play, and the single-player campaign seems ripe for such an addition, given that you're usually accompanied by an AI teammate. You'll have to look to the inevitable Killzone 3 to find out if developer Guerilla can dig any diamonds out of this series' rough narrative. Otherwise, Killzone 2 is an exceptional first-person shooter, not because it does anything particularly new, but because it does everything extraordinarily well. There's certainly no doubting its graphical superiority, but though its moody visuals invite incessant superlatives, it's the tight, electric action that will make this an off- and online haven. That action is enhanced by groundbreaking visuals that elevate Killzone 2 to the head of its class. Both technically and artistically, this is a real stunner. You'll first notice the obvious expressions of its technical prowess: environments jam-packed with objects and textured architectural details, pipes and crumbling rebar jutting from dilapidated buildings, and gorgeous lighting that drenches market squares and sandy battlefields with an incandescent glow. As you peel away the visual layers, your appreciation will only grow. Soldier animations are the best in the genre: Enemies move so fluidly during battle, and shift from cover to firing stance so smoothly, it's clear that meticulous attention was given to making each limb move authentically. Even the smallest details are striking. Raging fires react to the wind as it blows through the level, lightning flashes across the gloomy skies, and billows of smoke so thick you could choke on them cloud your view--but never so much as to be a gameplay annoyance. The environments are dripping with grim ambience. These visuals coalesce beautifully to give Killzone 2 a cohesive look that relies as much on its art design as it does on its technology. A subtle grain filter, a good amount of motion blur, and deep color saturation give most levels a dank, overcast ambience, and asymmetrical architecture and other small stylistic touches make Helghan feel more like a grim alternate-universe Earth than a completely foreign world. The sound design offers an equally intense palette. Explosions are obnoxiously loud, and the din of gunfire spreads across the map. The largest battles, such as one that rages across a decrepit bridge, sound intensely chaotic, and the crack of lightning bolts on Blood Gracht may cause you to jump out of your seat. The stormy soundtrack rages at all the right moments but gets a bit overwrought, which befits the hammy voice acting more than it does the layered sound effects. Although the campaign is over in eight or nine hours, many levels are eminently replayable thanks to tough enemy AI and multiple difficulty levels, and the game makes it easy to revisit specific sequences within its mission menu. But what gives this shooter legs is its fantastic online play, a fun and competitive extravaganza that issues a constant stream of benefits. Like the most recent Call of Duty games, Killzone 2 rewards you with bonuses as you play, which in this case can mean new weapons, extra grenades awarded upon respawning, and most intriguingly, entire classes. This is done not only via a leveling system that pushes you ever closer to the next reward, but also with ribbons earned by completing specific tasks, such as getting a certain percentage of your team's kills. These bonuses are earned separately from leveling, which makes for two layers of online play enhancements to keep you ever addicted. These dividends flow in a seemingly endless current, though they aren't the only facet of online play that will keep you gripping your controller; the team-based gameplay itself is outstanding, which serves as reason enough to stick with Killzone 2. The modes themselves offer few surprises, what with variants on Team Deathmatch (Bodycount), Conquest (Capture and Hold), and Capture the Flag (Search and Retrieve), among others. Rather, matches are unique because these modes are strung seamlessly together, forcing teams to move from one objective to the next with barely a breather in-between. Up to five modes mesh into a single game, which keeps teams on their toes and spreads hotbeds of action about the maps. In a single match, you're likely to band with teammates in an exposed courtyard, navigate tight walkways as battles rage in the artificial gulley just beyond, and defend an objective in a claustrophobic alcove. It's unlikely that you'll have trouble finding players online to join you in one of Killzone 2's 32-player engagements, but should you be so inclined, you can fill out the games that you host with up to 15 AI-controlled bots. You can even practice offline in one-off matches with those same bots if you prefer. The eight maps included are exceptional, largely because they are flexible enough to make every mode feel like a natural fit for the precise layouts. Aspects such as the varying spawn points of the propaganda speaker in Search and Retrieve, and the vulnerable locations of capture points in Capture and Hold, provide focused hot spots and send you to every nook and cranny of the maps. Be prepared to think vertically because the pathways wind up stairwells, through hidden tunnels, and across balconied walkways. The addition of techniques available to each of Killzone 2's seven classes makes the ensuing action even more dynamic. An engineer's turrets can make Pyrrhus Rise's natural chokepoints even more treacherous, whereas a cloaked enemy may pounce on you as you navigate Tharsis Depot's constricted walkways. All the while, visual flourishes such as floating embers on Visari Hammer and distant artillery fire on Salamun Market keep the mood oppressive. Online play offers an embarrassment of rewards. Additional features flesh out the robust online play. You can join other teammates in a squad, a la Battlefield 2 and Enemy Territory, a feature that lets you coordinate attacks with ease. Full support for clans and clan challenges should make Killzone 2 a natural destination for competitive teams, and you can use killzone.com to schedule clan matches and tournaments. But whether you're a lone wolf or a clan enthusiast, you'll be happy to find a mostly smooth online experience, with only rare and short bouts of visual slowdown and online lag. In light of this extraordinary suite of online options, it's a pity that there is no cooperative play, and the single-player campaign seems ripe for such an addition, given that you're usually accompanied by an AI teammate. You'll have to look to the inevitable Killzone 3 to find out if developer Guerilla can dig any diamonds out of this series' rough narrative. Otherwise, Killzone 2 is an exceptional first-person shooter, not because it does anything particularly new, but because it does everything extraordinarily well. There's certainly no doubting its graphical superiority, but though its moody visuals invite incessant superlatives, it's the tight, electric action that will make this an off- and online haven."}