{"ref": "https://www.gamespot.com/reviews/tony-hawks-underground-2-review/1900-6109621/", "date": "October 4, 2004", "game_name": "Tony Hawk's Underground 2 Remix", "text": "Despite the inclusion of the number ~2~ right in the game's title, Tony Hawk's Underground 2 is the sixth Tony Hawk game that has been released in as many years. Over these past six years, the series has created a genre and, with every entry, reshaped that genre. Early installments in the series basically rewrote the book on the rewarding combo system every year, but with the gameplay already in a rock solid state, the more recent entries have made more subtle changes. THUG2 hangs on to the great gameplay of the previous games, makes a few minor tweaks, and wraps it all up in a new Bam Margera-centric package. The result might be more satisfying for those who haven't seen most of this stuff already done before in previous Tony Hawk games. Tony Hawk and Bam Margera want you! You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tony Hawk's Underground 2 Video Review Yes, professional shopping cart destroyer Bam Margera, and his brand of destructive fun, figure much more heavily into the latest Tony Hawk game. The game's story mode essentially plays out like a Viva La Bam scavenger hunt, with two teams--one led by Tony Hawk and the other by Bam Margera--setting out on the World Destruction Tour. So your goals don't focus so much on becoming a star of the skateboarding world; here, you're just trying to fly around the world and break stuff. THUG2's story mode is a whirlwind tour that gives you four skaters and a mess of goals to accomplish in each level. You start out each level as your created skater, though you'll also pick a pro skater as a partner. You'll also find two other skaters--or at least, people who ride skateboards, since it seems weird to call Ben Franklin or a shrimp vendor ~skaters~--hidden in various spots on each level, and each time you encounter a new skater, you'll unlock another set of goals for that level. Some of these new characters don't even ride boards. You'll run into Steve-O, who rides around on a wheeled mechanical bull, and you'll meet an Australian in a small go-kart. Goals are handled a little differently this time around. Rather than having people on the street that you can speak with to get your goals, you're given a list and set off into the world. There aren't any on-screen indicators to point you in the direction of a goal, though if you happen to do a trick off of a piece that is part of a combo goal, the rest of the pieces will light up. If you want the skinny on what, exactly, you're supposed to be doing, you have to pause the game and go into your view goals screen, which will give you more details on what you need to do. While this approach frees the game of clutter and on-screen icons, it also means you're going to be spending a lot more time reading text in the pause menu. Each goal is worth a different amount of points. Once you've earned a specific number of goal points, you'll be able to move forward. This also triggers a cutscene, which puts some more backstory to the Bam versus Tony adventure. All in all, the story mode is satisfying in its structure, but it's also short. Despite having three difficulty levels, players should be able to burn through the story mode in around five to seven hours. Fortunately, that's not all that THUG2 has to offer. Underground 2 also contains ~classic mode,~ which brings back the two-minute run timer and goal structure of the first three Tony Hawk's Pro Skater games. Many of the game's levels are the same levels you see in the story mode, but a number of levels from previous entries in the series--all the way back to the school and downhill jam levels from the very first game--appear here. While it's nice to have a separate mode like this, the concept of working to unlock levels that you've either already played in the story mode or remember from earlier games in the series makes the mode a little underwhelming. More unique levels for this mode would have been a big help. Sure, it's got Phil, but where's Raab Himself? Rake Yohn, even? The gameplay in THUG2 starts with THUG, which added the ability to get off of your board and run around, and expands from there. Probably the most important addition in THUG2 is the sticker slap, which is an airborne wall plant that shoves you off with a good deal of acceleration, making it perfect for finding your way back onto a rail and continuing a combo by going back the way you came. The rest of the gameplay changes aren't really as useful. You can also execute vertical wall plants while going up some ramps, giving you an extra height boost that you'll rarely need to actually use, but it will occasionally come in handy. You can now spray graffiti tags when you're off your board, which factors into some goals. When you're special, you can enter ~focus mode,~ which is essentially a glorified slow-motion effect. A few goals in story mode require it, but beyond that, all focus will do for you is make it slightly easier to land cleanly or to balance on rails, lips, and manuals for longer periods of time. If this is your first experience with the Tony Hawk series, you might find that useful, but anyone with even limited experience with the games won't need the help. There is also a new move called the natas spin, which lets you spin in place on top of poles, fire hydrants, trash cans, and other pointy items. It, like most of the other new moves, figures into a couple of goals, but doesn't really seem all that necessary. The game also has a new ~freak out~ function. After some falls, a freak out meter will appear, and mashing the grind button will cause it to fill up. If you reach a certain point on the meter before your skater stands back up, you'll make him get mad and destroy his board. A new board gets tossed in and play continues as normal, but your tantrum translates into a couple thousand points of base score. So if you can get a combo going a few seconds after your bail, you'll get some bonus points to throw in there. However, freaking out just means it'll take longer for you to get back on your board and start skating again, and the game has almost completely de-emphasized point scores in its goal-based modes. The score bonus isn't enough to justify the extra time it takes to get back on the board, so you're usually just better off keeping your cool. While not all of these changes are all that great, the core gameplay in THUG2 is still very strong. The refined gameplay that comes from six years of tinkering still works, and fans of the series should still enjoy themselves quite a bit. The PC and PlayStation 2 versions get the additional bonus of online play and a face mapping feature that lets you take a picture of yourself and put it onto your created skater. The face mapping works largely as it did in the previous game, though the PlayStation 2 version now has EyeToy support, making it a bit easier to get your face in the game. The trade-off is that you'll usually get better results with a photo from a digital camera. On the PC, you simply must crop a face image down to 128x128 pixels and import it from the game's front end. Every version of THUG2 also has a handful of different create modes. Aside from creating skaters and parks, you can also create graphics for stickers, decks, and the like. If you're experienced with the Tony Hawk series, you'll be able to blow through the game's story and classic modes in ten to 12 hours. The online game is largely the same as it was in the previous game, with a few additional modes. Up to eight players can participate in the standard game modes like trick attack, score challenge, combo mambo, slap, king of the hill, capture the flag, firefight, and graffiti. The game's new modes are elimiskate and scavenger hunt. The former works like a knockout race in a driving game, where the player in last place is eliminated at specific intervals until only one player remains. Scavenger hunt has two phases. In the first, each player skates around and drops five coins at different spots in the level. After that, it's up to the players to collect as many coins as possible. The first to collect them all, or the player with the most coins when time expires, is the winner. The online mode hasn't seen many additions this time around, but the modes are still fun. The Xbox and GameCube versions of THUG2 are limited to two-player split-screen games, which are also available on the PC and PS2. This method of play is functional, but the game is really more exciting with a full eight players. THUG2 has a slightly different look from the previous Tony Hawk games. Specifically, the models used in cutscenes have a slightly more exaggerated apperance to them. While they may not look quite as realistic, this over-the-top look makes the characters--Bam Margera, in particular--seem much more expressive and animated than they have in the past. This fits well with the off-the-hook nature of the story mode, which has you going all over the place and busting stuff up in an unrealistic, but satisfying fashion. In the game, the worlds are colorful and unique looking. The skater models look good and animate well, which is unsurprising given that much of the game's animation is recycled from previous games in the series. Despite having a full feature set and widescreen support, the PlayStation 2 version doesn't look as good as the other versions. Distant objects get very blurry in widescreen mode, to the point where you sometimes feel like you're watching a 3D movie without the red and blue glasses on. It also has a pretty sketchy frame rate, a problem that is amplified when you play it in widescreen mode. Conversely, the PC version is the best looking of the lot, but even it has some problems. Some custom skater haircuts simply vanish or pop in and out of view when in cutscenes, for example. The Xbox version looks quite sharp and is only a half-step behind the PC, and the GameCube version also looks decent, but blurry. With those versions lacking the full features of the PC and PS2 releases, they're harder to recommend to multiplatform owners, particularly on the Xbox, where online play is nearly standard. The control difference between versions is less noticeable, but PC players should definitely expect to play this game with a gamepad. With over 50 songs on its soundtrack, THUG2 delivers some great music. The audio in THUG2 is impressive. There's a lot of voice work from various pro skaters in the game, and most of it comes across quite well. The sounds of actual skating haven't changed much, but they still fit well and sound great. The soundtrack is as varied as the previous game's, containing a hefty list of really crazy songs. Have you ever skated to Frank Sinatra tunes? You'll get your chance here, as Old Blue Eyes joins artists like Metallica, The DOC, Ween, Less Than Jake, Violent Femmes, Atmosphere, Ultramagnetic MC's, X, Ministry, Brand Nubian, and, yes, Audio Two, who contribute the classic track, Top Billin'. With over 50 tracks in all and the ability to turn off tracks that don't fit your tastes, you'll probably find a suitable bunch of songs to skate to. All in all, Tony Hawk's Underground 2 is a strong skateboarding game, though if you've remained devoted to the series, you might not be so impressed with its changes. Nevertheless, the gameplay remains fast, fluid, and exciting. The visuals are, for the most part, pretty sharp, and the story mode, though short and devoid of much of the character development that made up most of the previous game's story, is still fun to blast through. So fans of the series will definitely have some good times with THUG2, though you'll probably also come away feeling that THUG2 is merely more of the same. The PC and PlayStation 2 versions get the additional bonus of online play and a face mapping feature that lets you take a picture of yourself and put it onto your created skater. The face mapping works largely as it did in the previous game, though the PlayStation 2 version now has EyeToy support, making it a bit easier to get your face in the game. The trade-off is that you'll usually get better results with a photo from a digital camera. On the PC, you simply must crop a face image down to 128x128 pixels and import it from the game's front end. Every version of THUG2 also has a handful of different create modes. Aside from creating skaters and parks, you can also create graphics for stickers, decks, and the like. If you're experienced with the Tony Hawk series, you'll be able to blow through the game's story and classic modes in ten to 12 hours. The online game is largely the same as it was in the previous game, with a few additional modes. Up to eight players can participate in the standard game modes like trick attack, score challenge, combo mambo, slap, king of the hill, capture the flag, firefight, and graffiti. The game's new modes are elimiskate and scavenger hunt. The former works like a knockout race in a driving game, where the player in last place is eliminated at specific intervals until only one player remains. Scavenger hunt has two phases. In the first, each player skates around and drops five coins at different spots in the level. After that, it's up to the players to collect as many coins as possible. The first to collect them all, or the player with the most coins when time expires, is the winner. The online mode hasn't seen many additions this time around, but the modes are still fun. The Xbox and GameCube versions of THUG2 are limited to two-player split-screen games, which are also available on the PC and PS2. This method of play is functional, but the game is really more exciting with a full eight players. THUG2 has a slightly different look from the previous Tony Hawk games. Specifically, the models used in cutscenes have a slightly more exaggerated apperance to them. While they may not look quite as realistic, this over-the-top look makes the characters--Bam Margera, in particular--seem much more expressive and animated than they have in the past. This fits well with the off-the-hook nature of the story mode, which has you going all over the place and busting stuff up in an unrealistic, but satisfying fashion. In the game, the worlds are colorful and unique looking. The skater models look good and animate well, which is unsurprising given that much of the game's animation is recycled from previous games in the series. Despite having a full feature set and widescreen support, the PlayStation 2 version doesn't look as good as the other versions. Distant objects get very blurry in widescreen mode, to the point where you sometimes feel like you're watching a 3D movie without the red and blue glasses on. It also has a pretty sketchy frame rate, a problem that is amplified when you play it in widescreen mode. Conversely, the PC version is the best looking of the lot, but even it has some problems. Some custom skater haircuts simply vanish or pop in and out of view when in cutscenes, for example. The Xbox version looks quite sharp and is only a half-step behind the PC, and the GameCube version also looks decent, but blurry. With those versions lacking the full features of the PC and PS2 releases, they're harder to recommend to multiplatform owners, particularly on the Xbox, where online play is nearly standard. The control difference between versions is less noticeable, but PC players should definitely expect to play this game with a gamepad. With over 50 songs on its soundtrack, THUG2 delivers some great music. The audio in THUG2 is impressive. There's a lot of voice work from various pro skaters in the game, and most of it comes across quite well. The sounds of actual skating haven't changed much, but they still fit well and sound great. The soundtrack is as varied as the previous game's, containing a hefty list of really crazy songs. Have you ever skated to Frank Sinatra tunes? You'll get your chance here, as Old Blue Eyes joins artists like Metallica, The DOC, Ween, Less Than Jake, Violent Femmes, Atmosphere, Ultramagnetic MC's, X, Ministry, Brand Nubian, and, yes, Audio Two, who contribute the classic track, Top Billin'. With over 50 tracks in all and the ability to turn off tracks that don't fit your tastes, you'll probably find a suitable bunch of songs to skate to. All in all, Tony Hawk's Underground 2 is a strong skateboarding game, though if you've remained devoted to the series, you might not be so impressed with its changes. Nevertheless, the gameplay remains fast, fluid, and exciting. The visuals are, for the most part, pretty sharp, and the story mode, though short and devoid of much of the character development that made up most of the previous game's story, is still fun to blast through. So fans of the series will definitely have some good times with THUG2, though you'll probably also come away feeling that THUG2 is merely more of the same."}