{"ref": "https://www.gamespot.com/reviews/deus-ex-mankind-divided-review/1900-6416497/", "date": "August 19, 2016", "game_name": "Deus Ex: Mankind Divided", "text": "The way I play Deus Ex: Mankind Divided may not be the same way you play it. When I step into the shoes of Adam Jensen, I avoid conflict, drink all the alcohol I find, and stop bad guys from doing terrible things by releasing pheromones into the air and then asking politely. I like to sneak through areas without hurting anyone if possible, and prefer to knock someone out and hide their body if I really need them out of the way. But occasionally, I want to role-play a cyberpunk bad-ass who doesn't take trash from anybody, letting my magnum revolver do the talking when I enter a room. Deus Ex lets me do all these things, and doesn't punish me for solving problems one way over another. The series is characteristically defined by giving you choices--a variety of ways to tackle given situations like armed conflict, social interactions, and branches in storyline. Mankind Divided is no different. There is no wrong way to play, and the game rewards you for achieving things with your personally preferred method, no matter what that may involve.Every obstacle in the cyberpunk world of Mankind Divided has multiple solutions, provided you've invested in certain abilities. For conflict scenarios, there are more than enough tools provided for a direct approach--a variety of lethal and non-lethal guns, grenades and ammo which fire and explode wonderfully, and cybernetic augmentations that can give you temporary buffs like heavy armor or slowing down time. Shooting controls well--it feels effortless to transition from first-person aiming into third-person cover mechanics, change ammo types quickly, and smoothly line up headshots with iron sights. Entering a room while firing a shotgun, then finishing off the last couple of enemies with a lethal takedown feels exceptional.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Deus Ex: Mankind Divided ReviewAlternatively, there are robust stealth mechanics that let you slip quickly and accurately from cover to cover, see enemy sightlines, and let you turn temporarily invisible. If enemies hear or see you they'll transition into a suspicious state where they will attempt to confirm your presence before turning hostile, and this can be used to your advantage. Throwing objects or intentionally making a noise can lure a guard to a particular area, letting you silently take them out or slip past them unnoticed. You can also use hacking skills and have fun taking advantage of the games futuristic setting, turning sentry robots, automated turrets, and the environment against aggressors without drawing attention to Jensen himself.But no matter how you decide to go about solving a problem, there is always a thrill when you succeed, and the game dishes out experience points no matter which actions you take. This means killing enemies is just as satisfying as slipping past them without raising suspicion. Punching through a wall is as fulfilling as stealing a keycard and just using the door. There is no superior way to complete a task.Killing enemies is just as satisfying as slipping past them without raising suspicion. Punching through a wall is as fulfilling as stealing a keycard and just using the door.During investigation scenarios, the direct approach may require you to manually hack into computer terminals in order to procure the information you need, or craft tools to do the hacking for you. If you have the patience though, coercing knowledge out of a citizen or spending time snooping around for clues can also provide what you need. It's refreshing to play a game where different routes can not only be equally successful, but flexible as well. Being an expert in one field doesn't necessarily lock you out of another.Mankind Divided introduces a handful of new augmentation abilities for Jensen on top of those introduced in the previous game, Human Revolution. Some of these new augs are more interesting than others though; Remote Hacking is invaluable for disabling automated obstacles at a distance, and Icarus Dash is a powerful tool for discreet traversal. However the TESLA, PEPS, and Nanoblade abilities achieve similar effects to some of the game's more conventional weapons--they stun and kill enemies from a distance. There are some advantages to using them, but most of the time I wished I had spent points elsewhere.What's interesting about these new abilities is that with their introduction comes with a caveat: to equip them, players must disable one of their other augmentations to avoid putting strain on Jensens predominantly cybernetic body, and risking negative effects. Initially, this ~Overclocking~ system makes for tantalizing dilemmas. The necessity of permanently disabling some skills in order to power others early in the campaign made me stop and seriously think about how I would be handling situations in the future. Not all augments can be disabled (you cant disable your HUD, for instance) but when I decided to enable Remote Hacking, I made the tough decision to disable something seemingly essential--the ability to mark and track enemies.However, as I earned more skill points I decided to experiment, activating multiple new abilities at once without disabling others. The unfortunate revelation was that despite characters and the augmentation menu telling me I was at a critical status and needed to disable more abilities, I experienced no serious detrimental effects that made completing missions any more difficult than usual--a brief radar glitch was the worst I saw. Even more annoyingly, a later plot event re-enabled my once permanently disabled talents. Although being able to unlock and use all abilities in a single playthrough of Deus Ex is near impossible, it was disappointing to see a consequential, weighty choice made inconsequential.Mankind Divided continues with the series' portrayal of a cyberpunk dystopia with a focus on the politics around people with cybernetic implants, and the subsequent implications on the definitions of humanity. The plot involves countless government bodies, corporations, security forces, underground resistances, even the Illuminati--and the events of Mankind Divided frame suspicion on literally every organisation and individual it introduces. This makes it impossible to trust any one character other than Jensen as you search for evidence revealing the motives and masterminds behind a number of terrorist acts. Deciding which organisation to aid and which to deceive during pivotal plot moments is grueling because everything is so unyieldingly grey. The world and attitudes of characters can vary depending on your choices and actions, and even the game's dozen or so side missions take dramatic twists and press you to make difficult decisions--many involve the ethics of hypotheticals our present-day society has yet to encounter--and there are no right answers.It's easy to become completely engrossed in this morally ambiguous chess game, with so many unknown factors lurking beneath the surface. But the lack of a clear antagonist or driving purpose at any one time can lead to temporary disillusionment, with no one enemy ever standing in the metaphorical crosshairs for too long. The upside to this is that Mankind Divided doesn't feature the ill-received boss battles that appeared in Human Revolution, and remains purely as a series of increasingly challenging infiltration and investigation scenarios, all of which can be solved in the manner of your choosing. The pace of the game doesn't feel like one that's defined by a series of climactic acts, but a constant burn of tension and a chase for knowledge as mainline missions, hub exploration, and optional side missions bleed into one another.The world of Deus Ex is an easy one to get completely absorbed in. The city hubs, all based in Prague, are where you'll spend most of your time and are stunningly well-realised. The streets are full of life and bold neon advertising. The futuristic buildings constructed among old-world European architecture and dilapidated housing make the city believable. You'll revisit locations and walk the same routes regularly in Mankind Divided, gaining an intimate knowledge of the streets and structures, and this knowledge is incredibly useful and satisfying to draw upon as new situations arise. One hub, tulek Station, is a stunningly claustrophobic and oppressive multi-level slum, filled with ramshackle apartments and dense marketplaces which made me stop every few feet just to soak it all in. Exploring these environments for information and scavenging for items is also immensely enjoyable. Spaces are filled with character, densely packed with discoveries to make about its inhabitants, and are exceptionally curated with subtlety. You might push unremarkable boxes on a shelf aside to pleasantly discover someone has hidden some rainy day cash behind them. You might look behind someone's couch to find that's where they stash a pistol, just in case. You may notice that despite his constant, over-the-top broody demeanor, Adam Jensen absolutely loves eating colorful, sugary cereal. Additionally, a portion of the games side missions are not explicitly marked, and only found by going out of your way to talk to certain people you may have otherwise run past. Mankind Divided rewards exploration, and its locations are delightful to explore.Mankind Divided rewards exploration, and its locations are delightful to explore.Mankind Divided also includes an asymmetrical online-only competitive mode called Breach. Breach uses the first-person combat, stealth and remote hacking mechanics of Deus Ex in brief, visually abstracted challenge missions with a focus on score-chasing, speedrunning, and beating other players. Augmentation abilities are also present, but Breach uses a slightly modified skill tree, and enforces stricter limitations--the player is able to unlock every upgrade, but they can only equip a limited number before going into each mission.The tone of Breach is very different to the main campaign, with the emphasis not so much on the breadth of options available to you, but taking the path of least resistance. After playing through Adam Jensen's story as a Pacifist, Breach gave me much more license to experiment without consequence--racing around like a maniac, shooting non-human enemies and causing general chaos as I tried to climb the speedrun leaderboard. Breach mode also incorporates a career levelling system, similar to other multiplayer games, where you can earn ~Booster Packs~ containing randomised items like weapons, special ammo, one-time buffs and skill points to aid progress. I found this inclusion to be a little off-putting here, since one of Breach's draw cards for me was its skill-based leaderboards, and your performance can be significantly helped or hindered depending on what random drops you do or don't receive.Although multiplayer-focused, Breach also attempts to tie directly into the Deus Ex universe. As you progress, new conspiracy stories arise and unlocking their details requires you to successfully collect a number of gems in particular missions. These are interesting to take in, but feel out of place within Breach. I would've rather uncovered these dark mysteries in the main game, rather than collecting gems and punching bright neon men in the face in an optional mode. Tonal confusion aside, Breach is still a pleasing way to hone your skills with Deus Ex's action mechanics.Deus Ex: Mankind Divided refines and reinforces the defining foundations of the series. It creates challenging situations and gives players the tools and flexibility to deal with them in a multitude of ways, all within an absorbing cyberpunk world. Although not a significant departure from Human Revolution, Mankind Divided is still a uniquely fulfilling experience, one which feels rare in games today."}