{"ref": "https://www.gamespot.com/reviews/redcard-2003/1900-2872851/", "date": "May 17, 2006", "game_name": "RedCard 20-03", "text": "While Midway has been known for making solid action-oriented sports games, it's easy to see the formula that has run throughout most of its games. From the big-head mode to ~catching on fire,~ Midway's sports games, from NBA Jam to NHL Hitz, all have striking similarities that unify them. With Midway expanding its line to include more types of sports, you'd think that the company would just stick to this formula and keep cranking out the games. It would be easy, for example, to imagine a three-on-three soccer game that essentially played identically to NHL Hitz, only with grass replacing ice and a ball replacing the puck. RedCard Soccer 2003, however, strays from the mold that most of Midway's sports games have used. It still takes the same exciting type of ~no rules~ approach that the previous games have taken, but RedCard resembles the actual sport of soccer far more than, say, a two-on-two basketball game represents actual NBA play. Up front, RedCard is a very simple game. You can jump into friendly exhibition matches, set up multiplayer tournaments, or jump into the game's ~beat every team~ conquest mode. Conquest mode pits you against all the other teams, one nation at a time. Playing through conquest mode unlocks new fantasy teams--including dolphins, a swat team, and samurai--and new arenas. Completing conquest mode also unlocks a world finals mode. Teams are broken up by nation, and a handful of the game's teams contain actual players. While RedCard may look like a fairly ordinary soccer game up front, its stripped-down, relaxed-rules nature makes it incredibly easy to pick up and play. On offense, you have three types of passes, the ability to shoot, and the ability to hop over and juke around defenders. On defense, you have a few different types of attacks that will get the ball away from the opposition. Like in all of Midway's sports games, you have a turbo meter to help you run a little faster and add a little oomph to your offensive and defensive maneuvers. RedCard also has a separate boost meter that can be used for special moves. When it's full, you can use your entire meter to unleash a super goal kick, which comes complete with a slow-motion panning view of the move. Portions of your boost can also be used to pump up your slide tackles and punches. A player hit hard with one of these moves usually stays on the ground for a lot longer than normal. And while you can knock the referee around with your defensive moves, the goalie is, for the most part, totally off-limits. The game doesn't let you just run in, knock the goalie down with a head butt, and score at will. RedCard controls well, with different buttons used for different types of passes and attacks, but having to constantly switch between defensive and offensive controls forces you to play with a certain level of precision. The control scheme in the Xbox version has been updated from the PlayStation 2 original and fixes a few of the game's control problems by moving the shoot functionality to the right analog stick. Since this stick doesn't do anything other than shoot, it solves the problem of hitting the shoot button too early and accidentally sliding away from the ball as a result. However, it's still hard to truly get a sense for when your shot will actually score a goal. Balls that seem like they'd be slow-moving and easy to grab occasionally sail right past the goalkeeper to score, and blisteringly fast shots that seem like they'd burn by the keeper are often caught or deflected. Even your super goal shots aren't entirely invincible, and this too seems almost a little too random. Will the goalie catch the ball and get knocked through the back of the goal, or will he stand his ground, catch the ball, and prevent you from scoring? It sometimes feels more like a dice roll than a skill-based operation. RedCard looks reasonably good and moves at a nice frame rate. The grass textures sometimes look a little odd, and the stadium shadows are distracting and feel artificial. The whole game tends to have a blurry look to it. The player models are pretty nice, and the facial textures used to depict real-life players are well animated. David Beckham, for example, is easily recognizable in replays and other close-ups. The sound effects are well done, particularly the whooshing and missile-launch-style noises used for some of the special shots. Commentary is handled by a two-man British team that delivers fairly standard, dry lines without overemphasis. While this accurately reflects the real-life sport, their repetitive droning becomes quickly tiresome, particularly the constant references to the referee not seeing any of the near-constant rule infractions that are commonplace in the game. Also, the commentary never refers to any players by name. RedCard 2003 is a good start for Midway's newest foray into the world of arcade sports. It goes into slightly more realistic territory without sacrificing the fun, easy-to-learn gameplay that most of Midway's sports games possess. Xbox soccer fans who can't get behind the sim-style offerings from Konami and EA should get a kick out of this one."}