{"ref": "https://www.gamespot.com/reviews/savage-moon-review/1900-6204265/", "date": "February 6, 2009", "game_name": "Savage Moon", "text": "The PlayStation Network game Savage Moon is a good example of how simultaneously addictive and annoying tower-defense games can be. Most of the time, it's fast-paced and challenging, giving you a real sense of achievement as your carefully laid turrets of mass destruction wreak havoc on your insect foes. But like most other games of its ilk, it can also be a frustrating experience in trial and error. Savage Moon won't win any converts to the genre, but it's a mostly fun experience that will stretch your strategy synapses and give you good gaming value. Savage Moon's setting is pure sci-fi schlock. You're charged with defending mining bases on a series of moons, which are mineral-rich asteroids with their own populations of aggressive insect beasties. Wave after wave of these insect aggressors--which range from small, wormlike slitherers to large bees, gigantic crablike tanks, and more--will crawl, stomp, burrow, and wing their way towards your base, and it's up to you to set up a series of defenses to stop them in their tracks. You'll start off with basic machine-gun turrets, but as you earn more money from squashing bugs, you can research and deploy increasingly powerful weapons. Machine-gun turrets are your basic tools of death in Savage Moon. There's a good amount of strategy to be found here, and it's sure to challenge even the most dedicated tower-defense nuts. Each wave of insects gets progressively tougher, so you'll need to make quick decisions about where to best place your turrets, how to create choke points for the enemy, and decide how to best spend your hard-earned credits on researching and upgrading weapons. Savage Moon's weapons varied arsenal includes laser turrets, mortars, mine deployers, particle cannons, and more. There are also support turrets that can make battles easier. For example, chaos towers will slow down any enemy that comes near them, whereas amp towers will significantly increase the range and damage of any turrets. Each turret can also be upgraded several times, but you'll have to spend money on research to get the maximum improvements. Finally, you can give temporary boosts to your attacking strength, defense, or the rate that you earn cash. However, improving one of these will result in poorer performance in the other two, so you'll have to quickly juggle between the three as the situation requires. You won't have much time to relax in Savage Moon, so it's a plus that the game's controls are easy to master. Pressing X on the controller will bring up your main options, and it's a simple matter of scrolling through different menus to choose commands. Navigating the map is bit trickier because the game's camera doesn't let you move past the edge of an area. This means that you'll have to rotate your view if you want to place towers at the edges, a situation that will cost you valuable seconds as you frantically set up defenses for the next wave. It can be quite nerve-wracking as you wait to see if your planning can withstand the next assault, but it's extremely rewarding when a wave of insect scum crashes ineffectively against your defenses. It's also a lot of fun tinkering with the different strategies and weapons available to you, given that most of the maps in the game present their own unique challenges. Where Savage Moon falls down is the amount of trial and error you'll have to go through. Most of the time, you won't have enough resources or towers to cover all angles or create sufficiently strong choke points, so even the best thought-out strategies can be rendered useless when a single wave of enemies decides to go down a completely alternate route from its forerunners. Savage Moon can be a tough game, so depending on your patience threshold, you'll either addictively play levels over and over again until you get the balance right, or just throw your controller against a wall in anger. But what's probably more frustrating is the game's occasionally poor tower AI. Towers will often switch from targeting an almost dead enemy to a healthier one, and they're sometimes slow in locking on to enemies who are within range. You can't cover every angle, so expect to replay levels until you get it right. The game certainly isn't pushing the PlayStation 3's graphical capabilities, and most of the environments on the moons look bland and uninteresting. The insects themselves look decent enough from a distance, but there's not much detail to be found when you zoom in for closer views. The best-looking things in Savage Moon are the towers themselves, which exhibit some cool sci-fi designs. Apart from its single-player campaign--which depending on your skill could take a minimum of five or six hours to complete--Savage Moon features a challenge mode that sees you take on a never-ending wave of enemies to see how long you can survive. There's no multiplayer component, although the game does feature online leaderboards. The game packs in a decent amount of entertainment for its asking price, but thanks to some of its gameplay quirks, it doesn't do quite enough to make it recommendable for anyone who isn't already a fan of the tower-defense genre."}