{"ref": "https://www.gamespot.com/reviews/sam-and-max-episode-6-bright-side-of-the-moon-revi/1900-6169908/", "date": "April 30, 2007", "game_name": "Sam & Max: Save the World", "text": "Bright Side of the Moon is the sixth and final episode of Sam & Max season one, an episodic series of adventure games based on comic-book characters Sam (a dog) and Max (officially known as a ~hyperkinetic rabbity thing~). The team has gotten into some interesting trouble along the way, and this sixth and final episode wraps things up nicely. If you've been playing along over the past five episodes, you're obviously going to want to know how it ends, and, overall, it ends pretty well. And now, the stunning conclusion of...Sam & Max season one. The episodes leading up to this final encounter have all dealt with different forms of hypnosis. Here, in the finale, you're finally clued in as to who the mastermind behind all these world-enslaving schemes is, and you must travel to the moon (in your Desoto, naturally) to stop him. There are plenty of laughs to be found, plenty of returning characters, and the puzzles in this installment are pretty interesting, making this a fitting end to the season-one story arc. The only real negative about this installment is that it feels shorter than some of the others, and it's awfully straightforward. You know who you need to take on right at the beginning of the episode, you take him on (after making a love connection between the disembodied head of an Abe Lincoln statue and the new queen of Canada), and then it's case closed. Of course, if you were to look at this as an individual product, and not a part of something bigger, you would be completely lost. More than the previous episodes, this one requires that you know what's happened up to this point to understand the story and get the most out of the humor. However, this isn't a bad thing per se, because it's just a factor of this being an episodic series. At this point, if you're new to the series, you're better off buying the entire season and playing it start to finish. You'll get a substantial discount by buying the whole season all at once, and you'll get roughly what you'd expect to get out of a proper retail release, though some of the repeated jokes between the earlier episodes and the constant reuse of certain characters and locations might make powering through all six episodes in a row a little less impactful. Regardless of how you take it in, Sam & Max season one has been a successful series up to this point due to its great voice acting, compelling puzzle design, and outstanding sense of humor. Fans of adventure games who may have been wary of the potential pitfalls of episodic releases or the fairly annoying GameTap-first release schedule of the episodes should check this series out, especially now that you know that, yes, this is a complete story once you get to the end of this episode."}