{"ref": "https://www.gamespot.com/reviews/neon-white-review-heavenly-sprint/1900-6417905/", "date": "June 29, 2022", "game_name": "Neon White", "text": "Neon White is a curious amalgamation of Counter-Strike's thrilling surf maps, the time-trial-centric joy of Trackmania, and the anime-infused narrative of a visual novel--all sprinkled with a light dusting of Persona for good measure. It's also a first-person shooter/puzzle-platformer and one of the best games of the year. I've never played anything quite like it, despite being familiar with each of its influences. Not everything coalesces as one might hope, with the story's slow build interrupting the gameplay's rapid pace, but this does little to dampen the sheer, unadulterated glee that comes from traversing each of its 97 immaculately constructed levels.At its most basic, Neon White is essentially a speedrunning first-person shooter. You play as the eponymous Neon White, a sinner from Hell who's given the chance to enter Heaven if he can rid it of a demon infestation. You'll glide, jump, and shoot your way through numerous celestial arenas, all with the end goal of reaching the finish line as quickly as possible--with the caveat that you also have to kill every demon along the way. Most of the levels are over in less than 30 seconds, but it's this confined sprint that proves so tantalizing. Reaching the end of a level is rarely ever difficult but the crux of Neon White lies in figuring out the best route through each one in order to shave off precious seconds and earn better medals and rewards.To aid you in this endeavor is an inspired mechanic called Soul Cards. These finite pickups give you access to a range of weapons that can also be discarded to activate one-off abilities. The Fireball card, for example, functions like a shotgun, letting you shoot a powerful blast that's most effective at close range. If you discard it, however--losing the shotgun in the process--you can perform a directional air dash that obliterates any enemies you phase through. Other Soul Cards include long-range rifles, SMGs, and more, with their abilities giving you additional traversal and offensive options, including a double jump, ground pound, and grappling hook. You can only hold two unique Soul Cards at a time so you're never overpowered, but you can stack up to three of the same type, giving you more ammunition and multiple chances to use these secondary abilities.Neon White does a fantastic job of easing you into its breakneck rhythm as you learn how to switch and ditch Soul Cards on the fly. Early on, you only have to worry about juggling a few at a time, but before long you'll be utilizing the capabilities of up to six throughout a single level. This might sound overwhelming, but it's all remarkably intuitive to the point where you don't even have to think about what your hands are doing. There's a natural progression to the way you gradually learn Neon White's mechanics, too, as the learning curve prompts you to start using Soul Cards in different ways. You might initially discard the assault rifle to launch a grenade and defeat a clump of enemies, but eventually you'll be using that same explosion to also propel yourself into the air and onto another platform, cutting down on your time by wiping out an extra step.This emphasis on blistering speed means that almost any mistake will cost you dearly, whether it's because you mistakenly burned through all of your Soul Cards or mistimed a crucial jump. Thankfully, a tap of the F key on PC restarts the level from the beginning, and each stage's bite-sized nature--not to mention how satisfying they are to burst through--means that starting over never feels deflating.You're incentivized to repeat levels even if you're able to complete a stage on the first try, with bronze, silver, gold, and ace medals to be earned. Every time you beat a level you also accrue Insight for that stage. Each rank of Insight unlocks a different reward, be it a ghost of your best time, a level hint that reveals a shortcut, or a secret gift you can find and then use to progress a side character's story. These gifts are worth searching out since they prove to be enjoyable mini-puzzles of their own. They're usually located in hard-to-reach places that require smart use of your Soul Cards to attain, and the side quests they unlock also introduce some unique challenges, including spike-laden levels filled with booby traps and others where you're unable to use abilities.Neon White's story stumbles at times, but its slick, breakneck action is flawless and elevates it to be one of the year's best games.You don't need to achieve an ace medal on every level to progress, but it's awfully tempting to go for it purely because of the innate thrill these runs conjure. Each stage has a baked-in shortcut that the level hint will reveal to you, allowing you to shave off a substantial amount of time, but this isn't the only way to achieve a faster run. It pays dividends to constantly read the environment and try to find ways to cut corners or use Soul Cards in a more efficient manner. Achieving an ace medal on your first attempt makes you feel like a god, and as the levels become more elaborate, this feeling only intensifies as it demands more fluidity and precision from you. There are also global and friend leaderboards if you want to compete with your fellow sinners to achieve the fastest times. This adds yet more replay value, although trying to keep up with the quickest in the world is a foolhardy endeavor since the global leaderboards are rampant with cheaters--at least on PC.Of course, all of this only works because the controls are incredibly precise and responsive, with Neon White's phenomenal level design also playing a significant role. The striking art style is intentionally minimal, guiding your eyes through enemy placement and dashes of color. While most levels may initially seem quite simple, they're deceptively layered, challenging you to chain together Soul Card abilities with killing blows and nimble platforming as the ground crumbles beneath your feet, enemies train their sights on you, and explosive barrels send you soaring hundreds of feet into the air. In the wrong hands, this would all fall apart, but Neon White's marriage between player movement and level design is so flawless that it never feels anything but magical. Throw in a pulsating soundtrack from experimental music outfit Machine Girl and Neon White's slick and stylish speedrunning becomes a constant pleasure.The only area where this affection falters is in between each mission, when its puzzle-platforming makes way for a visual novel with social sim elements. White is suffering from amnesia, which, as extremely cliched as it is, does provide room for you to build a rapport with the game's various characters as you uncover the mystery surrounding who they are and what they did in their past lives. The voice cast is excellent, headed up by prolific voice actor Steve Blum (Cowboy Bebop, Naruto: Shippuden, Star Wars: Rebels) in the titular role, and their performances bring an earnestness to these characters even when the writing and its obnoxious, self-aware schtick are often cringe-worthy.The story's main issue is that it begins at a snail's pace and is laden with dialogue-heavy scenes early on. This only serves to get in the game's own way as you want nothing more than to jump into the next dozen or so levels. The story eventually picks up steam and introduces some compelling stakes toward the end, but the pacing could've been tightened up earlier. This wouldn't be an issue in most other games, but Neon White's speed is such a crucial component that disrupting its flow feels like a particularly flawed move.Alas, one misstep isn't quite enough to derail what is one of the year's best and most original games. Neon White is flawless from a gameplay perspective and is not only stylish and incredibly satisfying, but a magnetic execution of a fascinating idea. There's nothing else quite like it, and you'd be doing yourself a massive disservice if you don't at least give it a try."}