{"ref": "https://www.gamespot.com/reviews/tom-clancys-ghost-recon-review/1900-2824317/", "date": "November 13, 2001", "game_name": "Tom Clancy's Ghost Recon", "text": "These days, when shooter fans prepare to enter virtual combat, they're more likely to reach for an MP5 submachine gun than some futuristic plasma rifle. Games like SWAT 3 and Operation Flashpoint have offered realistic situations, weapons, and tactics that create deeper alternatives to pure fantasy shooters like Quake III Arena or Unreal Tournament. Of course, if there's a game that's synonymous with the tactical shooter subgenre, it's Rainbow Six or its successor, Rogue Spear. With these games, developer Red Storm set an unprecedented standard for realistic gaming combat. One shot could kill, and stealth and planning were the order of the day. Now Red Storm is back with a new tactical shooter, Tom Clancy's Ghost Recon, which is big news for shooter fans. News on the game itself is mixed, though. Ghost Recon offers some excitingly tense moments, but problems often rear their ugly heads just when the game gets interesting. Ghost Recon puts you in command of a platoon from ~The Ghosts,~ an elite Special Forces unit operating at the vanguard of the US military. Set in the year 2008, Ghost Recon imagines a near future in which ultranationalists have seized power in Russia and begun a campaign of aggression against the former republics of the Soviet Union like the Ukraine, Belarus, and Kazakhstan. With the situation rapidly deteriorating, your team is inserted into hotspots like Georgia and the Baltic states to help bring about stability. It's not a very original premise, but it serves its purpose. The main game consists of a story-driven 15-mission campaign. After you unlock missions in the campaign, you'll be able to play parts of them again in a quick mission mode. Ghost Recon also offers fairly promising co-op and competitive multiplayer modes like last man standing and hostage search and rescue. Before each mission, you'll get a text and audio briefing on your team's goals, as well as a rudimentary map of the mission area. After the briefing, you'll carry out tasks like assaulting enemy camps, rescuing downed pilots from their captors, blowing up bridges, ambushing an enemy tank column, and fighting through a bombed-out town. The missions involve a lot of slow, stealthy movement and scanning of tree lines and buildings for enemy activity. This regularly veers between excitingly tense and rather tedious. When combat ensues, it's usually lighting quick, and casualties on both sides are high. Don't expect extended firefights, but do expect piles of bodies. Prior to each mission, you'll get to assign soldiers with particular specialties like sniping or demolitions to three fireteams to create a balanced force. Each fireteam can include up to three men, but you can only enter a mission with a measly total of six men. Each soldier is rated for weapons skill, stealth, leadership, and endurance (hit points and the ability to carry heavy gear quickly). As soldiers complete missions, they earn extra points that you assign to improve their various abilities. If you complete the special optional mission objectives, you'll get access to specialist characters with higher stats, as well as weapons that are otherwise unavailable, like the advanced OICW assault rifle. Overall, you'll get quite an arsenal of equipment and weapons, including assault rifles (such as the M16/M203), carbines (M4), submachine guns (MP5, MP5SD), light machine guns (M249 SAW), sniper rifles (M24), pistols (M9), hand grenades, and antitank rockets. There are around 22 weapons and items in all, but you won't become some unrealistic walking tank since you can only equip two weapons per soldier at a time. You'll also encounter a number of vehicles, but these only act as window dressing or targets. You can't ride in or drive any vehicles, which is a real shame. Recent games such as Operation Flashpoint and Tribes 2 have shown just how dramatic and tactically interesting that possibility can be. Once in a mission, you'll directly control one soldier at a time while commanding the rest of your squad indirectly. Instead of the elaborate and perhaps overly complicated premission planning of Rainbow Six and Rogue Spear, you give orders to your team members in real time during Ghost Recon's missions. The superlative SWAT 3 arguably perfected this sort of system already. You may find Ghost Recon's command system awkward by comparison. At any time during a mission, you can call up a command interface panel that lists your soldiers and provides a rough map of the mission area with waypoints designating mission objectives. From this panel, you assign movement waypoints and firing arcs for each fireteam and issue their rules of engagement. You can tell your troops to hold position, advance and then hold if fired upon, or advance at all costs. You can order them to shoot on sight, lay down suppressing fire, or avoid firing unless fired upon. Overall, the commands are too limited. Surprisingly and unfortunately, there are no commands to withdraw or take up full cover and concealment when available. Also, you can tell a fireteam to cover a general arc, but you can't instruct them to cover a certain building, bridge, or other specific area. You'll need to move them into the perfect position by hand. You'll find that the poorly detailed map in the command panel isn't as useful as it could be. A good full-sized topographical map would have been more suited to the sort of finely detailed movements necessary to keep your men alive. You really need elevation markings, not just generalized references to clumps of trees. The command interface has other problems. With the game set to high resolutions, everything on the panel appears rather tiny. Also, the panel seems unresponsive--you often need to click things multiple times to get them to work properly. There aren't enough hotkeys to really circumvent the interface panel, and you need to temporarily assume control of a fireteam to give it movement orders, which is very awkward, particularly during a firefight.In fact, the overall game interface has a number of problems. For instance, during a mission, you can access a menu with a save game button but no load button. There are hotkeys for saving and loading, but the load key will only restore your last save, not the particular one you might have wanted. You'll have to quit out of the mission and campaign to load a particular saved game. For that matter, you can't name save files as you choose, which makes finding the right one difficult. These problems may not sound like much, but you'll need to save and restore a lot in Ghost Recon because of its high difficulty. The tactical map doesn't provide as much detail as you'd like. During your missions, you can assume any soldier's role directly at any time. You'll need to do this a lot since sketchy pathfinding and a somewhat buggy command system can split up your fireteams or send them where you didn't mean for them to go. Plus, the stupidity of your men gives the Special Forces a bad name. That's a real problem, given the skilled enemies and tough missions. By default, your men will crouch when reaching a destination instead of adopting a safer, less revealing prone position. They'll bunch up, making good grenade targets. They'll mosey in front of open doors, only to get shot by an enemy inside. They'll walk in front of a friendly machine gunner laying down cover fire and perform other foolhardy acts that will have you tearing your hair out. Get ready for a lot of babysitting. Of course, you can avoid these problems in multiplayer, assuming you can find teammates who know what's going on and understand basic tactics. Real teamwork is happily a must in Ghost Recon. Compared with all the sneaking around, the actual combat in Ghost Recon can be uninvolving or downright frustrating. You'll get a radio message from a nearby fireteam telling you they've come under fire or have lost a man, but you often won't hear a shot. Your men will frequently die before you can switch to their fireteam and control it manually to prevent the slaughter. You'll take fire yourself, with bullets kicking up dirt right next to you, but sometimes all you'll hear are the distant reports of scattered rifles. Good luck finding the shooters before they can kill you. Your HUD threat indicator, which shows the general direction of your enemies, is of only limited use. The recent and excellent Operation Flashpoint similarly moved combat away from the in-your-face style of many shooters by setting it outdoors and often at long ranges. Nevertheless, you still stood a reasonable chance of spotting and eliminating enemies. You usually felt like you were an important part of the action and that your actions made a real difference. In Ghost Recon, that's less frequently the case. Having your troops instantly gunned down by concealed assailants might be realistic, but it simply isn't much fun. Realism only matters in a game if it adds to the entertainment value. Realism is a means, not an end. On the bright side, being able to assume the roles of different soldiers in Ghost Recon during the same mission can add tactical interest, and it lets you try out many different weapons. At the same time, though, it weakens the sense of immersion. Whether you're an element leader in SWAT 3 or a lowly private at the beginning of Operation Flashpoint, those games create a sense of continuity and personal involvement by keeping you in the role of a single central character throughout a mission. Both of those games have a far better sense of drama and storytelling than Ghost Recon. Like much of Ghost Recon, the game's visuals are above average but not incredible. Yellows and greens dominate the color palette, making it look as if you're viewing everything through colored lenses. Still, little details like swaying pine trees, soldiers' hand signals, or the shaggy camouflage ghillie suits of your snipers help create believable scenes, just not really exciting or memorable ones. Oddly, you can't see your own weapons through the game's first-person viewpoint, which is unusual and unfortunate for a shooter. The weapons themselves are obviously a major attraction and focus of the shooter genre, and it's rewarding to witness the power of your firearms up close. Some of Ghost Recon's issues are mitigated in the multiplayer mode. Ghost Recon's audio is solid but not amazing. Most of the weapons sound convincing enough, though they're not in the same class as those of, say, Counter-Strike. They lack that extra visceral punch. Sometimes weapon sounds might suddenly fade out inexplicably, or you might hear a static popping. Ghost Recon takes good advantage of 3D positional audio, though--when a teammate says, ~Right behind you,~ it really sounds like he's right behind you. The soundtrack features noble orchestrations in the style of Hans Zimmer (Crimson Tide, The Rock), though the music isn't used for establishing the mood as much as it could have been. Ghost Recon has some real strengths, but handholding micromanagement, an awkward interface, bugs, and other problems and weaknesses often sap the fun out of the game just when it starts to get entertaining. Ghost Recon's missions draw you in one minute, putting you on the edge of your seat, only to draw you out of the action the next minute with the game's problems. Compared with similar games, Ghost Recon unfortunately doesn't fare as well as it might have. Rogue Spear, SWAT 3, and Operation Flashpoint usually offer more immersive situations, more interesting and better-balanced missions, better storytelling, better teammate AI, or smoother interfaces. Hopefully, the multiplayer modes and possible fan-created mods will bolster Ghost Recon in the long run. As it stands, it's not an exceptional or groundbreaking game, but it's still an above-average tactical shooter worth checking out if you're a hard-core fan of the genre.In fact, the overall game interface has a number of problems. For instance, during a mission, you can access a menu with a save game button but no load button. There are hotkeys for saving and loading, but the load key will only restore your last save, not the particular one you might have wanted. You'll have to quit out of the mission and campaign to load a particular saved game. For that matter, you can't name save files as you choose, which makes finding the right one difficult. These problems may not sound like much, but you'll need to save and restore a lot in Ghost Recon because of its high difficulty. During your missions, you can assume any soldier's role directly at any time. You'll need to do this a lot since sketchy pathfinding and a somewhat buggy command system can split up your fireteams or send them where you didn't mean for them to go. Plus, the stupidity of your men gives the Special Forces a bad name. That's a real problem, given the skilled enemies and tough missions. By default, your men will crouch when reaching a destination instead of adopting a safer, less revealing prone position. They'll bunch up, making good grenade targets. They'll mosey in front of open doors, only to get shot by an enemy inside. They'll walk in front of a friendly machine gunner laying down cover fire and perform other foolhardy acts that will have you tearing your hair out. Get ready for a lot of babysitting. Of course, you can avoid these problems in multiplayer, assuming you can find teammates who know what's going on and understand basic tactics. Real teamwork is happily a must in Ghost Recon. Compared with all the sneaking around, the actual combat in Ghost Recon can be uninvolving or downright frustrating. You'll get a radio message from a nearby fireteam telling you they've come under fire or have lost a man, but you often won't hear a shot. Your men will frequently die before you can switch to their fireteam and control it manually to prevent the slaughter. You'll take fire yourself, with bullets kicking up dirt right next to you, but sometimes all you'll hear are the distant reports of scattered rifles. Good luck finding the shooters before they can kill you. Your HUD threat indicator, which shows the general direction of your enemies, is of only limited use. The recent and excellent Operation Flashpoint similarly moved combat away from the in-your-face style of many shooters by setting it outdoors and often at long ranges. Nevertheless, you still stood a reasonable chance of spotting and eliminating enemies. You usually felt like you were an important part of the action and that your actions made a real difference. In Ghost Recon, that's less frequently the case. Having your troops instantly gunned down by concealed assailants might be realistic, but it simply isn't much fun. Realism only matters in a game if it adds to the entertainment value. Realism is a means, not an end. On the bright side, being able to assume the roles of different soldiers in Ghost Recon during the same mission can add tactical interest, and it lets you try out many different weapons. At the same time, though, it weakens the sense of immersion. Whether you're an element leader in SWAT 3 or a lowly private at the beginning of Operation Flashpoint, those games create a sense of continuity and personal involvement by keeping you in the role of a single central character throughout a mission. Both of those games have a far better sense of drama and storytelling than Ghost Recon. Like much of Ghost Recon, the game's visuals are above average but not incredible. Yellows and greens dominate the color palette, making it look as if you're viewing everything through colored lenses. Still, little details like swaying pine trees, soldiers' hand signals, or the shaggy camouflage ghillie suits of your snipers help create believable scenes, just not really exciting or memorable ones. Oddly, you can't see your own weapons through the game's first-person viewpoint, which is unusual and unfortunate for a shooter. The weapons themselves are obviously a major attraction and focus of the shooter genre, and it's rewarding to witness the power of your firearms up close. Ghost Recon's audio is solid but not amazing. Most of the weapons sound convincing enough, though they're not in the same class as those of, say, Counter-Strike. They lack that extra visceral punch. Sometimes weapon sounds might suddenly fade out inexplicably, or you might hear a static popping. Ghost Recon takes good advantage of 3D positional audio, though--when a teammate says, ~Right behind you,~ it really sounds like he's right behind you. The soundtrack features noble orchestrations in the style of Hans Zimmer (Crimson Tide, The Rock), though the music isn't used for establishing the mood as much as it could have been. Ghost Recon has some real strengths, but handholding micromanagement, an awkward interface, bugs, and other problems and weaknesses often sap the fun out of the game just when it starts to get entertaining. Ghost Recon's missions draw you in one minute, putting you on the edge of your seat, only to draw you out of the action the next minute with the game's problems. Compared with similar games, Ghost Recon unfortunately doesn't fare as well as it might have. Rogue Spear, SWAT 3, and Operation Flashpoint usually offer more immersive situations, more interesting and better-balanced missions, better storytelling, better teammate AI, or smoother interfaces. Hopefully, the multiplayer modes and possible fan-created mods will bolster Ghost Recon in the long run. As it stands, it's not an exceptional or groundbreaking game, but it's still an above-average tactical shooter worth checking out if you're a hard-core fan of the genre."}