{"ref": "https://www.gamespot.com/reviews/need-for-speed-most-wanted-review/1900-6142746/", "date": "January 23, 2006", "game_name": "Need for Speed: Most Wanted (2005)", "text": "As Verizon's V Cast service continues to pick up steam, we're seeing games that don't look like your average mobile game. We're starting to see games that, superficially anyway, look more ~real,~ with behind-the-back 3D perspectives, better graphics and sound, fully polygonal action, that sort of thing. But as mobile games move from 2D to 3D, we're also experiencing some of the same problems that happened when console games made a similar leap back in the '90s. Need for Speed Most Wanted is a perfect example. At a glance, it's hard to believe that you're getting polygonal graphics and multiple channels of sound. But up close, the graphics get in the way of the action more than they help, and the result is a technically impressive but otherwise uninteresting driving game. Need for Speed Most Wanted is impressive, but ultimately unexciting. Most Wanted is loosely based on the PC and console game of the same name. It's a driving game in which you're always trying to get away from the cops. But you're also trying to work your way up through the ranks of the blacklist, which keeps track of all the illegal street racers in town. You'll work your way up by completing races to earn cash and challenging the members of the blacklist in head-to-head events. Other race types include outrun, where you race against a clock and are penalized for crashing into police cars, or for letting them crash into you (which seems a little unfair). Speed camera puts photo-ticket checkpoints along the course, and you need to cross those points traveling as fast as possible in order to end the race with a good average speed. The different race types seem to offer a decent amount of variety, but the gameplay remains the same across all the races. This is because the gameplay is singular and rather plain. Though you can choose to accelerate yourself, it just adds more controls than you'd probably want from a mobile game. However, the alternative--auto-acceleration--sort of makes you feel like you're not even playing. All you do is make occasional course corrections to dodge traffic and make turns. Dodging traffic is made more difficult by the incredibly short draw distance and choppy frame rate, which results in you spending just as much time staring at the tiny onscreen radar as you do staring at the actual action. For sharp turns, you have an E-brake, and if you need a speed boost (and if you've purchased the proper upgrade), you've got nitrous. The cops are almost always on your tail, and if you stop or slow down, they'll catch up and get the chance to bust you, ending the race. This makes crashing into things very detrimental to your success. Few things are as annoying as crashing into something, and then trying to get yourself turned in the proper direction and back on the road again, only to have the five-second bust timer expire and end your race. While no one is expecting supremely realistic car and crash physics from a mobile game just yet, the crashes in Need for Speed Most Wanted look awful. Rear-ending a car seems to send the game into slow motion, and oftentimes both cars take to the air for a second or two. It's also disorienting, which doesn't help with the aforementioned bust timer. Considering the short draw distance and blurry visuals, you'll be crashing a lot more than you'd like. That said, the game still looks impressive for one that's running on an LG VX8100. The sound is technically proficient, but it will also drive you crazy. Most of the sound consists of tinny, screaming engine noise and the constant sound of police sirens. Occasionally you'll hear some cop radio chatter, which causes all other sound effects to halt for a blissful second or two. If you like, you can switch over to music, which will play some of the same licensed tracks that were in the other versions of the game, though they also sound fairly tinny. There's a lot of real digital audio, and it's impressive for that reason, though that doesn't automatically translate into good sound that won't make you insane after a minute or two. Many of the story sequences from the console game are here as shortened videos and screens of text. It's also worth mentioning that, as a V Cast game, Need for Speed is constantly hitting EA's servers to download tracks, info about upgrade parts, short videos, music, and more. This leads to some longer-than-average load times between screens, which isn't really conducive to the sort of quick-hit gameplay you might want from a mobile game. Also, you might want to check your mobile plan to see how much all that downloading will cost you. There's a lot going on in Need for Speed Most Wanted. It's one of the more impressive products to hit mobile phones since, well, the last Need for Speed game, which offers roughly the same experience. But for all of its technical wizardry, the game still has a ton of rough edges that prevent it from being much fun to play. If you're the sort of person who wants something to show off to friends to demonstrate what your handset is capable of, this is worth a look. Just don't shatter the illusion by actually letting them play it."}