{"ref": "https://www.gamespot.com/reviews/untold-legends-the-warriors-code-review/1900-6147091/", "date": "April 4, 2006", "game_name": "Untold Legends: The Warrior's Code", "text": "As the only role-playing game of any kind to come out alongside the US launch of the PlayStation Portable, Untold Legends: Brotherhood of the Blade left those looking for the story-driven, turn-based conventions that largely drive RPGs feeling a bit unsatisfied. It also didn't help that the game was a touch bland, relying on a boilerplate high-fantasy setting and randomly generated dungeons. Untold Legends: The Warrior's Code almost self-consciously addresses much of what plagued Brotherhood of the Blade--random dungeons are gone, the story is more pronounced and forgoes the generic D&D backdrop, and multiplayer has been significantly expanded upon. Does all this make much difference when the core gameplay of exploring dungeons, killing hordes of monsters, and plundering treasure chests still carries a fair amount of tedium? Perhaps--but only for those with an established appreciation for hack-and-slash dungeon crawlers. The art style may be different, but the core gameplay is all too familiar. Perhaps taking a cue from the Final Fantasy series, or more likely realizing that no one cared about what happened in Brotherhood of the Blade, Untold Legends starts anew here with the tale of a kingdom overtaken by a diabolical warlord who uses his army of demons to become emperor. Part of his campaign of seemingly indiscriminate evil includes the extermination of changelings who have refused to join his ranks. As one of these rogue changelings, you decide to fight back, and thus begins your journey. The plot in Brotherhood of the Blade was little more than a thinly veiled excuse to string a series of quests together, which should mean that the more cohesive story in The Warrior's Code is nothing but good news. But while the game is filled with fair-to-middling voice acting for all of the characters you encounter, your chosen character plays the part of the silent hero, and none of the supporting characters really step up to fill the void of characters you care about. With its preponderance of wicked rulers, demonic foes, and ancient sources of unspeakable power, The Warrior's Code would certainly seem to adhere to the same 20-sider-inspired conventions as Brotherhood of the Blade. The Warrior's Code differentiates itself mostly through aesthetics, which give the characters a real overblown, almost anime-inspired look. The music, though, still betrays the game's traditional fantasy roots with a standard-issue orchestral score. There are five different characters that you can choose from when you first start the game, and though they try to distract you with crazy class names like guardian, mercenary, and disciple, they're still just warriors, rangers, and mages, each with the requisite strengths and weaknesses. The game allows for a small measure of character customization, letting you choose skin tone, hair style, and hair color. This may not seem like much, but even when you're looking at your character up-close on the equipment screen, there's not enough detail to really warrant much more. Of course, you'll also be equipping your warrior with a range of weapons and armor, both of which have an immediate effect on appearances. The Warrior's Code makes some adjustments that go beyond the surface. Some are pretty incidental, such as the streamlined inventory system, while others have a significant impact on the overall experience. Most important is your ability to transform into a powerful, nigh-invincible monster for short bursts. Along with all of the gear and gold coins you pilfer from downed foes, you'll also collect a small bit of their essence. Fill your essence meter and a quick tap of the left trigger and the triangle button puts you on the warpath. While the bulk of your combat still boils down to you impatiently tapping on the X button repeatedly, The Warrior's Code at least attempts to mix things up by introducing charge attacks and attacks of opportunity. Charge attacks simply let you hold down the X button to charge up a special meter rather than just jamming on it wildly--the net effect of which is one big, high-percentage attack, rather than a series of smaller ones. Attacks of opportunity have a similar meter-charging mechanic, but they're only available when a foe drops their guard, and then only for a split-second. Like the charge attacks, attacks of opportunity can dish out additional damage, but the problem with both of these mechanics is that you can still just tap wildly on the X button for most of the game, and everything works out. In spite of these mechanical changes, The Warrior's Code falls into the familiar rhythms of the genre almost immediately, though it somehow loses the grim satisfaction of murdering near-endless numbers of enemies. The act of swinging a weapon into an enemy's face should be inherently rewarding, but the animations provide almost no feedback--not such a big deal, really, since the character designs are often too indistinct to really give you a clear idea of what or who you're swinging your poleax into. Online co-op play is one of The Warrior's Code's saving graces. It's almost debatable whether the gameplay changes and the angular new look in The Warrior's Code are really for the better, but one thing it definitely does better than Brotherhood of the Blade is multiplayer, which lets you play with or against other live players, both locally and over the Internet. You and a friend can jump into a co-op match quite easily, and there's a suite of competitive games playable by up to four players, including standard deathmatch, capture the flag, and last-man-standing games, as well as a few team-based variations. The co-op is definitely the main attraction when it comes to the multiplayer, though the competitive modes are a nice addition anyway. As much as The Warrior's Code attempts to right the wrongs of Brotherhood of the Blade, the end result is only marginally more engaging. From far away, it looks like a nice, well-rounded package--five unique character classes to choose from, plenty of loot to collect, a sizable single-player campaign, and support for several flavors of multiplayer action. When you get up close with it, though, the pervasively shallow gameplay and overall monotony are too much to ignore."}