{"ref": "https://www.gamespot.com/reviews/escape-from-monkey-island-review/1900-2779065/", "date": "May 17, 2006", "game_name": "Escape from Monkey Island", "text": "Escape from Monkey Island is an offbeat adventure game that's been ported to the PlayStation 2 from the PC version that was released late last year. It's actually the fourth chapter in the Monkey Island series, which originally debuted on the PC more than 10 years ago. Like all its predecessors, Escape from Monkey Island stars Guybrush Threepwood, a pencil-neck pirate also-ran who's pretty smart but not much to look at. In each installment, his misadventures have culminated in a confrontation with the evil pirate LeChuck, who comes back in each game in some ghastlier form, like something out of a horror movie series. That might sound dangerous, but you can't ever die in Escape from Monkey Island--the challenge consists of figuring out what to do next as you stumble through all kinds of bizarre situations. The game features plenty of great-looking scenery, memorable characters, and funny dialogue. However, it's hampered slightly by some of its more nonsensical puzzles, which can be frustrating to solve, and also because of the barrage of Monkey Island in-jokes found in the game, which won't seem so funny if you haven't played the previous games. Fortunately, these shortcomings shouldn't get too much in the way of your enjoying this amusing, clever game. Escape from Monkey Island begins when Guybrush returns home from a three-month honeymoon at sea with his new wife, Elaine, who happens to be governor of the Tri-Island area, somewhere in the Caribbean. Unfortunately the two of them soon discover that not only has Elaine been declared dead in her absence but also her mansion home is in danger of being torn down. Meanwhile, an arrogant, silver-tongued politician named Charles L. Charles is running for Elaine's ~vacated~ position. Worse yet, an embittered Australian businessman named Ozzie Mandrill is buying up all of the Tri-Island area's best shops and hang-outs, and turning them into gentrified, soulless tourist traps like StarBuccaneers. And in the midst of all this, a terrible artifact known only as the Ultimate Insult threatens to fall into the wrong hands. Apparently Guybrush and Elaine took a little too much time off for their honeymoon. But now that the damage is done, it'll be up to you and Guybrush to help put a stop to all these various evils, even as you discover the sinister connections between them. The game takes place in a series of mostly static, prerendered scenes found throughout the Tri-Island area. You control Guybrush using the Dual Shock 2's left analog stick, and as you maneuver him around each area, he'll automatically look in the direction of anything of interest. You'll see text descriptions of these things at the bottom of the screen, and if several are in the same area, you can switch Guybrush's attention between any of them, using the shoulder buttons by default. You can readily examine these things, and you can also try to use them or pick them up. Guybrush can carry an unlimited number of inventory items, and you can call up his inventory at any time and cycle through the various gadgets and doohickeys he happens to be carrying around at the time, in order to ready whichever one will prove useful at that particular time. You can also combine inventory items in some cases. But in all cases, the solutions to Guybrush's problems tend to be pretty specific. Early in the game, he needs to put a stop to the nefarious efforts of a surly one-man demolition crew and his clunky catapult. The solution to this puzzle comes straight out of a Looney Tunes cartoon and sets the tone for most of the game's absurd but often-funny situations. Some of these are funnier in theory: Later in the game, you'll learn the art of Monkey Kombat, a parody of the gory fighting game Mortal Kombat. Yet unlike the fighting game it's based on, Monkey Kombat requires trial and error more than anything else, along with some keen observation. You might be annoyed to find yourself rummaging for a notepad, trying to decipher this and some of the other more obscure puzzles in the game. Many of the more enjoyable situations in the game involve conversations between Guybrush and other characters. During conversation, you get to choose from any number of available dialogue options to proceed. Some of these are essential to continuing the plot, while others are there to make you laugh but also to help hide the more important ones. You won't necessarily hear all the dialogue the first time through, and since most of the dialogue is well done, there's good incentive to replay the game at least once after you've finished it the first time. The world of Escape from Monkey Island is filled with great characters like Dave, a low-key fellow with an eye patch over not just one but both his eyes, and whose heightened sense of smell happens to be dampened by a common cold when Guybrush runs into him. He's the proprietor of a store that sells prosthetics of all types--not just peg legs! Meanwhile, the Australian Ozzie Mandrill sits haughtily in his home filled with stuffed Australian animals. Examining these yields extremely funny results, and Guybrush can then engage Ozzie in a bout of insult sword fighting--a ridiculous competition that Ozzie dominates, thanks to his foreign accent. Escape from Monkey Island offers up rapid-fire humor, and some of it does fall flat, but there's so much of it that you'll just end up remembering the funnier stuff. It's legitimately good comedy, brought to life by the game's consistently excellent voice acting. Each character's voice is perfectly suited to that character's distinct appearance.As for appearances, Escape from Monkey Island looks great, too. The stylized, colorful graphics found throughout the game maintain the lighthearted theme at all times--the various tropical settings you'll visit are always attractive. It can sometimes be difficult to find all the points at which you can exit or interact with each particular scene, but you'll generally enjoy the exploration. The 3D characters in Escape from Monkey Island are simple and comical-looking, and fit in well with the prerendered backgrounds. Actually, the characters look more polished and blend in more seamlessly on the PlayStation 2 than they do in the original PC version. Throughout the game, an upbeat and well-suited musical score plays softly in the background. Escape from Monkey Island lets you save your progress at pretty much any time. Nevertheless, the pacing of the game is actually quite slow overall, certainly in part because there's little actual action to be found. Instead, you'll spend a lot of time moving Guybrush from place to place, examining the scenery, rummaging through your inventory, and trying to figure out what to do next. Sometimes, the solution won't be remotely obvious--and while the game may provide a few subtle hints, it won't ever give you the precise solution to your problems. The PC version of Escape from Monkey Island shipped with a complete walk-through for the entire game, which you could refer to if you got stuck at any given point. This PlayStation 2 version offers no such amenities (save for a brief walk-through of the first few sequences of the game at the end of the manual), though walk-throughs for Escape from Monkey Island are readily available on the Internet. Needless to say, you might not be inclined to use external help in circumventing the puzzles you'll encounter in the game. However, it's worth pointing out that Escape from Monkey Island is a rather lengthy game regardless of whether its puzzles stump you for long. The best part about the game is seeing all the sights and meeting all the people, so at times, the tougher puzzles can actually get in the way of your enjoyment of the game. These occasions may be exacerbated by the game's small but noticeable loading times in between scenes. You'll find that these loading times make the entire pacing of the game a little more uneven than you'd like it to be. Furthermore, the audio quality in the game can be inconsistent at times; some of the dialogue will seem too quiet, and you might notice abrupt differences in the audio levels even from line to line during dialogue. Besides that, the game's frame rate can drop slightly in scenes featuring multiple characters. The few technical issues and other shortcomings to be found in Escape from Monkey Island are worth pointing out but aren't worth dwelling on, because the game's great sense of humor and unique style ultimately deserve all the attention. The fact is Escape from Monkey Island is an excellent port of one of the best PC adventure games in the last several years. Granted, adventure games aren't nearly as popular on the PC as they used to be, but the on the other hand, a game like Escape from Monkey Island seems much more at home on a console. It loses nothing in translation, and its graphics fare even better on the PlayStation 2, and though Escape from Monkey Island will be funnier to those who are already familiar with the series, you'll find that its sense of humor is almost instantly infectious regardless. It's one of the more unusual games available to date for the PlayStation 2, and its warm, tropical environments and great cast of characters will make you feel right at home right away.As for appearances, Escape from Monkey Island looks great, too. The stylized, colorful graphics found throughout the game maintain the lighthearted theme at all times--the various tropical settings you'll visit are always attractive. It can sometimes be difficult to find all the points at which you can exit or interact with each particular scene, but you'll generally enjoy the exploration. The 3D characters in Escape from Monkey Island are simple and comical-looking, and fit in well with the prerendered backgrounds. Actually, the characters look more polished and blend in more seamlessly on the PlayStation 2 than they do in the original PC version. Throughout the game, an upbeat and well-suited musical score plays softly in the background. Escape from Monkey Island lets you save your progress at pretty much any time. Nevertheless, the pacing of the game is actually quite slow overall, certainly in part because there's little actual action to be found. Instead, you'll spend a lot of time moving Guybrush from place to place, examining the scenery, rummaging through your inventory, and trying to figure out what to do next. Sometimes, the solution won't be remotely obvious--and while the game may provide a few subtle hints, it won't ever give you the precise solution to your problems. The PC version of Escape from Monkey Island shipped with a complete walk-through for the entire game, which you could refer to if you got stuck at any given point. This PlayStation 2 version offers no such amenities (save for a brief walk-through of the first few sequences of the game at the end of the manual), though walk-throughs for Escape from Monkey Island are readily available on the Internet. Needless to say, you might not be inclined to use external help in circumventing the puzzles you'll encounter in the game. However, it's worth pointing out that Escape from Monkey Island is a rather lengthy game regardless of whether its puzzles stump you for long. The best part about the game is seeing all the sights and meeting all the people, so at times, the tougher puzzles can actually get in the way of your enjoyment of the game. These occasions may be exacerbated by the game's small but noticeable loading times in between scenes. You'll find that these loading times make the entire pacing of the game a little more uneven than you'd like it to be. Furthermore, the audio quality in the game can be inconsistent at times; some of the dialogue will seem too quiet, and you might notice abrupt differences in the audio levels even from line to line during dialogue. Besides that, the game's frame rate can drop slightly in scenes featuring multiple characters. The few technical issues and other shortcomings to be found in Escape from Monkey Island are worth pointing out but aren't worth dwelling on, because the game's great sense of humor and unique style ultimately deserve all the attention. The fact is Escape from Monkey Island is an excellent port of one of the best PC adventure games in the last several years. Granted, adventure games aren't nearly as popular on the PC as they used to be, but the on the other hand, a game like Escape from Monkey Island seems much more at home on a console. It loses nothing in translation, and its graphics fare even better on the PlayStation 2, and though Escape from Monkey Island will be funnier to those who are already familiar with the series, you'll find that its sense of humor is almost instantly infectious regardless. It's one of the more unusual games available to date for the PlayStation 2, and its warm, tropical environments and great cast of characters will make you feel right at home right away."}