{"ref": "https://www.gamespot.com/reviews/pinball-hall-of-fame-review/1900-6114606/", "date": "December 7, 2004", "game_name": "Pinball Hall of Fame: The Gottlieb Collection", "text": "Despite the fact that a new company has risen to release all-new pinball machines, by and large, the pinball industry collapsed, along with arcades, a few years back. While you can still find machines in some out-of-the-way locations, it's getting harder and harder to see a fully functional pinball machine in its natural habitat. Over the years, this has given rise to a variety of video-based pinball simulations that tried to accurately mimic the ball physics and general gameplay of the real deal. Some, such as Crave's recently released Pinball Hall of Fame, even attempt to emulate actual pinball machines. With eight tables from several different decades, and good gameplay to boot, Pinball Hall of Fame represents a nice budget-priced collection. Pinball Hall of Fame features tables from several decades of pinball history. Pinball Hall of Fame brings together eight games manufactured by Gottlieb, a company that made a ton of classic pinball machines throughout history. The games come from different eras, which sort of let you see how pinball evolved over the years. You've got an old, flipperless machine in Play-Boy (1932), a great late-'70s wide-body table like Genie (1979), and so on. The collection makes its way up to 1993's Teed-Off, a golf-themed game with a Caddyshack complex. If you spent your formative, early-'80s years in a decent arcade, chances are you'll remember at least one of the tables on offer. Even if you don't, the tables are laid-out well, and unless your only acceptable idea of pinball is the amazing over-the-top designs that companies like Midway put out in the mid- to late-'90s, you'll find a lot to like here. When it comes to rendering a pinball machine on a PC or console, there are a few key things that absolutely must be done and done well. Ball physics, obviously, are key. In this area, Pinball Hall of Fame does a good job at rendering a realistically moving ball. You'll do most of your ball moving with the flippers, though you can also nudge the table around with the left analog stick. While the ball moves realistically, you don't have quite as much control over nudging as you'd like, which results in the loss of a lot of balls to tilts...until you just give up on nudging entirely. More-refined nudge control would have been nice here, though to be fair, this is something that very few, if any, pinball simulators get right. The other key feature that a pinball table needs to have is a good angle to view the action from, and Hall of Fame gives you six different angles to choose from. Most of them are a little too close to the action, but each looks nice. However, the sixth angle gives you a full view of the table that works just perfectly. Pinball Hall of Fame also contains a series of unlockable items and options that are earned by completing specific goals on each of the game's tables. Some of these let you turn off tilt, play with a custom-colored ball, or even gain access to quirky little arcade throwbacks, like a love tester machine or a Xolten fortune teller machine (similar to the Zoltan machine that Tom Hanks used to grow bigger in Big). On the Xbox, the game also adds a level of depth by offering online scoreboards for each table. Since pinball machines are all about getting the highest score, it's good to be able to see how your score stacks up. The PlayStation 2 version will save scores locally, but it lacks an online scoring feature. It also lacks progressive scan support and has slightly longer load times than its Xbox counterpart. Online scoring gives the Xbox version of the game a slight edge over its PS2 counterpart. The game's sound attempts to re-create how a table would sound in an actual arcade setting. So you get a lot of background noise (some of it taken from arcade offerings like Galaga and Joust) thrown in with the table's sound effects, which are played back in a slightly distant way. This is sort of neat, but being able to isolate the table's sound effects and turn off the background noise would have been a good option to have. The game also has an announcer who reads off brief historical and instructional information about each table, which is a nice, helpful inclusion. Overall, Pinball Hall of Fame offers a fine collection of classic pinball machines. It looks good, controls well, sells at a budget price, and should be a no-brainer as an addition to your library if you're a fan of simulated pinball."}