{"ref": "https://www.gamespot.com/reviews/batman-arkham-vr-review/1900-6416531/", "date": "October 5, 2016", "game_name": "Batman: Arkham VR", "text": "Batman: Arkham VR is short, its gameplay is rudimentary, and its story retreads old ground. But it also has moments that--for fans of the Dark Knight--are the ultimate expression of wish fulfillment.Like many, I have a personal connection to Batman. My childhood was spent watching him on screens and reading him on pages. In my young adult years, channeling a Bruce Wayne state of mind helped me overcome a number of health issues. So when Arkham VR placed me into the living room of Wayne Manor, lowered me into its stately bowels, and dropped me into the Batcave, the sense of being fully immersed in a world I know so intimately stirred emotions within me like no other game has.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Batman: Arkham VR - Video ReviewThis immersion in Gotham City is Batman: Arkham VR's biggest strength, but at the same time, it's impossible to ignore how shallow my interactions with the world were. The hour or so it takes to finish the game is made up of the kind of perfunctory motion-controlled gameplay seen in early Wii games. Using the PlayStation Move controllers, I poked at buttons to boot computers, flicked Batarangs at switches, and shot the Grapnel Gun to pull in items. It's agency at its most elementary.The two most significant gameplay sections involve investigating a crime scene and conducting an autopsy. The crime scene investigation plays out much like it did in Batman: Arkham Origins, with players scrubbing backwards and forwards through an augmented reality reenactment of the crime to piece together the events.To unravel what transpired, Batman uses an evidence scanner, which you physically pull out from your utility belt. The device is used like a flashlight to locate and scan key pieces of information that push the investigation forward. Similarly, the autopsy section uses the evidence scanner's deep tissue and skeletal x-ray functions to locate specific items buried within corpses.It's all simple and, with hindsight, disposable. But those interactions aren't what Batman: Arkham VR is about, and that's not what stuck with me about it. It's the emotionally charged moments in between that left a lasting impression. The ones that leveraged my enduring love of the character and my familiarity with the world, but placed me at the heart of it.There's the bit where I lowered the Cowl over my face, then looked in a mirror and saw Batman staring back at me. It was a moment that gave me pause and, despite knowing I'm a grown man standing in a dark room with an absurd looking virtual reality headset strapped to my face, I believed I was Batman. For a minute, I was transported into Gotham City, and I was its greatest hero.I was totally enveloped in the world, and in those moments the shallow mechanics didn't matter.As I was lowered deeper underground, the metallic elevator gave way to a vast cavern. Bats fluttered through the air, their screeches just barely piercing through the sound of a crashing waterfall. To my left was the T-Rex statue from my adventure on Dinosaur Island. On the right was the giant penny that marks my tussle with the Penny Plunderer. I was in the Batcave, and it was overwhelming. I had seen this place countless times over my lifetime, but never like this. Never from this perspective.In the Batcave's garage, I summoned the Batmobile and it emerged on a platform, stopping right in front of my face. I could finally see what the Joker, Two-Face, and the many thugs in Gotham saw whenever Batman rocketed through the streets in pursuit of villainy. And at the touch of a button it transformed from the nimble Pursuit mode into the tank-like Battle mode. It was majestic, imposing, powerful.Arkham VR also let me get up close with heroes and villains that I'd only seen in flat planes up until that point. I could see every detail in Nightwing's chiseled jaw and his ripped gymnast's physique, or the gruesome appearance of villains that shan't be named. In the alley I was dipping into the scene, leaning around corners and over ledges, carefully scouring the environment and soaking up that grimy Gotham City atmosphere that I'd read so much about. I stared up into the sky at the iconic Batman symbol projected onto the clouds. And it made me smile.Batman: Arkham VR is barely a game. Of all the launch titles for PlayStation VR, it's likely to be the least mechanically driven, but that doesn't mean it has no value. While playing it, I was totally enveloped in the world, and in those moments the shallow mechanics didn't matter to me. I appreciate that this is a very subjective emotional response based on my lifelong obsession with the character, but it's also a glimpse into one of the greatest promises of VR: Its ability to transport us into alien worlds and blur the lines between what is real and what isn't. To give us the opportunity to sideline our real selves and absolutely inhabit characters we've dreamed of being since childhood."}