{"ref": "https://www.gamespot.com/reviews/league-of-legends-retail-launch-review/1900-6239387/", "date": "October 17, 2013", "game_name": "League of Legends", "text": "Have you ever had the feeling that you paid good money for a game that's still in the beta-testing stage? As of this writing, if you buy the $29.99 retail edition of League of Legends: Clash of Fates, you are paying for features that you receive not now, but later. For now, what you get in the retail box is exactly the same as the freely downloadable version, which is a sparse package. Yet you shouldn't dismiss League of Legends outright, for while it clearly appeared on store shelves before it should have, you'll still get enjoyment from this fast-paced strategy game. If you've played the immensely popular Warcraft III modification Defense of the Ancients, you'll already have a basic understanding of what League of Legends offers: an addictive team-based experience that never plays the same way twice. It's a good thing matches are a total blast, given the number of not-yet-implemented features. Developer Riot Games promises these features are coming, but for now, be aware that what you're paying for is highly entertaining but not yet a complete game. League of Legends is easy to learn, though this isn't to say that newcomers will immediately grasp every nuance. At the start of each match, you choose a champion, join a team of up to five players, and set out to destroy the opposing team's central structure, which is called the nexus. However, your real-life foes are not the only obstacle to becoming a true legend: The routes that lead to the enemy's nexus are defended by powerful turrets that are quick to dispatch you if you let your guard down for even a moment. This is where minions come in. A stream of AI-controlled units is frequently released from your base, and by assisting their charge down their predetermined lanes, you can more easily take down the towers--and players--that stand in your way. The click-heavy, Diablo-esque gameplay is simple enough, but the subtleties take time to master. You'll need to learn how to use minions to your advantage, when to push the lane (that is, aggressively charge forward) and when to pull back, and how to best utilize the strengths and weaknesses of your chosen champion. Matches are tense and exciting because there is little to no downtime. The action is quick to get started and the opposition isn't about to let up, so be ready to give each match your full focus. Successfully fending off an attack means more than just frantically clicking on your enemies. Your champion levels up during the match, and in turn, you earn and improve your four primary skills (you also have a fifth passive ability). These skills determine the role your chosen champion plays during the match. Corki, a mustachioed gnome that flits about in a gyrocopter, is good for crowd control, enhancing his ranged fire with additional machine-gun rounds and area-of-effect attacks. Annie is a creepy little girl who flings fireballs at targets and summons her pet bear to assist in battle. While champions don't have the varied skill trees featured in Demigod, a similar Defense of the Ancients-inspired game, the large number of characters offers more general diversity, and almost all of them are great fun to play. Further diversity comes from the in-game item store, where you can spend gold you earn during the match on equipment and consumables that improve your health regeneration, enhance damage resistance, improve your speed, and much more. If you're confused by the number of items available, don't worry: The game offers smart suggestions based on the champion you choose. League of Legends is a multiplayer-focused game. You can practice offline, but even new players aren't apt to be challenged by the pushover AI, which comes in only two difficulty levels: noob and easy. You'll want to join online games as soon as you can, and the matchmaking option lets you find other players who are theoretically around your level of ability. Yet even during your initial games, you're likely to face experienced players who are familiar with the formula's subtleties and are not afraid of vocalizing displeasure with a teammate's performance in--er--profane ways. Thankfully, if you've never tasted this particular game recipe, a tutorial level will introduce you to the basics, including one of League of Legends' unique additions: brush. You can hide in brush to conceal yourself from enemies, and good teams will use it to set up effective ambushes. Like Demigod, League of Legends does not feature any kind of single-player campaign, but online play is buttery smooth and finding a match is quick and easy. League of Legends' core gameplay is an excellent take on a formula that's growing in popularity. However, the retail product is not a good value--at least, not yet. The game is freely downloadable, and a player store (not to be confused with the in-match item store) is set to go live later this month. At the store, you will be able to purchase champions and champion skins, as well as runes, which can be slotted in a rune book to further enhance your battle potency. The retail box includes 20 champions unlocked from the start, four runes, and $10 in store credit--$10 that you can't yet spend. Right now, the lack of a store means that the rune book is unusable, and because all 40 champions are temporarily available for the initial launch period, the value of the retail box is based around future features, which is a questionable and confusing pricing strategy. Much of League of Legends' value, in theory, will stem from the so-called ~metagame.~ Players, known as summoners, will level up and earn points to spend in the player store (again, features not to be confused with the leveling and purchasing performed during matches). The value this metagame will offer, however, is unknown. Due to the store's absence, the only metagame benefits to leveling up are points that can be spent on masteries, which are universal branching perks similar to talent trees in online role-playing games. In other words, if you buy League of Legends now, you're buying a game that is effectively still in beta testing. The slim selection of maps further makes League of Legends feel stripped down. While the map selection screen makes it clear that more arenas are planned, there are currently only two maps on which to play, though one of them comes in two varieties--summer and winter. The other arena is still labeled as a beta map, and is not available in matchmaking play, only in offline and hosted matches. At least Defense of the Ancients refugees will feel at home on those few maps, which are obviously inspired by Warcraft III's colorful art design. League of Legends is a good-looking game, not because it pushes the capabilities of modern graphics cards, but because its vivid color palette and stylized environments jump right off the screen. Exaggerated animations give champions a lot of personality, while spell effects are vibrant without being distracting. Most importantly, the game runs smoothly and maintains a consistently high frame rate. The cartoonish look is further enhanced by hammy--and only occasionally annoying--champion quips, along with fitting sound effects and music cues. In its current form, League of Legends' patchwork of features has yet to be stitched into a finished product. The clear focus and passion of the development team have instilled a lot of faith within the game's dedicated community, but in this case, promises come with a price tag. Taken on its own terms, League of Legends is a rousing and addictive skeleton of a game that isn't yet ready for prime time. Editor's Note: The preceding review is based exclusively on the League of Legends ~Collector's Pack~ being sold at retail. A free version of the game can be downloaded from the official League of Legends Website."}