{"ref": "https://www.gamespot.com/reviews/resident-evil-outbreak-review/1900-6092941/", "date": "April 5, 2004", "game_name": "Resident Evil Outbreak", "text": "When Capcom first began making indications over two years ago that an online Resident Evil was in development, fans began to speculate about the potential for the game, envisioning a vast Raccoon City overrun by zombies in which many players could work together to escape the shambling menace. Now Capcom's efforts have come to fruition in Resident Evil Outbreak, and the result is something less than the initial concept may have suggested. At its heart, Outbreak is more or less your typical Resident Evil offering, presented in an episodic style that's uncharacteristic of the series and with four-player online support shoehorned into the standard RE format. It can be a fun experience--online and off--for diehard fans of the series, but the trite conventions and clumsy gameplay will probably turn off the average player. Outbreak takes the standard Resident Evil formula online, with varying degrees of success. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Resident Evil Outbreak Video Review Past Resident Evil games have been quite plot-heavy, creating a continuous (if sometimes confusing) story arc over the course of the series. To facilitate the relatively short play sessions required for online play, Outbreak doesn't have one linear narrative--instead, it's broken up into five stand-alone vignettes that proceed in sequence but otherwise aren't really related. You'll start out in J's Bar during the initial zombie attack, and later you'll visit other locations such as an Umbrella Corp. research facility, an overrun hospital, and a burning hotel. There are little snippets of plot in these levels, but nothing you'll manage to care about--so if you like the cohesive and mysterious stories from past games, you might be disappointed here. Outbreak also breaks from tradition with its characters. In each scenario, you can choose one of eight ordinary citizens of Raccoon City, all of whom have some unique feature that you can exploit during the game. For instance, police officer Kevin starts out with a handgun already in his inventory; David, the plumber, has a repair kit that can be used to fix broken items; Alyssa, a newspaper reporter, can pick some locks; and student Yoko has a backpack that doubles her inventory size. These and other unique abilities make all of the characters worth checking out, as there are some areas that only specific characters can access. You'll probably settle on your favorite pretty quickly, however. Putting aside the addition of three other players into the mix, Resident Evil Outbreak plays like every other game you've played in the series. You run around various rooms, solving puzzles to allow you to escape to the next area while trying to fend off monster attacks and simply stay alive. The classic items from previous games are all here, such as the healing herb and health spray, handguns, and so on. In addition, there are more environmental objects that can be used as weapons, like metal pipes. The five scenarios feature a decent mixture of combat and puzzle-solving, the latter of which usually boils down to finding the right item and taking it to the right location so you can proceed. There are a couple of differences between previous RE games and Outbreak, though. Since there are potentially other people playing, the game keeps rolling no matter what you stop to do (even in the offline version), so it can be annoyingly hard to equip a new weapon, use a healing item, or read through a file for a puzzle clue or passcode while zombies are constantly advancing on you. On the upside, you're no longer bound to the archaic tank-style controls that have plagued the series for years. Now, thankfully, you can simply press the left analog stick in a direction and have your character move that way, which makes the game a little less frustrating to play than it might have been. Then again, there's enough frustration to deal with in other areas. Offline, your allies are controlled by an artificial intelligence that's pretty good at keeping them alive but doesn't always do the most sensible things. For instance, your friends can help you out by doing things like pulling you up when you're hanging on a ledge, but sometimes they just won't see fit to do so. Your allies also inexplicably run off on their own at times, only to reappear later in the level (well after you could have used their help). When they do stick by you, your AI compatriots are reasonably good at helping you shoot monsters, but they don't always make the best decisions otherwise. When you're playing online, your teammates are controlled by real human players that are (hopefully) more intelligent than the AI, but that doesn't mean the party will necessarily stick together or work as a team. Excepting any player ineptitude, the biggest reason for this is the horribly limited communication system in the game. There's no voice chat via headset; there's not even support for a keyboard in-game. You're limited to only a handful of canned phrases, such as ~yes,~ ~no,~ ~thank you,~ ~help me,~ and ~that way,~ that can be accessed by hitting various directions on the right stick. There's also an ~ad lib~ button that will make your character spit out a random phrase that's supposedly contextual to the situation, but these comments are more often laughably nonsensical. Outbreak's barebones approach to communication prevents you from discussing actual puzzle-solving with other players, so if you don't already know what to do in a given scenario, the game can degenerate into every player confusedly running off on his or her own and consequently getting eaten. The lack of communication options really hinders the flow of the online play. Outbreak might be a clumsy gameplay experience, but at least it's pretty to look at. The game's real-time environments have a really impressive amount of detail, with lots of little touches all over the place that make the many rooms look distinct and lifelike. The models, especially those of the playable characters, feature a similarly high level of detail and smoothness, and they all animate pretty nicely. All of this graphical splendor comes at a price, though--the load times can be annoyingly long, even when you're just moving from one room to the next. Thankfully, the game can be installed to the recently released PS2 hard drive, which shortens the loading considerably. Since the backgrounds are all rendered on the fly, the camera angle moves according to your position in the environment, and it's usually at a decent angle to let you see what's going on. However, sometimes it'll be too hard to figure out what kind of enemies are approaching, so a first-person look feature would have been helpful. The game generally sounds as good as you'd expect from Resident Evil--the voice acting is as campy as ever, and the stock sound effects are decent enough (and pretty familiar at this point). The understated music mostly does a good job of establishing a creepy atmosphere, too. If you love Resident Evil to death and think the idea of playing it with other people is a good one, you'll probably dive right into Outbreak without hesitation. That kind of unmitigated love is probably required for you to overlook the awkwardness and rote similarity to past games; however, if you weren't sold on RE before, you definitely won't be when you play it online. Despite only having five levels, the game does have a decent amount of replay value--the scenarios can differ a lot depending on your character choice, and there are a ton of CG movies, still pictures, sound effects, music tracks, and silly alternate costumes that you can unlock if you have the patience. Outbreak doesn't really live up to its potential, but it's a pretty good game for members of its already-established audience."}