{"ref": "https://www.gamespot.com/reviews/space-hulk-ascension-edition-review/1900-6415967/", "date": "November 18, 2014", "game_name": "Space Hulk Ascension", "text": "Space Hulk: Ascension gets it right. Developer Full Control Studios dropped the storm bolter last year in its first shot at adapting this Games Workshop board game classic, sticking too closely to the formula of the 1989 original. The designers have loosened their collars this time around. While they respect the intense Space Marine-versus-Alien duel at the heart of the original experience, more of the Warhammer 40,000 universe has been tossed into the mix, along with many new features that bridge the gap between the old board game and contemporary turn-based strategy gaming. There are still some lingering issues with the insanely punishing difficulty, and some quirks with the visuals and the interface. But this is still a much improved take on Space Hulk that, oddly enough, feels truer to the original game even as it moves farther away from it.Subtlety is the shared characteristic of the changes and additions. Space Hulk: Ascension doesn't mess with the core elements of what made the tabletop game a cult hit. You take charge of squads of Space Marine Terminators, hulking genetic monstrosities in power armor that lead the way in the battle against aliens and heretics in the grim Warhammer 40,000 future, where there is only war and the laughter of thirsting gods. You get a thin slice of the brutality on offer in the greater world of Warhammer 40K miniature wargaming and fiction, guiding small groups of these fanatical warriors as they invade space hulks, which are wandering starships filled with alien Tyranid Genestealers that pose a threat to the Imperium of Man. There is a lot of backstory here, but all you need to know is that you must shoot, smash, and burn alien monsters that infest the shadowy corridors of spaceships. Everything is handled with a traditional turn-based interface. Your Space Marines consume action points with every action, from firing storm bolter pistols and flamers, to going into overwatch to guard against enemy movement, to simply turning around in their big suits of power armor. Matches are slow, in that you have to constantly watch your flanks, guard enemy spawn points, keep an eye on ventilation ducts where Genestealers lurk, and so forth. All missions take place in the cramped confines of space hulks, ancient wrecks loaded with corridors so narrow that Space Marines have to proceed through them in single-file formation. Genestealers turn into blurs of teeth and claws up close, so positioning is vital unless you want to be turned into hamburger.This sounds a lot like last year's Space Hulk. But once you get beyond these basics, Space Hulk: Ascension becomes a significantly different and better game. For starters, the game now features three Space Marine chapters, with the famous Ultramarines and Space Wolves joining the Blood Angels from the original game (the Space Wolves were also available as DLC for the first game). Both bring added Warhammer 40K atmosphere, along with some variations in gameplay, as the Ultramarines specialize in ranged combat and the Space Wolves in melee, while the Blood Angels are jacks-of-all-trades. The differences involve just a couple of unique weapons and a minimal difference in attacks, but the armor of each chapter is distinctive, giving matches a different flavor that is already a huge bonus to anyone who has been painting miniatures of these guys for years.Space Hulk: Ascension doesn't mess with the core elements of what made the tabletop game a cult hit.There are also three full campaigns (expect to play each for at least five or six hours), each with storylines tailored to the Space Marine chapters. (Unfortunately, multiplayer has been removed.) With the Ultramarines, you defend their homeworld of Macragge, while the Space Wolves deal with the fate of a long-lost pack, and the Blood Angels get the chance to redeem themselves yet again. There isn't a great deal of story here, with no voice-overs or cutscenes to set the scene and tell the tale. But the campaigns do feature branched missions where one assignment rolls into another, which provides some illusion that you're waging an ongoing war to destroy a space hulk instead of taking on barely connected battles. You are also given some choice when it comes to accepting missions, and are hit with optional one-off jobs taking on hordes of Genestealers. These events serve to extend the campaigns, although they also provide a changed focus in that they set up tactical free-for-alls instead of the goal-oriented (steal information, ~cleanse~ a corrupted Space Marine brother, set explosives, etc.) story missions.Missions see you facing new and varied types of Genestealers now, with different types of armor and claws, feeder tendrils that allow brains to be gobbled up handily, and flesh hooks that can yank a marine in close for some tender loving crushing. Marines come in different varieties, too, with sergeants, melee and range specialists, heavy troops with flamers and cannons, and psychic librarians all joining the fray. Attack options that allow for aimed shots, suppression fire, and so forth have also been added, and up the ante during tactical combat.Space Marines now also gain experience and level up. You can gain points that are applied to attributes such as ballistic skill, agility, and perception. New levels unlock access to weapons like the power sword, thunder hammer, and lightning claws, equipment and skill slots, and specialized skills that boost everything from your shooting accuracy to weapon heat management to overwatch ability. This system should be familiar to anyone who has played a turn-based squad game on the PC over the past two decades. Still, these frills nicely expand the core Space Hulk gameplay, giving you more strategic options when building your army while simultaneously helping you form a bond with troops that become better with each passing mission.Or so the theory goes, anyhow. The blessing and the curse of Space Hulk: Ascension is that you have very little margin for error due to your small five-man squads, limited ammo, the proliferation of Genestealer spawn points, and other factors. Having the deck so stacked against you makes the game very exciting and tense, but also a bit maddening as losses are generally high, even on the missions where you emerge victorious. This has a real impact on character progression, as you of course have to keep your people alive for a mission or three for this feature to really matter. The lone redeeming feature is saving, as you can save progress in mid-mission and replay whenever you lose one of your top marines. Still, it's hard to keep up with casualties. Trying to be perfect, or even close to it, requires so many continual reloads that single missions can easily turn into multi-hour marathons.The overall look and feel of the game has been much improved over its predecessor. Audiovisual quality has been boosted with improved Space Marine models, sharper and spookier-looking space hulk corridors, and a moody musical score. Problems that plagued the last game, such as unskippable animations, have also been removed. The one sore point, however, is that the game is now a little too dark. Where the first game was bright and colorful, like the tiles and painted miniatures of the board game, this second take adds in the fog of war and removes the top-down strategic map. Even in revealed areas, maps are now so shadowy and murky that it can be hard to identify doors, ventilation shafts, Genestealer spawn points, and even game icons like the green eye indicating that a marine is in overwatch. This adds to the atmosphere and tension, as you now don't know what awaits you. But it also increases the frustration factor and forces you to play with the camera and gamma settings.Having the deck so stacked against you makes the game very exciting and tense, but also a bit maddening as losses are generally high.The interface has also been overhauled with a radial menu for available orders that pops up whenever you click on a marine. It works very well for the most part--although the selections are quite small--in providing quick access to all Space Marine attributes. But there is no undo button, which was readily available in the last game. A ghost image of your marine in its new position is now shown before you click again to confirm moves, but it is way too easy to move the cursor a tiny bit and wind up facing the wrong direction. Or to move accidentally when you try to click on another marine and miss. Since action points are so few and so valuable, any slip-up like this can kill a Space Marine (use an extra point by mistake and you might not be able to go into overwatch, for instance). Adding back the undo button would be a huge benefit.Space Hulk: Ascension rises to the challenge by preserving the spirit and most of the mechanics of the original board game, while still expanding on the design to embrace its new home on the PC. Even with the design miscues, this is the closest that board game fans have come to being able to recreate the heart of the tabletop experience on a computer or console since the two great Electronic Arts takes on the franchise that came out in the early 1990s. Unless you have a desire to play head-to-head or to paint miniatures, you can get all the Space Hulk that you need right here."}