{"ref": "https://www.gamespot.com/reviews/mario-party-3-review/1900-2760370/", "date": "May 14, 2001", "game_name": "Mario Party 3", "text": "There are several possible reasons for creating sequels to puzzle games, and Mario isn't exempt from any of them. One is to use the sequential version to lasso new fans while satisfying old ones by keeping the overall structure intact, yet at the same time implementing changes and adding new features. This sort of sequence can go on forever, and in cases such as Tetris and Bust-A-Move, it does. Another is to satisfy fans by offering lateral improvements to buy time until the real McCoy is ready--the game that developers wanted to push out the door the first time around, but couldn't due to deadline and resource constraints. Hudson's Mario Party 3 seems to be a combination of both. While the disparity between the original Mario Party and its immediate sequel, Mario Party 2, was slim but noticeable, Mario Party 3 is as much a stand-alone game as a sequence can possibly offer. The concept is the same (a turn-based, random activity board game played with real or computer opponents), but the feel is sufficiently different from the two previous games. The cel shading and the battle-driven, more directly competitive gameplay featured in Mario Party 3 largely lend to the expansion, and whether you're a fan of the other games or if you've never played them before, you're likely to enjoy the experience just the same. Mario Party 3's battle royal mode offers the sort of gameplay that most people commonly associate with the Mario Party series. You and up to three other players (human or computer) compete on a variety of boards, where your goal is to collect the most stars and coins. Random events can switch your placement on the boards, steal your coins, or change the direction of paths abound. You can also gain items to skew these factors in your favor. At the end of every round, contestants fight against each other in one of 70 different minigames. These are made up of challenges such as chasing a fleet-footed chicken, racing through a tunnel on sleds, rolling and throwing snowballs at each other, guessing what objects a player has hidden behind, jumping up and down on a boat and making waves that your opponents have to jump to avoid, and shooting bad guys with foam bullets. While the minigames in Mario Party 2 were very similar to the ones in the original Mario Party, those found in Mario Party 3 are much more original. In fact, Mario Party 3 has some of the best minigames that have appeared in the series yet, although it does have a few stinkers. The biggest difference between Mario Party 3 and other Mario Party games is the introduction of the duel mode. In it, you and one opponent (again, human or computer) play against each other on game boards, where you claim spaces by landing on them. Land on an enemy space, and you have to pay them coins as you would by landing on another's property in Monopoly. Land on one of your own, and you gain coins. Unlike in the battle royal mode, you play only minigames if you land on a specific minigame square, rather than at the end of every round. This makes Mario Party 3 feel more like a traditional board game and also speeds things up significantly--which is appreciated because even a short game of battle royal can take a lot of time. At the outset of duel mode, you're provided a partner, who you can decide to put in front or behind you, and you later earn another, who will protect your other side. If you catch up to an opponent, the partner closest to him or her will attack. If the enemy's side that you attack is unprotected by one of his or her partners, that opponent takes damage. If it is protected, the enemy's partner takes damage for him or her. Different partners have different skills. For instance, Toad has low attack power but prevents coin theft, while Whomp blocks attacks well but has no attack power. Your partners get paid a salary at the beginning of every round, and if you run out of money, they leave. You ultimately win duel mode by having the most coins and heart pieces at the end of a set number of rounds or by taking all of your opponent's heart pieces.Another difference between this and earlier games in the line is the inclusion of a single-player story mode. It places you against three computer-controlled players in a series of battle royal maps, but with a finite end. None of the Mario Party titles have ever been the kinds of games that you wanted to play by yourself, and this single-player mode does practically nothing to change that. The duel mode, however, makes Mario Party 3 the sort of game you'd be willing to play with one other person rather than having to hold out for two or three. Beyond gameplay, the graphics in Mario Party 3 are very similar to those found in the previous games in the series, except for some cel-shaded effects, as seen in Sega's Jet Grind Radio. On one hand, the visuals look as good as they need to for this kind of game, but are certainly not going to win it any awards. The soundtrack has also taken a slight turn for the better and has become even catchier. It's still cute, but in a pop music sort of way, rather than the saccharine sweet of before. While pure innovation may not be king in the Mario Party world, Hudson's dedication to solid, addictive puzzle gaming that makes for a wholly enjoyable multiplayer experience is apparent. Mario Party 3 is fun, different enough from the early games due to the duel mode, and full of enough value to make the purchase worthwhile, even if you now play the other two. Still, it's clear that Hudson has probably exhausted the possibilities for this kind of game with Mario Party 3 and that the premise is beginning to wear a bit thin. Nintendo might want to let Mario take it easy for a while--to take a break from this life in the fast lane and go back to more leisurely pursuits, like playing more golf or tennis. Another difference between this and earlier games in the line is the inclusion of a single-player story mode. It places you against three computer-controlled players in a series of battle royal maps, but with a finite end. None of the Mario Party titles have ever been the kinds of games that you wanted to play by yourself, and this single-player mode does practically nothing to change that. The duel mode, however, makes Mario Party 3 the sort of game you'd be willing to play with one other person rather than having to hold out for two or three.Beyond gameplay, the graphics in Mario Party 3 are very similar to those found in the previous games in the series, except for some cel-shaded effects, as seen in Sega's Jet Grind Radio. On one hand, the visuals look as good as they need to for this kind of game, but are certainly not going to win it any awards. The soundtrack has also taken a slight turn for the better and has become even catchier. It's still cute, but in a pop music sort of way, rather than the saccharine sweet of before.While pure innovation may not be king in the Mario Party world, Hudson's dedication to solid, addictive puzzle gaming that makes for a wholly enjoyable multiplayer experience is apparent. Mario Party 3 is fun, different enough from the early games due to the duel mode, and full of enough value to make the purchase worthwhile, even if you now play the other two. Still, it's clear that Hudson has probably exhausted the possibilities for this kind of game with Mario Party 3 and that the premise is beginning to wear a bit thin. Nintendo might want to let Mario take it easy for a while--to take a break from this life in the fast lane and go back to more leisurely pursuits, like playing more golf or tennis."}