{"ref": "https://www.gamespot.com/reviews/minecraft-dungeons-review-mobsters-inc/1900-6417469/", "date": "June 1, 2020", "game_name": "Minecraft Dungeons", "text": "Minecraft represented a massive paradigm shift in games, having served as a popular proto-example of both early access releases and unstructured, creation-based gameplay. More than a decade later, Minecraft Dungeons doesn't strive toward revolutionary, but it may just use the now-familiar trappings of its namesake to introduce a new generation of players to old-school tropes. The dungeon-crawler is a light, breezy introduction to the genre for newcomers and a friendly, low-impact callback for veterans.Those experienced with games like Diablo or Torchlight already know the basic gist. You venture from a hub area into various environments, battle enemy hordes, occasionally fell some larger-than-life boss monster, and then spend time laying out and sorting through your new loot like a kid who just opened a pack of baseball cards. Rinse, repeat.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Minecraft Dungeons Video ReviewWithin that framework there is some simplification in Minecraft Dungeons, which helps to make it more inviting. You only have six gear slots--melee, bow, armor, and three artifact-based abilities. You won't find specialized classes or complex skill trees here. Everything is tied to your gear, and the level-ups mostly matter in that they determine the quality of your loot drops.That loot rains down constantly, sometimes a sprinkle but more often a monsoon, which means you'll be constantly swapping your weapons and armor sets. Minecraft Dungeons is far from precious with its gear, so it's not uncommon to find yourself switching three or four times in a single stage. At first, these upgrades appear pretty linear--replacing a sword with a new, stronger sword. But before long, the Enchantment system comes into play, which provides Dungeons with its strategic depth.Enchantments are specialized upgrades to each of your primary pieces of gear. Each level up gives you an enchantment point to select one from a handful of passive buffs, but you earn back your spent points whenever you salvage a piece of equipment that's already been enchanted. In the early game when a weapon might only have one enchantment slot and fairly vanilla buffs, these are nice bonuses but don't significantly impact how you approach the game. As you progress, these become instrumental in adding depth and a difficulty ramp. Finding more complex enchantment combinations can make the difference between a brittle build or a powerhouse. That also makes the search for new loot both thrilling and progressively more thoughtful. Since you earn your enchantment points back for salvaging, swapping out a new piece of gear means you can enchant it with several upgrades from the start. The late-game is a series of constant trade-offs, finding your rhythm with a new set of abilities and buffs before exchanging them for something completely different.At one point I had one enchantment that would pull enemies toward me on a regular pulse, and another that did fire damage to all enemies within my immediate vicinity. That led me to approach combat much more aggressively than I had before, often throwing myself into the middle of a pack of enemies. But once I swapped that gear for a stronger one that lacked those abilities, I went back to a more conservative strategy of picking off enemies with arrows before approaching.While enchantments make the combat strategically complex, the moment-to-moment gameplay is relatively simple. Most melee attacks don't stagger opponents, so there's no weight or impact to hits. You'll often just hit enemies as they hit you, planted to the floor like a couple of Rock 'Em Sock 'Em Robots, until one of you falls down. The melee weapons are well-differentiated by their attack speed and range, but that's basically all there is to it. Melee battles can also feel a little unfair when you're surrounded by mobs and unable to move, especially if you find yourself dropped there by surprise from a jump pad.Sometimes the simplicity of the combat can get in its own way. You can pick up TNT boxes as random drops and carry them around with you for when you need a quick area-of-effect attack, but the throw command is set to the same button as the ranged attack. That makes it impossible to fire an arrow without getting rid of the TNT boxes you may have been saving, and the two don't really serve the same function. This just means you have to sacrifice your AOE availability anytime you need the precision of an arrow--or any time you forget in the heat of the moment, which happened to me more times than I can count.Minecraft Dungeons is a short game on its Default difficulty setting, but it's clear from the start that it's not meant to be the entire experience. Completing on Default opens up Adventure Mode, with higher-level enemies and better loot, and completing Adventure opens Apocalypse. The game is built around relatively short, self-contained, repeatable stages, each with difficulty sliders. Adventure Mode starts to roll out gear with more powerful abilities--denoted by a small icon that simply says ~Powerful.~ That both provides more incentive to keep hunting better loot on the higher difficulty, and gives you something to do with the excess enchantment points since Powerful abilities are slightly more expensive.This emphasis on finding loot comes at the expense of the in-game economy, though, because despite finding gems frequently throughout dungeons, there just isn't much use for them. You can spend them to roll a random piece of gear at your camp, but it hardly ever stacks up to the gear you've already found, and turning unwanted gear into salvage only gets you a fraction of the full value. As a result, it's not really worth it, and there's nothing else to spend your hard-earned gems on.Like the characters, the stages themselves are Minecraft-accurate, carrying over an aesthetic made of parts that are clearly recognizable to anyone who has spent time in the block-building game. In fact, the look is carried so faithfully that a dedicated builder could probably recreate Dungeons environments in Minecraft proper. Those environments are procedurally generated and themed after various Minecraft biomes like swamps or underground caverns. Repeating a stage often enough will expose some common elements and pieces that consistently appear in every run, but usually the pieces blend seamlessly together and look as if they could have been constructed whole-cloth.The Minecraft spirit is also carried through the mobs themselves. Classic enemies like Creepers or Skeletons are among the first you'll see, and sometimes the stage will darken for a randomized visit from the Enderman as a miniboss encounter. Dungeons also finds ways to create its own bits of Minecraft identity, like with the addition of the ~Key Golem~--an adorable living key that obviously does not want to be put in a door and will run away from you at the first opportunity it gets.While enchantments make the combat strategically complex, the moment-to-moment gameplay is relatively simple.The co-op works without a hitch, offering an easy way to join up with friends or guide less experienced players through tough challenges. Gear can be concentrated in different directions, with emphasis on elements like healing or damage mitigation, which could theoretically allow a very well-coordinated team replicate the standard tank-healer-DPS model. Realistically, though, a team will consist of several single-player builds, and having partners simply works to help mitigate some of the crowd control issues that exist when going solo. A few smart inclusions, like color-coded loot and a quick teleport tool, make it easy to stay together and let everyone enjoy their winnings. Unfortunately, offline games operate as if you're playing online, including the inability to pause.Minecraft Dungeons is missing conspicuous parts of what gave the namesake its identity--most noticeably, breaking through walls to explore underground caverns and using the found materials to craft. But because it's such a successful departure from its predecessor, Dungeons shows how flexible the franchise has become. Rather than shift our expectations of what games can be, it's banking on its own popularity to introduce younger players to a classic genre and serves as a short-but-sweet treat for looter vets. It scratches the dungeon-crawler itch with a sense of goofy charm and expands what Minecraft can be.Minecreaft Dungeons is featured on our list of the Best Xbox Games for Kids."}