{"ref": "https://www.gamespot.com/reviews/zoo-tycoon-ds-review/1900-6137177/", "date": "November 17, 2005", "game_name": "Zoo Tycoon (2001)", "text": "Of all the tycoon games available on the PC and home consoles, Zoo Tycoon is probably about the easiest one to translate to the Nintendo DS. The concept of the game is simple enough to be shrunk down to portable size without sacrificing too much. Most of what makes Zoo Tycoon interesting and challenging is entirely transparent, so it shouldn't be too terribly difficult to translate the game to a handheld system. The relationship between animals and their environment is really what Zoo Tycoon is about, and the DS version of the game does do a fairly good job of capturing that spirit. Unfortunately, Zoo Tycoon DS is lacking in just about every other respect. There are 50 different animals in the DS version of Zoo Tycoon. Zoo Tycoon DS can be played two different ways. You can play a scenario game or a free-form game. If you play a scenario game, you're given a partially designed zoo to work with, and you have to satisfy certain objectives within a given amount of time. There are 15 scenarios in the game, as well as three tutorial scenarios to get you started. Objectives range from breeding pandas in captivity, to simply creating a few stable exhibits and then keeping your animals above an average happiness rating for six months. The scenarios range in difficulty, and the difficult ones are locked at the beginning of the game. As you play a scenario, you can purchase cards for $2,000 each. You can buy as many as you want, and if you complete the scenario, the cards will be added to your collection. The cards aren't at all useful during play, but you can view them in a gallery to learn more about each of the animals in the game. If you choose to play a free-form game, you can choose one of more than 20 templates that range in size and theme. If you like to keep things simple, you can choose an open grassy field. For a bit more of a challenge, you can try to build a rocky desert zoo, or you can set up a park in a snowy mountain forest. Once you choose your template, you can set your starting funds, the amount of which will depend on how much of a challenge you're looking for. You can even set it as high as $500,000, which is more than enough to build the most extravagant zoo the game will allow. When designing your own zoo from the ground up, you can arrange exhibits to suit any of the 50 different animals in the game. You start off by building a fence to contain your animals, and then you can choose the terrain type before placing foliage, rocks, shelter, and toys in the exhibit. You can also assign a zookeeper to each exhibit, and he'll tell you exactly what you need to do to make your animals happy. If your animals are happy and healthy, they'll have babies, which you can put up for adoption or keep in your zoo. Keeping animals happy is the key to maintaining a popular, healthy exhibit, and thanks to the hints provided by the zookeeper, it's relatively easy to keep even the most fickle species happy in your zoo. You not only have to keep animals happy, but you also have to take care of your guests as well. To do this, you can create pathways to guide your guests through the park, in addition to building food and drink stands, gift shops, restrooms, benches, picnic tables, and more. You can also beautify your park with scenery, like fountains, shrubs, flower beds, and statues, which all add to the appeal of your zoo. You can also make adjustments to the operations department of your zoo. You can adjust ticket prices, spend money on marketing, put money toward researching new items and animals, and hire maintenance workers and tour guides. You can play through one of the 15 scenarios, or you can build your own zoo from the ground up. It's fun to play around with creating a zoo, but it gets old fairly quickly. Your options feel fairly limited here, and you'll have seen just about everything the game has to offer after just an hour of tinkering with your own zoo. Oddly, you can only have one saved game at a time. So if you have a free-form zoo saved, you can't start on a scenario game, because you won't be able to save it without overwriting your other zoo. It would be nice if there were at least two or three save slots so you could have more than one zoo at a time. But as it is here, you'll pretty much be restricted to only having one zoo saved at a time. Perhaps this is for the better, though, because once you have a zoo built, there isn't much to do with it anyway--aside from just sitting back to watch guests roll in. You can remodel your zoo when you get bored with it, but it's more hassle than it's worth, thanks to some clunky controls. This game makes heavy use of the stylus when it would probably be much easier to just use the control pad. All the menus are displayed on the lower screen of the DS, and you make selections by touching the screen. When adjusting terrain or building fences, you use the D pad to position a grid on the upper screen. You'll see a grid on the bottom screen, and you can use the stylus to change the terrain of each square, or you can drag the stylus around the grid to set up fences. This is awkward because the screen isn't very sensitive in spots, so you end up having to hit the same square several times before anything registers. Also, it can be annoying to try to look at the top screen to figure out exactly where on the grid you want to start working. It would be much easier if the grid on the bottom screen was shown in the actual context of the zoo so you could see what you're building and where you are in relation to other objects. You can get the hang of it after a while, but the interface just feels unnecessarily convoluted and cumbersome. The graphics in the game look pretty small and undefined. Of all the 50 animals, only a few of them actually have distinct looks. You'll see the same brownish blob move around using the same two or three frames of animation over and over, which just doesn't look natural at all. Occasionally you'll see an animal lie down or play, but those animations aren't any smoother, and they don't do much to give you the idea that these are living animals rather than a bunch of poorly crafted animatronic imitations. The guests move about like robots as well, and there are only a couple of different character designs. The different types of terrain in the game amount to different-colored squares on the grid, although the trees are fairly varied and can add some much-needed life to an exhibit or zoo. Overall, the graphics here are unimpressive, even for a game whose visuals are meant to be more functional than cosmetic. The sound in the game barely exists. There's a brief tune at the main menu, but other than that there's no music in the entire thing. There are some ambient noises, like the occasional bird chirping or the howl of a wolf, but for the most part you could play this game on mute without missing anything. You might be deprived of the sweeping noise maintenance workers make, but you can just grab a broom and make the noise yourself, which, incidentally, would probably be about as much fun as playing this game. The visual presentation in the game is pretty weak, and the sound is pretty much nonexistent. Zoo Tycoon DS is a fine concept, but it's poorly executed here. The ugly presentation, limited creative options, and awkward controls make this game feel too limited to be worth playing. As it is, Zoo Tycoon DS starts to wear thin after only an hour or two, and the fact that you can only have one game saved at a time further stifles any long-term interest you may have in it. If you're a Zoo Tycoon fanatic, you might be able to squeeze some enjoyment out of this, but most people will find that this game offers little more than a brief diversion."}