{"ref": "https://www.gamespot.com/reviews/dk-king-of-swing-review/1900-6133539/", "date": "September 16, 2005", "game_name": "DK: King of Swing", "text": "Don't let the title fool you, DK: King of Swing isn't Nintendo's take on Dancing with the Stars. In fact, Donkey Kong doesn't swing-dance at all in the game, but he sure does dangle, twirl, and swing from a vast variety of pegs and peglike objects. Nintendo, best known for platform games like Super Mario Bros. and Donkey Kong Country, has set aside the traditional run-and-jump formula for the big ape's latest adventure, an action-filled puzzle game that challenges players to grab onto pegs and spin their ways through the jungles, monsters, and bad bosses of DK's lush world. Swing from pegs, and launch DK into the air using only the L and R buttons. Instead of spanning left to right, as the levels in a traditional platform game would, the majority of levels in DK: King of Swing start on the ground and move upward. DK can jump, sure, but the key to reaching the exit at the top of each level rests with your ability to grab onto, spin around on, and hurl DK off the many pegs, peg boards, and peglike switches that are situated between the floor and the ceiling. Nifty objects, such as rubber tires, barrel cannons, and bonus barrels, also come into play from time to time. The journey isn't a cakewalk, though. Situated on some of those pegs are alligator-like Kremlings, which swing around and try to knock DK off his handhold, and there are flying enemies, such as Zingers, Neckys, and ghosts, which fly back and forth hoping to chomp down on DK. To survive the trek to the top of the level, you'll have to swing over and past these nuisances without losing all three of DK's life points. The most unique thing about DK: King of Swing is that the game is controlled almost entirely using the L and R shoulder buttons. Pressing the L button moves DK to the left and causes his left hand to grab onto things. Letting go of the L button causes DK to release his grip or to throw an object he's holding in his left hand. By the same token, pressing the R button will make DK move to the right or grab onto something with his right hand, while releasing the R button will make him release his grip or throw the object in his right hand. This control setup also makes it possible to swing hand over hand, monkey style, along a sequence of pegs by alternating the L and R buttons. Most of the time, you'll only find pegs and peg boards to grab onto, although there are levers and switches to pull every so often, not to mention the erstwhile rock that can get rid of an annoying mini-Necky with a well-timed throw. Pressing and releasing both buttons simultaneously will make DK leap in whatever direction he's facing, which comes in handy for jumping up to pegs or for jumping sideways onto a midair peg board. DK's leap also functions as a short-range head-pound attack for taking out certain enemies. There's a tough boss battle at the end of each world. Despite its innovative aspects, DK: King of Swing doesn't totally eschew the tried-and-true DK formula. At the end of each level, you'll face off against one of King K. Rool's henchmen in a typical boss battle. Vanquishing these powerful foes usually entails pouncing on their heads a few times or pulling them into spikes. These fights are certainly more interesting thanks to the peg-oriented gameplay and unique control setup, but in the end it still comes down to bonking the bad guy on the head until he's knocked out. And then there are the collect-a-thon aspects. Fans of Donkey Kong Country will remember collecting K-O-N-G letters and DK symbols on their ways toward a 200 percent completion score. In DK: King of Swing, it's the same concept, except with bronze, silver, and gold medals--and coconut crystals. Bananas are also a good thing to gather, as you can exchange 10 of them to refill one of DK's life points, or you can use 20 to activate a temporary ~going bananas~ state that renders DK invincible to enemies. Most everything that could be perceived as a problem with DK: King of Swing is entirely subjective. There's nothing overtly broken with the game, but you may love or hate certain aspects of it depending on your personal proclivities. The controls take a while to get used to, and it's easy to press the wrong button while DK is spinning, because his orientation changes as he rotates. Honestly, there really isn't a good reason why this game couldn't employ the traditional D-pad, A-button, B-button setup--at least as an alternative to the standard controls. After a while, the game starts to feel very repetitive. The boss encounters and random weather-afflicted stages that cause DK to float do break up the monotony of peg spinning somewhat, but there are thousands more pegs than enemies in the game. Some levels are also positively frustrating, with enemies, rubber tires, spike strips, and pitfalls placed just so to send you to the continue screen after just one mistake. Thankfully, it's easy enough to visit previously completed levels to stockpile bananas, which will let you replenish DK's life and activate his ~going bananas~ state pretty much as often as you like. Should you find yourself in the ~love it~ camp, you'll end up with a game that offers plenty to do and ample amounts of eye and ear candy. The main adventure mode spans five worlds and 25 total levels. Once you complete it, you'll unlock a time attack mode that lets you go back to try to beat your best times. Hidden throughout the game are a total of 24 medals, which, when they're all collected, unlock a tougher variation of the adventure mode starring Diddy Kong. New events and characters also gradually become available in the jungle jam mode as you collect more and more medals. Jungle jam mode is a set of 12 different competitive events--climbing races, obstacle races, attack battles, and barrel-blast shoot-outs--that you can play against CPU opponents or with friends via link cable. You'll need multiple copies of the game to participate in multiplayer obstacle races, attack battles, and barrel blasts, but the game does allow for multiplay on three climbing race courses using only a single cartridge. Challenge your friends in multiplayer minigames. Graphically, the game is a treat. DK and the other characters are drawn in a cartoonlike style, as opposed to the plasticky prerendered style made popular in the Donkey Kong Country games. However, the look works because the animations for the characters' movements are fluid and seamless. During a jump, DK's arms sway, his feet shake, and his tie flaps while he soars through the air. When he grips onto the next handhold, his body jerks in response to the sudden stop, and his feet kick forward. Details like that are fun to watch. Even more arresting are the backgrounds, which employ vibrant tropical colors and smooth gradients not seen since the Super NES days. Sunny oranges, rich greens, and watery blues are the order of the day. The scrolling mountains and islands in the background aren't bad either. Backing up the visuals is a soundtrack that, while not spectacular, suits the game perfectly. All the music is either remixed or taken directly from Donkey Kong Country, and so are most of the sound effects. Swiping another game's audio may seem like a cop-out, but the DKC soundtrack has always been highly regarded as one of the better ones. As a result, using it as the basis for DK: King of Swing was probably a wise choice. Also, the digitized vocalizations that form DK's groans, the Kremlings' cries, and other such sound effects wonderfully support the standard clacks and boings that accompany latching onto pegs and being blown out of barrel cannons. All told, DK: King of Swing is a unique and interesting take on the puzzle genre that people will either love or hate depending on how accepting they are of the game's innovative control scheme."}