{"ref": "https://www.gamespot.com/reviews/battleborn-review/1900-6416425/", "date": "May 6, 2016", "game_name": "Battleborn", "text": "For a game with so many strong personalities, Battleborn somehow lacks a cohesive identity. Every facet from the characters to the progression to the visual presentation feels overloaded with ideas--some good, some bad, some just confusing. Because it throws so much against the wall, the end result is a scattered grabbag of manic gameplay, complex leveling, and cartoony humor. It vacillates wildly between excitement and predictability, innovation and routine, inspiration and incomprehensibility. In short, Battleborn is fun but messy, and while I appreciate its hyper-stimulating approach, parsing the experience underneath can be maddeningly tricky.The best example of Battleborn's deep-seated identity crisis is its massive 25-character roster. Though technically a first-person shooter, the game's heroes utilize all sorts of preset weapons, abilities, and roles that pull from every influence imaginable. There's a longbow-wielding wood elf, a penguin piloting a mech suit, a cybernetically-enhanced luchador--the list goes on. Impressively, even characters that seem superficially similar inevitably offer something unique that makes their gameplay memorable and enjoyable--be it a particularly powerful super or simply a higher than average movement speed.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Battleborn - ReviewThis mechanical variety is not only remarkable, it also drives Battleborn's longevity. Where other game's dole out new tools or gear as you progress, Battleborn builds these unlocks into entirely new characters. You'll unlock new heroes steadily and without much conscious effort, so you'll generally have one or two new options by the time you've outgrown your current character. Unfortunately, you might outgrow them more quickly than you'd expect. Testing out a new hero for the first time can feel a bit overwhelming since some abilities' specific requirements and effects aren't super apparent, but as soon as you overcome this initial teething period, each heroes' gameplay loop starts to grow routine.This is, in part, a symptom of Battleborn's approach to action: its gameplay is fast and frantic, but also light and loose. Forgiving design choices like infinite sprint and ammo, no fall damage, and the ability to reload while sprinting encourage players to move and shoot rather than stop and think. As a result, I found I generally just had to spam the primary attack button, trigger my special abilities whenever possible, and occasionally retreat to let my shields recharge.This is especially true during the cooperative campaign, which consists of eight loosely connected missions that feel more like Destiny's Strikes than a carefully crafted, narrative-driven story mode. Enemies are, for the most part, brainless and predictable; cutting them down in droves can feel empowering, but it also underscores the repetitive, simplistic nature of the baseline combat. It's also somewhat frustrating that all eight missions repeatedly remix the same three scenarios: defend the asset, escort the robot, and kill the boss.Thanks to the variety of the characters and frenetic energy of the combat, however, Battleborn can still end up being a blast. Sure, the moment to moment gameplay feels superficial, but when your five-man squad is getting absolutely swarmed and you've already sunk 45 minutes into a mission and you've run out of respawns, the tension and chaos combine to form a powerful engine of fun. Plus, as you get deeper into the campaign, a discernable difficulty arc emerges and helps give the whole affair some much needed momentum. A word of warning, though: if you're playing alone, you won't have much fun. Without other players, combat becomes a slog and certain objectives become nearly impossible. But hey, at least there's split-screen co-op and streamlined matchmaking.Outside of the eight campaign missions, Battleborn offers three competitive multiplayer modes, and here the gameplay develops a slightly more strategic sheen. Unlike the mindless fodder you fight in the campaign, multiplayer pits heroes against heroes, which forces you to approach combat more thoughtfully. If you're playing a melee character, for example, charging directly at your opponents is suddenly way more dangerous, so you're forced to seek advantageous positions and strike judiciously. Healers and support characters also become more crucial; team composition can occasionally turn a match's outcome into a forgone conclusion, so choose wisely or suffer humiliation.The modes themselves add an extra layer of strategy as well. Meltdown, for example, requires both teams to guide minions to designated grinders. The more robots reach the grinder, the more points that team scores. This and the somewhat similar Incursion mode borrow MOBA elements to create setups that emphasize objectives over kills. In practice, this equates to action that's less chaotic but far more involving than anything in the campaign, and the combination of distinct characters and MOBA-inspired objectives makes Battleborn's multiplayer feel genuinely fresh.This component is by no means flawless, however. The added strategic depth helps but doesn't eliminate the simplicity of the core gameplay, but more importantly, there's not quite enough content to make Battleborn feel totally substantial. The three modes offer just two maps apiece, and while that's not unusual for a MOBA, it's awfully light for a shooter--especially one with a relatively short, unadorned campaign. The game's also missing certain amenities like killcams, and for some reason, you can't simply vote on a new map when a match concludes. Your team is automatically dissolved and you're booted to the home screen every time, which is especially troubling given the game's team-based nature.There's also an issue with Battleborn's in-match leveling system. The game features several forms of experience and progression--including individual character leveling, unlockable gear, and an overall ~Command~ rank--but the most impactful system is the on-the-fly leveling that occurs within each mission and match (another concept swiped from MOBAs). In essence, every character has a unique 10-tier skill tree. Each tier contains two mutually exclusive upgrades. As players earn XP while playing, they'll gradually work their up the tree until one skill at each tier is unlocked. At the end of the match or mission, the tree resets.In the campaign, this system works remarkably well. I never felt hindered starting at zero, but I was always glad to have all my fully leveled abilities back by the end. Many of those upgrades only marginally improve the effectiveness of an existing ability, but others tangibly impact the character's playstyle, and all of them lend a sense of escalation to every mission. In the competitive multiplayer, however, this system can unfairly stack the odds against players who actually need the most help. The better you play, the faster you're able to progress through the leveling tree, which of course makes you even more powerful. This generally isn't an issue in close matches, but when a round starts to get away from you, it can snowball into a lopsided thrashing that gets less and less fun for the losing side.While it may not be as important as the progression system or multiplayer modes, it's worth noting that Battleborn's writing is, by and large, excellent. The humor can occasionally produce forced, cringeworthy lines, but far more often, it's goofy, witty, and endearing, with a distinct voice that should be immediately recognizable for Borderlands fans. It won't appeal to everyone's tastes, but anyone can appreciate the deep well of one-liners that flavor both the campaign and, surprisingly, the competitive multiplayer. And while there isn't much of a narrative to speak of, the stylized cinematics that bookend the campaign are pretty spectacular.Battleborn's strong Saturday morning cartoon vibes might actually be the game's single most defining aspect. Outside of that consistent, permeating voice, the game feels like an elaborate patchwork of ideas that compete for attention without necessarily adding much to the experience. The combat is frantic and tense, but often feels samey and superficial. The in-match leveling works wonderfully in the campaign, but can become problematic in multiplayer. The varied cast of heroes adds longevity, but the game still feels relatively content light. With so many moving parts that never quite gel, I found plenty of things to love but just as much to feel confused by and ambivalent about."}