{"ref": "https://www.gamespot.com/reviews/final-fantasy-fables-chocobo-tales-review/1900-6168802/", "date": "April 9, 2007", "game_name": "Final Fantasy Fables: Chocobo Tales", "text": "For a kid-oriented game, it's hard not to be taken in by Final Fantasy Fables: Chocobo Tales. It's got a splendid sense of storybook style, with cute and colorful graphics. It also has a charming story that overflows with wit and wile. The smart assortment of gameplay styles includes exploration, card battling, and minigames, with each vying for your attention. For the most part, these elements fit together nicely, though some of the minigames can be unnecessarily frustrating. Yet in spite of the occasional unevenness, Chocobo Tales is fun for younger players and surprisingly engaging for the older crowd too. The famous story of the tortoise and the hare is updated with a Final Fantasy twist. Final Fantasy fans the world over know what chocobos are: large ostrichlike critters used mostly for travel in the franchise's universe. In Chocobo Tales, you play as a diminutive yellow chocobo living on a farm where everyone gathers around to hear resident mother figure Shirma read stories to them. One of the storybooks turns out to be more than it seems, and soon the evil Darkmaster Bebuzzu has trapped all of your feathery friends in various books scattered across the land. What's a young bird to do? For starters, you've got to roam about looking for books. Using the stylus exclusively, you travel around the farm and other enchanting environs searching for your plucky chums and other secrets. Your main objects of interest are the books, which are easily identified by their glow, and tapping on one thrusts you into its story. Once you're sucked into a book, you've got to play the attached minigame to advance the adventure and unlock other nifty nuggets. Most of the little minigame tales should be familiar to anyone who has read Aesop's Fables, even though the story and character names were changed to better fit the Final Fantasy universe. For instance, the boy who cried wolf is now the boy who cried Leviathan. To further add to the fairytale atmosphere, each minigame is presented like a pop-up book, with attractive 2D visuals bursting from the bottom screen and flowering toward the top. Most games have a battle mode, which pits you against the artificial intelligence, as well as a trial mode, where you try to beat a certain score or time. Completing the levels within these modes earns you goodies. In some cases, you set free one of your avian amigos; other times, you unlock additional endings to your little story, open a new area for your main adventure, or earn cards to use in Chocobo Tales' card battling mode. A lot of these minigames are great fun. For example, in Symphonic Survivor, you listen to a little tune and then position your chocobo on the appropriate instrument's icon while simultaneously knocking your opponents away. In Flaming Frenzy, you gather coins and roll into your opponents to knock their coins away, which is also a riot. However, other minigames tend to be a little frustrating, such as Puzzled Little Piggies. In this minigame, you pick up scattered puzzle pieces from the ground and place them on house templates to rebuild the abodes of the now-famous three little pigs. To pick up a piece, you fly above it and release the stylus to land, but it's tougher than it sounds because you have only your shadow to gauge whether you're hovering in the right spot. Placing your piece on the house template is equally laborious, particularly when you are competing against three other AI characters, which magically know where all the stray pieces have been strewn. Fortunately, the great minigames outnumber the frustrating ones. There are also simpler tasks called microgames to be found. They don't advance the story, but they do earn you more cards. They also tend to be more maddening than the minigames and can take a good amount of time to master. Card battling is the third side of Chocobo Tales' gaming triumvirate, with well over 100 cards to collect. Every so often, you'll be faced with a boss character that challenges you to a duel. These Yu-Gi-Oh-inspired battles are familiar turn-based affairs, but the original battling system is unexpectedly interesting and tactical. Cards come in four different colors and are further separated by the creatures they summon. In a typical duel, the first player to play one of his or her three available cards before the timer counts down to zero takes the first turn, unless there is an effect like ~haste~ in play. Each card has attack and guard zones that determine the color of your attack, as well as what colors you will guard against. If your opponent has a yellow guard zone, a yellow attack will have no effect; if he or she has a yellow attack zone, the damage will be cut in half. Prior to playing a card, you can see the colors of your opponent's cards, so you can take an educated guess at which color you need to guard against. To make things even more interesting, you earn crystals during battle that you must spend to play certain cards. You can also duel against others, both online and off. Finding other players via Nintendo Wi-Fi is easy, and you can either be automatically be pitted against another player, or invite someone by their DS friend code. While the game's AI is a fine opponent, human players are more challenging. You'll discover just how well rounded your deck needs to be by playing other players rather than the AI. Because the colors of the cards you play determine the colors of the crystals you earn, a good deck includes cards of all colors. This not only gives you flexibility, but also keeps your opponent on his or her toes because a hand of three colors is harder to guard against than a hand of a single color. You can play minigames and microgames with up to four others as well, though not via Wi-Fi, which is too bad. While minigames and card battles require every player to have a cartridge, microgames can be shared via download play. The card battles look like a pop-up book come to life. The magical make-believe milieu of the minigames spills over into every aspect of the visuals. The pop-up-book style pervades the card battles, which makes watching colorful cardboard cutout unicorns and cactuars duke it out a lot of fun. The adventuring portions are bright and vibrant, but they're not as appealing as the other aspects because they are missing some of the unique fairytale mood. The sound is even better, filled with familiar Final Fantasy tunes and enchanting effects that get the tone of the minigames and battles just right. It might look like just another kid's game, but there is a lot of quality gaming buried under the saccharine visuals. Chocobo Tales never condescends to its audience, making it an attractive choice for young and old alike. It's also a special treat for Final Fantasy fans, who will be delighted by the recognizable characters and monsters that make appearances. As long as you don't mind a few of the less likable minigames, you'll get sucked into this easygoing fable of feathered fellows."}