{"ref": "https://www.gamespot.com/reviews/agent-under-fire-review/1900-2858971/", "date": "May 17, 2006", "game_name": "James Bond 007: Agent Under Fire", "text": "Any game based on Ian Fleming's suave superspy James Bond is in the position of following Rare's excellent GoldenEye 007 for the Nintendo 64, and as such it receives an incredible amount of attention and has a lot to live up to. Since GoldenEye 007, the Bond license has changed hands from Rare to Electronic Arts, which has served up 007 games on the Nintendo 64, PlayStation, and Game Boy Color. Now the company is offering a Bond first-person shooter for the Xbox, GameCube, and PlayStation 2 (the first two being virtually identical), albeit with mixed results. Unlike many other Bond games, James Bond in Agent Under Fire is based on an original story rather than an actual 007 movie. In it, you work alongside a female CIA operative to stop an evil organization from cloning world leaders, killing them, and replacing them with their genetic doubles. The gameplay in Agent Under Fire is, by and large, similar in style to what we've seen in Bond games such as GoldenEye 007 and The World Is Not Enough, yet the actual gameplay yields a few differences. You spend the majority of the game in a first-person perspective, shooting enemies and using gadgets provided by Q's spy shop, such as a cell phone that emits a lock-cutting laser, unscrambles codes, and photographs secret documents. Several sections of the game place you in vehicles as well, either riding atop a fleeing car, manning the turret of a tank, or driving a gadget-laden BMW. There are 12 basic levels in the game, each broken up into smaller sections that serve as milestones that you'll respawn at the beginning of if you use up one or two of your three lives per level. The objectives are very straightforward and run along the lines of: use the Q-claw to grapple onto the roof, use the Q-laser to unlock the hatch, sneak in, shoot the guards, and get away with the secret plans. A certain number of ~Bond moves~ are possible on each level. Bond moves are actions that show off your character's panache, such as shooting a wire that suspends a crate above a hiding enemy. Pulling off most or all of the Bond moves in each level will provide you with enough points to earn a medal at the end of that course. Getting a gold medal will unlock special items such as the Golden Gun (from the film The Man With The Golden Gun), and earning a platinum medal will open up extras such as additional multiplayer maps. The medal system is incentive for you to go back and play Agent Under Fire's levels multiple times, but you won't want to, because once is enough. The game suffers from lackluster level design and poor artificial intelligence; it's unfortunately better to look at than it is to play. Enemy soldiers are slow to hit alarms, fire at you, or react in general, making them only dangerous when found in significant numbers. Your foes appear to have three basic behaviors: hide behind objects, run around like crazed chickens, or stand still while you shoot them. Firefights are rarely entertaining in the game. The combat simply lacks the spark of other console shooters, such as Halo or Red Faction. Agent Under Fire is also quite easy. The only really difficult spots in the game are the few instances where it's unclear what you're supposed to do next. Your spy chief, M, talks you through nearly every action, taking the fun out of your missions and making you feel like you're simply going through the motions. The auto-aim function also takes over too much in the game's normal difficulty, sometimes pulling your weapon sighting more than an inch over from wherever you had it aimed. In one particularly problematic instance, you'll find it impossible to shoot a gas tank until you've shot three nearby enemy soldiers (whom the auto-aim finds), even though it would be much easier to take them all out at once by blowing up the tank. You could manually bring up the weapon sight to zero in on the tank, but you shouldn't have to battle to choose your targets. The game is also strewn with bulletproof vest power-ups, a quick fix that developers sometimes throw into levels that haven't been properly play-balanced. Instead of tuning the difficulty to make them challenging but not impossible, power-ups are tossed in to just make it easier.Aside from the auto-aim function, the control in Agent Under Fire is serviceable. The default control setup takes a lot of getting used to, but a variety of control configurations are available. One fault of the control system is that the weapons don't always automatically switch to the next available arm once their ammunition runs out. They do for the most part, but they'll get hung up on a gun whose secondary use hasn't been depleted (an M16, for example, shoots bullets as well as launches grenades). If you're fighting in close quarters, for example, you want to use a revolver, not a grenade launcher. Having to switch manually can cost you seconds that you might not have. If there's one area where Agent Under Fire particularly excels, it's in the graphics. The character and weapon models look fantastic, the game's textures are clear and crisp, and the environments are often outstanding. The only real drawbacks to the game's graphics are that the characters move so quickly that they seem unrealistic, some levels look a bit sparse, and the frame rate fluctuates at times. It usually moves along at a fast, consistent clip, but on a few occasions it slows down to a crawl, while at other times it speeds up so fast you'll feel like a James Bond rocket. The occasional extreme in either direction makes for an odd experience. The Bond film series is universally recognized for its excellent soundtracks, and the trademark theme is often played in Agent Under Fire to great effect (though, admittedly, very often). However, while the game's briefings and cutscenes are voiced well enough, the taunts from your foes during gameplay are horrible and repeated far too frequently. Agent Under Fire for the Xbox supports up to four players at once in its multiplayer mode, but if you don't have a full quartet to play with, computer-controlled bots can be used to round out the teams (a feature not found in the PlayStation 2 version). Most of the maps are well laid out, and the game's slight variations on the standard deathmatch theme give it some variety, but the game's multiplayer offerings are still fairly basic. Those spoiled by the multiplayer modes found in shooters on older systems like Rare's GoldenEye 007 and Perfect Dark will find them pretty dull, but there's at least something to be said for it being the first multiplayer shooter with bots for the Xbox. Agent Under Fire is a short game, one that you can complete within roughly six hours. The developers appear to have taken great pains to extend the game's replayability through the addition of unlockable extras, which is certainly commendable, but since the basic gameplay is already lacking, you likely won't be motivated to continue playing much longer once you've beaten it. Agent Under Fire isn't a horrible game, but its lackluster level design, poor enemy AI, and easy level of difficulty pile up to greatly detract from what it does offer. Its vehicle levels provide the single-player game with a good degree of variety, but they're not in and of themselves enough to save the game. Fans of GoldenEye 007 and other console first-person shooters will find Agent Under Fire a by-the-numbers FPS affair. Those still curious would be advised to rent, not buy.Aside from the auto-aim function, the control in Agent Under Fire is serviceable. The default control setup takes a lot of getting used to, but a variety of control configurations are available. One fault of the control system is that the weapons don't always automatically switch to the next available arm once their ammunition runs out. They do for the most part, but they'll get hung up on a gun whose secondary use hasn't been depleted (an M16, for example, shoots bullets as well as launches grenades). If you're fighting in close quarters, for example, you want to use a revolver, not a grenade launcher. Having to switch manually can cost you seconds that you might not have. If there's one area where Agent Under Fire particularly excels, it's in the graphics. The character and weapon models look fantastic, the game's textures are clear and crisp, and the environments are often outstanding. The only real drawbacks to the game's graphics are that the characters move so quickly that they seem unrealistic, some levels look a bit sparse, and the frame rate fluctuates at times. It usually moves along at a fast, consistent clip, but on a few occasions it slows down to a crawl, while at other times it speeds up so fast you'll feel like a James Bond rocket. The occasional extreme in either direction makes for an odd experience. The Bond film series is universally recognized for its excellent soundtracks, and the trademark theme is often played in Agent Under Fire to great effect (though, admittedly, very often). However, while the game's briefings and cutscenes are voiced well enough, the taunts from your foes during gameplay are horrible and repeated far too frequently. Agent Under Fire for the Xbox supports up to four players at once in its multiplayer mode, but if you don't have a full quartet to play with, computer-controlled bots can be used to round out the teams (a feature not found in the PlayStation 2 version). Most of the maps are well laid out, and the game's slight variations on the standard deathmatch theme give it some variety, but the game's multiplayer offerings are still fairly basic. Those spoiled by the multiplayer modes found in shooters on older systems like Rare's GoldenEye 007 and Perfect Dark will find them pretty dull, but there's at least something to be said for it being the first multiplayer shooter with bots for the Xbox. Agent Under Fire is a short game, one that you can complete within roughly six hours. The developers appear to have taken great pains to extend the game's replayability through the addition of unlockable extras, which is certainly commendable, but since the basic gameplay is already lacking, you likely won't be motivated to continue playing much longer once you've beaten it. Agent Under Fire isn't a horrible game, but its lackluster level design, poor enemy AI, and easy level of difficulty pile up to greatly detract from what it does offer. Its vehicle levels provide the single-player game with a good degree of variety, but they're not in and of themselves enough to save the game. Fans of GoldenEye 007 and other console first-person shooters will find Agent Under Fire a by-the-numbers FPS affair. Those still curious would be advised to rent, not buy."}