{"ref": "https://www.gamespot.com/reviews/planet-monsters-review/1900-2844005/", "date": "May 17, 2006", "game_name": "Planet Monsters", "text": "Planet Monsters for the Game Boy Advance is Titus' recent puzzle game release, which features gameplay that's highly reminiscent of the arcade classic Pengo and a storyline involving battling monsters--two key phrases that have been known as hallmarks of popular handheld games. The rather oddly thrown-together storyline in Planet Monsters places you in a world where humans have turned into cute, furry monsters and settle their disputes by battling in a series of mazelike arenas. Like in the addictive 1982 Sega arcade classic Pengo, the objective in Planet Monsters is to push slippery blocks through a maze, knocking out the opposing monsters and anything else that might get in your way. While clever enough in theory, and adequate in execution, Titus' new game also happens to have a couple of noticeable flaws that detract from the overall experience.Planet Monsters features relatively attractive graphics that showcase large, well-animated sprites running through varying types of terrain. In addition to the player-character monster and his enemies, who strongly resemble palette-swapped versions of Sesame Street's Oscar the Grouch, there are a number of attractive enemies to avoid or to smash with sliding blocks. At the end of each main stage, you engage in a boss battle with a huge enemy--battling these bosses is often far more fun than playing the regular game. To spice up the relatively derivative action, your monster can pick up a number of useful weaponry such as spring jumps, bubble guns, and bombs. There are occasionally some fairly large levels to explore, which can make the game more challenging than was intended, especially when you're blindly walking around a corner at the edge of the screen's visible area. Accompanying the cute characters is an equally bouncy soundtrack that's upbeat and catchy. The sound effects are generally muted by the overpowering music, but the overall audio presentation is more than adequate for this sort of game. Planet Monsters is a fairly good-looking and equally adequate-sounding game that provides enough visual and audio perks to keep you coming back.On the other hand, some of the features in Planet Monsters are rather questionable and in some cases downright poorly implemented. While pretty much all Game Boy Advance games force you to sit through a handful of initial screens showing off the developer, publisher, and a shout out to their homies, Planet Monsters has a fairly generous initial wait time--well upward of 15 seconds. This wouldn't be so bad, as there's something to be said for a pounding start while you wait for a game to begin, except that in Planet Monsters the default language setting is French. Perhaps Titus feels that the American audience should broaden its horizons, but more likely this was an oversight--one that will cause you to frequently turn off your system and restart, while patiently waiting for the initial screens to fade, muttering expletives under your breath. Further worsening the situation is perhaps one of the worst possible things to do with a handheld game: Planet Monsters lacks a save function and instead relies on a password system to save your progress. While this is hardly a new development, it's still a hassle to deal with passwords when you're gaming on the go.Planet Monsters doesn't bring much to this already well-established genre--it doesn't present an original game design nor is it a particularly compelling experience. It does, however, provide you with a moderately entertaining puzzle game based on a true classic that holds up well to this day. Once you get into the game, Planet Monsters looks and sounds just fine, but as a package it's hindered by the shoddy presentation. The lack of a save function flies in the face of what handheld games are all about, but if you can get past this oversight and feel that pushing blocks through a maze is your thing, then Planet Monsters may be for you."}