{"ref": "https://www.gamespot.com/reviews/dynasty-warriors-6-empires-review/1900-6212719/", "date": "June 29, 2009", "game_name": "Dynasty Warriors 6 Empires", "text": "The human thumb is a resilient thing, and the Dynasty Warriors franchise has exploited that digit's agility for years now. So if you find your own right thumb growing particularly stiff of late, Dynasty Warriors 6 Empires is here to provide your workout routine the button mashing needed to whip it into shape. This comes as no shock to those accustomed to the monotonous and unoriginal combat for which the series is known, of course. Like other Empires rereleases in the franchise, this version of last year's Dynasty Warriors 6 offers a light turn-based strategy overlay to the tedious battles, providing them some welcome tactical context. This addition doesn't make the mind-numbing swordplay easier to stomach. It does, however, allow you to take a breath between battles and exercise your gray matter while crushing rival factions. This makes for better pacing, and while it isn't enough to raise this series from its years-long rut, it does lead to a slightly more fulfilling experience than many other Warriors games. Like previous Dynasty Warriors games, this one offers a humongous number of different playable characters, each with his or her own weapon and poorly acted, excruciating dialogue. Like with previous games, you endlessly mash the attack button to slice through swaths of cookie-cutter bad guys that only occasionally find it in their hearts to swing back. And like with previous games, you can unleash a powerful musou attack that lets you hew through even thicker hordes of baddies. So it's more of the same, though there are some additions and tweaks to combat that add a tad (though not a lot) of variety. As you progress through the game, you'll be able to purchase weapon effects that, for example, increase your attack radius or let you do elemental damage. You can also purchase special attacks and abilities, up to four of which can be assigned at any given time; these include fire attacks, falling rocks, and more. Enemy lieutenants and generals are tougher to take down and seem to do a lot more damage, and these effects and attacks help balance the slightly higher level of difficulty. The renbu system from last year's Dynasty Warriors 6 works differently in Empires as well. In DW6's renbu system, you increased your combo count by sustaining a long chain of attacks. Now, your renbu level rises (and your combo potential increases) as you upgrade your weapon, which means there's less reason to care about racking up long chains during battle. These modifications don't make the combat in Dynasty Warriors 6 Empires feel substantially different from that of previous games. You mash-mash-mash the attack button, and it's just as wearisome as ever, though combatants throw in the occasional string of frustrating knockback attacks to keep you on your toes. It's up to the turn-based Empire mode, then, to breathe life into this otherwise stale endeavor--and to its credit, it makes a stand-up attempt. Rather than plowing through one of the franchise's typically nonsensical stories, you can play as a ruler and attempt to take over China by capturing regions from rival factions. You and each AI officer in your employ possess a card that may be played prior to battle, and you draw an additional one at the beginning of each turn; together, these cards comprise your deck. Cards have various effects, such as increasing troop attack power, increasing the number of resources you earn at the end of the turn, restoring lost troops, and more. Each card has a resource cost; when you can't or don't wish to play any more cards, you can then purchase new upgrades and effects, buy a horse from the stable for riding in battle, or train your base stats. Then, it's off to battle. During battle, you capture bases to raise troop morale and get access to valuable healing items, and you can also assign actions to your officers. If you want the strategy element to play a less substantial role, you can play as an officer or vagrant, rather than as a ruler. Doing so strips away some of the strategy and sees you completing assignments for an AI-controlled ruler instead of playing cards and making invasion decisions on your own. You can even customize your own character using clothing and other items you unlock as the campaign progresses. Of course, there are a stupendous number of characters already available to you, which means as with most Warriors games that there are potentially hundreds of hours of gameplay available here. The true replay value doesn't come from the soul-crushing combat, however, but from shuffling officers and messing around with cards, weapon effects, and special skills. Leveling up your character and customizing his or her abilities is--dare we say it--almost enjoyable. If you need help with insomnia, don't count sheep--count slain troops. Unfortunately, developers Koei and Omega Force haven't improved upon Dynasty Warriors 6's lackluster visuals and other technical qualities. There's simply no reason for any game on current systems to look this substandard. Environments are bland and lifeless; water looks awful; and character models, while clearly upgraded from Dynasty Warriors 5 Empires, still look primitive by today's standards. There are hundreds of models on the screen at a time, sure, but these crowds aren't so impressive that you'll overlook the unattractive visuals--or the occasional dips in frame rate when things get extra busy. The horrible sound effects (the grunts of massed hordes as you carve into them are incredibly grating after a short while), laughable voice acting, and generic grinds of guitars make the game sound almost as bad as it looks. Warriors fans get more of what they seem to want with Dynasty Warriors 6 Empires. Some subtle differences distinguish it from previous Empires entries, but this is, more or less, what you'd expect. A second player can join you in split-screen play, and franchise faithful will enjoy unlocking various wallpapers, voice clips, and other goodies. Yet there's no doubt that in spite of the fresh coat of paint the Empire mode offers, chipping it away reveals the same tired, worn-out action that Dynasty Warriors games have embraced for years--and will likely embrace for many more to come."}