{"ref": "https://www.gamespot.com/reviews/samba-de-amigo-review/1900-2589601/", "date": "October 10, 2000", "game_name": "Samba de Amigo", "text": "Samba De Amigo is Sega's attempt to cash in on the music game craze that Konami started back in 1998 with its DJ simulator, BeatMania. Though Konami has taken its sweet time about bringing any of its music and rhythm games - collectively called the Bemani series - to the United States (the company's dancing game, Dance Dance Revolution, is scheduled for a January 2001 release on the PlayStation), Sega has struck the first blow in the ~expensive and completely necessary controller~ department with the Dreamcast port of Samba De Amigo. Samba De Amigo is a maracas simulator. The game tells you exactly how, where, and when to shake your maracas, and provided you shake on beat and in the right location, your score rises appropriately. While you can manipulate the onscreen action with a standard Dreamcast pad, the game truly comes into its own when combined with the appropriate maraca controller, which consists of two maracas and a floor sensor that detects when and where the maracas are shaken. You are told how to manipulate your maracas by a simple onscreen display, which consists of six circles - three on the left, three on the right. The circles are also broken up into low, medium, and high. Blue and red balls shoot out from the middle of your playfield, each destined for one of the six circles. When the ball reaches the circle, you shake one (or both, for extra points) of the maracas on the appropriate side and at the appropriate height. Red balls come out in long strings and command you to shake the maracas as fast as you can in the proper circle. Finally, the game also asks you to strike a pose from time to time by showing you a stick figure with the maracas in two specific locations. You're given a brief period to match the stick figure for extra points. Provided you keep your end of the song on beat, you continue through two songs, and, if you're really good, a special third song. The music in the game is quite amazing. Most of it has a real Latin flair, though some other songs, like Tubthumping and Reel Big Fish's cover of Take On Me, give the game a multigenre touch. The Japanese version of the game was released before Sega could fully acquire the rights to the two Ricky Martin songs, but the US release has both songs (Cup of Life and Livin' La Vida Loca) intact. While they sound close enough to the real thing, it should be noted that neither song is actually performed by Martin. The graphics back up the audio perfectly, and the result is the best-looking music/rhythm game ever released. Behind your circles and balls lies a small world filled with tons of colorful characters, including Amigo, the maracas-shaking, pants-wearing monkey. The scenery changes depending on how well you're doing, and if you lose, the monkey cries. You don't want to make Amigo cry, do you? The Dreamcast release contains a lot of modes that aren't found in the original arcade mode. Aside from the standard arcade and all music (original) modes, there's a challenge mode that gives you tasks that must be completed to unlock some of the more difficult songs. The tasks range from getting a perfect on a specific song to scoring a certain number of points and eventually get maddeningly difficult as you progress through the five different challenge tracks. Also, there's a party mode that contains a few different two-player modes, including a fairly dull battle mode and couples mode, which figures out how often you and your partner hit a note simultaneously and gives you relationship advice based on the number of simultaneous shakes. Finally, Internet mode provides you with online score rankings and downloadable music that adds lots of great old Sega songs (such as music from Afterburner, Outrun, and Nights) to the Samba roster. You don't actually store the music on your VMU - instead, a small (2K) file resides on your VMU and tells the game which extra songs to unlock. Samba De Amigo is one of the best music and rhythm games released thus far, and it's the first such game to hit the United States, making it an excellent entry into the world of music peripherals. The only sticking point is the price. While the game is expected to retail for $39.99, it will not include the maracas so necessary to making the game worthwhile - those must be purchased separately for $79.99 a set. So, if you're serious about Samba (which, after playing it for any length of time, you probably will be), be prepared to drop $200 on your latest addiction."}