{"ref": "https://www.gamespot.com/reviews/battlefield-vietnam-review/1900-6091567/", "date": "March 16, 2004", "game_name": "Battlefield Vietnam", "text": "Battlefield Vietnam is one of the most anticipated games of the year. But the question is, can it emerge from beneath the shadow of its illustrious predecessor, Battlefield 1942, as well as megapopular user-made mods such as Desert Combat? While a jaded gamer might label Battlefield Vietnam nothing more than an elaborate update, that's taking a very cynical and shortsighted view. The truth is that Battlefield Vietnam is more than just a new collection of maps and weapons; it's a superbly designed multiplayer action game that incorporates the lessons learned from 1942 and mates them with better technology. And yet, it must be said that Battlefield Vietnam just doesn't feel as groundbreaking as Battlefield 1942 did for its time, when it successfully combined first-person shooting action with vehicular combat on a relatively large scale. Be that as it may, hardcore Battlefield fans and new players alike will probably agree that Battlefield Vietnam is a great, often thrilling action game. Welcome to the jungle. It's pretty, as well as deadly. For those unfamiliar with the basics of the game, Battlefield Vietnam is a multiplayer-focused shooter that allows you to fight the battles of the Vietnam War against computer-controlled bots or up to 63 other players. In the conquest mode, which is the primary mode of play here just as in Battlefield 1942, players divide up into two teams, one for the US and its Vietnamese allies and the other for the North Vietnamese and its Vietcong allies. You're then dropped into a gigantic map and must battle for strategic control points. In addition to running around on foot with a variety of weapons, you can jump into an assortment of vehicles, including jeeps, tanks, helicopters, jets, and more. Often, multiple players can jump into the same vehicle; for example, one player can pilot the helicopter while two players handle the side-mounted machine guns and two others sit back and shoot out the side with their own weapons. It can make for a wildly exciting experience as the two teams slug it out in a tug-of-war struggle, and a team's fortunes can change in a heartbeat depending on the skill and coordination level between players. The first thing that strikes you about Battlefield Vietnam isn't the graphics; it's the music. From the opening movie to the loading screens, you're immediately exposed to a soundtrack that's packed with the classic Vietnam War protest songs, including Edwin Starr's ~War,~ Creedence Clearwater Revival's ~Fortunate Son,~ The Trashmen's ~Surfin' Bird,~ and others. You may not recognize the names, but you'll definitely recognize the music from countless movies, commercials, and the radio. The soundtrack itself would be worthy of a big-budget Hollywood movie, and it permeates throughout the game. The 14 different scenarios in Battlefield Vietnam are inspired by some of the most famous battles of the war, including the Ia Drang Valley (depicted in the movie We Were Soldiers), Hue during the Tet Offensive, and the Siege of Khe Sanh. There are also lesser-known battles, such as Operation Hastings (an early Marine Corps battle) and Operation Flaming Dart (Air Force bombing raids). The game itself comes with about 12 different maps, because two urban maps--Hue and Quang Tri--are used twice. There are some variations in the recycled versions of those two maps, but it's disappointing whenever developers reuse levels in the same game. Not only does it feel like we're getting less, but it can make for needless confusion in multiplay. In general, though, the levels themselves feature a fine variety of terrain and gameplay styles. For example, Operation Flaming Dart is all about aerial combat, as the two forces start separated by a large body of water. Flaming Dart also requires the US force to destroy three NVA radio towers in order to succeed, which is a nice departure from the standard conquest gameplay mode, where the goal is simply to conquer all the control points. Meanwhile, the Ia Drang level is all about helicopter operations, given that it's inspired by the air cavalry's battle in Vietnam's central highlands. On that map, the US forces start with a single control point surrounded by communist control points and come under withering fire almost immediately. But the US forces have a distant base where they can jump in helicopters and jets to provide tremendous amounts of air support and mobility. Vietnam was not just a jungle war; urban combat is represented by the Hue and Quang Tri maps, and they feel very similar in style to the urban levels in Battlefield 1942. Charlie's trying to seize a control point, but he should have brought some backup. The maps themselves benefit from a greater level of detail not possible in Battlefield 1942. No longer is the terrain wide open and sparely decorated. There's a lot more character to the land, not just in terms of geography, but in vegetation as well. Now there are steep ravines and valleys, dry riverbeds, and hills and small mountains. All of these help to break up the sight lines, giving a much more natural feel to the game. This also prevents snipers from camping on top of the highest peak and dominating from that vantage point, like they tend to do in Battlefield 1942. The terrain is much more of an obstacle in Battlefield Vietnam, but you can use it to your advantage. You can use the lush vegetation to hide from enemy air units or maneuver in the steep terrain where armor and other vehicles can't follow. On the other hand, the environments are immune to the effects of the battle; tank shells and napalm drops do nothing to affect the lush surroundings, which perhaps is predictable but is still somewhat disappointing given the surface level of realism. Nevertheless, it's clear that the levels and graphics in Battlefield Vietnam are much more advanced than they were in Battlefield 1942. Sadly, the same can't be said of the computer-controlled bots, which remain as dumb as they ever were. Simply put, the bots are horrible, even at the toughest artificial intelligence level. Bots don't work as a team properly; they'll run around randomly, they'll jump in vehicles and then do nothing, and occasionally they'll just stand idly by as you shoot them. Bots don't know how to fly helicopters properly; when they're not crashing into the ground, they're hovering back and forth over a single spot, as if on a swing. About the only way to milk any kind of a challenge out of the bots is if you select impossible-level bots with impossible-level odds. Under those odds, the bots will still behave stupidly, but there are so many of them that it doesn't matter because they'll overwhelm you with almost-ridiculous numbers. Granted, the vast majority of players aren't interested in the single-player component of Battlefield Vietnam (nor should they be, with bots like these), but the bots remain a problem if you use them in multiplayer to flesh out the empty spots on a team's roster. Since some other multiplayer-focused action games on the market feature superior bots with almost-human cunning, there seems to be little excuse for the bot behavior in Battlefield Vietnam. The jeep hasn't changed much from Battlefield 1942. The multiplayer server browser derives directly from Battlefield 1942, which is a good thing. It's extremely easy to use, so finding and jumping into a game online requires just a few mouse clicks. There are a number of different game types in Battlefield Vietnam, including evolution (which takes place on two historically-linked maps and the scores from the first match carry over into the second) and capture the flag. However, conquest is by far the most popular game type. The gameplay mechanics themselves have been tweaked, for the better. For example, major bases are much harder for a lone infiltrator to seize; it can take 90 seconds to switch control of their control points. This cuts down immensely on situations where a single player can be sneaking around and suddenly seizes a team's vital control point. However, in another nice twist, multiple teammates can seize a control point faster. So now the emphasis is on helicopters to drop a team behind enemy lines. If two or three teammates get to a control point, the seizure process goes two to three times faster. Like Battlefield 1942, Battlefield Vietnam still suffers from some clumsiness when considered strictly as a first-person shooter; it just doesn't look as smooth or feel as crisp as other games of this type do. However, the saving grace for both games is that you can jump into a huge assortment of vehicles, which are generally as fun to drive in Battlefield Vietnam as they were in Battlefield 1942. As expected, the vehicles in Battlefield Vietnam transform the game. The American jeep is back, but this time the passengers can shoot from the shotgun position for drive-by shootings, and the jeep has a powerful missile launcher for a third passenger. The tanks are bigger and more powerful, but they play exactly the same as Battlefield 1942 tanks. There are a few notable additions, including the Vespa scooter, which can zip around the urban levels, and the BTR-60, an armored personnel carrier in which the passengers can look and shoot out of the sides. The US also gets a couple of patrol boats for river operations, and a number of vehicles are also amphibious, which allows them to negotiate water obstacles. But many of the ground vehicles aren't that much different from those in Battlefield 1942. Much like in historical reality, the addition of helicopters to the battlefield significantly changes the way Battlefield Vietnam is played. In fact, the absence of helicopters on certain levels is sorely noticeable because the game often devolves into a drawn-out slugfest between ground forces. Helicopters combine rapid transport capabilities with a mobile weapons platform capable of devastating air support. Unlike planes, helicopters can loiter close to the ground and hover in place to provide fire support. A couple of Hueys can deliver a squad of infantry deep behind enemy lines to secure control points. The downside to helicopters is that they are extremely tricky to operate, and it takes considerable practice before you can fly one without crashing. And while they're rugged against infantry weapons, helicopters are extremely vulnerable to antiaircraft cannons and missiles, not to mention enemy helicopters and fighters, so they're not unstoppable. Flying the Cobra can be difficult, especially with an enemy chopper flying right at you. The jet engine has also had a huge effect on the aircraft in Battlefield Vietnam. The US has the F-4 Phantom and the A-7 Corsair, both of which are capable of devastating ground attacks. The Phantom, in particular, has the dreaded napalm bomb that can carpet a wide area. However, the speed of these jets can often be a detriment because of the amount of fog in the game--the fog and limited draw-in distance means it's very difficult to identify targets on the ground before overshooting them. And though the maps are large, they're not gigantic, and it's very easy to zoom out of bounds, triggering the desertion counter. The communists, meanwhile, get the MiG-17 and the MiG-21. Being smaller, lighter aircraft, they're also much more nimble in the air, and their tight turning radiuses are perfect for dogfights. Sadly, the same can't be said of the computer-controlled bots, which remain as dumb as they ever were. Simply put, the bots are horrible, even at the toughest artificial intelligence level. Bots don't work as a team properly; they'll run around randomly, they'll jump in vehicles and then do nothing, and occasionally they'll just stand idly by as you shoot them. Bots don't know how to fly helicopters properly; when they're not crashing into the ground, they're hovering back and forth over a single spot, as if on a swing. About the only way to milk any kind of a challenge out of the bots is if you select impossible-level bots with impossible-level odds. Under those odds, the bots will still behave stupidly, but there are so many of them that it doesn't matter because they'll overwhelm you with almost-ridiculous numbers. Granted, the vast majority of players aren't interested in the single-player component of Battlefield Vietnam (nor should they be, with bots like these), but the bots remain a problem if you use them in multiplayer to flesh out the empty spots on a team's roster. Since some other multiplayer-focused action games on the market feature superior bots with almost-human cunning, there seems to be little excuse for the bot behavior in Battlefield Vietnam. The jeep hasn't changed much from Battlefield 1942. The multiplayer server browser derives directly from Battlefield 1942, which is a good thing. It's extremely easy to use, so finding and jumping into a game online requires just a few mouse clicks. There are a number of different game types in Battlefield Vietnam, including evolution (which takes place on two historically-linked maps and the scores from the first match carry over into the second) and capture the flag. However, conquest is by far the most popular game type. The gameplay mechanics themselves have been tweaked, for the better. For example, major bases are much harder for a lone infiltrator to seize; it can take 90 seconds to switch control of their control points. This cuts down immensely on situations where a single player can be sneaking around and suddenly seizes a team's vital control point. However, in another nice twist, multiple teammates can seize a control point faster. So now the emphasis is on helicopters to drop a team behind enemy lines. If two or three teammates get to a control point, the seizure process goes two to three times faster. Like Battlefield 1942, Battlefield Vietnam still suffers from some clumsiness when considered strictly as a first-person shooter; it just doesn't look as smooth or feel as crisp as other games of this type do. However, the saving grace for both games is that you can jump into a huge assortment of vehicles, which are generally as fun to drive in Battlefield Vietnam as they were in Battlefield 1942. As expected, the vehicles in Battlefield Vietnam transform the game. The American jeep is back, but this time the passengers can shoot from the shotgun position for drive-by shootings, and the jeep has a powerful missile launcher for a third passenger. The tanks are bigger and more powerful, but they play exactly the same as Battlefield 1942 tanks. There are a few notable additions, including the Vespa scooter, which can zip around the urban levels, and the BTR-60, an armored personnel carrier in which the passengers can look and shoot out of the sides. The US also gets a couple of patrol boats for river operations, and a number of vehicles are also amphibious, which allows them to negotiate water obstacles. But many of the ground vehicles aren't that much different from those in Battlefield 1942. Much like in historical reality, the addition of helicopters to the battlefield significantly changes the way Battlefield Vietnam is played. In fact, the absence of helicopters on certain levels is sorely noticeable because the game often devolves into a drawn-out slugfest between ground forces. Helicopters combine rapid transport capabilities with a mobile weapons platform capable of devastating air support. Unlike planes, helicopters can loiter close to the ground and hover in place to provide fire support. A couple of Hueys can deliver a squad of infantry deep behind enemy lines to secure control points. The downside to helicopters is that they are extremely tricky to operate, and it takes considerable practice before you can fly one without crashing. And while they're rugged against infantry weapons, helicopters are extremely vulnerable to antiaircraft cannons and missiles, not to mention enemy helicopters and fighters, so they're not unstoppable. Flying the Cobra can be difficult, especially with an enemy chopper flying right at you. The jet engine has also had a huge effect on the aircraft in Battlefield Vietnam. The US has the F-4 Phantom and the A-7 Corsair, both of which are capable of devastating ground attacks. The Phantom, in particular, has the dreaded napalm bomb that can carpet a wide area. However, the speed of these jets can often be a detriment because of the amount of fog in the game--the fog and limited draw-in distance means it's very difficult to identify targets on the ground before overshooting them. And though the maps are large, they're not gigantic, and it's very easy to zoom out of bounds, triggering the desertion counter. The communists, meanwhile, get the MiG-17 and the MiG-21. Being smaller, lighter aircraft, they're also much more nimble in the air, and their tight turning radiuses are perfect for dogfights. It should definitely be noted that on maps with both helicopters and fighters, there is often absolute chaos in the skies. Fighters attempt to shoot down enemy fighters and helicopters, while attack fighters seek out targets to bomb. Meanwhile, helicopters are busy trying to provide ground support, deliver infantry, or shoot down enemy helicopters (or even fighters) with their air-to-air missiles. Ground forces are often shooting rifles, flak cannons, and missiles into the air, trying to shoot down fighters. And to top it all off, Americans can pump music from the helicopters,  la the attack scene in the movie Apocalypse Now. Whether you're involved in the aerial activities or simply watching from the ground, it's almost jaw-dropping to see air combat fleshed out to a degree unimaginable in Battlefield 1942. There's almost a surreal sense of cinematic wonder when you're running around in the jungle and all of a sudden hear Wagner's ~Ride of the Valkyries~ overhead. (If classical music isn't your taste, you can also select any of the songs from the soundtrack.) The M60 is one of the more fearsome weapons in the game. The air vehicles provide some of the best cinematic moments in the game. There's nothing quite like standing in the jungle and looking up through the lush canopy and seeing F-4s scream overhead to drop napalm on the enemy, or running toward an enemy base and seeing a helicopter lurch into the air and dip its nose at you like a bird of prey eyeing dinner. At that moment you feel helpless, but that won't stop you from unloading everything you have at the helicopter and watching chunks of metal fly off the bottom as it passes overhead. The assault rifles and machine guns of the Vietnam era have increased the lethality of infantry considerably in this game relative to its predecessor. The M60, in particular, is almost an overpowering weapon, capable of churning out high rates of fire with a large belt of ammunition and laying down fire over long ranges. The North Vietnamese have a number of cool weapons as well. In addition to Kalashnikov assault rifles and rocket-propelled grenades, they get the SA-7 antiaircraft missile (useful for shooting down American helicopters and jets), as well as caltrops (small, spiked antipersonnel devices that you scatter on the ground as an obstacle). Little things like weapon animations are done particularly well; the parts on your rifle will actually jiggle as you run around. And reloading any of the assault rifles is worth it just for the animation alone; for instance, with the M16, you'll slap in a new magazine and pull back the charging slide with flair. The sound effects are extremely well done. The background noises almost lull you, what with birds chirping in the air and other such ambient noises. Then the sound of gunfire erupts around you, and you can hear bullets whizzing by the tall blades of grass. Bullets literally sound like they're zinging by your head. Weapon sounds are modeled accurately and have their distinctive sounds, from the short bark of the M16 to the crack of the sniper rifle. There's even radio chatter when you strap into a helicopter or fighter, and a number of vehicles have speakers that can boom out music from the soundtrack. Once again, it's almost surreal to be in the middle of battle and then hear ~Surfin' Bird~ playing in the distance. All this graphical detail in the terrain, weapons, vehicles, and soldiers comes at a price, though. Battlefield Vietnam will tax the most powerful systems, particularly in terms of memory. Load times are excruciatingly long, especially if you raise the graphical detail to maximum. To illustrate, the game plays one of the tracks from the soundtrack as you load, and you can usually get two-thirds of the way through the song by the time the level finishes loading. And we encountered slow level loads on a machine with the recommended amount of 512MB of RAM and a high-end 128MB video card. Loading times were only marginally faster on a machine with a gigabyte of memory and a 256MB video card. The ZSU 57/2 is a powerful antiaircraft weapon. Battlefield Vietnam packs more dramatic moments in its gameplay than most any multiplayer-focused action game in the past few years. Strictly compared against its 2-year-old predecessor, it's a better-designed game, featuring better technology--as you'd probably expect. And it's a better executed game; Battlefield Vietnam doesn't ship with any of the game-breaking bugs and flaws that Battlefield 1942 shipped with, which were fortunately addressed by postrelease patches. Yet, even when Battlefield fans factor in the new vehicles--namely, the helicopters--that still won't change the sense that they've played this game before. Perhaps it's because so many of us have played Battlefield 1942 for countless hours, but the fact remains that the thrill of discovery is gone. Make no mistake, though: Battlefield Vietnam is a great, undeniably fun game. It should definitely be noted that on maps with both helicopters and fighters, there is often absolute chaos in the skies. Fighters attempt to shoot down enemy fighters and helicopters, while attack fighters seek out targets to bomb. Meanwhile, helicopters are busy trying to provide ground support, deliver infantry, or shoot down enemy helicopters (or even fighters) with their air-to-air missiles. Ground forces are often shooting rifles, flak cannons, and missiles into the air, trying to shoot down fighters. And to top it all off, Americans can pump music from the helicopters,  la the attack scene in the movie Apocalypse Now. Whether you're involved in the aerial activities or simply watching from the ground, it's almost jaw-dropping to see air combat fleshed out to a degree unimaginable in Battlefield 1942. There's almost a surreal sense of cinematic wonder when you're running around in the jungle and all of a sudden hear Wagner's ~Ride of the Valkyries~ overhead. (If classical music isn't your taste, you can also select any of the songs from the soundtrack.) The M60 is one of the more fearsome weapons in the game. The air vehicles provide some of the best cinematic moments in the game. There's nothing quite like standing in the jungle and looking up through the lush canopy and seeing F-4s scream overhead to drop napalm on the enemy, or running toward an enemy base and seeing a helicopter lurch into the air and dip its nose at you like a bird of prey eyeing dinner. At that moment you feel helpless, but that won't stop you from unloading everything you have at the helicopter and watching chunks of metal fly off the bottom as it passes overhead. The assault rifles and machine guns of the Vietnam era have increased the lethality of infantry considerably in this game relative to its predecessor. The M60, in particular, is almost an overpowering weapon, capable of churning out high rates of fire with a large belt of ammunition and laying down fire over long ranges. The North Vietnamese have a number of cool weapons as well. In addition to Kalashnikov assault rifles and rocket-propelled grenades, they get the SA-7 antiaircraft missile (useful for shooting down American helicopters and jets), as well as caltrops (small, spiked antipersonnel devices that you scatter on the ground as an obstacle). Little things like weapon animations are done particularly well; the parts on your rifle will actually jiggle as you run around. And reloading any of the assault rifles is worth it just for the animation alone; for instance, with the M16, you'll slap in a new magazine and pull back the charging slide with flair. The sound effects are extremely well done. The background noises almost lull you, what with birds chirping in the air and other such ambient noises. Then the sound of gunfire erupts around you, and you can hear bullets whizzing by the tall blades of grass. Bullets literally sound like they're zinging by your head. Weapon sounds are modeled accurately and have their distinctive sounds, from the short bark of the M16 to the crack of the sniper rifle. There's even radio chatter when you strap into a helicopter or fighter, and a number of vehicles have speakers that can boom out music from the soundtrack. Once again, it's almost surreal to be in the middle of battle and then hear ~Surfin' Bird~ playing in the distance. All this graphical detail in the terrain, weapons, vehicles, and soldiers comes at a price, though. Battlefield Vietnam will tax the most powerful systems, particularly in terms of memory. Load times are excruciatingly long, especially if you raise the graphical detail to maximum. To illustrate, the game plays one of the tracks from the soundtrack as you load, and you can usually get two-thirds of the way through the song by the time the level finishes loading. And we encountered slow level loads on a machine with the recommended amount of 512MB of RAM and a high-end 128MB video card. Loading times were only marginally faster on a machine with a gigabyte of memory and a 256MB video card. The ZSU 57/2 is a powerful antiaircraft weapon. Battlefield Vietnam packs more dramatic moments in its gameplay than most any multiplayer-focused action game in the past few years. Strictly compared against its 2-year-old predecessor, it's a better-designed game, featuring better technology--as you'd probably expect. And it's a better executed game; Battlefield Vietnam doesn't ship with any of the game-breaking bugs and flaws that Battlefield 1942 shipped with, which were fortunately addressed by postrelease patches. Yet, even when Battlefield fans factor in the new vehicles--namely, the helicopters--that still won't change the sense that they've played this game before. Perhaps it's because so many of us have played Battlefield 1942 for countless hours, but the fact remains that the thrill of discovery is gone. Make no mistake, though: Battlefield Vietnam is a great, undeniably fun game."}