{"ref": "https://www.gamespot.com/reviews/seek-and-destroy-review/1900-6025393/", "date": "April 21, 2003", "game_name": "Seek and Destroy", "text": "Loads of tanks, big weapons of mass destruction, and the ability to fight the Axis of Evil--these are the features boasted by Seek and Destroy, a tank combat game developed by Takara and released by Conspiracy Entertainment. But despite these claims, and the numerous appearances of the American flag on the box, the game has absolutely nothing to do with real-life military situations, and instead revolves around fictional empires and improbable weapons technology. Seek and Destroy's biggest crime, however, is not its deceptive advertising, but rather its uninventive gameplay and lackluster production values. Five years ago, Seek and Destroy would have been a more impressive game. Seek and Destroy's story goes something like this: In the year 210, CQ calendar, an anonymously evil empire known only as Q-stein has launched a campaign to conquer the entire world. You, as a member of the Proton Empire, must help organize the reeling and desperate Proton armies in an attempt to address the impending Q-stein threat. To do so, you'll join a group of tanks and set out on a series of missions in and around the Proton Empire. Many of these missions are of the basic ~destroy all the bad guys~ ilk, though some do require a bit more strategy and teamwork. The missions manage to stay reasonably interesting and hold your interest as you're playing, but the setups and progression of the story do not. Other characters occupying tanks, many of whom you have never encountered before and never encounter again, arbitrarily throw your mission assignments at you. The mission briefings themselves are doubly perplexing, tossing out even more previously unmentioned character names, as well as meaningless location designations without so much as a hint of explanation of what's going on. These irritating methods of plot setup essentially wreck the story mode. Seek and Destroy is very much on the arcade side of things. Boss characters appear in elaborate, exaggerated vehicles with bizarre weapons like giant tires that flatten you, and your own weapons are equally over the top--flamethrowers, lasers, and ridiculous bombs are just a few examples. Unfortunately, none of these is particularly satisfying to use, making the action seem flat and repetitive. However, the game isn't all bad, and it actually does contain one meaningful feature--its multiplayer component. Labeled the battle mode, the multiplayer component allows two players to choose from any of the tanks in the game and then take each other on in one of several different environments. Players can also upgrade their tanks with more-powerful guns and missiles, different forms of camouflage, and better engines, among other things. However, while certainly amusing, the multiplayer mode still isn't enough to make the game recommendable. Considering you are limited to two players at a time, it automatically pales in comparison with practically every other worthwhile multiplayer vehicle combat game available. With its $10 price tag, Seek and Destroy could prove a useful distraction for kids. Seek and Destroy pales even further where graphics and sound are concerned. Each tank is pretty similar looking, with only some minute differences in design and color. The environments are all straight out of 1995, with badly pixelated buildings and absolutely horrid-looking ground textures. Equally painful is the game's camera, which absolutely loves to swing around and clip into nearby buildings when you get too close. There isn't much to talk about when it comes to Seek and Destroy's audio, either. Most of the engine and explosion effects are decent enough, and the game's scant selection of musical tracks present the right atmosphere for military combat, but the game has absolutely no audible dialogue or anything else to provide any additional quality or depth beyond the absolute bare minimum. Five years ago, Seek and Destroy would have been a more impressive game. Its inelaborate gameplay and terribly dated graphics and sound absolutely scream for it to be a PlayStation game, yet somehow Seek and Destroy ended up on the PS2. Considering the already-stiff competition for vehicular combat on Sony's current hardware, there's really no room for Seek and Destroy in most players' libraries. Still, with its $10 price tag, Seek and Destroy could prove to be a useful distraction for kids looking for a simple game with a lot of stuff blowing up. For more fastidious gamers, however, Seek and Destroy is of no use, and is best left at the bottom of the bargain bin."}