{"ref": "https://www.gamespot.com/reviews/fat-princess-review/1900-6214698/", "date": "August 3, 2009", "game_name": "Fat Princess", "text": "Princesses have been known to fear peas and kiss toads, but little has been written about their insatiable love for fine pastries. In Fat Princess, the young heiress' vice is the moist center and gooey frosting of a well-made cake, and she will feast on this decadent dessert until she becomes a bloated ball of royalty. In this oddball take on the classic capture-the-flag formula, two teams try valiantly to rescue their princess from the other team's castle while cramming delectable delights down the gaping maw of the queen-in-waiting. The unpredictable and inherently goofy battles do a fine job of mixing humor with strategy, creating an often hilarious experience as you strive to become the shining knight for an overweight damsel in distress. There are a few blotches in this fairy tale landscape, though. Network problems and mindless AI limit the goofy fun, and matches sometimes linger in a stalemate, but the silly joy of turning warriors into feathered chickens and flinging royal ladies in a rickety catapult make this a chaotic and entertaining online competition. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Fat Princess Video Review There are four different modes in Fat Princess, but the two most enjoyable offerings involve rescuing (or stealing) a princess from the other team's castle and carrying her safely into your own fortified keep. It's much easier to carry a thin princess than a plump one, so players must cram slices of tasty cake into their prisoner's eager mouth to fatten her up. Don't feel bad about force-feeding a helpless princess; she craves the cake. She loses weight over time, and when she gets peckish, she will bellow ~Hungry!~ so you know when to fill her up again. The other two modes get rid of the princess entirely. Team Deathmatch and Invasion (where you must capture and hold outposts) dispose of much of the strategy and unpredictability of the princess-themed matches, but theyre shallow and lose their appeal quickly. There are six classes in Fat Princess, with different abilities at their disposal and different roles to play. You start each life as the villager, and though he is short on health, he is by far the fastest character and can slap objects out of the other team's hands. It may not sound like much, but when the item in question is the princess, you can snatch victory from the hands of defeat. You change into any of the other five classes by donning their respective hats which come from dispensers in your castle or from fallen soldiers on the battlefield. The warrior is armed with a gleaming sword and can cleave through enemies with ease. On the other side of the spectrum is the priest, whose spells can heal allies individually or within an area of effect. If you prefer to fight from afar, the mage and ranger have no problem picking off foes from a distance. The mage has a fire wand that can light the other team members on fire, slowly draining them of life, whereas the ranger shoots arrows and stays far away from battle if he knows what's good for him. Mixing these different classes into a well-organized army is hugely satisfying as you take advantage of each unit's strengths to make a terrifying rescue unit that will not be denied its princess. Nothing like getting an arrow right in the face. The most indispensable of the classes is the worker. He may not be much in battle, but he is in charge of resource gathering. You can chop down trees and bust rocks into tiny pieces, which give you the raw materials to upgrade the classes. Upgrading gives each class new weapons, and you can switch between the old and the new with the push of a button. As an upgraded warrior, you have a dashing attack that can quickly dispose of even the heartiest adversaries. The worker throws miniature bombs that can damage a group of attackers and even push enemies off a cliff. You freeze enemies in place with the mage, which is not only effective, but also really annoying for the player who's put on ice. It's possible to abuse this spell, though, continually casting an area-of-effect attack that leaves your opponents defenseless. As the priest, you use your healing powers for evil, siphoning the hearts from the other team while you fill your own tainted life bar. The ranger gets a slow but powerful shotgun, but it's not nearly as useful as the other weapons. It's fun to play as every character, but the mage is rather cheap and the ranger just isn't strong enough. You can also use the raw materials to build siege weapons as the worker. On designated parts of the map, you can erect ladders, trampolines, and bridges, which make it much easier to traverse the land and break into the other team's castle. You need to build castle doors as well, so that the other team doesn't just waltz right into your home. In some maps, you can build a catapult within your castle, allowing you to travel all the way to the other team's base in one quick shot. Of course, all your hard work can be exploited by the other team as well. There is nothing worse than seeing your opponents take off with your prisoner in the catapult you spent so much time making. The siege weapons help keep Fat Princess fast and unpredictable because you're never quite sure where the attacks are going to come from next. There are nine maps in Fat Princess. Some of them, such as Black Forest and The Great Gorge, are fantastic. Loaded with secret passages and catapults, the best maps force you to constantly be on guard lest your enemies sneak into your base and abscond with your hostage. This unpredictability is what makes Fat Princess so exciting, but a few of the maps don't keep up this intense pace. Sugar Cove, for instance, replaces the castles with pirate ships, but there are few options for attack so the battles tend to focus on the same points with little dynamic strategy. Once both teams upgrade their units, there isn't anything to do but rush into battle and hope you can steal the princess from under the other team's nose. On the lesser maps, matches can go for on upward of 30 minutes. There isn't a way to wrest control from the other team, so you're trapped in a tug of war without any discernable progress. This issue can be modified by limiting how many players are in a match, making these maps more tolerable. When you cut the cap from the 32-player maximum to 20 players, you get more thoughtful battles, which make every mistake more glaring and every success more thrilling. Chickens can't fly on their own, but a catapult can fix that. Unfortunately, it's not always possible to enjoy the intense online offerings. Fat Princess has a lot of problems when connecting to other users, often hanging on the loading screen. Fortunately, playing with friends works better than the matchmaking system, but it can still take a few tries. Once connected, there is some lag and a few online glitches, but the experience is generally smooth. If you can't get enough players together, the other spots are filled with AI bots, but these are some of the dumbest characters around. They will charge headlong into lava, march right by a princess being kidnapped, and mine rock even when you have way too much. It's still fun beating on a group of dumb peasants, but it's a lot more fun playing with a bunch of friends, preferably with headsets. The goofy situations and ridiculous premise do a good job of making this game fun, even though it has a few problems. The overly violent combat is a great contrast to the cartoony visuals. Enemies burst in gooey red chunks when you kill them, painting the cheery landscape with pools of blood. And even though matches sometimes grind to a stalemate, hardly a minute goes by without something crazy and hilarious happening. Magic potions turn everyone nearby into chickens, including yourself; giant bombs destroy walls or a small army; villagers dance tauntingly out of reach of angry warriors, distracting them from their real duties; and all the while, the demure princess demands more cake. Fat Princess has a few balancing issues and online problems, but as long as you have friends to play with and a penchant for gleefully bloody competition, it's a lot of fun."}