{"ref": "https://www.gamespot.com/reviews/nba-2k10-review/1900-6233182/", "date": "October 14, 2009", "game_name": "NBA 2K10", "text": "While you can make the case that fundamentally sound players like Tim Duncan win championships, its the high-flying antics of players such as Andre Igoudala and Ty Thomas that bring fans out of their seats. NBA 2K10 captures the excitement of these breathtaking dunks and acrobatic layups, transforming a typical NBA team into an old-school ABA club that is more intent on wowing the crowd than buckling down to play solid defense. The frenetic pace makes games fast and exhilarating, letting players show off their agility every time they get the ball back. This means offensive strategies, such as setting screens or working the ball in the low block, are largely ignored as guards constantly drive the lane. Though this isn't a realistic representation of the actual sport, it is entertaining. Unfortunately, a number of bugs and an inconsistent grading system in the new My Player mode put a damper on the fun, and a lack of depth limits the longevity. Despite the problems, NBA 2K10 provides a good time for those who want to re-create the most exciting moments of the real thing. The biggest addition to this year's game is the My Player mode, which lets you create your own persona from scratch and attempt to make it big in the NBA. The creation tools are in-depth, letting you tweak not only standard options, such as your position and height, but also more specific traits, such as what tattoo you have on your right forearm or what your fallaway jumper looks like. Once you decide on the perfect representation of your inner NBA player, you make your way to training camp and hope you can worm you way onto a team. Playing through Summer League is a vastly different experience from playing in a real NBA game--the crowd is almost nonexistent and the other players are borderline NBA talent struggling to make a team. The wins and losses also don't matter nearly as much as they would in a real game. Chances are you won't be picked up by a team based on your play in the Summer League, so you have to play a number of games in the NBA Development League before you get a shot at the big time. It's a long process to finally make your way to the big league, but it's well worth the effort when you finally step on the court in front of thousands of screaming fans. In the My Player mode, you only control your created player and are rated on your effectiveness as a teammate. There are obvious ways to earn a good grade, such as dishing a beautiful pass to an open man under the basket or blocking a shot on the defensive end. However, the majority of your grading comes in less obvious situations. For instance, you get a positive grade for successfully double-teaming the man with the ball or filling the lane perfectly on a fast break opportunity. These small details force you to play the game as if it were real, instead of freelancing on your own and hoping your teammates will cover for your mistakes. Combined with various goals you have to accomplish in each game (such as holding your man to under 10 points or shooting above 40 percent from three-point land), NBA 2K10 does a good job of making you feel like a player gunning for a roster spot. It's pretty easy being a coach when the only strategy is to drive to the hole. However, there is a lot of inconsistency in the grading system. Every individual stat is rewarded, except for the most important of all--scoring. The only time you receive a positive mark here is if you take a ~good shot,~ but just making a basket doesn't help you improve at all. It's also impossible to know what the game will deem a ~good~ shot and what it will decide is ~bad.~ Shooting from the paint in a one-on-one, fast break situation sometimes results in you being penalized for taking a bad shot. This problem also crops up in buzzer-beater situations, and it's pretty annoying to be punished for taking a long three as the horn sounds. Similar issues are prevalent while passing as well--it's unclear what the game considers a good or bad pass. On the defensive end, you are disciplined every time your man scores, even if you were playing solid help defense. On a two-on-one situation, it's fundamental basketball to stop the man with the ball, but if you play like real-life coaches teach in My Player mode, you won't get a high grade. These inconsistencies kill much of the realism of the mode, making you spend more time thinking about what the game wants rather than using your own intuition. Once you ditch your created character and play as real NBA stars, things get a little bit more exciting. It doesn't matter how you play in Franchise mode--just whether you're ahead when the final buzzer sounds. The on-court action is extremely fast-paced, looking more like those Mike D'Antoni ~Seven seconds or less~ Suns teams than Pat Riley's glacial Heat teams. If you have a point guard with even a modicum of speed, you will be able to get into the paint just about every time down the floor with little help from your teammates. Although defenders can lock on to their man, it's still easy to blow by them by moving laterally a few steps before you slam on the turbo and break an ankle or two on your way to the hoop. If the defense sends another man to slow you down, you can quickly pass to the wide-open teammate, who will happily show off his own dunking prowess. The ease with which you can get into the paint is mitigated by how often you blow point-blank shots. All too often, you'll find yourself under the hoop all alone, only to watch your shot bounce embarrassingly off the rim and into a defender's happy hands. If you tire of living in the paint, you can slow down the pace and call offensive plays to mimic how real-life basketball teams score. By tapping the D pad, you bring up a few different plays and can scroll through more of them until you find something you like. Each team's playbook is diverse and features many ways to either get your best player open or use him as a decoy while your three-point specialist sneaks to the corner. However, it's cumbersome to call a play, which means you will often leave yourself vulnerable to a steal while you try to figure out the best play for the job. Because of the clunky play-calling interface, it's a better tactic to ignore strategy and make your way to the hoop. Thankfully, your teammates are smart enough to move and get open even if you don't call anything specific. Still, it's disappointing that strategic play is so undermined in NBA 2K10, and this limits the game's long-term appeal. Lack of strategic depth isn't the only problem with NBA 2K10. There are a number of bugs that inhibit the game's fun. The most pressing issue is a choppy frame rate. This is especially noticeable during the My Player mode or when an arena is particularly raucous during a normal game, and it makes pulling off precise moves very difficult. It's all too easy to pass to the wrong man or mistime your shot when the frame rate is stuttering, and it happens often enough that it becomes a problem. Furthermore, the artificial intelligence has a number of issues. A few of these glitches, such as players mistakenly stepping into a backcourt violation or refs holding on to the ball for too long between plays, occur enough to disrupt the pace of the action. Thankfully, online play works pretty well. Though the action is a bit jittery, it's not a huge problem, and the fast action translates really well against human opponents. Keeping your opponent out of the paint is nearly impossible, but working together with a few friends is a blast. The three-point-shooting contest is only fun until you inexplicably lose to Steve Blake. 2009's crop of NBA video games offers substantial diversity, and NBA 2K10 is a very different experience from NBA Live 10. The emphasis is placed firmly on speed and explosiveness, creating an upbeat tempo that is fast and exciting. Strategy is less important because of the juiced-up action, though, so more thoughtful players should turn to NBA Live 10 for their basketball fix. However, if you love hanging around the hoop, NBA 2K10 is a lot of fun. Despite a few bugs and grading inconsistencies, it's easy to get lost in the in-depth My Player mode or to have an exciting online game with a group of lane-driving buddies. Once you ditch your created character and play as real NBA stars, things get a little bit more exciting. It doesn't matter how you play in Franchise mode--just whether you're ahead when the final buzzer sounds. The on-court action is extremely fast-paced, looking more like those Mike D'Antoni ~Seven seconds or less~ Suns teams than Pat Riley's glacial Heat teams. If you have a point guard with even a modicum of speed, you will be able to get into the paint just about every time down the floor with little help from your teammates. Although defenders can lock on to their man, it's still easy to blow by them by moving laterally a few steps before you slam on the turbo and break an ankle or two on your way to the hoop. If the defense sends another man to slow you down, you can quickly pass to the wide-open teammate, who will happily show off his own dunking prowess. The ease with which you can get into the paint is mitigated by how often you blow point-blank shots. All too often, you'll find yourself under the hoop all alone, only to watch your shot bounce embarrassingly off the rim and into a defender's happy hands. If you tire of living in the paint, you can slow down the pace and call offensive plays to mimic how real-life basketball teams score. By tapping the D pad, you bring up a few different plays and can scroll through more of them until you find something you like. Each team's playbook is diverse and features many ways to either get your best player open or use him as a decoy while your three-point specialist sneaks to the corner. However, it's cumbersome to call a play, which means you will often leave yourself vulnerable to a steal while you try to figure out the best play for the job. Because of the clunky play-calling interface, it's a better tactic to ignore strategy and make your way to the hoop. Thankfully, your teammates are smart enough to move and get open even if you don't call anything specific. Still, it's disappointing that strategic play is so undermined in NBA 2K10, and this limits the game's long-term appeal. Lack of strategic depth isn't the only problem with NBA 2K10. There are a number of bugs that inhibit the game's fun. The most pressing issue is a choppy frame rate. This is especially noticeable during the My Player mode or when an arena is particularly raucous during a normal game, and it makes pulling off precise moves very difficult. It's all too easy to pass to the wrong man or mistime your shot when the frame rate is stuttering, and it happens often enough that it becomes a problem. Furthermore, the artificial intelligence has a number of issues. A few of these glitches, such as players mistakenly stepping into a backcourt violation or refs holding on to the ball for too long between plays, occur enough to disrupt the pace of the action. Thankfully, online play works pretty well. Though the action is a bit jittery, it's not a huge problem, and the fast action translates really well against human opponents. Keeping your opponent out of the paint is nearly impossible, but working together with a few friends is a blast. The three-point-shooting contest is only fun until you inexplicably lose to Steve Blake. 2009's crop of NBA video games offers substantial diversity, and NBA 2K10 is a very different experience from NBA Live 10. The emphasis is placed firmly on speed and explosiveness, creating an upbeat tempo that is fast and exciting. Strategy is less important because of the juiced-up action, though, so more thoughtful players should turn to NBA Live 10 for their basketball fix. However, if you love hanging around the hoop, NBA 2K10 is a lot of fun. Despite a few bugs and grading inconsistencies, it's easy to get lost in the in-depth My Player mode or to have an exciting online game with a group of lane-driving buddies."}