{"ref": "https://www.gamespot.com/reviews/enemy-front-review/1900-6415792/", "date": "June 17, 2014", "game_name": "Enemy Front", "text": "Enemy Front's loading screens depict fictionalized, up-close, and chaotic moments from various battles of World War II. As the camera slowly flies around these scenes frozen in time, you soak in the mayhem: a swarm of Nazis in aggressive poses, gunfire and muzzle flashes filling the screen, and emotional civilians running for cover. You're given the impression that Enemy Front's gameplay will let you experience these dynamic moments. Yet this is a glamorized, false impression, which is all the more unfortunate given that it has been a while since we've had a notable WWII first-person shooter (not counting Wolfenstein: The New Order). It's a bad sign when loading screens are the most eye-catching parts of a game.At first, it's easy to go along with the premise of playing an American-journalist-turned-freedom-fighter named Robert Hawkins. He's a one-man army for only a handful of missions; the rest of the time, he's either partnered with an operative or part of a large squad. And while Enemy Front follows the location-hopping flow common in many shooters, Hawkins' European tour is a believable one because it doesn't shoehorn missions in Italy, North Africa, or anywhere east of Poland. One notable setting is a colorful, sun-drenched French countryside that echoes the opening scene from Inglourious Basterds. Given that he's a reporter, it's puzzling and laughable that the delivery of Hawkins' radio-broadcasted motivational speeches during the Warsaw Uprising is painfully flat. This poor presentation is a missed opportunity that's meant to complement the story's nonlinear structure, which, by the way, could have benefited from further exposition and context for those unfamiliar with the uprising. Moreover, Hawkins' character development feels forced; he starts as an opportunistic, news-hungry reporter on the front lines and slowly realizes there are greater goals in this war than the next big scoop. When you have something as clear-cut as a tyrannical occupation, it's hard to believe Hawkins couldn't empathize with the resistance movement right from the start.This is a first-person shooter set in Europe during World War II, so you get to kill lots and lots of Nazis. The anticipation of killing more Nazis in subsequent chapters is one of the very few factors motivating you to keep playing Enemy Front. The most satisfying kills involve the familiar FPS tactics: killing two foes with a single bullet, banking a grenade off a wall, and pulling off multiple kills with an explosive barrel. Developer City Interactive also assumes you have some interest in playing as a sniper, since Enemy Front uses the exact same aiming system as the developer's Sniper: Ghost Warrior series, so much so that this game could have easily been rebranded as a Ghost Warrior spin-off. Despite the game's ~play as you like~ marketing, using the sniper is almost always the best approach.It takes little time to be convinced that City Interactive wanted to branch out beyond the orderly objectives and methodical linearity that define Sniper: Ghost Warrior. Enemy Front's early chapters provide scant glimpses of the more ambitious ideas the studio was going for. The ability to pick a mission of your choosing made me recall the hub design of the 2009 version of Wolfenstein. A few chapters later, you have the option to send a truck downhill toward an unsuspecting squad of Nazis. These unconventional sections are Enemy Front's most intriguing features, of which there are very few.The wide-linear design of Enemy Front might feel inspired by Crysis 2 and Dishonored, yet its levels do not encourage the same degree of stimulating improvisation due to the lack of unpredictable enemy behavior. What made dying fun in Crysis 2 was that you got to try a different strategy with each retry, resulting in new enemy reactions each time. You are nearly deprived of that feeling in Enemy Front. Because of the game's poorly laid checkpoints, dying elicits a sense of frustration and boredom at the prospect of having to retread over half a mile's worth of leveled French villages. The thought of having to kill the same 20-plus Nazis a second or third time was so unappealing that I felt no guilt running past them after subsequent respawns. This says a lot since these aren't the smartest Nazis. Sure, they're consistently keen enough to spot you if you're out in the open too long, but once they're on alert, their movements are disappointingly predictable. If you don't want to leave any survivors, you can use the classic shooter exploit of funneling enemies toward you for easy pickings.As much as Enemy Front also wants to cater to the stealth enthusiast, sneaking in this game is typically a cumbersome ordeal. A stealth kill is often useless since the drawn-out brutality of stabbing a downed Nazi three times is five seconds too long and leaves you open to detection. It's not as the studio intended, but you're better off approaching guards from the side since melee kills are instant and you get to avoid the stealth kill prompt. The contrast between the two methods is baffling.The inclination to run past entire squads of Nazis is partially related to the game's lack of play-style incentives. Yes, many great shooters don't have progression rewards, but it doesn't feel like City Interactive tried to give you reasons to play one way over another. Even the Nazi Eagle collectibles scattered throughout Europe don't offer any tangible payoff, let alone any of the expository factoids that you usually get from these kinds of items.Enemy Front could still have been an appealing and straightforward Nazi whack-a-mole game if not for its hot mess of glitches and poor design choices. It greatly suffers from frequent split-second freezes, often during crucial moments, such as when you switch to your scope or perform a melee kill. When allies accidentally complete objectives for you (for example, killing key generals), these accomplishments do not count toward your progress. This locks you from advancing, forcing you to reload the last checkpoint.Since the multiplayer lacks the background bedlam of planes flying by or mortar shells hitting every couple of seconds, it's unsurprising that it plays more fluidly than the campaign. While the modest selection of maps are sufficiently large and multileveled, the uninspired deathmatch and conquest modes offer nothing that you can't find in other shooters. It also doesn't help that weapons always respawn in the exact same locations. The fun is gone once everyone knows to make a break for the rocket-launching panzerschreck.Enemy Front lands in that unfortunate middle area where its faults aren't bad enough to leave a painfully lasting negative impression, but its key moments are too generic to be memorable. At a party 10 years from now, I'll suddenly recall the V2 rocket sabotage mission or the Warsaw siege chapter, yet I will have forgotten what game these scenes were from. It will drive me mad for the rest of the night, since it's unlikely anyone will pop up and say, ~You're thinking about Enemy Front.~ And even if someone did chime in with the correct answer, I might not be convinced it was that game. That's the impression Enemy Front makes."}