{"ref": "https://www.gamespot.com/reviews/50-cent-bulletproof-review/1900-6140474/", "date": "November 28, 2005", "game_name": "50 Cent: Bulletproof", "text": "Love him or hate him, 50 Cent is like a force of nature these days. With music from 50 and his cohorts consistently burning up the pop charts, it seemed like it was only a matter of time before the G-Unit empire expanded beyond music and clothing and into other forms of media. 50 Cent's movie is in theaters, and now he's got a game to call his own, 50 Cent: Bulletproof. This third-person action game might sound like a great idea if you're a fan of 50, Yayo, Buck, and Banks, but with its poor gameplay and worse attention to the G-Unit license, Bulletproof disappoints on all fronts. Sure, 50 Cent's video game is pretty bad... Bulletproof's action is driven by a storyline that puts you in the role of 50 Cent. It seems that your friend K-Dog has been caught up in some serious drama. He calls you for help, and you round up the rest of the G-Unit and head out to rescue him. But that's where it all goes wrong. K-Dog ends up dead, and you end up taking nine shots to your back for your troubles (just like real life!!!). This, as you might imagine, pisses 50 Cent off quite a bit, so he sets out to figure out what, exactly, is going on. By the end of the game, you'll have a slightly better idea of what's going on, but the story is so bad and poorly told that you still won't know exactly what the deal is. Of course, you probably won't care, either. The premise of 50 Cent getting gunned down at the end of the first level is even crazier, considering that you just made your way through the whole first level and probably got hit with a lot more than nine bullets. But somehow, these nine hot ones are hotter than all the other slugs you took. It doesn't make much sense, but then again, applying this level of scrutiny to the story was probably never intended. Once you get past the bad storytelling and get into the game, you'll find a third-person shooter in a similar vein to Max Payne. The main difference is that the simple act of firing a weapon at an enemy is sort of a chore, due to the way the game's aiming and accuracy system works. By default, most of your weapons are pretty inaccurate. But if you can hold your aiming reticle over an enemy for a second or two, it'll shrink down into a more accurate firing pattern. However, the enemy AI skitters back and forth like 50's been dealing to them, so drawing and holding a bead on active enemies is a pain. The end result is that you'll run up to point-blank range and still have to empty most of a clip to put the bad guys down. You can adjust the sensitivity of your aiming control stick, but no setting seems to work better than the other. You can get your hands on a bunch of different pistols, rifles, submachine guns, and shotguns, but ultimately, the game's main action--shooting people--isn't any fun at all. A few missions have you working alongside the G-Unit soldiers, or other allies, like the dirty cop, Detective McVicar (played by Eminem) or the grizzled war veteran-turned-gun fiend, Grizz (Dr. Dre). In situations where they're just shooting the bad guys, your AI-controlled partners do a decent job. Considering how uninteresting the shooting is, it's often easier to just sit back and let them do most of the shooting, since they seemingly never die. But when it comes time to navigate tight hallways, for instance, the AI falls apart. We ran into a situation where Lloyd Banks--the lock-picker of the crew--was attempting to run into a room to pick open a safe while we were attempting to get out, which blocked us into a corner. The only answer? A couple of shots to the face got Banks to move out of the way. When it comes to licensed products like this, the gameplay sometimes seems secondary. In this case, the developers have attempted to pack the game with other 50 Cent-related stuff in an attempt to make it more appealing to fans of the artist. Bulletproof contains a ton of songs from 50 and the rest of the G-Unit, and there are a handful of music videos on the disc as well. You'll have to unlock them using money earned during missions. Once you've done so, you can add the unlocked songs to a playlist. However, the game doesn't incorporate any of its music well. It attempts to have an interactive music system that plays low-key tracks when things are quiet and switches over to louder, angrier music when you set it off. But enemies often come one or two at a time, so the game seems like it's constantly crossfading back and forth between a few tracks. Plus, the songs restart after a load screen, so when you're going in and out of buildings between missions, you'll hear the first 20 seconds of a track over and over again. The unlockable videos are a nice touch, but they're poorly compressed and look grainy and pixelated. If you're a fan looking for ~the ultimate 50 Cent experience,~ you're probably going to be twice as disappointed as someone who's just after a decent shooter. Graphically, there's one aspect of the game that stands out. The character models for all of the big-name characters are really sharp. 50 looks especially menacing, but the rest of the G-Unit, Dre, and Eminem all look convincing and animate fairly well. The bad guys don't have it so good, but they still look decent. The environments in the game, however, are an ugly, dark mess. You'll go through burned-out buildings, sewers, and train tunnels--all sorts of places that will often be too dark for you to make out objects like walls. When you can see, you'll run into some rather ugly-looking textures. The Xbox version of the game looks slightly better than its PS2 counterpart, but not enough to recommend one version over the other. ...but we can't imagine that a Ja Rule or a Fat Joe game would be any good, either. Aside from the messed-up interactive music system, the game's sound effects and speech don't help things along. The voice acting is passable, but it usually comes off as stiff and forced. The gunfire sounds decent, but the Xbox version has some surround sound issues that muffle the gunfire when you're aiming down at a target, occasionally making it sound like your shots are coming from behind you. Once you've finished Bulletproof's short and ridiculous campaign, you can go back through the levels in arcade mode, which gives you a score based on how well you can shoot people in the face. But with the shooting as bad as it is, it's tough to imagine that most people will even bother to finish the campaign mode, let alone enjoy it enough to go back through the levels for a high score. If you're looking for a fun third-person shooter, look elsewhere. If you're a G-Unit fan looking for an interesting spin on your favorite rap stars, this game doesn't serve you, either."}