{"ref": "https://www.gamespot.com/reviews/monster-hunter-stories-2-wings-of-ruin-review-monstie-hunter/1900-6417697/", "date": "July 9, 2021", "game_name": "Monster Hunter Stories 2: Wings of Ruin", "text": "With 2016's Monster Hunter Stories for the 3DS, Capcom transformed its real-time monster hunting series into something dramatically different: a colorful turn-based monster-collecting RPG. Despite the stark change in tone and gameplay, Stories offered a new perspective on the Monster Hunter universe, making it an enjoyable alternative to the mainline series. Its follow-up, Monster Hunter Stories 2: Wings of Ruin, very much follows the template that the original 3DS game set, and despite some repetitive elements, it's another solid spin-off for the franchise.Like its predecessor, Monster Hunter Stories 2 trades monster slaying for monster collecting. Rather than casting you in the role of a hunter, the game puts you in the boots of a fledgling rider--someone who is able to form bonds with monsters and fight alongside them. While you'll still need to hunt down plenty of monsters during your journey, you'll spend most of your time exploring dens and collecting new ~monstie~ companions that you can raise and take into battle. This makes Monster Hunter Stories 2 fundamentally closer to Pokemon than to a traditional Monster Hunter title, but the game plays out much differently than Nintendo's monster-catching series.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Monster Hunter Stories 2: Wings of Ruin Video ReviewForemost is the way you collect monsters. Rather than taming wild ones, you obtain new monsties by entering monster dens and gathering their eggs. These crop up randomly each time you set out into the overworld and primarily come in two varieties: standard dens, and golden ~rare~ dens that typically contain better eggs. Regardless of their type, the dens themselves are all fairly rudimentary in terms of their layouts; beyond some occasional branching pathways (which usually just lead to optional treasures), there are no real environmental puzzles to solve, so they're not particularly compelling to explore on their own. Despite this, the allure of discovering new kinds of eggs never grows old and makes trekking through dens ultimately worthwhile, especially as you progress through the story and begin encountering cooler monsters.In addition to regular monster dens, each major area in the game also features a handful of larger dungeons called Everdens. These are much more labyrinthine than standard dens and house some unique treasures such as rare eggs and Bottle Caps, which can be exchanged for special items and upgrades like increased storage space for your monsties. These upgrades make Bottle Caps among the most valuable commodities in the game, but they're not as satisfying to find. Like regular dens, Everdens don't offer much variety, so they end up feeling samey and aren't particularly enjoyable to navigate. Moreover, thanks to their winding pathways, you'll often hit multiple dead ends before you eventually locate the monster nest, which ultimately makes Everdens more of a chore to explore than regular dens.After you've obtained an egg, you can take it back to the stables and hatch a new monstie. Depending on the egg's rarity and weight, the monstie you obtain will boast different genes, which determines what skills and attacks it will be able to use during battle. These genes are crucial if you hope to get the most out of your monstie, and they become a sort of mini-game unto themselves. If you align three genes of the same color, you'll achieve a bingo bonus, which will power up your monstie even further. You can also pass genes between monsties through a process called the Rite of Channeling. This offers a pleasing amount of flexibility in how you customize your monstie's skills, and it feels rewarding to tinker around and devise new combinations.Your monsties primarily come in use in battle. Unlike the mainline series, encounters in Monster Hunter Stories 2 are turn-based. While there are elemental weaknesses and advantages to consider, battles primarily revolve around three different types of attacks: power, speed, and technical. Each type has an advantage over another: speed bests power, power beats technical, and technical overcomes speed. The crux of battles, then, becomes figuring out which type of attack the enemy monster will use and swapping in the right monstie to counter it. It's a simple yet satisfying system, and the game keeps it fresh by frequently introducing new kinds of monsters with different attack patterns to battle.The weapons you use also play a crucial role in combat. Weapons similarly fall into three varieties: slash, pierce, and blunt. This opens an additional layer of strategy. Different parts of a monster are susceptible to a particular type of weapon, so you'll need to swap out weapons frequently during the course of the battle and target specific parts to deal the most damage. Attack a part enough times, and you will eventually break it, causing the monster to drop a material and topple over. While a monster is prone on the ground, each attack you land will deal critical damage, and you can even halt some monsters from unleashing their strongest attacks by breaking a specific part of their body. These wrinkles make battles feel consistently enjoyable, and the game boasts some nice quality-of-life features, such as the ability to fast-forward animations and even end battles against lower-level foes immediately to mitigate the grind.Beyond their in-battle abilities, each monstie can also perform a certain action while you ride them out in the field, which will help you reach some otherwise inaccessible areas; the Yian-Kut-Ku, for instance, can smash rocks that are blocking the path, while the Tigrex can clamber up ivy-covered walls. However, these riding actions are disappointingly underutilized during the main adventure. Rather than opening up new pathways to explore, these skills are typically used to reach out-of-the-way treasure chests, whose contents are often underwhelming. As a result, the field skills feel largely unnecessary and don't really add anything to the experience.The weakest element in Monster Hunter Stories 2, however, is ironically its story. While the narrative is certainly more involved than a traditional Monster Hunter game, it largely stays within JRPG tropes and is fairly predictable as a result. The story also skews toward a younger audience, as evidenced by Navirou, your cartoonish, wise-cracking Felyne companion. Since your avatar never speaks, Navirou takes up most of the dialogue in your stead, and he frequently straddles the line between cute and annoying. That said, the story does broach some themes that the mainline series never explores, such as the seemingly incompatible worldviews of hunters and riders, and it's filled with humorous and touching moments.Overall, Monster Hunter Stories 2: Wings of Ruin is an enjoyable Monster Hunter spin-off and an all-around solid JRPG, particularly if you enjoy games like Pokemon. While the title retains some of the series' hallmark elements, its emphasis on monster collecting and its fun turn-based battle system make it a decidedly different experience than Monster Hunter Rise, one that even those who've struggled to get into the proper Monster Hunter series can enjoy."}