{"ref": "https://www.gamespot.com/reviews/conflict-desert-storm-ii-review/1900-6076509/", "date": "October 7, 2003", "game_name": "Conflict: Desert Storm II - Back to Baghdad", "text": "Last year's Conflict: Desert Storm gave players squad-based tactical action with a tie-in to modern military history. As you'd gather from the name, the game was set in the Middle East during the early 1990s' Operation: Desert Storm--the famed military action against Saddam Hussein's invasion of Kuwait. Its current-events context notwithstanding, the first Conflict just wasn't very good. Scarcely a year later, we're receiving a direct sequel titled Conflict: Desert Storm II. The hasty release of a follow-up was no doubt spurred by the political and military events of the last year. However, the new Conflict is quite an improvement over the extremely shaky first game. Conflict: Desert Storm II again places you in the thick of the 1991 campaign against Saddam Hussein's regime. Though there's been a more recent conflict in Iraq, and military action in the region is, in fact, ongoing, Conflict: Desert Storm II again places you in the thick of the 1991 campaign against Saddam Hussein's regime. There's not a whole lot of story to speak of in the game. You get a linear progression of 10 missions, each of which has its own setting and unique mission objectives and some of which are revealed in-game as you progress. You command a squad of four specialists in each mission, and, at the beginning of a new game, you can choose either American Delta Force or British SAS personnel. Your selection here slightly affects stats, appearance, and voice acting. Each of your team members is equipped with a weapon that gives him a unique function. There's the assault rifle-wielding team leader, the sniper, the demolitions expert, and the heavy machine gunner. The team members do have actual names and unique appearances, so you've got at least a little more attachment to them than if they were just faceless drones. The core squad and combat mechanics in Desert Storm II are a little awkward at the outset, but with some practice you can get fairly proficient at playing the game. In the main single-player game, you can switch between your four teammates by hitting up and down on the D pad. Each of the four (whichever one is active) squad members can issue individual or group orders to the others by using a number of button combinations. You can tell your teammates to hold position or form up behind you, hit the dirt, advance on the enemy and fire at will, and so on. As long as you keep tabs on your teammates' health and actively switch between them regularly, you can progress through the game's missions without worrying too much about suffering casualties. Leaving three of your buddies in the care of the game's squad AI isn't the best idea, though they'll be proactive about fighting enemies. They'll fire at their enemies, but will often get themselves killed in the process. Of course, you can issue orders to bring them back behind cover, but that can be difficult when you're in the middle of a firefight and are worrying about saving your own skin. Overall, it would have been nice if the teammate AI was a little more adaptive when left to its own devices. The actual fighting in Conflict: Desert Storm II is somewhat hit-and-miss. At times, it feels pretty solid, thanks in large part to a built-in auto-aim feature that makes it quite easy to target hostile forces. In fact, sometimes it's a little too easy--the game will sometimes line up an enemy in your sights before you even realize he's there. Other times, though, it seems suspiciously difficult to score a hit on enemies, particularly with the sniper rifle. It's possible to hit the deck, steady your crosshairs directly over an enemy's head, and then see no effect after pulling the trigger. It's frustrating, to be sure, but, for the most part, the combat is reasonably well balanced and entertaining. You can even engage in vehicular combat with a jeep or tank in some missions, which does break up the flow of things a little. The vehicles feel a little awkward and can be slow to respond to your controller movements, though. The backgrounds are fairly devoid of detail, and the enemy character models look pretty simple. Graphically, Conflict: Desert Storm II gets the job done, but does it in a no-frills sort of way. The backgrounds are fairly devoid of detail, and the enemy character models look pretty simple. Your own squad models, however, are decent looking. The game appears surprisingly similar on both platforms, with a slight nod going to the Xbox for less aliasing and a higher frame rate. The audio portion of the game is dominated by a lot of yelling, gunfire, and explosions, though all of these are rendered pretty well. The music tends to fade into the background, though, since you're intent on finishing your missions. Finally, as in last year's game, the voice acting for the training mode's drill instructor is a poor attempt at sounding like Full Metal Jacket's tough-as-nails drill instructor, and it comes across as pretty awful. In the final analysis, Conflict: Desert Storm II isn't without problems, but it's not the worst squad-based game you'll ever play, and it's decidedly improved over last year's game. If the game does float your boat, there's unfortunately not a lot of replay value. You can play through the game again--cooperatively--with two players on the PS2 and four on the Xbox, but there's no competitive multiplayer component to speak of. If you're really into squad-based military action games, Desert Storm II might be worth a look to tide you over until something else comes along."}