{"ref": "https://www.gamespot.com/reviews/stranger-of-paradise-final-fantasy-origin-review-chaos-incarnate/1900-6417844/", "date": "March 15, 2022", "game_name": "Stranger of Paradise: Final Fantasy Origin", "text": "When it was first announced back during E3 2021, Stranger of Paradise: Final Fantasy Origin quickly became something of a meme, thanks to protagonist Jack's repeated insistence of his overwhelming, intrinsic need to ~kill Chaos.~ It was funny because he just would not shut up about Chaos, but the marketing for the game never bothered to explain who or what Chaos was. The big takeaways from the announcement were: Final Fantasy, angry protagonist, Chaos.But having access to the full game, somehow, adds almost no additional context to Jack's need to kill Chaos--at least, not until well into the game's 25-hour-ish run. In fact, for the first few hours of the game, Jack is literally walking up to every big, scary monster boss waiting at the end of every level to ask, ~Are you Chaos?!~ Of course, we proceed to kill them. And, usually, they are not Chaos. It goes on like this for a while.This long, confusing digression about Chaos exemplifies the strange and somewhat bewildering take on Final Fantasy that is Stranger of Paradise: Final Fantasy Origin. This game is part remake, part reimagining, and part new chapter for the original Final Fantasy from way back in 1987. But it's a version of Final Fantasy with a lot of the Final Fantasy-ness strained out. What's left is a streamlined version of the venerated RPG series that is both a blast to play, thanks to its excellent and varied combat mechanics, and perplexing as hell on nearly every level.Stranger of Paradise begins with the usual Final Fantasy formula of battling monsters, gathering gear, exploring a vast world with towns and dungeons, and uncovering a lengthy story, and strips away almost everything that isn't related to combat. This is, essentially, FF as a loot game, where your strength is dictated by the quality of your weapons and armor, and every time you enter a story or side mission, you're given a rundown of what rewards you'll receive by completing it, along with their numerical strength levels. Just about every enemy you face is a piata that explodes to shower you with new boots and swords and hats, and while completing a mission opens up the next one, you'll often find that normal minions will pummel you until you raise the average numerical level of your gear to bring it in line with the mission's recommended requirements.And combat itself is punishing enough. Stranger of Paradise mixes the fast-paced hybrid RPG combat of the series' other recent remake-slash-reimagining-slash-new chapter, Final Fantasy VII Remake, with hard-hitting enemies and a focus on parrying enemy attacks. It's a cliche to compare everything to Dark Souls, but the inspiration of the Soulslike approach is clearly at play in Stranger of Paradise, elevating its combat. You have to take every enemy seriously, lest a small group of simple bats beat the hell out of you--as happened to me again and again and again throughout the game. You need to learn how to read attacks so you can guard against them, parry them, or dodge clear of them as the situation dictates, and everything from a looming behemoth to a lowly goblin is a major threat.The strength of enemies on the normal and hard difficulties (there's also a more-chill story mode that makes combat significantly easier, leaving all the game's challenge in figuring out what the hell is going on) helps make fighting fun, though, because you have a lot of tools at your disposal and you'll have to use all of them--and that goes double for its often-massive, intense boss fights. Stranger of Paradise's main mechanic is the Soul Shield, a parry ability you can use to absorb most incoming attacks, but with a super-short timer attached that leaves you very vulnerable if it runs out. When an enemy attacks, activating your Soul Shield parries them away, while giving you magic points. You'll use this MP for everything, from casting magic spells to executing powerful melee combos, so you need to constantly refill it. That means you need to be aggressive, getting into the thick of fights, baiting out attacks, and parrying them to power your own abilities.There are two more upshots of Soul Shield that make using it a rewarding element of combat. First, successful parries lower your enemy's Break meter, which runs parallel to the meter dictating their health. Empty the Break meter on your foes and they'll be stunned, opening them up to a brutal finisher in which Jack magically crystalizes the foe from the inside out and then shatters them in a big explosion. Finishers eliminate enemies with a flourish, damage any other foes close by when you use it, and increase your total MP during the current mission so you can do more of your stronger attacks.The second upshot is that Soul Shield sometimes absorbs enemy attacks so that you can store them for a bit to use yourself. When a Wind Elemental casts an Aero spell at you, your Soul Shield can catch it, protecting you from damage and allowing you to throw it back at your foes. That alone would be a really cool incentive to learn attacks and practice the timing to parry them, but with the Break gauge and finishers, you have an excess of reasons to get good at the game's parry system, and it's always rewarding to do so.The drawback of the Soul Shield is that it expends your own Break gauge, so if you mistime a parry and an attack hits you, Jack will be staggered and very vulnerable for a couple of seconds. To counter that limitation, you have a normal guard that cuts down on damage received, which doesn't require you to time its use. So fights often start with you guarding to learn an enemy's capabilities, then breaking out the Soul Shield once you get more comfortable so you can let loose with your best moves.There are a whole lot of those moves to keep track of, though. At times, Stranger of Paradise benefits from all that variety; at others, it can be way too dense. The game functions on a variation of Final Fantasy's job system, in which you choose a certain job for Jack that comes with a specific approach to combat, allows him to equip specific types of armor and weapons, and unlocks specific moves. You start with the Swordsman job, in which you use a huge sword to smack around enemies, doing massive damage. Level that job up and you might choose to unlock Sword Fighter, which gives you a smaller blade and an off-hand shield, with faster attacks that focus on enemy Break meters more than their overall health. Progressing through Sword Fighter opens the Ronin job, which is about fast melee attacks to restore MP and elementally infused combos, and so on.The fun part about all this is that there are a bunch of jobs, giving you a variety of combat options to explore, each with their own central gimmicks and weapons. You can also equip two jobs at a time, each with its own set of armor and weapons, and quick-swap between them. So if the situation dictates that you need overwhelming force, you can use Jack's Swordsman job to slice through the opposition. If you're fighting elemental enemies, a quick-swap to the Mage job lets you blast enemies with Water or Fire and take advantage of their weaknesses. Some pieces of gear also have a Job Affinity stat; building Job Affinity unlocks special bonuses from different jobs even if you're not actively using them, while also causing you to level those jobs without them being equipped.Apart from managing Jack's job and gear, you can also select from a few jobs for your party members, but the customization is much more limited. You also can't control them directly in a fight, apart from using a special ability that makes them a little fiercer every so often.If it sounds like a deluge of junk to keep track of, though, it is, and that's where Stranger of Paradise can falter. There are so many combos, affinities, jobs, stances, and ~command abilities~ to unlock and equip that you can easily lose track of them, and once you find a comfortable fit of a couple of big attacks that hack through most enemies, you probably won't want to mess with a good thing much. It can also be punishing to switch jobs as you move through missions, because unleveled jobs make you weaker than leveled ones--so if you're facing a tough mission for which you're underleveled, the game pushes against experimentation.Some of that leveling issue is alleviated with side missions that unlock as you play through locations. Each main mission is essentially a run through a specific place, like a castle or a forest. Side missions return you to those same locales, but with the goal of finding a specific enemy or group of enemies and killing them. These side missions offer some additional chances at gear and crafting materials to upgrade your stock, but they retread places you've been and don't offer any narrative that might expand the story or world.There's also so much gear that you'll find yourself constantly swimming in menus. Each character uses specific kinds of weapons and armor, and all the weapons and armor have different upshots and downsides, plus rarity levels and job affinities, and some even unlock special combo abilities. About halfway through my run, I started just hitting the ~optimize~ button on the gear menu whenever I picked up some significant equipment--which felt like roughly every five to 10 steps. And while there's no means of selling gear, you can only hold so much at a time, which means that between missions, you need to use a special menu to dismantle whatever you're not using. Dismantling gets you crafting materials you can use to power up your weapons, but this seems like a superfluous addition at best. The flood of gear is so fast and furious that I never used a weapon for longer than a mission or two, at best, so bothering to increase my ax's Break power by 2.4% seemed like a waste of time. The system might eventually become more important on tougher difficulties as you push to the peak of power and challenge in Stranger of Paradise, but in 25 hours of my playthrough, I all but ignored it.The majority of the game's focus on combat means Stranger of Paradise mostly forgoes traditional RPG aspects, like visiting merchants, exploring towns, or getting to know minor characters. But that streamlining belies the fact that Stranger of Paradise is still a story-focused game--even if its approach to that focus is bizarre. Jack and his friends' overwhelming desire to defeat Chaos is confusing, but that's part of the point, as you discover early on that none of the protagonists, the prophesied ~warriors of light,~ can remember their pasts. They have this need to kill Chaos, and that's all they know. The story builds on this theme of memory and mystery, although the characters are fairly flat and uninteresting, and the game never goes out of its way to develop them.The telling of the story, though, is nothing if not disjointed. Cutscenes pop up during and between missions, but important concepts go unexplained and barely remarked upon--even the idea that the warriors of light are missing their memories is something you'll first have to pick up from context clues. The ~darkness~ people talk about the warriors of light dispelling in abstract terms, it turns out, is a physical force at work in the world, but you'd never know that evil black mist is turning people into monsters from the way it's discussed in the first third of the game.It's not until late in Stranger of Paradise that it becomes clear this is a recontextualization of the original Final Fantasy (and, to some degree, all the other games in the series) akin to the way Hideo Kojima retconned the events of the NES Metal Gear games through the course of Metal Gear Solid 4 and 5. Until it all starts to click, it's just a mess of strangeness derived from cutscenes and loading screen text--and it may never click at all.There are a few other strange choices in storytelling that feel like vestiges of the Final Fantasy game Stranger of Paradise was carved out of, but are still baffling inclusions. You can't wander towns and talk to people, but between missions, you can check in with a few specific people from Cornelia, the city where your journey started. Pulling up the Talk menu gives you the chance to see short story cutscenes with these people, which all take place at the same spot with the same backdrop, and are almost always inane. The idea here is to give you a sense of what's happening as you accomplish your usual Final Fantasy goals of finding and powering up special crystals that govern the elemental forces of the world. But so often, the scenes are just useless--sometimes, half the characters will just say, ~May the crystals protect you~ or something, leaving you wondering why these four-second scenes even exist.This happens a few times after major moments, too, like when you speak to Cornelia's king or when your team is assembled at the start of a mission. You can run around these spaces and talk to a couple of people, who all say one or two lines. Sometimes, these are actually useful to the story, like when teammate Neon remembered hearing about Garland, a character mentioned in the background who fans will know as the primary villain of the original Final Fantasy. But most of the time, they're useless, like when Neon said, ~Jack, you should find out what Astos has to say,~ when talking to Astos was the clear objective of the scene. Why even create this moment with this character, only to have them tell me to do the thing I was already told to do, and which is impossible to miss?Stranger of Paradise purposely removes things that dilute its focus on combat, so it makes sense to take out things like walking around towns and talking to people. It also makes sense to include conversations with townspeople or your teammates that are important to what's happening--so the fact that so many of them are incredibly unimportant makes no sense. Ultimately, they feel like time-wasters, like the crafting system, or the need to dump gear every so often, or the constant digging through menus in order to equip new gear. For a game so keenly focused on a fun, vast, and fascinating combat system, the inclusion of these little pace-killers is as confusing as the overall story itself.It should also be noted that Stranger of Paradise stumbles a bit on technical aspects and, at times, its art direction. Every level is a long trip through a specific location, and while those locations are neat and varied from mission to mission, every one of them quickly becomes a confusing labyrinth of shortcuts and side paths. The rooms within each level are so samey that I was constantly getting lost. The game looks good in motion, especially as you're knocking out finishers and firing off elemental attacks--it's at its best when it's popping and overflowing with color. But some scenes and skyboxes are a bit soupy and characters are never particularly well-animated. Scenes with small crowds of only eight or 10 townspeople include several with the same face. Running the game on the PlayStation 5 in its FPS-favoring performance mode, I still saw a fair share of frame-rate stuttering as well. They were mostly minor annoyances, but in general this feels like a last-gen game a lot of the time, with the visuals and performance that go with it.Still, while it might be confusing and memey, disjointed and weird, Stranger of Paradise is also a lot of fun. It's full of cool combat with a wide variety of options, and a job system that lets you customize your playstyle or just try out what feels like 30 different ones. Its challenge makes every fight a battle of skill, while also giving you the tools to feel like a ludicrously powerful Final Fantasy badass. And despite being bizarrely delivered and wildly strange, there is a delight in uncovering what the hell is actually going on in the game's story and the weird ideas it brings to bear on the Final Fantasy series. Stranger of Paradise is mostly a more focused version of Final Fantasy that shows some different directions for the series from its traditional games, even if those directions take it down paths that are sometimes a bit...stranger."}