{"ref": "https://www.gamespot.com/reviews/elite-warriors-vietnam-review/1900-6121480/", "date": "April 1, 2005", "game_name": "Elite Warriors: Vietnam", "text": "Developer nFusion has carved something of a niche for itself by creating budget-priced tactical shooters. It has bucked the budget-ware trend for cheap but lousy games, and the results have been pretty good--at least until Elite Warriors: Vietnam, a sorta-kinda sequel to 2003's Line of Sight: Vietnam. Elite Warriors introduces some unusual gameplay elements that end up being completely superfluous while drastically reducing the scope and variety of the core shooting action. The game also reintroduces a few problems that nFusion seemed to have licked last time around. The result is neither especially tactical nor satisfyingly action-packed. The superfluous tactical map mode. Ostensibly, the game is based on the literary works of retired Major John L. Plaster U.S.A.R. His books detail what are now-declassified exploits of the Studies and Observation Group, a shadowy joint armed forces organization that ran secret operations into Laos, Cambodia, and North Vietnam. Apart from the lengthy mission-briefing text--which you can skip without missing anything important--there isn't much to indicate that you're anything other than an average grunt, humping it through the jungle with three of your buddies. For a game that advertises its literary inspiration right on the front of the box, it's surprisingly free of plot or even much context other than some war-themed factoids that appear during the loading screens. As in nFusion's previous titles, you command a squad of up to four soldiers, each of whom is rated in several skill categories (such as stealth and a variety of weapon classes) that can be upgraded between missions. You control one character at a time, though you can freely switch between them at will. There are several basic commands that you can issue to the entire group. Instead of relying solely on hotkeys for these commands, the game introduces a handy quick-select radial menu, which is the only real improvement over the other titles in the series. There's also a new Brothers in Arms-esque overhead view that temporarily positions the camera above your squad and permits you to issue orders to members of the team individually. Inexplicably, the radial menu is disabled in this mode, so you'll have to rely on hotkeys. This isn't much of a problem, however, since nothing about the straightforward action inspires the use of this tactical camera. You'll use it in the tutorial and then never bother with it again. The single-player campaign is divided into eight missions, each of which takes maybe 45 minutes to complete. Rather than go the traditional route of having each mission be a discrete level, the game features an abstracted, RPG-like overhead map of the mission regions on which you plot a course between various points of interest, such as supply drops, mission goals, and extraction points. When your squad (represented by an icon) arrives at a point of interest, a level loads and the shooter part kicks in. As the squad slides between points of interest, random events occur and are reported in pop-up dialog boxes. A squad member might sprain an ankle, slowing the entire group down; you might find a secret stash of ammo; and then other times it will start to rain. Occasionally, you'll run across an enemy patrol, at which point a level loads and you can either fight them or make a run for the edge of the map. Each mission has a default set of waypoints, though you can also define your own. As you move between waypoints, you can also set your movement speed from reckless to cautious. The map mechanic is an interesting idea, but in practice it's completely extraneous. Though each map features multiple extraction zones and supply drops, there's usually only one primary goal area, and in every case the default waypoints are perfectly fine for completing the mission. There simply isn't enough depth to either the maps or the available options to make this feature anything more than an unnecessary nuisance. The shooting action is pretty lackluster as well. The game abandons Line of Sight's focus on creeping and sniping for more straightforward run-and-gun action. Line of Sight's enemies, who had a supernatural ability to spot you from five miles away, have been replaced by guys with the subnormal tendency to ignore you completely outside of two feet. Your squad has also been dumbed down. They frequently get stuck on the landscape, a problem with earlier entries in the series that appeared to have been fixed in Line of Sight. You can take control of a stuck soldier and move him manually, but it's aggravating that you even have to. The game's biggest failing is its almost complete lack of variety. Every level looks and plays more or less identically. The main missions invariably involve trudging through featureless, interchangeable expanses of jungle to blow up some stationary target. By the end of your tour, you'll never want to see the color green again. This was a problem in Line of Sight as well, but it has gotten even worse this time around. And though the dull visuals don't look appreciably better than those in Line of Sight, the game is choppy even on decent hardware. The actually pretty handy radial-command menu. On top of everything else, the game abandons some of Line of Sight's multiplayer options. Capture the flag and the objective-based modes have been cut, leaving only free for all and team deathmatch. The four-player cooperative mode is still supported, but the single-player game isn't compelling enough to make this option very attractive. nFusion's tactical shooter series reached its high point two titles ago with Deadly Dozen: Pacific Theater. Though they share similar structures, none of that game's intensity or variety of content managed to make it into Elite Warriors. Hopefully, nFusion will bounce back with its next title or simply retire the series altogether."}