{"ref": "https://www.gamespot.com/reviews/rock-band-3-review/1900-6285572/", "date": "December 20, 2010", "game_name": "Rock Band 3", "text": "If the Rock Band series really wanted to capture the rock-and-roll lifestyle, it would need to have a lot more sex, drugs, and undercover exposs on cable television. Instead, what we get are four quirky youths touring cross country to become the most eclectic cover band the world has ever seen. It's a taste, but it's hardly the full package. Rock Band 3 on the Nintendo DS falls into similar straights. It provides an enticing taste of what's available on other platforms, but comes up short by comparison. And with only 25 songs, you spend more time with Smash Mouth than anyone should. Rock Band 3 uses a similar approach to other games in the series, but instead of just tapping along to the notes on one highway, you have to juggle four different instruments at once. If you land several notes in succession, you clear a phrase. Now, the computer will play that track for you temporally, allowing you to turn your attention to the next needy instrument. It's a fun and simple formula--one that developer Harmonix has fine tuned in the past with Rock Band Unplugged and its distant predecessor Frequency--that faithfully approximates the experience found on consoles (minus the expensive peripherals). In keeping with the educational approach seen in the console versions of Rock Band 3, the DS version includes its very own Pro mode. This mode forgoes the clearing of phrases in favor of running all tracks simultaneously. Ideally, this puts more pressure the player by forcing you to monitor the entire band and jump to the instrument that needs your attention most. Play enough notes successfully on one track and they will darken, indicating you can switch tracks without losing your point multiplier. Despite these changes, Pro mode still plays a lot like its Normal mode counterpart. The new keyboard instrument makes an appearance as well, but this addition also feels purely cosmetic as it simply shares the same track as the guitar. What any music game really boils down to, however, is the music selection. From The Doors and Foreigner to Paramore and Tokio Hotel, Rock Band 3 DS pulls from its console counterpart a set list designed to please every musical palette. However, with only 25 tracks total, you'll want to study that selection long and hard before adding this game to your portable library. If you love the lineup, then you're golden. However, if only one or two of the picks catch your eye, then take heed; along the journey to rock-and-roll stardom in Rock Band 3 DS, repetition is a constant companion. Most of this journey takes place on the open road, touring from your hometown across the globe and completing one venue after another. Some of these road challenges mix things up by offering special objectives, such as awarding bonus points for focusing on specially marked instruments, but these ultimately do little to alter the flow of the game. As you move from city to city and coast to coast, repetition will not be far behind. You may finish a custom set list for one gig, only to have those same songs required for the next. And after a few hours of play, chances are you will have heard everything the game has to offer. Solos put the spotlight on a single instrument. Jamming out and completing road challenges earn you more fans that, in turn, earn you new venues at which to play. The other way you can build up a fanatical following is by completing the various career challenges. Broken down into tour, skill, and song, these trials run the gamut from straightforward, such as earning a certain score on a song, to the more exotic, such as customizing your band to be four exact copies of one another. In addition to the fans, completing these challenges replaces cold hard cash as the method to unlock new threads and instruments to customize your band mates. Sadly, in lieu of getting creative with the hardware, Rock Band 3 on the DS seemingly tries to cram as much of the Rock Band Unplugged experience into a tiny cartridge as it can. And while the new competitive and cooperative local multiplayer modes are a smooth addition, the game's presentation, song selection, and sound quality leave much to be desired. However, if the Rock Band 3 DS set list fondled your fancy then this game is still a good way to get rocking on the go."}