{"ref": "https://www.gamespot.com/reviews/nfl-gameday-2001-review/1900-2653244/", "date": "May 17, 2006", "game_name": "NFL GameDay 2001", "text": "While there was a great deal of speculation that Sony would be able to harness the power of the PlayStation 2 to create an unbelievable gridiron experience, the truth is that GameDay 2001 for the PS2 is little more than a flashier version of the PlayStation game. While Sony's GameDay series and EA Sports' Madden NFL series may have been competitive on the original PlayStation, the two franchises on the PlayStation 2 look as if they were intended for entirely different systems. NFL GameDay 2001 for the PlayStation 2 has all of the options and features you'd expect. The NFL teams and players, a season mode, a create-a-player mode, a general manager mode, and a play editor are all included. The game even lets you play a specific position so you can test your skills as a running back, quarterback, or wide receiver. While GameDay 2001 has many of the elements and options of a solid football game, it's ultimately the on-field action that's disappointing. GameDay 2001 plays fairly well, mostly because it features the proven gameplay elements of the GameDay series, such as the total-control passing and running. Total-control passing lets you lead, overthrow, and underthrow your receivers so that you can throw more completions and prevent pesky defenders from intercepting your passes. The total control features in GameDay really make you an active part of a play's success. This sense of control is really the only thing that GameDay 2001 has going for it. Graphically, GameDay 2001 pales in comparison to Madden. The player models aren't very smooth or very different from one another. The animations of the players are terribly similar - they run up and down the field like a band of soldiers. Even though Sony claims to have scaled every player in the game to accurately reflect their real-life counterparts, the game looks as though it uses just a few basic model types. There's an athletic build for the quarterback, receivers, and cornerbacks. Linebackers basically have two types, one large-but-fit model and a large-and-obese model. These standardized character graphics - along with the game's uniform animations for catching, running, tackling, and so forth - give GameDay 2001 an artificial look that practically ruins the experience. The sound effects and music in GameDay 2001 are fairly decent. Dick Enberg provides the play-by-play calls, while Phil Simms delivers the color commentary. The commentary and calls are on target with the action in the game for the most part. The game also has what Sony calls ProTalk, which is basically a triggered celebration in which the player says a choice phrase or a taunt. Otherwise, as far as the other sound effects are concerned, the game does a good job of re-creating the atmosphere of a real football game. The little ditties that play during kickoffs and returns, such as Taking Care of Business, add the only sense of realism to the game. In the end, GameDay 2001 for the PlayStation 2 is basically a cleaner looking version of its PlayStation counterpart. That may be good enough for fans who swear by the GameDay series, but those who've seen and played Madden on the PlayStation 2 will immediately see the difference and recognize that NFL GameDay 2001 is merely a PlayStation game posing as a PlayStation 2 product."}