{"ref": "https://www.gamespot.com/reviews/nfl-gameday-2001-review/1900-2617266/", "date": "May 17, 2006", "game_name": "NFL GameDay 2001", "text": "NFL GameDay 2001, like almost every other PlayStation sports game coming out this year, is just an updated and repackaged version of last year's game. While some will see this as a bad thing, others who have either never played a GameDay football game or who are just GameDay fanatics will surely enjoy what is a perfectly sound football game.The usual options from last year are back: all the NFL teams and players, season mode, create-a-player mode, and general manager mode. Also returning are features such as being able to play a specific position or test your skills as a wide receiver, running back, quarterback, or tight end. The play editor has been tweaked a bit, making it easier than ever to make new patterns for your receivers and running backs. The general manager mode has also been changed slightly, mostly to help you with the draft so you can easily see what areas of your team need improvement. You can still do tons of stuff in the GM mode, like play through multiple seasons with one team, cut players, sign free agents, make trades, and even draft players. You can also import players from NCAA GameBreaker 2001 using a memory card. GameDay 2001 plays extremely well, not because it offers anything new, but because it features total-control passing, running, and the proven gameplay of the GameDay series. So while the majority of GameDay fans will agree that the game doesn't offer anything new or innovative this year, it's still just as good as last year's model, which was a smooth, precise, fast-paced game of football. One of the best things about GameDay 2001 is its total-control passing, which lets you lead, overthrow, and underthrow your receivers. Graphically, GameDay 2001 is nearly identical to last year's game, which by today's PlayStation standards is still really good. The only real visual differences between this year's game and last year's are some new animations, new stadium models, and improved player models. The animations that have been added include catching, tackling, and celebration animations. The stadium models look a bit sharper and more detailed as do the player models, which represent their real-life counterparts fairly accurately.The sound effects and music in GameDay 2001 are good, if not extremely familiar. Dick Enberg once again provides the play-by-play calls, while Phil Simms delivers the color commentary. The commentary and calls are for the most part on target with the action in the game. The sound effects and music in GameDay 2001 are pretty much the same material from before - the only exception is that there are a few new celebratory comments. In the end, GameDay 2001, aside from its obvious roster updates and a few minor additions, is totally identical to last year's title, which was a really good game. Players who own GameDay 2000 should rent GameDay 2001 to see whether the minor changes warrant a purchase. Fans of the series will more than likely find the game's lack of innovation to be just plain frustrating. Those who have never played a GameDay football game before will simply and rightfully find the game to be a great football video game."}