{"ref": "https://www.gamespot.com/reviews/pitfall-the-mayan-adventure-review/1900-2769441/", "date": "June 7, 2001", "game_name": "Pitfall: The Mayan Adventure", "text": "Many game players seem to fear that the Game Boy Advance will be overrun with ports of Super Nintendo games and that it won't get its fair share of new and original titles. When you look at the portable system's June 11th launch lineup, this concern seems largely unfounded since there are only a couple of SNES ports among them: Majesco's Earthworm Jim, and Pitfall: The Mayan Adventure. Of the two, Pitfall: The Mayan Adventure received a more lukewarm reception when it was originally released in the early '90s. And it looks like history is set to repeat itself on June 11th, as the game has all the problems of the old one--plus a few new scrapes.Pitfall: The Mayan Adventure puts you in the role of the son of Pitfall Harry, the star of the Atari 2600-age protoplatform games Pitfall and Pitfall II: The Lost Caverns. The spirit of a malevolent Mayan warrior has kidnapped your father, and the task falls to you--Pitfall Harry Jr.--to save him. The game is much of what you'd expect from a 2D Super Nintendo update to the Pitfall series. As in the other Pitfall games before, you swing on vines, leap over pits, jump onto crocodile heads as stepping-stones, and avoid creatures like snakes and scorpions as best you can. But now you can also throw boomerangs, sling rocks, ride ziplines, bungee-jump up to higher ground, and bounce off of super-resilient spider webs. The graphics for the Super Nintendo version of the game were a significant upgrade from the earlier forays, with its detailed backgrounds and excellent character animations. These visual elements remain strong in the Game Boy Advance edition of Pitfall: The Mayan Adventure, but they are severely undercut by the game's transition to the small screen. Dark environments might work well at establishing mood when the game is being played on a television screen, but on the nonbacklit Game Boy Advance, they're a nightmare: Most of the backgrounds exhibit darker colors, and the enemies that inhabit these environments are often painted in similar murky hues. You'll often find your character dying seemingly out of the blue because you weren't able to see that you were being attacked. Most of the time your best clue for finding foes is simply to look for the part of the background that seems to be moving. Otherwise, you'll have a hard time distinguishing your opponents, and this makes the game almost unplayable.The other serious problem with Pitfall: The Mayan Adventure is a holdover from the original: its horrible boss fights. In all 2D platform games, level bosses have a discernable pattern to their attacks that you need to figure out if you want to jump, dodge, and attack your way to victory. This remains true in Pitfall: The Mayan Adventure, but the timing of the bosses' attacks is illogical, and the attacks themselves are often cheap. For example, if you want to avoid the speedy charge of a jaguar, you need to start a jump before the creature even appears onscreen. And if you get hit by any bosses' attack, your character will likely get back up only in time to get hit again. No two seconds of invulnerability here. It's a shame that you have to work so hard to see what's going on in Pitfall: The Mayan Adventure, and it's also a shame that the boss fights are so painfully unenjoyable, because the game isn't half bad otherwise. It has a few other problems (the sound effects and soundtrack are of very poor quality, for instance), but they're relatively minor concerns and could be largely overlooked if the main offenses were fixed. Fans of the series might be able to enjoy Pitfall: The Mayan Adventure on a nostalgic level if they can grit their teeth through its serious flaws. Perhaps the popularity of the Game Boy Advance will inspire Activision to bring another Pitfall game to the platform, this time one built from the ground up with the system in mind."}