{"ref": "https://www.gamespot.com/reviews/soul-bubbles-review/1900-6193110/", "date": "June 30, 2008", "game_name": "Soul Bubbles", "text": "Casting you in the role of a trainee shaman tasked with ferrying souls to the underworld, Soul Bubbles is an amusingly endearing game. From the Yoda-esque tutor who gently teases you through the tutorials, to the relaxing evening sounds of the Savannah as you guide souls into paradise, there is little to dislike about the game. It is simple, well executed, and delightful. The only tools at your disposal as you guide souls to the underworld are bubbles to contain them, and puffs of breath to move them. Paths are often blocked by plants, rocks, and the occasional animal, but you're always shown the way by a trail of stardust. The aim is to guide all seven souls to a gateway cube through increasingly complex mazes, while collecting as much stardust as possible. You can stick to the path most of the time, but you need to venture into hidden areas to collect calabash seeds to reach the end of the game. All the while, your souls sit happily inside bubbles, but they'll condense into a teardrop if they're exposed to air for too long. Some of the mazes also have hungry critters sitting, flying, or buzzing around, and they'll burst your bubbles in an attempt to get at those tasty, tasty souls. The flutter of leaves is one of many nice touches, as is the way your little shaman visibly runs out of puff after an extended blow. The controls in Soul Bubbles are relatively simple. The main action takes place on the touch screen, where you control the shaman and his breath with the stylus. If you tap, he moves; if you draw lines, he breathes in that direction. His abilities are harnessed via the D pad or face buttons depending on your right- or left-handedness. The Tiger mask is donned by pressing right on the D pad, and lets you slice through bubbles. This is useful for maneuvering your souls through tight gaps, as well as cutting sticky vines and dealing with some of the aforementioned baddies. It's also used for rejoining bubbles, which you can do by drawing a line from the centre of one bubble to another. The Elephant mask lets you drain air from your bubbles to make them smaller, and occasionally from creatures such as blowfish, with a simple stylus press. Pressing down on the D pad switches the screens briefly, and a simple tap on the map (which is now on the touch screen) moves your view to wherever you tap. The controls are responsive and intuitive, but they can be slightly frustrating if your bubble is moving quickly. This doesn't happen often enough to cause any serious problems, but there are certainly a few situations that push the control scheme past its limits. In addition to all this, there are environmental puzzles that require you to perform tasks such as cutting your bubbles into smaller pieces, or pushing switches, which requires larger bubbles. Challenges include wind currents that you need to tack across, fires that need to be put out by filling soulless bubbles with water before letting them pop in contact with heat, or rocks that need to be dislodged. Sometimes you need to tap rocks with the stylus to dislodge them, whereas at other times you have to rub them away, and occasionally you must combine handily presented ingredients for a good old-fashioned explosion to clear the path. These obstacles are presented with a pleasant degree of variety, and each new zone presents new types of challenges. None of the early areas are particularly challenging, but the levels are at least varied. The 40 mazes in Soul Bubbles should take four to six hours to play through, and you can choose (to some extent) what order you play them in. Environments range from underground caverns to icy mountains, with flora and fauna appropriate to the locale. The areas slowly increase in complexity, and you unlock new zones by rescuing a certain number of souls. The final zone is unlocked by collecting 50 calabash from the first 35 mazes; there are three in every maze, many of which are off the beaten track and rather cunningly hidden. Getting to the end of a level only becomes a challenge in the penultimate collection zone, which contains a number of interesting physics puzzles, so the sole challenge for the vast majority of the game is in finding all of the hidden passageways and hence all of the calabash. The mazes are well designed overall and enjoyable to breeze through, and the game rarely resorts to cheap tricks to block progress or slow you down. The game is quite forgiving; when greedy critters break your bubbles, you have ample time to gather your souls back up again. Graphically, the game is among the prettiest and most charming that you're likely to find on the Nintendo DS. All of the environments and creatures are rendered well, right down to the way that your little souls panic as they come under attack. The game also features some nice flourishes that add to its overall charm: Leaves on trees flutter as you blow your bubble past them, and the petals of flowers blow off and drift away if caught with a direct blast of air. The music is inoffensive, meandering charmingly along in the background. You only really notice it when your bubbles burst and souls run free, or when another serious danger presents itself and the pitch and tempo turn up a gear. The shallow difficulty curve and lack of challenge in the main goals are the only things that let Soul Bubbles down. Its charm will keep you coming back, and it is well suited to short play sessions. That said, it's just too easy and doesn't really reward you during extended play time. The final quarter of the game does provide a decent challenge and is a worthy end, but it's entirely possible that you'll have drifted off by then or moved on to something that grabs and holds your attention a little earlier. Soul Bubbles is an easy game to recommend to almost anyone despite its flaws, and in the end its charm wins through despite its shortcomings."}