{"ref": "https://www.gamespot.com/reviews/crimson-sea-review/1900-2907927/", "date": "January 3, 2003", "game_name": "Crimson Sea", "text": "The title ~Crimson Sea~ doesn't reveal much about this sci-fi-themed action adventure game from Koei, a company best known for its historically focused strategy games set in Asia. Then again, Koei is no stranger to action games either, what with its well-received Dynasty Warriors series, and Crimson Sea further demonstrates the developer's know-how in this style of gaming. Crimson Sea tells the story of Sho--a prototypical anime hero, complete with spiky hair and mysterious past--as he works with his small band of companions to rid the galaxy of a sinister and overwhelming alien force. Sho battles these foes head-on, using various guns, energy blades, and ~neo-psionics,~ which are essentially magic spells. The action is fast, the missions are diverse, and the visuals are great. Some weak voice acting and occasionally tedious objectives don't really undermine what's by all means a solid game. Crimson Sea takes place in the distant future in a solar system called Theophilus. That sounds Greek, but the rest of the game has an unmistakably Asian flair to it, as all the human inhabitants of Theophilus look much like characters from sci-fi-themed anime, manga, or Hong Kong comic books. They have names like Yangqin and Shami, are dressed in highly elaborate uniforms, and have crazy hairdos, though the dialogue in the game tries too hard to be hip and modern and often comes off as awkward or silly. At any rate, Sho is recruited early in the game to help in a battle against a strange alien menace called the mutons, which generally take the form of swarming buglike monstrosities and are invading Theophilus. A bounty hunter by trade, Sho nonetheless quickly demonstrates leadership skills and becomes the head of a much-maligned squadron of washed-up soldiers. Over the course of the game, you'll control Sho directly from a third-person perspective, though you'll often have several squadmates in tow to help you do all the shooting. Missions involve dealing with droves of mutons, finding various artifacts or specific characters, battling huge muton bosses, and more. Some missions are timed, some are linear, and some are mazelike. Sometimes you get to choose which mission to take on next, and you'll generally get to visit your base of operations in between assignments. Here the game takes on the feel of a role-playing game, as you'll get to speak with your squadmates and various other characters, as well as buy new weapons, weapon upgrades, various items, and new special abilities. The RPG elements extend beyond these sequences and into the actual gameplay somewhat, as you earn experience with the various weapons you use in battle, and you can also find items that boost your maximum health, energy levels, and neo-psionic power. Effectively, these elements work in concert with the liberally used cinematic cutscenes to give Crimson Sea a sense of continuity. Sho has a good number of moves at his disposal, and he'll need to use almost all of them in dealing with the literally thousands of mutons he'll have to fight. His customizable weapon serves both as a firearm and as a sword, and by equipping different barrels and other parts, you achieve different effects such as machine-gun-like bursts, electric attacks, or explosive blasts. Fighting at close range is often quicker and more effective than shooting, however, as Sho can easily execute multiple-hit combos that can devastate foes all around him. He can also perform a quick dash maneuver repeatedly, jump, lock on to targets, and perform a 180-degree turnaround move. Though you can often get through fights just by mashing on buttons, Sho has enough moves that you can fight with finesse, too. The control can be a bit clunky at times, since Sho turns a bit slowly and doesn't automatically target all foes. But still, this is a fast-paced game in which you'll quickly get used to the responsiveness of the main character and start slashing through tons of enemies effortlessly. The camera does a good job of staying focused on Sho and revealing enough of his surroundings that you won't often get blindsided (consequently, Sho is rather small onscreen), and when he gets close to walls, he becomes semitransparent so your view isn't obstructed. An onscreen radar display provides you with a general sense of when danger's nearby, but you'll often have to literally listen and feel for any mutons in the vicinity, as the radar's audible cues and rumble feature are more telling than the graphical display. Crimson Sea runs at a very smooth frame rate and features some great-looking, motion-captured character models in its cutscenes. In fact, it's surprising that some of the cutscenes are prerendered, since the in-engine character models look so good. The visuals aren't quite as impressive during the actual gameplay, since the environments can be repetitive and the characters are small, but the 3D engine does a fine job of rendering lots of enemies without skipping a beat. Some suitable sound effects help make up for the often disappointing voice work, and the Hong Kong-action-movie-style musical score definitely helps establish the game's Asian-style setting. Integrated Dolby 5.1 surround sound support of course makes the proceedings sound even better. The game consists of several dozen missions that at the very least seem challenging, due to the number of enemies you'll have to face. Some replay value can be found in the game's higher difficulty setting and in the customizable weapon system, giving Crimson Sea more play life than the average action game. Though third-person action adventure games are very common these days, Crimson Sea's unusual style and characters and its effective blend of action elements make it stand out."}