{"ref": "https://www.gamespot.com/reviews/naval-ops-warship-gunner-review/1900-6070868/", "date": "July 2, 2003", "game_name": "Naval Ops: Warship Gunner", "text": "Naval Ops: Warship Gunner has two very different components: The first is a detailed ship building and management mode, and the second is arcade-style shooting action. It might seem like a bit of an odd match, and indeed, some effort will be required on the player's part to accept this combination, not to mention the game's science-fiction premise. But if you play the game on its own terms, there's a good chance you'll enjoy it. If WWII naval battles appeal to you, or you just like the idea of firing massive cannons, that chance is even better. You can buy prebuilt historical naval vessels, or you can create truly monstrous ship designs on your own. As the story goes, during World War II, your ship and crew are sucked through a space-time rift into a parallel universe where a battle is being waged against an oppressive empire. With no other options, you join the resistance and do what you can to turn the tide of the war. You choose a nation at the beginning of the game, which determines what types of ships you'll have access to. After an introductory level fought with your country's destroyer, you'll be able to begin customizing your ship or start saving to purchase a new one. Investing in various areas of technology will get you better parts. You can simply keep raising your tech levels and buy the prebuilt ships that become available over the course of the game, but it really pays off to create your own designs. There are literally hundreds of ship components, including a number of control-tower variations, several engine parts, and a huge catalog of weapons and aircraft for ships that can properly deploy them. You can view a 3D model of your ship as you place equipment and make adjustments, and you can even give your ship a name, which along with increased combat capability is the big payoff for all the time spent in the design phase. The interface here is a bit awkward at times, but you should get the hang of it after a few building attempts. The combat has quite a few factors to consider, but once you get a feel for steering your ship and familiarize yourself with the various gauges and indicators, you can easily focus on the action. Calculating distance and lead for the main guns is one of the biggest parts of combat, but there are also machine guns, torpedoes, missiles, and other weapon systems to learn. There is some depth to the combat, though. You're normally up against overwhelming odds, but destroyed enemy vessels occasionally yield power-ups that restore health or refill ammunition. You also have a few emergency repairs for each mission, but they require you to shut off all systems and remain stationary during the process. Positioning your ship properly, equipping the right weapons, and managing range are all important to your success. You also receive pay according to ship type, so if you make it through a mission with a cruiser instead of a battleship, your relative skill will be rewarded. Thankfully, the missions you're asked to run are reasonably diverse. Sometimes you'll be asked to sink a certain number of a type of ship or bombard enemy land positions. Other times you'll have to escort a friendly carrier, hold a position for a certain time, or sink a gigantic supership. While you're fighting the good fight in this parallel dimension, the sights and sounds do make you feel like you're part of this nautical world, but you get the impression that the world is a bit limited. The game uses a very restrained color palette with a lot of blue and gray, which is certainly fitting but provides very little visual variety. At least each weapon on your ship looks exactly like it does and appears right where you placed it in the ship-building phase. The aural aspects of the game are similar in that they're quite fitting, but not very distinct. You'll hear the same music over and over, though there's a nice range of weapon sound effects, and the voice acting is really pretty decent. The sci-fi weaponry definitely helps spice things up. Even with the variety, the action can get a bit repetitive, and you unfortunately won't have access to the most powerful and interesting weapons for quite some time. Being able to customize a unique vessel with all sorts of weaponry helps keep things interesting, but those who aren't especially interested in the subject matter or creating the ultimate battle carrier will find that the game has little appeal. Nevertheless, if you're looking for naval combat on your PS2, Naval Ops: Warship Gunner is by no means a bad choice, in part because it's one of the only choices you have."}