{"ref": "https://www.gamespot.com/reviews/rock-band-2-review/1900-6200987/", "date": "November 12, 2008", "game_name": "Rock Band 2", "text": "The first Rock Band revolutionized the way music games were played; however, its sequel is more of an evolutionary step forward. A huge song list and the ability to play World Tour mode online are the biggest attractions--very little else has changed. It's more of the same, but it's still awesome. The gameplay you've come to know and love from the first game is intact in Rock Band 2. You can sing, play drums, guitar, or bass alone, or get three friends together and jam as a band. There are a few drum solos here and there (scored in the same way as guitar solos) and spoken-word parts seem to be more forgiving, but those are the only noticeable differences in the gameplay. RB2 is compatible with the instruments from the first game as well as the Guitar Hero 3 & World Tour guitar controllers. At the time this review, the World Tour drum kit does not work with the PS3 version of Rock Band 2. If you're in the market for new equipment, Harmonix has released a new guitar and drum kit that are now available as individual purchases or as a bundle. For more information on the new hardware, visit our reviews blog for hands-on impressions. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Rock Band 2 Video Review Like Rock Band? You'll like Rock Band 2. Rock Band was a great party game, but even on the lowest difficulty setting its learning curve could be daunting for some. Nothing would bring a jam session to a screeching halt like failing a song repeatedly because someone couldn't play the bass part on easy. That's no longer a problem thanks to the no-fail setting, which will let you continue rocking even if your band is so awful it makes Paris Hilton seem like a talented musician. Another tool designed to help newcomers (or experienced yet lousy) drummers is the drum trainer. This presents you with a series of progressively more complex beats that you'll need to be able to play to get through the game. It's a neat idea, but once you've gotten the basics down you're probably better off practicing actual songs in Practice mode than spending time with the drum trainer. The fill trainer, however, is more valuable. It teaches you a number of fills to use during gameplay. Not only will this spice up your fills so they'll sound good, but it will also help your bandmates stay with the beat because you're playing something that makes musical sense--not just banging away like some sort of rhythmically challenged kid playing with pots and pans. The Rock Band 2 disc includes more than 80 songs encompassing a wide variety of bands and styles. The full track list is available here. Pearl Jam, The Who, AC/DC, Bob Dylan, Nirvana, Red Hot Chili Peppers, Metallica, and Smashing Pumpkins are among the game's better-known artists, but there are plenty of newer acts, such as Avenged Sevenfold, Interpol, Rise Against, and Paramore. The tracklist is generally quite good, but it's not always fun. The focus on niche artists and lesser-known cuts from popular artists will present a challenge for most singers since it's unlikely they'll know many of the tunes right off. How many folks can even name a tune other than ~Whip It~ from Devo? Yet, we get ~Uncontrollable Urge~ instead. Some songs, such as ~Tangled up in Blue,~ ~Hungry Like the Wolf,~ and ~Bad Reputation~ are simply too long to be enjoyable more than a few times. The ability to play shortened versions as you can in the SingStar karaoke games would have been welcome. It costs a lot of money to look this good. The game comes with a code that will let you download 20 bonus songs. A full list is available here. One thoughtful feature is that you can rip 55 of the 58 songs from the first Rock Band onto your hard drive and play them in Rock Band 2 after paying a one-time five-dollar fee. The songs will take up a hefty 1.5 GB of space and you have to rip them all at once, but after they're on your hard drive you can remove individual songs. Any tunes you may have downloaded for Rock Band are also compatible with Rock Band 2. Both ripped and downloaded songs are seamlessly integrated into World Tour mode. While this adds some variety to the mix, it also means you're going to unlock new songs at a slower pace because of all the old tunes sprinkled in. Speaking of World Tour mode, a few improvements have been made, but it's not a whole heck of a lot different than it was last year. Solo artists will be interested in knowing that World Tour is the only mode in which you can unlock songs; there's no linear solo mode anymore. You'll start by creating a rocker, a band (the random band-name generator is awesome), and then go on tour to earn cash, fans, and stars. Your created rocker is no longer tied to a specific instrument, so you can switch at your leisure. Last year you were forced to bump up the difficulty if you wanted to keep earning fans late in the tour; this year you can gain fans (albeit at a slow rate) even if you're playing at low difficulty settings. As you tour you'll play single songs as well as custom, preset, and mystery setlists. You'll earn transportation so that you can play different cities and new songs as well. You can now hire different promoters and personnel, but they don't have much effect on your progression. There are also challenges to tackle along the way. These score-based challenges are set up by Harmonix and pit your rock skills against the rest of the world. This is fun if you're amazing, but when you average 99 percent on expert over three songs and you don't crack the top thousand, you realize the mode isn't for everyone. Battle of the Bands mode, which lets bands go head-to-head to see who's the best, is another new score-based option that's good for skilled players with a competitive streak, but less enticing for casual players. The big addition to World Tour is that you can have people join your band or you can join their groups and play through the mode online. This is great if you're playing with friends and you're working your way through your own tour, but it's significantly less fun when playing with random strangers online--you're not earning any progress for your own band (only cash), and you're stuck playing the songs they want to play. That said, its inclusion is the most notable new feature and is a welcome one at that. Bust a high score in a challenge and prove that you're the king of rock. It shouldn't be much of a surprise that Rock Band 2 looks just like the first Rock Band. Custom rockers have more outfits to choose from and look truly outrageous. Their onstage moves match their clothing, too. All band members are animated to the music and feature a wide range of moves that, while hard to notice while you're playing, are entertaining for anyone watching you play. The grainy filter that was a tad overdone in the original game is toned down here, and the graphics look better for it. Needless to say, the game sounds fantastic. Not only do the original recordings add a lot to the proceedings, but little touches, like the crowd singing their favorite parts of the song, really make it feel as if you're playing a live set in front of an appreciative audience. Rock Band 2 delivers about what you'd expect from a game released just 11 months after its predecessor. That may be a little underwhelming for people who put their lives on hold for the original, but you're still left with a fantastic experience that's unmatched as far as party games go."}