{"ref": "https://www.gamespot.com/reviews/james-bond-007-everything-or-nothing-review/1900-6086008/", "date": "May 17, 2006", "game_name": "James Bond 007: Everything or Nothing", "text": "Just eight months after 007: NightFire landed in stores, EA Games has published another installment in the James Bond franchise on the Game Boy Advance. This latest game is called James Bond 007: Everything or Nothing, and it ditches the first-person shooter design from the previous game for a more traditional isometric guns-and-fists setup that's better suited to the GBA's graphical capabilities and button layout. The single-player mode doesn't take more than a few hours to finish, but the entire ride should be plenty enjoyable for Bond fans and action game lovers alike. Everything or Nothing is basically an isometric action game, but sneaking up on enemies does factor in as to whether or not you can afford to buy upgrades later on. One of the first things you'll notice after playing for a few minutes is how well the game copies the look and feel of a typical Bond film. Without much fanfare or explanation, the opening stage throws you into the middle of a collapsing building with nothing more than a pistol and an arrow that points the way out. After you gun down a few bad guys and take a run down the side of the building using Q's rappel line, M appears on the commlink to give you the lowdown on what just happened. As it turns out, the information retrieved from the building suggests that a man named Dr. Diavolo is behind a series of nanotechnology thefts that have occurred in recent months. Apparently, he plans to take over the world with an army of nano-enhanced supersoldiers. Each of the game's 12 missions does a nice job of portraying Bond's jet-setting lifestyle, as you'll travel between various cities in Russia, Africa, and South America in your search for clues while attempting to sabotage Diavolo's operations. However, the greatest aspect of the game's presentation revolves around the voices and likenesses used for James, M, Q, Diavolo, and the rest of the characters. They are all actually provided by the real-life actors who portray them in the movies. Bond looks like Pierce Brosnan, M looks like Dame Judi Dench, Diavolo is actually played by Willem Dafoe, and so on. Some levels borrow a page from Spy Hunter and put you behind the wheel of Bond's Aston Martin. Roughly three-quarters of the game's missions take place on foot. Each stage has a main objective as well a set of optional goals associated with it. These goals usually involve collecting items, such as data discs and nanotech pieces, or killing a set number of enemies by using James' sneaking abilities. Stealth plays a big role in Everything or Nothing, and, much like Konami's Metal Gear Solid, James can sneak behind enemies and take them out with a choke hold rather than alert other adversaries in the area by firing a gun. Although there are a few spots where you have to destroy oil drums or hack into computers to get the items you need, most environments don't offer much in the way of interactive disposable objects. You can hide behind pillars, tables, and even people in a few levels, but your bullets will just bounce off as if you were standing behind a brick wall. James has access to a wide variety of weapons, from his trusty Walther PPK pistol to a couple of different machine guns--not to mention a healthy inventory of grenades, land mines, and medical kits. While this sort of arsenal does offer numerous opportunities for you to just cut loose and enjoy Everything or Nothing as an action game in the traditional sense, ammunition supplies are limited enough that you absolutely need to sprinkle in a few stealth kills to have enough bullets left for enemies that don't respond well to choke holds or Bond's basic punch and kick attacks. At the end of each level, you have the chance to go into Q's lab and can purchase any of a dozen upgrades that can improve James' armor, speed, and aiming characteristics. The unique thing about this setup is that the money you have to spend is based on the style points you've earned by completing missions goals and by performing stealth kills. If you run through each mission just blasting away at every enemy you see, you may not have enough cash to buy some of the better gadgets in the shop--one of which is an excellent nanobot system that gradually restores your health while you walk around in a level. Other gadgets include a medical kit generator, a portable hologram system, a device for deactivating the shields around nanobot-enhanced enemies, and a battery-powered cloaking device. Even though you do have to purchase some of these upgrades from Q's shop, a few of the nicer ones, such as the cloaking device, are given to you after you complete a particular mission. The cutaways tell the story in excellent Bond fashion. M, Q, Bond, and the rest of the usual cast look like they're supposed to. The remaining missions borrow a page right out of Spy Hunter and put you behind the wheel of Bond's weaponized Aston Martin car. The viewpoint is the same isometric layout that's used in the foot-based missions, only now you're limited to moving left, right, and forward on a road that stretches diagonally across the screen. Typically, the goal in these stages is to destroy the heavily armored vehicle that's ahead of you on the road. Your car is equipped with machine guns, rockets, and oil slicks, which also prove helpful for dealing with the smaller cars and trucks that appear at regular intervals to support the main opponent. These helpers usually come equipped with their own machine guns or land mines. While the driving stages bring a nice change of pace to the formulaic run-hide-shoot action of the foot-based missions, they're a little too frustrating, since the amount of road you actually get to use is about one-third of what's visible. Where Everything or Nothing comes up short is in terms of overall length. Even if you take the time to complete every subgoal, it only takes about three hours to finish the single-player mode. Once you've seen all of the cinematic story sequences, the game has about as much replay value as your average arcade shoot-'em-up, so it's good for a cathartic bullet-fest once in a while, but that's about it. Some people may squeeze a bit of extra longevity out of their purchase by linking together with their friends and participating in the four-player deathmatch mode, provided, of course, they know three other people who also own their own copies of the game. Bond fans will surely get a kick out of Everything or Nothing. Still, it's fun while it lasts, and the overall quality of the presentation makes up for some of what the game itself lacks. The environments have a great deal of depth to them, even though the graphics aren't really 3D, and the characters display a wide range of movement. Watching enemy soldiers slump to the ground after a choke hold is immensely satisfying. The Bond related in-jokes that crop up once in a while are hilarious too. An especially noteworthy example is a henchman you'll come across in Diavolo's lair who's standing around and complaining about his former boss, Max Zorin from Bond film number 14, A View to a Kill. The audio is first-rate as well. In addition to the phrases that M and Q speak during the cutaways, most enemies have a variety of phrases to say depending on what you're doing at the time. In particular, if you make a ruckus near an enemy, he'll often say something like, ~Wait, what was that?~ This is also probably the first GBA game to have a full-length song, complete with vocals, during its credits sequence. Popular recording artist Mya, who also has a brief role during the game, voices the song. Pick up James Bond 007: Everything or Nothing if you're in the mood for a brief yet satisfying action game that faithfully captures the look and feel of a typical James Bond movie."}