{"ref": "https://www.gamespot.com/reviews/surgeon-simulator-anniversary-edition-review/1900-6415847/", "date": "September 10, 2014", "game_name": "Surgeon Simulator 2013", "text": "Playing Surgeon Simulator Anniversary Edition is akin to participating in a joke where you are the punch line. It's a game that is deliberately designed to feel unwieldy as you perform operations that require dexterity and finesse. Neither are to be found here; instead, you move your hand around the operating table and manipulate individual fingers to grab instruments and pray you don't accidentally drop them in the patient's exposed chest cavity. This is as much a ~simulator~ as Mario Kart is a driving test.Surgeon Simulator has been available on PC and tablets for over a year now, and each version has seen gradual content additions since its first release. On the PlayStation 4, the Anniversary Edition packages everything into a single download. The full range of surgeries is ready and waiting--heart transplants, kidney transplants, brain surgery, eye surgery, and teeth pulling. Each of these operations can be performed in different environments: an operating theatre, on a wheelie bed while running down a corridor, in the back of a bumpy ambulance, and in zero gravity. Just like the surgical instruments, bones and organs conform to a rudimentary physics system, and the different environments function as difficulty modifiers.It boggles the mind to understand how one could possibly perform these operations in zero-G given how fiendishly difficult their terrestrial versions are themselves. This is all part of the joke: you're expected to fail spectacularly and kill your patient multiple times. What ensues is a unique approach to interactive slapstick comedy that sees you attempting to open a ribcage but instead accidentally dropping a live buzz saw among the patient's exposed internal organs.In motion control mode, you rotate the arm and tilt the wrist by waving the gamepad in a similar fashion.The thing is, this joke is far funnier on PC than it is on PS4 because of the way the gamepad controls the surgeon's hand. With a mouse and keyboard, you have a far greater degree of accuracy and finesse available to you that, with practice, feels like it can be used constructively. Each individual finger of the surgeon's hand can be opened or closed with a separate key on the keyboard. Positioning the hand with the mouse allows for more precise, minute movements, which are necessary to complete the surgeries.On the PS4, the gamepad tells a different story. In motion control mode, you rotate the arm and tilt the wrist by waving the gamepad in a similar fashion. The interesting thing is that this actually feels more intuitive than the same motions on the mouse do. With the mouse, it feels like you are controlling a piece of machinery, making individual adjustments to the wrist's angle, the elevation of the hand, and the rotation of the arm, whilst stopping in between each step. That is where the PC's accuracy comes from. With the gamepad, you are making all of these motions at once. It feels far more fluid, but it's also impossible to achieve the same level of accuracy as in the PC version.Compounding this is the analogue nature in which the gamepad's triggers are used. You do not have fine control over the surgeon's fingers; instead, the harder you press the right trigger, the more fingers that close in a gripping motion. It's just plain frustrating attempting to be accurate this way. The elevation of the arm is also controlled in a similarly analogue fashion with the left trigger, and it too suffers from imprecision. An alternative control method which involves using the right thumbstick to replace the motion control components is less intuitive than the motion control itself, and still suffers from a lack of accuracy due to the analogue nature of the stick.But here's the thing: lack of accuracy in the controls is the whole point of Surgeon Simulator. That is the joke. However, when it comes to the difference between fun and frustrating, it's a matter of degrees. Playing Surgeon Simulator on PS4 is like listening to someone stumble through the telling of what could have been a hilarious wisecrack. The addition of achievements, some cheeky unlockable secrets, and a slight graphical upgrade over its original PC release doesn't make it funnier."}