{"ref": "https://www.gamespot.com/reviews/motogp-review/1900-6086104/", "date": "January 6, 2004", "game_name": "MotoGP", "text": "MotoGP for the Xbox was hailed in 2002 for delivering one of the most accurate and exhilarating re-creations of the sport of motorcycle racing to date. Now the game is available on the N-Gage, complete with some of the riders, motorcycles, and tracks that make the MotoGP racing circuit what it is. Unfortunately, the portable version of the game fails to portray the actual thrill of racing at speeds in the neighborhood of 200mph, and overall, it's a real dud. The game has no sense of speed. Upon starting the game, you'll have just two tracks and a handful of riders to choose from. As is the case with most racing games, you'll have to unlock additional tracks and riders by competing and winning races. The game features a number of different racing modes and offers the option of creating and saving your own tracks by using a simple editor. The actual act of racing leaves much to be desired, however, as the controls are far from responsive. Additionally, the game is completely and totally unable to deliver any sense of speed whatsoever. Once the green flag is dropped, you'll find yourself holding down the 5 key to accelerate, and even when you reach your top speed, the game truly doesn't make you feel like you're going any faster than if you were walking your bike along the track. The game uses the 7 key for braking. Control-wise, that's all there is to it. There are no options for manual shifting, front or rear brakes, or distributing your weight on the bike, which are all crucial when it comes to depicting motorcycle racing in a realistic fashion. Since the game is incapable of delivering any sense of how fast you're traveling, it makes successfully taking many turns next to impossible until you become intimately acquainted with each and every turn of every track so that you know exactly how long you can accelerate before having to apply the brakes. This lack of realistic speed is not aided by the fact that the game's controls are very unresponsive and clunky. While it is painfully clear that this version of MotoGP is not attempting to be the accurate racing simulation of its namesake, it is unable to deliver the simple gameplay of an arcade racing game. This failure to deliver basically ruins all of the game's modes, up to and including the Bluetooth multiplayer support. The audio in the game matches the gameplay in terms of quality. There's a small selection of tinny music played at the menu screens and an awful rendition of a motorcycle engine throughout each and every race. Even if you're a fan of racing, this game is not worth your time. The game also fails to deliver visually. While it does contain many of the same riders and motorcycles of the MotoGP circuit, when rendered in just a handful of polygons and placed on a screen as small as the N-Gage's, they just look like a colorful mess--above and beyond anything else. The tracks you race on also look very similar to each other, as they are laid out with a small assortment of tiles that make up the environments. Much as the game is incapable of delivering a sound gameplay experience, MotoGP is also unable to produce graphics that are anywhere near interesting. At any rate, MotoGP for the N-Gage is a failure of a racing game any way you look at it. With horrible controls, no sense of speed, and blotchy graphics, this game simply isn't worth your time or money, no matter how big a fan of the MotoGP series you are."}