{"ref": "https://www.gamespot.com/reviews/resident-evil-deadly-silence-review/1900-6143721/", "date": "June 25, 2007", "game_name": "Resident Evil", "text": "Nearly 10 years after Resident Evil first shocked and amazed game players around the world, it's been squished down to a portable format that preserves most of what made the original so great. Resident Evil: Deadly Silence is basically a straight port of the 1996 PlayStation classic, though it adds a few neat twists made possible by the Nintendo DS. While the graphical presentation isn't as impressive as you'd expect from Resident Evil, it's still impressive to have the whole game playable in the palm of your hand. More importantly, Resident Evil DS still packs some good freaky fun, and it's a cool way for the series' newer fans to experience the game that coined the phrase ~survival horror.~ Now you can take Resident Evil with you wherever you go. The 1996 horror classic still holds up well to today's standards. Resident Evil's story comes straight out of a horror movie--a bad one if you judge it by the quality of the so-awful-it's-funny voice acting and the cheesy full-motion video cutscenes seen in the intro and endings. But apart from some dialogue that's every bit as painful as the various gruesome-looking scenes of violence the game is filled with, the story of Resident Evil effectively sets the stage for plenty of tense and suspenseful action. The premise is simple but compelling: The elite S.T.A.R.S. alpha team is sent in to reconnoiter with bravo team, which disappeared while investigating a disturbance near an old mansion. But alpha team is promptly attacked by monstrous things and forced to split up. Now Chris Redfield and Jill Valentine, together with several other surviving comrades, are trapped in the mansion and trying to regroup and escape. But are their conventional weapons enough to protect them against the living dead? After an awkward start, the story becomes quite captivating as Chris and Jill begin unraveling the mysteries of both their hideous enemies and the mansion. Similarly, the gameplay feels rather clunky at first, but once you get accustomed to the controls and few odd quirks, it gets fun. The action is still satisfyingly visceral after all these years, so you can look forward to blasting zombies' heads off, sticking your knife into killer crows, stomping baby giant spiders, and other good stuff like that. Aiming and shooting is as simple as pressing and holding the right shoulder button to ready your gun, then tapping the fire button to squeeze off rounds. However, the tight corridors of the mansion coupled with the relative scarcity of ammo means you'll really need to make your shots count, especially since some of your foes aren't as slow and lumbering as the zombies you'll frequently encounter. At least it's easy to tell where you're going; the top screen on the DS persistently tracks your progress on a highly legible map. The top screen also starts flashing when you're injured, a useful but somewhat distracting visual cue that lets you know when you should be scrounging for a health power-up. Moving around is trickier than shooting, partly because the game's cinematic camera angles can be disorienting. Pressing up on the D pad always makes your character walk forward, which doesn't seem intuitive at first but helps let you stay in control as the game keeps switching up camera angles from one static scene to the next. This control scheme carried the Resident Evil series through numerous installments, but the behind-the-back perspective of last year's amazing Resident Evil 4 changed all that. If you've played RE4, you'll probably find it tough to go back to these old controls. A few other gameplay contrivances stick out, betraying the fact that this is an old game. Your characters' inventory space is very limited, for example. Chris can only carry six items at a time, so if you've got two keys, a shotgun, some spare shells, and a medicinal herb, you're practically full. If your inventory's tapped, you can't just drop stuff to make room for more, but must find a storage chest in which you can dump off your spare equipment. In some parts of the game, you naturally wind up going back and forth through areas multiple times just because you don't have enough room to transport all the stuff you find. Also, your ability to save your progress is limited to the number of ink ribbons you have. You use these up at the typewriters scattered around the mansion each time you save. This limited save system might seem cruel and unusual, but you'll probably grow to appreciate how it helps build tension without really hurting gameplay--besides, you'll find ink ribbons in fairly generous supply. However, the inability to save at any time or as often as you like means Resident Evil DS isn't really well suited for quick play sessions, which you might expect out of a portable game. The new first-person stabbing sequences are reminiscent of the House of the Dead series. It's a jarring but entertaining addition. Resident Evil DS features a classic mode that's mostly identical to the 1996 original, the updated ~rebirth~ mode that introduces some new surprises, and a Wi-Fi mode in which up to four players can either compete or cooperate as they fight through several different areas. You've also got two playable characters to choose from and multiple endings to discover in the single-player modes, and many more characters are unlockable for use in multiplayer, which helps create lots of lasting value. The underlying gameplay is a pretty simple mix of blasting zombies and other monsters at close range while solving occasional puzzles, but it's good enough to sustain multiple plays through the storyline (which takes maybe six or seven hours the first time), especially since enemy placement changes depending on the mode and your character. Chris and Jill take slightly different paths through the game, but apart from that they play almost identically. Jill has an easier time because she can pick certain locks and carry more stuff, but Chris can take more punishment. Both will need to overcome a few fairly well-thought-out puzzles besides just blasting zombies, though. The game's occasional puzzles are appreciably more interesting in the rebirth mode, which challenges you to use the DS touch screen and microphone in a few clever ways. For example, you'll need to blow into the DS' microphone to try to resuscitate an injured team member, and you'll even need to do the equivalent of that popular parlor trick where some tough guy quickly stabs a knife in between his fingers without cutting his hand. Rebirth mode packs a number of neat little surprises such as that, but one of the most jarring is how first-person-perspective battles occasionally break out when you enter a new room. All of a sudden you'll see enemies shambling towards you. You can't move, but instead must slide across or poke at the touch screen to slash at your foes with your knife. These bits seem really tacked on at first but they're pretty entertaining, especially since you can perform flashy-looking critical hits by hacking at your enemies the instant before they hit you. It doesn't take that long to finish Resident Evil once, but there's plenty of good reason to go back through this game multiple times. The rebirth mode is generally more action-packed than the classic mode, forcing you to take on more monsters but also giving you a lot more ammo--but that doesn't automatically make it better, since having to really watch your ammo while not knowing whether something's going to jump out at you around the next corner is what Resident Evil's always been about. Having more enemies to fight gradually just lessens the impact of each individual encounter. At any rate, it's worth playing through both modes if only to appreciate the differences. Some unlockable extras give you further incentive to explore the single-player modes, but you've also got the multiplayer options to consider. You need from two to four players (each with a DS and a copy of the game) in order to play these, and you can choose either a versus or cooperative game type. These modes can be a good diversion but aren't quite what you'd probably hope for, especially since other players are depicted on your screen as large colored stars, rather than as other operatives running and gunning alongside you. Both multiplayer modes put you in one of several different maps based heavily on areas from the single-player storyline, and whether you're playing cooperatively or not, you're still trying to reach the goal area as quickly as possible within a time limit. The difference is, in the versus mode you can indirectly slow your opponent down by shooting certain types of foes, while in co-op, you share the same health meter and have other incentives to work closely with your allies. Since you can't directly interact with other players, let alone see them, the multiplayer modes in Resident Evil DS aren't inherently that engaging. But they're a nice extra. The graphics aren't jaw-dropping, but they definitely get the point across. And the gory bits are still nice and gross. When Resident Evil first appeared on the PlayStation, its incredible 3D graphics did a lot to draw players in. On the DS, the game still looks good if not particularly impressive, mostly because the prerendered backgrounds look plain and grainy on the system's small screen. Thankfully, the 3D characters moving around in the environments are more detailed, and the game's gore effects are as over the top as ever. Fans will even spot some new animations in the rebirth mode. It's remarkable that all the content of Resident Evil now fits onto a tiny DS game card, but it's still a bit of a shame that the visuals suffered some in translation. Meanwhile, the audio is completely intact, including all that bad dialogue that's just as amusing today as ever. There's plenty of eerie music throughout the game, along with some terrific sound effects, like the chilling ~clack, clack, clack~ of some of your foes' clawed footsteps. The audio isn't just for show, either--it's often the only indication you'll get that there's danger lurking nearby. The excellent stereo separation on the DS also helps you to use sound to your advantage, since you can actually hear where a noise is coming from relative to your character. You know a game's a classic when you can play it years later and still have a great time. Resident Evil: Deadly Silence is surprisingly successful at translating the scary bits of the original to a much smaller format, and the end result has a lot to offer Resident Evil fans as well as those who've always wondered what the fuss is about. You wouldn't expect a portable game to be able to scare you, especially since this version's visuals simply aren't on par with the cutting-edge graphics Resident Evil is known for. But Resident Evil DS packs in a lot of gory, atmospheric moments. It's pretty wild that now you can play a game like this on the go. The game's occasional puzzles are appreciably more interesting in the rebirth mode, which challenges you to use the DS touch screen and microphone in a few clever ways. For example, you'll need to blow into the DS' microphone to try to resuscitate an injured team member, and you'll even need to do the equivalent of that popular parlor trick where some tough guy quickly stabs a knife in between his fingers without cutting his hand. Rebirth mode packs a number of neat little surprises such as that, but one of the most jarring is how first-person-perspective battles occasionally break out when you enter a new room. All of a sudden you'll see enemies shambling towards you. You can't move, but instead must slide across or poke at the touch screen to slash at your foes with your knife. These bits seem really tacked on at first but they're pretty entertaining, especially since you can perform flashy-looking critical hits by hacking at your enemies the instant before they hit you. It doesn't take that long to finish Resident Evil once, but there's plenty of good reason to go back through this game multiple times. The rebirth mode is generally more action-packed than the classic mode, forcing you to take on more monsters but also giving you a lot more ammo--but that doesn't automatically make it better, since having to really watch your ammo while not knowing whether something's going to jump out at you around the next corner is what Resident Evil's always been about. Having more enemies to fight gradually just lessens the impact of each individual encounter. At any rate, it's worth playing through both modes if only to appreciate the differences. Some unlockable extras give you further incentive to explore the single-player modes, but you've also got the multiplayer options to consider. You need from two to four players (each with a DS and a copy of the game) in order to play these, and you can choose either a versus or cooperative game type. These modes can be a good diversion but aren't quite what you'd probably hope for, especially since other players are depicted on your screen as large colored stars, rather than as other operatives running and gunning alongside you. Both multiplayer modes put you in one of several different maps based heavily on areas from the single-player storyline, and whether you're playing cooperatively or not, you're still trying to reach the goal area as quickly as possible within a time limit. The difference is, in the versus mode you can indirectly slow your opponent down by shooting certain types of foes, while in co-op, you share the same health meter and have other incentives to work closely with your allies. Since you can't directly interact with other players, let alone see them, the multiplayer modes in Resident Evil DS aren't inherently that engaging. But they're a nice extra. The graphics aren't jaw-dropping, but they definitely get the point across. And the gory bits are still nice and gross. When Resident Evil first appeared on the PlayStation, its incredible 3D graphics did a lot to draw players in. On the DS, the game still looks good if not particularly impressive, mostly because the prerendered backgrounds look plain and grainy on the system's small screen. Thankfully, the 3D characters moving around in the environments are more detailed, and the game's gore effects are as over the top as ever. Fans will even spot some new animations in the rebirth mode. It's remarkable that all the content of Resident Evil now fits onto a tiny DS game card, but it's still a bit of a shame that the visuals suffered some in translation. Meanwhile, the audio is completely intact, including all that bad dialogue that's just as amusing today as ever. There's plenty of eerie music throughout the game, along with some terrific sound effects, like the chilling ~clack, clack, clack~ of some of your foes' clawed footsteps. The audio isn't just for show, either--it's often the only indication you'll get that there's danger lurking nearby. The excellent stereo separation on the DS also helps you to use sound to your advantage, since you can actually hear where a noise is coming from relative to your character. You know a game's a classic when you can play it years later and still have a great time. Resident Evil: Deadly Silence is surprisingly successful at translating the scary bits of the original to a much smaller format, and the end result has a lot to offer Resident Evil fans as well as those who've always wondered what the fuss is about. You wouldn't expect a portable game to be able to scare you, especially since this version's visuals simply aren't on par with the cutting-edge graphics Resident Evil is known for. But Resident Evil DS packs in a lot of gory, atmospheric moments. It's pretty wild that now you can play a game like this on the go."}