{"ref": "https://www.gamespot.com/reviews/resident-evil-review/1900-2549086/", "date": "December 1, 1996", "game_name": "Resident Evil", "text": "At the time of this writing, Resident Evil - a super-slick, realistically mapped, and ultra-violent Alone in the Dark - is at the top of the heap in cinematic 3-D adventure games. It's one of the best buys for the Playstation, and one of those rare games that's almost as entertaining to watch as it is to play.The story: A police special tactics and rescue squad (S.T.A.R.S.) vanishes in a remote location recently plagued by bizarre disappearances and deaths. Its sister team lands to investigate and is quickly set upon by creatures who force them to run for ~shelter~ in - you guessed it - a Creepy Old Mansion. Sure, we've all seen this movie before... but this time, we get to play it. And like a movie, Resident Evil deserves, almost demands, to be experienced in the dark.In addition to its challenging cinematic gameplay (the polygonal characters' actions are witnessed and controlled from ~camera angles~ on par with any Hitchcock film), Resident Evil dishes out some truly frightening, skin-crawling moments. The wobbly, shambling, re-animated inhabitants of the mansion move with eerie fluidity; and the soundtrack veers from fairly typical, ominous, incidental stuff to discordant, disturbing, metallic shrieks that sound as though they're being played backward. The cinematic shift from room to room virtually guarantees that the incautious explorer will, at some point, turn a blind corner and run smack into something really dreadful. Even the extra-careful adventurer will have things jumping out at him at the most unwelcome moments. And thanks to the ingenious dramatic pacing of the game, just when you think things can't possibly get any worse, they suddenly do.Two flaws exist in this game, and they're big (but can be forgiven in the context of the larger picture). First, the game relies on ~storage areas~ scattered throughout the mansion. Excess inventory must be kept there until needed. Only able to carry six or eight items (depending on the character selected), the player must constantly swap stored items for ones he is currently carrying. In other words, it's not possible to leave a shotgun on the dining room floor and come back for it later. Therefore, to get needed items, the player must go back to a designated storage room, sometimes through areas crawling - literally crawling - with unpleasant things. Not only is this unrealistic, but it also just feels wrong. This first flaw, however, is nothing compared to the second: the (thankfully) isolated cinematic sequences showing the interactions of the S.T.A.R.S. team members. These scenes are filled to the vomit-line with some of the most hokey, badly-translated, drama-killing, god-awful voice acting ever burned onto a disc. Oh well.Fortunately, those two forgivable flaws are not why players should roam the haunted house. They should go to prowl the gorgeous, photorealistic, dilapidated rooms and abomination-filled corridors; to use shotguns and rocket launchers to blast mutant dogs, former humans, and bloated, monstrous spiders into wall-spattering gristle; to stomp the occasional shambling zombie into dead-again mush before punting its discolored head down the hall; and, every once in a while, to genuinely get the hell scared out of them."}