{"ref": "https://www.gamespot.com/reviews/supreme-commander-review/1900-6193010/", "date": "June 25, 2008", "game_name": "Supreme Commander", "text": "It's hard to guess how a game like Supreme Commander for the Xbox 360 gets approved for a retail release. It's a technical disaster, prone to frequent lockups, constant stuttering, and plenty of buggy behavior. These issues are maddening, because at its core, Supreme Commander is a great real-time strategy game, filled with tactical intricacies that function on a massive scale. On the PC, it worked brilliantly. Here, it isn't just rough around the edges--it's just plain rough. Fantastic strategic gameplay deserves better, and it's astonishing that it was allowed on store shelves in its current state. Supreme Commander is strategy on a massive scale. The game's frame rate and general performance are absolutely atrocious. The game engine hitches every few seconds, and standard tasks like zooming in and out cause it to stutter. Explosions will cause the frame rate to drop to a crawl, which makes Supreme Commander's famous nuclear blasts more annoying than exciting. Whenever a superior's talking-head portrait is about to appear onscreen during the campaign, you can tell because the game will pause for a couple of seconds. Saving a game or reaching the end of a mission might cause a complete game crash or system freeze--an issue that occurred close to a dozen times during our play-testing, on multiple machines. Just moving around the menus results in weird, unexplainable slowdown. One mission can be easily broken in at least two different ways, so you could potentially find yourself reloading a saved game after you find your efforts have been wasted. It's apparent that either the Xbox 360 version of Supreme Commander needed more time in development, or that it is simply not a good fit for the hardware. Supreme Commander's story isn't terribly involving, but it sets the stage for battles that feel truly consequential. Three factions with human roots--the United Earth Federation, the AI-infused Cybran Nation, and the spiritually enlightened Aeon Illuminate--fight for their rightful place in the galactic landscape. The storytelling isn't particularly noteworthy on its own; missions are doled out by your superiors, and they'll occasionally appear in pop-up windows during the campaign. What makes the proceedings so interesting is that there is no clear bad guy: Each faction fights for seemingly rational values. Whether or not the plot is meant to parallel real-world politics is up for debate, but it's striking that these different factional philosophies are functionally quite similar to one another. Even on a universal scale, humanity's splinter cells have more in common than they think. Each of the three campaigns features six missions, which doesn't seem like many. However, these levels can last for two or three hours, and maps that look relatively small will continually expand over the course of the mission until the battlefield seems impossibly huge. To help you keep these gigantic playfields under control, Supreme Commander features the most impressive zoom function yet seen, allowing you to pull the camera right up to your units, and pull out to see the entire battlefield at once. These gargantuan maps hold hundreds and hundreds of units at any given time, so it's not uncommon to have multiple battles raging at once, while smaller skirmishes take place around the perimeter. Thankfully, a number of automated functions help you streamline the process so you can concentrate on the bigger picture. For example, you can queue up multiple tasks for engineers (your primary construction units) and set multipoint patrol routes, a very handy way to keep your flying units constantly engaged with the enemy. Spiderbots are always an imposing sight. The sheer number of units and tech levels open up endless strategic possibilities. Your central unit is the Armored Command Unit (ACU), which can perform standard building tasks, and is upgradeable in a number of different ways, depending on whether you want to use it in battle or as engineer support. There are an insane number of structures and units to consider, from mass storage units and shield generators, to radar installations, to hulking units like the imposing galactic colossus that lumber across the land. If you like to turtle up and play the waiting game, there are tons of defensive options, like antiair installations and stealth generators. If you're the aggressive type, you can take to the air, use the land to your advantage, or bring the battles to sea, where attack submarines and battleships can lay waste to your foe's unprotected coasts. Options exist whether you like to creep toward your enemy's base and let artillery pound on it, lay back while you build up technology, or use transport aircraft to keep a constant rush of attack bots streaming toward your opponent. There are many viable ways to play Supreme Commander, and they are all balanced well. The control scheme and interface, always a potential worry in a console RTS, is generally up to the task of keeping battlefields under control. The busy heads-up display elements of the PC version have been stripped away, replaced with two simple bars that represent your two basic resources: mass and power. The D pad is your gateway to command and building queues. Selecting a unit and pressing up will bring up a radial wheel, where you can choose simple commands like attack or stop, or more unit-specific commands, such as powering down a shield generator or building a nuke. Pressing right produces a build and upgrade wheel, where you can level up your structures or produce units. You bring up your grouping wheel by pressing down on the pad. Here, you can select all units of a certain type, or create and select custom control groups. The scheme works fine and isn't too cumbersome, and there are some nice touches that strategy enthusiasts will appreciate. For example, when queuing up units, you can hold a bumper to produce five at a time, rather than pressing A repeatedly. Setting up order queues for your engineers and ACU is automatic, so you can easily get your engineers on a set of tasks and leave them be. The downside is that you have to manually issue a stop command if you want them to do something different, which isn't usually too much of an inconvenience. However, even a unit's automated journey to a rally point is considered as a queued activity; if you want to issue an order and have the unit begin before it has arrived at the rally point, you have to issue a stop order and issue the new command, which is annoying and should not be the case. The game engine has a hard time rendering even the simplest visuals. Some technical issues get in the way of the scheme. For example, if you use the grouping wheel to choose all available engineers, the option may not work. The wheel may indicate a number of idle engineers, but selecting the grouping may not do anything, so you'll have to search for them manually. It also appears that the friendly artificial intelligence is broken. Occasionally, units that should be performing a patrol will stop for no apparent reason. Other times, your engineers will stop midqueue and sit idly, and you will have to issue a stop command and reissue orders from scratch. These occasions aren't frequent, but they are common enough to be annoying. Outside of the campaign, you can play stand-alone skirmishes, or you can take the fight to Xbox Live, where up to four players can compete. While there aren't as many options as in the PC version, there are an insane number of ways to customize your games, along with two new modes: King of the Hill and Command Point. In King of the Hill, you must send your units to a designated area on the map to earn points, while Command Point is a Battlefield-type game where you must capture all of the designated locations on the map. The latter is easily the better of the two modes, and games can last for quite some time, as the constant tug of war will keep you engaged across the entire map at once. In every case, the large maps (though not as large as the biggest ones in the PC version) lend themselves to a variety of tactics, and the resulting complexity requires flexible thinking. The game's terrible performance doesn't seem to contribute to any online lag, and we didn't experience any disconnects, though the visual slowdown can get so severe that it's hard to tell one way or another. You can play ranked or unranked games, and leaderboards track the best of the ranked bunch. The best visual aspect of Supreme Commander is its scale, since you can zoom in close to the action, or zoom out to see the entire enormous battlefield, where every unit is represented by simple geometry. Because you spend so much time playing Supreme Commander with the camera pulled all the way back, you'll get used to that graphical simplicity. Up close, however, the game isn't much of a looker, either. Textures are bland, units lack detail, and environments are fairly devoid of anything interesting to see. Some loss of visual fidelity, in light of the game's massive scope, is understandable--but not to this extent. Blowing things up is fun. The resulting frame rate drop is not. The scaling of the audio is even worse, and doesn't translate a sense of aural distance very well. If you are using headphones or standard television speakers, you will get an earful of explosions and audio effects that sound harsh and tinny. A better speaker setup will yield somewhat better results, but even then, the sound is abrasive, as if the game is trying to squeeze out more sound than it should. As before, the highlight of the game's sound design is the aggressive symphonic soundtrack, which never gets in the way but sets the proper warlike tone for the colossal battles raging onscreen. The PC version of Supreme Commander is one of the best strategy games in recent years, and is rightfully beloved for its complex tapestry of economic control and massive battles spread across sprawling maps. The Xbox 360 release attempts to deliver that great gameplay, but completely disrespects it by stuffing it into a shamefully buggy package that should never have been released in its current form. The scheme works fine and isn't too cumbersome, and there are some nice touches that strategy enthusiasts will appreciate. For example, when queuing up units, you can hold a bumper to produce five at a time, rather than pressing A repeatedly. Setting up order queues for your engineers and ACU is automatic, so you can easily get your engineers on a set of tasks and leave them be. The downside is that you have to manually issue a stop command if you want them to do something different, which isn't usually too much of an inconvenience. However, even a unit's automated journey to a rally point is considered as a queued activity; if you want to issue an order and have the unit begin before it has arrived at the rally point, you have to issue a stop order and issue the new command, which is annoying and should not be the case. The game engine has a hard time rendering even the simplest visuals. Some technical issues get in the way of the scheme. For example, if you use the grouping wheel to choose all available engineers, the option may not work. The wheel may indicate a number of idle engineers, but selecting the grouping may not do anything, so you'll have to search for them manually. It also appears that the friendly artificial intelligence is broken. Occasionally, units that should be performing a patrol will stop for no apparent reason. Other times, your engineers will stop midqueue and sit idly, and you will have to issue a stop command and reissue orders from scratch. These occasions aren't frequent, but they are common enough to be annoying. Outside of the campaign, you can play stand-alone skirmishes, or you can take the fight to Xbox Live, where up to four players can compete. While there aren't as many options as in the PC version, there are an insane number of ways to customize your games, along with two new modes: King of the Hill and Command Point. In King of the Hill, you must send your units to a designated area on the map to earn points, while Command Point is a Battlefield-type game where you must capture all of the designated locations on the map. The latter is easily the better of the two modes, and games can last for quite some time, as the constant tug of war will keep you engaged across the entire map at once. In every case, the large maps (though not as large as the biggest ones in the PC version) lend themselves to a variety of tactics, and the resulting complexity requires flexible thinking. The game's terrible performance doesn't seem to contribute to any online lag, and we didn't experience any disconnects, though the visual slowdown can get so severe that it's hard to tell one way or another. You can play ranked or unranked games, and leaderboards track the best of the ranked bunch. The best visual aspect of Supreme Commander is its scale, since you can zoom in close to the action, or zoom out to see the entire enormous battlefield, where every unit is represented by simple geometry. Because you spend so much time playing Supreme Commander with the camera pulled all the way back, you'll get used to that graphical simplicity. Up close, however, the game isn't much of a looker, either. Textures are bland, units lack detail, and environments are fairly devoid of anything interesting to see. Some loss of visual fidelity, in light of the game's massive scope, is understandable--but not to this extent. Blowing things up is fun. The resulting frame rate drop is not. The scaling of the audio is even worse, and doesn't translate a sense of aural distance very well. If you are using headphones or standard television speakers, you will get an earful of explosions and audio effects that sound harsh and tinny. A better speaker setup will yield somewhat better results, but even then, the sound is abrasive, as if the game is trying to squeeze out more sound than it should. As before, the highlight of the game's sound design is the aggressive symphonic soundtrack, which never gets in the way but sets the proper warlike tone for the colossal battles raging onscreen. The PC version of Supreme Commander is one of the best strategy games in recent years, and is rightfully beloved for its complex tapestry of economic control and massive battles spread across sprawling maps. The Xbox 360 release attempts to deliver that great gameplay, but completely disrespects it by stuffing it into a shamefully buggy package that should never have been released in its current form."}