{"ref": "https://www.gamespot.com/reviews/ju-on-the-grudge-review/1900-6237095/", "date": "October 19, 2009", "game_name": "Ju-on: The Grudge", "text": "Touted as a haunted-house simulator, Ju-On: The Grudge is a no-frills horror game that capitalizes on the reasonably successful film series of the same name. It uses the same hook found in the movies: cursed ghouls born of a violent death that consume all who enter their domain, including a victim's family. There are a few good scares, but its harsh brevity, troublesome controls, and extraordinarily shallow gameplay mechanics thoroughly squash its potential. Escape from the same nightmarish creatures you grew to love in the films. The game begins with a tense sequence: You are investigating pitch-black areas in first-person view with nothing but a flashlight to protect you from the haunting monstrosities--at least until you run out of juice. The bulk of the gameplay is composed of cheap thrills, such as hands that reach out of nowhere to grab you or figures that suddenly pop onscreen. Although the obvious scare tactics soon become tired and monotonous, they manage to be a little unnerving. You'll spot a lot of subtle horrors, like figures that dissipate when you approach or bloody handprints on the walls, that are much more chilling than the game's constant use of second-rate shocks; unfortunately, they're not implemented well enough to truly spook you. Attack sequences are somewhat rare but are a bit more fun and spine-tingling, preceded by elaborate creature entrances and pulse-pounding music as a ghoul grabs you. You have only a few seconds to ~shake~ the creature away with the Wii Remote, and though the sequences are enjoyable, they're regrettably the height of the game's limited interactivity. Ju-On has the foundation of a decent horror game, but unfortunately it sacrifices gameplay for its movie-like thrills. You spend most of your time searching for flashlight batteries and locating the keys you need to advance. The game never matures to include any kind of puzzle elements or combat, culminating in a mundane and outdated experience that's ultimately unsatisfying. This gross lack of depth makes the game far too easy to finish, because you'll rarely run out of batteries or get stuck since items shine in the dark. Level design is also simplistic and limited in scope. There are a lot of off-limit areas in this highly linear game, and levels generally amount to following ghosts between unchallenging key searches. The game also suffers from awkward, somewhat unresponsive controls and a finicky camera that requires noticeable effort to tame. You control the camera by tilting the remote, but the slightest of tilts will cause it to swing wildly, at other times it will stick or you'll experience an annoying delay. This makes something as straightforward as climbing the stairs irritating. Command prompts, which are used to trigger escape scenes, are especially aggravating because they're sometimes misinterpreted no matter how furiously you shake the Wii Remote. Sound effects and music culled from the movies do a good job of scaring you; plenty of horrific audio cues await you in the dark, from the pitter-patter of bloody footsteps to the ghastly, inhuman growls the films are known for, although these deep, gurgling screams become less menacing as you progress because they're overused. Music is eerie but mostly reserved for attack sequences, focusing less on setting the mood and more on making you jump, but it's alarming enough to get your heart racing. Aesthetically, the game pulls off a creepy ambiance, with rusted lockers, splintering furniture, and disturbing mannequins decorating the dilapidated locales. Jagged edges are prominent and worsen the game's dated feel, although the dark color palette does help to mask the inadequacies. The ghosts are strikingly hideous and perfectly mirror their dreadful celluloid counterparts, down to their rotting flesh and bulging eyes. Dull key quests and battery searches are typical of the mundane gameplay. One aspect more appalling than the game's creatures is its almost total lack of replayability. It's terribly short, with only five stages that amount to an hour and a half's worth of gameplay, or roughly 20 minutes each. Once you've cleared a stage, you're accustomed to its spook tactics and scripted scenes, so there's no joy or challenge in repeating it. The multiplayer option is so pathetic it's laughable. As the second player your goal is to scare player one by spamming them with cheesy, repetitive ~panic scenes.~ Your arsenal of fear includes such terrifying tricks as causing blood to envelop the screen and making pieces of creature artwork pop-up. They're every bit as scary as they sound, and these silly interruptions are more likely to cause irritation than a good scare. Despite Ju-On film director Takashi Shimizu's supervision, the game features noticeably few plot elements to tie its levels together or provide character depth. Consequently, there's a sharp disconnect between characters and their stages, which completely undermines the game's attempt to immerse you into the films' world. Although these characters are a family unit, the game rarely mentions that fact and glosses over the curse's significance, leaving you clueless as to what's going on unless you've closely followed the movies. Youll encounter a few substandard thrills while The Grudge lasts, but its clumsy controls and one-dimensional mechanics are more likely to send you running than its ghastly fiends are. Even Ju-On film fans will probably want to look elsewhere for this season's festive frights."}