{"ref": "https://www.gamespot.com/reviews/bloodroots-review/1900-6417417/", "date": "March 3, 2020", "game_name": "Bloodroots", "text": "Have you ever seen an old cartoon where a fight breaks out and the brawlers turn into a cloud of punches that flips tables and breaks everything it touches? Bloodroots, a breakneck action-puzzle game from Quebec developer Paper Cult, lives inside that cloud. A short, speedy tale of mayhem and revenge, Bloodroots dares you stab, bludgeon, squash, and otherwise murder dozens of thugs with the ruthless efficiency of the Wild Wests greatest outlaw and the zany gusto of Bugs Bunny trolling Yosemite Sam. Whether you do this for the sake of its well-written story and/or the thrill of a score chase, Bloodroots can be stylish, graceful (once you know what youre doing), and surprisingly easy to pick up despite demanding a tremendous attention to detail. In its pre-release state, however, its most elating moments are easily and frequently disrupted by technical issues, keeping you from really hitting your stride as often as you should.Bloodroots puts you on the warpath with the Wild West outlaw Mr. Wolf, whos out for revenge against his gang, the Blood Beasts. The Beasts, who all wear animal skins and go by Reservoir Dogs-style code names like Mr. Boar and Mrs. Crow, betray and nearly kill him after murdering an entire town in the name of their new leader, Mr. Black Wolf. From the moment he recovers from his attempted assassination, Mr. Wolf has one goal: to kill his former gang and anyone who gets between them.The story, though simple and predictable, is made compelling through strong dialogue that forges complex characters. Though Mr. Wolf rarely speaks, you learn a lot about him; his story and the history of the gang are told in carefully constructed interactive flashbacks and through his encounters with the Beasts. You dont spend too much story time with any one character--this is an action game and the gameplay comes first--but in tracking down each former partner, you come to understand and savor your time with them. Everyone, and I mean everyone, in Bloodroots is a bad guy, but you come to see that every character has their own perspective on how the gang rose and fell. In hearing about Mr. Wolfs past from the Beasts, in their own unique voices, you not only understand the situation better, but come to understand that theres more in their lives than a single act of vengeance. That isnt to say you wont have reservations about your mission--theyre bad guys through and through--but you understand why they made their choices, which makes your hunt more satisfying.That hunt is really more like a series of wild bloodbaths. Each of the Bloodthirsty Beasts has their own gang now, with camps and forts full of henchmen. These henchmen are easily dispatched: Often a single blow with a weapon or even a punch will do, but there are a lot of them and Mr. Wolf is just as fragile, so you need to work fast and keep moving, otherwise theyll take you down. Each challenge in Bloodroots boils down to an improvisational whirlwind of violence. You run around each arena, grabbing whatever you weapons you can find that will give you an edge over the opposition, and clear it out as fast as you can.While theres nuance to the story, Bloodroots is, at its heart, a challenge meant to be mastered. You build up a score multiplier for killing enemies in rapid succession, pushing you to prioritize speed and efficiency. Each level--which strings together a set of challenge rooms--ends with speed and high-score leaderboards, encouraging you to retry levels in the hopes of improving even further.Whether you make a precise plan or simply go with the flow, the key to navigating each arena revolves around finding a path from one weapon to another. Most weapons break after anywhere from one to three kills, so you are constantly swapping out one for another, and finding a path from the most effective weapon to the next is just as important as finding a quick path between kills.Luckily, every level is littered with killing tools. Nearly every benign object, from a fence post to a giant fish, can be a weapon. You can jump on rolling objects like wagons and barrels, both conventional and red explosive, to bulldoze your enemies until you crash. There are conventional, Wild West-style weapons like hatchets, knives, and pistols scattered about--plus unconventional weapons like golden spears, flamethrowers, land mines, snowballs, and cannons that shoot you up in the air so you can fall back to earth and clear out an area like a human mortar shell. The feeling of flying, bouncing, dashing, and jumping from one weapon to the next creates a wild, fly-by-the-seat-of-your-pants energy.To really master Bloodroots, you need to not only recognize each weapon on sight, but have an intimate understanding of what they do. Every weapon works a little differently; the axe is simply a quick strike, while the cavalry sword is actually a short dash attack. Some weapons also give you traversal options: Long weapons like ladders and fishing rods, for example, let you pole vault to a higher area by pressing jump. Theres a fair amount of overlap, especially among families of weapons--swords, axes, etc.--but each one moves a little differently, lasts a different number of strikes, or swings at a different speed. There are no bad choices, so moving from weapon to the next is always thrilling. Every new weapon creates a slightly different situation and a new point of view, and the constant changes make each moment feel like youre teetering on the edge of control... in a good way.Though killing quickly is key, theres a fair amount of platforming involved as well. Many of the levels are multi-layered, with gaps to hop and pits for you to fall into. Since many weapons also give you extra movement options, choosing the right weapon for the next few seconds may have as much to do with reaching an enemy as it does killing them. To be efficient, you need to grab and use a series of weapons in an order that lets you make progress without hoarding or backtracking. At the same time, theres very rarely a time when youll be limited to a single tool, so its always easy to try a new approach. There are also occasionally literal rewards--useful weapons hiding in out of the way places. Playing around with different paths through each space can be just as fun as going for a high score or fast time.The levels also benefit from a camera thats primed to maximize the impact of your killing choreography. The majority of the challenge areas are shown from an isometric perspective, with the camera panning in or out in spots to show you more or less of your surroundings. Sometimes that means getting up close so a specific path fills the screen; other times the camera moves out to show the wider scope of an area, which may help you see the chaos you create more completely. From time to time, you get something a little more playful--one early room shifts to a top-down perspective as an homage to Bloodroots design ancestor, Hotline Miami. The camera always seems to shift with intention and helps you get the most out of the chaos you create.Youd think it would be very difficult to get a handle on dozens of different weapons and how they work, but moving from one to next starts to feel like second nature very quickly. It helps that every level in the game from start to finish introduces new weapons, often one or two at a time, so youre learning at a steady, digestible pace. And as you learn their quirks, paths through the levels start to form in your mind. When everything starts clicking, planning and improvisation almost feel like the same thing.Every new weapon creates a slightly different situation and a new point of view, and the constant changes make each moment feel like youre teetering on the edge of control... in a good way.Of course, youll only get to that point after dying many, many times. Bloodroots is very difficult. Its one touch and youre dead, so a single mistake will kill a run more often than not. Luckily, Bloodroots is saved by the fact that it resets almost instantaneously. It is almost too easy to die and immediately throw yourself into the fray again.While it is easy to just keep playing, death can often be very frustrating in Bloodroots. Whether because of input lag or technical issues, it sometimes feels as if youre moving faster than the game can. There were many instances when I pressed a button to grab a weapon only to discover that I didnt pick it up and didnt have the attack and/or movement I expected to. And with long-range weapons like guns and bows, you have to rely on an inconsistent directional auto-targeting system.There are also times when Bloodroots penchant for cinematography can actively put you at a disadvantage. At times, the camera will pan out too far, making it hard to see where a jump will land. From time to time, the camera will shift to a horizontal view that appears to be a 2D plane but isnt, which can cause you to take a poor angle when approaching an enemy and miss an attack. This game demands precision, so it can be very frustrating when the camera and level design add extra hurdles.And yet, like so many challenging score chases, Bloodroots is still incredibly satisfying when youre eventually successful. At its highest heights, youll find your way around, bouncing from weapon to weapon, kill to kill, to string together a perfect run. Better yet, there are so many ways to approach each area that, no matter how well you do, you can always do it better, faster, crazier. Even when playing Bloodroots is painful--like throw your controller so hard it bounces off the ground, hits you in the head, then breaks your TV painful--theres always a wildly fun run within reach."}