{"ref": "https://www.gamespot.com/reviews/aquanox-2-revelation-review/1900-6074366/", "date": "August 29, 2003", "game_name": "AquaNox 2: Revelation", "text": "While we see quite a few games that involve water of some kind, almost all of them have action that takes place above the surface. But of course, this isn't always the case. The 2001 release of AquaNox took players underwater and essentially brought a simplified version of the action and mission structure of a Wing Commander-like space simulation along with it. The game looked highly impressive if nothing else, but its gameplay left much to be desired. Two years later, the team at Massive Development has put the finishing touches on a sequel, but not a whole lot has changed. The missions are still brief, the control is still awkward, and in 2003, those great graphics just don't look so great anymore. AquaNox 2 doesn't fix the gameplay flaws of its predecessor, and doesn't live up to the original's graphical presentation either. AquaNox 2: Revelation is basically an action game, but it's also one that's been weighed down by layer upon layer of dialogue, as well as by a pretty clunky interface. You spend your between-mission time clicking around to different spots, which open up windows that show a person you can speak with. Clicking on the person opens up another window that shows the conversation between your character, the absurdly naive William Drake, and the person you've clicked on. These conversations are designed to give the game a plot, but more often than not, the sequences are filled with near-meaningless babble. Eventually you stumble onto a conversation or two that has some bearing on the gameplay, and a new mission is opened up in the dock section of your current location. If you click around and listen to what everyone has to say, you'll probably spend more time listening to the game's dopey script and limp voice acting than you will cruising around the ocean floor. But all of that isn't entirely the fault of the story sequences. Most of the missions are pretty short (there's no multiplayer, either), and the game rarely gets difficult once you've gotten used to the sluggish-feeling ship control and disappointing combat. The mission design follows that of your standard space combat sim, so you'll escort ships, destroy loads of pirate submarines, defend your freighter from incoming attack, and generally follow navigation points until you're told what to do next. You'll usually have to scoot along from nav point to nav point, and the points are generally behind obstacles, like large undersea mountains. Instead of simply being able to propel yourself over the short mountain, you are kept at a specific depth range, so you'll tend to travel in canyons and stick pretty close to the bottom of the sea. The game does a pretty good job of simulating what it might feel like to move and fight underwater. Unfortunately, that means that the game moves at a painfully sluggish pace. You'll receive faster ships as you play through the game, but none of them ever approach the maneuverability you'd want from a game like this. Instead, you lazily cruise around, strafing and turning to dodge enemy fire while firing off your weapons as quickly as possible. The game gives you an occasional chance to purchase new weapons, but you'll find most of your new gear as salvage, which turns up at the end of every mission. You'll start with a basic vendetta gun and then move up to zoom-lens sniper weapons, plasma cannons, an EMP weapon for disabling enemies instead of destroying them, an array of different torpedoes, and more. Much of the game is extremely dark, which may be realistic, but doesn't do much to make it more fun. The game's visuals provide another reason to steer clear of AquaNox 2. The entire game is very dark. This wins the game a few realism points but also causes it to lose the rest of its fun points. While some missions take place in lighter areas of the sea, much of the game is so dark and murky that you can't see the terrain until you're bumping into it. The game does have built-in gamma correction, but as you might expect, cranking this setting up merely washes out the game's colors and doesn't really help very much. The portion of the game that is visible doesn't look too different from the original AquaNox, which was said to look fantastic back in the early days of Nvidia's GeForce3 hardware. Now, however, the terrain and textures aren't nearly as impressive, and the ship design and movement are dull and jerky, respectively. The game's menus and character artwork are pretty slick, but in the end, the game manages to look good, at best. The game's audio doesn't really bring much to the table, either, though it's mostly fitting. The sound effects are generally appropriate for underwater combat, and the game supports 3D audio hardware for good measure. The music is suitably rocking as well. But as previously stated, the voice acting in the game is quite weak, and none of the characters other than Nat sound like they're particularly sold on the words coming out of their mouths. All things considered, AquaNox 2 really doesn't add up to much. The gameplay is shallow and mostly uninteresting, the storyline is poorly conveyed, and the graphical presentation can't bail it out. If you're after a mission-based action game, you're better off looking elsewhere."}