{"ref": "https://www.gamespot.com/reviews/resolutiion-review-do-the-right-thing/1900-6417474/", "date": "June 5, 2020", "game_name": "Resolutiion", "text": "Resolutiion constantly implies theres more going on than you realize. Its strong anti-imperialist messaging pushes you to question the nature of your mission. Its mechanics, including the fact that most enemies fall incapacitated before you kill them, suggests that maybe you should show mercy when given the choice. The concept of scholars studying the world in VR, seeking to understand things without seeing what's in front of them, challenges you to question when knowledge is useful. Walls and signs adorned with intricate symbols and filled with cryptic, interactive elements forces you to consider the possibility that youll need to be extremely clever and dig really deep to find the truth.That truth is extremely hard to come by, though. Even after combing the world and finding out how many of the pieces fit, I walked away feeling that Resolutiions big philosophical questions stirred my mind. However, its obtuse attempts to manifest them as a deep, mysterious puzzle beneath the games surface-level objectives created a gap between the loose, but entertaining Metroid-style action game I played and the intellectually stimulating action-puzzle I could tell was there but had trouble parsing.Resolutiion is a stylish game. Its smooth-moving but highly pixelated art style evokes games like Superbrothers: Sword and Sworcery, Below, and Hyper Light Drifter at a glance, but it has its own thrown-together mix of cultural influences that create a unique setting. The backdrop of its world, a post-apocalyptic ruin rebuilding in the shadow of a cyberpunk dystopia, permeates every screen. The landscape blends large swaths of concrete and sand with bright, unnatural skies. Its characters range from Buddhist monk laborers to talking deer and bunnies espousing subversive anti-imperialist rhetoric.Its creatures come with simple, but cheeky and stylish, designs: Theres a desert town under threat from a giant black cat that swims under the nearby sand like a shark, whose cuteness remains hidden until right before it pounces to kill you. In another section, youre chased by a crudely drawn ~naga,~ whose body--a long line of interconnected balls that looks like it was drawn in MS paint--looks more like a caterpillar than a snake. That's not a condemnation--theres a strong unified sensibility to the art that helps create the severity of the world, while also injecting a playfulness, that keeps your mind open and your curiosity piqued.These spaces, from fallen skyscrapers to the bottom of the sea to a mysterious lost forest where your map doesnt work, are familiar at their core, though. So much of Resolutiion feels like that--stylish in an interesting way, but familiar. Like so many metoidvania action games, Resolutiion guides you through its world in a linear fashion, gradually opening up new spaces to you as you find new abilities. You will find yourself frequently bumping into areas you cant access unless you come back later once youve acquired the appropriate tool.Many of these are obvious key-and-keyhole pairings, but sometimes the answers may be less obvious. Theres a neat little interaction if you bring the giant sand-shark cat a ~treat,~ for example. Some of these hidden puzzles can be solved with common sense, while others require you to ignore and actively avoid the little bit of instructional guidance youve received. Many of them, however, require you to pay close attention to every shred of story told and shown to you.The conversations you have, the worlds design--everything pushes you to ask questions and seek a harder-to-attain hidden truth. These unmarked puzzles, combined with the complete lack of any explanation of how any aspect of the game works, left me constantly in search of meaning in every nook and cranny. So many aspects of this game push you to look beyond what youre doing and see a bigger picture, so I was constantly looking for subversive paradigm-shifting puzzles.A keen eye and thorough play will help you find some answers--in some cases, it led me to finding new story moments and Easter eggs--but theres a big gap between recognizing a puzzle and figuring out how to engage with it. Too often, the understanding that there were puzzles I could see, but not approach, led to paranoia. I questioned every action because theres little indication of when I was making hidden progress or shutting the door on something.This is especially true in combat. Every non-boss enemy enters a wounded state when theyre one hit away from death, so its up to you whether or not to kill your opponents or let them live. The mere presence of the concept means every fight ends with a loaded moral question, and the game isnt shy about pushing you to consider the consequences of your actions. It isnt exactly clear what impact killing enemies has on the story, so it may or may not be a big deal.Too often, the understanding that there were puzzles I could see, but not approach, led to paranoia. I questioned every action because theres little indication of when I was making hidden progress or shutting the door on something.While effective as a means of encouraging the player to think outside of the box, the mercy mechanic works better as an intellectual exercise than as a game mechanic. Its very easy to get stuck in a situation where you cannot fight without killing. When fighting a group, you will almost certainly deliver a few fatal blows by mistake, which makes it hard to get overly precious about it. Like so many elements in the game, it is very clear that its happening for a reason, but that reason isn't made clear.Its even more maddening when you compare the hyper-complex extracurricular puzzles with the extremely simple puzzle-solving and combat of the core experience. Most of the puzzles you must solve are straightforward switch puzzles made to direct your exploration rather than tease your mind. Likewise, Resolutiions battles consist of very shallow hack-and-slash combat, spruced up with a small set of skills earned throughout the journey, like an energy gun and a bomb. The basic mechanics feel loose; mashing the slash at enemies over and over is rarely satisfying. In lieu of a dash or dodge, you can simply sprint for a short time, which can lead to you overshooting a target or draining your energy, which you use for every skill except the slash attack. Most enemies you face dont require a ton of precision or tactical thinking--just slash and slash, then sprint in a quick circle to get away when they attack.There are a couple of exceptions, though. By the back half of the story, set-piece boss encounters at the end of each area offer a few sudden but welcome difficulty spikes that push you to use your full skill set and be mindful of how you set up your attacks and respond to theirs. These bosses are uncommon, though, and don't make up for all the lackluster encounters between them.There are some really cool ideas at the heart of Resolutiion. You can sense the thought and care put into transposing philosophical thought into something thats both playable and insightful. Unfortunately, the portion of the game that engages with those ideas is far too obscured and distant from the core story most players will see. It is still an interesting visual and, to a point, intellectual piece--wrestling with those ideas and their meaning can be its own reward. It's clear there's more to the experience, but so much of it is so out of reach, which diminishes Resolutiions impact."}