{"ref": "https://www.gamespot.com/reviews/haunting-ground-review/1900-6126551/", "date": "May 25, 2005", "game_name": "Haunting Ground", "text": "The survival horror experience is largely built on one of two elements: grisly action, or heaping helpings of tension and suspense. Haunting Ground, Capcom's latest thriller, is one of the latter, pitting a frail young woman against a myriad of mysterious dangers with only her wits and a canine companion to keep her alive. The game delivers creepy moments aplenty, and your German Shepherd makes a unique and neat teammate to play with, but some gameplay oddness and dog artificial intelligence quirks mar the adventure. Inheriting valuable real estate has never been so deadly. You'll play as Fiona Belli, an almost criminally pale young lady who wakes up one day locked in a cage in the dark basement of a mostly deserted castle, with nothing to cover her but a simple sheet and no memory of how she had come to be there. We soon discover that our heroine was in a tragic car accident that left both of her parents dead, and now she has been brought to the castle to assume her inheritance of it. However, the few residents of the manor seem keen on murdering Fiona for a variety of reasons, so the young woman is only too eager to leave her new prize behind, providing she can manage to escape. In her travels, she comes across Hewie, a white German Shepherd with a sharp wit for a dog and a surfeit of loyalty that he lavishes upon Fiona. Together they'll need to deal with enemies and a landscape riddled with traps to win their freedom. The castle and its grounds feature lots of grimy details and old-world opulence, which is mixed with strange alchemical machinery, a multitude of unsettling artwork, and plenty of puzzles and traps. There are no load times between the various areas of the house, and you can move from room to room, floor to floor, and area to area seamlessly. The place is pretty fun to explore and it looks great. The characters look very good as well, from the loathsome, Quasi Modo-like Debilitas, to the lavender-haired Daniella, the Goth maid, with her unceasing, corrupted smile. The best animations in the game belong to the nonhuman cast member, though. Hewie moves and acts much like a real dog would, and it's an oddly comforting feature in an otherwise dark world to have a canine calmly recline by your character's feet as you search for clues. Fiona herself is also rendered well, though with a bit more emphasis on certain frontal areas than is perhaps necessary. She has an English accent and a strange, breathless delivery that can make her lines uneven. The voice acting in the game is generally decent, aside from a few overdramatic moments. The human heroine is practically useless; your dog is the brawn (and sometimes the brains) of the team. Fiona makes a particularly helpless creature, so far as gameplay goes. If she comes in close contact with a hostile resident, her innate moves consist of an underwhelming shove, a quick back step, and a weak kick. Her two ~stats~ in the game are her stamina level (stamina is what lets her run, fight, and back step) and her panic level, neither of which have any sort of onscreen meter for you to keep track of. If she runs out of stamina, she'll just slow down and be unable to back step, and if she starts to panic, a grainy gray filter will start to overlap the action. If she panics too much, she'll run off, bounce off walls and land on the ground, or end up prone and unable to move for a period of time. Since all of this obviously makes Fiona practically worthless against an enemy, you'll want to keep her far away from them, and the game provides you with several places that you can use to hide yourself from foes. You can hide under beds, in closets, in bathtubs, behind curtains, and in other places. The game tells you early on that if you use a hiding place repeatedly, whoever is chasing you will eventually catch on. That's true, but on top of that, even if Fiona has a good running lead on her pursuer and picks a hiding spot she's never used before, she'll sometimes get spotted instantly for no particular reason. Also, sometimes after getting chased, you get a ~coast is clear~ message so you know it's safe to emerge from the hiding spot, but oftentimes you don't. If you come out too soon, you'll end up staring your enemy in the face again. So there are times you'll end up sitting and waiting for the ~enemy is chasing you~ music to fade so you can finally get on with things, and this eventually ceases to be suspenseful. You'll come to rely on the game's sound quite often for clues, as the subtle ambient sounds will shift to a particular theme as a certain enemy is approaching, or Hewie will whine to alert you to that enemy's impending arrival. Sound is sometimes the only thing that lets you know that you're safe, so you'll have to listen up. As you progress, you'll find items you can place on the ground or throw to slow your enemies down while you get away. But there's no way to tell if they've given up, or if they're still on your trail and you need to hide. And since hiding isn't always reliable, you'll sometimes find yourself wasting a big chunk of time shaking the fiend off your trail, as well as getting Hewie to help you out if you can. Hewie is the single most important tool you'll have in the game, since Fiona herself has so few abilities. You can issue the following dog orders: to have him come to you, to search the immediate area (if there's a special item only he can grab, this command makes him grab it), to sit and stay, to attack, and even to shake hands. You can give Hewie feedback by either praising him and rubbing his ears when he does something right, or verbally scolding him when he doesn't follow a command quickly enough. He'll be able to grab key items for you in tricky places, as well as alert you to fatal traps by barking at them. His posture slumps when there's an enemy nearby, so you have some warning to hide, and he can delay your enemies with a well-timed chomp on the ankle or a leaping attack from behind, as well. He's an extremely useful companion, and his lifelike actions--down to the way he'll eagerly watch your face as he dogs your heels with his tail wagging away--make him fun to interact with. But having Hewie perform all his orders reliably means that you'll need to spend time training and reinforcing good behaviors with constant praise. You'll have to work with Hewie all the time, as there's no way for you to tell how the relationship between you and him is faring other than his responses to your commands. However, sometimes your superloyal hound will still seemingly randomly ignore your orders--usually at tricky moments where Fiona is frozen helpless on the ground and unable to move. As true to life as deciding to ignore known commands is, as a gameplay mechanic it's frustrating to not be able to get totally reliable compliance, despite all the paw-shaking, ball-fetching, and jerky-feeding you've done to get Hewie on your side. Help me! No, really, help me! I'm dying here! Doggie want a treat? Ahhhhhh, my face! In fact, you can alter the ending in the game depending on whether or not you're cruel to Hewie, or if you befriend him and hold his trust. The game at its longest will last between 10 to 15 hours, and you can extend the life of the game by playing through on harder difficulties and collecting new outfits for Fiona (and Hewie as well). The relationship between the girl and her dog, and her total dependence on her animal friend, really gives Haunting Ground its own special place in the horror genre. The hide-and-seek gameplay is not without flaws, but if you're a big horror fan and don't mind something different, Haunting Ground is worth a look. You can hide under beds, in closets, in bathtubs, behind curtains, and in other places. The game tells you early on that if you use a hiding place repeatedly, whoever is chasing you will eventually catch on. That's true, but on top of that, even if Fiona has a good running lead on her pursuer and picks a hiding spot she's never used before, she'll sometimes get spotted instantly for no particular reason. Also, sometimes after getting chased, you get a ~coast is clear~ message so you know it's safe to emerge from the hiding spot, but oftentimes you don't. If you come out too soon, you'll end up staring your enemy in the face again. So there are times you'll end up sitting and waiting for the ~enemy is chasing you~ music to fade so you can finally get on with things, and this eventually ceases to be suspenseful. You'll come to rely on the game's sound quite often for clues, as the subtle ambient sounds will shift to a particular theme as a certain enemy is approaching, or Hewie will whine to alert you to that enemy's impending arrival. Sound is sometimes the only thing that lets you know that you're safe, so you'll have to listen up. As you progress, you'll find items you can place on the ground or throw to slow your enemies down while you get away. But there's no way to tell if they've given up, or if they're still on your trail and you need to hide. And since hiding isn't always reliable, you'll sometimes find yourself wasting a big chunk of time shaking the fiend off your trail, as well as getting Hewie to help you out if you can. Hewie is the single most important tool you'll have in the game, since Fiona herself has so few abilities. You can issue the following dog orders: to have him come to you, to search the immediate area (if there's a special item only he can grab, this command makes him grab it), to sit and stay, to attack, and even to shake hands. You can give Hewie feedback by either praising him and rubbing his ears when he does something right, or verbally scolding him when he doesn't follow a command quickly enough. He'll be able to grab key items for you in tricky places, as well as alert you to fatal traps by barking at them. His posture slumps when there's an enemy nearby, so you have some warning to hide, and he can delay your enemies with a well-timed chomp on the ankle or a leaping attack from behind, as well. He's an extremely useful companion, and his lifelike actions--down to the way he'll eagerly watch your face as he dogs your heels with his tail wagging away--make him fun to interact with. But having Hewie perform all his orders reliably means that you'll need to spend time training and reinforcing good behaviors with constant praise. You'll have to work with Hewie all the time, as there's no way for you to tell how the relationship between you and him is faring other than his responses to your commands. However, sometimes your superloyal hound will still seemingly randomly ignore your orders--usually at tricky moments where Fiona is frozen helpless on the ground and unable to move. As true to life as deciding to ignore known commands is, as a gameplay mechanic it's frustrating to not be able to get totally reliable compliance, despite all the paw-shaking, ball-fetching, and jerky-feeding you've done to get Hewie on your side. Help me! No, really, help me! I'm dying here! Doggie want a treat? Ahhhhhh, my face! In fact, you can alter the ending in the game depending on whether or not you're cruel to Hewie, or if you befriend him and hold his trust. The game at its longest will last between 10 to 15 hours, and you can extend the life of the game by playing through on harder difficulties and collecting new outfits for Fiona (and Hewie as well). The relationship between the girl and her dog, and her total dependence on her animal friend, really gives Haunting Ground its own special place in the horror genre. The hide-and-seek gameplay is not without flaws, but if you're a big horror fan and don't mind something different, Haunting Ground is worth a look."}