{"ref": "https://www.gamespot.com/reviews/forever-kingdom-review/1900-2847329/", "date": "May 17, 2006", "game_name": "Forever Kingdom", "text": "Forever Kingdom tells the story of three companions bound by fate and chance. Together they shall experience each other's joy, feel each other's pain, and yes, share each other's clothes. The follow-up to the PS2 launch title Evergrace, Forever Kingdom is a linear action RPG focusing on equipment management and party combat. At the very start of the game, the three protagonists of the story come to the aid of a young girl, only to be placed under the curse of the soul bind by the magician Darsul. To remove the curse and help the mysterious child, they have no choice but to journey where the path leads them. While it's not uncommon for a group of adventurers to share a common destiny, this trio actually shares the same life bar. If any character takes damage, your group's total life will be depleted. When the gauge is emptied, the entire party will simultaneously let out a final gasp of life and collapse. To offset this strange approach, items that can completely restore your health are readily available, and are instantly accessible by pressing L3. The player directly controls one character at a time, while the others act with limited autonomy. You can cycle through characters anytime with a press of the L1 button. Each warrior has his or her own strength and speed, as well as special characteristic. For instance, Faeana moves the fastest and excels at magic, and she is strong with the earth element. Balancing this is a weakness against lightning and her inability to wield the heaviest weapons. Tapping the X button will perform a normal attack, the range and speed of which vary from weapon to weapon. With proper timing, a second or third attack will be added on (although only Darius can perform three hits). Group members not under your direct control are generally excellent at guarding against attacks, so you'll rarely be able to blame the computer when you've run out of life. Unfortunately, your comrades' defensive focus means that they'll rarely attack unless the enemy is simply in their way. Each hit that connects on either side builds the AP gauge, which in turn lets you access special attacks called palmira techniques. Each character's currently selected technique is mapped to a different face button, and executing combos with these attacks will do more damage and yield palmira crystals that can be used to enhance your weapons and armor. Executing the aforementioned combos can be tricky, since you often can't determine the range of an offscreen character, but under the right circumstances, you can perform successive juggles with deadly effect. Although pulling off a flashy combo can be rewarding, the combat has an innate repetitiveness and is sometimes awkward. There is no manual lock-on. Instead, a character will point directly at an enemy before swinging. This makes hitting a moving target frustratingly difficult, as it's impossible to lead your target. Normal combat is slow-paced and quickly becomes repetitive, but it's the only way to build up energy to use special techniques. On the plus side, guarding with the R1 button is very effective at reducing damage, even if it does slow the action considerably when you're forced to repeatedly guard against one of the game's many projectile-hurling enemies. Unlike many action RPGs that handle character advancement by level building or class changing, Forever Kingdom does away with character levels altogether and substitutes a detailed equipment system. In this game, you are what you wear, and the extensive fashion library includes everything from traditional suits of elemental armor and battle helms to maracas and sunglasses. Everything you equip shows up instantly on your character model, and the changing appearance of your group remains a novel concept throughout the game. In effect, each party member is a three-dimensional fashion plate. Within the first hour or so of gameplay, it's possible to have one lucky party member in bright blue flood pants, with a jack-o'-lantern for a head, wielding a giant spoon. More serious choices are also available, however, and because there are almost no limitations on who can equip a particular item, you're free to mix and match however you please. In addition to selling items and offering you a chance to compete in the coliseum, the omnipresent shopkeeper will be happy to critique your style, and you'll earn successively larger discounts on items as a reward for your trendiness. However, as this individual's definition of ~well dressed~ incorporates a giant cat's head with a top hat and monocle, do realize that earning his praise can be a matter of trial and error.The changes when equipping sundry items aren't merely aesthetic--they have everything to do with your character's stats. Each item has different values for attack, defense, and strength vs. different elements and even affects the size of your life bar. As you progress, you'll naturally gain access to more and more powerful equipment. Any piece of equipment can be upgraded up to 100 points in each relevant area, so something you find near the middle of the game can still serve you well right to the end, provided you steadily improve it. As you venture forward, slaying monsters and constantly reinventing yourself through your wardrobe, you'll be faced with puzzles that focus heavily on the game's elemental system. The game almost always acknowledges these obstacles with nearby plaques that give hints as to how to overcome the trial at hand. While these tips are usually helpful and not overly complex or cryptic, you might sometimes find yourself thwarted by poor design even if you have a sense of what you're supposed to do. Sometimes a solution won't register if you're standing too close or at the wrong angle while using palmira, and one prominent puzzle early in the game requires precise timing (with no explanation) in addition to knowing the correct course of action. Because you're forced to leave and slaughter more monsters to replenish your magic, these instances can be quite frustrating. Exploring in general is also hampered by a minor technical detail: Your characters cannot jump or even take the slightest step up. This lack of mobility can feel limiting as you attempt to explore your surroundings and can necessitate bothersome backtracking. The gameworld in Forever Kingdom has a diverse, if rather standard, assortment of environments for you to explore, but the graphical quality in these locations can vary as much as the scenery. Some environments are simply not much to look at, with little color variation and overly simple geometry. What you see onscreen is very rarely technically impressive, although there are a few shining moments in the way of lighting and reflections. More effective are the artistic composition of certain scenes and small flourishes. A beautiful if noninteractive lake, a convincing sunset, or a character seemingly being led around by an enchanted sword you just equipped show that the designers weren't merely slacking off and did manage to imbue the game with some personality. Less objectively judged but perhaps more a part of the game's identity are the aural aspects of Forever Kingdom. The music has a unique style that seems immediately foreign--a layering of several different vocal tracks of repeated syllables, words, and phrases with various bass and guitar melodies and other soft sounds. This effect is sometimes calming and sometimes chaotic. The intro theme is so discordant and unorthodox that you might wonder if your audio is functioning correctly upon your first exposure. English voice acting is featured whenever a character speaks and for the most part is at least serviceable. The most obvious and recurring problems are misplaced emphasis and the plain and strictly utilitarian manner in which the script has been translated. Some characters fare better than others, but overall, there's nothing that would be considered far above or below average for interactive media. Some players will find that the more unique aspects of Forever Kingdom make it a worthwhile title even though it's merely adequate in most respects. For others, this won't be nearly enough to redeem a game with no real outstanding qualities. That said, if the core gameplay is enough to hold your interest and if you enjoy collecting rare items, the game may be worth a purchase. Upon completing the game, you're given an item collection percentage and the option to start a bonus game, in which you retain everything you found the first time through. Otherwise, the game should clock in at about 10-plus hours and can be easily finished in a rental.The changes when equipping sundry items aren't merely aesthetic--they have everything to do with your character's stats. Each item has different values for attack, defense, and strength vs. different elements and even affects the size of your life bar. As you progress, you'll naturally gain access to more and more powerful equipment. Any piece of equipment can be upgraded up to 100 points in each relevant area, so something you find near the middle of the game can still serve you well right to the end, provided you steadily improve it. As you venture forward, slaying monsters and constantly reinventing yourself through your wardrobe, you'll be faced with puzzles that focus heavily on the game's elemental system. The game almost always acknowledges these obstacles with nearby plaques that give hints as to how to overcome the trial at hand. While these tips are usually helpful and not overly complex or cryptic, you might sometimes find yourself thwarted by poor design even if you have a sense of what you're supposed to do. Sometimes a solution won't register if you're standing too close or at the wrong angle while using palmira, and one prominent puzzle early in the game requires precise timing (with no explanation) in addition to knowing the correct course of action. Because you're forced to leave and slaughter more monsters to replenish your magic, these instances can be quite frustrating. Exploring in general is also hampered by a minor technical detail: Your characters cannot jump or even take the slightest step up. This lack of mobility can feel limiting as you attempt to explore your surroundings and can necessitate bothersome backtracking. The gameworld in Forever Kingdom has a diverse, if rather standard, assortment of environments for you to explore, but the graphical quality in these locations can vary as much as the scenery. Some environments are simply not much to look at, with little color variation and overly simple geometry. What you see onscreen is very rarely technically impressive, although there are a few shining moments in the way of lighting and reflections. More effective are the artistic composition of certain scenes and small flourishes. A beautiful if noninteractive lake, a convincing sunset, or a character seemingly being led around by an enchanted sword you just equipped show that the designers weren't merely slacking off and did manage to imbue the game with some personality. Less objectively judged but perhaps more a part of the game's identity are the aural aspects of Forever Kingdom. The music has a unique style that seems immediately foreign--a layering of several different vocal tracks of repeated syllables, words, and phrases with various bass and guitar melodies and other soft sounds. This effect is sometimes calming and sometimes chaotic. The intro theme is so discordant and unorthodox that you might wonder if your audio is functioning correctly upon your first exposure. English voice acting is featured whenever a character speaks and for the most part is at least serviceable. The most obvious and recurring problems are misplaced emphasis and the plain and strictly utilitarian manner in which the script has been translated. Some characters fare better than others, but overall, there's nothing that would be considered far above or below average for interactive media. Some players will find that the more unique aspects of Forever Kingdom make it a worthwhile title even though it's merely adequate in most respects. For others, this won't be nearly enough to redeem a game with no real outstanding qualities. That said, if the core gameplay is enough to hold your interest and if you enjoy collecting rare items, the game may be worth a purchase. Upon completing the game, you're given an item collection percentage and the option to start a bonus game, in which you retain everything you found the first time through. Otherwise, the game should clock in at about 10-plus hours and can be easily finished in a rental."}