{"ref": "https://www.gamespot.com/reviews/f1-2015-review/1900-6416190/", "date": "July 16, 2015", "game_name": "F1 2015", "text": "F1 2015 is a Jekyll & Hyde of a video game. In many ways, it's the best Formula One title Codemasters has ever released. A complete overhaul of the series' driving physics, coupled with wonderfully fun and challenging AI competitors, makes wrestling your car around the game's tracks more fun than ever. But F1 2015 also has an ugly side. A shortage of game modes, numerous technical hiccups and reliability issues that would even make a Honda mechanic blush, make it a difficult game to recommend. There's no doubt that the on track action is far better than last year's game. But whether or not you enjoy F1 2015 rests more on if your favorite mode has been removed, and the frequency by which the game crashes to desktop.Let's focus on what works first. The driving in this year's game is the best it's ever been, and it's all down to the handling. While previous games were relatively forgiving when it came to traction control, this year's cars more accurately reflect the high-torque nature of modern F1. This means that you can't simply slam on the gas whenever you want to go fast. Feathering the accelerator is a must to ensure you make your way around the track without spinning. This makes for a far more engaging drive as you battle for position and manage your tire wear, while incoming rain showers that reduce grip are even more terrifying than in previous games.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: F1 2015 PC Video ReviewA word of caution for those who play with an Xbox 360 pad on their PC, however: The triggers on the 360 controller are much shorter and lack the rumble feedback provided with the Xbox One pad. This means you're required to use incredible concentration and the deftest of touches to ensure you don't power out of a corner and spin your car. The game allows for unlimited flashbacks, and you can always turn traction control to full to mitigate this issue, but that removes the most challenging and enjoyable part of the game. Let's just say that it may be time to buy an Xbox One pad for your PC, or better still, a wheel and some pedals.The race engineer in F1 2015 is a lot more talkative, providing a host of genuinely useful information during practice sessions, through qualifying, and throughout the race itself. During your time in the car, he keeps you up to speed on your strategy and on aspects of the track you should be focusing your attention on; he even notices if you're starting to struggle with tire wear. He's not the only one that feels a lot more realistic, either. The drivers in F1 2015 are both capable of defending and overtaking intelligently, and of making rash decisions that force you to take avoiding action. This makes defending your position as enjoyable as hunting down the car in front lap after lap. They are still capable of making dumb mistakes, and backmarkers don't always get out of the way properly, but all in all, they feel more human and provide more excitement than in previous games in the series. All these aspects of driving--wrestling the car, toying with race strategy, racing wheel to wheel against your foes--make F1 2015 a game that often delivers memorable racing moments.Though Quick Race allows you to choose any track and driver to take part in everything from a full race weekend in Melbourne to a short three-lap spin around Yas Marina, the bulk of the games action takes place in Championship Season. Here, you take control of your favorite F1 driver, racing a full season with practice and qualifying lengths to your liking. F1 2015 also comes with all the drivers and tracks from last year's season, so you can go back in time from the options menu if you want to drive the Hockenheimring or pay your respects to Jules Bianchi.All these aspects of driving--wrestling the car, toying with race strategy, racing wheel to wheel against your foes--make F1 2015 a game that often delivers memorable racing moments.F1 2015 has also added a Pro Seasons mode, which forces you into full race weekends with realistic race lengths. In this mode, you're also forced to drive from the perspective of the helmet with no on-screen display, against the toughest of AI competitors. So it's fair to say that it's not for the faint of heart. However the fact that this modified version of the normal Championship Mode receives it's own place on the main menu is telling of how few ways there are to play F1 2015.Career mode is gone, meaning you can't create your own driver like in previous games. There is also no co-op of any kind. You can't play locally with a friend in split-screen anymore, or take part in co-op seasons like in previous games. The multiplayer menu has an option to play with friends in individual races, which is just as well, because in days of trying to connect to any of the online lobbies, I never once found a game.An entire graphics overhaul means F1 2015 looks better than ever, but it's not without its own issues. Disappearing wheels and graphical glitches take the sheen off an otherwise great looking drive. And while the PC at work allowed me to play hours with barely a hitch, my home computer crashed more often than Pastor Maldonado on an opening lap. As wonderfully fun as the racing can be in F1 2015, few things are more frustrating than your PC crashing to desktop after surviving 31 laps around Marina Bay.The game also has no safety car--not even the virtual safety car that was added to the 2015 season. So it's more than a bit strange to see a four car pileup happen behind you in Monaco, only for the race to continue as if nothing happened. While in-game crashes are more spectacular than ever, the car damage is too inconsistent. Ram into the back of another car, and your front wing has as much chance of being totally unaffected as it does realistically breaking into pieces.F1 2015 is an incredibly frustrating game, representing both a wonderful step forward and a massive stumble. Serious technical issues, a dearth of game modes, and multiplayer which is functionally broken on the PC sour what is otherwise a wonderful driving game. If you can get F1 2015 to run without crashing on your PC, and you're satisfied playing Championship Mode, this is a marvelously fun driving game. But just like in Formula One racing, no matter how good your car feels around the track, it counts for nothing if you can't get it past the chequered flag. Reliability is key in racing, and right now F1 2015 on PC has too little of it."}