{"ref": "https://www.gamespot.com/reviews/ms-pac-man-maze-madness-review/1900-6110341/", "date": "October 12, 2004", "game_name": "Ms. Pac-Man Maze Madness", "text": "Take the classic Pac-Man formula and add switch, key, and push block-style puzzles to it, and what you end up with is Ms. Pac-Man Maze Madness. Your goal in each of the game's 13 levels is to collect all of the dots and fruits that you can find and then make it to the exit. It's a process that involves basic puzzle-solving skills, such as block-pushing and key-gathering, and steering clear of a variety of different enemies, including ghosts, snowmen, wild dogs, and fire-breathing witch doctors. These new concepts enhance the classic formula without ruining the basic maze-running that made it so likable in the first place, but ultimately, the game is best suited for inexperienced or younger players because it just isn't very challenging. Ms. Pac-Man's world has an isometric 3D look. Namco originally published versions of Ms. Pac-Man Maze Madness for the Nintendo 64, PlayStation, and Dreamcast. This GBA version, which was developed by Full-Fat and published by DSI Games, is a scaled-down approximation of Namco's console game. It offers the same exact play modes, including a single-player quest, a time attack mode, and a trio of multiplayer link games (collect the dots, tag, and bomb tag), but there are 160 fewer levels, and this time the original Ms. Pac-Man is no longer offered as a secret bonus. The 13 all-new single-player levels are fairly big, though. Multiplayer games require that each player have his or her own game cartridge. The game has a clean 3D look, even though the 3D polygons that made up the mazes in the N64 and PS versions have been replaced in the GBA version by isometric 2D backgrounds. You won't be blown away by the sprite-based enemies, the ever-present dot-munching sound effects, or the airy music that never seems to change, but the game doesn't look any worse than the other puzzle games that are available for the system. Blow up brick blocks by pushing TNT boxes next to them. Like Pac-Man games of old, the controls are simple and the objectives are clearly laid out. All you need to do to steer Ms. Pac-Man is push a direction on the thumb pad. If you run up against a block or a switch, you'll push or trigger it automatically. Ghosts and other enemies will take away some of Ms. Pac-Man's health if they run into her, but there are heart items and power pellets sitting around that you can use to regenerate health or make it so that she can gobble up enemies. Sometimes a piece of fruit or a key will be hidden behind a pillar or a statue, which can be frustrating, but for the most part, what you see in the game is what you get. Each level has four overall objectives: collect every dot, collect every piece of fruit, earn a set number of points, and do it all within a certain time limit. For each of these conditions you satisfy, you'll get a star. You don't need to satisfy any of these conditions to finish a level, but you will need to collect at least 32 stars to reach the true final boss and to watch the complete end sequence. In the end, the simple controls and straightforward objectives make this a game that anyone can play. Because it is so simple, though, it's also easy to finish. For that reason, Ms. Pac-Man Maze Madness may be best enjoyed by the younger crowd or very casual players."}