{"ref": "https://www.gamespot.com/reviews/the-settlers-rise-of-an-empire-review/1900-6180416/", "date": "August 5, 2015", "game_name": "The Settlers: Rise of an Empire", "text": "When you think of city-building game franchises, chances are pretty good that The Settlers isn't the first name that springs to mind. Although German developer Blue Byte may have been topping the charts in Europe with these sedate simulations of medieval life for nearly 15 years now, the series has never gained the stateside prestige of something like Sim City or even Caesar. But this second-rate status might be coming to an end with the latest addition to the line. The Settlers: Rise of an Empire is the most fulfilling game in the series, adding easy-to-play charisma to the usual Middle Ages economics and trimming much of the micromanagement that made playing past releases in the series as much fun as doing your homework. Despite the aggressive subtitle, gameplay here compares more closely to building an ant farm than it does to building a real-time strategy empire. As with previous Settlers games, the focus of the solo campaign is a mix of stereotypical city building with traditional Age of Empires-like resource gathering and soldier recruitment. Most of your efforts continue to be centered on developing a medieval city, which means you spend virtually all of your time constructing resource-gathering huts, erecting castle walls or gates, and trading with neighboring villages. Hooking up with chicks, medieval style. This kinder, gentler vibe is furthered by a barely-there storyline about pacifying the wilderness to restore the once-great Darion Empire, presumably built in the last Settlers game, Heritage of Kings. Quests are almost all about building and restoring--not fighting. However, they are so tightly developed and filled with busywork that you don't have time to miss battles. You deliver clothing/food to towns in need, fight off Vikings marauding through coastal villages, light signal fires to open up trade routes, stage festivals to get your settlers hitched to comely wenches, and so on. It's all pretty linear and predictable, although at least Blue Byte put enough thought into things to avoid the old ~collect 20 food~ or ~collect 50 stone~ objectives that make you want to put your head in an oven. All of this easygoing stuff is bolstered with a somewhat precious appearance. The landscape is cartoonlike and brightly colored, while characters boast watermelon-sized heads, as well as massive doll's eyes. Yet the art design showcases impressive medieval architecture, while the voice-acting is by turns serious and cheesy, which lets the game sit on the fence dividing gritty from cutesy. Sound familiar? It should sound familiar because Blue Byte's been mining this vein since Bill Clinton was in the White House. The one big difference between the new and old formula is across-the-board simplification. Chopping wood, catching fish, mining stone or iron, gathering herbs, collecting honey from beehives, and the like is accomplished in Rise of an Empire by simply building the necessary huts in the immediate vicinity of the resources in question. These resources are denoted on the maps with icons, such as metal bars, rocks, and deer. The goods produced are then automatically collected by settlers and shipped off to your settlement's storehouse. From there, they are in turn dished out to the butcher shops, tanneries, weavers, dairies, candle makers, and so forth that keep your serfs happy, healthy, as well as fully clothed. Even trade dealings with friendly neighbors are a snap because loads are shipped out automatically by cart the moment that orders are given. So there is never any need to fuss around with trade routes, no need to load and unload carts, or any of the other hip-deep busywork that frequently wrecks economic-style sims. Of course, not everything runs on rails. Blue Byte has tossed enough trees onto the tracks to keep missions from becoming too much of a grind (although you do pretty much rebuild the same city in every mission, so don't expect to completely dodge repetition). The biggest addition is the knight, a hero unit of sorts that acts as the leader of your faction in missions. There are a total of six knights in the game, each with unique names and abilities. You earn them as you progress through campaign missions and then get the chance to choose one of them as your main representative in upcoming assignments. It's an interesting system that lends a fair bit of personality to how campaigns play out. Still, too many knights are burdened with nearly useless powers, such as entertaining settlers with singing and boosting the amount of cash that winds up on the collection plate after sermons in the cathedral. With such options as Lord Marcus, who can recruit swordsmen and bowmen on the cheap, or Lord Hakim, who can turn enemy battalions into friends, you'll rarely bother with the others. For example, Lady Alandra and her healing powers or Lord Elias with his skill at feeding the hungry seem weak in comparison. Dividing the map into separate territories is another new wrinkle. Knights can claim neutral lands by simply building an outpost there, while enemy-held regions can be seized by destroying or occupying the rival outpost. However, this whole concept doesn't add much of a strategic layer to battles because destroying an opponent's outpost causes all the buildings in the territory to self-destruct. So you never get the chance to wage back-and-forth battles for key castles or get the opportunity to make hard decisions, such as razing settlements or attempting to conquer them to win over the citizenry. You just duke it out over resources, but most maps are so well stocked with wildlife, sheep, and the like that there is rarely any need to go to war to provide your peasants with sausages or woolen undies. Come on, baby. Light my (signal) fire. It isn't all bad where territories are concerned, however. Climatic conditions vary dramatically across maps, which can really affect how you manage resources. For example, Northern territories have shorter growing seasons that force you to build up food stocks when the weather is pleasant, as well as rely on wild game and fish, while southern regions are so warm that it's hard to keep crops from burning up. None of these climate zones is overly extreme, although they do establish a sense of place so that you're not just working with the same generic terrain over and over again. Just a few quality-control concerns keep Rise of an Empire from being one of the most polished Settlers game in the history of the franchise. Mainly, it doesn't quite feel finished, even with the installation of the massive patch that you are forced to download the first time you fire up the game. Crashes are an ongoing concern in campaign play. Windows occasionally pop up with error messages saying something like, ~text not found.~ Performance problems can cause lots of stuttering when scrolling the map and serious frame-rate jitters in busy towns, even with details at midrange settings. Every now and again, you'll run into an artificial intelligence hiccup where settlers can't find a resource even though you've placed a hut pretty much right on top of them. Multiplayer also seems somewhat unstable because of frequent crashes, both when navigating the matchmaking lobby and actually playing online. It's a shame that it works so poorly because the multiplayer maps feature wildly diverse terrain and place more of an emphasis on traditional RTS play (meaning that you actually get to fight here) than the resource-heavy, often pacifistic campaign. Thanks to its appreciation of old and new, The Settlers: Rise of an Empire has a lot to offer both longtime franchise followers and newcomers who wouldn't know a serf from a surfboard. It could sure use another patch or two or three to address some bugs, but this effort still does an impressive job of moving the Settlers series closer to the big leagues."}