{"ref": "https://www.gamespot.com/reviews/mlb-2004-review/1900-6026443/", "date": "May 7, 2003", "game_name": "MLB 2004", "text": "Anyone who has played MLB 2001, 2002, or 2003 should be able to jump right into MLB 2004. That's because, roster update notwithstanding, this latest installment is largely the same as its predecessors. While the graphics don't quite measure up to current standards, the gameplay mechanics and available play options are more than ample to provide many months of satisfying competition. MLB 2004 is a solid, complete baseball game, even if many of you have seen it before. Total control hitting allows you to guess the location of the pitch. For the most part, pitching, fielding, and hitting are all straightforward. When you're pitching, you can select from four different pitch types and position your throw anywhere in the home plate area. As the game drags on, your pitcher will become fatigued and his pitches will start to hover in the strike zone. Fielding is likewise pretty easy. Using the standard controller buttons, you can throw the ball to any of the bases and perform an assortment of catches, dives, and relays. Unlike in most baseball video games, the players in MLB 2004 can collide with one another on the field, and you'll more than likely see some impressive collisions in the outfield and at home plate. Depending on your preference, batting can be easy or complex. A yellow box in the strike zone represents your swing area, with crosshairs in the middle denoting the sweet spot of the bat. When the pitcher releases the ball, a red box appears showing the general location of the pitch. Your job is to line up the sweet spot of the bat with the ball. If you succeed, you'll probably get a base hit. If not, you may end up hitting a grounder, a foul tip, a pop up, or a home run, or you may just whiff altogether. MLB 2004 has an optional set of features that you can use to adjust the aim and style of your swing during each at bat. Called ~total control batting,~ this mechanic allows you to guess the location of the pitcher's throw using the L2 button and the directional pad. If you choose the correct location and pitch type, your contact zone will increase. If you're wrong, it will shrink. You also have the option to toggle between contact or power swings. The CPU-controlled opponents in MLB 2004 exhibit just the right amount of skill at each specific difficulty setting. On the rookie setting, CPU players perform their fair share of diving grabs and get a decent number of base hits, but not to the extent that a casual player will be on the depressing end of a lopsided score. The veteran setting is tougher--CPU controlled fielders throw harder and more accurately, while hitters and base runners are more likely to bunt or try to steal a base. On the all-star setting, the computer puts up a real fight. Pitches move more rapidly and display a great deal more break. You'll absolutely need to use the total control batting mechanic to keep games close. Play options include the typical assortment of modes that you'll find in other baseball games. There are exhibition, all-star, season, playoff, and home run derby options available, as well as franchise and spring training modes that are unique to MLB 2004. In the franchise mode, you start out with a team of misfits and try to win games throughout the season in an effort to earn points that you can use to purchase better players. The spring training mode is similar, except that you control a rookie player trying to join a professional team. If you earn enough points to make the team, you'll continue into the regular season, where you'll try to earn a spot in the All-Star Game. Even though most aspects of the MLB series could stand the test of time for many years to come, the graphics have been long overdue for an overhaul. The player models and animations that seemed so superlative four years ago are now merely average. The stadiums are peppered with nice touches such as live Diamond Vision displays and static scoreboards, but the amount of detail evident on the field and in the stands is average. At the very least, 989 Studios needs to spiff up the game by adding more camera transitions and reducing the number of occurrences of texture warping (where objects like the outfield walls and chalk lines bend abnormally whenever the camera viewpoint changes). The graphics aren't pretty, but they get the job done. Vin Scully and Dave Campbell once again provide the audio commentary. They tend to repeat themselves frequently when they're calling routine plays, but they also bring a wide variety of historical anecdotes and statistical topics to every at bat. Many of their comments reflect streaks and milestones from the previous season. The rest of the audio is somewhat on the modest side, with a general assortment of sound effects and hitter introductions contributing the lion's share of the game's atmosphere. Those of you who already own MLB 2003 should think carefully before picking up MLB 2004--$30 is a lot to spend for what's basically just a roster update. On the other hand, if you're trying to squeeze the most life out of your aging PlayStation, or are perhaps a newcomer to the MLB series, then you probably won't be disappointed."}