{"ref": "https://www.gamespot.com/reviews/prison-architect-review/1900-6416278/", "date": "October 13, 2015", "game_name": "Prison Architect", "text": "A foundation is laid. I choose gentle white tiles for the floors. The usual amenities--a toilet, a bed--are here. I place bookshelves and create an unobstructed view to the west to see the sunset. The next room over, Im placing the chair that will kill anyone who ever gets to stay in this building, and laying the electric circuits that will end lives at the flick of a switch. In my first hours of being a prison architect, I have essentially become Death, Destroyer of Worlds.Then, I realize that the first guest in this deadly room looks like he escaped from a sign pointing out the mens room at an Arbys. I have really become Death, Destroyer of Gendered Bathrooms.Thats the strange duality of Prison Architect. It provides a gripping, Gods-eye view of an element of society the Sims/ and Sim Cities of the gaming world dare not touch, but it is so beholden to the idea of being ~a game~ that it threatens to neutralize the considerable number of strong, lasting aspects it possesses.The base game involves a fairly typical set of drag/drop/click real-time strategy mechanics. In the games sandbox mode, youre given a threadbare area in which you can plot out tracts of land for areas of the prison by dragging out a grid to create cells, showers, a yard, a common area, kitchens, canteens, the laundry, etc. Once the foundation is laid, you make the space your own by placing the required items in each room and routing running water and power into the facility.The campaign gives you specific tasks that need to be done around the prison, but you still have plenty of flexibility on the logistics. The sandbox is completely free-form in that regard, though money is more of a factor. Keeping your prison in the black is a constant worry, and also the driving force behind the games hardest compromises. This isnt a matter of building something and just letting the money roll in. If you build an infirmary, do you have enough doctors staffing it? Is a guard there to protect a sick prisoner from being shanked in his bed? Does the kitchen have running water? Do you have enough benches and serving tables to feed all your prisoners at once? Moreover, can you afford any of this stuff?That doesnt even cover the more socially interesting aspects of the game. Is your job to just keep societys dregs in one place, or do you genuinely want these men to get better? You can accept all sorts of programs to improve prisoners quality of life, for instance, like building an area for AA meetings, or specializing the infirmary so it can provide doses of methadone, or hiring a psychiatrist to hear them out. These are optional amenities, and yet to have them there and not utilize them for the greater good feels almost sinful when the whole point of the game is to keep the prison from becoming a lawless hellhole. With only a finite amount of resources to allocate, someone inevitably ends up suffering. Prison Architect forces you to decide who that is, over and over again.The game is intricate enough in its primary sandbox mode to allow the kind of emergent, unique experiences many games with triple this games budget cant achieve. Its not enough to build a new building that your prisoners need; what you put in it directly influences their state of mind, the general mood of the prison, and how likely it is that this uneasy society will stay uneasy instead of tearing itself apart.That is, if thats something you actually want. Its also very much possible to create a place held together entirely by fear, in which full lockdowns are possible at the push of a button, prisoners can have their cells tossed at a moments notice, guards with itchy trigger fingers are the first and last word as long as you have the money to hire them, and a lawyer will find any and every loophole to avoid the legal ramifications of ruling with an iron fist. Riots and escapes are far more regular under these circumstances, and riots are tough to quell, even with a couple of hard-hitting police squads at your disposal.The problem with all this is what sounds on paper like a thoughtful, genuine, nuanced take on what it means to be caretaker to those cast out by society is, in execution, a tonal mess. Right from the beginning, the aesthetic creates dissonance, with each prisons population designed like a nation crude caricature people floating around, shivving each other with disembodied tennis-ball arms. The aesthetic would work fine if we were not meant to have an investment in these characters. But it becomes a major problem when flesh-and-blood people with real needs are reduced to such shorthand. The game even makes a point of giving each one of your prisoners their own rap sheet, noting their history, time served, and pressing needs. The longer the game goes on, the more needing to be done, the less the information on those sheets mattered.Why bother learning a name when his next-door cellmate will have him killed in the shower tomorrow? How long he has till he gets out only matters in as much as an empty cell means I save a few miniscule dollars per day. The only criminals that tend to stand out are the ones who start trouble. And in enough numbers, they too just make up a general collective of ~bad~. Many a prisoner has written or spoken about how prison reduces a man to a number. Its worse thinking that from this distance, each prisoner is a microscopic part of a larger statistic.Theres an argument to be made about this being the purpose, an examination of how these people arent people but a series of multicolored pieces to be moved around and corralled into compliance with consequences you feel from a detached distance. The campaign would be the perfect place to put a punctuation mark on that statement of purpose, but instead, its a sub-HBO crime drama occasionally broken by comic book inserts. In the escape mode, you can play as a prisoner trying to Shawshank your way out of your own prison or a downloaded prison that feels tacked on and wafer thin compared to the massive number of options available in the main game.The campaigns real purpose seems to be the erstwhile, slapdash tutorial the sandbox mode will never provide. The man or woman who is actually in charge of that job for a prison somewhere in America would ultimately still be forced to face the human cost. This game dodges that responsibility whenever it gets too close to having to answer any deeper questions about what were meant to do for the incarcerated.Instead, managing your prison is functionally no different than making sure your Sims go to work in the morning. It involves stats to watch and growth to measure with hard numbers. Its a marvel of, well, architecture. There are more and deeper games out there that allow for interesting feats of building. What Prison Architect dangles in front of every player is the opportunity to see a dark part of humanity from a different, vital angle. When its at its best--when youre genuinely invested in prisoners quality of life, creating the best possible space for people to rehabilitate, and realizing just how many tools are at your disposal to accomplish it all--it is exactly that. And its worth playing for just that feeling. The loss of humanity Prison Architect breeds in its players could be its greatest strength, but without even an acknowledgement of that loss, the game stumbles instead of teaches."}