{"ref": "https://www.gamespot.com/reviews/rayman-arena-review/1900-2885204/", "date": "October 10, 2002", "game_name": "Rayman Arena", "text": "The bread and butter of console gaming has always been the mascot-driven platform game. Nintendo has Mario, Sega has Sonic, and Ubi Soft has Rayman, the armless little guy who's appeared in a few different platform games for quite a few different platforms. The other all-too-common practice for these mascots is to spin them out of the action genre and put them into a rough-and-tumble driving game. Mario had Super Mario Kart, Sonic had Sonic R, and now Rayman has Rayman Arena, a foot-racing game originally designed for the original PlayStation and the current crop of consoles. The original game itself isn't terrible, but the port of the game to the PC is mediocre at best. Right off the bat, Rayman Arena kicks you in the teeth with a collection of presentation problems. The first hurdle comes in the form of a CD check. Rayman Arena is a two-disc game, and for reasons understood only by some guy at Ubi Soft, the game forces you to insert both discs for the CD check, even when you select the maximum install. As is common with ports of console games, Rayman Arena's front-end interface is extremely clunky. You're presented with a bunch of meaningless icons and every time you click anything, you're treated to a special little ~whizzing through space~ animation that brings up the next menu full of meaningless icons. While you can turn these menu transitions off, the game doesn't seem to actually save your settings from session to session. Also, the interface jumps back and forth between letting you use the mouse to select things and forcing you to use the arrow keys to, say, quit back to the main menu. Rayman Arena is broken up into two types of gameplay. The first is a standard arcade racing game. Each course consists of three obstacle-filled laps, and the object is, as always, to get around those three laps faster than your opponents, of which there can be up to three. It isn't just a straight run, though. You'll have to jump over and around barriers, climb up walls, surf down waterways, and do some fast platform jumping to come in first place. Attacking plays a much larger part in the game's battle mode, which puts you into a small arena and lets you fight it out. The game plays like a very rudimentary third-person shooter, complete with the ability to lock on to your opponents. Strangely enough, the PC and PlayStation 2 versions of the game are structured completely differently than the Xbox and GameCube counterparts. The PC version is much more focused on using ice shots to freeze your opponents, and you start off facing four opponents right off the bat in a single-player game. The single-player game combines both the race and battle modes, putting three of each level type into a collection of leagues. The coolest levels--found in the bonus league--have a Tron-like grid look to them, but unfortunately, they can be run solo only in the game's single-player mode. The game's default controls aren't particularly good. You can configure the keyboard and mouse individually for race and battle games, and you can also use a gamepad, which is probably the most convenient way to play the game. Unfortunately, it's also the most difficult to configure, as we had trouble getting two or three different pads to work properly with the game. While the level design in most of Rayman Arena's racecourses is competent, and each track is full of shortcuts and other options to provide some variety, there really isn't enough for you to do. You typically need only two laps on a course to find out a path through the level that will allow you to defeat the computer racers. The game has a multiplayer component in the form of two-player split-screen play and four-player gaming over a LAN. Multiplayer is the main draw of the console versions of the game, but the lack of any real gameplay variety and the slim odds of finding people who want to play this game on a LAN keeps it from becoming addictive at all. Running, jumping, and weaving your way back and forth through the game's tracks gets old pretty quickly, and the battle mode is generally pretty poor, especially in terms of the controls. Graphically, Rayman Arena has a pretty standard cartoony look to it. The game's fairly low system requirements allow it to run at a reasonably smooth frame rate throughout all its modes, though the game exhibited some graphical bugs on a few different test machines, requiring us to run the game at lower-than-maximum resolutions. The character design for Rayman is the same as the one used in the most recent entries in the series, and the game's other racers fit well into the Rayman universe. The course design throws a lot of different looks at you throughout the game, moving from swamps to beaches to pirate ships and back again, but some slightly rounder edges would have helped create the natural, outdoorsy feel that is missing from the game. The game's sound effects aren't very pronounced. Each character has a line or so of selection dialogue that plays in the game's front end. From there, the only sounds are cartoonlike effects that properly convey your racer's reaction to getting smashed by a rogue tentacle, getting zapped by an electric wall, and so on. The music does a decent job of fitting in with the rest of the game's look and feel, but it doesn't stand out. In short, the PC version looks and sounds a lot like a quick, dirty console port. Fans of the few other foot-racing games that have been released on consoles over the years, such as Mad Dash Racing, Running Wild, or Sonic R, will find that Rayman Arena fits in reasonably well with these games. But the poor interface, control issues, and graphical glitches in the PC version of Rayman Arena prevent it from being anything other than a shoddy port of an otherwise average game. Anyone looking for a game of this sort would be better off with any of the console versions, rather than this one."}