{"ref": "https://www.gamespot.com/reviews/officers-review/1900-6216942/", "date": "September 14, 2009", "game_name": "Officers", "text": "With a Russian developer and an opening cutscene that depicts fierce fighting between the Soviet Union and Germany, you might expect Officers, a real-time strategy game set in World War II, to feature a Soviet perspective. However, the Red Army is entirely absent from Officers' campaign. Instead, you'll be taking American forces on yet another tired trot from France to Germany. To Officers' credit, its epic scale and unique focus on supply issues and reconnaissance differentiate it somewhat from other games in the genre, but unfortunately the insane difficulty, the translation and voice-acting failures, and the protracted load times will dissuade you from signing up for another tour on the western front. Officers really nails the ugliness of war. The biggest difference between Officers and every other World War II RTS is its scale. Every mission takes place on a gigantic map, comparable to the largest maps in Supreme Commander. At first the grand scale seems like a strength, but other gameplay elements turn it into a liability. First, unlike in Supreme Commander, you can view only a small portion of the battlefield at a time, which means that you won't even be able to see all of a single skirmish at once. Second, because of your incredibly fragile units and the dangerous and often unseen enemies that lurk behind every tree, you're forced to use extreme caution and play on slower speed settings. As a result, missions can take up to five tedious hours to complete, and unless you have the patience of a sniper, you'll eventually succumb to boredom. Every map consists of five or six zones, which change hands based on the ownership of a central strategic point, and each zone is full of numerous optional objectives, such as capturing farms, radar stations, and fuel depots. Securing these locations provides you with resources and reinforcements that you'll almost certainly need to complete the mission. Resources and logistics are major considerations in Officers, and their mechanics are both novel and realistic. While you don't have to worry about farming, mining, or oil drilling, you will have to ensure that your troops have ample supplies of food, ammunition, and fuel. These resources are liberated when you capture objectives and are stored at strategic points, which supply nearby troops. If you run out of food, troops will start dying, and if you run out of fuel, then you can forget about any armored offensives. To keep your troops in supply, you must move supplies from rear areas to the front lines with escorted convoys of supply trucks. Traveling over roads rather than cross-country conserves precious fuel, and if you control the roads, you can force opponents to waste a lot of fuel, minimizing the threat of any mechanized offensives. More than anything else, Officers puts heavy emphasis on reconnaissance. Because each unit has a different range for attacking versus detecting enemy units, it's imperative that you make excellent use of recon units such as jeeps and armored cars. Nothing is more frustrating than watching as your Shermans are blown to pieces by unseen antitank guns, but thankfully, you too can exploit a blinded enemy. For instance, although you may not be close enough to destroy an enemy artillery piece, you can silence it by destroying the infantry scouting your location. While this battlefield awareness mechanic is unique and interesting at first, as the hours wear on, being constantly alert becomes more work than fun. Your map case provides intelligence reports and a calming shelter from the stress of battle. In addition to the difficult demands of reconnaissance, units just seem to lack staying power. In under a minute, a force of a dozen vehicles could be wiped out by unseen tanks, and elite infantry squads have about as many hit points as a roll of toilet paper. So, you'll constantly err on the side of caution, tiptoeing your units delicately through their tragically short lives. Although they die too frequently for you to develop any emotional attachment, the limited availability of reinforcements forces you to treat each and every unit like it's an endangered Siberian tiger cub. Though your troops rarely survive long enough to gain experience, Officers includes a system for sharpening their skills, which improve with each use and augment their performance in various tasks. Infantry squads can get better at repairing busted vehicles, reconnaissance vehicles can detect the enemy faster, and tank crews can become better shots. As awesome as it would be to get a squad of hardened veterans, the dismal life expectancies of your units make such a troop entirely theoretical. Even with its day-night cycle and detailed vehicle models, Officers' visuals won't impress you. The environments look downright ugly, consisting primarily of vast tracts of uninspiring green plains. In addition to the aesthetic issues, there are some surreal graphical oddities, such as infantry squads mysteriously gliding over the battlefield rather than running, and armor clipping through structures without destroying them. The sound effects, on the other hand, are generally good, with realistic-sounding vehicles and explosions. However, the voice acting tends to be laugh-out-loud bad, thanks to awkward English translations and uncomfortable accents. When you capture a point, you'll hear, ~You have great success, it's very important for us!~ Is Borat your commanding officer? As well, some of the voice actors have problems with their inflection and pitch and place emphases on all the wrong syllables, the net result of which is hysterical. While Officers brings some new ideas to the table, it fails to resolve issues that have plagued RTS games since the beginning of time. Unit pathfinding is pretty bad, and you'll often deal with unseemly traffic jams. Even worse, units may decide that the best way to cross a nearby bridge is to travel to the very top of the map and get to the other side of the bridge by crossing through enemy territory. Other issues include the intolerably long load times; expect to spend up to five minutes waiting for your saved game to load. As well, the Steam version of Officers used for this review crashes frequently unless you manually verify the integrity of the game cache before each launch. Like much in Officers, this tank sounds better than it looks. Multiplayer is the single most disappointing aspect of Officers. First off, there are no dedicated servers. Instead, you must play on a local area network or connect directly by IP address, which makes finding a game nearly impossible. If you somehow manage to befriend an Officers player and successfully set up a game, you'll soon realize that it wasn't worth the effort. Most notably, the game has serious lag issues, and the load times are twice as long as in single-player. Also, the emphasis on recon and supply which permeates the campaign essentially disappears in multiplayer, turning the battlefield into a free-for-all between massive numbers of homely disorganized units, in short, an unseemly brawl. There are two multiplayer modes, which differ only in their victory conditions. The object of the first is to reach a set number of points, earned by controlling strategic locations, while in the second, the winner is the person with the highest score when the time runs out. Additionally, in either mode, the total annihilation of the enemy works just as well. Officers boasts some interesting strategic considerations, including a focus on reconnaissance and realistic supply concerns, which have been lacking in recent RTS games. However, the practically nonexistent multiplayer, the punishing difficulty, the exhaustingly long missions, and a few other annoyances make it a difficult game to recommend."}