{"ref": "https://www.gamespot.com/reviews/atv-quad-power-racing/1900-2883656/", "date": "October 7, 2002", "game_name": "ATV: Quad Power Racing", "text": "ATV Quad Power Racing is one of those games whose screenshots alone make you want to run out and purchase it. Its 3D scenery resembles the sort of backgrounds you'd usually see in PlayStation or Nintendo 64 racing games and far outclasses anything currently available for the Game Boy Advance. Unfortunately, stellar visuals alone do not make a great game, and ATV Quad Power Racing comes up short in every other possible category. Foremost of its flaws, the gameplay in ATV Quad Power Racing is woefully basic. There are nine different ATVs and 10 courses, although you begin the game with only one of each and have to unlock the rest in the three different racing circuits. The various ATVs all have different speed, acceleration, and handling characteristics, and the courses differ in terms of terrain and obstacles. Nevertheless, each course and each ATV feels identical to the rest. The only aspect that truly varies between races is how far apart you'll be spaced from CPU opponents, who exhibit zero skill when you attempt to pass them. The most enjoyable portions of each race are when you have to navigate a particularly dangerous set of obstacles. Crashes and spills elicit a painful groan from your rider, which is a welcome bit of variety in a soundtrack that mostly consists of engine noise. The power-ups are also pretty amusing. These items can improve your ATV's speed, acceleration, air, or traction for a short time, albeit at the expense of some other trait. The frog item, for example, practically launches you off hills, but it makes it nearly impossible to steer. Barring these few examples of joy, however, ATV Quad Power Racing is a remarkably boring game, and even if the gameplay were interesting, you'll never encounter more than one CPU opponent at a time, and there isn't a two-player link option. Although 10 courses isn't a lot compared with most modern racing games, ATV Quad Power Racing does its best to stretch the included tracks by spreading them across three different challenge levels. There's also an arcade option that allows you to play on any course with any of the ATVs you've unlocked in challenge mode. Progress is saved using a simple password system. There is one aspect of ATV Quad Power Racing that is flat-out spectacular: its visuals. The courses are composed of texture-mapped and shaded polygons, making each track a vibrant 3D environment. The feeling of speed is excellent, and the game never bogs down. The vehicles are three-dimensional, and the riders exhibit a fair amount of animation response during violent bounces or spills. You can also select two different camera views. About the only 2D features you'll see are the trees, rocks, and shrubs along the road, as well as the game's menus. ATV Quad Power Racing looks great and that's it. Although no single aspect of this game is terrible, the overall package is unquestionably dull and limited."}