{"ref": "https://www.gamespot.com/reviews/resident-evil-the-umbrella-chronicles-review/1900-6182921/", "date": "November 14, 2007", "game_name": "Resident Evil: The Umbrella Chronicles", "text": "Resident Evil: The Umbrella Chronicles for the Wii marks the latest in a string of efforts to use the heavily atmospheric settings and gruesome undead abominations from Capcom's number-one survival horror franchise for the purposes of a point-and-shoot action game. It's also the most successful, due to a number of factors, including a more intuitive control scheme and more authentic locations. Umbrella Chronicles has the texture of a Resident Evil game, but it still basically handles like an arcade light-gun game. This means it's easy to pick up, but it's also got a fair share of tired genre conventions. Still, there are some exciting moments, and the Resident Evil minutiae it contains should thrill fans. Nemesis puts up an appropriately difficult fight. Much of the game's authenticity comes from the fact that rather than tell an entirely original story, Umbrella Chronicles puts you through the events of the first few Resident Evil games, which the game presents as a report on the final hours of the now-felled Umbrella Corporation, the conglomerate responsible for all these gee-darned zombies. Over the course of the game, you'll revisit the events of Resident Evil 0, the original Resident Evil, and Resident Evil 3: Nemesis. The narrative is understandably truncated, and the game focuses more on establishing a grimy atmosphere and re-creating specific, memorable moments than consistent storytelling. Topping it all off is an all-new scenario that takes place in 2003 and sees the reunion of the original Resident Evil tag team of Chris Redfield and Jill Valentine as they hunt down the last vestiges of Umbrella in a frozen industrial complex, which doesn't quite live up to its exciting potential. There are also a number of side missions that often revisit environments from the main missions, showing you what characters like Rebecca Chambers and fan-favorite Albert Wesker were up to at various points in the series. Considering that most games of this nature tend to last a scant hour or two, it's a little impressive that it can take more than four hours to complete a single run-through of all the missions. Resident Evil: Survivor and Resident Evil: Dead Aim, the two US-released light-gun games that preceded Umbrella Chronicles, both made fair-to-middling attempts to cross-pollinate traditional arcade-style light-gun games and their more dynamic brethren, first-person shooters. There are still traces of this in Umbrella Chronicles, such as the ability to look around a little bit using the Nunchuk's analog stick, but most of the touches that this game puts on the light-gun formula are for the effect of making the experience feel more Resident Evil. What really defines the action is its methodical pacing. There are still plenty of moments where monsters will appear out of seemingly nowhere and run at you at full speed, but a lot of the time you're dealing with the predicament that's key to all Resident Evil games: too many zombies, not enough ammo. While your standard pistol has unlimited ammo, it becomes increasingly ineffective as the game wears on, forcing you to rely on other weaponry that can run out of ammo, including shotguns, automatic weapons, grenades, RPGs, and the like. These weapons can also be upgraded with stars that you earn over the course of the game, increasing their ammo capacity as well as their stopping power. There's a slight kink in the upgrade system, though, in that a lot of the weapons appear in only one of the games, limiting the usefulness of upgrading any one weapon by more than one or two levels. The game tries to encourage precision over speed by giving every enemy a very tiny weak spot that, when hit, produces a one-hit kill, though it's so small that the line between luck and precision becomes pretty blurry. Either way, it's still morbidly satisfying when you're able to pop a zombie's head like a balloon and watch the body stumble around aimlessly for a second as blood spurts out of its putrid neck hole. Flying in the face of ammo conservation is the treasure-hunt aspect of the game. The levels are filled with breakable objects, such as light fixtures and wooden crates, which can contain herbs and sprays for restoring your life, weapons, and documents filled with crazy Resident Evil backstory. It's the type of stuff that fans of the series go nuts for, and it's the main draw for playing through missions more than once. In addition to your firearms, you've got some close-quarters combat abilities, which are surprisingly effective. If a zombie gets close enough to grab hold of you, a quick shake of the Wii Remote triggers a counterattack that instantly kills the aggressor. It doesn't work on anyone other than the standard zombie, and even then they won't always attack you in a way that you can counter, but there are definitely times where it's preferable to shooting them. You've also got a knife that you can use by holding the A button and slashing the Wii Remote around all willy-nilly, and it makes short work of smaller enemies like leeches, ravens, spiders, bees, and bats--enemies that are far more difficult to hit with a gun. Coincidentally, all this remote shaking makes use of the new Zapper peripheral less than ideal. Amid all of the zombie murder that accounts for the volume of the gameplay, there are little interactive cinematic moments,  la Resident Evil 4, where you have to quickly press a button or shake the Wii Remote to dodge some kind of danger. They're generally not that hard, especially since there's always just a single action to pull off, rather than a series. Still, failing one of these moments results in a hit to your health bar, and possibly death. There are some fairly nasty, protracted boss fights that employ the same mechanics to better effect. Lighting plays a big part in establishing Umbrella Chronicles' mood. Though Umbrella Chronicles doesn't look anywhere near as nice as, say, Resident Evil 4, it manages to capture the dirty, undersaturated, run-down feel of the series. Despite some ugly-looking textures, the environments pack in a good amount of detail, and the various zombified people, dogs, monkeys, sharks, snakes, and plants look appropriately fetid. It's too bad that much of the spooky tension that has been a Resident Evil hallmark gets sucked out of Umbrella Chronicles by an overbearing soundtrack that sounds like it belongs in a different, faster-paced game. The voice acting is a better fit, with the role of Albert Wesker, who serves as the game's narrator, being particularly entertaining. Resident Evil: The Umbrella Chronicles is solid for an on-rails shooter, a genre that admittedly becomes less relevant with each passing year, and the strength of the ambiance, the quantity of Resident Evil detail, and some fun little gameplay touches make it better. If you don't care for either Resident Evil or light-gun games, this won't change your mind, but if you do, it's a pretty fun ride."}