{"ref": "https://www.gamespot.com/reviews/lost-kingdoms-review/1900-2869195/", "date": "May 17, 2006", "game_name": "Lost Kingdoms", "text": "The GameCube is long overdue for a role-playing game of some sort. Because of this, Lost Kingdoms deserves more attention than it might have garnered otherwise. The first RPG for Nintendo's newest system, Lost Kingdoms is an original game that features fast-paced real-time tactical battles and not much in the way of traditional role-playing elements. It's also quite short and doesn't look or sound particularly good. You can tell that most of the effort went into the combat system. Throughout the game, you play as Katia, the young princess of a nation that is thrown into chaos when an evil black fog drifts in. Katia has the power to control runestones, which grant her the ability to summon various creatures to fight for her. When her castle becomes enveloped in the fog, Katia sets off to seek the other runestones throughout the land, and with them she hopes to save her nation and hopefully find her missing father, the king, in the process. The plot doesn't weigh very heavily in Lost Kingdoms--you'll occasionally be reminded of what's going on either through simple real-time cutscenes or from dialogue with some of the game's characters. The story is really just an excuse to send Katia to a variety of locations throughout the land, taking on dozens of different monsters with her unique fighting style. The monsters she will fight, for the most part, are just like the ones she can summon to her own aid. The action-packed, real-time combat system in Lost Kingdoms has elements of collectible card games, such as Magic: The Gathering and even a hint of Pokmon. Katia literally uses cards to fight. There are 100 different cards in the game, each depicting a fantasy creature of some sort, mostly Dungeons & Dragons-style standards such as orcs, lizardmen, mind flayers, red dragons, banshees, manticores, sirens, and more. In battle, Katia is randomly dealt four of these cards at a time, and she can carry up to 30 into one of the game's levels. Cards can be one of three basic types: weapon cards, summon cards, and independent cards. Weapon cards momentarily summon the depicted creature to execute a single strike. The creature will suddenly attack and then vanish as quickly as it appeared, though most weapon cards can be used a couple of times before they're spent. Summon cards are more-elaborate one-shot deals through which Katia is momentarily replaced by the summoned creature, which executes one powerful attack and then goes away. Finally, independent cards summon a creature that fights alongside Katia till it is defeated or till the duration of the spell runs out. Cards can have one of four elemental properties, making them particularly effective (or ineffective) against creatures with opposing properties. And cards require a certain number of magic stones to be used, of which you have a very limited supply--if you don't have enough, then casting cards will cause damage to Katia. Additional magic stones can be gained only from hitting opponents, and since you have only a limited number of cards available, the combat in Lost Kingdoms basically boils down to making every single shot count. This makes for some pretty interesting and tension-filled fights, and since there are dozens of different cards you can find and use, there's a good amount of variety here as well. The whole game is viewed from an isometric vantage point. You can easily zoom in and out and rotate the view 90 degrees at a time. You probably won't have time to do this during battle, though, because fights in Lost Kingdoms are surprisingly fast-paced. You'll constantly be running around the battlefield, trying to avoid taking damage from your enemies all while grabbing any magic stones you can get your hands on. You'll learn how each card works only through experimentation and practice. Though the game provides plenty of descriptive information on each one, it really comes down to testing out all your cards and deciding which ones you like best. You'll find that getting some of the cards' attacks to hit properly really isn't easy, what with their vastly different ranges and recovery times. Nevertheless, the card system is quite well-balanced and entertaining to use, though independent creatures generally aren't quite as effective as the weapon and summon creatures are. But toward the end of the game, you'll still have figured out plenty of viable options for an effective deck. The card system is pretty much all there is to Lost Kingdoms. Throughout the game, you progress in a linear fashion from one area to the next. You can't return to levels you've already finished until you've completed the game, but not that you'd really want to--each of the game's levels is just a wide-open series of corridors, sometimes with some very basic puzzles barring passage and other times with nothing. You'll find hidden cards not far off the beaten path. You'll run into random battles as you fight your way through, although a number of fights are also triggered on specific occasions each time you attempt the level. Furthermore, there's typically a boss monster of some sort that you have to fight at the end of each level. And if at any point you run out of cards or hit points, then you'll need to start that level over. Fortunately or not, the levels themselves are all quite short. There are dozens of different cards to experiment with. Unlike in most RPGs, you don't gain experience points in Lost Kingdoms. Katia's maximum hit points and magic stones increase only when she acquires additional runestones at key points in the game. However, her cards do gain experience points, and these can be spent either to duplicate the card or transform it into a different, often more-powerful card. Katia can also buy additional cards, though there's no other use for money in the game. More importantly, there are no towns, no side quests, no minigames, no equipment, and no anything you might otherwise expect from an RPG. Lost Kingdoms is much more of an action game, only with some RPG trappings and a rather complex combat system. The game's production values leave something to be desired, but they're serviceable. The best thing to be said about the graphics is that the frame rate is smooth and some of the creatures are well animated. Beyond that, most of the character models look simple, small, and blocky. In particular, the summon-type cards all look rather weak in action--don't expect Final Fantasy-style visual extravaganzas. Also, it can be difficult to distinguish between your cards in the middle of a fight, since they're shown so small in the bottom right-hand corner of the screen. The game's environments are all rather plain, though there's a good amount of variety to them, and the use of some decent lighting and special effects makes Lost Kingdoms look reasonably attractive overall. The game's music, on the other hand, is grating and repetitive. The combat theme is way too brief and just loops over and over, but at least it's sort of catchy. Sound effects, on the other hand, are pretty solid both in their quality and variety. The game itself is quite short, unfortunately. Once you figure out how the card system works, Lost Kindgoms is pretty easy during its middle portion. It's a relatively short 10 hours or so till the last level, which is much harder than anything leading up to it. Once you've finally beaten it, there's a two-player versus mode you can mess around with to get a little more value out of the game--but not much. Players can pit their best decks against one another, but two-player battles are more about dexterity or luck than about tactics. You'll likely just pick your strongest cards and slug it out. Surprisingly, you are your own worst enemy in versus mode--you'll find yourself quickly running out of magic stones and draining your health, trying to summon more creatures. Though it's the first RPG for the GameCube, Lost Kingdoms will probably be forgotten once some bigger, better RPGs roll around for the system. On its own terms, it's a pretty good tactical action game that simply won't take up a lot of your time, making it better suited for rental than for purchase. As an RPG, Lost Kingdoms lacks a lot of the depth, scope, and production values that makes the genre so compelling. Yet at the heart of Lost Kingdoms lies a cool combat system that makes you look forward to each of the game's random encounters. Not many RPGs can claim that. The card system is pretty much all there is to Lost Kingdoms. Throughout the game, you progress in a linear fashion from one area to the next. You can't return to levels you've already finished until you've completed the game, but not that you'd really want to--each of the game's levels is just a wide-open series of corridors, sometimes with some very basic puzzles barring passage and other times with nothing. You'll find hidden cards not far off the beaten path. You'll run into random battles as you fight your way through, although a number of fights are also triggered on specific occasions each time you attempt the level. Furthermore, there's typically a boss monster of some sort that you have to fight at the end of each level. And if at any point you run out of cards or hit points, then you'll need to start that level over. Fortunately or not, the levels themselves are all quite short. Unlike in most RPGs, you don't gain experience points in Lost Kingdoms. Katia's maximum hit points and magic stones increase only when she acquires additional runestones at key points in the game. However, her cards do gain experience points, and these can be spent either to duplicate the card or transform it into a different, often more-powerful card. Katia can also buy additional cards, though there's no other use for money in the game. More importantly, there are no towns, no side quests, no minigames, no equipment, and no anything you might otherwise expect from an RPG. Lost Kingdoms is much more of an action game, only with some RPG trappings and a rather complex combat system. The game's production values leave something to be desired, but they're serviceable. The best thing to be said about the graphics is that the frame rate is smooth and some of the creatures are well animated. Beyond that, most of the character models look simple, small, and blocky. In particular, the summon-type cards all look rather weak in action--don't expect Final Fantasy-style visual extravaganzas. Also, it can be difficult to distinguish between your cards in the middle of a fight, since they're shown so small in the bottom right-hand corner of the screen. The game's environments are all rather plain, though there's a good amount of variety to them, and the use of some decent lighting and special effects makes Lost Kingdoms look reasonably attractive overall. The game's music, on the other hand, is grating and repetitive. The combat theme is way too brief and just loops over and over, but at least it's sort of catchy. Sound effects, on the other hand, are pretty solid both in their quality and variety. Once you figure out how the card system works, Lost Kindgoms is pretty easy during its middle portion. It's a relatively short 10 hours or so till the last level, which is much harder than anything leading up to it. Once you've finally beaten it, there's a two-player versus mode you can mess around with to get a little more value out of the game--but not much. Players can pit their best decks against one another, but two-player battles are more about dexterity or luck than about tactics. You'll likely just pick your strongest cards and slug it out. Surprisingly, you are your own worst enemy in versus mode--you'll find yourself quickly running out of magic stones and draining your health, trying to summon more creatures. Though it's the first RPG for the GameCube, Lost Kingdoms will probably be forgotten once some bigger, better RPGs roll around for the system. On its own terms, it's a pretty good tactical action game that simply won't take up a lot of your time, making it better suited for rental than for purchase. As an RPG, Lost Kingdoms lacks a lot of the depth, scope, and production values that makes the genre so compelling. Yet at the heart of Lost Kingdoms lies a cool combat system that makes you look forward to each of the game's random encounters. Not many RPGs can claim that."}