{"ref": "https://www.gamespot.com/reviews/arx-fatalis-review/1900-2898456/", "date": "November 22, 2002", "game_name": "Arx Fatalis", "text": "Unfortunately for Arx Fatalis, it's arrived on the tail end of what's certainly been an amazing year for computer role-playing, thanks to impressive games like The Elder Scrolls III: Morrowind and Neverwinter Nights. Players still enthralled by those games are liable to overlook this highly atmospheric first-person dungeon crawl, which boasts some surprisingly impressive production values. But you'll be pleased that you took the time out of your busy role-playing schedule to read up on another great 2002 RPG. With Arx Fatalis, French developer Arkane Studios intended to pay homage to the classic early-'90s first-person role-playing game Ultima Underworld, but it has done much more than just imitate that game. Arx Fatalis is entertaining and great looking, and it should especially appeal to fans of other atmospheric first-person games, including Thief: The Dark Project, System Shock 2, and Deus Ex, let alone this year's Morrowind. Though marred by some technical issues (many of which have already been addressed by patches) and at times confusing to navigate in, Arx Fatalis nevertheless delivers a memorable, original role-playing experience. In Arx Fatalis, you play as a character who's lost his memory and awakens in a small cell. That's got to be the number-one most popular way for a computer role-playing game to start out, but the actual setting of the game is quite a bit more interesting. Arx Fatalis takes place in a world where the sun has fizzled out and civilization has picked up and moved beneath the surface of the earth, since it's warmer down there. This means you won't be seeing much in the way of blue skies or colorful songbirds during your stay in Arx Fatalis, but will instead be seeing plenty of caverns, dungeons, tunnels, and such. That might sound pretty bland, but it isn't. The world of Arx may be lacking in traditional beauty or standard tourist attractions, but it's filled with detail and highly interactive. You're able to pick up just about anything that isn't nailed down, you can use the local flora to brew various potions and such, you can move or throw things around, and if you look down, you can even see your feet. Arx Fatalis does its best to make you feel like you're actually in the world of the game, and for the most part it does an excellent job of it. You create your character by applying ability points to four core attributes and skill points to a number of different abilities, from close combat and magic to stealth, intuition, and object knowledge. Gaining experience levels lets you further improve these attributes and abilities. You're free to specialize as you see fit, though you'll likely want to play as a character with balanced fighting and magic abilities, since combat is inevitable and magic is useful. At any rate, the manual explicitly tells you what you'll gain by spending skill points in different ways, and it is perhaps a bit too explicit in providing specific information on many of Arx Fatalis' creatures, items, spells, and recipes. Your thrill of discovery will be greater if you use the manual only as a reference. Arx Fatalis is played entirely from a first-person perspective, though the game switches to an external view for its occasional in-engine cinematic cutscenes. Though you might have to refer to the manual a few times and remember a few hotkeys, for the most part, Arx Fatalis is easy to control and won't be difficult to get into for anyone who's played a first-person game lately. The early portions of Arx also serve effectively as a tutorial, letting you get your feet wet with the game's combat, magic, and puzzle-solving elements. The core gameplay and interface do have a few shortcomings. The game's inventory management, which is based on limited storage space rather than encumbrance, can be clunky. Though you can toggle an automap feature, it covers most of the screen, preventing you from moving around effectively while you're plotting your course. The diary feature also isn't all that great, as it only vaguely serves as a quest log for what you're supposed to be doing--you'll have to pay careful attention during dialogue with the game's non-player characters to make sure you don't miss any vital clues, since they're not always likely to be noted in the diary. Also, Arx Fatalis imported one of the more notorious features from the game that inspired it: You have to eat. While it's nice when role-playing games let you do such things as build fishing rods, catch fish, and then cook them over an open fire, your character in Arx Fatalis has to nourish himself seemingly a bit too often. You'll wish you could just dump all those rat ribs and cheeses and breads, since that's room you could have used for a nice two-handed sword or other loot. But this is a minor problem. The more important elements, like the game's combat and magic systems, work very well. Dealing with enemies in Arx Fatalis is handled much like in other real-time first-person RPGs, including Morrowind and Ultima Underworld. You'll be able to find and use some ranged weapons, but much of the combat takes place at close range, where you'll use things like swords, clubs, and axes to execute thrusting, slashing, and chopping moves against your assailants. Depressing the left mouse button causes you to rear back to strike, and charging up your attack for a few moments causes it to deal more damage. Critical hits are possible, and it's possible to sneak up behind unsuspecting foes and launch a surprise attack. In any event, the combat in Arx Fatalis looks great, since the game's enemies animate fluidly and will respond noticeably to your attacks with shrieks of pain or various taunts. Injured enemies may turn tail and flee, and various types of deathblows yield various grisly results, depending on where and how hard the killing strike connected. In short, the combat in Arx Fatalis, while not terribly complicated, is still satisfying.The magic system is less conventional, but it can be likened to the spellcasting from last year's Black & White. As in that game, in Arx Fatalis you cast spells using the proper hand gestures. You first need to find the proper runes, and you then trace the symbols on the runes in the air using your mouse. A successful combination of rune symbols will cast the spell. It's a good system, though it obviously takes some getting used to. The game features 50 different spells spread across 10 increasingly powerful spell levels, and these spells do everything from damaging enemies to healing your wounds to summoning creatures to turning you invisible to letting you teleport, so foregoing the path of magic in Arx Fatalis--while perhaps a viable option--isn't recommendable. You might think that drawing arcane symbols might be a bit difficult in the middle of a battle, and you'd be right. Fortunately, you can queue up several spells at a time and launch them instantly using hotkeys, which ensures that magic is viable in combat. Combat in Arx Fatalis is simple but satisfying. The magic system is very good, too. Arx Fatalis isn't exactly a linear, straightforward game. There's very little going from point A to point B, as instead, you'll find yourself in sprawling labyrinths and free to go any which way, though many of these paths will lead to dead ends at first. The game's quests aren't strictly linear, either. Sometimes combat is a viable alternative to discourse, and other times, more than one nonviolent solution is available. Still, you should still plan on getting stuck in Arx Fatalis, a game in which keeping a sharp eye out for little details in the environment will constantly pay off, and failure to do so may have you running around in circles for a while. The game encourages observation, exploration, and experimentation, but at the same time it will punish you if you stray too far from the beaten path, as you'll all of a sudden come up against a foe you're not prepared to face. Still, all this is definitely in keeping with the style of classical role-playing systems such as Dungeons & Dragons, and it affords you with a stronger sense of freedom than you'll get from most other games. Considering the game is one big dungeon crawl, it's fortunate that Arx Fatalis looks so great. Its visuals are nearly as good (and in some ways better) than those of Morrowind, and while the game's character models can look a little awkward, the level of detail found in its surprisingly diverse-looking environments is quite striking. Some of the various creatures look quite good, and the game presents distinctive visions of conventional fantasy archetypes like goblins, trolls, and dwarves. These are detailed enough to move their mouths when they speak, but not detailed enough to sync their lips with their words. Above all, the whole game has a natural look to it. Arx Fatalis doesn't overuse any one particular texture set, and each room or hallway tends to look different from the next. Fog and other visual effects heighten the sense that you're underground in a cold, dark place. Realistic-looking wear and tear in the environments also really helps convey the sense that, indeed, this world has been lived in. You'll clearly see that you're not the first adventurer to set foot in Arx Fatalis. The game sounds even better than it looks. In fact, a lot of it sounds amazing. There isn't much in the way of music, and what's there isn't great. But the game uses a huge variety of incredibly clear and diverse ambient sound effects to try to convince you that you're really in an underground labyrinth. Your own footsteps will resonate loudly throughout the game, and they'll sound different depending on what sort of leggings you're wearing, what sort of surface you're walking on, how quickly you're moving, and how stealthy you are. Other ambient effects and almost all the game's creatures sound equally convincing, and the clamor of battle--including such effects as the sickening sound of blood splattering onto the pavement--is especially terrific. The dialogue in Arx Fatalis is all in full speech, and this too is surprisingly good for the most part. Some of the dialogue and some of the deliveries are actually quite subtle and rather humorous, and they stand in stark contrast to the game's seemingly dismal setting. The atmosphere of Arx Fatalis is largely unrivaled. Arx Fatalis did ship with a number of bugs--the kind that may make you cringe when you read the list of fixes made by its downloadable patch. In short, the retail release of the game is crash-prone and has compatibility issues with certain hardware, though Arkane Studios has been actively working with the game's growing community of players to resolve every issue that comes up. Two small patches are already available that do much to resolve the game's technical shortcomings. Beyond that, the game's 3D graphics engine certainly is resource-intensive, and those running anything around the minimum requirement of a Pentium III 500MHz equivalent should expect slow frame rates and relatively poor performance. Faster machines armed with good video cards make Arx Fatalis look beautiful, yet the game's loading times between sections of the dungeon can still seem rather long. If your system can handle it and you don't have any hang-ups with wandering around in dark places, you'll likely find a lot to like in Arx Fatalis. Fans of Ultima Underworld or similar games will be especially pleased with how faithfully Arkane Studios managed to capture the same sort of feel--how you'll sometimes feel that it's not just some game character but rather you yourself who's trapped in this fantastic world, filled with interesting, dangerous places visit and characters to meet.The magic system is less conventional, but it can be likened to the spellcasting from last year's Black & White. As in that game, in Arx Fatalis you cast spells using the proper hand gestures. You first need to find the proper runes, and you then trace the symbols on the runes in the air using your mouse. A successful combination of rune symbols will cast the spell. It's a good system, though it obviously takes some getting used to. The game features 50 different spells spread across 10 increasingly powerful spell levels, and these spells do everything from damaging enemies to healing your wounds to summoning creatures to turning you invisible to letting you teleport, so foregoing the path of magic in Arx Fatalis--while perhaps a viable option--isn't recommendable. You might think that drawing arcane symbols might be a bit difficult in the middle of a battle, and you'd be right. Fortunately, you can queue up several spells at a time and launch them instantly using hotkeys, which ensures that magic is viable in combat. Arx Fatalis isn't exactly a linear, straightforward game. There's very little going from point A to point B, as instead, you'll find yourself in sprawling labyrinths and free to go any which way, though many of these paths will lead to dead ends at first. The game's quests aren't strictly linear, either. Sometimes combat is a viable alternative to discourse, and other times, more than one nonviolent solution is available. Still, you should still plan on getting stuck in Arx Fatalis, a game in which keeping a sharp eye out for little details in the environment will constantly pay off, and failure to do so may have you running around in circles for a while. The game encourages observation, exploration, and experimentation, but at the same time it will punish you if you stray too far from the beaten path, as you'll all of a sudden come up against a foe you're not prepared to face. Still, all this is definitely in keeping with the style of classical role-playing systems such as Dungeons & Dragons, and it affords you with a stronger sense of freedom than you'll get from most other games. Considering the game is one big dungeon crawl, it's fortunate that Arx Fatalis looks so great. Its visuals are nearly as good (and in some ways better) than those of Morrowind, and while the game's character models can look a little awkward, the level of detail found in its surprisingly diverse-looking environments is quite striking. Some of the various creatures look quite good, and the game presents distinctive visions of conventional fantasy archetypes like goblins, trolls, and dwarves. These are detailed enough to move their mouths when they speak, but not detailed enough to sync their lips with their words. Above all, the whole game has a natural look to it. Arx Fatalis doesn't overuse any one particular texture set, and each room or hallway tends to look different from the next. Fog and other visual effects heighten the sense that you're underground in a cold, dark place. Realistic-looking wear and tear in the environments also really helps convey the sense that, indeed, this world has been lived in. You'll clearly see that you're not the first adventurer to set foot in Arx Fatalis. The game sounds even better than it looks. In fact, a lot of it sounds amazing. There isn't much in the way of music, and what's there isn't great. But the game uses a huge variety of incredibly clear and diverse ambient sound effects to try to convince you that you're really in an underground labyrinth. Your own footsteps will resonate loudly throughout the game, and they'll sound different depending on what sort of leggings you're wearing, what sort of surface you're walking on, how quickly you're moving, and how stealthy you are. Other ambient effects and almost all the game's creatures sound equally convincing, and the clamor of battle--including such effects as the sickening sound of blood splattering onto the pavement--is especially terrific. The dialogue in Arx Fatalis is all in full speech, and this too is surprisingly good for the most part. Some of the dialogue and some of the deliveries are actually quite subtle and rather humorous, and they stand in stark contrast to the game's seemingly dismal setting. Arx Fatalis did ship with a number of bugs--the kind that may make you cringe when you read the list of fixes made by its downloadable patch. In short, the retail release of the game is crash-prone and has compatibility issues with certain hardware, though Arkane Studios has been actively working with the game's growing community of players to resolve every issue that comes up. Two small patches are already available that do much to resolve the game's technical shortcomings. Beyond that, the game's 3D graphics engine certainly is resource-intensive, and those running anything around the minimum requirement of a Pentium III 500MHz equivalent should expect slow frame rates and relatively poor performance. Faster machines armed with good video cards make Arx Fatalis look beautiful, yet the game's loading times between sections of the dungeon can still seem rather long. If your system can handle it and you don't have any hang-ups with wandering around in dark places, you'll likely find a lot to like in Arx Fatalis. Fans of Ultima Underworld or similar games will be especially pleased with how faithfully Arkane Studios managed to capture the same sort of feel--how you'll sometimes feel that it's not just some game character but rather you yourself who's trapped in this fantastic world, filled with interesting, dangerous places visit and characters to meet."}