{"ref": "https://www.gamespot.com/reviews/age-of-zombies-review/1900-6254199/", "date": "March 25, 2010", "game_name": "Age of Zombies", "text": "Age of Zombies may be adding a time-travel angle to the gaming cliche that the undead are becoming, but don't expect to run into any temporal causality loops or grandfather paradoxes here. This PSP Mini game is simple, more than a little stupid, and a lot of fun. It gives you a good feeling of hectic glee as you single-handedly take on hundreds of zombies across five different time periods. The game takes its Mini status seriously though--there's only about one hour's worth of play here, and with little incentive to go through the game again, Age of Zombies struggles to justify its price tag despite the fact that it's only five bucks. Barry Steakfries is getting too old for this s***. Your goal in Age of Zombies is exceedingly simple: Shoot everything that moves. The storyline is just as basic--a mad scientist has opened up a time portal and sent zombies into different time periods; thus, it's up to you to stop them. You play the game from an isometric perspective, and the shooting is reminiscent of such classic games as Smash TV. Your character's movement is controlled via the D pad or thumbstick. Firing is handled via the four face buttons, with each button shooting in a specific direction. Pressing the triangle button will always shoot up, for example, while circle, X, and square are right, down, and left, respectively. To shoot diagonally, you'll need to press two buttons--northeast, for example, is performed by pressing triangle and circle. This may sound complicated, but it's actually pretty easy to wrap your head around, and you'll be proficient with the game's controls in no time. From the first level set in prehistoric times, the game throws vast waves of zombies at you, with dozens onscreen at any one time heading straight at you. Most zombies take only one shot to dispose of, but tougher zombies and bosses cross your path occasionally. You can find several different weapons strewn about the various levels, including shotguns, submachine guns, flamethrowers, and even explosives. Age of Zombies is often quite exciting as you make your way around a level trying to find power-ups while carefully avoiding possible choke points where the zombie horde can overrun you. Being a one-man zombie killing army is good fun, but it isn't particularly challenging because of the fact that there are no harder difficulty levels to choose from and you get unlimited lives. You'll likely blast through the game's five levels in less than an hour, and other than striving to top your own high score in the game's Survival mode, there isn't any incentive to replay the game because it lacks an online leaderboard or any tangible rewards. Age of Zombies may be brief, but there are laughs to be had here with Barry Steakfries, the game's era-hopping hero who, depending on your maturity level, you'll either find crudely funny or just crude. This bad action-movie pastiche sprouts lines like, ~It looks like zombies all up in my s*** restaurant~ and ~That so badass I think I just crapped my pants,~ which, coupled with the game's generally offbeat sense of humor, gives Age of Zombies a goofy vibe. The game's art design is equally goofy--the zombies here look cute rather than menacing, lurching at you with oversized heads and exploding with a balloonlike pop every time they're gunned down. Age of Zombies doesn't come close to the level of graphics the PSP can produce, but its cartoonlike visuals are still quite appealing. Undead blasting doesn't get much simpler than in Age of Zombies, and you're bound to have fun with its comical host of ghouls. The game's lack of selectable difficulties leaves you with little challenge, though, and with only five levels, it's an all too brief experience for its $4.99 (AU$8.45) asking price."}