{"ref": "https://www.gamespot.com/reviews/terminator-3-review/1900-6083854/", "date": "November 18, 2003", "game_name": "Terminator 3: Rise of the Machines", "text": "Terminator 3: Rise of the Machines was a surprise hit during its summer 2003 theatrical release. Many dismissed the film from the get-go, assuming it was simply a cash-in sequel with no redeeming qualities and a new female Terminator antagonist--the T-X. Despite these negative preconceptions, however, Terminator 3 did quite well from a box office standpoint. One company who obviously had faith in the third installment of the Terminator story was Atari, who earlier this year announced that it would be publishing a game based on Terminator 3, scheduled to coincide with the DVD release of the film. Black Ops Entertainment took over the primary reins of developing the game, with help from other veteran development houses, like Shiny, Legend Entertainment, and Melbourne House. The game is, at its heart, a first-person shooter, but it also contains a boatload of CG and taken-from-the-film cutscenes, as well as a fighting game-styled combat system. This all may sound well and good, but Terminator 3: Rise of the Machines feels like a rushed hack-job of a game, with just barely enough cohesive action to keep it from completely falling apart at the seams. California's governor once again reprises his role as the model 101 T-800 series Terminator in this badly designed first-person shooter. Terminator 3 continues the story of John Connor, the would-be hero of a postapocalyptic future that has not yet come. John is constantly under attack by a machine army known as Skynet that has waged war against humanity in that future as they frequently come to the past to try and terminate his existence before he can ever reach his destiny. Each time one of the machines' assassins--known as a Terminator--is sent back through time, the human opposition seemingly and miraculously manages to send another Terminator back as well. However, the humans send one that is programmed to protect John. In Terminator 3, you play as Arnold Schwarzenegger's legendary 101 model T800 series Terminator who must protect John Connor against the latest threat--this being the aforementioned T-X Terminator. At the beginning of the game, you, as the 101 model T-800 series Terminator, have just been reprogrammed by the human resistance. Of course, right at that moment an onslaught of Terminators crashes the party. What ensues is a lengthy series of missions in which you will have to fight your way to the heart of Skynet's defenses to use their time-traveling device so that you can get to the past and keep John Connor from being terminated. Although this section takes a while to get through, it isn't representative of the whole game. In actuality, there are actually only around eight or nine missions in the future portion of the game. Once you do eventually get to the past, the missions get decisively shorter. In fact, the missions become so short that the last two-thirds of them can easily be beaten in around two hours total. On top of the inherent shortness of the game, the story structure doesn't mimic the film's plot especially well, adding sections that aren't all that interesting and omitting many key areas to the point where the story itself is nearly useless unless you've already seen the film and can fill in the blanks, where necessary. Terminator 3's gameplay doesn't make up for its disjointed story. As mentioned previously, Terminator 3 is primarily a first-person shooter--and a pretty uninteresting one at that. The game's best weapons appear during the future era, where you'll have plasma rifles, plasma grenades, hydrogen bombs, and all sorts of other laser weaponry at your disposal. Once in the past, you'll have access to the usual array of pistols, shotguns, machine guns, and even the occasional minigun. Some weapons pack a decent punch, but look and sound underpowered for the heavy amount of damage they seem to inflict. Hit-detection is also very bad, with some blasts seemingly going right through your targeted enemy. Also, if you know an enemy is on the other side of a wall, you can use one of your more explosive weapons to simply blast the wall. Interestingly, the ensuing explosion will hit the enemy on the other side, even though the wall will remain intact. Ammo is scattered throughout the game, but there can be lengthy stretches where you won't find any at all, in which case your best bet is to often just mug one of your friendly AI-controlled associates of their ammo. This won't be much of a problem for you because the AI in the game is pretty horrendous as is, making those teammates of yours largely useless. When they aren't running straight into heavy walls of enemy fire, they're running into actual walls and getting stuck there. Occasionally, you'll also have to protect one of these dim-witted allies, which can be highly frustrating, thanks to the AI-controlled characters' innate abilities to move right to where the bad guys are shooting and to then stay there. Terminator 3's other missions don't do much to inspire any more confidence in the game, either. Sure, you'll have plenty of opportunities to blow up Terminator after Terminator, but the mission objectives associated with the action feel utterly meaningless. You'll have to get to an area to rendezvous with a team for no apparent reason, or you'll have to hit a switch or a button to turn something on or to extend a bridge so that you can get to another area and blow something up for an undetermined reason. In the future section of the game, the missions have slightly more direction behind them--but only slightly more. Once you get to the past, you're basically just going through the motions of some of the film's primary plot points but never the most interesting sections of them, as these are relegated to either CG or film cutscenes that take you out of the action entirely, leaving you to perform the boring grunt work. The monotonous mission structure is occasionally broken up by fight missions, where you switch to a third-person perspective and take on an opponent--usually the T-X, though once you will fight another model 101 T-800 series Terminator. This could have been an interesting idea, but, to be perfectly frank, Terminator 3's fight missions flat out suck. The fighting engine consists of three basic attack buttons for kicking, punching, and throwing, and there's also a block button. Basically, fights consist of about 60 to 90 seconds of mashing on the striking attack buttons and occasionally mixing in throws for good measure. If that sounds a bit boring, it's actually very boring. There are only a couple of different throws you can use, and punches and kicks can only be linked together in three-hit strings. Additionally, the controls during the fight sequences don't feel especially responsive, which leads to a lot of missed hits and badly timed shots. You can pick up objects here and there, and portions of the fight environments are destructible, but these few elements can't salvage Terminator 3's sloppy fighting mechanics. Terminator 3 is also just an ugly game in most every capacity. Bland, flat textures, horrid-looking and stiffly animated character and enemy models, and a multitude of badly designed levels make the game an extreme displeasure to look at. Everything in Terminator 3 really just has a drab, nasty look to it. While this makes some contextual sense in the postapocalyptic portion of the game, somehow Terminator 3 manages to make a post-nuclear war zone look even worse than it probably should. On top of the inherent ugliness, some animations appear rather glitchy, like when enemy Terminators fall to the ground after taking a hit only to suddenly--and one moment later--stand back up as though they'd never hit the ground in the first place. The only real saving grace of the game's graphics are its CG cutscenes, which, while not extremely impressive or anything, do look pretty good. Between the PS2 and the Xbox, the Xbox version of the game does look a little cleaner but not in any significant way. Bad AI, glitchy hit-detection, boring missions, and ugly visuals culminate to make Terminator 3 a painful experience. The game's sound is a bit better than pretty much everything else in the game, due largely in part to Arnold Schwarzenegger, who voices his own character. Unfortunately, there isn't a whole lot of his dialogue to speak of, and, during the actual game, his few one-liners repeat ridiculously often. The remaining voice work is largely made up of dialogue that's been ripped straight from the movie, and what wasn't, isn't all that great. The rest of the audio presentation is pretty unimpressive, consisting primarily of stagnant, repetitive explosion effects, ho-hum weapon sounds, and some occasionally decent, if unmemorable, music. Of course, the classic Terminator theme song is featured in the game but only during menu screens and the credits. Despite the fact that four different development teams worked on various aspects of Terminator 3, the game, as a whole, still feels completely slapdash and thrown-together. None of its gameplay components come together in any kind of an interesting way to make the game the least bit entertaining to play, and the muddy visuals, mediocre audio, and largely absent plot just don't make Terminator 3 anything worth recommending in the slightest. The only remaining thing that could appeal to anyone is the significant amount of film footage and random behind-the-scenes featurettes contained on the disc, but nearly all of this can be found on the recently released Terminator 3 DVD, which also has this footage in significantly better quality and doesn't require you to play through this mess of a game to unlock it all. If you want Terminator 3, watch the movie and pretend this game doesn't exist. You'll be infinitely better off."}