{"ref": "https://www.gamespot.com/reviews/ace-combat-advance-review/1900-6118778/", "date": "February 17, 2005", "game_name": "Ace Combat Advance", "text": "Fans of the Ace Combat franchise aren't likely to embrace Ace Combat Advance. In addition to the watered-down graphics and audio that go along with being on the weaker Game Boy Advance hardware, this portable air combat game is also missing many of the aspects that made the console Ace Combat games so unique and likable. Forget the rich storytelling, the cinematic intermissions, the real-world airplanes, and the challenging mission objectives--they're all gone. What's left over is a fairly playable, albeit generic, portable air combat game with a passable selection of fake planes and simple missions. No 3D here, but the top-down view does allow free-roaming movement. As far as features go, there isn't much here. The game has one play mode, which is a single-player campaign that spans 12 missions. Missions generally take anywhere between four and eight minutes to complete, and the goals include the typical set of dogfights, bombing runs, escort missions, and reconnaissance flights that are part and parcel of every air combat game. There are 10 different planes to pick from. When the game opens, players are limited to a fictionalized mock-up of the MiG 29, called the ~F-C Talon,~ but new aircraft can be unlocked in the GBA game by completing missions with an ~S~ ranking, which is identical to how it's done in the console Ace Combat games. Preflight briefings describe whether you'll face a majority of ground or air targets, and there are six different secondary bomb and missile types that you can equip based on that information. This overall selection of missions, planes, and weapons is fine compared to other GBA shoot-'em-ups, but it's woefully lacking compared to the dozens of missions, planes, and weapons typically found in a console-based Ace Combat game. Since the Game Boy Advance isn't a 3D powerhouse, the development team didn't bother to try to re-create the first-person 3D viewpoint found in the console Ace Combat games. Instead, they've gone with a top-down viewpoint that uses standard 2D backgrounds and objects. This gives the game a look that's more in line with traditional shoot-'em-ups, such as 1942 or Raiden, although Ace Combat Advance does improve upon the classic look by letting players turn around and fly freely anywhere within the large mission area. The audio is also less punchy on the GBA. There are no voice acting or voice clips whatsoever, and the music and sound effects are exceedingly generic--especially the machine gun and missile effects, which sound like they were produced by recording a typewriter. Unfortunately, the graphics, while crisp, aren't very imaginative or colorful. The same small handful of enemy vehicles and planes are recycled constantly, and tanks and antiair batteries have a tendency to blend into the scenery because of their all-tan and all-gray color schemes. It's also nearly impossible to figure out where you are or where you need to be going by simply looking down at the terrain, as the scenery is made up of large swatches of mud and trees without any landmarks (such as rivers, lakes, cities, or roadways). The onscreen radar makes up for a few of the game's graphical shortcomings. Red and yellow dots tell you where enemy planes and ground targets are, and flashing arrows point you toward the location of the next enemy base. Despite its lack of features and so-so graphics, Ace Combat Advance is actually fun to play at times. The controls are intuitive, with steering mapped to the directional pad and weapon controls mapped to the A and B buttons. Destroying enemy planes and vehicles is simply a matter of firing off a heat-seeking missile or guided bomb when the target shows up on radar, or pouring on the guns while the target is right in front of you. The ability to fly freely over the entire mission map is a major plus, because it means you can turn around to make repeated firing runs over a base or actually engage a single enemy plane in a swirling dogfight. Missions, for the most part, aren't very difficult. This is because the majority of the missions simply call for destroying a specific batch of targets in the time allotted, and because the developers implemented a pair of flight controls that absolutely transform enemy fire into a nonissue. One of these controls is a dive maneuver, activated by pressing up on the control pad, which causes the plane to drop altitude for a brief period and allows you to fly right under oncoming planes and missiles. The other is a refueling command, activated by pressing the select button, which calls in a refueling plane that will reload all of your weapons and repair any damage you have. Even though both of these moves bring an added touch of realism to the game, that they can be used an unlimited number of times eliminates most of the challenge that is supposedly brought on by the presence of enemy planes and antiaircraft batteries. Aside from a few splash screens, this Ace Combat has no cinematic punch. What Namco and Human Soft did wrong was that they did not strive to make the GBA game as rich in story or cinematic aspects as its console counterparts. The PS2 Ace Combat games use voice acting and lengthy text narratives to introduce characters, to set up situations of extreme duress, and to describe the ins and outs of a prolonged conflict between two warring factions. A GBA cartridge doesn't have the storage capacity to handle voice acting, but certainly the format is capable of telling an involving story through the use of text and image sequences. Instead, this portable Ace Combat only offers an inkling of a story as told through brief progress updates that show up between missions, and the only cinematic touches are generic splash screens that introduce missions and proclaim victory. Just a bit of pizzazz would have gone a long way toward making the entire product seem less generic and bland. All of the compromises and omissions that were made (or not made, as the case may be) to bring Ace Combat Advance to the GBA have sucked out everything that made the franchise so appealing and so interesting on the console. Fans expecting an authentic Ace Combat on the go are sure to be disappointed. That said, if you're merely looking for a portable shoot-'em-up, Ace Combat Advance does have enough going for it to offer a few solid hours of aerial combat."}