{"ref": "https://www.gamespot.com/reviews/jet-x2o-review/1900-2897387/", "date": "November 12, 2002", "game_name": "Jet X2O", "text": "Jet X2O is another in a long string of extreme sports racing titles for the PlayStation 2. Made popular by the original SSX, such extreme racing games emphasize speed, tricks, and attitude, and you'll find all three in Jet X2O. The game is solid and doesn't fall short in any particular category, but it doesn't really make any improvements to the standard extreme racing formula, either. It's a good middle-of-the-road trick-based racer that should please fans of the genre, and it's an accessible entry point for newcomers as well. We've seen extreme racing games based on nearly every mode of personal transportation, including snowboards, skateboards, BMX bikes, and just about anything else that you can do a trick with. Jet X2O opts to go the Jet Ski route, which of course has been done before in Nintendo's popular Wave Race series. That game focused much more on racing, however, whereas Jet X2O is just as interested in your trick score as your standing at the end of a race. The basic gameplay in Jet X2O is quite simple. You race against several other riders down a river course that's littered with obstacles, ramps, and colored gates that provide you with boost fuel. Boost is useful for speeding ahead of your opponents and for flying higher when you jump off the ramps. Catching air is essential to performing tricks, which in turn is as important as your placement in the race when your final score is determined. The four shoulder buttons all perform a different midair trick, and these tricks can be used together in combos. In addition, holding the square button makes each shoulder button trigger a different trick, so there are a lot of options for racking up multiple tricks and scoring points by stringing combos together. At the end of the race, your standing and your trick score are combined to give you an overall score that determines your ability to advance. Steering the watercraft in Jet X2O can be a bit of a chore at first, as the control can initially be too stiff at times and too loose at others. Once you get the hang of the controls, however, you'll have a solid feel for the way the craft interact with the water, and you'll be able to make difficult jumps and sharp turns with ease. The learning curve for playing the game is somewhat high, but once you master it, the gameplay feels like second nature. The courses in Jet X2O actually resemble those found in a snowboarding game more than the courses in a game like Wave Race because they proceed in a straight line rather than looping around in a circle. This gives each course more variety, since you're not repeating the same scenery and obstacles over and over every 30 seconds. Each course also has multiple alternate routes and shortcuts that are accessible only through skillful use of the boost ability and the ramps placed throughout the course, and these alternate paths add some replay value to the courses. Additionally, the selection of courses is aesthetically varied--each one has an entirely different motif, like a bayou or canyon, to set it apart from the others. Aside from the world tour mode, which lets you progress linearly through the game's array of courses, Jet X2O offers a few extra single- and two-player modes that change the rules around a little. Race mode throws the trick score out the window and depends solely on the fastest finish to determine the winner. Trick mode gives each player a time limit, and when the time runs out, you're disqualified. The only way to add to your time is to perform tricks. The combo mode basically follows the rules of the standard game, but it lets you play a two-player race. Finally, big wave gives you a closed course with lots of ramps and gates so you can get your trick on without worrying about racing. Overall, these game modes make Jet X2O worth coming back to repeatedly. The graphics in Jet X2O deserve a special mention, as they're exemplary for a PlayStation 2 game. The courses are very pleasant to look at overall, with lush and varied scenery and some nice reflective water that you would expect to see only on a more powerful system. What's more, the frame rate is always high and consistent, making the game even more playable. Killer Game apparently has some fairly talented graphics coders and artists. Aurally, Jet X2O is a bit more average, with the standard run of voice-acted attitude from the game's selectable characters. In soundtrack terms, the designers seem to have borrowed a page from the Wipeout handbook, dropping in some garden-variety breakbeat techno music. Of course, even though Jet X2O doesn't do anything particularly wrong, it doesn't really do anything new, either. It executes the standard extreme sports racing formula nicely, and if you've gotten bored of SSX and Tony Hawk, this might be your fix. If the whole genre is wearing thin for you, however, Jet X2O won't do anything to rejuvenate your interest. Jet X2O is a good game for what it is, and if that's what you're looking for, you should give it a shot."}