{"ref": "https://www.gamespot.com/reviews/dance-dance-revolution-hottest-party-review/1900-6180941/", "date": "October 12, 2007", "game_name": "Dance Dance Revolution Hottest Party", "text": "One of the most timeless questions in the world of dance is: What do you do with your hands? Do you stick up your thumb like a hitchhiker? Flap your arms like a chicken? Wave them in the air like you just don't care? There are lots of options, and that's why Konami's Dance Dance Revolution Hottest Party for the Wii is a little disappointing. Instead of going for grace and gusto, Hottest Party goes for random, nervous twitches. And if you're like us, you do enough of that when you're really dancing. But aside from the lame Wii Remote action, Hottest Party is another DDR game with most of the modes, moves, and crazy arrows seen in previous versions. But unlike later PlayStation 2 releases, Hottest Party isn't completely encumbered with random modes and features. As a result, it's much easier to dive into, even though it doesn't add anything to the series. The diamond means you shake it like a Polaroid picture. In case you're new to DDR, it's a rhythm game that has you stepping all over a mat to hit arrows that match the corresponding arrows flowing up the screen to the caffeinated beat of a popular dance track. If you're new to the series, it's all you can do to keep from tripping over your own feet, whereas veterans lithely skip all over the place, seemingly hitting all the arrows at once. New to Hottest Party are diamonds that correspond to hand movements. If you see one of these coming up the right or left side of the screen, you move your right or left hand. It's not dancing; it's DDR. Of course, you can turn the hand movements off and tweak a few other options, such as freeze arrows and other gimmicks, but none of these preferences are saved if you turn off your system. So, every time you play DDR, you have to reset them. When you begin, you have three play options: free play, groove circuit, and workout mode. In free play, you just pick a song, a venue, and a difficulty, and then dance away. Groove circuit, on the other foot, has you traveling through venues and completing various challenges before battling each area's boss character. This is Hottest Party's single player bread-and-butter, and it should be somewhat entertaining for both novices and veterans alike. If you've played a DDR game before, you pretty much know what to expect. Still, this mode misses a couple steps. Specifically, it doesn't have you progress through its tracks in any particular order. Right off the bat, you have a huge list at your disposal, as well as objectives like ~Get a B rating in three songs.~ Any three songs. Although we appreciate the freedom, we think a guided tour through the tracklist is a better way to go. You're guaranteed to play everything at least once, and you'll probably enjoy something you didn't expect to like. But in groove circuit, you wind up dancing to the same songs over and over again. And that's too bad, because the song list is pretty solid. There's a good version of ~Clocks,~ a solid cover of the Fresh Prince's ~Summertime,~ as well as ~Blue Monday,~ ~I Don't Feel Like Dancin',~ ~Little L,~ a surprisingly palatable rendition of ~Disco Inferno,~ the absurdly titled ~Rhythm is a Dancer,~ and ~99 Red Balloons,~ which is a total foot-crusher. Of course, for every excellent version of a song such as ~Hot Stuff,~ there's a horrible, slow track such as ~Heavens and the Earth,~ or something so stupid (~We Will Live Together~) that it had to be written on ecstasy. However, most of the songs are fun to dance to overall, no matter what your taste in music. Unless you're dancing in a boss battle. Basically, you and a computer-controlled dancer step your way through a song while hand or foot missiles float around the screen. The game makes it sound as if they're attacks you inflict on your foe, but neither player has any degree of control over them. They just hover around and try to slip through at inopportune moments. In that regard, these ~battles~ aren't battles at all. The computer gets the same score every single time, misses the exact same number of notes, and tends to earn a high B. You aren't competing against any sort of artificial intelligence, just a score. If you wind up eating a missile or generally screwing up at the start of a song, you might as well start over--but how? Once a song has begun in Hottest Party, there is only one way to stop it (aside from shutting off your console), and it isn't intuitive at all. By holding the plus button, you can autofail. This should be made much more obvious than it is. Now if only there was some way to freeze a song without automatically losing, like some kind of superadvanced pause feature. Aside from groove circuit and free play, you can also play workout mode. Here, you enter a few details about yourself and then set a number of calories you'd like to burn. From there, you basically play through a list of songs until you've met your goal. It doesn't feel like Konami put much thought into this, though. It's just regular DDR with a calorie meter. The backup dancers aren't great, but the environments sure are. Whichever way you play, Hottest Party looks pretty good. The colors are bright and vibrant, the environments are trippy, and the characters look good and animate well. The backup dancers are an unnecessary visual touch, and we'd prefer a bigger version of our main avatar like in the Supernova games, but regardless, the game looks fine. And of course, it mostly sounds alright, with a list including about 50 tracks. The only aural annoyance is the announcer, who either extols or heckles you, sometimes both at once. No, really. As soon as you enter the score screen after finishing a song, he compliments you. After that, he says something based on your grade, and if you screwed up, it's an insult. The effect is kind of like ~You're great! At sucking!~ But less funny. Dance Dance Revolution Hottest Party could stand to be a lot hotter, and a lot cheaper. For 70 dollars you get the disc and the dance mat, but you need to shell out at least 20 more dollars for a second mat if you want to go head-to-head with friends. If you're dying for some DDR on your Wii, this game will certainly deliver. And if somehow you have four Wii dance mats at your disposal, it can be a heck of a party game. But you already know all this, because this is the same game you've been dancing to for years."}