{"ref": "https://www.gamespot.com/reviews/tmnt-review/1900-6168001/", "date": "March 23, 2007", "game_name": "TMNT", "text": "Ubisoft has published a gaggle of TMNT video games to coincide with the release of the latest feature film. While they all vary in quality, the games made for the Nintendo DS and Sony PSP are undoubtedly the worst of the bunch. Both games are virtually identical, apart from the fact that the PSP version has better graphics. The story delivers plenty of fan service for those who have seen the current movie, but the game as a whole suffers from a myriad of problems. The context-sensitive design focuses mainly on pressing buttons in response to prompts, while the few combat situations you end up in are just simplistic exercises in repeatedly pressing a single attack button. On top of that, the graphics and audio aren't that good. This is especially true of the Nintendo DS version in which the 3D environments are often incomprehensible. You have to press one of the three different jump buttons in response to the visual cues that appear. For each of the game's 15 missions, you control a different Ninja Turtle. Your ability to move freely within the 3D environments is limited. Instead, you accomplish most of your getting around by pressing buttons in response to the visual cues that appear. If the blue flashing spot is directly in front of you, you're supposed to push the middle button. If it's toward the left, you press the left button. If it's toward the right--you guessed it--you press the right button. Occasionally, you'll also come across spots where you're supposed to hold the jump button and let up on it when the cue changes color. As you key in the appropriate button commands, your turtle will jump from rooftops, swing from light poles, and perform other acrobatics that would make the guy from the Prince of Persia games jealous. While this sort of context-sensitive design is unique, it doesn't make for a fun game. You rarely get the sense that you're in the Turtles' world because it's hard to feel like you're in control when all you're doing is pressing the appropriate button when you're told to do so. Furthermore, in most instances, there's no penalty for pressing the wrong button except that it wastes a little more time. You rarely feel a sense of jeopardy. The whole process is just dreadfully dull. When most people think of the Teenage Mutant Ninja Turtles, they picture Don, Leo, Mike, and Raph kicking the butts of Foot Clan soldiers while shouting words like ~Cowabunga!~ They are ninjas after all. Incredibly, this game doesn't give you many opportunities to put the heroes' martial arts skills to use. While going through a level, you'll occasionally land in an arena where you'll fight two or three waves of Foot soldiers. At the end of most levels, you'll also fight one of the monsters from the recent movie. There are only a handful of fights throughout the entire game. To make matters worse, the combat engine is pathetic. Your hero and the two or three thugs that are with him in the arena move sluggishly. There's also a noticeable delay after you perform an attack, which often leads to your taking damage as your Turtle stands there unresponsive. Your attack repertoire is limited to the same basic three-hit combination: a charge attack and a somersault finisher that you can perform whenever a context-sensitive icon appears. You can also summon another Turtle a limited number of times and watch him perform an attack that enemies can't block. There has never been a Teenage Mutant Ninja Turtles game with a fighting engine as simplistic as this one. Not surprisingly, neither version of the game comes close to pushing the technical capabilities of the DS or the PSP. The characters in the DS version look crude, and the characters in the PSP version are intricately detailed. Unfortunately, the animation is equally choppy in both games. As for the environments, they're rather generic. Some of the textures are blurry in the PSP game, but there are enough polygons to go around so that the 3D environments actually resemble the buildings, bridges, jungles, and other key locations from the movie. By contrast, in the DS version, it's often impossible to decipher what you're supposed to be looking at because the texture quality and polygon count are so low. The PSP version also benefits from some nifty rain and haze effects. There's nothing particularly noteworthy about the audio. The music sets a dramatic tone, and the sound effects are suitably punchy, but the shortage of Turtle-speak is disappointing. Throughout the entire game, you'll hear only a couple of speech comments. At least both versions do a good job of portraying key events from the movie. You get to play as the four Ninja Turtles, while members of the Foot Clan make up the standard enemy roster. During boss battles, you'll face Max Winters, the four generals, and a few of the monsters that had major roles in the film. A couple of missions even let you play as Raphael's alter ego, the Nightstalker. The PSP version tells the story by displaying image captures and brief video footage taken from the recent movie, whereas the Nintendo DS version gets by with image captures and static comic artwork. The Teenage Mutant Ninja Turtles are known for their fighting skills, but in this game, you fight only a few enemies in each mission. Apart from differences in visual clarity and a few minor layout changes, both versions of the game contain the same 15 missions, which will take you a grand total of about two hours to complete. You can draw out the experience--not that you'd want to--by replaying missions to collect medals that are given as rewards for doing such things as collecting T-M-N-T letters and finishing levels within a certain time limit. In the PSP game, you unlock a bonus image from the movie every time you collect a full set of medals associated with a mission. A similar movie-related reward exists in the DS game, but you have to collect all 65 medals to see it. Both games also feature a wireless multiplayer ninja race mode, where two players compete to see who can get through a level the fastest. You can pick up and use items to slow down your opponent, but the mode otherwise isn't much fun because it's basically the same context-sensitive pablum you get with the main story mode. Through and through, the versions of TMNT available for the Nintendo DS and Sony PSP are disappointing. They're not fun, the presentation is weak, and the context-sensitive design shows that the development team had no clue what the Teenage Mutant Ninja Turtles are about or what fans want from a game featuring the four heroes in a half shell."}