{"ref": "https://www.gamespot.com/reviews/pokemon-snap-review/1900-2545005/", "date": "April 20, 1999", "game_name": "Pokemon Snap", "text": "Having celebrated its triumphant third anniversary in Japan, one had to wonder how long the immensely popular Pokemon licensing steamroller could continue to trundle through the charts. Originally slated for the vaporous 64DD, Pokemon Snap was first met with some skepticism as a game concept, and even more after it was suddenly ported to the Nintendo 64's aging cartridge format. Put all fears aside - Pokemon Snap is a game like no other, melding originality, fun, and creativity with Nintendo's new flagship license.Pokemon Snap is by definition a weird game - you assume the role of a young adventurer trying to capture the elusive Pokemon, Mew... on film. Our friend's search lands him in Professor Oak's lab on Pokemon Island, which is virtually festering with 63 species of Pokemon. In what feels like an amalgamation of Sega's Panzer Dragoon and National Geographic, you ride ~on rails~ through seven bustling environments and snap pictures of the Pokemon contained within. After you return to the lab, Professor Oak rates each picture based on a number of factors: the size of the Pokemon in the picture, whether it's facing you, how well centered it is, and whether it's performing a special move. Special moves and other interesting poses will net you even more points for your picture.Snap's gameplay continually unfolds to reveal new features in traditional Nintendo style, providing a fair amount of replay for the game's seemingly limited seven courses. For example, you start out with only a camera at your disposal, but you will eventually be able to throw apples and gas-filled ~Irritating balls,~ speed up your cart, and play a Pokeflute. Each of these items opens secrets, reveals new Pokemon and their special abilities, and helps you coax the wild beasts into ever more photogenic poses and situations, which help you continually develop your photographic scores. The best photograph of each Pokemon is saved on the cartridge for future reference. While the rating system generally works well, it is possible for the more aesthetically pleasing pictures not to get representative scores, so Nintendo threw in the photo album, which lets you store an additional 60 pictures. In a delightfully quirky little feature, avid photographers can flag four photographs that can be printed onto photo stickers at Blockbuster Video stores nationwide.As fun and quirky as it is, the game's life is rather short. You will get the first 50 or so Pokemon in only a few hours. While the remaining creatures are generally harder to capture, you can probably expect to spend a maximum of 20 hours playing Pokemon Snap before running out of things to do and maxing out your scores. In keeping with Nintendo's highest production standards, Pokemon Snap sports some of the best graphics and sound the N64 has to offer. The character models are detailed and full of personality. The environments are equally lush and detailed; they sport a level of graphic variety rarely seen in Nintendo 64 games while keeping up a healthy frame rate. The soundtrack suffers from the same lack of instrumental richness that just about all the system's games suffer from, but the melodies are appropriate and catchy. What really boosts the sound's score are recordings of all the Pokemon's cries, taken directly from the TV series. Clearly recorded and used often, they bring the Pokemon mystique to a head and complete the environments.Pokemon Snap is a refreshingly unique game on a system in dire need of the very same. Despite its ephemeral nature, Pokemon Snap is a must-buy for fans of the license and probably warrants interest from those that aren't."}