{"ref": "https://www.gamespot.com/reviews/tiger-woods-pga-tour-06-review/1900-6140302/", "date": "November 23, 2005", "game_name": "Tiger Woods PGA Tour 06", "text": "The Xbox 360 version of Tiger Woods PGA Tour 06 features a picture of a dead-serious Tiger, his right arm raised in defiant celebration. Clad in his familiar final-tournament-day red, Tiger strides along, confident in his ability to finish off an opponent--perhaps with a 20-foot putt or a 300-plus-yard drive. The expression on his face says he's all business and very little fuss. That's also an accurate description of the game this photo appears on. While Tiger Woods PGA Tour 06 for Xbox 360 is missing many of the features that round out the game on current-gen platforms and the PC, what remains is a challenging, enjoyable game of golf that, in some ways, exceeds the more fleshed-out versions. PGA Tour pros and created golfers mix and mingle in Tiger 06 for Xbox 360. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tiger Woods PGA Tour 06 Video Review Tiger Woods 06 for the Xbox and PS2 was a matured and well-developed title, with plenty of game modes and a tuned-up control system that added some life to a swing mechanic that had gotten stale over a few iterations. What the game lacked, however, was any sort of serious challenge. One putts were commonplace, 300-yard drives straight down the middle of the fairway were routine, and the competition you faced didn't frequently play much like PGA Tour pros. Because of all this, you had a lot of great features that you just didn't stick with for very long. In Tiger 06 for the 360, you have fewer features, but considerably more challenge. The dual-analog swing system from the PS2 and Xbox versions is still used here. The left analog controls your backswing, while the right analog stick is used to influence the spin and fade or draw of the ball when it's struck. The shape stick works just as promised, and there seems to be more of an emphasis on its use here on the 360. Perhaps it's a function of the courses found in the game--the tight, hazardous confines of TPC at Sawgrass comes immediately to mind--but applying spin to the ball has never seemed more important than it is here. Though swinging the club is controlled the same way, two significant changes keep things feeling fresh. The first is that the sensitivity of the left stick seems to have been upped considerably this time around, meaning it's more difficult to nail a straight shot. If you aren't mindful of your swing, you can shank a ball to the left or right with relative ease. Things get more complex when you compound that with the second control tweak: The power-boost and spin-boost controls have been assigned to the left button on the 360 controller. As a result, maintaining a disciplined, solid backswing with the left analog while rapidly boosting on the left button is very difficult. It took us aback at first, and we shanked plenty of balls into the woods as we got used to it. Eventually we modified our virtual swing by using our right hand to boost on the left button, which freed our left hand up to concentrate on the backswing and follow-through. Just like our real-life golf swing, it doesn't look very good, but it works. We're big fans of this subtle but effective control tweak. Challenge in the game of golf comes from every angle--from the course itself, from the competitors playing against you, and yes, from your constant struggles with your own swing. The added sensitivity of the left analog stick coupled with the power-boost switch means that even routine shots have a chance--however slight--of going awry. And that feels more like golf to us than Tiger Woods for consoles has in a long time. The putting controls are unchanged from the console versions of Tiger 06, and as a result, judging distance is still too easy. Judging the break seems tougher this go-around, however. You can still use the ideal-putt cam to pick your ideal approach angle (but why can't you turn this option off in online matches?), but putting doesn't seem to be as automatic a process as on current-gen systems. The biggest challenge we had with putting in Tiger 06 was spotting the hole on non-HDTV setups--the cup itself seems to get obscured a bit on standard televisions. The game's control system feels the same but is tweaked for difficulty, to the game's credit. The core of Tiger 06's single-player game is the career mode. There's no time-travel theme such as that found on the PS2 or Xbox, nor are there the weekend foursomes with your virtual buddies like in the PC game. Instead, there's a much more straightforward approach that has you create a golfer with the familiar gameface system, then launch into a number of skills challenges that will test different aspects of your game, from putting to playing out of the traps. That probably sounds familiar if you've played Tiger before, but where things differ this time around is in the increased difficulty of these challenges. Certainly, some of them you can beat in one or two tries--putting challenges and other short-game tests being two examples. But some of the long-drive competitions can only be passed after you've jacked up your power attributes appropriately; and a couple of the single-club tests--playing a few holes with nothing but a seven iron, for example--will require a deft touch and plenty of patience in order to pass. Indeed, getting through the four-day Q School tournament and earning your PGA Tour card in the process can be a grueling trial (though you can save your game after each tournament day is complete, which will let you start over if you don't like how your day is going). Your opponents won't give an inch, and you can expect that same level of challenge to continue when you move on to the PGA Tour proper and start competing in weekly events. So, there's a good amount of challenge to be found in Tiger 06. Unfortunately, that challenge will only take place on a mere six courses--Riviera Country Club, Pinehurst No. 2, TPC at Sawgrass, Carnoustie, Turnberry's Alisa Course, and, of course, the ever-present Pebble Beach. When compared to Tiger 06 for the Xbox, which featured a full 14 courses (when you count the fantasy courses), this represents the most significant gap between the current-gen and next-gen versions of the game, and for most players will likely be the deal breaker when deciding whether to buy the game. In that same vein, there's also less stuff to spend your tour earnings on in the PGA Tour shop than before. If sheer quantity of courses is your thing, Tiger 06 for the 360 is tough to recommend. On the positive side, the courses that are in the game are diverse and challenging, and they also happen to look great. Complex shadows and lighting effects convey a real sense of depth to tree-lined courses. That look comes thanks to a sense of depth and detail that simply isn't possible on the PS2 or Xbox. The biggest difference is the quality of lighting and shadows. Take the first hole at TPC, for example, with its honor guard of trees that line both sides of the hole, casting dappled shadows across the length of the fairway all the way to the green itself. As the tree limbs shift with the breeze, the shadows they cast move slightly as well. It's not perfect--those same shadows aren't cast on your player model when he or she stands underneath a tree, for example, and there is some shadow-texture pop-in as your ball travels through the air; but on their own, the shadows add depth and texture to the courses to great effect. Player models in Tiger Woods are hit or miss. Some, like Tiger himself, are amazingly lifelike, with bulging veins in their forearms and spot-on facial modeling that makes the virtual golfer nearly indistinguishable from the real thing. Others, such as John Daly, don't fare nearly as well and look more like vaguely upgraded PS2 or Xbox models. There is also a sense of plasticity to some of the skin textures, and the less said about the poor hair modeling the better, especially when it comes to created players. The game also has periodic frame rate issues, often during the backswing, which can affect the swing's delicate timing. Crowds will line the course during tournaments, and it's nice to see that they aren't just static models--you'll notice some walking around in the background. Even better, you can whack a gallery member with an errant shot, which simply never gets old. Tiger's Dolby Digital 5.1 support is best served when playing amid a full crowd of tournament onlookers. Hit a blast off the tee and the crowd will roar in appreciation (including, of course, the knucklehead who feels it necessary to shriek at the top of his lungs); shank a shot into the woods and the crowd will mutter in disappointment. Beyond that, you've got Gary McCord and David Feherty sharing announcing duties, and once again, the duo does a decent job of announcing the action on the links. Their commentary isn't always accurate--they sometimes call a match play ~dead even~ even if you're up three holes--but at the very least, their calls are entertaining. A slew of EA Trax tunes don't get in the way and won't have you reaching to unplug the MP3 player connected to your 360 anytime soon. Online play adds some life to the game, provided you can put up with the periodic lag. Online play in Tiger includes your standard quick-play and custom-match filters. You can create matches based on a number of different game types--stroke, match, skins, best ball, four ball, alternate shot, and three-hole minigames. The game keeps track of your online stats and has weekly overall leaderboards for stroke and match play, as well as the minigames. There are also daily tournaments to take part in, and the game highlights weekly money winners, golfers of the week, and tourney winners. When it comes to game performance online, there is some lag to speak of, and some of it is consistent. Unfortunately, it's one stroke at a time online--the ready-play option in the PC version, which lets you take your next shot as soon as you're ready, can't be found in the 360 version of the game. In the end, many consumers will judge Tiger 06 by what it lacks--courses, game modes, and extras--and these are fair criticisms. What it doesn't lack, however, is challenge, and a feeling that things could slip out from under your control at any moment--something you couldn't really find on the current-gen versions of the game. If you played Tiger for the Xbox or PS2, you won't find enough here to justify spending an additional 60 bucks on. If you're desperate for next-gen golf or haven't played Tiger in a while, you'll find a game that, at least in terms of control and difficulty, is making strides toward becoming a more complete and realistic facsimile of golf. It bodes well for the future of the series. So, there's a good amount of challenge to be found in Tiger 06. Unfortunately, that challenge will only take place on a mere six courses--Riviera Country Club, Pinehurst No. 2, TPC at Sawgrass, Carnoustie, Turnberry's Alisa Course, and, of course, the ever-present Pebble Beach. When compared to Tiger 06 for the Xbox, which featured a full 14 courses (when you count the fantasy courses), this represents the most significant gap between the current-gen and next-gen versions of the game, and for most players will likely be the deal breaker when deciding whether to buy the game. In that same vein, there's also less stuff to spend your tour earnings on in the PGA Tour shop than before. If sheer quantity of courses is your thing, Tiger 06 for the 360 is tough to recommend. On the positive side, the courses that are in the game are diverse and challenging, and they also happen to look great. Complex shadows and lighting effects convey a real sense of depth to tree-lined courses. That look comes thanks to a sense of depth and detail that simply isn't possible on the PS2 or Xbox. The biggest difference is the quality of lighting and shadows. Take the first hole at TPC, for example, with its honor guard of trees that line both sides of the hole, casting dappled shadows across the length of the fairway all the way to the green itself. As the tree limbs shift with the breeze, the shadows they cast move slightly as well. It's not perfect--those same shadows aren't cast on your player model when he or she stands underneath a tree, for example, and there is some shadow-texture pop-in as your ball travels through the air; but on their own, the shadows add depth and texture to the courses to great effect. Player models in Tiger Woods are hit or miss. Some, like Tiger himself, are amazingly lifelike, with bulging veins in their forearms and spot-on facial modeling that makes the virtual golfer nearly indistinguishable from the real thing. Others, such as John Daly, don't fare nearly as well and look more like vaguely upgraded PS2 or Xbox models. There is also a sense of plasticity to some of the skin textures, and the less said about the poor hair modeling the better, especially when it comes to created players. The game also has periodic frame rate issues, often during the backswing, which can affect the swing's delicate timing. Crowds will line the course during tournaments, and it's nice to see that they aren't just static models--you'll notice some walking around in the background. Even better, you can whack a gallery member with an errant shot, which simply never gets old. Tiger's Dolby Digital 5.1 support is best served when playing amid a full crowd of tournament onlookers. Hit a blast off the tee and the crowd will roar in appreciation (including, of course, the knucklehead who feels it necessary to shriek at the top of his lungs); shank a shot into the woods and the crowd will mutter in disappointment. Beyond that, you've got Gary McCord and David Feherty sharing announcing duties, and once again, the duo does a decent job of announcing the action on the links. Their commentary isn't always accurate--they sometimes call a match play ~dead even~ even if you're up three holes--but at the very least, their calls are entertaining. A slew of EA Trax tunes don't get in the way and won't have you reaching to unplug the MP3 player connected to your 360 anytime soon. Online play adds some life to the game, provided you can put up with the periodic lag. Online play in Tiger includes your standard quick-play and custom-match filters. You can create matches based on a number of different game types--stroke, match, skins, best ball, four ball, alternate shot, and three-hole minigames. The game keeps track of your online stats and has weekly overall leaderboards for stroke and match play, as well as the minigames. There are also daily tournaments to take part in, and the game highlights weekly money winners, golfers of the week, and tourney winners. When it comes to game performance online, there is some lag to speak of, and some of it is consistent. Unfortunately, it's one stroke at a time online--the ready-play option in the PC version, which lets you take your next shot as soon as you're ready, can't be found in the 360 version of the game. In the end, many consumers will judge Tiger 06 by what it lacks--courses, game modes, and extras--and these are fair criticisms. What it doesn't lack, however, is challenge, and a feeling that things could slip out from under your control at any moment--something you couldn't really find on the current-gen versions of the game. If you played Tiger for the Xbox or PS2, you won't find enough here to justify spending an additional 60 bucks on. If you're desperate for next-gen golf or haven't played Tiger in a while, you'll find a game that, at least in terms of control and difficulty, is making strides toward becoming a more complete and realistic facsimile of golf. It bodes well for the future of the series."}