{"ref": "https://www.gamespot.com/reviews/tmnt-review/1900-6167772/", "date": "March 20, 2007", "game_name": "TMNT", "text": "Think of Ubisoft's first attempt at a Teenage Mutant Ninja Turtles game as Prince of Persia for the kiddie set. Based on the upcoming CG Turtles movie, TMNT earns this descriptor because it plays a whole bunch like developer Ubisoft Montreal's most recent Prince of Persia games, relying heavily on platforming over fighting. In this case, Montreal has lessened the difficulty of the various jump puzzles that Price of Persia is so well known for (seemingly to make it playable for the younger audience that's likely to latch onto the film), yet the game is still far more frustrating than it ought to be, due to a faulty camera system and sometimes unreasonable controls. Toss in that the combat is only slightly more complex than the legal-aged TMNT arcade beat-'em-up Konami and Ubi recently rereleased on the Xbox Live Arcade, and what you've got is a game that doesn't properly suit any individual audience. The platforming sections take up the bulk of the game, and they'd be pretty cool if it weren't for that pesky camera. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: TMNT Video Review Since the TMNT movie isn't out yet, it's impossible to gauge exactly how much the game has in common with it. Suffice it to say, it features all the principal characters (though seemingly none of the film's celebrity voice talent) and touches on some of the same basic themes as the film. The whole game is told through a disjointed form of flashback narration, with the titular Turtles each chiming in at random intervals to explain some chunk of the story in the past tense (usually skipping over details that might actually make the whole thing make sense). The dialogue and voice acting is fine for what it is, but as far as providing a satisfying Turtles tale, you're out of luck here. If you're more accustomed to Konami's last few attempts at the Turtles license, you're in for an awakening with TMNT. In some ways, it's a good awakening, in the sense that this game isn't altogether terrible and actually has its fun moments. Those fun moments come from the hop-happy platforming sequences that make up roughly two-thirds of the gameplay. Each stage is laid out in such a fashion as to force you to jump, double jump, wall jump, wall run, flip, and monkey bar your way through. Some of the stages are quite elaborate, relying on a lot of quickly timed movements and jumps that are reminiscent of what the recent Prince of Persia games have been all about. Some areas are built for specific Turtles to navigate, like walls that Raphael can climb using his sai and longer jumps that require Michelangelo to use his nunchakus like helicopter blades to float over. All told, there's a surprising amount of intricacy to the level designs in TMNT. Of course, the relative difficulty of these levels has been scaled back significantly, and none of the stages take more than 10 or 15 minutes to blow through. It was good of the developers to scale the difficulty back, as this is clearly a game aimed at a younger audience. The problem is that they didn't quite scale it back enough. The main frustrations with the platforming sequences stem from the fixed camera the game uses. Because of the way it angles shots, it sometimes makes it impossible to properly judge the distance of a jump, leaving you to guesstimate and trial-and-error your way through certain sections. There are also times where the controls can get away from you. You're jumping around so quickly and so often that you may find yourself instinctively pressing the jump button too many times, ultimately overshooting your goal. Frustrations like this are palpable enough to the standard gaming audience, let alone younger players. On the flip side, the combat mechanics have been scaled back to the point of making them incredibly dull. You really only have one main attack button, as well as a jump-kick button that operates independently of the primary combo system. Each Turtle only has one combo to speak of. It's typically a lengthy combo, but it's the same combo again and again. There are special tag-team moves that come into play from time to time, where by holding down a button, you can call in a fellow Turtle to pull off some flip-happy, electrifying attack that takes out a bunch of bad guys at once. This is basically the game's way of making up for the fact that there are no computer-controlled Turtles onscreen with you while you play, and it's not an altogether bad methodology. The problem with it mostly stems from the enemies you fight being so utterly inept. Throughout the game, you fight wave after wave of pacifist thugs and ninjas who seem content to just swipe in your general direction from time to time. All you've got to do is mash endlessly on the attack buttons and pull together the occasional tag-team move, and you're pretty much never going to die. TMNT has a slick look to it that translates better on some platforms than others. The graphics aren't so much cel-shaded as they are modeled after the CG look of the Turtles in the movie. All the characters animate nicely as they leap and fight through the various levels, and even the levels themselves are relatively pleasing to look at as you play. The frame rate has a tendency to dip in all versions of the game (the 360 version is the most erratic of the bunch), and the aforementioned camera issues are a real bummer, but otherwise, TMNT is a pretty solid-looking game. As tends to be the case with movie-licensed games, TMNT is out on a lot of home gaming platforms, including the PlayStation 2, GameCube, Wii, Xbox 360, and PC. The core game is identical between all of them, though there are some subtle differences. The Wii version is probably the most drastically different, simply because it includes motion controls. Unfortunately, these controls feel hopelessly tacked on. All you do is wiggle the Wii Remote back and forth when you want to do a primary attack and jerk the Nunchuk in one direction or another to kick. These mechanics get extremely tiresome very quickly, and on top of that, there's a weird sensor issue with the Nunchuk. If you're just playing the game and happen to tilt the Nunchuk too far in one direction or the other, your character will crouch like he's readying an attack, and then stay like that until you hold the Nunchuk straight again. Of course, there's nothing in the game to signify that this is what's causing the issue, and you may find yourself initially confused as to what's causing this. Conversely, there's nothing cool about TMNT's combat. It's just boring. The Wii version also happens to look identical to the GameCube version, blurriness and all. Despite support for 480p and widescreen viewing, there don't seem to be any visual enhancements at all between them, which is more than a touch disappointing, because the Wii should be capable of more. The Xbox 360 version predictably looks the best of the bunch, though not to the degree that you might be hoping. The 360 version is brighter, a bit crisper, and features more in the way of environmental detail, such as added grass textures and foliage. The 360 version also supports more enemies onscreen at once, though somehow the combat doesn't seem any more challenging with more enemies to dispatch. There are also achievements to consider, but they also happen to be incredibly easy to acquire, with many of them relegated to points for beating levels and pulling off individual special abilities. Even still, the better graphics and achievements ultimately make the 360 version the best by default. But if you'd rather not spend the extra $10, the PS2 version looks quite nice. The PC version is solid, too, though you really need a dual-analog gamepad to play this game properly. Between the overly simplistic combat and sometimes-obnoxious platforming sequences, TMNT is like a man without a country. Younger audiences are likely to balk at some of the more frustrating elements of the platforming, and older players are going to be bored to tears by the effortless fighting mechanics. The moments when you actually do find yourself having fun with TMNT are just frequent enough to prevent the game from being wholly unadvisable to fans of the film desperate to take part in some interactive Turtle adventures, but for everyone else, TMNT is one you can safely pass on."}