{"ref": "https://www.gamespot.com/reviews/state-of-emergency-2-review/1900-6144812/", "date": "June 25, 2007", "game_name": "State of Emergency 2", "text": "State of Emergency was one of those games you either adored or abhorred. Released by publisher Rockstar Games right around the time Grand Theft Auto III came out, State of Emergency certainly wasn't the deepest game around. It was essentially a hysterically violent arcade beat-'em-up that tasked you with scoring points by causing as much chaos as you could and starting big, crazy riots, with hundreds of panicking people running around like frightened sheep. It was amusing for sure, but not everyone was able to latch onto it. Enter State of Emergency 2, a sequel that completely revamps the concepts of the first game and transforms it from a wacky beat-'em-up into a thoroughly structured third-person shooter with an actual storyline and no melee combat whatsoever. Incidentally, the original game's developer, VIS Entertainment, was the one to get the ball rolling on this sequel, but SOE2 went through three publishers, two development houses, a bankruptcy, and a lot of drama to find its way onto store shelves. After playing through SOE2, it remains unclear what so many different companies saw in this generic and frustrating shooter. State of Emergency fans might find a couple of familiar things in the sequel, but for the most part, they'll probably just be off-put by all the radical--and lousy--changes. State of Emergency 2 takes place about a decade after the first game, which already took place in something of an Orwellian near-future scenario. The evil Corporation still runs the governmental show, and the aptly named resistance group Freedom is still fighting for your rights. However, the leader of the organization, Roy ~Mac~ MacNeil, is about to be executed in a Corporation prison. Of course, this would be a depressing game if the execution went on as planned, so instead, a number of Mac's Freedom buddies help him bust out of the gas chamber and eventually out of prison. From there, the story degenerates into a largely incoherent tale of government mind control, crazy conspiracies, and some of the worst voice acting you'll ever hear (we'll get into that shortly). The fact that State of Emergency 2 even has a storyline is already a giant departure from the first game, which had a story only in the loosest sense of the word. In fact, though it features a couple of the same characters and sometimes involves riots, you really can't compare this game with its predecessor, since they're so wildly different. State of Emergency 2 does away with pretty much all the beating up of people that was such a staple in the first game and sticks entirely to the act of shooting guns, rocket launchers, and things of that nature. It's an OK idea in theory, but the problem is that instead of adding any unique or interesting wrinkles to the third-person shooting, SOE2 seems content to rehash the same tired conventions that a hundred other third-person shooter also-rans have done time and time again. The gunplay requires next to no skill, as all you really need to do is spray bullets everywhere, and odds are you'll be able to pick off most enemies without trying very hard. There are a couple of interesting things you can do. For instance, Spanky, the Latino gang leader from the first game, can now issue basic attack commands to loyal gang members walking the streets. But this isn't exactly an original mechanic, and most other games do it significantly better, in that the characters follow the commands properly and won't go running into heavy gunfire or defend your position by standing right in front of your gun barrel. The game also lets you swap between pairings of the four playable characters during certain missions, although the necessity of the character swapping seems suspect at times. Each character does have its own unique abilities, but sometimes those abilities are completely unnecessary in a mission, and ultimately the only reason you'd even bother switching is to have a character with full health (computer-controlled players can get shot, yet they take no damage). The only challenge that presents itself in SOE2 is the number of enemies the game will often toss at you and the dearth of health packs available. Though there are parts where you can just run-and-gun it the whole way, there are also a lot of times when you'll have to lean around corners to shoot guys from cover or even (gasp) use stealth. Unfortunately, that's not much fun. Stealth killing is defeated by the lack of any unique stealth attacks beyond shooting guys in the head with a silenced pistol and by the way that enemies will randomly detect you for no discernable reason. The corner fire mechanic is OK, except that when you get close to a wall, the game's physics will sometimes bump your character too far to the side and inadvertently leave you open to bullet peltings. Lackluster stealth and cover mechanics aside, SOE2 is also thoroughly dragged down by its overreliance on irritating trial-and-error-based missions. The game is liberal with its use of checkpoints, but you'll still find yourself playing sequences over and over and over again. One particularly annoying example is a sequence inside a Corporation base. Here, you're presented with a room with four doors. One has the path to the next area, and the other three contain armed guards. The only way to find the right one is to mess around until you stumble upon the right door. Once you find the door with the right path, it takes you to another room with five doors and the same scenario. After that? Yet another room with six doors. Add to this the fact that you get no health packs during this entire sequence, and you're going to be replaying this section more times than you'd care to talk about. The whole game is just littered with irritating sequences like this, where you'll be forced to feel your way through by playing a sequence multiple times until you've memorized exactly where every enemy is coming from. State of Emergency 2 also lacks the chaotic nature that made the first game so unique. There are moments when you'll participate in what you could call a ~riot,~ but the sense of panic you got in State of Emergency's various riots is entirely absent. Maybe it's because the people who do the rioting don't do much other than run around aimlessly, shaking their fists and periodically beating up Corporation cops. Or maybe it's because there aren't many rioters around, likely because the level designs are larger and more spread out, rather than being compact like in the first game. Or maybe it's because you spend so much time doing things other than rioting that the actual moments of rioting seem completely incidental. In fact, you spend a lot of time doing things other than running around. SOE2 tosses a bunch of crazy vehicle, turret-shooting, and wall-scaling missions at you--none of which are very good. The vehicle controls in this game, whether you're in a tank, a helicopter, or a speedboat, are lousy, and controlling any of the aforementioned vehicles is a chore. The turret-shooting missions are precisely the opposite, in that they're the easiest aspect of the game and don't require a lick of skill. In the sequences where you're scaling up and down the sides of buildings, it's like a weird game of whack-a-mole where the moles shoot at you--Corporation soldiers will pop out of windows, and you'll have to shoot them, lest you die hanging from the side of that building. The really irritating thing about these missions--apart from the tediousness of the act of rappelling itself--is the way that enemies will sometimes pop out of windows and stay just far enough out of reach that you have to be insanely precise with your shots to kill them, but they can hit you multiple times with stray bullets. That's not fun. In fact, it's fun's worst enemy. The action's over fairly quickly, too, as you can beat the story mode in five to six hours, tops. To be fair, SOE2 does include an arcade mode with a number of unlockable challenges to play through that are separate from the main story mode. But this mode feels more like an afterthought, included only to appease those who might buy this game for the name on the box and be shocked and alarmed by the game they end up with. Apart from a few ~kaos~ missions, which are sort of like the kaos missions found in the first game, most of the arcade missions are based on the sniper, vehicle, and turret-shooting missions found in the story mode, and they're no more enjoyable in arcade form than they were as a part of the storyline. There's also some split-screen multiplayer action for up to four players with deathmatch, capture the flag, and the like. It's actually probably the best action to be found in the game, yet it still manages to become dull and repetitive after a couple of plays. The first game might have been shallow, but at least it didn't include inane stealth mechanics. State of Emergency was technologically impressive when it debuted in 2002, as it was quite a sight to see so many characters running around onscreen in a PlayStation 2 game at that point. The seemingly lower number of characters that show up in this game and the fact that four years have passed since the first game's debut combine to make SOE2 look severely dated. The game seems to use some form of the graphics engine that VIS used to power the first SOE, and Midway licensed for NARC, and that engine just looks antiquated in this day and age. Characters look blocky and animate stiffly. When there were a billion people onscreen in the first game, the blockiness of the models was forgivable, since the point was numbers, rather than aesthetics. But here, these graphics just look crusty and unimpressive. Even the ancillary visuals, like the environmental designs, and various weapon and explosion effects seem decidedly low-rent compared to what else is out there. There's not much that stands out about SOE2's audio, apart from the completely awful voice acting. The writing is pedestrian enough, but the actors playing these characters ham it up to the point that it's hard to listen to them. Spanky is especially amazing--he sounds sort of like Cookie Monster if he lived in the barrio. The problem with State of Emergency 2 is not that VIS--and then eventually DC Studios--opted to change the formula of the first game. The problem is that SOE2 feels overly self-conscious about what the original game was. SOE2 seems to have a big chip on its shoulder and to have something to prove to everyone who thought the first game was too shallow, but in the process, it shuns all its previous conventions only to box itself into a corner with completely uninteresting action, a worthless story, and ancient technology. Those who enjoyed the first game won't get any of what they liked in that game in the sequel, and everybody else will simply be bored to death by the often frustrating and entirely unoriginal gameplay. State of Emergency 2 may have dodged a lot of bullets to find its way to release, but it couldn't dodge the bullet of mediocrity."}