{"ref": "https://www.gamespot.com/reviews/madden-nfl-08-review/1900-6176601/", "date": "August 13, 2007", "game_name": "Madden NFL 08", "text": "It's taken two and a half years and three releases, but Madden is finally back to form. In Madden NFL 08 for the Xbox 360 and PlayStation 3, EA Tiburon has put together the most complete version of Madden seen on either console to date. The gameplay is tight, practically every old feature that had been previously missing is back in some form or another, and new additions have been made that significantly change how you play the game--for the better. By no means is this year's Madden flawless; it's definitely got some quirks and underpolished aspects that will probably drive some people crazy. But taken as a whole, Madden 08 is easily the first great entry for the series on the 360 and PS3. You'll notice the big difference in this year's title the second you hop into a game. Marquee players have been given icons to specifically represent what type of ~weapon~ they are on the field. There are a ton of these different designations, separating out multiple types of players at each position. Wide receivers, for instance, come in a wide variety of forms. There are quick receivers who are able to nimbly duck and dodge around defenders to get open; possession receivers are good at catching the ball in traffic; hands receivers can grab onto just about any ball thrown their way; and big play receivers will leap up to make those really spectacular catches. Every position has at least a couple of these different designations, though not every player is truly a weapon. In addition, each weapon type has an opposite, a player on the other side of the field who can, in a sense, cancel out their abilities. Big play receivers, for instance, are vulnerable to big hitters, finesse move defensive linemen have a tougher time getting by top pass blockers, and so on. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Madden NFL 08 Video Review 1 Say hello to the first great football game for the Xbox 360 and PlayStation 3. The system itself works beautifully within the context of the game. Sure, you'll certainly note the differences between QBs like Brett Farve and Vince Young, but that would have been the case in any Madden game of the last few years. Here, you'll notice the differences in just about every position. Power running backs and speedier running backs are more individually defined than ever before, as are the differences between run blockers and pass blockers. On the defensive side of the ball, you see more in the technical differences in play between a shutdown corner that guards against the deep threat, and the press coverage corners who prefer to jam up receivers at the line. And the big hitters? Yes, they hit big. These new weapon designations even go beyond basic techniques--they can actually give you insight into what the other team is doing. Specifically, the ~smart~ QB and defender designations come with a meter that fills up as individual plays on the other side of the ball are called throughout a game. After a single play or coverage scheme has been called four times, a quarterback like Peyton Manning or Tom Brady can actually see exactly what the defense is going to do, whereas a smart defender can get a glimpse of where the offensive play is going to go. Obviously the counterattack to something like this is to vary up your playbook as much as possible, which is in itself a great thing, since that's what real offensive and defensive coordinators are forced to do in the real game. The excellent new weapons feature isn't the only way the on-field action has changed. Madden's control scheme is more complex than ever before, with more presnap controls than you'll probably ever know what to do with. Once you get the hang of it, the controls become like second nature, but it's likely that players not extremely well versed in the ways of Madden will get a little confused at first as they fumble around with the controls, especially since practically every button on the controller does at least something presnap. This is especially true on defense. The defensive playmaker controls are back, letting you assign coverage changes to individual players before the ball is snapped. You can also now focus coverage on a specific receiver with a quick button press, though doing so will draw defensive resources away from other receivers. When laying in big hits via the right analog stick, you can hit a player high by pressing up, and low by pressing down. Doing this has different effects on different types of players. Hitting high might cause a less cautious ball carrier to cough up the rock, while going low on a power back is probably the best way to take him down as he pushes past the line. There's also a button that will make your controlled defender attempt to strip the ball from a carrier, provided you time the button press right. Between that function and the big hits, you'll actually be seeing quite a few fumbles throughout Madden 08. We're not talking NCAA 08 numbers of turnovers here, nor is the number of fumbles per game outlandish or unrealistic, but fumbling is far more regular an occurrence now than it's ever been in a Madden game to date. It's definitely noticeable enough that it will probably frustrate some players. More than anything else, it simply pays to be extra careful with the ball. Between the new weapons feature and all the various control adjustments to this year's game, Madden 08 provides an extremely deep and challenging experience on the field--possibly even a bit too challenging, depending on your tastes. One of the complaints about last year's game was that the defensive back artificial intelligence was too much of a pushover, allowing too many easy completions. That's definitely not the case this year. DBs are quite tough to get out of position, especially on the higher difficulty settings. It's maybe a little overblown in terms of challenge there, as DBs seem to just magnetize themselves to receivers and always find a way to get an arm up to swat a pass away, however unlikely the situation. Even linebackers are tough to get the ball by a lot of times. But that's really the worst thing you can say about the AI on any level. Otherwise, it plays a very realistic game of football across practically every position. The new weapons system of characterizing various players' abilities adds a whole new dimension to the game. Another big complaint about the last couple of iterations of Madden was the distinct lack of features. Madden 06 had only a barren franchise mode and basic online play to its name, and while 07 cranked out a new version of superstar mode and a couple of minigames, franchise and online went basically untouched. In Madden 08, many of these modes have seen at least slight upgrades. The biggest and best differences are to be found in the franchise mode, which, while still not as rich with features as previous installments on older consoles, still has a fair amount to offer. During the season, you can now train individual players before each week's game to try to boost up their stats in certain categories. These stat boosts are tied into point totals you earn during drills. So, say you've got a receiver that's got a high, but not quite high enough rating in the ~hands~ category; what you'd then do is look at how many points you'd need in order to get him to the next level (points earned are determined by the difficulty level of the drill), and put him through his reps. These stat bonuses stay put, too, so you won't lose them the next week. In terms of offseason features, the owner mode is back in a relatively new form. During the season, you can keep track of your finances via a series of menus that tell you everything from how your revenues and costs stack up against other teams in the league, to which players are currently in a contract year. You'll also hire a scouting agency at some point, and during the season you can task them with keeping tabs on up to 20 rookies from the upcoming draft class. The reports they give you aren't necessarily much more detailed than the ones you get by default on every player, but they tend to be more accurate in judging potential. Rookie potential is actually a new feature in and of itself, in that now, rookies with different expectation levels can become gems or busts over time. These icons don't pop up until a player has been in the league for a little while, but it's all about what a player's potential is. If a player turns out to be greater than his draft position would initially suggest, he'll get a gem icon and actually perform above his stats. Busts are, as you'd imagine, the polar opposite. Even a bust can still be a useful player if you find a way to get him to make plays, but it's far more challenging a prospect than with any other player. Lastly, franchise owners can now maintain their team finances by buying upgrades for their stadiums, gaining sponsorship deals, and even opting to move the whole bloody thing to another town if so inclined. Of course, doing so is a tricky process. You have to find a city interested in a team, and on top of that, the costs of doing so are prohibitive. There's a neat system in place that shows how interested a city is in having you in relation to how much money they'll have to spend in order to do it. You basically have to find ways to cut the city's costs down if you want to move there, and if you submit an offer that isn't up to the city's liking, you lose your chance to move until the following year. Once you do move, you'll build a stadium, edit your squad as you please, and finally have that team in Winnipeg that we're sure you've always dreamed of. The superstar mode is much as it was last year, but considering how good the mode was last year, that's not a bad thing. You still create your player, use your influence on the field to boost up your teammates, talk to your agent, sign contracts, and generally go through the motions to try to get yourself into the Hall of Fame. One neat addition is that you can actually choose players from this year's rookie pool, so if you want to live the life as Calvin Johnson or live in a fantasy world where Jamarcus Russell actually signs a contract with the Raiders and gets to start, you can do so. There has also been a slight alteration made to the camera system in this mode. The camera is now a bit more zoomed out, making it easier for you to actually see the field. Granted, the camera is still pretty tight on your player, so it's only a minor improvement. Tired of the fact that Jacksonville has a team, yet not Las Vegas, Los Angeles, or Toronto? Move 'em! Online play is functionally unchanged from the last couple of iterations of Madden. You can go head-to-head against only one other player in ranked and unranked matches. The online matches are certainly solid. Lag popped up here and there, and when it did, it had a palpably negative effect on gameplay--specifically, it made completing passes nearly impossible in the worst instances. But the bulk of the matches we played weren't very laggy at all. As always, your mileage online may vary. There are some online bells and whistles, like the ability to glance at ESPN-licensed news videos, audio clips, and stories, but nothing you couldn't easily get faster directly from the ESPN Web site. There's still no league play of any kind, which is extra-sad when you consider that EA's NHL franchise plans to debut this exact feature in just a few short weeks. Other ancillary features include the same basic minigames from last year, such as the 40-yard dash and bench press, the same functional create-a-player mode, and, finally, a create-a-team mode, which had been missing. There's a decent amount of customization available for jerseys, stadiums, and whatnot, though you can't actually customize the roster of a created team with actual players unless you bring that team into franchise mode and do a fantasy draft. By default, the game populates the team with generic players that are rated depending on how you set your team up (run heavy, pass heavy, balanced, and the like). You also can't import a created team into franchise mode without replacing another team, though that's not exactly a new issue. The core graphics engine hasn't evolved much from last year, with maybe a touch more detail in the various player models, and not much else. However, animation is decidedly more impressive than before. Essentially, a gaggle of new branching animations have been thrown into the mix. Receivers who catch the ball on the sidelines will drag their toe while falling out of bounds or carefully angle their steps to stay in bounds. Running backs look decidedly more fluid as they juke and spin past defenders. And on defense, gang tackles are finally on board and look fantastic. Watching as two big defenders wrap up a running back, or two defensive backs simultaneously go high and low on a ball carrier, effectively flipping that poor schmuck head over heels, is quite a sight to behold. There are a few slightly off-looking animations, like the way that every single player on a field goal defense or an onside kick return team will simultaneously stand up and then crouch down into proper position, and a few catches we saw looked a little buggy and off-kilter. But by and large, the animation in this year's Madden is the best it's ever been. One of the big points of contention about this year's Madden has been the difference in performance between the Xbox 360 and PlayStation 3 versions. It was announced some time ago that the 360 version would run at 60 frames a second, versus 30 on the PS3. When you compare the two games side by side, yes, there is a noticeable difference. The PS3 version is certainly choppier and slightly more prone to hitching up in-game than the 360 one. However, simply taken on its own merits, the PS3 version isn't suddenly awful because of this one issue. The choppiness rarely ever distracts you from the gameplay, and for the most part, the 30 frames a second number holds pretty steady. If you have a choice between the two, certainly the 360 version is the preferable one from a visual standpoint, but the PS3 version isn't unplayable by any means. Madden 08's audio is the one area that really feels like it lacks. The on-the-field sound effects are still great, and the soundtrack consists of the usual roster of modern rock and rap acts, combined with the NFL Films music. Commentary, however, is a sticking point. The EA Sports radio announcer who's been around since Madden 06 sounds like he's still spouting the same lines from two years ago, and he still can't seem to get the correct yardage numbers at the end of each play. John Madden still provides voice work for any plays where you choose to ~Ask Madden~ for a suggestion, but this dialogue is also largely recycled, and sometimes incorrect. There are times when he'll go off about running a screen play when the play being suggested is a four wide receiver set with nothing but deep routes, or a quick pass play when the suggestion is a run up the middle. Finally, Marshall Faulk tries to provide a bit of preshow and postgame commentary, talking about the matchup, key players, and the like. The problem is that he's terrible. The commentary is flat, monotone, and completely uninteresting, not to mention that he practically never uses a player's name. New animations are the high points of this year's visual presentation. Sadly enough, ESPN commentators Merril Hodge and Mark Schlereth pop up to do tutorials for some of the minigames, but that's it. You've got actual broadcasters in the game, and they're not even broadcasting. This speaks to a larger issue with Madden, which is that it still hasn't found a way to do broadcast presentation right. The EA Sports radio guy felt like a placeholder when he first debuted, and while he was good, isn't it time to get a real broadcast team? EA has the ESPN license, so there's not much excuse not to get the Monday Night Football crew for games. And why no ESPN integration into the franchise mode? No commentary or week-in-review from Schlereth, Hodge, or the multitude of other NFL experts floating around the network? Heck, even the Super Bowl feels low-rent. There's practically nothing in the game to separate it from any other game during the regular season. Considering it's the biggest sporting event out there, that just strikes as lazy. It's issues like these that hold Madden NFL 08 back from being a truly stellar effort. Make no mistake, this is a great game of football through and through, especially on the field, where the new weapons feature has a fantastic effect on how you play the game. The new additions to the control scheme, the new animation system, and the franchise upgrades also can't be counted out. If anything, Madden 08 seems to represent a tipping point of sorts for the series. You feel like the game is right on the brink of getting back to where it was four or five years ago in terms of stature and innovation. Still, while it might not be quite there yet, Madden NFL 08 offers more than enough quality content to make it worth your while, and features the best football gameplay you'll find on the Xbox 360 and PlayStation 3. Lastly, franchise owners can now maintain their team finances by buying upgrades for their stadiums, gaining sponsorship deals, and even opting to move the whole bloody thing to another town if so inclined. Of course, doing so is a tricky process. You have to find a city interested in a team, and on top of that, the costs of doing so are prohibitive. There's a neat system in place that shows how interested a city is in having you in relation to how much money they'll have to spend in order to do it. You basically have to find ways to cut the city's costs down if you want to move there, and if you submit an offer that isn't up to the city's liking, you lose your chance to move until the following year. Once you do move, you'll build a stadium, edit your squad as you please, and finally have that team in Winnipeg that we're sure you've always dreamed of. The superstar mode is much as it was last year, but considering how good the mode was last year, that's not a bad thing. You still create your player, use your influence on the field to boost up your teammates, talk to your agent, sign contracts, and generally go through the motions to try to get yourself into the Hall of Fame. One neat addition is that you can actually choose players from this year's rookie pool, so if you want to live the life as Calvin Johnson or live in a fantasy world where Jamarcus Russell actually signs a contract with the Raiders and gets to start, you can do so. There has also been a slight alteration made to the camera system in this mode. The camera is now a bit more zoomed out, making it easier for you to actually see the field. Granted, the camera is still pretty tight on your player, so it's only a minor improvement. Tired of the fact that Jacksonville has a team, yet not Las Vegas, Los Angeles, or Toronto? Move 'em! Online play is functionally unchanged from the last couple of iterations of Madden. You can go head-to-head against only one other player in ranked and unranked matches. The online matches are certainly solid. Lag popped up here and there, and when it did, it had a palpably negative effect on gameplay--specifically, it made completing passes nearly impossible in the worst instances. But the bulk of the matches we played weren't very laggy at all. As always, your mileage online may vary. There are some online bells and whistles, like the ability to glance at ESPN-licensed news videos, audio clips, and stories, but nothing you couldn't easily get faster directly from the ESPN Web site. There's still no league play of any kind, which is extra-sad when you consider that EA's NHL franchise plans to debut this exact feature in just a few short weeks. Other ancillary features include the same basic minigames from last year, such as the 40-yard dash and bench press, the same functional create-a-player mode, and, finally, a create-a-team mode, which had been missing. There's a decent amount of customization available for jerseys, stadiums, and whatnot, though you can't actually customize the roster of a created team with actual players unless you bring that team into franchise mode and do a fantasy draft. By default, the game populates the team with generic players that are rated depending on how you set your team up (run heavy, pass heavy, balanced, and the like). You also can't import a created team into franchise mode without replacing another team, though that's not exactly a new issue. The core graphics engine hasn't evolved much from last year, with maybe a touch more detail in the various player models, and not much else. However, animation is decidedly more impressive than before. Essentially, a gaggle of new branching animations have been thrown into the mix. Receivers who catch the ball on the sidelines will drag their toe while falling out of bounds or carefully angle their steps to stay in bounds. Running backs look decidedly more fluid as they juke and spin past defenders. And on defense, gang tackles are finally on board and look fantastic. Watching as two big defenders wrap up a running back, or two defensive backs simultaneously go high and low on a ball carrier, effectively flipping that poor schmuck head over heels, is quite a sight to behold. There are a few slightly off-looking animations, like the way that every single player on a field goal defense or an onside kick return team will simultaneously stand up and then crouch down into proper position, and a few catches we saw looked a little buggy and off-kilter. But by and large, the animation in this year's Madden is the best it's ever been. One of the big points of contention about this year's Madden has been the difference in performance between the Xbox 360 and PlayStation 3 versions. It was announced some time ago that the 360 version would run at 60 frames a second, versus 30 on the PS3. When you compare the two games side by side, yes, there is a noticeable difference. The PS3 version is certainly choppier and slightly more prone to hitching up in-game than the 360 one. However, simply taken on its own merits, the PS3 version isn't suddenly awful because of this one issue. The choppiness rarely ever distracts you from the gameplay, and for the most part, the 30 frames a second number holds pretty steady. If you have a choice between the two, certainly the 360 version is the preferable one from a visual standpoint, but the PS3 version isn't unplayable by any means. Madden 08's audio is the one area that really feels like it lacks. The on-the-field sound effects are still great, and the soundtrack consists of the usual roster of modern rock and rap acts, combined with the NFL Films music. Commentary, however, is a sticking point. The EA Sports radio announcer who's been around since Madden 06 sounds like he's still spouting the same lines from two years ago, and he still can't seem to get the correct yardage numbers at the end of each play. John Madden still provides voice work for any plays where you choose to ~Ask Madden~ for a suggestion, but this dialogue is also largely recycled, and sometimes incorrect. There are times when he'll go off about running a screen play when the play being suggested is a four wide receiver set with nothing but deep routes, or a quick pass play when the suggestion is a run up the middle. Finally, Marshall Faulk tries to provide a bit of preshow and postgame commentary, talking about the matchup, key players, and the like. The problem is that he's terrible. The commentary is flat, monotone, and completely uninteresting, not to mention that he practically never uses a player's name. New animations are the high points of this year's visual presentation. Sadly enough, ESPN commentators Merril Hodge and Mark Schlereth pop up to do tutorials for some of the minigames, but that's it. You've got actual broadcasters in the game, and they're not even broadcasting. This speaks to a larger issue with Madden, which is that it still hasn't found a way to do broadcast presentation right. The EA Sports radio guy felt like a placeholder when he first debuted, and while he was good, isn't it time to get a real broadcast team? EA has the ESPN license, so there's not much excuse not to get the Monday Night Football crew for games. And why no ESPN integration into the franchise mode? No commentary or week-in-review from Schlereth, Hodge, or the multitude of other NFL experts floating around the network? Heck, even the Super Bowl feels low-rent. There's practically nothing in the game to separate it from any other game during the regular season. Considering it's the biggest sporting event out there, that just strikes as lazy. It's issues like these that hold Madden NFL 08 back from being a truly stellar effort. Make no mistake, this is a great game of football through and through, especially on the field, where the new weapons feature has a fantastic effect on how you play the game. The new additions to the control scheme, the new animation system, and the franchise upgrades also can't be counted out. If anything, Madden 08 seems to represent a tipping point of sorts for the series. You feel like the game is right on the brink of getting back to where it was four or five years ago in terms of stature and innovation. Still, while it might not be quite there yet, Madden NFL 08 offers more than enough quality content to make it worth your while, and features the best football gameplay you'll find on the Xbox 360 and PlayStation 3."}