{"ref": "https://www.gamespot.com/reviews/madden-nfl-08-review/1900-6176962/", "date": "August 20, 2007", "game_name": "Madden NFL 08", "text": "It's probably not really a surprise to anyone that Madden on the PlayStation 2, Xbox, and GameCube this year would essentially be on autopilot. The life spans for these consoles are rapidly coming to a close, and the likelihood is that most players have probably already pushed forward onto the Xbox 360, Wii, and PlayStation 3 by now. For those who haven't, you're not going to be completely left out in the cold. In fact, it's actually a little surprising that EA chose to add as much as it did to this year's game. Granted, some of the additions are kind of stupid, and only a few of the gameplay upgrades really qualify as useful, but for those who just want a new Madden game and can't buy it on current-generation hardware, that might be just enough to make it worth your while. Yes, EA is still making Madden on the PS2, Xbox, and GameCube. No, you shouldn't care, unless those are the only systems you own. The big addition in every iteration of this year's Madden is the new ~weapons~ system. This system is basically designed to provide differentiation between specific types of star players. Due to specific icons for each type of player, you can now see the difference between a possession receiver and a big-play receiver, an accurate quarterback and a strong-armed quarterback, a shutdown cornerback and a press-coverage cornerback...you get the idea. On the Xbox 360 and PlayStation 3, this system was fantastic because you could really see the differences in play between the various types of weapons, and the game itself became about finding mismatches you could exploit on both sides of the ball. Not so much for older console versions. There are certainly some base-level distinctions to be made, but for the most part, players play exactly the way they always have in a game of Madden. There aren't those subtle differences in play styles. Sure, you know the difference between a power running back and a speedy running back, but those have always been obvious differences. Beyond being able to spot who on the field is good and who is not so good, and periodically being able to fix a mismatch you might not have otherwise noticed, it doesn't feel like there's much value to the system on these versions. Some of the new control upgrades from the PS3 and 360 versions of Madden have made it into these versions as well. Most of these updates are on the defensive side of the ball. You can now focus coverage on a specific receiver with a quick button press while zoomed out, though doing so will draw defensive resources away from other receivers. When laying in big hits via the right analog stick, you can hit a player high by pressing up, or low by pressing down. Doing this has different effects on different types of players. Hitting high might cause a less cautious ball carrier to cough up the rock, while going low on a power back is probably the best way to take him down as he pushes past the line. There's also a button that will make your controlled defender attempt to strip the ball from a carrier, provided you time the button press correctly. Fortunately, unlike on the 360 and PS3, the number of fumbles you'll see throughout a game aren't over the top. Beyond these updates, Madden 08 plays a lot like Madden 07 did. Hardly an awful thing by any stretch, but those hoping for something significant or game-changing in these versions of the game won't get it. Likewise, any holdover bugs or issues from previous iterations are pretty much still here, like vibrating blockers, defenders and receivers getting wrapped up in a tango entirely free of pass-interference calls, and all the usual stuff like that. Ultimately, the biggest changes to the game come in the form of some really goofy mode additions. The first one, titled skill drills, is essentially a series of training minigames against gigantic football dummies. Think minicamp, but with robots. There are four categories to these drills: passing, rushing, defense, and presnap. Rushing has you running from end to end while pulling off specific jukes, spins, and cuts against defenders. Passing has you trying to complete as many passes as you can against the robot dummies in coverage. Defense is like the rushing attack, but with specific types of tackles and defensive hits. Finally, presnap controls having you cycling through various hot routes, audibles, and formation shifts under a time limit. The theory behind this mode seems to be to teach players how to use all the various control mechanics, and for some, it works. It definitely teaches you a thing or two about how to time hits and running-back moves, though for the presnap controls, it's basically worthless. There's zero insight into why you would make any of the changes you're making; you're just making them over and over again mindlessly. There's also something exceedingly silly about the whole giant dummy thing. Why can't you just do these against regular opposing players? Why does it have to be a big robot? The other new option, fantasy challenge, is a much more interesting addition, though also a bit ridiculous in its own right. Fantasy challenge tasks you with building the team of your dreams, sans the constraints of real contracts, depth charts, injuries, and other such humdrum aspects of the real NFL. Your dream team can be composed of any number of different elements. It can be an existing NFL roster, a fantasy draft of all NFL players, or a fantasy draft of all NFL players as well as a gaggle of Hall of Fame players. Whatever you choose, the only thing you have to pay attention to is a salary cap based on roster points. Roster point values are assigned to each player based on his performance rating, and you have a limit of 730 roster points at the outset. If you're drafting the team to end all teams, you'll have to balance it out a bit toward the back end, or you'll run out of points. You can certainly put Tom Brady, LaDainian Tomlinson, and Torry Holt on one squad--you just might have to skimp a bit when picking kickers. Once your team is set, you're whisked off to a league that bears more resemblance to the fake, multitiered league of Blitz: The League than anything NFL-related. You start out on the bottom rung of a four-tier league, and play a series of games against the other scrub teams until you can claim that tier's championship. You move from tier to tier until you get to the top rung, playing against the Hall of Famers and fake teams with insane and rather dumb magical abilities. All the while, you'll be faced with constant roster-move decisions, whether you want to deal with them or not. After each game, you're awarded more roster points, which you can use to try to trade for other, better players, or simply parlay into improving your current roster's ratings. Of course, the artificial intelligence's teams can do the same thing, and they constantly do. Basically, you're better off just holding on to as many points as you can after each game to deal with the onslaught of trade and buyout offers from other teams. If you end up in a situation where you're lacking points and can't match another team's offer, all you get is their worst player in return and some freed-up salary-cap space. Yay. That irritation aside, the fantasy challenge actually can be kind of an addictive mode. Building up your team is cool, and the streamlined presentation makes it a lot easier to manage than the standard franchise mode. It's not quite worth the price of admission all on its own, but it's a neat addition all the same. As for the mainstay Madden modes, the franchise, online, and superstar modes are tweaked at best, and unaltered at worst. Franchise mode has seen some menu-system adjustments but actually removes some features, such as the Tony Bruno radio show as well as newspaper headlines. Then again, considering that stuff costs money to license, and this year's game seems to be pretty much frills-free, that would make some measure of sense. Superstar mode ditches the ~randomization of your parents~ feature when creating your own player, and it lets you select from any of the available rookies from this year's draft class. It also adds in all the role-playing stuff from the 360 and PS3 versions, minus the improvements to the camera system. Online modes are all but unchanged: head-to-head matches against other players, and that's it. At least the game performs reasonably well on the Xbox and PS2. Lag popped up now and again, but nothing game-breaking. As always, the GameCube version is devoid of online play. The fantasy challenge is like some kind of football team building role-playing game, or something. Too bad it's got too many random encounters and John Madden never joins your party. The sameness from last year's game extends to the presentation as well. The graphics engine has seen little adjustment, save for some new gang-tackling animations that are actually pretty good. Players still have that squat, mutated look that they've had for a good, long while now, and nobody looks anything like their real-life counterparts. The frame rate does at least manage to hold steady for the most part, though the play-calling menus and other, similar areas of the game tend to hitch up for a moment or two when loading. Predictably, the Xbox version looks the best among the three older console versions, with the PS2 version looking second best, and the GameCube version just looking kind of blurry. Commentary consists of the same rehashed dialogue from Al Michaels and John Madden yet again, so if you were hoping for something new, or even for them to mention a few new players' last names, forget about it. Again, it's no surprise that the older consoles would get something of the shaft when it came to development priority on this year's Madden. And save for holdover issues and a few missing features, this is still a good football game through and through. The new control additions are certainly worthwhile (even if the weapons system mostly isn't), and fantasy challenge is a unique and enjoyable new way to build and play a team of your own design. You're certainly served best by picking up one of the versions of Madden released for the current console hardware, but if that's not an option, then this game isn't a bad way to go."}