{"ref": "https://www.gamespot.com/reviews/everquest-gates-of-discord-review/1900-6092187/", "date": "March 24, 2004", "game_name": "EverQuest", "text": "Since Sony Online's venerable online role-playing game EverQuest launched five years ago, it's been updated countless times, most notably by what's now a grand total of seven different expansion packs (six of them retail products and one only available for paid download). Most recently, these add-ons have been hitting at the rather rapid-fire pace of one every six months. The latest is Gates of Discord, which features 20 new adventure zones, the new berserker character class, dozens of new alternative advancement skills for high-level characters, and more. This expansion, like most EverQuest content additions of the past several years, is geared squarely toward very experienced players (who report that the new zones in Gates are some of the most challenging yet and reveal that the encounters therein are some of the most demanding, in terms of careful teamwork among well-balanced player groups). And while hardcore players have naturally purchased this expansion already, its value to more-casual (let alone new) EverQuest players is very limited. Gates of Discord is the seventh EverQuest expansion pack, and it features some of the most dangerous new adventure zones yet. The appeal to new players lies solely in the fact that Gates of Discord features the first new EverQuest character class since the late 2001 Shadows of Luclin expansion added the beastlord. However, the new berserker really isn't that enticing. Many EverQuest players argue that even Luclin's beastlord has yet to fit in snuggly with the more-than-a-dozen original character classes, and the addition of yet another class hasn't really energized the game either. The new berserkers aren't full-on tanks, like warriors, mostly because they're limited to chain armor, but they start out with pretty good melee combat skills and the ability to summon throwing axes. They'll ostensibly fill a supporting combat role, kind of like EverQuest's rangers. Still, considering that the world of EverQuest has been designed primarily so that warriors (who soak up damage), clerics (who heal said damage), and enchanters (whose crowd-control magic keeps things manageable) can always be in high demand among player groups, the berserker class doesn't really distinguish itself. Besides, players who opt to play as a berserker will be shut out of Gates of Discord's other content for a long, long time until they reach a sufficiently high level. Also, the fact that you can play as a barbarian berserker seems a little redundant, doesn't it? For what it's worth, the designers of EverQuest have made some efforts in these past couple of years to make the game more accessible to new players than it used to be. However, if anything, they've gone a little overboard. The new EverQuest player, upon entering the game for the first time after creating his or her character, is bombarded with multiple, simultaneous help pop-up windows, as though he or she just triggered a self-destruct sequence. These are certainly informative but aren't user-friendly either--and the game's interface is still cluttered with nonintuitive little icons. The game engine itself, which was overhauled in the Shadows of Luclin expansion pack, still runs sluggishly, even on high-end systems. This is especially true of areas where many players congregate, such as in the Luclin bazaar or in some of the new wayfarer camps that were introduced in the previous expansion, Lost Dungeons of Norrath. EverQuest is holding steady with more than 400,000 subscribers, but given that there's a lot of churn as players come and go, it's unfortunate that the game is still catering to those who already know how to play it. And Gates of Discord is no exception. The EverQuest elite will discover that, among Gates of Discord's 20 new zones comprising the newly discovered continent of Taelosia, 10 are standard, and 10 are ~instanced~ zones like those of Lost Dungeons of Norrath; such zones are not randomly generated but guarantee groups of players a fresh challenge whenever they get into one of these. The structure of the expansion's zones is pretty hardcore. You arrive on Taelosia in a port city in a zone called the Abysmal Sea, which is a safe haven and a hub for plying various trade skills. From here, you can venture toward a wayfarers camp to get to the instanced zones, or you can plunge into Taelosia through numerous, dangerous zones. If you're a hardcore EQ addict, then you already have Gates of Discord. If you're not, then you don't need it. Gates of Discord also introduces a new tribute system, which is a thinly veiled means by which the designers can slow the inflation of EverQuest's economy, by inviting players to part with their old items at their characters' home cities in exchange for some temporary bonuses to their characters' stats or abilities. Since the tribute system is a hypothetical solution to an in-game issue that affects players regardless of whether they have the Gates of Discord expansion, it's a little odd that it's being touted as part of this add-on. There's also a new leadership experience system, by means of which leaders of groups or raids can direct a percentage of their experience points to go into a special pool that grants these leaders some useful, new abilities. Some of these new leadership abilities are certainly valuable to the most experienced guild members of EverQuest, and they create yet another reward system so that they can continue fighting for experience points and not just more loot. The expansion also features a reported 20 new character models for the various new foes of Taelosia, new alternate advancement skills to allow high-level characters to further differentiate themselves in battle with little perks, and new weapons, items, trade skill recipes, and spells. With the purchase of this $30 expansion, you also get an in-game item--a special staff--and the retail package includes a neat, little trinket representing this staff. But this is hardly necessary, and neither is the presence of Gates of Discord on store shelves. Hardcore EverQuest players would probably find it more convenient to download an expansion pack such as this. And everyone else who isn't already deeply enthralled by Sony Online's addictive game need not bother."}