{"ref": "https://www.gamespot.com/reviews/tiger-woods-pga-tour-06-review/1900-6134796/", "date": "May 17, 2006", "game_name": "Tiger Woods PGA Tour 06", "text": "Now this is more like it. Tiger Woods PGA Tour 06 on consoles proved to be an enjoyable golf game, though one that (as in previous years) considerably lacked in challenge. Luckily for the fickle computer-golfing crowd, this is not the case in the PC version of Tiger 06, a game that finds an excellent blend between compelling gameplay, consistent challenge, and enough reward to always keep you engaged. Only in golf can someone look this silly and still have massive game. If you've played Tiger 06 on the Xbox, PlayStation 2, or GameCube this year, you'll already be familiar with many of the features found in the PC game. Rivals mode, PGA Tour mode, and the game face system are all here to be played with to your heart's content. The great news is that each one of these features has been specifically tailored to suit the power and flexibility of the PC environment, and the result is more fun across the board. Take the PGA Tour mode, for example. In the console version, this mode basically consisted of you taking your created golfer through weekly and/or monthly events, playing through multiple courses, and taking on all the PGA Tour pros found in the game. In the PC game, you'll still end up on the PGA Tour, but just as in real life, you'll need to earn your stripes first. Instead of starting out as an already-successful pro, you can take your created golfer and begin as a rank amateur to hook up with your buddies on the weekends to play matches and test your skills on your home course. Match types include your standard match and stroke play, along with more-involved games, such as alternate shot and four-ball varieties. The challenge from your virtual buddies isn't much to worry about, as you'll mostly want to spend your time just getting your stuff together for when you eventually win the hacker tournament and move up to the amateurs, where the competition is considerably stiffer. Accompanying you as you make your way through this mode are a number of explicitly stated goals you'll need to keep up with for each tour you play on. These include such goals as playing a minimum number of events, achieving a certain average score on all rounds, and winning certain tourneys. Beyond that, you're welcome to join in as many events as you like (provided you've got enough cash to pay the entrance fee). The progression up from the ranks of weekend hacker, through the amateurs, and eventually to the highest echelon in the sport--the PGA Tour--feels like a natural evolution that's paralleled nicely with how your created golfer evolves in the game. Once you've fashioned your duffer alter ego using this year's version of the powerful and fun game face tools, it's time to hit the links. Even if you're familiar with the Tiger controls, however, you'll have a long way to go before your golfer can play with the big boys. For one thing, you're pretty much a weakling, so it's tough to hit a drive more than 200 yards in the beginning. Furthermore, specialized shot modifiers, such as ~blasts~ out of sand traps, bump-and-run or pitch chips, and spin modifiers need to be learned before being incorporated into your game. Just like last year, you can take a number of lessons in specialized shots, which, when completed, will add these controls to your shot arsenal. We love this player evolution feature, both in concept and execution. As a beginning golfer, it makes sense that you would have to earn these kinds of shots through practice and lessons. Of course, experienced Tiger fans may feel at odds with having to go through this kind of rigmarole just to get your game up to speed. Nonetheless, if you can get into the spirit of the concept, it makes each victory you achieve in the game that much more satisfying. Rivals mode, a different spin on the legends mode found in last year's Tiger game, is a centerpiece in Tiger 06, both on the consoles and the PC. And while the basic concept of the mode is the same on both platforms--you take your created golfer through golf's greatest eras, answering challenges that come from unknowns and PGA legends alike--once again the execution is substantially different on the PC. Unlike the console games--which set skills challenges apart from one-on-one matchups (the latter being the only way to progress to a different era)--Tiger 06 on the PC melds everything together in a more organic fashion. Your stately headquarters in rivals mode will change as you progress through the eras. All the challenges that come your way, which are posted on the corkboard of your nicely furnished headquarters (complete with era-specific fixtures), progress you through the game in one fashion or another, whether by increasing your overall rank (which can happen if you win a difficult challenge) or by simply awarding you experience points that you can tack on to your golfer's attributes. That said, just as in the console game, you still end up facing boss battles against golf icons such as Old Tom Morris and Arnold Palmer. However, this time, these legends aren't as apt to three-putt holes and drive off the tee like elderly women. In fact, most of the ~human~ competition you'll find in the game tends to be adept on the links, and when you couple that with the uphill player progression and the challenge inherent to the courses, you have a game that consistently keeps you engaged by always forcing you to hone your game so you can shave off a few strokes. Part of that engaging gameplay comes in the form of the huge variety of controls Tiger 06 offers on the PC. Players weaned on the Links series will appreciate the two- and three-click-swing methods that are still part of the package, while those who want more of a tactile feel in their computer golf will like the two varieties of true-swing control (horizontal and vertical)--a system that uses your mouse as the virtual club face and the path of your mouse as the virtual swing. Even the console crowd, which is used to using Xbox and/or PS2 controllers, will feel mostly at home on the PC version of Tiger 06, as the game supports the use of Logitech gamepads. Unlike the consoles, however, you won't find a right analog ~shape stick~ when playing with the gamepad. Think you've got what it takes to challenge golf's greatest? Find out in rivals mode. This amount of flexibility and control really sets the PC game apart, as not only can you play Tiger 06 in a number of different ways, but also there are some handy assists to help your game improve as time goes on. An example is the true-swing analyzer, which examines each swing you make with the mouse (including your putts) to give you valuable feedback, including club path, speed, tempo, and impact. As in real life, the vagaries of a golf swing are often simply a matter of inches--and that's no less true here. All this flexibility thankfully doesn't come to the game at the cost of difficulty, because there's challenge to be found here even at the novice level. As your golfer advances, though, you'll want to step up your game through the difficulty levels until you finally reach expert level, where all assists are off, including the putting green grid, the caddy that automatically suggests your club, and club distance reminders for the sticks in your bag. Expert level is as close to real golf as can be found in the game, and it will likely be the ultimate destination for those select few who enjoy the more masochistic side of the sport. Foursome play is the cornerstone of Tiger 06's online feature set, but unfortunately, to get there you have to navigate the same kind of jumbled online menus found in the Madden PC series, complete with the annoying ESPN license agreement that marks the sports broadcasting network's only appearance in this year's game. Beyond that little bit of ugliness, though, online play in Tiger 06 is a lot of fun. With match types aplenty--stroke, match, stableford, and so on--plus the ability to create matches with loads of options, such as side games, variable course conditions, and swing-control types, there's enough to do to keep you very busy over the Internet or with your closet office mates via LAN play. Some match types take longer than others--scramble comes immediately to mind, especially when playing with nervous Nellies--but the ready-play option lets you whip through individual holes with up to three other players simultaneously. If Tiger 06 doesn't enjoy a huge visual boost from Tiger 2005, it's only because last year's game was so handsome to begin with. With graphical details boosted (assuming your PC can handle the load), this is one fine-looking game, especially the course environments. Once again, the finely tuned graphical details that golfing fans expect are well intact here, so you'll see everything from windswept grass when battling out of the high rough, to convincing water effects and elegant lighting that create a sense of ~place~ to the game. This convincing effect is evident all the way down to the weather in the game. So, for instance, tee off on a dull, gray morning at Pebble Beach in the game, and just try to feel optimistic about your chances for the round. These gorgeous graphics do come at something of a price, however. Even when playing on our powerful gaming rig, we noticed periodic frame hiccups, some so severe as to mess up the timing of our shots. Some odd swing animations--such as a golfer's hind leg being stuck at an odd angle--sneak in periodically as well, but for the most part, if you've got the PC horsepower, it will be put to good graphical use in Tiger 06. For those lacking in the spec department, well, your mileage may vary. Just as in real golf, there's plenty of equipment to buy in Tiger 06. Unlike in real golf, however, these clubs will probably help you improve your game. Highlights on the sound front include the commentary of David Feherty and David McCord, but then again, this is nothing new for Tiger fans, who have come to be used to the witty repartee and easy accord between the two commentators. McCord's comments on the green layouts are especially useful when playing with the putting grid turned off, as he's apt to give you important break information if you listen closely. Other sounds are just as serviceable as those found in the console games, though it would have been nice to hear that magical and musical ~ping~ sound off the tee a bit more often. If you have last year's version of Tiger and are wondering if this year's game is worth it, the answer is yes. With plenty of control options, new courses, and compelling play both off- and online, Tiger 06 challenges you to build your golf game up from the ground floor. If your choice is between the PC and console versions of Tiger 06, there's simply no choice. You must go with the PC game, which tempers the user-friendly learning curve of the console versions with enough long-term challenge to keep you hacking well into the future. Part of that engaging gameplay comes in the form of the huge variety of controls Tiger 06 offers on the PC. Players weaned on the Links series will appreciate the two- and three-click-swing methods that are still part of the package, while those who want more of a tactile feel in their computer golf will like the two varieties of true-swing control (horizontal and vertical)--a system that uses your mouse as the virtual club face and the path of your mouse as the virtual swing. Even the console crowd, which is used to using Xbox and/or PS2 controllers, will feel mostly at home on the PC version of Tiger 06, as the game supports the use of Logitech gamepads. Unlike the consoles, however, you won't find a right analog ~shape stick~ when playing with the gamepad. Think you've got what it takes to challenge golf's greatest? Find out in rivals mode. This amount of flexibility and control really sets the PC game apart, as not only can you play Tiger 06 in a number of different ways, but also there are some handy assists to help your game improve as time goes on. An example is the true-swing analyzer, which examines each swing you make with the mouse (including your putts) to give you valuable feedback, including club path, speed, tempo, and impact. As in real life, the vagaries of a golf swing are often simply a matter of inches--and that's no less true here. All this flexibility thankfully doesn't come to the game at the cost of difficulty, because there's challenge to be found here even at the novice level. As your golfer advances, though, you'll want to step up your game through the difficulty levels until you finally reach expert level, where all assists are off, including the putting green grid, the caddy that automatically suggests your club, and club distance reminders for the sticks in your bag. Expert level is as close to real golf as can be found in the game, and it will likely be the ultimate destination for those select few who enjoy the more masochistic side of the sport. Foursome play is the cornerstone of Tiger 06's online feature set, but unfortunately, to get there you have to navigate the same kind of jumbled online menus found in the Madden PC series, complete with the annoying ESPN license agreement that marks the sports broadcasting network's only appearance in this year's game. Beyond that little bit of ugliness, though, online play in Tiger 06 is a lot of fun. With match types aplenty--stroke, match, stableford, and so on--plus the ability to create matches with loads of options, such as side games, variable course conditions, and swing-control types, there's enough to do to keep you very busy over the Internet or with your closet office mates via LAN play. Some match types take longer than others--scramble comes immediately to mind, especially when playing with nervous Nellies--but the ready-play option lets you whip through individual holes with up to three other players simultaneously. If Tiger 06 doesn't enjoy a huge visual boost from Tiger 2005, it's only because last year's game was so handsome to begin with. With graphical details boosted (assuming your PC can handle the load), this is one fine-looking game, especially the course environments. Once again, the finely tuned graphical details that golfing fans expect are well intact here, so you'll see everything from windswept grass when battling out of the high rough, to convincing water effects and elegant lighting that create a sense of ~place~ to the game. This convincing effect is evident all the way down to the weather in the game. So, for instance, tee off on a dull, gray morning at Pebble Beach in the game, and just try to feel optimistic about your chances for the round. These gorgeous graphics do come at something of a price, however. Even when playing on our powerful gaming rig, we noticed periodic frame hiccups, some so severe as to mess up the timing of our shots. Some odd swing animations--such as a golfer's hind leg being stuck at an odd angle--sneak in periodically as well, but for the most part, if you've got the PC horsepower, it will be put to good graphical use in Tiger 06. For those lacking in the spec department, well, your mileage may vary. Just as in real golf, there's plenty of equipment to buy in Tiger 06. Unlike in real golf, however, these clubs will probably help you improve your game. Highlights on the sound front include the commentary of David Feherty and David McCord, but then again, this is nothing new for Tiger fans, who have come to be used to the witty repartee and easy accord between the two commentators. McCord's comments on the green layouts are especially useful when playing with the putting grid turned off, as he's apt to give you important break information if you listen closely. Other sounds are just as serviceable as those found in the console games, though it would have been nice to hear that magical and musical ~ping~ sound off the tee a bit more often. If you have last year's version of Tiger and are wondering if this year's game is worth it, the answer is yes. With plenty of control options, new courses, and compelling play both off- and online, Tiger 06 challenges you to build your golf game up from the ground floor. If your choice is between the PC and console versions of Tiger 06, there's simply no choice. You must go with the PC game, which tempers the user-friendly learning curve of the console versions with enough long-term challenge to keep you hacking well into the future."}