{"ref": "https://www.gamespot.com/reviews/yohoho-puzzle-pirates-review/1900-6124427/", "date": "June 3, 2005", "game_name": "Puzzle Pirates", "text": "Massively multiplayer online puzzle game. Those are the only possible terms you can use to properly describe Yohoho! Puzzle Pirates, one of the weirdest and most original puzzle games we've come across in quite a while. The game's been around for a fairly long time, but it's just now making its way to retail shelves. Imagine a persistent online world where people's little avatars--essentially Lego people in pirate regalia--sail the open seas, sword fight with one another, swab the decks, and even get in a few friendly parlor games, all through the magic of simple puzzles derived from some of the best concepts out there, like Tetris and Bejeweled. Now throw in a cutesy art style and a community chock-full of crazy people who want to talk like pirates, and you've got a pretty entertaining experience all around. Of course, the game isn't without its problems, but for big-time puzzle fans who like the idea of competitive and cooperative puzzling online, Puzzle Pirates may be just what you're looking for. Finally, an MMO that speaks to the puzzle-crazy pirate in all of us. The world of Puzzle Pirates is what you'd expect from a pirate-themed game. Clipper ships and war brigs sail the seas, crewed by all manner of scalawags and sailors. Islands populate the landscape, inhabited by numerous seafaring folk. Like most any MMO, the populace of Puzzle Pirates has to earn its keep by performing assorted labor tasks, like being part of the crew on a ship or taking on assorted tasks for businesses while on land. However, you don't run around killing monsters or collecting rare items like you would in most any MMORPG. Instead, you perform your work via puzzles, and each one is uniquely tailored to the task you're charged with. For instance, when on land, you can opt to take a job with an apothecary, a distiller, or a shipwright, among others. If you choose the apothecary, you'll see several orders for potions and concoctions that have been placed by actual players in the community. The puzzle itself revolves around rotating a number of pipes leading from colored jars at the top of the screen to a position where they'll pour out into color-coded vials at the bottom. You can create combos to up your rank, but if you screw up, you'll break your jar. Even though you can just play the puzzle as it is without even worrying about the available orders, you'll earn more money and a higher rank by filling the orders. Every task is just like this, featuring a unique type of puzzle that fits the type of work you're doing, and essentially providing you with a way to perpetuate the economy. You earn money for your work; you help a local business fill its orders; and you help other players get the items they want. A hell of a system, if we do say so ourselves. The real fun begins when you get aboard a ship. You'll first start checking out the bulletin boards around the town that you're in, and you'll see a number of crews looking for help on pillaging missions. These positions start out as temp jobs, but if you work hard enough, you can receive an offer from an officer of the crew to join on full time. Every crew is made up of different types of players, so it's usually a good idea to figure out what a few different crews have to offer before joining one. Like on land, seafaring tasks are made up of various puzzles. Everybody on the ship contributes in one way or another, from working the bilge to navigating the ship. Of course, the whole reason you're out on the water to begin with is to plunder other ships for their booty. You'll run into a lot of other ships while at sea, and when you do, you can attack them, or be attacked. If you do enter into a battle sequence, you'll see the map change to a view of your two ships on a playing field. All members of the crew have to maintain their duties during these battles, and specific players will have to navigate the ship around obstacles while others fire the cannons and try to damage opposing ships. Once one ship has been weakened enough, the other ship can grapple its opponent and attack the crew in a massive sword battle. A sword battle in Puzzle Pirates takes place in a puzzle that looks and operates an awful lot like Super Puzzle Fighter. Colored blocks drop from the top of the window, and by moving these blocks into groups you can create a solid connection of blocks. Sword icons will periodically drop down as well, and you'll need to match them up with colored blocks that correspond with their own color. Doing so will break a block, and each time you do this it will unleash a number of solid, uncolored blocks on your opponent. If you break one of the solidified blocks, it sends a big, honking sword down on your opponent's playing field. There's even more strategy to these big sword brawls, because you can select which opposing player you want to target, and then you and your crewmates can team up on them. There's a lot of strategy here for what is, in essence, a pretty simple puzzle, but that can be said about pretty much all of the puzzles in the game. Though you couldn't exactly call any of the puzzles in Puzzle Pirates difficult, none of them are short on fun. Essentially, pretty much every puzzle concept is taken from one popular puzzle or another. For instance, the bilging puzzle is basically just a differently skinned version of Bejeweled, whereas the carpentry puzzle works like a slightly different version of Tetris, requiring you to place uniquely shaped planks of wood into holes in the hull and eventually repair them. And then, of course, there's the already noted Super Puzzle Fighter-inspired sword-fighting game. The best part about the puzzles, however, is that each and every one has a ranking system, so you'll continue to play and improve your overall ranking on your archipelago and even throughout the world. That's more than enough inspiration to keep playing. Of course, you probably wouldn't even bother with any of this if there weren't any worthwhile things to buy with all this money you're earning. While there are certainly plenty of little things to buy to customize your pirate, like clothing, weapons and what have you, the real reason you should save up your salary is to buy your own ship or your own business. Buying your own ship is pretty much what it sounds like. You're awarded the deed to one of several types of ships, ranging from sloops to war brigs, and then you're the one in charge of that boat. Creating a business essentially opens up a stall within an allotted business area. So, if you create a shipwright business, your stall will go next to the other shipwright businesses on that archipelago. Running your own ship or business can be quite a bit of fun, and hey, you're helping the economy! No online game can survive without a solid and enthusiastic community. In the case of Puzzle Pirates, enthusiasm is one thing this community has no shortage of. After spending quite a bit of time playing, we've come to the conclusion that everyone playing Puzzle Pirates is completely insane, but in a totally endearing way. Essentially, people really seem to get into the whole pirate mentality here. When you first board a ship, it's not uncustomary to have a lot of people type things like ~Arrrr!~ and ~Ahoy! Get to yer station, mate!~ There sure is a lot of role-playing going on here, even though it's not an RPG. If that freaks you out, then maybe this isn't the game for you. But, if you can get into the whole pirate thing (or at least get past it), then you'll find the community of Puzzle Pirates to be quite an entertaining and often helpful bunch. From a technical standpoint, Yohoho! Puzzle Pirates is just about the easiest thing in the world to boot up and play. The game starts up instantly and quits out just as easily. It runs on basically any machine, from a high-end PC to a Mac to even a Linux box. Granted, this is because this is just a Java client that doesn't take up more than a hundred megabytes on your hard drive. Make no mistake; Puzzle Pirates isn't bad looking at all. The puzzles all have a nice look to them, and you'll see an appreciably precious art style while you're wandering around a ship or island. Because of the game's visual limitations, you won't find anything especially impressive. However, the visuals are just fine for what they need to be here. There really isn't much audio either. You'll get some occasional pirate chatter and a few little sea chanteys playing in the background, but that's really it. Though you'd hardly expect a whole lot of audio from a game like this, even what's here isn't really all that great. Were it not for the postpurchase fees, Puzzle Pirates would be the easiest game in the world to recommend. And even with the fees, it's still a pretty easy recommendation. The one and only major thing that might prevent you from picking up Puzzle Pirates is its overly prohibitive price tag. The game itself is only $20, and even though the first month is free, you'll be paying either monthly or yearly fees after that. The monthly fee is $9.95, and the yearly fee is $74.95. While that isn't excessively expensive for an MMO, it is quite expensive for something that feels more like a fun distraction rather than the kind of thing you'd want to sink every waking moment of your life into. The game itself features no shortage of content to keep you playing time and time again, but it's debatable whether that content is really worth the kind of money it's asking for. If you have the disposable income to drop on a game like this, then there's no doubt that you should at least give it a try for the first free month. As puzzle games go, Puzzle Pirates is a winner, and it's not just because of how good its puzzles are by themselves, but also because of how it ties all of its puzzles into the larger gameworld, creating a completely self-perpetuating economy and community purely out of puzzling. It's a bizarre concept that's done very well. And even if you don't want to shell out money on a monthly or yearly basis, the $20 price tag is more than worth it for that first free month."}