{"ref": "https://www.gamespot.com/reviews/trash-panic-review/1900-6210048/", "date": "May 20, 2009", "game_name": "Trash Panic", "text": "You have to treat garbage with the utmost respect in Trash Panic. This unique puzzle game will throw plenty of detritus at you, and you'll have to carefully consider each piece to gauge what effect it will have on your trash can's compactness as you try to cram as much junk in there as humanly possible. You'll feel a real sense of achievement as you clear seemingly insurmountable amounts of garbage, although this reward will come only with patience, skill, and careful planning. This makes the game's occasional level-wrecking physics quirks even more galling when they happen, and will probably cause some players to abandon the game out of sheer frustration. But those who stick with Trash Panic will find it a challenging and addictive experience, and though it doesn't have the long-term appeal of the giants in the puzzle genre, it still ranks as one of the better mind-benders available on the PlayStation Network. Tetris may be the most oft-compared game to Trash Panic, but the similarities begin and end at the two games' rectangular play fields. There are no lines to clear or gems to match here; instead, you're given a set amount of garbage, and it's up to you to fit all of the steadily falling junk into a trash can. Most of the time, you'll do this by breaking and compacting garbage, with each piece having its own unique physical properties. For example, if you smash a light bulb, it will easily break into pieces, but harder items such as computers, rocks, and even entire mountains will take several hits from other tough objects before they crack. Other items such as mattresses, erasers, and clouds don't break at all and will have to be carefully managed to take up the least amount of space. If three objects fall out of your can, it's game over. The sheer variety of junk that you'll come across in Trash Panic is impressive, with the items getting larger in every level of the game. By the time you reach the secret sixth stage, your garbage can literally covers most of the northern hemisphere of the globe. You'll start off with common office and household items such as pens, lighters, and ovens; move up to larger items such as cars and barrels; and eventually tackle behemoths such as buildings, entire dams, giant squids, and even orbiting space stations. Occasionally, firelit objects, explosives, or special decomposition balls will appear, letting you more quickly dispose of broken trash. These are--for the most part--rare occurrences, and you'll need to plan for them to maximize their destructive capabilities. For example, decomposition balls need plenty of water to operate, so you'll need to make sure you break enough water-bearing objects by the time the ball arrives, as well as have a clear path for the ball to reach water. Fire is also extremely useful, but you'll need accelerants such as flammable objects or even oil to make sure that the fire spreads and destroys as much as possible. When you do get a fire going, holding down the L2 button on the controller will close your trash can's lid, allowing the heat to rise and the fire to spread (although closing the lid for too long will deprive the can of oxygen and consequently douse any bonfires that you may have lit). The rest of Trash Panic's controls are similarly simple. As garbage falls into your can, you can position it left or right, rotate it with the X or circle button, and press the triangle to cause it to slam down hard. If your garbage pile is filled with gaps, a quick waggle of the controller will shake the trash, hopefully closing up any pesky holes. Your garbage can won't always look this neat. Although the controls are simple, you'll have to come up with some pretty complex strategies to get past Trash Panic's levels, and the game is at its most compelling here. Dropping in items without forethought will simply not do; you'll need to have an object-by-object plan to succeed. In fact, in the game's later stages, one misplaced object or unbroken piece of trash can result in disaster, making an entire level a failure. For instance, in Trash Panic's sixth level, a fiery comet will appear only once. If you fail to create a clear path to something flammable when this comet comes, your sole chance of clearing the level goes up in smoke. You'll no doubt have to go through plenty of trial and error to find the best strategies, but Trash Panic is an addictive-enough experience that it overcomes what would otherwise be a tedious process. Each time you play a level, you'll probably make enough incremental progress--or discover seemingly better ways to take advantage of the types of trash falling your way--that you'll be itching to replay if you fail. And you will fail a lot. The game, even at its easiest difficulty, is quite challenging, so there's a real sense of achievement to be had when you do manage to cram in what at first seemed like an impossible amount of trash. It helps that the game's levels are relatively short, so failing often means having only to replay a few minutes at most. Trash Panic is a rewarding experience, plus there's a certain amount of glee to be had from simply smashing objects into tiny pieces, even if they are only virtual. Things are about to explode in this can. Which is good news. It's extremely annoying, then, to come across Trash Panic's sometimes buggy physics, which can quickly turn a winning strategy into a wasted level. Destroyed objects will sometimes stay hanging in midair, forcing out other pieces of falling trash when there's actually plenty of spare room in the can. Some objects will act in unexpected ways, such as hard objects that suddenly develop elastic properties, resulting in other junk bouncing off of them and out of the can. These don't happen all of the time, but when one glitch can wreak havoc on all of your careful planning, they stand out painfully when they do occur. Despite having only six levels, Trash Panic comes packed with a good amount of play hours. In addition to the numerous times that you'll undoubtedly have to play through each level to best it, the game contains three difficulty settings that significantly affect your strategies. For example, normal difficulty features a ~boss~ piece of trash that appears late in the level. If you fail to clear this large piece of garbage (such as a truck, a large piggy bank, or a gigantic, fluffy cloud) within 10 seconds, then you're penalized with a rain of extra junk. There are also set challenges to clear, such as having to use a small trash can or strike a large bell more than 100 times. Finally, Trash Panic has a two-player mode in which you compete to see who can destroy garbage the quickest. This mode is fun if a little shallow, and will probably serve only as a minor distraction to the main single-player modes. However, one glaring omission is the lack of a midgame save. To complete an entire difficulty bracket, you'll have to play through all chapters in one hit, given that there's no option to save your progress after clearing each level. Rubbish isn't usually an attractive sight, and much the same can be said for Trash Panic's looks. There's little detail or sharpness to be found among the various bits of garbage you'll encounter, and the game's backgrounds suffer a similarly bland fate. The various sound effects of garbage crunching, breakage, and explosions are quite good, but the game's music gets stuck in your head--and not in a good way. The dance music in the early levels is particularly annoying, and you'll quickly lose patience with its incessantly looping repetitiveness. Trash outside the can=not good at all. In fact, patience is what you'll need to bring to Trash Panic. It's easy to quickly dismiss the game due to its high difficulty, frustrating glitches, and trial-and-error nature. However, if you stay with it, you'll find that it's challenging without being cheap, addictive while it lasts, and well worth your time. At the very least, it'll get you thinking more about how you dispose of garbage, and in these times of environmental concern, that can only be a positive. You'll no doubt have to go through plenty of trial and error to find the best strategies, but Trash Panic is an addictive-enough experience that it overcomes what would otherwise be a tedious process. Each time you play a level, you'll probably make enough incremental progress--or discover seemingly better ways to take advantage of the types of trash falling your way--that you'll be itching to replay if you fail. And you will fail a lot. The game, even at its easiest difficulty, is quite challenging, so there's a real sense of achievement to be had when you do manage to cram in what at first seemed like an impossible amount of trash. It helps that the game's levels are relatively short, so failing often means having only to replay a few minutes at most. Trash Panic is a rewarding experience, plus there's a certain amount of glee to be had from simply smashing objects into tiny pieces, even if they are only virtual. Things are about to explode in this can. Which is good news. It's extremely annoying, then, to come across Trash Panic's sometimes buggy physics, which can quickly turn a winning strategy into a wasted level. Destroyed objects will sometimes stay hanging in midair, forcing out other pieces of falling trash when there's actually plenty of spare room in the can. Some objects will act in unexpected ways, such as hard objects that suddenly develop elastic properties, resulting in other junk bouncing off of them and out of the can. These don't happen all of the time, but when one glitch can wreak havoc on all of your careful planning, they stand out painfully when they do occur. Despite having only six levels, Trash Panic comes packed with a good amount of play hours. In addition to the numerous times that you'll undoubtedly have to play through each level to best it, the game contains three difficulty settings that significantly affect your strategies. For example, normal difficulty features a ~boss~ piece of trash that appears late in the level. If you fail to clear this large piece of garbage (such as a truck, a large piggy bank, or a gigantic, fluffy cloud) within 10 seconds, then you're penalized with a rain of extra junk. There are also set challenges to clear, such as having to use a small trash can or strike a large bell more than 100 times. Finally, Trash Panic has a two-player mode in which you compete to see who can destroy garbage the quickest. This mode is fun if a little shallow, and will probably serve only as a minor distraction to the main single-player modes. However, one glaring omission is the lack of a midgame save. To complete an entire difficulty bracket, you'll have to play through all chapters in one hit, given that there's no option to save your progress after clearing each level. Rubbish isn't usually an attractive sight, and much the same can be said for Trash Panic's looks. There's little detail or sharpness to be found among the various bits of garbage you'll encounter, and the game's backgrounds suffer a similarly bland fate. The various sound effects of garbage crunching, breakage, and explosions are quite good, but the game's music gets stuck in your head--and not in a good way. The dance music in the early levels is particularly annoying, and you'll quickly lose patience with its incessantly looping repetitiveness. Trash outside the can=not good at all. In fact, patience is what you'll need to bring to Trash Panic. It's easy to quickly dismiss the game due to its high difficulty, frustrating glitches, and trial-and-error nature. However, if you stay with it, you'll find that it's challenging without being cheap, addictive while it lasts, and well worth your time. At the very least, it'll get you thinking more about how you dispose of garbage, and in these times of environmental concern, that can only be a positive."}