{"ref": "https://www.gamespot.com/reviews/arslan-the-warrior-of-legend-review/1900-6416366/", "date": "February 23, 2016", "game_name": "Arslan: The Warriors of Legend", "text": "The grand armies and the drive to amass thousands of kills makes Arslan: The Warriors of Legend the most fitting anime spin-off of the Samurai Warriors series yet. And if you ever wanted to know what would happen if a game actually adapted an anime TV show episode for episode, Arslan is a great test case. It delivers an enthralling narrative-driven hack-and-slash campaign and presents a deep knowledge base of the anime series, both of which help it overcome the familiarity of the core gameplay.Arslan: The Warriors of Legend is adapted from The Heroic Legend of Arslan anime TV show, which itself was adapted from a still-ongoing novel series. The series at large is influenced by a 19th century Persian epic with a dash of Arthurian allusions thrown in. The main character is the prince of Pars, a kingdom in a state of upheaval after being invaded by the nearby dominion of Lusitania. The self-exiled Arslan spends the bulk of the games story amassing troops and trusted advisors with the ambitious goal of retaking his kingdom.You can think of the maps and battlefields of Warriors games as micro open worlds. These combat zones are just as much training grounds to master combos as they are opportunities to string hundreds of uninterrupted kills. Multiple enemy platoons are often on your tail, and suddenly, the fantasy of obliterating a hundred troops in a single attack becomes a reality. Its an empowering sensation that is mildly diluted by the impotence of the A.I.-controlled enemy soldiers, who exhibit minimal ability and barely make an effort in dealing meaningful damage to your character.If youre a more goal oriented player, sticking to the story objectives--lifted from or inspired by the anime--creates a sense of linearity in these expansive arenas of war. Whether youre killing generals to demoralize troops or crushing barriers with the might of your armies, these assignments are easy to follow. And those who absolutely hate escort missions will be pleased to know that the characters and caravans youre occasionally tasked to protect are incredibly resilient. You would have to leave them to their own devices for five-minute stretches if you wanted to risk failing an escort objective.The maps in Arslan are thoughtfully conceived by comparison, designed to cater to its myriad story goals.Arslan also follows the recent trend of Warriors spin-offs foregoing the classic Dynasty Warriors slow-burn whac-a-mole gameplay. In other words, its nearly devoid of missions where you have to race the opposing side in conquering the map. Franchise developer Omega Force has also evolved its level designs beyond its classic 9 by 9 grids of smaller battlegrounds within a larger map. The maps in Arslan are thoughtfully conceived by comparison, designed to cater to its myriad story goals.Arslan periodically showcases its large-scale warfare with dramatic effect by way of a maneuver called Rush Mode. By taking your current character to a trigger point on the map, you can amass an organized brigade under your full control, sweeping large sections of enemies off the map and registering a satisfying 20,000-hit combo in a matter of seconds. Rushes arent triggered by exemplary performance--they are instead treated like a scripted superpower that moves missions along in specific events. The only downside to this sense of empowerment is that it makes the triple-digit combos outside of Rush Mode feel less rewarding. Still, its an inventive method to take full, albeit temporary control of your troops, a noteworthy change for a franchise that often doesnt give you this level of micromanagement.One of the reasons Arslan and the Warriors franchise are a great match is Arslans ensemble cast, which in spirit echoes the expansive rosters of Asian historical figures in both the Dynasty and Samurai Warriors series, just with a Middle Eastern fantasy flavor. The prince alone shows depth of character through his bravery and humility. His diverse team of rebels includes a skilled and devoted swordsman named Daryun and a charismatic archer named Gieve who is as adept with a bow as he is with a lute. The games focus on the original story forces the player to try out all the characters over the course of the campaign and sometimes multiple fighters in a single mission.One of the draws of Warriors games is the ability to rack up high combo counts. Every character in Arslan functions similarly, with slight variations in the timing and effects of the quick and strong strikes, but shine individually in the executions of their attacks. Narsus, for example, is a masterful tactician who takes out his brush, easel, and palette in the middle of the battlefield as his special move. The running joke is that hes not a talented painter, so its assumed that his ability to shock an entire battalion--often resulting in a 100+ hit combo--is because he is an exceptionally terrible artist.The plot is engaging enough that you're motivated to move the story along rather than attempt to rack up a thousand kills for an S-rank on K.O.s.Arslan's action can get repetitive, so you cant be blamed for spacing out for minute-long stretches while still stringing together an effective combo streak. At least the even spread of the more challenging boss encounters ensures that you have to take battles seriously if you hope for any chance at success.Riding the current of a battle and addressing every urgency in the field is a comfortable pattern to fall into. Its not unusual to drop everything when you hear that a comrade is being overwhelmed, a gate has been breached, or a trap has been set, especially when these updates are delivered by characters with loud desperation in their voices. Theres actually nothing to be desperate about; youre generously given 30 minutes for missions that can be completed in less than ten. The plot is engaging enough that you're motivated to move the story along rather than attempt to rack up a thousand kills for an S-rank on K.O.s. The other performance measurement is based on completion time and its incredibly difficult to get S-ranks in both categories in the same mission. Obtaining these high grades is satisfying, but not enough to warrant repeat playthroughs if you didnt get them the first time in a given mission. Thats due to the underwhelming rank rewards, which are collectible cards that provide stat bonuses in future battles. You can only apply these bonuses in modes outside of the campaign, and these consumable upgrades, such as increased attack power and defense, are insignificant in a game bereft of challenge. Sometimes the uncomplicated task of mowing down a division of Lusitanias or vanquishing a boss is enough of a reward.One unintended challenge is finding replay value after completing the story. Stat upgrades and ability boosts--rewards for clearing story objectives--are only applicable outside of the campaign, as in Free Mode, for example. In other Warriors games, this mode serves as a worthwhile diversion to grind your characters levels. In Arslan, its redundant since clearing the campaign requires no grinding. Furthermore, the Free Mode option to recast characters in previously cleared battles quickly loses its novel appeal.For fans of Japanese audio with English subtitles, Arslan proves to be a surprising case where appreciating its story developments would be better experienced with English dialogue, which is not available. These exchanges are as enlightening as they are entertaining, often revealing brand-new narrative details and lightening the mood with comedic banter among the main cast. Its upsetting to miss out on in-battle exposition just because youre in the midst of executing a deadly combo or simply powering your way through a dense battalion, but you simply don't have time to constantly read the conversation text at the lower-left corner of the screen.This emphasis on emulating its established story is its main strength and is also a bold move when compared to most other anime game adaptations.These instances of exposition add meaningful worth to Arslan. The unlockable encyclopedia and trivia-loaded extras section affirm the game as a legitimate companion piece to the anime. The novels have never been translated into English, so any revealing backstories and facts relating to the lore only strengthen the games value for fans of the series.Arslan: The Warriors of Legend is a notable Warriors franchise outlier for its unusually strict adherence to the source material. Just playing one or two missions feels like youre playing the equivalent of one episode. This emphasis on emulating its established story is its main strength and is also a bold move when compared to most other anime game adaptations. If Omega Force experimented with more noncanonical scenarios in its Free Mode, this could have ranked among the best Warriors spin-offs. Given the studios prolific history with Warriors-styled anime sequels and the news of a second season of Arslan, it wouldnt be unreasonable to hope for an improved follow-up in the coming years."}