{"ref": "https://www.gamespot.com/reviews/juiced-2-hot-import-nights-review/1900-6179866/", "date": "September 25, 2007", "game_name": "Juiced 2: Hot Import Nights", "text": "If you actually remember 2005's Juiced, you've got a better memory than most. THQ and developer Juice Games' unassuming arcade-style street racer did little to set the world on fire. Instead, it offered up a mostly competent take on a well-worn genre that had some interesting, yet flawed, design concepts. Juiced 2: Hot Import Nights is the follow-up to that unmemorable game, and this sequel is equally forgettable. It offers up yet another arcade-heavy street racing experience with driving mechanics that do little to impress, an offline career mode that's laudable only because you don't experience the teeth-gnashing frustration you may have with its predecessor, and presentation that's cut from the same swath that every generic street racer in the world uses. The one, saving grace is the Xbox 360 version's online play, which includes a whole career mode that you can play online against other armchair Paul Walkers. Sadly, PlayStation 2 owners are left on the side of the road with no online play at all. The world needs a lot of things. A Juiced sequel might not have been one of them, if Juiced 2 is any indication. Juiced 2 drives like some unholy hybrid of Midnight Club and Midway's old Rush series of arcade racers. There's nothing remotely realistic about the physics or handling of these cars, yet at the same time, the driving isn't so over the top as to be entertaining because of its ridiculousness. It toes the same middle ground as the original Juiced, and like that game, it isn't especially exciting. Sure, there are momentary thrills to be had during the circuit races as you find a quick shortcut to zoom past a rival driver or pull together some ludicrous combo while taking on one of the game's drifting events. But eventually, the imprecision of the car handling and sometimes questionable sense of speed conspire to dull up the proceedings. The interesting thing is how differently the circuit races and drifting events play. Races are like any other racing game you've ever played, except you may need to get used to the loose-feeling controls. Drift races, on the other hand, are a whole different animal. Even if you're driving a car you just drove normally on a race track, the handling becomes a slippery mess. This was probably done on purpose--this mode is all about drifting your car through turns, but the game basically sends your car sideways with even the slightest twitch of your controller. Your only job is to maintain some level of control and avoid hitting barriers. It's easier said than done. The whole thing feels like the track has been caked in bacon grease, and steering properly under those conditions is a dicey prospect. Still, if Juiced 2 deserves credit for any one thing, it's that even with its control weirdness, it provides one of the least complicated and generally enjoyable interpretations of drifting in a video game thus far. Maybe that isn't saying much given the competition, but it's still worth saying. Most of the racing takes place inside the game's career mode. Included in the career mode are a variety of race types. There are standard races, eliminator races, team races, standard solo drift events, and wheel-to-wheel drift events. There's also a decent roster of tracks in the game (the track designs are aesthetically different, though functionally similar between the 360 and PS2 versions of the game), though they're the same brand of closed-off tracks as in the first Juiced. There's no open-world racing here, no traffic to avoid. It's just tricked-out rides racing other tricked-out rides in somewhat sterile environments. One of the big issues with the original Juiced was that its career mode was a frustrating mess. The whole thing relied on a calendar of events, and every time you raced, you had to drop cash for an entry fee, as well as repairing your ride afterward. As time went on, the fees got more and more expensive, making progression more of a chore than anything else. All that stuff is gone in Juiced 2. The only cash you stand to lose in an event is whatever you opt to gamble against another racer (a feature that is entirely optional), and all the events are free to play. On top of that, in place of the calendar is a tiered series of leagues, each with multiple events and goals to complete. The goals are nonlinear and range from simply placing third or higher in a certain type of race to winning a bet of a certain amount or defeating specific rivals on the track. You can actually knock out multiple goals in one race if you know what you're doing. Car customization is adequate, though it's not entirely user friendly. It's a cool system that actually helps alleviate some of the insane difficulty of the later leagues. As the cars get faster, the issues with car handling are exacerbated, and at the same time, the opponent artificial intelligence goes from merely suspect to completely ludicrous. The game suffers from pure rubber-band AI: When you're ahead, opponents always seem to be close behind; when you're way behind, opponents practically seem to slow down and let you catch up. It's really silly in the early goings because you could be a good 50 yards behind an opponent, but right before the finish line, you'll see him spin out or do something otherwise stupid and let you overtake him. By the same token, opponents in later career tiers have an uncanny ability to just overtake you at will. Suffice it to say, it gets pretty irritating in the later goings. One of the supposedly big new features in Juiced 2 is the driver DNA system. It's designed to show differentiation between driving styles, rating proficiency in everything from gambling habits to cornering, and rating those abilities on a three-point scale of wild, normal, or cool. Unfortunately, it's also completely useless. There is zero differentiation between the AI drivers. Supposedly great-rated drivers end up losing badly to guys who look like they have barely any races under their belts. The game doesn't even seem to do a particularly good job of tracking your own exploits. You could be wrecking into corners left and right yet still end up with a relatively tame cornering rating. As you play through the career, you'll earn cash, which you can use to buy a nice variety of licensed rides and customize them as you see fit. There's a good, solid array of visual mods (bumpers, hoods, mirrors, headlights, wing-style doors, and such), and you can also add a bunch of different decals to your cars. Unfortunately, the decal editor is rather limited, and getting the kinds of elaborate designs you'll see on cars of racing opponents involves much more painstaking effort than you'd probably prefer. Decals aren't as shapeable and there isn't as wide a variety of good-looking decals as in many other street racers of this type. In fact, a lot of the decals are pretty terrible-looking. If you really hunker down and start messing with it, you can make some cool designs, but it takes a lot more effort than one would probably prefer. For PlayStation 2 owners, the features list pretty much begins and ends with the career mode. There are some racing challenges to play outside of the career, and two players can race in split-screen, but there is no online multiplayer whatsoever. Xbox 360 players, on the other hand, get to play with a rather elaborate online mode. Apart from the standard ranked and player matches, there's a whole online career mode that directly mimics the offline career. All the same events are playable, but instead of AI opponents, you can play against other live racers. The lobby system is a bit convoluted: Because there are so many different events, the only way to tell who is interested in playing on a specific track is a little counter that shows how many people are looking at that specific race. It doesn't necessarily mean that anyone has a game up, so you still may find yourself poking around a bit. Still, it's cool that you can take on career races against live players, and the online performs quite well with minimal lag. However, the one odd thing about this mode is that it is just the offline career online, yet the two are not intertwined in any way. It's basically just two duplicate career modes, with totally different garages and career records. Essentially, you'll end up playing the same career mode twice if you go through both. If Juice Games had worked to find a way to integrate the two modes into one experience, that would have been a lot more interesting. However, not everything works exclusively in favor of the 360 version. While it's certainly got more content, we did run into a technical issue or two with that version. Specifically, loading screens periodically locked up on us, forcing us to reboot the game. This was tested on multiple systems with the same basic result. During one such situation, the game actually corrupted our save file. This is one of those few street racers where drifting isn't completely awful. Presentation is another area where the 360 version doesn't really impress. Obviously, it looks a bit better than the PS2 game, but not as much as you might expect. One thing the PS2 version actually does better is the sensation of speed. Cars just feel faster in the PS2 version. Still, the 360 game looks OK. Car models are sharp and detailed, though the tracks are decidedly less so. The 360 version also lets you customize your driver, though the character models are blocky and kind of ugly. The frame rate holds up in both versions of the game, save for a few races with more than six cars on the track. Audio is largely unremarkable, consisting of predictable effects; a cheesy female voice who guides you through all the tutorials and tells you about all the ho-hum exploits of your opponent drivers while purring in a pseudosexy voice; and a licensed soundtrack that has a few notable songs, but nothing spectacular. Regardless of which version of the game you're talking about, Juiced 2 is not a game that can really be recommended to anyone but the most vehement street racing junkies. Countless games have done what Juiced 2 does and done it better. While the 360 version's online career mode is a neat wrinkle to an otherwise flaccid game design, it isn't necessarily enough to carry the game all by its lonesome. At best, Juiced 2 is an OK rental, but it's not interesting enough to warrant a full-priced purchase."}