{"ref": "https://www.gamespot.com/reviews/star-trek-shattered-universe-review/1900-6086948/", "date": "May 17, 2006", "game_name": "Star Trek: Shattered Universe", "text": "Star Trek games, much like the many other facets of the Star Trek franchise, tend to be either very good or very poor, without much of a gray area in between. Star Trek: Shattered Universe, the latest game to bear the Trek name, regrettably falls toward the poorer branch of the Trek universe. Brought to you by TDK Mediactive and developer Starsphere Interactive, Shattered Universe is essentially a lazily designed space shooter that takes place inside an alternate universe depicted in an episode of Star Trek: The Original Series called ~Mirror, Mirror.~ In this universe, everything is backward--the Federation is now an evil empire, former foes are now your allies, and everybody either has a scar, a goatee, or something similar to clearly indicate that you are most definitely in some sort of bizarro universe. This concept itself obviously isn't a terribly original one, and Shattered Universe's gameplay mechanics are equally pedestrian in design, hopelessly trying to mirror bigger, better space combat games. Star Trek: Shattered Universe is about the most boring and unimaginative space combat game you'll ever find. There isn't a whole lot to Shattered Universe's plot beyond an extremely basic setup. Essentially, you play as a nameless member of the crew of the U.S.S. Excelsior, commanded by George Takei's Captain Sulu. At the beginning of the game, the Excelsior is called to aid the U.S.S. Enterprise, which has become trapped in some sort of space anomaly (and also happens to be captained by Walter Koenig's Commander Chekov). Upon its arrival, the Excelsior is pulled into the anomaly and is spit out into an unfamiliar universe. A battle with an alternate version of the Enterprise--captained by a now-evil Chekov--then ensues, and although you are eventually victorious, the anomaly disappears, leaving you no immediate escape back to your own universe. From there on out, the Excelsior's task is to get home by trying to find this anomaly once again. Along the way, you'll engage in a lot of meaningless combat while meandering around this strange universe, performing one dull task after another. There are 19 missions in Shattered Universe. Each mission has multiple objectives, some of which you find out at the very beginning of the mission and some of which appear only after you're neck-deep into one. Each mission is prefaced by a somewhat drawn-out and perplexingly, uninformative briefing from Captain Sulu. Missions primarily have you flying around in one of the game's several small fighter ships--which include a couple of Federation-brand fighters, a Klingon Bird of Prey, and a Romulan Shrike--blasting other fighters, collecting random items, and occasionally engaging starships. The problem with the game's missions is that they never really feel like they have much purpose, nor are they particularly well paced. Several chapters require you to go on ~scout~ missions, where you essentially fly from one navigation point to another, collecting minerals for some unknown reason, and in between, you shoot a lot of fighters. In another mission, you have to protect the Excelsior from an Enterprise attack. Your goal is to damage the Enterprise so that it will retreat. Once you've done that, the Enterprise launches a warhead at the Excelsior. Sulu informs you that the warhead is too heavily shielded to be destroyed, so you need to go destroy the rest of the Enterprise's fighter squadron in three minutes. How does destroying a group of fighters save the Excelsior from a seemingly indestructible warhead, and why does the task need to be completed in three minutes? No satisfactory answers are given for these or any number of other questions that will likely pop into your head while playing the game. Additionally, most of the missions can take anywhere from 15 to 25 minutes to complete, and it is far too easy for you to end up getting smoked right at the end of a mission when some late-mission objective presents itself out of the blue, thus causing you to have to start all over again. These problems might be forgivable if Shattered Universe's combat were well designed, but unfortunately it isn't. Each fighter ship has three basic weapons: a basic phaser, a bolt weapon (which is like a quick, short phaser burst), and photon torpedoes. When engaging smaller ships, really, the only weapon that is of any use to you is the basic phaser, since the leading targeting reticle for your targeted ship isn't accurate enough for your bolt weapon, and photon torpedoes are completely useless unless you're attacking a starship. Also, despite the fact that the game can be rather trying, the AI of opposing ships isn't especially brilliant. Fighters have some rather rudimentary attack patterns that can be easily avoided with some decent flying skills. As for the starships, the only real challenge comes from the fact that their weapons are pretty adept at taking you out in only a couple of short bursts. However, some missions do require you to destroy starships, so generally, your best bet is to find a spot within tight range of the opposing ship--so that its weapons can't lock onto you--and start hammering the attack buttons for the several minutes it takes to destroy the ship. If this doesn't sound like much fun, well, you're right, it isn't. As far as Shattered Universe's presentational aspects go, you can't help but think that the developers really didn't put much effort into any of them. The game's graphics definitely aren't anything special--ship designs lack much in the way of detail, and the various effects used for phaser fire, explosions, and the like all look extremely low-rent. The same can be said for the multitude of different space environments in the game. Though there's a decent variety of different background elements, like nebulae, space stations, asteroid fields, and even occasional planets, none of them look in any way impressive. The game also features a number of awful CG cutscenes, with in-game versions of Sulu and Chekov that are laughable at best. Every CG character moves in painfully slow motion, and the actual renderings barely look anything like the actors, especially Sulu, who looks like some kind of decrepit skeleton. The PS2 and Xbox versions of the game look near-identical in every way. For what it's worth, the Xbox version does support 480p, though it doesn't look much better when using it. Shattered Universe is to Star Trek games what Star Trek V was to Star Trek movies. Shattered Universe's sound design is equally as unimpressive as the game's visuals. It should have been a simple task for George Takei and Walter Koenig to reprise their longtime roles as Sulu and Chekov in Shattered Universe, and yet, somehow, when you listen to them talk in the game, it sounds more like this is their first experience with the roles. Takei phones in his performance horribly, flatly reading every line as though it were some kind of college dissertation, and as for Koenig, though he tries to emphasize the inherent ~evilness~ of his mirror-universe character, it just comes off more as unintentional parody than anything else. In terms of in-game sound, there's a limited amount of music that plays throughout the game, as well as some rather bland-sounding phaser and explosion sounds, but not much else. Perhaps if it existed in an alternate universe, Star Trek: Shattered Universe might be a game worth playing. Unfortunately, this is not the case. In our universe, Shattered Universe's dull, unimaginative gameplay, redundant mission structure, and highly unimpressive production values make for a pretty lousy game all around. As an attempt at Star Trek, it wastes every opportunity given to it to do something even mildly interesting or entertaining, and it certainly won't please any fan of the franchise. As for its place among space combat games, it is completely unimpressive in every imaginable way and is easily shown up by practically every game currently available in the genre today. There's just nothing about Shattered Universe worth recommending to Star Trek fans or space shooter fans, and if you fall into either category, you're definitely better off looking elsewhere for your particular needs."}