{"ref": "https://www.gamespot.com/reviews/parappa-the-rapper-2-review/1900-2841279/", "date": "November 19, 2003", "game_name": "PaRappa the Rapper 2", "text": "PaRappa the Rapper is widely credited as the first big music game to come to the US, and the game had all the components needed to make a good music game. The game featured a quirky storyline, unique gameplay, and some pretty fantastic original music. The game was followed by a quasi-sequel in the guitar-themed Um Jammer Lammy. Now, Masaya Matsuura, Rodney Greenblat, and the rest of the gang have teamed up and put together a true PaRappa sequel. However, an almost total lack of innovation makes the game seem pretty dated when compared with other games on the market. PaRappa 2 thrusts everyone's favorite rapping puppy into a huge food fight. The insidious Noodle Group is going around turning everything, food or otherwise, into noodles. PaRappa, disgusted by the possibility of never being able to get a real hamburger again, decides to do something about it, all the while hoping to convince Sunny that he's a real man. The journey takes you from a burger joint, through a hair salon, inside a video game, to right up against the leader of the Noodle Group. Like the original, you play by mimicking rap lines. The level's teacher says a line, and then you repeat by hitting the correct buttons in rhythm with the song. Even when played to perfection, though, the rapping still sounds just as stuttery as it did in the previous game. While it was excusable then and perhaps even a little charming, it would have been nice to see the developers make better use of the PlayStation 2's higher specs. About the only meaningful change to the gameplay is that the lines vary slightly as you progress through the game's multiple difficulty levels. Aside from that, the game simply gives you points based on how well you rap. You can succeed by simply imitating the teacher's lines as closely as possible, but the game gives you bigger points for freestyling and delivering the lines in your own way. PaRappa 2 features the same 2D graphical style as its predecessor, but it's not without its share of enhancements. The characters don't have the rough, jagged edges found in the original, and they generally look pretty nice. The game also runs at a nice, smooth 60 frames per second, though you'll hardly notice any of that while you're focusing on which buttons you need to press to rap. The sound is pretty good, though the game lacks any real standout songs. The music in the game covers a lot more ground, genre-wise, than the original did, but none of it is especially funny or toe-tapping--with the exception of the level that takes place inside an old video game machine. PaRappa 2 isn't a bad game, but it doesn't have as much of the same off-beat charm that the original--and to a lesser extent, Um Jammer Lammy--had. PaRappa may have been first, but since we last saw the hip-hop hound, tons of more-complex music games have been released. Some, like Frequency, handle the music part of the equation expertly, while games like Gitaroo-Man pick up the slack in the insanely ludicrous storyline department. If you're happy with more of the same, PaRappa the Rapper 2 covers all the bases reasonably well, but anyone expecting PaRappa 2 to raise the bar in the genre will likely be pretty disappointed."}