{"ref": "https://www.gamespot.com/reviews/shrek-superslam-review/1900-6141259/", "date": "December 14, 2005", "game_name": "DreamWorks Shrek SuperSlam", "text": "Shrek SuperSlam is a 3D melee fighting game for the Nintendo DS. The game lets you play as one of 12 characters as you fight in two- to four-player matches in one of the 16 stages in the game. The fighting system is limited to a couple of strikes and a few basic combos, but there's no reason to do anything other than mash a single attack button, because that almost always works just fine. Shrek SuperSlam is a mediocre beat-'em-up that just happens to have a familiar cast of characters. But, no matter how much you love the Shrek movies, the novelty of this game will wear off well before you get your money's worth. All your favorite Shrek characters are here, plus a few you probably never really cared about. The goal in Shrek SuperSlam is to collect fairy dust by pummeling your enemies in up-to-four-player battles. After you get 100 fairy dust points, you can hit any attack button to ~superslam~ your opponents, which sends them flying off the screen. There are a handful of different modes in the game, but for the most part you don't have to do anything but mash buttons and rack up as many superslams as possible within two minutes. There's a story mode in Shrek SuperSlam, but the story has no bearing whatsoever on the gameplay. Donkey invites Shrek and some other friends over for a game of cards, but his rambunctious children, the Dronkeys, keep interrupting the game. In order to calm the critters down, you have to choose a character to tell the Dronkeys a bedtime story. The story changes depending on which character you choose, but aside from the initial setup and a brief closing scene, the story has nothing at all to do with the rest of the game. After the intro, you fight your way through a series of one-on-one battles. Each battle lasts two minutes, and the person with the most superslams at the end of the match is the winner. Melee mode is the basic fighting mode, but there are quite a few options that let you adjust the rules of the game. You can choose the number of players, the stage, the time limit, the amount of fairy dust you get for each hit, and more. You can play a simple timed match; a race match, in which the first one to get a certain number of slams is the winner; a fairy dust challenge, in which you just have to collect a certain amount of fairy dust; and a tag mode, in which the last person slammed automatically respawns with a full helping of fairy dust. There's also a megachallenge mode, which gives you 32 single-player challenges to complete. These challenges range from a memory-type game in which you flip cards trying to match up like pairs, to basic melee matches with specific stipulations. You might have to slam nine enemies without getting slammed yourself, or slam an opponent within 30 seconds. The challenges are extremely easy, so even though there are quite a few of them, you can still burn through the entire set in an hour or two. The best mode in the game is multiplayer melee. The game supports up to four players, but unfortunately there's no game sharing, so you'll have to somehow convince your friends to get a hold of their own copies of the game. If you only have one other friend who owns a copy of the game, you can choose to play one-on-one matches, or you can add some bots to play against. You can also customize your game with a variety of options just like in the single-player melee mode. The one problem with multiplayer mode is that there's no running tally of wins versus losses over a number of rounds. It's one of those things that you don't miss until it's gone. The problem with the fighting in any mode in Shrek SuperSlam is that it just isn't much fun. Each character has a standard punch and a heavy punch, both of which can be strung together to create combos. There are a handful of combos, but none of them involve more than three button presses. Each character can also perform a special move, as well as aerial attacks. Shrek farts to stun his enemies, Puss in Boots charms his enemies by looking cute, Donkey summons his Dronkeys to dive-bomb enemies, and so on. The problem is that none of these extra moves are ever necessary. You can just hit the standard punch button over and over again and pummel your opponent into a corner where they can't escape. Even if you choose not to take the cheap and easy route, the artificial intelligence-controlled characters usually will. The opponents in the single-player game not only seem to move much more quickly than you, but they often pin you down with repetitive, quick attacks that are nearly impossible to avoid once you get caught up or cornered. There are several different types of items and weapons that appear in each battle, but they aren't especially useful. You can pick up a smelly sock on a stick, a broom, bombs, banana peels, magic wands, crossbows that shoot toilet plungers, and more. There are also potions you can pick up to make yourself invisible, to get a speed boost, or to shrink or grow your character. The weapons extend your range slightly, but they're much slower than regular attacks. To equip a weapon you have to touch the associated icon on the lower screen of the DS, which requires you to take your eye off the top screen and leaves you open to attacks. The potions are just as extraneous as the weapons. There isn't much of an advantage to being tiny or huge, and the invisibility potion never seems to come in handy, either. The only useful potion is the speed potion, but even that is only really necessary when you're trying to avoid your enemies entirely, which is only the case when you've already built up a lead and want to run out the clock. You can fight up to three of your friends in multiplayer melee, as long as you have three other friends who have their own copies of the game. The best part of Shrek SuperSlam is the presentation, specifically the 16 large, destructible stages you can fight in. The stages each fit a specific theme, like Gingy's gingerbread house, Shrek's swamp, Fiona's bedroom, and Geppetto's workshop. The stages are fairly large and there are plenty of destructible objects to break apart. There's really no reason to do so, other than to see stuff break apart, but that's all the reason you need to have breakable stuff in a fighting game. The stages all have multiple levels for you to jump around on, and they all look good. There's even a black-and-white version of Gingy's stage, which is actually really cool because it does a good job of emulating the look of an old-fashioned silent film. The only problem with the big stages is that sometimes characters get stuck behind walls or other objects, making it hard to see what's going on. You can adjust a slider on the lower screen to zoom the camera in and out, but there isn't enough range on the zoom feature to make it useful. The characters look good as well, except for Shrek, whose face looks more deformed than it should, even for an ogre. The animations are fairly stiff for each character, and the fact that you'll see the same few animations repeat constantly makes the movements look pretty unnatural. The sound in the game is bland and unremarkable. The characters all shout and grunt as they fight, but you'll quickly get sick of all the noise. The music does a passable job of matching the theme of each stage, but it's never particularly catchy or enjoyable, and you'll forget it as soon as you hear it. Shrek SuperSlam is a decent attempt at a 3D melee game for the Nintendo DS, especially if you are really into the license. It wears thin pretty quickly though, and the fighting system is repetitive and dull. The multiplayer is fun for a few rounds, but with plenty of other good multiplayer games available on the DS, there's not much reason to play this one."}