{"ref": "https://www.gamespot.com/reviews/resident-evil-dead-aim-review/1900-6030112/", "date": "June 16, 2003", "game_name": "Resident Evil: Dead Aim", "text": "There's been a distinct survival horror vacuum on the PlayStation 2 ever since Capcom decided to release the core Resident Evil games exclusively on the GameCube. In an effort to satiate PS2 owners while maintaining its deal with Nintendo, Capcom has released Resident Evil: Dead Aim (which goes by the more unwieldy name Gun Survivor 4: BioHazard: Heroes Never Die in Japan) for the PlayStation 2. Though not a Resident Evil game in the traditional sense, it does capture the pacing and the tone of the series fairly well, and it's generally the best Gun Survivor game released to date. All you need to know is that there are zombies to kill, and it's up to you to kill 'em. Much like Resident Evil Gaiden for the Game Boy Color, Resident Evil: Dead Aim puts you on a cruise ship teeming with zombies infected with the T-virus. You start off playing as Bruce McGivern, a US government agent sent to stop Morpheus D. Duvall, the antagonist in Resident Evil 0, from spreading the T-virus any further. Along the way you'll run into Fongling, a Chinese government agent who is aboard the cruise ship for the same reason, and you'll also end up playing as her. Though you'll occasionally get brief bits of back story in the form of cutscenes and documents you find on the ship, ultimately, all you need to know is that there are zombies to kill, and it's up to you to kill 'em. The whole experience is an odd blend of standard Resident Evil fare and light-gun action. The mechanics of the Gun Survivor games, which attempt to combine the mechanics of a traditional first-person shooter and the mechanics of a light-gun game, have always been pretty clunky. Dead Aim has its fair share of problems, but it does manage considerably better than previous entries in the series. This is thanks largely to Dead Aim's new camera system, which gives you a third-person perspective when you're not firing your gun. The switch from first-person to third-person can be jarring, but the broader range of vision the third-person perspective affords you is well worth it. Also, Dead Aim gives you an abundance of control options, as the game can be played with a GunCon2, a GunCon2 in concert with a Dual Shock 2, a Dual Shock 2 by itself, or, most interestingly, a Dual Shock 2 in concert with a USB mouse. Each has its pros and cons, with the Dual Shock 2 providing better movement control and the GunCon2 providing more accurate and more visceral shooting, but any of them will work well enough. There are issues, though, that bleed across all the control schemes, such as your character's slow turn-around rate, which, when combined with a sneaky zombie, can prove to be fatal. And though you have horizontal control of the camera while wielding a weapon, you're unable to look up and down, which is just irritating. Since most light-gun games are spawned from arcade machines, they tend to have a uniformly manic pace, but this is another area where Dead Aim breaks rank. The game moves at a more methodical pace, like a core Resident Evil game, and it makes use of many mechanics that fans of the series will be familiar with. There's a fair amount of exploration as you make your way through the ship, which means you'll be doing a fair bit of item collecting, switch flipping, and key hunting. You'll pick up several different guns through the course of the game, including a magnum, a shotgun, and an extremely satisfying assault rifle, but like in a core Resident Evil game, zombies can be difficult to put down permanently, and ammo can be very scarce. There will be plenty of moments throughout the game where you're better off just running away rather than trying to stand your ground. The whole experience is a real odd blend of standard Resident Evil fare and light-gun action, but it's actually a refreshing change of pace from your standard run-and-gun light-gun game, and on a certain level, it works. The sound design in Dead Aim does a rather good job of creating an atmosphere that is thick with tension. Dead Aim doesn't rival the presentation of Resident Evil 0--not by a long shot--but it's still a pretty good-looking game. The cruise ship is really the centerpiece of the game, and it's rendered with a surprising amount of detail. The whole cruiser, from the pool deck to the cabins to the bowels of the ship, feels built to scale, giving you a sense that you are in a real location. The zombies, while serviceable, aren't quite as convincing, though Dead Aim's good use of lighting helps make them more menacing. The cruise ship is, generally speaking, not a well-lit place, and the flashlight in your pocket only lets you see a few meters ahead of you, adding a sense of danger to every blind turn and dark corner. The models for Bruce McGivern and Fongling look and move more convincingly than the zombies, and they have different animations depending on their current health. Resident Evil: Dead Aim will likely leave many Resident Evil fans unsatisfied. The sound design in Dead Aim isn't very impressive technically, but it still does a rather good job of creating an atmosphere that is thick with tension. The game has a very sparse sound to it, with the only real constants being your own footsteps and the drone of the ship's engines. Occasional squeaks and groans from the ship's machinery keep you on edge, and the moan of a zombie you can't see will send a shiver down your spine. When you do end up firing on a zombie, the report from your gun is sharp and realistic, and it rings convincingly off the steel walls of the ship. There are some other nice little touches as well, like your character's heavy breathing when running for long stretches and the introduction of frantic music during especially harrowing sequences. The audio isn't entirely free of problems, though. The zombies have a limited number of moans and groans, and the effect used for a zombie biting into your neck sounds squishier than it does gruesome. Though the voice acting comes up only during the cutscenes, the dialogue is forced and borders on caricature, with Bruce McGivern's goofy Southern drawl easily being the most laughable. All told, Resident Evil: Dead Aim is only three or four hours long, which is pretty good for a light-gun game, but the length, combined with the nontraditional game mechanics, will likely leave many Resident Evil fans unsatisfied. Light-gun fans may be more accepting of what Dead Aim has to offer, if only because it provides distinctly different light-gun experience. It's not the best Resident Evil game, and it isn't a stellar light-gun game, but Dead Aim creates an interesting, unique hybrid of the two, and that is a commendable feat. Since most light-gun games are spawned from arcade machines, they tend to have a uniformly manic pace, but this is another area where Dead Aim breaks rank. The game moves at a more methodical pace, like a core Resident Evil game, and it makes use of many mechanics that fans of the series will be familiar with. There's a fair amount of exploration as you make your way through the ship, which means you'll be doing a fair bit of item collecting, switch flipping, and key hunting. You'll pick up several different guns through the course of the game, including a magnum, a shotgun, and an extremely satisfying assault rifle, but like in a core Resident Evil game, zombies can be difficult to put down permanently, and ammo can be very scarce. There will be plenty of moments throughout the game where you're better off just running away rather than trying to stand your ground. The whole experience is a real odd blend of standard Resident Evil fare and light-gun action, but it's actually a refreshing change of pace from your standard run-and-gun light-gun game, and on a certain level, it works. The sound design in Dead Aim does a rather good job of creating an atmosphere that is thick with tension. Dead Aim doesn't rival the presentation of Resident Evil 0--not by a long shot--but it's still a pretty good-looking game. The cruise ship is really the centerpiece of the game, and it's rendered with a surprising amount of detail. The whole cruiser, from the pool deck to the cabins to the bowels of the ship, feels built to scale, giving you a sense that you are in a real location. The zombies, while serviceable, aren't quite as convincing, though Dead Aim's good use of lighting helps make them more menacing. The cruise ship is, generally speaking, not a well-lit place, and the flashlight in your pocket only lets you see a few meters ahead of you, adding a sense of danger to every blind turn and dark corner. The models for Bruce McGivern and Fongling look and move more convincingly than the zombies, and they have different animations depending on their current health. Resident Evil: Dead Aim will likely leave many Resident Evil fans unsatisfied. The sound design in Dead Aim isn't very impressive technically, but it still does a rather good job of creating an atmosphere that is thick with tension. The game has a very sparse sound to it, with the only real constants being your own footsteps and the drone of the ship's engines. Occasional squeaks and groans from the ship's machinery keep you on edge, and the moan of a zombie you can't see will send a shiver down your spine. When you do end up firing on a zombie, the report from your gun is sharp and realistic, and it rings convincingly off the steel walls of the ship. There are some other nice little touches as well, like your character's heavy breathing when running for long stretches and the introduction of frantic music during especially harrowing sequences. The audio isn't entirely free of problems, though. The zombies have a limited number of moans and groans, and the effect used for a zombie biting into your neck sounds squishier than it does gruesome. Though the voice acting comes up only during the cutscenes, the dialogue is forced and borders on caricature, with Bruce McGivern's goofy Southern drawl easily being the most laughable. All told, Resident Evil: Dead Aim is only three or four hours long, which is pretty good for a light-gun game, but the length, combined with the nontraditional game mechanics, will likely leave many Resident Evil fans unsatisfied. Light-gun fans may be more accepting of what Dead Aim has to offer, if only because it provides distinctly different light-gun experience. It's not the best Resident Evil game, and it isn't a stellar light-gun game, but Dead Aim creates an interesting, unique hybrid of the two, and that is a commendable feat."}