{"ref": "https://www.gamespot.com/reviews/the-world-ends-with-you-review/1900-6189661/", "date": "April 22, 2008", "game_name": "The World Ends with You", "text": "It's pleasing to see that Square Enix--despite having the Final Fantasy, Dragon Quest, and Kingdom Hearts megafranchises in its lineup--is still willing to go boldly into new frontiers with the release of original games like The World Ends With You. This role-playing game eschews the company's tried-and-true swords-and-sorcery settings and instead transports the action to modern-day Tokyo. Although there's nary a chocobo or keyblade to be found here, The World Ends With You still incorporates some of the company's best-known trademarks and wraps plenty of innovative new gameplay around them, particularly an initially mind-bending dual-screen combat system. The result is a game that manages to feel familiar and yet strikingly new at the same time, and one that deserves to be ranked alongside Square Enix's best works. Yes, fighting on two screens can be a little confusing at first, but you'll get used to it. At first glance, the game seems little more than a pastiche of all the things that have made the famed Japanese developer's RPGs massive successes in the past. Angsty teen hero with an absurdly angular haircut? Check. Complex, team-based combat system? You betcha. Detailed customization options with weapons and armor that border on the anal retentive? Fer sure. But The World Ends With You merely uses these Square Enix conventions as a launching pad for a unique experience that is both impressive in its use of the Nintendo DS's capabilities and compelling in its storytelling. The most apparent difference from previous Square games is location. The World Ends With You is set not in an imaginary kingdom, but entirely within Tokyo's fashion and shopping hub, Shibuya. Several real-world landmarks from Shibuya are re-created within the game, such as the train station, Shibuya Crossing, Hachiko's statue, Dogenzaka, and more. However, this shift to a modern setting isn't mere window dressing, given that it greatly complements the game's overall design. Developer Jupiter Corp has stuck to a character look similar to that found in the Kingdom Hearts series, and though the far-out fashion seemed somewhat out of place within that game universe, here it seems entirely appropriate to the fast-paced and fashion-conscious world of trendy Tokyo. The story itself is a little The Matrix, a little Battle Royale. The game follows main character Neku Sakabara as he's forced to play The Reapers' Game, a sinister competition in which the (mostly) evil Reapers assign players like Neku a task every day for seven days. Fail to complete the task within the set time limit and the player is completely erased from existence. Strangely, none of the other inhabitants of busy Shibuya can see Neku or the other players, although a mysterious pin that Neku finds on his person when he first wakes up in Shibuya lets him read people's minds. What's even more disconcerting are the large groups of strange creatures now roaming the streets. Although normal people can't see these creatures--called the Noise--they can see Neku, and they're out for blood. Along the way, Neku is forced to make pacts with other characters because forming these bonds and fighting in pairs is the only way to deal damage to the Noise. There are some genuine twists in this game's intriguing story, and there is also plenty of heartfelt emotion from its teenage protagonists, which makes for some truly touching moments. The themes explored here--finding your identity, overcoming insecurity, teen angst, coping with guilt, the weight of obligation--are nothing new for a Square Enix game, but they seem somewhat more resonant and identifiable because they're coming from characters who use mobile phones, eat fast food, and who do other things that ground them in the same world we live in. Traversing the world of Shibuya is done through the stylus and touch screen, but battles are where it gets more complex. The game's setting might be somewhat of a departure for a Square Enix game, but the combat is a completely new take that uses both of the DS's screens at the same time. Neku and his partner share the same health bar, while the Noise they're fighting appear on both screens at once (although not necessarily in the same location). On the bottom screen is Neku, whom you control via different directional swipes with the stylus on the touch screen. Neku uses objects called psych pins to attack, and each type of pin requires a specific move with the stylus to unleash its power. These moves can include rapidly tapping the screen, performing slashes across enemies, quickly scratching empty space, drawing circles with the stylus, and more. There are also some pins that require you to yell into the DS's microphone. These pins feature such varied powers as the ability to call a meteor strike, erupt a mini volcano, create lines of flames, throw cars and other objects around, shoot out electrical fields, and much more. Though there are supposed to be 300 different pins to be found in The World Ends With You, that doesn't mean there are 300 different types of powers to be unleashed in the game. Considering that many powers are replicated among different brands in the game (more on this later) you can definitely expect to see the same powers again and again. And just like Neku, psych pins can gain experience in battles, going up in levels the more times they're used. The DS's top screen is where Neku's current partner will battle the Noise. The partner's actions are controlled via the D pad, with different combinations of directional presses resulting in different attacks or defensive maneuvers. Both Neku and his partner can also unleash powerful combos, which are earned by following a specific pattern of attacks on the top screen and released via tapping the bottom screen. Some real life Shibuya landmarks can be found in the game. As you might guess, controlling both characters at the same time is confusing. Thankfully, the World Ends With You rewards you not for trying to control the action on both screens simultaneously, but for rapidly switching control from one to the other in a smooth way. At the beginning of each fight, Neku will be bathed in a green light. As soon as he makes a successful attack, this green light will move to his partner in the top screen, which will then move back to Neku after the partner makes an attack. Successfully passing this green puck back and forth between the two results in increasing damage bonuses done to enemies, which of course means that you'll need to concentrate on whoever has the puck to keep the combo going. Sound any less hectic? Even with the puck-passing mechanic, fights in The World Ends With You can still be quite chaotic, with eight or more attacking you on both screens at the same time. But despite this complexity, it's a system that gets easier to use with practice. In fact, one of the greatest joys we found in the game was the dawning realization that, after a few hours, we wanted the green puck to move faster to let us chain attacks more quickly. Its an awesome feeling to have what seems so alien at the start become second nature. The only downside to what is otherwise a compelling combat system is that, though many of the pins available to Neku feature different abilities, the movements required to unleash them are in many cases too similar to provide fine control over what pin to use at a certain time. With Neku eventually able to carry six pins into battle, that means being more strategic about which pins to carry to create the most damage. This is because having two pins with the same stylus move requires you to completely use up the charge of one before being able to use the power of the next. Character models are the requisite level of Square Enix kooky. Although The World Ends With You's unique combat system is sure to initially confuse and bewilder many players, the game does allow for a gentler learning curve thanks to combat options that can be tweaked on the fly. These include varying the speed with which the game's AI will automatically take control of your partner if you get too distracted with the bottom screen, and even changing the game's difficulty between fights. The World Ends With You also lets you choose your battles, with no random fights occurring as Neku traverses through Shibuya. Instead, Neku can pick his own fights; the same pin that lets him read people's minds also alerts him to the presence of any Noise in the area. On the flip side, the game also lets you kick things up a notch at any time by lowering the level of your characters or even chaining several fights together. Players who choose to fight at a lower level than their character's current maximum (say, fighting as a level 25 when your character is actually level 30) obviously have to suffer the requisite drops in attack, defense, and health stats, but the compensation is that defeated Noise will tend to drop more lucrative items. Chaining fights together--that is, taking on consecutive groups of Noise on the same health bar--also boosts the quality and frequency of dropped items. This element of adjustable risk is a nice addition to the game, giving you the option to play it safe or live on the edge in the hope for a big payoff, or even switch between the two from encounter to encounter. You might find yourself consistently fighting five levels or so below your maximum to keep the new pins and money rolling in, money you can then spend on hundreds of items from the stores in The World Ends With You's virtual Shibuya. Just like in the real world, brands are everything in this game. Specific brands exist for each item, such as clothing (the game's version of armor) and pins, and some brands are more fashionable than others. Wearing unfashionable clothes or pins results in some pretty hefty penalties; conversely, wearing the right items can confer impressive bonuses. For example, if you fight with an unfashionable pin, your attack damage is halved. If you fight with something that's hot, your attack is doubled. Each area in the gameworld's Shibuya has its own hot list that you'll need to refer to if you're to get the most out of battles. Being a fashionable young Shibuyan yourself, you can affect the trend in a given area with the clothing and pins you wear into battle, so having an initially unfashionable ensemble won't handicap you indefinitely. The World Ends With You packs a decent single-player campaign length of roughly 12 hours for the first run-through, but the game does give you a great reason to play the campaign a second time. After you first complete the game, each chapter will be available to play in any order (and with any of your previous partners), with each of the chapters now having a set list of requirements that you'll need to complete to unlock special information dossiers that unveil more about the game's backstory. This is a great way to find out more about the Reapers' Game, particularly because The World Ends With You's initial ending is vague enough that most players will want to know exactly what happened to all of the game's main characters. Multiplayer isn't forgotten, either. The World Ends With You features a minigame called Tin Pin Slammer that can be played wirelessly with up to four players. Tin Pin Slammer isn't that compelling a minigame, but there are still plenty of reasons to use wireless with The World Ends With You. Turning on the game's Mingle mode will use the DS's built-in wireless to search for other DSs, with each device found resulting in different bonuses. For example, finding another DS with wireless enabled and with a copy of The World Ends With You will let you trade cards and other items. Likewise, finding a DS with wireless enabled with any other game will net experience points for your psych pins. You even gain experience for your pins every time you turn your DS off: the longer you leave it off, the more experience gained. You'll never maximize your pin levels by not playing the game, but it's still a nice reward for taking a break once in a while. The World Ends With You looks absolutely top-notch. The presentation of The World Ends With You impresses right from the game's beginning. Graphically, the game just sparkles, and its stylized version of Shibuya pops with color and detail. Large, colorful character models with speech and thought bubbles are used for the game's many cutscenes, and the battles sport some pretty effects. There are also a wide variety of strange-looking Noise that Neku and crew will run across, ranging from insane-looking kangaroos and penguins to gigantic bats. Sound is another area in which this game excels, with enough snippets of dialogue packed in to put other DS games to shame. (One of your partners yelling ~There's a party in my mouth~ when you give him a piece of food stands out.) Of particular note is the game's soundtrack, which is made up of an eclectic mix of J-Pop, hip-hop, and rock songs that get into your head and refuse to leave. Fitting such a large mix of music on a DS cartridge is impressive enough, but having decent songs in that mix is a luxury few games have. Flawless presentation, gameplay depth, an engaging story, and innovation all add up to make The World Ends With You a worthy addition to the already-impressive pantheon of Square Enix works. There's very little to complain about in this package, which makes The World Ends With You a must-have for any DS owner needing an RPG fix. Sound any less hectic? Even with the puck-passing mechanic, fights in The World Ends With You can still be quite chaotic, with eight or more attacking you on both screens at the same time. But despite this complexity, it's a system that gets easier to use with practice. In fact, one of the greatest joys we found in the game was the dawning realization that, after a few hours, we wanted the green puck to move faster to let us chain attacks more quickly. Its an awesome feeling to have what seems so alien at the start become second nature. The only downside to what is otherwise a compelling combat system is that, though many of the pins available to Neku feature different abilities, the movements required to unleash them are in many cases too similar to provide fine control over what pin to use at a certain time. With Neku eventually able to carry six pins into battle, that means being more strategic about which pins to carry to create the most damage. This is because having two pins with the same stylus move requires you to completely use up the charge of one before being able to use the power of the next. Character models are the requisite level of Square Enix kooky. Although The World Ends With You's unique combat system is sure to initially confuse and bewilder many players, the game does allow for a gentler learning curve thanks to combat options that can be tweaked on the fly. These include varying the speed with which the game's AI will automatically take control of your partner if you get too distracted with the bottom screen, and even changing the game's difficulty between fights. The World Ends With You also lets you choose your battles, with no random fights occurring as Neku traverses through Shibuya. Instead, Neku can pick his own fights; the same pin that lets him read people's minds also alerts him to the presence of any Noise in the area. On the flip side, the game also lets you kick things up a notch at any time by lowering the level of your characters or even chaining several fights together. Players who choose to fight at a lower level than their character's current maximum (say, fighting as a level 25 when your character is actually level 30) obviously have to suffer the requisite drops in attack, defense, and health stats, but the compensation is that defeated Noise will tend to drop more lucrative items. Chaining fights together--that is, taking on consecutive groups of Noise on the same health bar--also boosts the quality and frequency of dropped items. This element of adjustable risk is a nice addition to the game, giving you the option to play it safe or live on the edge in the hope for a big payoff, or even switch between the two from encounter to encounter. You might find yourself consistently fighting five levels or so below your maximum to keep the new pins and money rolling in, money you can then spend on hundreds of items from the stores in The World Ends With You's virtual Shibuya. Just like in the real world, brands are everything in this game. Specific brands exist for each item, such as clothing (the game's version of armor) and pins, and some brands are more fashionable than others. Wearing unfashionable clothes or pins results in some pretty hefty penalties; conversely, wearing the right items can confer impressive bonuses. For example, if you fight with an unfashionable pin, your attack damage is halved. If you fight with something that's hot, your attack is doubled. Each area in the gameworld's Shibuya has its own hot list that you'll need to refer to if you're to get the most out of battles. Being a fashionable young Shibuyan yourself, you can affect the trend in a given area with the clothing and pins you wear into battle, so having an initially unfashionable ensemble won't handicap you indefinitely. The World Ends With You packs a decent single-player campaign length of roughly 12 hours for the first run-through, but the game does give you a great reason to play the campaign a second time. After you first complete the game, each chapter will be available to play in any order (and with any of your previous partners), with each of the chapters now having a set list of requirements that you'll need to complete to unlock special information dossiers that unveil more about the game's backstory. This is a great way to find out more about the Reapers' Game, particularly because The World Ends With You's initial ending is vague enough that most players will want to know exactly what happened to all of the game's main characters. Multiplayer isn't forgotten, either. The World Ends With You features a minigame called Tin Pin Slammer that can be played wirelessly with up to four players. Tin Pin Slammer isn't that compelling a minigame, but there are still plenty of reasons to use wireless with The World Ends With You. Turning on the game's Mingle mode will use the DS's built-in wireless to search for other DSs, with each device found resulting in different bonuses. For example, finding another DS with wireless enabled and with a copy of The World Ends With You will let you trade cards and other items. Likewise, finding a DS with wireless enabled with any other game will net experience points for your psych pins. You even gain experience for your pins every time you turn your DS off: the longer you leave it off, the more experience gained. You'll never maximize your pin levels by not playing the game, but it's still a nice reward for taking a break once in a while. The World Ends With You looks absolutely top-notch. The presentation of The World Ends With You impresses right from the game's beginning. Graphically, the game just sparkles, and its stylized version of Shibuya pops with color and detail. Large, colorful character models with speech and thought bubbles are used for the game's many cutscenes, and the battles sport some pretty effects. There are also a wide variety of strange-looking Noise that Neku and crew will run across, ranging from insane-looking kangaroos and penguins to gigantic bats. Sound is another area in which this game excels, with enough snippets of dialogue packed in to put other DS games to shame. (One of your partners yelling ~There's a party in my mouth~ when you give him a piece of food stands out.) Of particular note is the game's soundtrack, which is made up of an eclectic mix of J-Pop, hip-hop, and rock songs that get into your head and refuse to leave. Fitting such a large mix of music on a DS cartridge is impressive enough, but having decent songs in that mix is a luxury few games have. Flawless presentation, gameplay depth, an engaging story, and innovation all add up to make The World Ends With You a worthy addition to the already-impressive pantheon of Square Enix works. There's very little to complain about in this package, which makes The World Ends With You a must-have for any DS owner needing an RPG fix."}