{"ref": "https://www.gamespot.com/reviews/delta-force-black-hawk-down-team-sabre-review/1900-6086927/", "date": "January 23, 2004", "game_name": "Delta Force: Black Hawk Down", "text": "If it were a movie, Delta Force - Black Hawk Down: Team Sabre would be a Jerry Bruckheimer production. Of course, the movie that Team Sabre is based on was a Bruckheimer production, but this expansion pack has more in common with Bruckheimer's wildly over-the-top Bad Boys II than with the grittily authentic Black Hawk Down. Team Sabre may not be realistic, but it's packed with explosions, wild gunfights, and quite a bit of fun--though it's also extremely frustrating at times, due to a limited save system coupled with some excruciatingly difficult gameplay. A Black Hawk swoops low to provide support. You have to neutralize enemy RPG gunners or they'll shoot it down. Having exhausted the Somalia setting of Black Hawk Down in the original game, NovaLogic splits the 11 missions in Team Sabre between fighting Colombian drug lords and defeating a rogue Iranian general. In total, these missions should take most players 15 hours or so to complete. Like the original game, the expansion offers a wide variety of mission objectives, like rescuing hostages on an oil platform, blowing up drug boats, seizing an Iranian airfield, and saving the crew of the occasional downed Black Hawk helicopter. There's little room for subtlety or stealth in these missions; when you get down to it, everything basically devolves into shooting and blowing up virtually everything you see. To say that things explode gloriously in this game would be an understatement. Team Sabre looks and sounds about as good as Black Hawk Down did last year--so it's still looking and sounding pretty good. However, in Team Sabre, vehicles blow up spectacularly; chassis fly up, bodies fly out, and burning tires arc across the screen, all with convincingly loud and dramatic explosions. Even armored personnel carriers burst into flame after you shoot them with your M16. It's certainly exaggerated, but everything is consistently over-the-top. In the midst of all this mayhem, Team Sabre really does convey the chaotic mess of modern-day combat. Enemy infantry charge at you, rocket-propelled grenades streak by your head, technicals (pickup trucks with machine guns mounted on them) race by, and Black Hawk helicopters fly past on strafing runs. At its very best, Team Sabre makes you feel like all hell is breaking loose around you. The expansion's best moments involve desperate, Alamo-like last stands, frantic convoy runs through enemy territory, or urban combat on the narrow streets and alleyways of an Iranian town. But there are also times when the game becomes insanely difficult. The single-player game consists of six Iranian levels and five Colombian levels; the Iranian levels are reasonably challenging, but the Colombian maps border on being unfair--they may even remind you of the infamous Sniper Town map in Medal of Honor Allied Assault, in which you could get picked off by enemies if you made even the slightest mistake. Since all the missions are heavily scripted, the game's pace often slows to a crawl as you figure out exactly when and where your enemies will appear. The Colombian jungle missions are particularly tedious; the thick foliage and the steep hills serve to hide snipers and RPG gunners until it's too late, turning the game into an exercise in trial and error, where you have to load and reload your last saved games until you memorize the locations of all the hostiles. Unfortunately, you have only a limited number of save-game slots, so you have to carefully ration them out, and you may find yourself constantly replaying a certain section until you get it right. Even if you do everything perfectly, in some missions, especially the Colombian ones, you may still lose because your dumb teammates, or the dumb hostage you were escorting to safety, didn't know how to duck when enemy fire was incoming. Or, you'll take a hit from an insanely accurate rocket-propelled grenade from out of nowhere--and this is all on the easiest difficulty setting--or, on occasion, the game will even crash. A technical explodes gloriously into flames after taking only a few shots from an M4 carbine. Though it adds 11 new levels, Team Sabre adds only three new weapons and a few new vehicles. The box claims that you can even play as a member of Britain's elite SAS, but that's only for one mission. You can, however, play as an SAS operative in multiplayer. There are five new multiplayer environments in the expansion, most of them drawn from the single-player campaign. Online play is where Team Sabre breaks out of the frustrating scripted sequences of the campaign. It's not much different from the multiplayer in the original game, but like the original game's multiplayer, Team Sabre's multiplayer is fast, furious, and unforgiving, and it emphasizes the need to use proper team tactics. With human teammates, you really do get the sense of being a member of a highly coordinated fighting team, especially as you maneuver down narrow alleyways covering each other. The $20 expansion has some stability problems in a few missions, but it's otherwise quite stable, as is multiplayer play. Team Sabre will obviously appeal to Black Hawk Down fans looking for new multiplayer content, but if you were frustrated with the gameplay in the original, then you'll probably want to steer clear of Team Sabre. Then again, if you haven't played Black Hawk Down before (the expansion requires the original game to play) and you're looking for a fun run-and-gun experience, and you're willing to put up with some real frustration in some of the missions, you may want to give Team Sabre a try."}