{"ref": "https://www.gamespot.com/reviews/whispering-willows-review/1900-6416180/", "date": "July 6, 2015", "game_name": "Whispering Willows", "text": "Whispering Willows is an adventure in archaeology with a supernatural perk: it lets you speak to the dead people who once owned the artifacts you discover. It twists the haunted house investigation premise by giving its heroine ghost transformational powers. This adequately serves both the narrative and the gameplay, the latter comprising some of the most simplistic and easy exploration puzzles in recent memory. This is a minimal detriment to the game overall, which is well-supported with touching themes of regret, lost love, and one's spiritual connection to nature.Protagonist Elena Elkhorn isn't above admiring the opulence of the Willows Estate, the game's setting. She is not a classic heroine, pre-destined for great things or exuding a profound sense of self. She simply wants to find her missing father, who is employed as a caretaker on the estate. Clearly an adolescent with a good heart, Elena's amiable interactions with many of the local spirits please her immensely, especially since they're helpful companions on this dark and grim journey. Like some of the ghosts in The Sixth Sense, Elena's spectral aides are in desperate need of closure. And yes, some of them don't know that they're dead. Every soul Elena successfully assists gives her immense solace. Yet as each ghost departs its state of purgatory, she suffers the loss of each brief friendship. As a teenager with metaphysical powers and few friends, Elena is relatable to Maxine Caulfield from Life is Strange.Elena alters herself into an apparition with the aid of a spiritually loaded tear-shaped amulet. The practicality of this transformation is akin to Dracula turning into a rat who can travel through ventilation ducts in Castlevania: Lords of Shadow 2. A vent in Whispering Willows almost always leads to a key item or a switch that only the ghostly version of Elena can access. As she is a protagonist of Native American descent, this ability adds mild depth to the narrative and gameplay. It's her means of speaking to the estate's ghosts who remain in limbo and an opportunity for her to learn about the nation who first settled on the land, the Kwantako tribe.Whispering Willows' adherence to the basic adventure game blueprint is so faithful that it lacks any sense of ingenuity. Tasks almost always involve finding a proverbial or literal key to open a proverbial or literal door. In Whispering Willows, it's a knife to cut vines or a love letter to appease a ghost. The estate boasts a greenhouse, an observatory, a garden maze, and a mansion, but many of these locales are initially inaccessible. There are almost always multiple paths to choose from, but figuring out the mainline route takes little to no time. Anyone who's explored a dungeon understands the deduction game of first picking the path that will lead to a dead end. In classic mansion game design, bathrooms are almost always dead ends and corridors with stairs and ladders are often the mainline path. Puzzles are seldom cryptic and clues to solve those riddles are often just a few paces away. There's never any ambiguity and you're never in a situation where you have to think obtusely like in so many similar adventure games. Whispering Willows serves as a reminder that not all adventures need to tease the brain.This makes for a predictable and predominantly linear playthrough, but it's seldom boring in Whispering Willows. Between the artifacts and notes that litter the estate, Elena learns about the land of her Native American ancestors and the settlers from the east who spilled blood in order to take over the territory. These documents are filled with pangs of regret from the carelessness of ambition, the trauma from killing under orders, and the varied emotions of maintaining a secret affair. These notes are no different from the optional collectibles found in other games, but given the limited exposition in Whispering Willows, they become all the more poignant. It's also probably that you will find all the notes on your first playthrough, making a return adventure all the less likely. Whispering Willows makes a positive case for the sparseness of scares. There are very few hostiles in and around the mansion, which heightens the impact of their sudden appearances. The mere sight of a demon head relief sculpture can raise the suspicion that a real demon is nearby. It's a nod to The Exorcist in the same way that a scene in a well echoes The Ring. Terrors can come from the ceiling or the walls; they're not approaching you continuously like Medusa heads from Castlevania. These few scares effectively break up the sense of routine as you item hunt and explore the Willows estate. Last, there's a handful of disturbing images that can only be seen when Elena turns into a ghost. One haunting example is a portrait where the unsuspecting subject is surrounded by demonic hands. It stands out because none of the other paintings in the estate changes when switching to the spectral plane.Like some of the ghosts in The Sixth Sense, Elena's spectral aides are in desperate need of closure.It is a minor miracle that Whispering Willows can induce the occasional bout of goosebumps. The crudely drawn cutscenes that frame the story leave a disconcerting first impression. At least this low-budget introduction is brief, transitioning to gameplay where the hand-drawn animation of Elena is well-conceived. The background art is even more effective, capturing the weathered nature of the wallpaper and antique furniture, which are accentuated by the dim lighting. This makes for a persistently spooky playthrough.Whispering Willows' reliance on the classic ~Don't go in the barn~ horror trope--the same premise of Alien: Isolation--speaks to the game's pervasive simplicity. For a game with few challenges, appreciating Whispering Willows means embracing the role of a tourist exploring this storied manor. While there are shades of Gone Home, the items in Whispering Willows aren't as loaded with meaning. Objects primarily serve as keys, figurative or otherwise, to the game's many barriers. Its history is more literal, found in the revealing notes left by the ghosts and Elena's own heartfelt diary. If you were to treat this as part of a weekend meal of horror games in old houses, Whispering Willows would be the amuse-bouche, White Night would be the appetizer, and Fatal Frame the entre. That would make Luigi's Mansion the dessert."}