{"ref": "https://www.gamespot.com/reviews/inscryption-review-house-of-cards/1900-6417788/", "date": "November 15, 2021", "game_name": "Inscryption", "text": "Inscryption is an outstanding deck-building card game--until it isn't. At around the halfway mark, the compelling, run-based structure of its core card battles and the intriguingly sinister atmosphere both transform into less interesting versions of themselves. In a sense, Inscryption falls victim to its own hype. So strong are its opening moves that you can't shake the disappointment that much of what follows is merely quite good.The basics don't change. Throughout, Inscryption pits you against AI opponents in a series of card battles. Individual cards have attack and defense ratings and, often, a special ability. You play them, one at a time, into a slot on your row of the arena. Each turn, your played cards will either attack the opponent's played cards or, if the slot opposite is empty, land a direct hit on the opponent themselves, scoring for each point of damage inflicted. Battles are resolved when you or your opponent gain a five-point advantage in damage over the other, a state typically met within a handful of minutes.The core card combat is solid. But what sets it apart from countless other similar deck-builders is how those basic card mechanics are recontextualized across three formats. As you progress through the three distinct acts of its story, Inscryption stops each time to overhaul its card battle system. In doing so, it's able to thoroughly explore different aspects and possible permutations of those basic mechanics. Such tweaks to the rules deliver new challenges that remain interesting, even if they're not an improvement. While the reconfigurations of Acts 2 and 3 over the back half of the game carry plenty of merit, the first iteration you encounter in Act 1 is ultimately the best.The rogue-lite structure of Act 1 lends itself better to the card-battling format, in particular the way its cyclical nature lets you gradually learn how to play without feeling bogged down by repetition. Each run takes place across a map of little branching paths, eventually leading to a boss, and along the way you'll card-battle a handful of enemies and make a few choices about how to improve your deck. Die while fighting a regular enemy and you'll get a second chance. Die while fighting a boss and the run is over, kicking you back to the start and removing the cards you'd gathered for your deck during the last run. By the time you're skillful enough to be making it to the final boss, each run is lasting a mere 20-30 minutes. The turn-around is pretty swift and, while it can be frustrating when the luck of the draw means you didn't get the card you wanted at a critical moment, the minimal time investment means it's easy to shrug off failure and jump straight into a new run. Failure is even incentivized with the Death Card system. Die on a run and you get the chance to create a new card that draws upon the stats and abilities of some of the cards you collected along the way and becomes a permanent addition to your deck. There's plenty of luck involved. Sometimes you simply won't draw the cards you really want and your Death Card for that run turns out pretty useless. But on occasion, when luck is shining, you'll end up crafting something ridiculously overpowered. Regardless, the suspense is always there to discover what new card you can create, and if it turns out to be a good one, excitement soon follows at the prospect of drawing it on your next run.The branching structure of a run presents meaningful choices, too. Between fights, if you take the left path, you might be able to draw a new card from your deck, but if you take the right path, you might instead be able to add an ability to an existing card in your hand. One of the most interesting of these choices arrives at a campfire where you can opt to increase the attack or defense of one card, but each time you choose to draw upon the fire's power, you run a greater risk of losing the card entirely. Other stops see you collecting boons that confer powerful bonuses to all your cards or trading for very useful one-shot items.While there's some luck with the exact layout of the map, you always know what's awaiting you at each stop, informing your choices and empowering you to devise a strategy for each run. It's so satisfying to be able to decide on an objective for a run--for example, this time I'm going to stop at all the campfires and buff this one card in order to hopefully get the chance to use it for my Death Card at the end of this run--and then execute it as intended, and with the mercy of RNG. The format and structure of Act 1 caters to this sort of strategic thinking in a far more elegant manner than either of the following Acts.Act 2 suffers from overloading you with too many choices and dropping the run-based structure. Instead of collecting cards from your deck over the course of a run, as in Act 1, here you find or purchase new cards between fights and are able to prepare a loadout to take into each battle. While I'm sure some players will enjoy this more traditional deck-building aspect and embrace sorting through dozens of cards to fine-tune the perfect hand to tackle their next opponent, I found its sudden introduction overwhelming.Exacerbating the situation, while some cards function similarly to those found in Act 1, many new ones are introduced, and you're left to make too many decisions about things you don't yet understand. Paralyzed by choice, I found myself hitting the auto-sort button every time and letting the game select a loadout for me. The connection felt in Act 1, of ownership over a deck populated by cards that you've had a hand in crafting, disappears.Worse, the point of a deck-builder is undercut when it doesn't seem to matter which cards are taken into a fight. At least, I didn't face a fight in the second act where I was wishing I had a specific type of card or felt like I had to rethink my approach and return with a different deck. I was always able to brute-force through with what I had. Individual fights still offer tactical meat, but because they stand alone, there's little of the connective tissue that the run-based structure of Act 1 provides. The greater strategic depth, afforded by having to plan ahead to determine how to best improve your hand, is lost.Act 3 offers the welcome return of some of the Rogue-like aspects of the first act, but repurposes them to less interesting effect. The fixed layout of the map ventures more into Souls-like territory, where you're running back to where you died to recover the currency you dropped and repeating the same encounters along the way. There are still opportunities to improve your cards, but you're not making the same strategic choices about growing your deck as you were in Act 1.The prescribed encounters lend more of a puzzle feel to each battle, which stands in disappointing contrast to the tactical improvisation required to meet Act 1's more randomized encounters. This puzzle feel also heightens the frustration of losing a battle because the RNG didn't serve you up the powerful card you wanted. When RNG fails you in Act 1, you chalk it up to bad luck and move on to a new set of challenges. In Act 3, you've got to re-enter the same ring and hope luck is on your side this time; it's infuriating when it isn't.Linked by a quirky meta-narrative, each act brings a stark shift in presentation. The first and third acts both adopt a diegetic framing for the card-battles, situating you in the room where the act is taking place. You're looking down at the board from a first-person perspective, able to turn to the side to check the score or look up and see your opponent. Immediately, it raises the stakes of each encounter. An early revelation is the ability to stand up and move around the room, accompanied by the startling realization that there's more going on here than just a mere game of cards.Again, it's the first act that proves the highlight. Inside a frontier-styled wood cabin with impossibly dark shadows obscuring all but the eyes of your opponent, a door you cannot open, and shelves arranged with a gothic ephemera, it feels like you're fighting for your life at the end of the world. It's deeply weird and unsettling and evocative of the kind of imminent doom that encapsulates all run-based games.Unfortunately, the following acts pale in comparison. While initially arresting, Act 2's drastic cut to an 8-bit era RPG falls flat. Act 3 returns to the first-person perspective, but in a more generic environment. Neither captures the same creeping sense of dread that permeates Act 1, nor do they succeed in conveying the same feeling that some real weird shit is about to go down. It's not that they're bad, as such; it's more that, in a clear demonstration of the power of thematic context, Act 1 sets a bar that the other acts can't reach.And that really is Inscryption in a nutshell. The first act is just brilliant. Not only is the core card game at its best, but it's also where those mechanics are best served by the richly atmospheric trappings surrounding them. The following two acts admirably offer new twists on the mechanics and a different perspective on the narrative, but neither prove as satisfying as the original. Alone, Act 1 is one of the best games of the year, but everything that comes after drags it back into the pack."}