{"ref": "https://www.gamespot.com/reviews/crash-commando-review/1900-6203147/", "date": "January 13, 2009", "game_name": "Crash Commando", "text": "With its arcade sensibilities, Crash Commando turns the toils of red-versus-blue battle into endearing action by juxtaposing the fast-paced carnage of Unreal Tournament with the platforming and precision aiming of Worms. As a small-statured soldier, you'll use a wide array of abilities, sharp weaponry, and your trusty ol' jetpack to do your part in a chaotic war. With plenty of in-game extras to keep the hectic fun fresh, the 2D battlefield is your personal playground. Is there anything more satisfying than an exploding enemy? Watch out for the gibs! In the war between the Grunts and Jarheads, your trooper's expected lifespan isn't more than a couple of minutes, so you'll find yourself throwing caution to the wind as you attack the enemy with reckless abandon. With your jetpack strapped tightly to your back, you'll freely zip up and around the massive levels as you blast the bad guys into bloody bits. Thanks to a short respawn timer, you'll be hurled back into the action within seconds. This keeps the flow of the side-scrolling fight moving at a consistently quick clip. In this short period between deaths, you're able to mix up your weapons. If the shotgun isn't your kind of boom-stick, switching to the sniper rifle or rocket launcher offers a worthwhile alternative way to kill. Each weapon is beautifully balanced, offering varying power as well as extra perks. The standard shotgun slugs spread, and the machine gun's rounds are rapid, whereas the sniper rifle has a helpful laser sight and quick single shot. If you want to get a bit exotic, both the rocket and grenade launcher add splash damage, and the CAB weapon can alternately heal teammates and harm enemies, depending on whom the glowing beam is pointed at. Despite the lack of classes, the mix lets you play a specific role if your team is in need of an explosives expert or makeshift medic, giving an element of depth to the otherwise straightforward shooter action. Crash Commando makes aiming with the right stick and shooting with R1 easily accessible. The complexity swells from the chaos of fighting foes with quick trigger fingers, as well as managing your jetpack's constantly depleting/refilling fuel. This is essential for an evasive maneuver such as the boost-propelled somersault, or launching through vertical pathways to make a surreptitious strike from below. However, your arsenal isn't limited to the six stock guns. If you're quick enough to pick up the ammo-limited superweapons that periodically pop up throughout your deathmatch, team game, or objective-based round, you'll be able to dish out swift destruction with the powerful, rapid-fire plasma rifle or chaingun. Loading up on grenades, mines, and remote-detonated C4 explosives lets you play an offensive, defensive, or strategic role, respectively. If you're in the mood to take a break from your jetpack, there are fun alternatives to chucking frags and shooting shotguns; you can hop into the seat of a stationary turret and shoot enemies from a first-person perspective, or launch a remote-controlled rocket from within a bunker to unleash unparalleled damage with a massive blast radius. If you're looking for an entirely new change of pace, it's worth your while to take a spin in the speedy truck, or launch lethal cannon shells from the slow, heavily armored tank. Both vehicles add to the variety of Crash Commando, and though they tip the scales in your favor, there is a catch. The rides can use a jetpack-like boost that lets you carry them to new platforms and paths, but they're grounded when attached to the roller-coaster-like rails that span most of the map. It's hard not to be impressed by the lushly colored foliage and expressively detailed, industrial-themed stages, but it's Crash Commando's great level design that sticks out the most. The eight multiplayer maps are brilliantly crafted with variations of open, enclosed, vertical, and horizontal layouts, each with its fair share of vantage points, nooks, crannies, and cover. Better yet, dual layers give you access to two entirely unique stages to battle on, each with well-placed armor pick-ups, ammo, and med packs. If a cramped indoor area is devoid of enemy activity, pressing the X button at the appropriate tunnel immediately sends you to the wide-open world outside, and vice versa. Matches often span both layers, and being able to see soldiers trading gunfire on the opposite side is a great touch. As a result, Crash Commando is a large-scale game with an acute focus and relentless pace. With so many ways to crush the opposition, you'd think that there would be an influx of enhancements to accompany your earned experience points. The noticeable lack of progression in Crash Commando is what hurts it the most. Your rank increases as you play, but the only reward for advancing is the odd trophy, and it seems fruitless to try to increase your level when there aren't many in-game benefits. Fortunately, Crash Commando isn't totally devoid of incentive. In exchange for surviving or pulling off crash combos (double, triple, or multikills), you're given the option to attach one of three survival bonuses to yourself: increased speed, regenerating health, or a deadly jetpack-propelled attack. Simultaneously equipping all three requires a lot of work, especially because dying resets them, but the payoff is proportional. Vehicles tilt the scales in your favor, but they're relatively easy to destroy. It's the massive amount of variety rather than character development that keeps the game constantly entertaining. Sadly, Crash Commando shares a glaring flaw with the similarly structured 2007 Xbox Live Arcade game, Undertow: The 2D side-scrolling shooters both feature equally unfulfilling single-player campaigns that pale in comparison to the wildly entertaining online multiplayer. As intended, the solo-only boot camp is a great way to get a grip on how the game works, but beyond that, there's no reason to revisit the embarrassingly easy and shockingly short campaign. The limited custom games are needlessly neglected, given that the tactics-focused objective mode isn't available offline. The fantastic multiplayer, however, offers a more gratifying challenge to the traditional game modes than the lame solo stuff. Stealing data from computers in the Capture the Flag-esque Espionage mode is as intensely frenzied as planting bombs on enemy control panels during Sabotage, and the standard team and free-for-all Deathmatch makes for brazenly fun bouts. Without noticeable latency issues in full 12-player rooms, or crippling frame-rate slowdown when the screen fills up with explosions, online multiplayer is silky smooth and enjoyable to boot. In spite of its lack of originality, the game's borrowing of genre tropes and facets lends well to an evolved form of the familiar, giving this 2D shooter some cool hooks to sink into its audience. The online options are the real focus, offering frenetic twitch gameplay with a bit of depth. At $10, eight maps doesn't sound like a lot, but the large scale, fantastic layouts, and dual areas make everything feel fresh no matter which game mode you're playing. Although the single-player mode is a complete dud, the diverse array of balanced weapons, vehicles, power-ups, lightning-quick gameplay, and colossal maps gives Crash Commando a long pair of legs to keep the frantically fun multiplayer running for a long time."}