{"ref": "https://www.gamespot.com/reviews/lupin-the-third-treasure-of-the-sorceror-king-revi/1900-6089523/", "date": "February 18, 2004", "game_name": "Lupin the 3rd: Treasure of the Sorcerer King", "text": "Though companies have been producing games based on various forms of the Lupin the Third anime series for many years now, Bandai and Banpresto's Lupin the Third: Treasure of the Sorcerer King is the first console-based Lupin game to garner a US release, which is most likely due to the popularity of the Lupin TV series' recent run on the Cartoon Network's Adult Swim block. Treasure of the Sorcerer King is primarily a stealth action game, and it draws numerous influences from popular stealth games, such as Metal Gear Solid. Beyond a similar use of lengthy cutscenes, simple inspiration is pretty much where the comparisons between the two games end. In fact, there's really not very much to praise about Lupin the Third, due in no small part to some rather badly implemented enemy artificial intelligence, an equally unfortunate control scheme, and some generally lacking production values. Lupin and his posse make a rather inauspicious debut on US gaming platforms in Treasure of the Sorcerer King. If you're unfamiliar with the series, Lupin the Third refers to the show's title character, a world renowned thief and master of disguise who engages in frequent misadventures with his ragtag crew, while concordantly trying to outwit his less-than-astute law enforcement nemesis, Inspector Zenigata. In Treasure of the Sorcerer King, you primarily play as Lupin, though you also have the occasional chance to play as other members of Lupin's posse, including his right-hand man Daisuke Jigen and master swordsman Goemon Ishikawa. Lupin regular Fujiko Mine, the ever-tantalizing half-thief, half-spy also makes an appearance as well. The actual story of the game has Lupin and crew tracking a pair of valuable pitchers, which will ultimately lead them to a massive fortune that's buried within an ancient castle. The plot itself sticks pretty faithfully to the style of the anime series and ultimately does it justice. This, unfortunately, is about the only real positive aspect to Treasure of the Sorcerer King. As said before, Lupin the Third is primarily based on stealth action--and a pretty generic variety of it as well. Since Lupin is a master of disguise, a big part of the gameplay revolves around Lupin dressing up in various costumes, which range from that of a simple police officer to Inspector Zenigata himself. However, the costume itself is far from enough to convince most of the game's patrolling enemies. To avoid suspicion, you will frequently have to use the R1 button to perform a specific action, like executing a policeman's salute, to stave off discovery. Unfortunately, even this often isn't enough to keep enemies from discovering you, thanks to a somewhat strange and awkward meter that tracks Lupin's mind state. If an enemy comes too close to discovering Lupin's identity, or, in fact, he is discovered, Lupin's mind becomes ~disrupted,~ thus leaving him even more open to discovery until he goes to cool off for a while. However, he can't cool off while he's in costume, which means that you'll have to go back to Lupin's regular outfit during this time. Fortunately, Lupin can hide himself behind and within certain objects, and doing so does manage to keep you concealed for as long as you need. While all of this might sound a little difficult, it actually isn't. This is mostly due to some pretty lackluster enemy AI. Regardless of their uncanny abilities to discover Lupin, no matter how disguised he is, enemies are as dumb as dumb can be. They'll pretty much just rush at your character while swinging their clubs or shooting their guns, so a simple dodge move will pretty much keep you from getting hit in nearly every situation, even when multiple enemies are attacking. Additionally, your character's combat techniques are insanely rudimentary--or, at least, they would be if it weren't for the awful control scheme. Lupin can use weapons that range from his trusty .38 pistol to a frying pan, and hitting an enemy with any of them is as simple as facing him in the right direction, hitting R1 to bust out your weapon and square to fire. Annoyingly, you can't use any weapons while in disguise. If it weren't for the multiple button presses and the fact that you have to press yet another button to change outfits before you can even arm a weapon, there wouldn't be any challenge at all to the game's combat, thus making its stealth element completely meaningless. To be quite frank, the challenge that is derived from these components is more obnoxious than anything else. However, regardless of these issues, Lupin's gameplay isn't all bad. When not engaging in lackluster combat or lame stealth, you'll also spend a fair portion of the game solving puzzles. Most of these are fairly simple puzzles that require you to decipher a key code by using vague information found on a piece of paper, or they'll require you to figure out a pattern of actions needed to unlock a door. Despite their simplicity, they're actually fairly well done. What isn't quite as well done, unfortunately, is the underlying game design associated with the puzzles. Finding the information needed to figure out the puzzles requires a hefty amount of exploration, and it also involves a fair amount of backtracking. Plus, there's absolutely no ability to do anything until you've solved the puzzle in front of you, which essentially leaves you in a lot of situations where you'll have to wander around these labyrinthine areas while searching room after room for that one clue that will let you move on--and will ultimately save your sanity. Though its gameplay mechanics are deeply flawed, the game can be praised for doing justice to the Lupin anime series. Though Lupin manages to capture the atmosphere and style of the anime series pretty accurately, the game itself doesn't look particularly good. The models for the main characters all look nicely done, though the pair of new, original characters that debuts in Treasure of the Sorcerer King--Teresa Faust and Theodore Hannewald--doesn't look nearly as well designed. Nothing in the game has much in the way of animation variety, and for the most part, everybody and everything in the game moves rather stiffly. The game features a decent roster of locales to explore, but most of them end up using many of the same set pieces and textures again and again, essentially robbing them of any sort of variety. The best visual asset the game has to offer is its CG cutscenes, which are well produced and also happen to feature some pretty good voice acting from the cast of the TV show. Some of these cutscenes aren't especially well edited, and they often tend to go on for too long, but the quality of the voice acting and CG animation definitely helps. Most everything else in Lupin sounds good as well, including a nicely atmospheric soundtrack that complements the various environments and some wacky--though authentic--sound effects. Like many games based on popular licenses, Lupin the Third simply doesn't hold up when you break down its abilities as an actual game. Its ludicrous controls, mostly unnecessary stealth mechanics, and flawed structuring greatly hinder whatever gameplay experience there is to be had, and barring any serious hang-ups, most anyone should be able to complete the game in five to six hours tops, further preventing Lupin from being a recommendable purchase at its full retail price tag. If there is any silver lining to be found, it's that serious fans of the Lupin franchise will likely be able to forgive some of these problems and will appreciate the game's legitimate effort at authenticity toward its source material. However, even fans of the series will still be better off renting Lupin the Third rather than giving it a full purchase."}