{"ref": "https://www.gamespot.com/reviews/lethal-skies-ii-review/1900-6074530/", "date": "September 9, 2003", "game_name": "Lethal Skies II", "text": "Last year, Japanese developer Asmik Ace decided to challenge the supremacy of Namco's virtually impeccable combat flight simulator, Ace Combat 04, with its own combat flight sim, Lethal Skies. Ultimately, though, it just didn't stack up. Now, the developer has completed work on a sequel, Lethal Skies II. While this new game also doesn't stand up to Namco's efforts in the field, Lethal Skies II still stands as a high-quality, accessible combat flight sim in its own right. Lethal Skies II delivers realism within reason, placing almost equal importance on making the game easy to pick up and play. Lethal Skies II picks up shortly after the first Lethal Skies, though the story it tells is roughly the same. In the year 20XX, two major military factions are battling for world domination, and you are an anonymous, but highly skilled, pilot fighting on the front lines. The story, which unfolds through a series of pre-mission briefings, is told in a dry, matter-of-fact tone. It focuses heavily on shifting international political alliances, which adds a certain weight to the proceedings. Asmik's use of a near-future setting is clever and effective--it lets the designers play with political strife on a global scale without implicating, and thus offending, any actual nationalities. It also justifies the presence of both fictional and real-world military hardware. For the most part, you'll be piloting modern military aircraft, including flight combat standards like the F-16, the MiG29, and the A-10, as well as several experimental ~black ops~ craft. All told, there are 19 different planes in Lethal Skies II, though, like in the flight combat games before it, you're gradually granted access to them as you progress through the game. Instead of aiming for the grinding realism of the flight simulators that dominate the PC market, the gameplay in Lethal Skies II delivers realism within reason, placing almost equal importance on making the game easy to pick up and play. The top shoulder buttons are used for throttle and air brakes, and they make use of the analog nature of the Dual Shock 2's buttons to give you some finesse. The trade-off here is that you have to mash down real, real hard if you want full throttle or, on certain planes, if you want the afterburner to kick in. The bottom shoulder buttons control the rudders, helping you turn the craft without having to put it sideways first. The face buttons give you control over your main guns and your missiles, and they allow you to cycle through munitions and lock on targets. If you happen to find yourself being stalked by a locked-on missile, you can launch chaff to hinder it by pushing in on the left analog stick. With the left analog stick otherwise acting as your control stick, the D pad is free for issuing commands to your wingmen. These commands are extremely limited yet are still very useful in getting the most out of your wingmen, who will act immediately--and rather skillfully--on your orders. Though virtually every single button on the controller is used, the basic controls are easy to get the hang of, and enough automation is implemented to keep the secondary functions working on their own--until you figure out how to use them yourself. Before you jump into a mission, you're briefed as to your objectives and presented with rough 3D mockups of the theater that highlight specific objectives, enemy craft positions, and so on. You often have the option of changing aircraft, available wingmen and their aircraft, and craft armaments and ordinance. Obsessive-compulsive types can do some decent tweaking here. Though, if you're not so inclined, going with default munitions and default pilots rarely hinders you too much. Generally speaking, the objectives are varied, fun, and, most importantly, challenging. The objectives themselves run the full gamut. There's straight dogfighting, air-to-ground combat, defensive missions, and missions where you'll be performing all of the above. Though some missions feel a bit contrived, these are a rarity, and, generally speaking, the objectives are varied, fun, and, most importantly, challenging. Alongside the single-player campaign, Lethal Skies II offers some multiplayer modes, a straight one-on-one dogfighting mode, a mode where each player attempts to shoot down as many enemy jets as possible, and a mode where you have to navigate a tight, winding canyon. All three of these modes can be played split-screen, or, if you're truly committed to the game, with the PlayStation 2 i.Link. The multiplayer is a cool addition that works pretty well. From a graphical perspective, Lethal Skies II is an incremental improvement over its predecessor. The aircraft are obviously where Asmik spends the majority of the PlayStation 2's power, as the aircraft feature an almost meticulous level of detail. The aircraft come complete with moving wings, ailerons, and rudders. There is evident heat wash from engines, visible vapor trails from wingtips when appropriate speeds are reached, and noticeable battle damage. Though some ground textures appear flat and blurry, upon close inspection, the environments are generally big, believable, and varied, and they are occasionally married with some decent weather effects--though the weather rarely affects more than your visibility. The only real complaints that can be lodged against the graphics in Lethal Skies II are that the models are a little jaggy and that some of the explosions look kind of flat and fake, and this can cause some choppiness in the frame rate when witnessed from a close proximity. From the initial whine as you begin takeoff, to the full-bore scream as you cut through the sky, each plane has a distinct sound. The in-game graphics look good overall, but where Lethal Skies II really distinguishes itself is in its presentation. Menus are flashy and dynamic, with lots of movement and bold designs, lending the game some serious arcade flavor. The prerendered cutscenes are also quite astonishing, not so much for their technical aptitude but for the wholly unique style in which they are rendered. Though everything is realistically proportioned, the textures have a hand-painted look to them that makes the cutscenes look like WWII battle paintings that have come to life. The effect is truly a breathtaking one. When attempting to cobble together a passably realistic world composed of polygons and particle effects, sound is important in sustaining that illusion--and Asmik obviously recognizes this. From the initial whine as you begin takeoff, to the full-bore scream as you cut through the sky, each plane has a distinct sound. Comments from your wingmen and opposing forces come through in an appropriately crackly, tinny sound--though the number of phrases at their disposal is limited. Various beeps, buzzers, and alarms help further immerse you in the cockpit of your aircraft. Though there's little music readily associated with flight combat, save for Kenny Loggins' ~Danger Zone,~ Lethal Skies creates a cohesive soundtrack that alternates between jangley, blues-infused rock and full-on, ax-wailing metal. Where the game really differentiates itself from its predecessor is in its presentation. From top to bottom, Lethal Skies II is a well-crafted, entirely satisfactory arcade-style flight combat game--much like its predecessor. In fact, Lethal Skies II is so much like its predecessor, in so many significant ways, it's largely the same game. If you're new to the series or to flight combat, or you just couldn't get enough of the original Lethal Skies, you should be able to jump into Lethal Skies II, no questions asked. However, if Lethal Skies left you wanting more, it's worth approaching this sequel with a bit of caution. From a graphical perspective, Lethal Skies II is an incremental improvement over its predecessor. The aircraft are obviously where Asmik spends the majority of the PlayStation 2's power, as the aircraft feature an almost meticulous level of detail. The aircraft come complete with moving wings, ailerons, and rudders. There is evident heat wash from engines, visible vapor trails from wingtips when appropriate speeds are reached, and noticeable battle damage. Though some ground textures appear flat and blurry, upon close inspection, the environments are generally big, believable, and varied, and they are occasionally married with some decent weather effects--though the weather rarely affects more than your visibility. The only real complaints that can be lodged against the graphics in Lethal Skies II are that the models are a little jaggy and that some of the explosions look kind of flat and fake, and this can cause some choppiness in the frame rate when witnessed from a close proximity. From the initial whine as you begin takeoff, to the full-bore scream as you cut through the sky, each plane has a distinct sound. The in-game graphics look good overall, but where Lethal Skies II really distinguishes itself is in its presentation. Menus are flashy and dynamic, with lots of movement and bold designs, lending the game some serious arcade flavor. The prerendered cutscenes are also quite astonishing, not so much for their technical aptitude but for the wholly unique style in which they are rendered. Though everything is realistically proportioned, the textures have a hand-painted look to them that makes the cutscenes look like WWII battle paintings that have come to life. The effect is truly a breathtaking one. When attempting to cobble together a passably realistic world composed of polygons and particle effects, sound is important in sustaining that illusion--and Asmik obviously recognizes this. From the initial whine as you begin takeoff, to the full-bore scream as you cut through the sky, each plane has a distinct sound. Comments from your wingmen and opposing forces come through in an appropriately crackly, tinny sound--though the number of phrases at their disposal is limited. Various beeps, buzzers, and alarms help further immerse you in the cockpit of your aircraft. Though there's little music readily associated with flight combat, save for Kenny Loggins' ~Danger Zone,~ Lethal Skies creates a cohesive soundtrack that alternates between jangley, blues-infused rock and full-on, ax-wailing metal. Where the game really differentiates itself from its predecessor is in its presentation. From top to bottom, Lethal Skies II is a well-crafted, entirely satisfactory arcade-style flight combat game--much like its predecessor. In fact, Lethal Skies II is so much like its predecessor, in so many significant ways, it's largely the same game. If you're new to the series or to flight combat, or you just couldn't get enough of the original Lethal Skies, you should be able to jump into Lethal Skies II, no questions asked. However, if Lethal Skies left you wanting more, it's worth approaching this sequel with a bit of caution."}