{"ref": "https://www.gamespot.com/reviews/return-to-castle-wolfenstein-tides-of-war-review/1900-6026630/", "date": "May 9, 2003", "game_name": "Return to Castle Wolfenstein", "text": "The name Wolfenstein conjures up a lot of memories for a lot of people. The older set will probably remember the classic computer games Castle Wolfenstein and Beyond Castle Wolfenstein, which set you up as a prisoner of war in a castle the Nazis were using as a prison. But more people will remember Wolfenstein 3D, the id Software game that launched the first-person shooter genre. In 2001 id released a follow-up to its breakthrough game in Return to Castle Wolfenstein, and Nerve Software has now brought that game to the Xbox with most of its PC features intact, as well as some new levels and modes. But like its PC counterpart, the great multiplayer really overshadows the single-player campaign. Wolfenstein's single-player mode isn't terribly exciting... You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Return to Castle Wolfenstein: Tides of War Video Review The story of Return to Castle Wolfenstein is told mostly through a few short cutscenes and the various documents and journals that you find along the way. You play as B.J. Blazkowicz, the hero from the previous game, on a quest to stop the head of Hitler's secret service from acquiring ancient artifacts that have the power to raise a huge army of undead Nazis. Along the way you'll face human Nazis, zombies, laboratory experiments gone horribly wrong, and more. While the PC version opens with B.J. trapped in a cell inside Castle Wolfenstein, the Xbox version tacks on a handful of new opening levels that are better at setting up the game's story. Wolfenstein's single-player campaign is OK, but it rarely gets very exciting. The level design is fairly straightforward, and most of the objectives are of the ~get this item, then get to the end of the level~ variety. The Xbox version adds a split-screen two-player cooperative mode to the campaign, but this mode really feels like it was thrown in as an afterthought, as you can't save your progress when playing co-op, and you're limited to playing on levels that have already been unlocked in the single-player mode. In addition to that, the frame rate takes a very large hit when you're playing split-screen. The enemy AI is probably the single-player game's strongest point, but it isn't exactly earth-shattering. Enemies will take cover behind objects, popping out to fire off a few shots in your direction and then taking cover again. The game also has its fair share of zombies and other undead warriors, and just like any good zombie should, the game's undead tend to just lumber in your general direction, begging for you to blast their heads off. The single-player game has a useful auto-aim function that's great for beginning players, but it isn't without its problems. Zombies are best killed with shots to the head, but the auto-aim locks your cursor on a zombie's chest, forcing you to fight with the targeting reticle to move it up for a headshot. Considering that the auto-aim is best suited for beginners, it should probably have been designed to lock on to a zombie's head in the first place. ...but the multiplayer mode more than makes up for that. The game's Xbox Live support is what makes it stand out. The game can be played with up to 16 players online, and it comes with all the standard Xbox Live player-matching bells and whistles. It also does a very nice job with statistics, keeping track of weekly, monthly, and overall stats in lots of different categories, from points scored and kills to the amount of time you've spent playing as each of the multiplayer mode's four character classes. While you'd expect a straight-up deathmatch mode from a first-person shooter with the id Software seal of approval, all of Return to Castle Wolfenstein's multiplayer modes are team-based. You can play a plain old team deathmatch game, but the real thrill of multiplayer is found in the objective-based maps. Each map has its own set of objectives, from destroying an Axis submarine to stealing Allied war documents and getting them to a radio for transmission. This means that, depending on the map, one team will be on the offensive while another defends, much like in Unreal Tournament's popular assault game type. This sort of objective-based gameplay requires some pretty refined teamwork, which makes it a natural for Xbox Live and its nicely implemented voice-chat features. Each team is made up of four character classes that work well together. The soldier is a standard player class, with access to the game's heavier weapons. The engineer class can drop or defuse dynamite, making him necessary to complete objectives that include blowing something up or preventing something from being blown up. The lieutenant class can drop ammunition packs for his teammates, which is a must, as there are no ammo or health power-ups in the multiplayer mode. He can also call in devastating air strikes. The medic drops health packs for injured teammates and can also bring dead players back to life. This is useful because Return to Castle Wolfenstein doesn't just let dead players respawn instantly. The game uses the concept of reinforcements that spawn in waves. When you die, you can either wait for a medic or just jump into the reinforcement queue, which is basically a timer that ticks down a few times every minute. Advancing players can also capture forward reinforcement points on the map, which lets players respawn a little closer to the action. Killing Nazis and beheading zombies is the order of the day. While Return to Castle Wolfenstein's multiplayer is fantastic, it has a steep learning curve and a few technical issues. The learning curve comes from having to learn each of the game's large multiplayer maps. The first time you jump into a match, you'll be thrust into the fray without any indication as to what you're supposed to be doing and where you're supposed to be doing it. You'll have to call up the objective screen to see what you're supposed to be doing, but the only way to find out where you need to be is to explore. A multiplayer-map tour mode that let you do flybys of each map's major choke points and areas of interest would have really worked wonders here for getting new players up to speed. The multiplayer mode's other problems are technical. Like Unreal Championship before it, Return to Castle Wolfenstein can suffer from some pretty awful lag when you're connected to a bad server. As of this writing, the bad servers seemed to outnumber the good, lag-free servers, but as most things go with online games, this could change at any time. Suffice it to say that it's definitely possible to find a smooth, perfectly playable server, but don't expect to find one terribly often using the quick match option. Careful filtering with optimatch is the easiest way to find servers that are fast and full. Return to Castle Wolfenstein's large environments look great, and the player models are all sharp and decently animated. However, the game could have used some higher-impact death animations, as you never really feel like your weapons are doing real damage. The game has some really fantastic special effects--particularly the fire from a flamethrower and the explosions from air strikes--but they do come at a cost, as the frame rate isn't very stable. It never completely chokes and slows to a crawl, but even when there aren't any other players or enemies onscreen, turning past a large section of ground causes the frame rate to noticeably fluctuate. Owners of high-end televisions can play the game in 480p, which looks a bit sharper. Anyone willing to take the time to learn the game's multiplayer maps will have a great time. The game's sound is good but not great. The music is all good, and most of the weapon sound effects are nicely done as well. The fact that, for the first time in the series, the Nazis all speak English--in poor German accents, no less--is disheartening. Beyond that, the voice work for some of the characters can be pretty grating. The game makes use of its Dolby Digital 5.1 support in typical first-person-shooter fashion, so if you open a door and quickly turn around, you'll hear the door opening in your rear speakers. In the end, Return to Castle Wolfenstein is a fairly uninteresting single-player game, but its multiplayer mode is a ton of fun. Xbox Live subscribers willing to spend the time to learn the game's maps properly will definitely get a lot of enjoyment out of the game's online component. Each team is made up of four character classes that work well together. The soldier is a standard player class, with access to the game's heavier weapons. The engineer class can drop or defuse dynamite, making him necessary to complete objectives that include blowing something up or preventing something from being blown up. The lieutenant class can drop ammunition packs for his teammates, which is a must, as there are no ammo or health power-ups in the multiplayer mode. He can also call in devastating air strikes. The medic drops health packs for injured teammates and can also bring dead players back to life. This is useful because Return to Castle Wolfenstein doesn't just let dead players respawn instantly. The game uses the concept of reinforcements that spawn in waves. When you die, you can either wait for a medic or just jump into the reinforcement queue, which is basically a timer that ticks down a few times every minute. Advancing players can also capture forward reinforcement points on the map, which lets players respawn a little closer to the action. Killing Nazis and beheading zombies is the order of the day. While Return to Castle Wolfenstein's multiplayer is fantastic, it has a steep learning curve and a few technical issues. The learning curve comes from having to learn each of the game's large multiplayer maps. The first time you jump into a match, you'll be thrust into the fray without any indication as to what you're supposed to be doing and where you're supposed to be doing it. You'll have to call up the objective screen to see what you're supposed to be doing, but the only way to find out where you need to be is to explore. A multiplayer-map tour mode that let you do flybys of each map's major choke points and areas of interest would have really worked wonders here for getting new players up to speed. The multiplayer mode's other problems are technical. Like Unreal Championship before it, Return to Castle Wolfenstein can suffer from some pretty awful lag when you're connected to a bad server. As of this writing, the bad servers seemed to outnumber the good, lag-free servers, but as most things go with online games, this could change at any time. Suffice it to say that it's definitely possible to find a smooth, perfectly playable server, but don't expect to find one terribly often using the quick match option. Careful filtering with optimatch is the easiest way to find servers that are fast and full. Return to Castle Wolfenstein's large environments look great, and the player models are all sharp and decently animated. However, the game could have used some higher-impact death animations, as you never really feel like your weapons are doing real damage. The game has some really fantastic special effects--particularly the fire from a flamethrower and the explosions from air strikes--but they do come at a cost, as the frame rate isn't very stable. It never completely chokes and slows to a crawl, but even when there aren't any other players or enemies onscreen, turning past a large section of ground causes the frame rate to noticeably fluctuate. Owners of high-end televisions can play the game in 480p, which looks a bit sharper. Anyone willing to take the time to learn the game's multiplayer maps will have a great time. The game's sound is good but not great. The music is all good, and most of the weapon sound effects are nicely done as well. The fact that, for the first time in the series, the Nazis all speak English--in poor German accents, no less--is disheartening. Beyond that, the voice work for some of the characters can be pretty grating. The game makes use of its Dolby Digital 5.1 support in typical first-person-shooter fashion, so if you open a door and quickly turn around, you'll hear the door opening in your rear speakers. In the end, Return to Castle Wolfenstein is a fairly uninteresting single-player game, but its multiplayer mode is a ton of fun. Xbox Live subscribers willing to spend the time to learn the game's maps properly will definitely get a lot of enjoyment out of the game's online component."}