{"ref": "https://www.gamespot.com/reviews/return-to-castle-wolfenstein-operation-resurrectio/1900-6029541/", "date": "June 5, 2003", "game_name": "Return to Castle Wolfenstein", "text": "When Return to Castle Wolfenstein was released for the PC in 2001, it was lauded for its extraordinary team-based multiplayer component, which featured a number of different maps and objectives and a class system that let players take on different roles in battle. The single-player mode was largely viewed as being technically competent, but hardly worth the price of admission, especially when compared with the game's strong online mode. Return to Castle Wolfenstein later came to the Xbox, bringing the game's multiplayer mode to consoles while making some minor changes to the single-player game. The PlayStation 2 version, however, has no multiplayer whatsoever and can't even come close to the other two versions from a graphical standpoint. The end product is exactly what you'd think it would be: a subpar port of the forgettable half of a first-rate PC shooter. Without multiplayer, there's no reason to play Return to Castle Wolfenstein. The game's story is largely irrelevant, as it just provides a framework for your ~get to the exit~ adventures. It seems that the Nazis are on a quest for occult power, and it's up to you, as hero B.J. Blazkowicz, to shoot up a mess of Nazis and undead creatures in a quest to right the world's wrongs. Along the way, you'll flip switches to open doors, find a way past some instant-kill spike traps, and expend thousands of rounds of ammunition. The action is broken up by forgettable cutscenes that make use of some pretty poor voice work. The quality of a single-player first-person shooter depends largely on its strengths in two areas: enemy AI and level design. But the game doesn't really stand out in either of those areas. The enemy AI is passable when you're facing one troop at a time, but you'll still see plenty of boneheaded enemy behavior. For instance, you can execute stealth kills by sneaking up behind a troop and stabbing him. You'll occasionally come across two troops having a conversation. If you can manage to stick one of them without the other one seeing you, the other trooper won't even investigate his comrade's sudden and mysterious demise. At least the soldiers are good at running away from grenades and taking cover when attacked. Even though some changes have been made to the levels for this version, the game's environments are still large and realistically designed, but this realism actually works against the game's flow. It's easy to get turned around and even lost in the mazes of identical corridors, and even though the game has a lot of switches that must be flipped to proceed, it rarely shows you what effect a switch has on your surroundings. The Xbox version of the game would occasionally save your position on the fly, giving you plenty of checkpoints and preventing you from having to backtrack. The PlayStation 2 version lets you save anywhere, but it never does so automatically. As a result, the game is very prone to the ~move ahead one room, save your game~ style of gameplay, which breaks up any sort of flow the game might have established. The PlayStation 2 version of Return to Castle Wolfenstein is downright ugly. The game's textures are bland (when you can see them), and the game never really animates very smoothly. Also, the game is incredibly dark. Even with the in-game brightness slider turned all the way up, you'll still enter corridors that are almost impossible to see in. This, as you might imagine, makes finding switches and other important things a serious pain. Hey, at least the dark environments hide the bad texture work and animation, right? Of course, since the game's early levels contain a handful of traps that kill you upon contact, being able to actually see those trap triggers certainly would have been nice. Hey, at least the dark environments hide the bad texture work and animation, right? The game's sound is good but not great. The music is good, and most of the weapon sound effects are nicely done. The fact that, for the first time in the series, the Nazis all speak English--in poor German accents, no less--is disheartening. Beyond that, the voice work for some of the characters can be pretty grating. Return to Castle Wolfenstein has always been a pretty uninteresting single-player game, but the other versions made up for this deficiency with solid multiplayer. Without any of that to cushion the blow, the PlayStation 2 version of the game is a real failure that sits near the bottom of the always-growing stack of first-person shooters available for the platform."}