{"ref": "https://www.gamespot.com/reviews/wwe-2k22-review-bad-times-dont-last/1900-6417846/", "date": "March 16, 2022", "game_name": "WWE 2K22", "text": "After the unmitigated disaster that was WWE 2K20, publisher 2K Games took the bold decision to give developer Visual Concepts an extra year to work on the next game in the series. Annual sports games are very rarely, if ever, given a year off, but WWE 2K22 is proof of the benefits that can occur when development isn't confined to a tight yearly turnaround. It's a massive step up from 2K20, improving on nearly every aspect of the long-running series. The in-ring action has been reworked and improved, the variety and quality of its game modes has increased, and there's been a major decrease in the amount of unrelenting glitches afflicting each and every facet of the game. Some legacy issues persist and not all of the new additions are successful, but WWE 2K22 still represents a recent high mark for the series.This all begins once you step inside the ropes of the squared circle for the first time. WWE Superstar Drew Gulak is on-hand to guide you through all of the new changes, and his humorous and informative tutorial proves invaluable whether you're a newcomer or a series veteran. This is mainly because WWE 2K22 takes inspiration from traditional fighting games by placing a significant emphasis on combos. Striking has been completely overhauled to fit this new mold, with light, heavy, and grapple attacks now filling out your offensive arsenal. You can execute light or heavy combos by mashing each attack's respective button, or combine all three attack types to diversify your offense and keep your opponent guessing. Ending a combo with a grapple attack will see your character transition into a powerful wrestling move like a suplex or DDT, while ending with a heavy combo often launches into a canned animation that encompasses multiple hard-hitting strikes in succession.Grappling has also been reworked, requiring you to clinch before being able to perform any wrestling moves. This expands each superstar's repertoire since once you're locked up with an opponent, you can now utilize either light or heavy grapples to inflict damage. Not only does this ensure more move variety, but it also factors into how defending works in 2K22. In previous games in the series, the reversal button was your only recourse for escaping an onslaught of attacks. It was too limiting and often resulted in situations where you were on the receiving end of attack after attack after attack. The same system still exists, only now you have additional defensive options when it comes to halting your opponent's forward momentum. Not only can you dodge and block incoming strikes, but you can also counter both combos and grapples by correctly guessing whether your opponent is using a light or heavy attack.These changes result in an enjoyable back-and-forth that more closely resembles the matches we see on TV every week. They make the moment-to-moment gameplay much more dynamic as well since you actually have to think about what your opponent is doing, and also consider your own offense to ensure you're not being too predictable. A new stun mechanic helps balance these changes by making it so characters are unable to reverse when they're seeing stars. The animations are much more fluid now, too, on top of being particularly wince-inducing at times. There are still moments where characters will awkwardly teleport into place or get caught up in the ropes, and the physics still have a tendency to break whenever ladders or cages are involved. But these moments aren't as frequent as they have been in the past.A few other legacy issues hold over as well, mainly affecting multi-person matches. Tag-team AI is frustratingly inconsistent when it comes to preventing their opposite number from breaking up the pin, and any match type with four or more superstars squaring off at the same time ends up lasting for far too long because there are so many broken pinfalls. As a result, most of the match types aren't very enjoyable to play. Using weapons is also unwieldy, especially when trying to set up a table or ladder, plus signatures and finishers still require more than a single button press, which makes performing running finishers overly clunky.When it comes to game modes, MyCareer has been re-branded as MyRise and sees you create a male or female superstar to take up through the ranks. Aside from being particularly bad, the career mode in 2K20 was also strictly linear. That's not the case here, with a plethora of choices to be made that will shape how your created character's career pans out. There are two separate narratives depending on your gender; all three brands--Raw, Smackdown, and NXT--have around 20 of their own storylines each; and your heel or face alignment also factors into what side stories are available. There's a ton of replayability inherent in this structure, and character creation isn't limited because of restrictive loot boxes either, as was the unfortunate case in 2K20. Now you have free reign to utilize the excellent creation suite to its fullest.MyRise is also more grounded than 2K20's absurd career mode, so you won't be fighting in the depths of hell or squaring off against Samoa Joe and his cybernetic arm. There are some engaging pro wrestling storylines in 2K22, particularly when you dive into the numerous side stories that pop up on social media. One of the first I delved into saw my heel character align with Shinsuke Nakamura and a fictional character who trained with me at the WWE Performance Center. After attacking Big E a few times, I earned a match for his Intercontinental Title, which I eventually won after some heelish interference from my two faction members. This, in turn, led to Big E getting some measure of revenge until we settled things with a climactic title match inside Hell in a Cell. Stuff like this is compelling and separates MyRise from the other game modes on offer. The only downside is that all of the dialogue in this storyline, and many others, takes place on 2K22's faux Twitter. Voice acting occasionally pops up in cutscenes, but most of it either tends to be stilted or sounds like it was recorded in somebody's bathroom--which may be a result of the pandemic.While MyRise straps you into the boots of an up-and-coming star, MyGM puts you in a buttoned-up suit and tasks you with booking a successful show each week. You play as one of six on-screen bosses, including Stephanie McMahon, Shane McMahon, Sonya Deville, or even a General Manager you've created from scratch, and pick one of four brands to manage. Each GM and brand has unique powerups to help you along the way. Then you'll compete against an AI or human rival to see who can book the best show, starting with a superstar draft that's only limited by your starting budget. It's tempting to simply pick the best superstars available, but you have to be mindful of each one's heel or face alignment and their synergy with one another. Fighters match up well with giants and cruisers, for instance, and you typically want your good guys facing your bad guys.Rather than running for an indeterminate amount of time, however, MyGM is condensed to a season of 15, 25, or 50 weeks. This limitation seems to exist because the mode lacks any meaningful depth. There are no secondary championships like the US Title or tag team belts, and the inclusion of a popularity stat means you're forced to repeat matchups between the same few wrestlers over and over again until you can run enough promos to elevate some of the smaller stars. You can't immediately insert someone like Ricochet into the title picture because no one will care and your match ratings will plummet as a result. In many ways, it's reflective of the real-life WWE product, where only a handful of superstars are able to move the needle.The WWE's failure to create new stars is also evident in 2K22's outdated roster. This isn't the fault of Visual Concepts, of course--and it spoke to us about how it dealt with the ever-shrinking roster--but Vince McMahon's scorched-earth policy does impact the game by guaranteeing that it doesn't resemble anything close to the current TV product. So many members of the in-game roster have been released over the course of the pandemic that you can fill an entire 30-person Royal Rumble match with wrestlers who are no longer employed by the company. William Regal is one of the playable GMs, and he recently signed with rival AEW, while the likes of Keith Lee, Swerve Strickland, Buddy Matthews, Kyle O'Reilly, and Jeff Hardy will likely appear in both a WWE and AEW video game this year.On the flip side, the exclusion of other wrestlers is most keenly felt in 2K22's Showcase mode, which chronicles the legendary career of Rey Mysterio. This mode starts off by recreating the phenomenal match between Rey Mysterio and Eddie Guerrero at WCW: Halloween Havoc '97. During significant moments in the match, the action will seamlessly transition from gameplay to archive footage, which not only looks cool but puts the historical magnitude of the match into perspective. Rey provides commentary during these moments, but it's all in kayfabe so there's very little actual insight. The rest of his WCW career is sadly omitted along with huge chunks of his WWE career. Neither Kurt Angle, Chris Jericho, nor Big Show are in the game, so instead of reliving Rey's memorable feuds with the legendary trio, 2K22 settles for a random Raw match against Gran Metalik. Showcase is still enjoyable, but the roster's shortcomings prevent it from reaching its full potential.Elsewhere, MyFaction is a new mode that sees 2K attempt to cash in on the Ultimate Team concept featured in almost every other sports game. You open packs to get cards and build a team of four men and four women, then compete in various matchups to complete objectives and earn more cards and in-game currency. It's very grindy, and the four-on-four bouts that regularly occur are lengthy and not particularly enjoyable because of the aforementioned issues. The popular Universe mode also returns, only now you can choose to play as a single WWE Superstar rather than focusing on running the entire company. Whoever you choose works with Triple H to develop feuds, construct tag teams, fight for championships, and more, so there is still an element of Universe mode's booking.WWE 2K22 is a surprising return to form after the Shockmaster-sized disaster that was 2K20. The extra year of development has done a world of good, and the only hope now is that the series doesn't return to an annual schedule. There are still failings when it comes to multi-person matches, and not all of the new modes are particularly engaging, but 2K22 establishes a solid foundation for the future. Ideally, WWE will calm down when it comes to gutting its roster, and the next game in the series won't feel quite as outdated. It will also be interesting to see how Yuke's upcoming AEW game fares. Competition can only be a good thing."}