{"ref": "https://www.gamespot.com/reviews/cursed-mountain-review/1900-6216428/", "date": "August 27, 2009", "game_name": "Cursed Mountain", "text": "It's cold in the Himalayas--damned cold. The chill fills your lungs as you desperately search the mountain for the leftover canisters of oxygen you need to survive. And as you draw rattling breaths with burning lungs, you desperately defend yourself from hostile spirits hovering between this world and the next. This is the world of Cursed Mountain, where the frigid air will chill you to the bone, and your inner eye draws secret runes into clear view. This slow-paced survival horror game is not just the tale of a vertigo-inducing climb up the side of a Tibetan mountain, but a fascinating and surprisingly authentic examination of Buddhist rituals and the Sherpas who populate the region. Even when compared to other horror games, Cursed Mountain moves at a slow tempo, so if you need to be consistently engaged with hot action or thoughtful puzzles, this is not the game for you. And even if you do appreciate measured exploration and storytelling, you'll not likely appreciate the unresponsive motion controls. Yet in spite of these and other foibles, Cursed Mountain will draw you into its frozen spell, from which the only respite is incense, meditation, and a trusty pickaxe. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Cursed Mountain Video Review You play as Eric Simmons, a famed mountain climber searching for his brother Frank, who has gone missing while scaling Chomolonzo, one of Tibet's Himalayan mountains. Frank is a hothead known for taking risks, so when injured climber Edward Bennett needed someone to retrieve an important artifact at the mountain's crest, Frank was the obvious choice for such a risky endeavor. Unfortunately, the mountain's resident goddess isn't pleased with the constant intrusion, so your slow climb in search of Frank is hardly straightforward. You must investigate Sherpa villages and Buddhist temples searching for clues and learning of the events that complicated Frank's troubled ascent. You'll discover diary pages and climbers' logs that detail Frank's determined attitude, as well as his disrespect of the local culture and your own climbing successes. Hand-illustrated cutscenes further describe the saga as it unfolds, and along with some dramatic voice acting, they do a great job of fleshing out the mystery. What is Frank's fate? What is this relic known as a Terma? And why are you being assailed by spirits caught between this world and the next? The answers come, and while the plot is straightforward enough, it's the detail surrounding it that makes the story easy to get lost in. Cursed Mountain is brimming with authentic touches that show reverence to the mountain's people and customs--and that authenticity makes the journey feel even spookier, because the terrors are centered on real religious teachings. The notes you find scattered about from villagers and monks realistically reference actual rituals and traditions, from depictions of the intermediate realm known as the Bardo, to the use of incense to ward off evil spirits. As you make your way up Chomolonzo, you see prayer flags flying in the icy wind and colorful dome tents, which are sights you would see on an actual climb. Certain short sequences, like those in which you twirl the remote during meditation, and one in which you sneak up on prayerful ghosts to steal their mantras, make good use of these concepts and steep you in the ambience. Use your third eye to slip between worlds. While the chilly setting and the cultural inspiration are unique, Cursed Mountain plays a lot like the horror adventures that have come before. You scour buildings and wintry trails searching for items and triggering events that move you along a linear path. You walk or jog at a measured pace, so you won't be sprinting away from any ghosts you encounter. When you aren't besieged by the denizens of the supernatural, you'll look for ways to get into temples and pick up notes that expand the backstory. There are times when too little is happening. Sections where you scale mountain walls are initially cool, but some of them last far too long; other segments where you must check doors to see which ones you can enter get tedious. Yet some sequences add welcome variety, and many of them are highly successful. In one of them, you use the remote as a walkie-talkie, and a friendly voice guides you out of a frozen maze. In another, you must collect oxygen tanks as you progress lest you perish from altitude sickness. Scenes like these are excellent and extend sensibly from the story and environments. On the other hand, balancing across a thin beam by tilting the remote forward and keeping it parallel to the ground to avoid a fall isn't much fun. Nevertheless, there are some good concepts behind the way motion controls function in Cursed Mountain. When you're attacked by spiritual foes, you defend yourself by swinging your equipped weapon. You begin with just a pickaxe, but you gradually add ritual relics to your inventory that do additional damage and enable different attacks. You aren't confined to simple melee attacks, however; by using your third eye and peering into the otherworldly realm known as the Bardo, you can fire shafts of energy at your enemies or use an energy stream to essentially grab and yank them into oblivion. Such final moves, as well as a move called the compassion ritual (which replenishes some of your health as well as vanquishes a ghost), require you to perform a series of motion-based maneuvers. These movements are meant to represent symbolic rituals, which is a great idea, and there's a pleasant balance between standard button taps and gestures. But while the ideas are solid, the implementation is not. When combat requires you to wave the remote or nunchuk to the side, it works fine. Sadly, this isn't true when a forward thrust is involved. It works most of the time, but when combat is this deliberate, anything less than 100 percent isn't acceptable. Cursed Mountain is not a difficult game, so undetected motion is the most common cause of death. The final third of the game gets especially hairy, and defeating a ghost or performing a compassion ritual may require five separate motions, several of which will be forward thrusts. To have motions go frequently unrecognized is not only frustrating, but it rips you out of the game and back to reality. Outside of these problems, your slow turn and sluggish swing make combat a bit awkward, and transitions in and out of the third eye can also lead to clumsiness. The targeting pointer appears only when you look into the Bardo, so you may fumble for a moment to get the remote pointed properly so that the reticle appears on the screen. Had these issues been tightened up, combat could have been consistently rewarding, but for every compelling battle, there is a clumsy, frustrating one. No grandpa, I don't want a kiss! Battles are often further held back by a few obscuring visual effects. During most battles, in certain cursed areas, and when you gaze into the Bardo, the color is washed away and the screen becomes hazy. These effects are overdone; they don't lead to scares, just visual discomfort. Fortunately, Cursed Mountain's audiovisual presentation is mostly successful. The visuals aren't groundbreaking, but they evolve nicely as you ascend Chomolonzo; the areas at the base of the mountain look and sound chilly but aren't as inhospitably bitter as its peak. Aside from some occasional awkward animations and jitters, Eric looks natural when he slinks across tight ledges and scales cliffsides using his ice axe. The sound design deserves special kudos for keeping tension levels high while avoiding cliches like incongruous rattles and childish giggles. The whoosh of the icy winds may cause you to shiver, and the groans of spirits and Eric's heavy breaths when he activates the third eye are creepy and cool. There are moments when predictability seeps into Cursed Mountain. Some of your ethereal enemies mix up attacks on you, but defeating them involves the same tactics time and time again (with the exception of a few sinister boss fights). And yet there's something special about Cursed Mountain always lingering under its surface. Its attention to cultural detail is extraordinary, and as you approach your final destination, the anxious chill spreads further through you. It's a shame that control issues so frequently tarnish the trek. But Cursed Mountain mostly transcends its problems, thanks to a great premise and thoughtful storytelling that will clutch you in its frosty embrace."}