{"ref": "https://www.gamespot.com/reviews/mtv-skateboarding-review/1900-2628202/", "date": "May 17, 2006", "game_name": "MTV Sports: Skateboarding featuring Andy Macdonald", "text": "MTV Skateboarding is THQ's attempt to cash in on the now-rampant craze of skateboarding games. On paper, the game looks pretty good, with several levels, real skaters, and modes that haven't been in any other skateboarding game to date. In practice, however, the game's ugly textures, poor frame rate, and clunky gameplay combine to make MTV Skateboarding one of the worst PlayStation games released this year.The game has all the bases covered when it comes to modes. There's a freeplay mode, for when you just want to skate; a lifestyle mode, which serves as the game's main career mode; a high score contest; an icon collection mode, which requires you to grab a set number of MTV icons before time runs out; a survival mode; and a stunt mode, which lets you do things like fly down giant ramps and jump over cars. Mutliplayer modes include a simple trick-battle mode, a time-bomb mode, a two-player MTV icon hunt, and a ~knock the other guy off his board~ deathmatch.The licensing in this game runs rampant. There's, of course, the MTV license. Plus, the game has several professional skaters, including Andy Macdonald, Keith Hufnagel, Stevie Williams, and Colin McKay. Lots of company logos are found throughout the game, such as Swatch, Airwalk, DC, Sobe, Porn Star, and Adio. Additionally, licensed music from bands like Cypress Hill, the Deftones, System of a Down, Goldfinger, and Pennywise is played throughout the game.At first glance, the controls are similar to those of games like Tony Hawk's Pro Skater and Grind Session. But some adjustments have been made. For starters, you can't spin with the D-pad. The L1 and R1 buttons are used for midair spinning, as well as maintaining your balance on rails. The game has a large collection of tricks, but each skater has the same set of tricks, making the difference between skaters little more than slightly better rail balance, faster acceleration, or better turning abilities. The game does have a nice collection of flatland tricks, though, including manuals, powerslides, handstands, and kickbacks. The game also features a lot of levels, but most of them are uninspired ramp-fests, without the nice, flowing lines contained in other recent skate games.Graphically, the game is downright hideous. The game's textures are blurry, and they warp and tear at their polygonal seams so much that the ground constantly jiggles like Jell-O. When combined with the game's jerky, annoying camera angle and the seemingly random yet never acceptable frame rate, it's enough to give you a case of motion sickness. Some of the moves look decent, but the transitions between moves are nonexistent, making the skater look as jerky as the camera. Some of the wrecks are downright laughable, as the game will sometimes skip from the start of a wreck to your skater laying flat on the ground, skipping what should be at least three or four frames of crashing.The sluggish frame rate infringes on the gameplay as well, since it prevents you from ever really achieving a real sense of timing. As if that weren't bad enough, the control is evilly unresponsive, making accurate jumping a nightmare. It's as if your button presses don't register for half a second or so after you hit them.MTV Skateboarding is a perfect example of cashing in on a recently established genre, yet unlike games like Street Sk8er 2 or Grind Session, it doesn't bring anything worthwhile to the table. Tony Hawk's Pro Skater 2 hits shelves in about a week - do yourself a favor and wait for that one, instead."}