{"ref": "https://www.gamespot.com/reviews/shadow-the-hedgehog-review/1900-6140203/", "date": "November 21, 2005", "game_name": "Shadow the Hedgehog", "text": "Let's get this out of the way up front: Shadow the Hedgehog is a game set in Sega's beloved Sonic universe, and yes, you can use all kinds of guns to shoot aliens, robots, and even humans. It sounds blasphemous, but it really isn't so shocking once you see it in action. In fact, the shooting mechanics are completely useless, so you're better off avoiding guns altogether. Actually, unless you're a very forgiving Sonic fan, you're better off avoiding this entire game. It's Sonic with guns...and terrible controls. As the title implies, the game is all about Shadow the Hedgehog, who was introduced as Sonic's rival in Sonic Adventure 2 on the Dreamcast. After appearing in a few other Sonic games, the dark hedgehog is now the star of his own adventure. The game follows the amnesiac Shadow as he tries to recall his past. As he contemplates his fragmented memories, evil aliens known as the Black Arms descend from the sky and start to wreak havoc in the city of Westopolis. Shadow isn't exactly tight with the humans and doesn't know the aliens at all, so he doesn't see any reason to get involved in the dispute until the alien boss, Black Doom, shows up and tells Shadow that he must retrieve seven chaos emeralds. Since this Black Doom guy seems to know a bit about Shadow, Shadow decides to play along in the hopes of finding more information about his past. There are several different paths to take through the game depending on whether you want to fight for good, evil, or a mix of the two. There are 22 levels, each with multiple objectives. For example, in the first level, Westopolis, you can choose to take the evil path by killing all the humans. If you want to take the good path, you can kill all the aliens. And if you just want to get through the level and move on, you can simply run through and grab the chaos emerald. The conditions for each mission are made apparent through your interactions with various non-playable characters that tag along as you play. Sonic or one of his friends will show up in each stage to tell you what you need to do to complete the hero quest, and an evil character, such as Black Doom's evil eye, will show up to tell you how to complete the dark missions. You can switch between these supporting characters by pressing a direction on the D pad, and they usually just hang in the background telling you what to do and where to go. Depending on which mission you complete, you'll move on to one of two or three different levels. This enhances the replay value because you have to play through several times to see each level and each of the 11 different endings. It can take a couple of hours to beat the game too, so there's plenty of gameplay to be had here. Unfortunately, the gameplay isn't fun enough to warrant playing the game through multiple times. Shadow the Hedgehog plays a lot like any other Sonic game. You run around really fast, collect rings, bounce off springy platforms, and hop on enemies. Shadow can do everything that Sonic does, and he can also wield weapons and perform special chaos moves. As you progress through a level, you can fill up your dark gauge and your hero gauge by attacking enemies, putting out fires, destroying plants, and more. Once one of these gauges is full, you can perform a special move. The hero move is called chaos control, and it zooms you ahead in a level, which isn't very useful because you'll often pass right by some integral part of a mission. If you use chaos control in a boss battle, it slows down time for a little while. If you fill up your dark gauge, you can perform a chaos blast, which kills everything in the surrounding area. The shooting part of the game is as basic as it gets. You can break crates to pick up pistols, machine guns, bazookas, laser rifles, and lots of other less-conventional firearms. The problem with the guns is that it's difficult to hit your intended target. There is no target lock and no way to manually aim your weapon. Shadow will shoot whatever is directly ahead of him. The guns will auto-aim, but there are usually multiple targets onscreen at a time, and the auto-aim doesn't differentiate between friend and foe. You can also grab torches, street signs, swords, and other close-range weapons, but aside from the few spots where they're required to trigger a switch, the weapons aren't worth messing with. Shadow skates around as if he's on ice, which gets really frustrating really fast. The most useful attack doesn't involve weapons at all, though. You can perform a homing spin attack by jumping into the air and then hitting the jump button again. If there's a target nearby, you'll automatically attack it. If there are several targets, you can just chain this attack together over and over to quickly eliminate a large group of enemies, but again, the attack doesn't differentiate between friend and foe. The combat mechanics are almost functional once you get used to them, but they're still unnecessarily awkward and imprecise. The entire game feels awkward and imprecise. Shadow controls like a cheetah on a frozen pond. He skates all over the place, so it never really feels like he's making contact with the ground. Plus, he accelerates from a standstill to top speed in an instant, and when he's at top speed, he can't turn or change direction very quickly. You can strafe, but that doesn't come in handy very often. It wouldn't be a problem if all you had to do was run in a straight line, but the levels in this game are full of very precise platform-jumping sections that are made frustrating by the shoddy controls. There are relatively few spots where you can let loose and run really fast, which is unfortunate, because those spots are pretty fun. Shadow can hop in a car and pull a drive-by on some alien and human fools. Despite some extremely frustrating level design, the game does a fairly good job of mixing things up from level to level. There's a Tron-style level, where you race around circuits, trying to avoid crashing into firewalls; a rail shooter section on a space station; a level where you have to chase an enemy ship through a city; and a few boss battles as well. You can also use a variety of vehicles, from motorcycles and sports cars to balloons and hovering saucers. Some of the vehicles are required to progress through a level, but others are optional. The vehicles are slightly easier to control than Shadow is, but they still aren't particularly fun to use. Shadow the Hedgehog also has a multiplayer mode in case you feel like sharing the tedium with a friend. Two players can have it out in a deathmatch game on one of three different maps. The maps are fairly large and are full of enemies, vehicles, weapons, and rings. The objective is to run around and attack your enemy to steal his or her rings and eventually score a kill. But because there are so few maps, and because the combat in this game is so poorly executed, the multiplayer game is worthless. Aside from the unwieldy controls, Shadow the Hedgehog's biggest problem is an uncooperative camera. The camera defaults to a position just behind Shadow, but it automatically adjusts to give you a view of important parts of the environment. If you're fighting a boss, the camera will automatically adjust to give you a view of that boss. The problem is that this automatic perspective doesn't always work, and you can't always adjust it manually, because the camera often gets stuck. As a result, you're often forced to make a lot of blind jumps. A simple first-person look option would help immensely, just to let you see where you need to go before you rush ahead at full speed, only to fall off a platform and die. The graphics in Shadow the Hedgehog are decent, but they're by no means spectacular. The characters animate well for what few animations they have. The levels are mostly brightly colored futuristic landscapes, like a giant space station or a futuristic prison. There are some slightly more organic areas as well, like a haunted castle and temple ruins. The explosions and weapon effects are underwhelming, as are the bland vehicles and the limited selection of enemies. The three different versions of the game all look about the same, but the PlayStation 2 version suffers from some serious--and frequent--slowdown. The Japanese voice track is available only in the PlayStation 2 version of the game, which is unfortunate because that's the worst of the three versions. Shadow the Hedgehog isn't impressive in terms of sound, either. The soundtrack is hit or miss, but overall it's pretty good, and most of the tracks fit their respective stage just fine. The English voice tracks are fine, but they don't lend much dramatic presence to the characters in the game. If you're playing the PlayStation 2 version of the game, you can opt to turn on the Japanese voices, which sound much more interesting than the English ones. Oddly, the Xbox version of the game lets you listen to the Japanese voices only if you adjust your system settings, but if you do that, the subtitles will be in Japanese as well. Even stranger is the GameCube version of the game, which forces you to listen to English voices, but gives you the option of changing the language of the subtitles in case you're a real purist and prefer to read your games in Japanese. The sound effects are so average that you won't even notice them after a while (except for the nostalgic chimes you'll hear when you collect or spill rings). Shadow the Hedgehog is an attempt to take the series into slightly edgier, more mature territory. That's all fine and good, but a game needs more than a bad attitude and some guns to be enjoyable. The multiple endings are great, and they provide some interesting insight into Shadow's past. Unfortunately, everything leading up to those endings is tedious and frustrating due to the nasty controls and an uncooperative camera. If you absolutely have to get a Sonic fix this holiday season, start with Sonic Rush. If that still isn't enough hedgehog, you might find something to like if you give Shadow a try, but you'll definitely find plenty to dislike, too. The entire game feels awkward and imprecise. Shadow controls like a cheetah on a frozen pond. He skates all over the place, so it never really feels like he's making contact with the ground. Plus, he accelerates from a standstill to top speed in an instant, and when he's at top speed, he can't turn or change direction very quickly. You can strafe, but that doesn't come in handy very often. It wouldn't be a problem if all you had to do was run in a straight line, but the levels in this game are full of very precise platform-jumping sections that are made frustrating by the shoddy controls. There are relatively few spots where you can let loose and run really fast, which is unfortunate, because those spots are pretty fun. Shadow can hop in a car and pull a drive-by on some alien and human fools. Despite some extremely frustrating level design, the game does a fairly good job of mixing things up from level to level. There's a Tron-style level, where you race around circuits, trying to avoid crashing into firewalls; a rail shooter section on a space station; a level where you have to chase an enemy ship through a city; and a few boss battles as well. You can also use a variety of vehicles, from motorcycles and sports cars to balloons and hovering saucers. Some of the vehicles are required to progress through a level, but others are optional. The vehicles are slightly easier to control than Shadow is, but they still aren't particularly fun to use. Shadow the Hedgehog also has a multiplayer mode in case you feel like sharing the tedium with a friend. Two players can have it out in a deathmatch game on one of three different maps. The maps are fairly large and are full of enemies, vehicles, weapons, and rings. The objective is to run around and attack your enemy to steal his or her rings and eventually score a kill. But because there are so few maps, and because the combat in this game is so poorly executed, the multiplayer game is worthless. Aside from the unwieldy controls, Shadow the Hedgehog's biggest problem is an uncooperative camera. The camera defaults to a position just behind Shadow, but it automatically adjusts to give you a view of important parts of the environment. If you're fighting a boss, the camera will automatically adjust to give you a view of that boss. The problem is that this automatic perspective doesn't always work, and you can't always adjust it manually, because the camera often gets stuck. As a result, you're often forced to make a lot of blind jumps. A simple first-person look option would help immensely, just to let you see where you need to go before you rush ahead at full speed, only to fall off a platform and die. The graphics in Shadow the Hedgehog are decent, but they're by no means spectacular. The characters animate well for what few animations they have. The levels are mostly brightly colored futuristic landscapes, like a giant space station or a futuristic prison. There are some slightly more organic areas as well, like a haunted castle and temple ruins. The explosions and weapon effects are underwhelming, as are the bland vehicles and the limited selection of enemies. The three different versions of the game all look about the same, but the PlayStation 2 version suffers from some serious--and frequent--slowdown. The Japanese voice track is available only in the PlayStation 2 version of the game, which is unfortunate because that's the worst of the three versions. Shadow the Hedgehog isn't impressive in terms of sound, either. The soundtrack is hit or miss, but overall it's pretty good, and most of the tracks fit their respective stage just fine. The English voice tracks are fine, but they don't lend much dramatic presence to the characters in the game. If you're playing the PlayStation 2 version of the game, you can opt to turn on the Japanese voices, which sound much more interesting than the English ones. Oddly, the Xbox version of the game lets you listen to the Japanese voices only if you adjust your system settings, but if you do that, the subtitles will be in Japanese as well. Even stranger is the GameCube version of the game, which forces you to listen to English voices, but gives you the option of changing the language of the subtitles in case you're a real purist and prefer to read your games in Japanese. The sound effects are so average that you won't even notice them after a while (except for the nostalgic chimes you'll hear when you collect or spill rings). Shadow the Hedgehog is an attempt to take the series into slightly edgier, more mature territory. That's all fine and good, but a game needs more than a bad attitude and some guns to be enjoyable. The multiple endings are great, and they provide some interesting insight into Shadow's past. Unfortunately, everything leading up to those endings is tedious and frustrating due to the nasty controls and an uncooperative camera. If you absolutely have to get a Sonic fix this holiday season, start with Sonic Rush. If that still isn't enough hedgehog, you might find something to like if you give Shadow a try, but you'll definitely find plenty to dislike, too."}