{"ref": "https://www.gamespot.com/reviews/x-men-legends-ii-rise-of-apocalypse-review/1900-6136238/", "date": "November 8, 2005", "game_name": "X-Men Legends II: Rise of Apocalypse", "text": "A good game plays by a set of clearly defined rules, and a great game gives you plenty of clever opportunities to break those rules. X-Men Legends II: Rise of Apocalypse breaks the rules by letting you to create a mutant dream team of heroes and villains from a cast of characters that includes the legendary X-Men, as well as Magneto's sinister band, the Brotherhood. The game was recently released on consoles and the PC, and now PSP owners can also take a shot at the ancient bad man known as Apocalypse. It's impressive that Vicarious Visions somehow managed to cram every little detail of the game onto a handheld, but aside from the portability, there isn't much new here. However, if you haven't played the game on consoles, you won't be sacrificing anything if you pick up the PSP version--which you should certainly do if you have any interest at all in the X-Men or in action role-playing games in general. The X-Men and the Brotherhood unite on your PSP to take out the evil Apocalypse and his four horsemen. The story in X-Men Legends II kicks off with a great rendered cutscene that shows Magneto, Mystique, and Sabertooth teaming up with Wolverine, Cyclops, and Storm to free the enslaved Professor Xavier. Even if you're only a passing fan, you know that Magneto and Professor X aren't exactly cordial with each other. However, the Brotherhood and the X-Men are forced to set aside their differences to focus their collective attention on the newest (oldest) bad guy in town: Apocalypse. Actually, to call Apocalypse a threat is an understatement, because he's one of the most powerful mutants in the Marvel universe. After all, he's about 5,000 years old and is damn near invincible. The game picks up shortly after Apocalypse has all but destroyed the mutant haven known as Genosha. Eventually, Apocalypse kidnaps four mutants with a specific type of DNA, and with the help of the crackpot geneticist Mr. Sinister, Apocalypse plans to extract that special blend of DNA to make himself even more powerful...so he can take over the world. The story here isn't particularly original, but it's made compelling by the huge cast of great characters from the X-Men universe. There are more than 20 playable characters in this version of the game, with familiar faces like Wolverine, Gambit, Magneto, and Storm alongside more-obscure characters like Toad, Bishop, The Scarlet Witch, and Sunfire. To sweeten the pot even further, there are several unlockable characters. However, we won't spoil the surprise here. In addition to the playable characters, there are a ton of recognizable heroes and villains that make appearances as enemies or as nonplayable characters. One of the best parts of X-Men Legends II is the way you can mix and match Brotherhood and X-Men characters to achieve a powerful--if unlikely--team of characters. With so many characters, there are plenty of different combinations to try out. If that isn't enough for you, you can also unlock dozens of different skins in the game. Some of the skins look ridiculous, but that pretty much comes with the territory when you're a superhero. However ridiculous their outfits are, the characters look great on the PSP. The different skins are detailed and distinct, and all the characters animate well, whether they're executing spectacular special attacks or simply pummeling enemies to the ground. In addition to the game's look and power combinations, the assorted characters will elicit different reactions from nonplayable characters. You'll often have to speak with Forge to purchase items, and if you're controlling a Brotherhood character when you speak to him, Forge will be much less friendly than if you approach him as one of the X-Men. These character interactions don't affect gameplay at all--and there are only a couple of canned reactions from each character--but this makes for some great back-and-forth between the two teams. The gameplay in X-Men Legends II follows the same beat-'em-up-and-collect-their-items pattern of Untold Legends. You control a party of four characters, though you can only directly control one character at a time. But you can easily switch characters on the fly by holding the left shoulder button and pressing one of the directions on the D pad. You'll often need to switch among characters, because some of the puzzles in the game require the specific abilities of a certain mutant. You might need Iceman to put out a fire or Magneto to generate a metal bridge across a gap, for example. For the most part, though, you just run around various levels beating the crap out of bad guys and collecting items and experience. As you gain experience, your characters will level up and become stronger, and they'll learn new skills. You can allocate all the experience and skill points manually if you want, or you can set an option to have the points automatically distributed as you earn them. There are more than 20 characters in the PSP version of X-Men Legends II, each with signature moves and abilities taken straight from the comics. Each character has several different skills based on his or her mutant powers. There are melee, boost, projectile, traps, and more. Each skill is assigned to one of the four main face buttons, and in battle (if you have enough energy) you can hold the right shoulder button and press the corresponding button to use that special skill. This makes it easy to switch between straight-up fighting and using skills. Each character can also learn a couple of super skills, which not only look really cool, but also are extremely powerful. Cyclops has a super beam attack that can hit multiple targets; Wolverine has a spinning radial attack that does heavy damage; and Magneto has a metal attack in which he crushes everything in sight by manipulating the metal objects in the environment. For the most part, you don't actually need to use these skills to beat the game, but they make it a lot quicker and easier to deal with hordes of enemies. And since some of the boss fights in this game are truly epic, they just wouldn't be as entertaining without an all-out clash of mutant powers. When playing the game single-player, all but one of the members of your party will be artificial intelligence-controlled. It isn't as bad as it sounds, though, because here you can customize the AI by setting parameters for aggressiveness, primary moves, and when to heal. Each character can be programmed individually, so you can have Cyclops and Iceman hang back to use ranged attacks while Wolverine and Juggernaut go in to tear things up. Even with these options, the AI isn't brilliant or anything, but it usually stays out of the way. You can play cooperatively with up to four players in ad hoc mode or online. Of course, the best way to play X-Men Legends II is cooperatively with a few friends. The PSP version of the game offers four-player co-op play in ad hoc wireless mode, as well as four-player online play. Multiplayer can be a lot of fun as you and your friends combine powers to plow through room after room of enemies. The only problem with co-op play is that the camera is pulled back to keep all players in the frame at the same time. So if you are on opposite sides of the screen, the view will be so far away that you can't really see the action. But if one character gets stuck, you can just hit a button to teleport back to the party. Getting online is quick and easy, as long as you have wireless Internet access. We did notice some lag when playing online, but it seemed to smooth out after playing for a while. The lengthy load times from the console version of the game are just as apparent in the PSP version, and they do tend to break up the flow of the game. This is especially frustrating when playing online, as the game pauses anytime a player accesses the character menu. X-Men Legends II looks great for a PSP game, and it looks great on the small screen. In terms of detail and variety, it doesn't look like much was lost in the translation from console to handheld. You'll fight in a jungle, a factory, an ancient Egyptian temple, and even on top of a flying dirigible. The environments feel complex and huge, but most of the paths loop back on themselves, so you won't get lost or hit a dead end very often. Plus, there's a mini-map with an arrow to point you to exactly where you need to go. Every stage is filled with all kinds of stuff for you to destroy, from glowing mushrooms and giant boulders, to barrels and furniture. You can also knock down walls and destroy equipment, which really makes the battles feel chaotic and over the top. You can punch enemies through walls, smash rocks over their heads, and basically destroy every single thing in your path. Or you can just pick up enemies and chuck them over the nearest railing to watch them fall to their dooms. It seems simple, but in practice it's undeniably entertaining to watch Juggernaut or Colossus run into a group of bad guys and start tossing them around like rag dolls. Toward the end of the game, the levels do start to feel the same, and the puzzles are never quite complex or challenging. It isn't a major problem, though, since this game is all about combat anyway. Unfortunately, the PSP version of the game doesn't always run smoothly. The game actually locks up and sputters for a few seconds sometimes when the PSP is reading the UMD. This only happened to us after resuming play after saving a game, and the effect usually didn't last more than 10 or 15 seconds. It is annoying, but thankfully it doesn't happen frequently enough to throw the whole game off. The fixed camera is annoying at times, because it takes a while to adjust if you suddenly change directions. However, the game looks great and runs smoothly most of the time. The one area where X-Men Legends II could use some cleaning up is in its interface. The menus fill the screen with text that isn't arranged intuitively at all. Checking your stats or equipping new items is much more of a chore than it should be. You probably won't want to spend much time in the menus anyway, because they take a long time to load. You actually have to look at a load screen if you want to check the status of your party, and then you have to look at another load screen to get back to the action. It's especially annoying, because in a game like this, you want to be able to tweak stats or equip items quickly and easily. The sound in X-Men Legends II is quite good for a PSP game, but it isn't particularly remarkable. The music is your average orchestral score that doesn't get stuck in your head or anything, but it sits nicely in the background and kicks into high gear when the tension is up. The voice acting is completely intact, and it sounds perfectly campy, although some of the characters sound a bit silly. Professor Xavier is excellently voiced by Patrick Stewart, but Rogue sounds a bit too much like Dolly Parton, and Juggernaut sounds like a dirty imitation of Wolfman Jack. At 20 hours, this game will keep you occupied for plenty of bus rides to and from your local Android's Dungeon. Overall, X-Men Legends II is a lengthy and fun adventure that anyone with a PSP and an interest in superheroes or beat-'em-up games will certainly enjoy. It doesn't do anything new or groundbreaking in terms of gameplay mechanics, but the cast of characters and the story are more than enough to make it worth playing. The game takes about 20 hours to finish, but when you do, you can play it again on a different difficulty setting. Better yet, you can try playing through with a new combination of characters to see which combos work best. If you played any of the console versions of X-Men Legends II, you might want to pass on this since it's essentially the exact same game. However, if you're interested in the game and haven't played another version yet, the PSP is as good a platform as any to enjoy it on. Editor's note 11/08/05: Our original review incorrectly stated that this version of the game was missing some sound effects that were found in the console versions of the game. GameSpot regrets the error. When playing the game single-player, all but one of the members of your party will be artificial intelligence-controlled. It isn't as bad as it sounds, though, because here you can customize the AI by setting parameters for aggressiveness, primary moves, and when to heal. Each character can be programmed individually, so you can have Cyclops and Iceman hang back to use ranged attacks while Wolverine and Juggernaut go in to tear things up. Even with these options, the AI isn't brilliant or anything, but it usually stays out of the way. You can play cooperatively with up to four players in ad hoc mode or online. Of course, the best way to play X-Men Legends II is cooperatively with a few friends. The PSP version of the game offers four-player co-op play in ad hoc wireless mode, as well as four-player online play. Multiplayer can be a lot of fun as you and your friends combine powers to plow through room after room of enemies. The only problem with co-op play is that the camera is pulled back to keep all players in the frame at the same time. So if you are on opposite sides of the screen, the view will be so far away that you can't really see the action. But if one character gets stuck, you can just hit a button to teleport back to the party. Getting online is quick and easy, as long as you have wireless Internet access. We did notice some lag when playing online, but it seemed to smooth out after playing for a while. The lengthy load times from the console version of the game are just as apparent in the PSP version, and they do tend to break up the flow of the game. This is especially frustrating when playing online, as the game pauses anytime a player accesses the character menu. X-Men Legends II looks great for a PSP game, and it looks great on the small screen. In terms of detail and variety, it doesn't look like much was lost in the translation from console to handheld. You'll fight in a jungle, a factory, an ancient Egyptian temple, and even on top of a flying dirigible. The environments feel complex and huge, but most of the paths loop back on themselves, so you won't get lost or hit a dead end very often. Plus, there's a mini-map with an arrow to point you to exactly where you need to go. Every stage is filled with all kinds of stuff for you to destroy, from glowing mushrooms and giant boulders, to barrels and furniture. You can also knock down walls and destroy equipment, which really makes the battles feel chaotic and over the top. You can punch enemies through walls, smash rocks over their heads, and basically destroy every single thing in your path. Or you can just pick up enemies and chuck them over the nearest railing to watch them fall to their dooms. It seems simple, but in practice it's undeniably entertaining to watch Juggernaut or Colossus run into a group of bad guys and start tossing them around like rag dolls. Toward the end of the game, the levels do start to feel the same, and the puzzles are never quite complex or challenging. It isn't a major problem, though, since this game is all about combat anyway. Unfortunately, the PSP version of the game doesn't always run smoothly. The game actually locks up and sputters for a few seconds sometimes when the PSP is reading the UMD. This only happened to us after resuming play after saving a game, and the effect usually didn't last more than 10 or 15 seconds. It is annoying, but thankfully it doesn't happen frequently enough to throw the whole game off. The fixed camera is annoying at times, because it takes a while to adjust if you suddenly change directions. However, the game looks great and runs smoothly most of the time. The one area where X-Men Legends II could use some cleaning up is in its interface. The menus fill the screen with text that isn't arranged intuitively at all. Checking your stats or equipping new items is much more of a chore than it should be. You probably won't want to spend much time in the menus anyway, because they take a long time to load. You actually have to look at a load screen if you want to check the status of your party, and then you have to look at another load screen to get back to the action. It's especially annoying, because in a game like this, you want to be able to tweak stats or equip items quickly and easily. The sound in X-Men Legends II is quite good for a PSP game, but it isn't particularly remarkable. The music is your average orchestral score that doesn't get stuck in your head or anything, but it sits nicely in the background and kicks into high gear when the tension is up. The voice acting is completely intact, and it sounds perfectly campy, although some of the characters sound a bit silly. Professor Xavier is excellently voiced by Patrick Stewart, but Rogue sounds a bit too much like Dolly Parton, and Juggernaut sounds like a dirty imitation of Wolfman Jack. At 20 hours, this game will keep you occupied for plenty of bus rides to and from your local Android's Dungeon. Overall, X-Men Legends II is a lengthy and fun adventure that anyone with a PSP and an interest in superheroes or beat-'em-up games will certainly enjoy. It doesn't do anything new or groundbreaking in terms of gameplay mechanics, but the cast of characters and the story are more than enough to make it worth playing. The game takes about 20 hours to finish, but when you do, you can play it again on a different difficulty setting. Better yet, you can try playing through with a new combination of characters to see which combos work best. If you played any of the console versions of X-Men Legends II, you might want to pass on this since it's essentially the exact same game. However, if you're interested in the game and haven't played another version yet, the PSP is as good a platform as any to enjoy it on. Editor's note 11/08/05: Our original review incorrectly stated that this version of the game was missing some sound effects that were found in the console versions of the game. GameSpot regrets the error."}