{"ref": "https://www.gamespot.com/reviews/manhunt-2-review/1900-6181991/", "date": "October 30, 2007", "game_name": "Manhunt 2", "text": "A lot has been made about Manhunt 2's supposedly ultraviolent content. Like its predecessor, it depicts its share of grisly murders, gruesome decapitations, and a few swift kicks to the genitals for good measure. It's visually less grisly than the original Manhunt: The much-ballyhooed blurring added to the most extreme acts often makes it difficult to see exactly what bloodthirsty rages you're subjecting your victims to--particularly in the Wii version. However, don't take this to mean that Manhunt 2 doesn't deserve its M rating: There's plenty of gore, sex, and adult language to go around. There's also some solid stealthy gameplay to back up all the eviscerations. It's got its share of problems (we'll get to those later), and it's not quite as rewarding as the original, but there's a lot here into which patient gamers can sink their teeth. This isn't a series of random bloody tantrums--it's a calculated study in what drives a man to madness and to what extremes he will go to discover the truth. You wanna stay alive? Stick to the shadows. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Manhunt 2 Video Review 1 That man is Dr. Danny Lamb (not a randomly chosen name, certainly), an asylum inmate who manages to escape, thanks to a freak electrical malfunction. He doesn't remember much, but he's able to fill in bits and pieces through flashbacks, and with the help of fellow inmate and constant companion Leo. As Danny begins to remember more and more, he finds himself getting to the bottom of a medical experiment called ~The Project,~ as well as just how involved he was in its development. The plot is missing the degenerate thrills of the first Manhunt, but it still has a script only Rockstar could pen. The raunchy quips you'll overhear from the game's self-described ~hunters~ are sometimes creepy, often hysterical, and always worth a listen. Just don't expect anything as memorable as your encounter with Piggsy in the original Manhunt. Aside from the very nature of stealth gameplay (you always fear getting caught), there's nothing scary here. You're still fighting for your life, but unlike the original's protagonist, Danny could simply disappear if he so desired. The danger is secondary--a result of his need to find out exactly who he is and how he ended up this way. Uncovering the truth and revealing the past makes for an interesting tale, but it's not as engaging as the snuff film premise of the first, nor does it really ever take off, remaining content to mostly smolder until it pops its highly foreshadowed surprises. At least as far as the Manhunt games are concerned, fighting to stay alive is more compelling than fighting for your sanity. It's still an interesting story that is accentuated by an appropriately dirty and dank visual design. You'll explore a raunchy, sticky sex club; gritty gas stations; and slummy warehouses; all places that seem like you could catch some nasty disease just by looking at them. A scratchy, slightly blurry filter gives everything the faint haze of scan lines, as if you're watching an old VHS tape. That effect is particularly pronounced in the PlayStation 2 version. That isn't to say that Manhunt 2 rises to the occasion from a technical standpoint. Animations and character models look terribly dated. Some environments are also washed out and textures aren't detailed. The Wii release tends to maintain a better frame rate than the PS2, though there are occasional slight pauses when the Wii accesses the disc, an issue that also crops up from time to time on the PS2--just less often. Aside from these differences (and a few others to be noted shortly), the two versions look more or less identical. The doomed ambience is further accentuated by a minimalist sound design that features an eerie soundtrack and limited environmental noise. Silence is put to good use here, creating moments of tension when you must remain perfectly still and making the occasional eruption in the soundtrack even more effective. The voice-overs are good too, not just from the leading men, but from the random hunters you overhear. You'll hear guards in the sex dungeon whine about their sexual frustration or masked patrolmen taunt you to come out of the shadows, and most of it's acted with just the right amount of coarse charm. There are lots of shadows in Manhunt 2, which you'll be hiding and waiting in for a good portion of the game. You control Danny from a third-person view, avoiding the watchful eye of enemies and attempting to pick them off one by one. The easiest way to do this is to hide in a dark corner and lure a foe over by throwing a brick or punching the wall. The noise will attract nearby hunters, who have a tendency to walk over and stare straight at you for a moment before shrugging their shoulders then walking away. This is your chance to perform one of the infamous execution moves--the violent showcase of Manhunt 2's visceral action. Can you tell what's going on here? Neither can we. There are three levels of executions, depending on how long you hold the execution button. Functionally, all three levels result in your adversary's untimely demise. But in this game, you want to kill with style, and a level three execution is literally a bloody mess. Once you release the button (or thrust the Wii Remote in the appropriate direction), the slaughter begins. On the Wii, you'll also jab the Wii Remote and Nunchuk over the course of the kill in a manner that more or less imitates the moves you're performing. The execution you perform depends on the weapon you have equipped and whether there are any interesting environmental features nearby. You might stab the hunter in the back, kick him in the crotch, then slam a manhole cover on his head. Or perhaps eviscerating him with a crowbar is more your thing. Or if you're a pyromaniac, you may prefer to douse him in gasoline and set him on fire. How all this looks will depend on the version you are playing. On the Wii, the entire scene is rendered through a blurry red filter that gives you a merely vague idea of what's going taking place. The movement and splattering sound effects make it clear that no one wants to die a death quite that painful--you just don't get to see the details. As a result, you'll be paying more attention to the motion prompts at the top left of the screen than trying to figure out the onscreen action. On the PS2, the filter is less blurry and blinks on/off so you can see more of the grisly kill--much more of it. The PS2 version also features a geometric pattern that flashes at the beginning and end of the execution. The more visible kills make this version far more satisfying because the simulated motions with the Wii Remote can't compare to the clarity of the PS2's gruesomeness. Still, pulling off an execution move can be rewarding on either version because they often cap several minutes of patient sneaking and nail-biting stillness. The stylized filters visually express Danny's rage and confusion, so they're cool from a story perspective. But they linger for a few seconds after the execution is over and you are deposited back into the level proper, which is a big frustration in a stealth game where you need to stick to the shadows. That moment can mean the difference between life and death. Manhunt 2 is often very unforgiving of your mistakes, and a couple of hunters with nightsticks are tough to handle. Forcing you to wait for the filter to clear so that you can see where you are going is an unnecessary annoyance in a game that requires so much precision of movement. Boom. Squish. As you would expect from a stealth action game, you can hug walls and peek around corners. On the Wii, peeking is handled by tilting the Nunchuk, which is a clever design move that feels just right. There are some other mechanics at play too, such as your need to be perfectly still should a hunter get too close while you're lurking in the shadows. At these times, he might be inches from your face, and you need to ensure that you stay completely hidden. On the Wii, this means holding the Wii Remote perfectly still (a natural solution), whereas you press a contextual button on the PS2. There are a number of nagging gameplay issues, with enemy artificial intelligence sitting high on the list. Enemies get stuck jittering between objects, forcing you to unstick them by grabbing their attention. They'll occasionally run past without noticing you or patrol a 3-foot-square area over and over again for no apparent reason. Another big annoyance is specific to the Wii: The A button is given too much to do. This button is mapped to using weapons, climbing, picking up bodies, executing targets, and more. You may want to execute your foe, but God forbid if you happen to be standing on a dead body because you'll pick it up instead--and the ensuing animation will turn you from murderer to victim. And speaking of buttons, the Wii version doesn't let you skip cutscenes. Considering stealth games always benefit from some trial and error, this is a grievous offense because you are forced to watch the same scene multiple times if you have to reload. Danny can hold his own somewhat in standard melee combat, as long as he is armed with the right weapon. You'll use clubs, knives, shards of glass, and plenty of other instruments. On the Wii, you attack your foes by swinging the Wii Remote and Nunchuk, but on the PS2, you mash a button. In both versions, melee fisticuffs are deliberate affairs, and you should only expect to handle one enemy at a time with ease--if that. If you attract the attention of more than one, it's better to run back into the shadows. Mistakes will cost you: Some weapons will knock you down--and it takes forever to get back up, which almost always spells certain death. There's also a small assortment of firearms in Manhunt 2. Shooting enemies isn't as gratifying as beating them to a pulp, but headshots still produce a smattering of blood. In most of these circumstances, you'll be hugging a wall or crouching behind an object, popping out to take potshots. The Wii again proves itself to be a natural home to shooting mechanics here, letting you aim with the Wii Remote and firing with the B button. On the PS2, you enter aiming mode by holding L1 and firing with R1. Danny is not a weapons expert, so perhaps accordingly, the controls handle loosely. Nevertheless, shooting doesn't feel as precise as you would like, particularly on the Wii, where the jittery targeting reticle never lets you feel quite in control of whether you'll land that elusive headshot. It's also not as challenging as the proper stealth elements mostly because your foes have the aiming skills of a third grader with a water pistol, and have a tendency to unload one clip after another into walls. Whatcha gonna do when they come for you? Yet there's no doubt that fans of sneaking will get a lot out of Manhunt 2. Aside from the occasionally flaccid gunplay, the game is highly challenging, especially so on the appropriately titled insane difficulty level. Some of the level designs are truly tricky, such as one in which a helicopter's spotlight keeps you constantly on the move. This isn't for everyone; if you're prone to fits of frustration when playing games like Splinter Cell and Hitman or expect to recover from mistakes easily, Manhunt 2 won't do you any favors. But if you're into that sort of thing, you'll enjoy the 15 hours or so of gameplay it provides and may even want to try unlocking the alternate ending. It may not have the same primal impact as the original Manhunt, but the sequel features plenty of tense stealth gameplay to complement its violent subject matter. The clarity of that violence--and some Wii-specific annoyances--makes the PlayStation 2 version the superior one. But either way you slice it and dice it, fans of the original will have something new to chew on with Manhunt 2, which is a good, sneaky adventure. The stylized filters visually express Danny's rage and confusion, so they're cool from a story perspective. But they linger for a few seconds after the execution is over and you are deposited back into the level proper, which is a big frustration in a stealth game where you need to stick to the shadows. That moment can mean the difference between life and death. Manhunt 2 is often very unforgiving of your mistakes, and a couple of hunters with nightsticks are tough to handle. Forcing you to wait for the filter to clear so that you can see where you are going is an unnecessary annoyance in a game that requires so much precision of movement. Boom. Squish. As you would expect from a stealth action game, you can hug walls and peek around corners. On the Wii, peeking is handled by tilting the Nunchuk, which is a clever design move that feels just right. There are some other mechanics at play too, such as your need to be perfectly still should a hunter get too close while you're lurking in the shadows. At these times, he might be inches from your face, and you need to ensure that you stay completely hidden. On the Wii, this means holding the Wii Remote perfectly still (a natural solution), whereas you press a contextual button on the PS2. There are a number of nagging gameplay issues, with enemy artificial intelligence sitting high on the list. Enemies get stuck jittering between objects, forcing you to unstick them by grabbing their attention. They'll occasionally run past without noticing you or patrol a 3-foot-square area over and over again for no apparent reason. Another big annoyance is specific to the Wii: The A button is given too much to do. This button is mapped to using weapons, climbing, picking up bodies, executing targets, and more. You may want to execute your foe, but God forbid if you happen to be standing on a dead body because you'll pick it up instead--and the ensuing animation will turn you from murderer to victim. And speaking of buttons, the Wii version doesn't let you skip cutscenes. Considering stealth games always benefit from some trial and error, this is a grievous offense because you are forced to watch the same scene multiple times if you have to reload. Danny can hold his own somewhat in standard melee combat, as long as he is armed with the right weapon. You'll use clubs, knives, shards of glass, and plenty of other instruments. On the Wii, you attack your foes by swinging the Wii Remote and Nunchuk, but on the PS2, you mash a button. In both versions, melee fisticuffs are deliberate affairs, and you should only expect to handle one enemy at a time with ease--if that. If you attract the attention of more than one, it's better to run back into the shadows. Mistakes will cost you: Some weapons will knock you down--and it takes forever to get back up, which almost always spells certain death. There's also a small assortment of firearms in Manhunt 2. Shooting enemies isn't as gratifying as beating them to a pulp, but headshots still produce a smattering of blood. In most of these circumstances, you'll be hugging a wall or crouching behind an object, popping out to take potshots. The Wii again proves itself to be a natural home to shooting mechanics here, letting you aim with the Wii Remote and firing with the B button. On the PS2, you enter aiming mode by holding L1 and firing with R1. Danny is not a weapons expert, so perhaps accordingly, the controls handle loosely. Nevertheless, shooting doesn't feel as precise as you would like, particularly on the Wii, where the jittery targeting reticle never lets you feel quite in control of whether you'll land that elusive headshot. It's also not as challenging as the proper stealth elements mostly because your foes have the aiming skills of a third grader with a water pistol, and have a tendency to unload one clip after another into walls. Whatcha gonna do when they come for you? Yet there's no doubt that fans of sneaking will get a lot out of Manhunt 2. Aside from the occasionally flaccid gunplay, the game is highly challenging, especially so on the appropriately titled insane difficulty level. Some of the level designs are truly tricky, such as one in which a helicopter's spotlight keeps you constantly on the move. This isn't for everyone; if you're prone to fits of frustration when playing games like Splinter Cell and Hitman or expect to recover from mistakes easily, Manhunt 2 won't do you any favors. But if you're into that sort of thing, you'll enjoy the 15 hours or so of gameplay it provides and may even want to try unlocking the alternate ending. It may not have the same primal impact as the original Manhunt, but the sequel features plenty of tense stealth gameplay to complement its violent subject matter. The clarity of that violence--and some Wii-specific annoyances--makes the PlayStation 2 version the superior one. But either way you slice it and dice it, fans of the original will have something new to chew on with Manhunt 2, which is a good, sneaky adventure."}