{"ref": "https://www.gamespot.com/reviews/vampire-rain-altered-species/1900-6197395/", "date": "September 8, 2008", "game_name": "Vampire Rain", "text": "Vampire games apparently can't be staked. If they could be finished off a la Van Helsing, you can bet that Vampire Rain: Altered Species would never have made it to the PlayStation 3. Developer Artoon's blend of Splinter Cell-style stealth gaming with toothy creatures of the night was so awful when it debuted for the Xbox 360 last summer that it deserved to be locked inside its coffin for good. Alas, the game has been resurrected for a new platform with a subtitle added to it in the hopes of fooling people into believing that this is a superior sequel. It isn't. This is a mostly straight-up reissuing of last year's debacle, loaded with the same crippling design screwups and absurd difficulty. Playing Splinter Cell with vampires isn't as cool in reality as it is on paper. About the only good thing about this game is that it doesn't waste your time; it broadcasts its awfulness right from the start. The campaign tells the ludicrous tale of John Lloyd, member of a team of plucky commandos fighting a secret war against postmodern vampires called Nightwalkers. These fanged goons are biting their way across America and will outnumber Joe Sixpacks with pulses in precisely 908 days. The new PS3 version of the game better explains how this is happening, courtesy of a relocated flashback scene, although the whole story still seems faintly ludicrous and not the slightest bit scary. Civilians are still walking the streets at night without a care in the world, so it's hard to believe that you're in the middle of a bloodsucking apocalypse. Visual design of the game is too urban and high-tech to give off any sort of creepy gothic vibe, so the game always goes for the gross-out. Yet gory scenes, such as the one where you discover some of your buddies have been turned into performance art through the innovative use of stop signs, seem more like cheap gimmicks than truly spooky. Oddly enough, the rain of murderous vampires doesn't keep pedestrians and cops from wandering the streets at all hours of the night. It's hard to get too creeped out by the protagonist and setting, either, because both are pulled straight from Splinter Cell. Aside from fanged foes ripping your throat out when you lose, there aren't any differences between Vampire Rain and a typical espionage-style sneaker. Lloyd looks exactly like Sam Fisher, right down to his black Underoos and night-vision goggles. Mission objectives are taken from the Third Echelon playbook. You're sent on one technological scavenger hunt after another, set in usual-suspect locales, such as offices, parking garages, warehouses, and deserted city streets. Goals are very formulaic. Even though Lloyd is supposed to be fighting an undead invasion, he spends most of his time dealing with standard spy stuff, such as sabotaging electronics, shutting down power plants, and sniping bad guys. Level design should also be familiar because you spend the game creeping through alleyways, climbing ladders, and sliding down wires or poles in a desperate attempt to avoid the vision cones of patrolling bad guys displayed on your minimap. The only striking difference between this game and a typical sneaker is that you're dealing with undead killing machines that have no personality--not the usual sentries whining about noisy rats. Instead of getting to listen to inane conversations tipping you off to the guards, you get a cheesy flashing-eyes special effect that lets you know somebody with fangs is watching and you've got a couple of seconds to get under cover. If you fail, you're dead. If you succeed, congratulations--you've just beaten a transparent game mechanic. Still, this isn't exactly a by-the-numbers stealth game. New ideas are introduced in almost every area, but these innovations just mess up what should have been a pretty straightforward game design. First of all, Nightwalker vision cones are rough approximations of what the beasties can actually see. Shadows are more authentic zones of darkness here, not the magic cloaking fields seen in the Splinter Cell and Thief games. But even though you get used to this vagueness, the fickle vision cones force you into tedious trial and error. Sometimes, you'll go to great lengths to get around a sentry that you're positive will be able to easily spot you, only to eventually abandon this alternate route and discover that you can dart around the bloodsucker unseen. Other times, you'll try to walk by a Nightwalker a half block away and be sighted immediately. To make keeping track of enemies even more bothersome, their vision cones are not automatically activated on the minimap. Instead, you have to switch on the necroscope feature of your night-vision goggles to check heat signatures and separate the vamps from innocent derelicts wandering the streets at 3 a.m. Second, Nightwalkers are virtually impossible to kill. Throughout much of the game, weapons are worthless, so it takes a full clip of the automatic rifle or the submachine gun to take down a single Drac-pack refugee. They are also amazingly fast and kill with just two swipes, the first of which always incapacitates you. And once a Nightwalker gets you in its sights, it goes on the hunt until one of you is dead and can even pursue you by leaping all the way up to the tops of buildings. So there's no running away or hiding. Later weapons, such as a UV knife and a sniper rifle, make it easier to kill Nightwalkers, although these new-and-improved devices require rare ammo (yes, even the freaking knife), and disappear at the end of each level. Some levels appear to have been tweaked for the PS3 release, however, which makes the game marginally less difficult in spots. The vampire population seems to have been trimmed back in some key locales, and ammo caches have been made more common. These two changes make both sneaking and shooting more palatable. Still, nine times out of 10, vamp numbers, toughness, and speed continue to make it suicidal to try fighting them. A Nightwalker's speed is pretty cool to behold in a picture, but it's very frustrating to actually be on the other end of its fangs and claws. Level design causes more headaches. Paths forward are relentlessly linear in the campaign missions. Even though street scenes in the game appear wide open with lots of alleys to explore and ladders to climb, you're hemmed in by invisible borders. Basically, you're herded toward the single route through a level by both invisible and real walls, as well as heavily populated groups of vampire sentries, that you immediately know you have to find a way around them. Everything is so dark, however, that it can be tough to figure out which way to go. Most backgrounds are so shadowy that fine details are swallowed by the gloom. You frequently can't be certain of the presence of vampire sentries until you stumble over them. Night-vision and necroscope goggles can be used to pierce the blackness, but the battery powering them runs down in a few meager seconds. Vampire Rain's murky visuals haven't been cleaned up for the PS3 port. This take on the game looks and performs worse than its 360 predecessor. Load times are long, despite a mandatory 30-minute installation of almost 4GBs to the PS3's hard drive, and jagged edges are on show everywhere. Sound effects don't help you navigate the darkness, either. Vamps generally don't say anything when they spot you, and their footsteps are so muted that they might as well be walking on air. They never talk to one another, shuffle their feet, cough, or even complain about how Count Chocula is an offensive vampist stereotype. Generally, they just stand stock still, mindlessly staring into space or mindlessly staring into space and smoking. The only noteworthy aspect of the audio is a high-pitched score that raises your heart rate and the squelching sound of a vampire mowing down on your carotid artery during the you-got-killed cinematic. Solo gameplay modes outside of the campaign are generally unimpressive. One-off levels called trial stages can be more entertaining than the full-blown story missions because of somewhat innovative ideas, such as playing tag with all the other members of your team or grabbing a weapon from under the nose of a vampire, but they are too short to be all that involving. The only multiplayer option that stands out is Death or Nightwalkers, a solo and team Deathmatch variant where a killed player can turn into a vamp. Of course, all this does is give the player the absurd speed and strength of the vampires, so games end up unbalanced. It's probably best to stick with the uninspired alternatives online, which include Deathmatch, Team Deathmatch, and a Capture-the-Flag clone where you capture a flame. Now let's go back to hoping that this is the end of the Vampire Rain series. But just to be absolutely sure that nobody has any bright ideas about summoning the game back from the grave for a third go-round, please hang some garlic over your Wii."}