{"ref": "https://www.gamespot.com/reviews/elemental-gearbolt-review/1900-2547430/", "date": "January 23, 1998", "game_name": "Elemental Gearbolt", "text": "With the recent release of Time Crisis, Point Blank, and now Elemental Gearbolt, it finally appears that a good number of gun games are coming out for the Sony PlayStation. Or, at the very least, a number approaching the volume of PS gun peripherals currently on the market.Elemental Gearbolt is, if anything, unique. It's a first-person-perspective rail-based game that combines gameplay of two genres: traditional gun games and shooters. As in Time Crisis and Virtua Cop, EG's gameplay occasionally pauses in spots to let you pick off enemies at your will. But overall, the pace is more like Panzer Dragoon (whose graphics and sci-fi/fantasy theme it generally mirrors), which keeps you consistently moving along. The Elemental Gearbolt premise, explained and furthered by extended animated sequences, puts you - either by yourself or with a gun-toting friend - up to the task of trying to vanquish an empire that has overtaken the land. The goals within its six stages of play are simple: Wipe out the troops and sub-bosses, shoot fairies free from the jeweled magical prisons that envelop them, and take on the main bad guy himself.The mechanics of having to collect more ammo and reload are withdrawn, as your gun is apparently magic-based. Three elemental weapon options are available, which vary in degrees of damage, speed of fire, and blast radius. The fire elemental setting provides a slow but very powerful shot that can destroy most enemies in a single attempt; the water elemental expels three weak but fast shots; and the lightning elemental works like a shotgun, slowly scattering a hoard of wide medium-powered blasts. The fire elemental is primarily used within the beginning areas of each stage for wiping out the onrushing swarming masses. The water or lightning elemental can provide quick shots for destroying fire from the sub-bosses and boss, while a companion, if present, bombards them straightaway with the fire elemental setting.Once a level is finished, you are presented with the ~trade-off~ system, which lets you decide if you want to take your bonuses in the form of experience points, score points, or percentages of both. Bonuses come from the number of enemies destroyed, coins collected, and from how many consecutive hits you have accomplished. Though your motivation for getting a high score seems to be solely braggadocio, advancing levels through experience points will increase maximum health, just like in an RPG.Namco's incredibly accurate GunCon is optional in Elemental Gearbolt, but it's not necessarily needed, as the enemies are quite large, and shooting in their general direction seems to cap them fairly easily. Unlike in Time Crisis, foes don't shoot at you from far away, although you can shoot at them the second you see them, with the rail bringing them quite close, quickly. Besides the obvious threat of huge menacing sub-bosses, the real challenges seem to come from freeing all the encased fairies and pulling off a high number of consecutive shots. Sometimes when you emerge from around a corner, one or two visible fairies might be in your line of sight, but you'll only have one or two seconds to shoot them before you've carried on, staying with the pace of the game. And even though being square on your target isn't absolutely necessary to make a successful hit, the occasional bobbing views will sometimes frustratingly throw you off completely.In bringing Elemental Gearbolt over from Japan for US audiences, Working Designs has performed a number of improvements on the game. Where it was once fairly easy, it's now pretty tough. You're no longer able to play through the game in its easiest mode, and even the normal setting sees you fighting for you life and searching the screen for health-restoring elixirs. They've also added 12 hidden chalices throughout the game, which correspond to the different elemental weapons, increasing the power of the one it works in accord with.In its original state, the Japanese EG was a likable break from the norm, though overall a little too quick to beat. Working Designs' revisions have made it a much more challenging gun game - one that's now much easier to recommend. It's not quite at the level of Namco's Time Crisis or Point Blank, but it's far and away a lot more fun than Midway's Maximum Force and Area 51."}