{"ref": "https://www.gamespot.com/reviews/the-black-mirror-review/1900-6079872/", "date": "November 7, 2003", "game_name": "The Black Mirror", "text": "Good voice acting can bring a game's characters to life or at the very least make a flat story seem a little livelier. As vital as it is, voice acting still seems to be an afterthought in many games. For some games, it seems like the hiring criteria are merely that the actors can speak English and can stay awake through the recording sessions. For a perfect example of how bad voice acting can almost single-handedly ruin a game, look no further than The Black Mirror, where the voice-overs are so horrid as to make the gameplay almost unbearable at times. That's actually just one of The Black Mirror's faults. It's true that the game has some real strengths, too, but the lousy voice-overs, clumsy writing, and glacial pace make it too hard to appreciate them most of the time. The usual (boring) suspects gather at the castle. The Black Mirror's story feels like a rambling mishmash of Edgar Allan Poe, H.P. Lovecraft, Scooby Doo, and the board game Clue. You play as Samuel Gordon, scion of the ancient Gordon clan that has inhabited Black Mirror Castle in England for centuries. Samuel's grandfather, William Gordon, has died under the oddest circumstances. Prone to secrecy and increasingly odd behavior, the elder Gordon started locking himself away in one of the castle's towers, where he was researching mysterious family legends. One night someone or something made its way into the locked tower, and Gordon fell--or was pushed--out the window, impaling himself on a wrought-iron fence far below. With the family in mourning, Samuel returns to the castle and reacquaints himself with his grandmother and meets various family friends and servants, like the butler and family doctor. In his quest to get to the bottom of William's death, Samuel also explores other locales, like a quaint nearby town, an old church, a morgue, and a mine. The Black Mirror is pitched as a nightmarish mystery, but there's precious little about it that's frightful, and you'd be hard pressed to find a less emotionally engaging game. There is one neat twist near the end of the story, but almost every character along the way is bland and forgettable; no one seems particularly real, let alone worth your interest. The game's protagonist is downright annoying with his prissy, affected mannerisms, generic appearance, and generally silly air. This is all doubly unfortunate because a huge chunk of The Black Mirror revolves around making Samuel have interminable conversations with everyone he meets. Talking is the main way to gather clues and to make the tediously linear story progress from point A to point B. Yet who wants to listen to such boring nonentities? Hackwork dialogue certainly doesn't help, nor does the comical propensity of many characters to avoid contractions and needlessly announce whatever they're going to do next: ~I will go now,~ and so forth. It's not merely the bland, unfocused writing that makes these conversations so tedious: Voice acting stumbles to a miserable new low in The Black Mirror. Almost everyone speaks in an unbearably slow, stilted, declamatory style, as if trying to explain something to a small child or give directions to a foreign tourist. Couple that with the sometimes comically posh British accents, and you get a recipe for disaster. The drying-paint pace that the actors adopt, coupled with the clunky dialogue, makes the simplest exchanges stretch out for a seeming eternity--The Black Mirror is painfully slow even by adventure-game standards. Not surprisingly, the actor who voices a grave-digger literally sounds like he was falling asleep behind the microphone during the recording sessions. Since adventure games typically lack any real action, character building is vital. Here it's almost impossible to care about the characters, both because they're fleshed out poorly and because they often sound so unrealistic or downright laughable. Another problem with all the conversations is that they emphasize just how linear The Black Mirror is. This game unashamedly thrives on ~game logic.~ You know full well, for example, that a certain object is at the bottom of a fountain, yet you can't simply reach down and pull the object from the shallow water. Even when you learn where the drain pump for the fountain is located, you can't work the controls or find out how they work until you find another object related to the one in the fountain. This sort of thing happens throughout the game: Regardless of what you've figured out on your own, you're forced to talk to one person before you can interact with another or forced to stay in one locale until the game decides you can leave. Worse still, you're forced to leave certain objects alone until the time magically becomes right. This makes it too easy to spot an object early on, conclude that it's unimportant window dressing, and then forget about it. Just as bad, you'll need to return to some characters quite a few times before they'll divulge necessary info, which emphasizes the incredibly slow pace of the game. Thanks to problems like these, you often feel like you're being dragged around on a leash instead of exploring and making decisions on your own. Happily, there are some things in The Black Mirror that save it from being a total loss. The interface is clear and helpful: Pressing the Tab key highlights all known exits from the current area, for example. If you hold the cursor over an exit point, text will appear to tell you exactly where the exit heads. The game is also rather lengthy, with plenty of diverse and colorful areas to explore (though lengthiness is a mixed blessing considering some of the things you'll suffer through in the process). The puzzles are generally varied, entertaining, and challenging. Some are inventory based, like finding the right key to the right lock, while other challenges include riddles, jigsaw or sliding tile puzzles, or manipulations of mechanical devices. Unfortunately, some puzzles repeat each other, demand way too much traipsing back and forth, or require a lot of blind fumbling to find a proper sequence of levers or wires. Also, it's way too easy to overlook a number of tiny items you need, and some puzzles are just too obscure. Visit creepy locales, like an old sanatorium. Looking around for objects is at least reasonably fun to do, thanks to the diverse, finely detailed visuals. Some areas do look rather cheesy: Black Mirror Castle looks like it was decorated by Gomez and Morticia Addams, with looming portraits of evil ancestors, giant skulls above archways, and pseudo-gothic bric-a-brac. Students of the humanities will also get a laugh out of the way a portrait by Hans Holbein is passed off as a Gordon ancestor and will wonder about an incongruous portrait of Ludwig II of Bavaria staring down at them from another wall. This art-history-book clip-art approach seems rather lazy. Despite some hiccups like that, most of the scenes are attractive and suitably autumnal and melancholy, particularly when it starts to rain outside during part of the game. The character animations are jerky and very slow, but swaying willow trees, a crackling fire in a hearth, and other scenic animations add a little vitality to an otherwise stiff game. Fine ambient sound effects and suitably chilly music offer some recompense for the abysmal voice work. It's a real shame that The Black Mirror suffers from such execrable acting and clumsy writing. If those had been handled better, it would have been a flawed yet rather entertaining game graced with some attractive locales and interesting puzzles. As it stands, it's only for very forgiving adventure-game fans."}