{"ref": "https://www.gamespot.com/reviews/fifa-soccer-2004-review/1900-6084784/", "date": "November 26, 2003", "game_name": "FIFA Soccer 2004", "text": "In the grand scheme of things, FIFA Soccer 2004 is a good PC game. It adapts well to newcomers but keeps plenty in reserve for skilled, seasoned veterans. It is the first FIFA to feature a career mode. And, despite some issues we'll tackle later, it is nicely presented and blessed with an incredibly deep control system. Unfortunately, it is marred with blemishes. It also follows a pattern that's beginning to creep into the most recent versions of some of EA Sports' team sport titles. Namely, despite its many positive attributes, its most important element--gameplay--simply doesn't seem to be advancing quite as quickly as it should. FIFA 2004 doesn't feature any form of precipitation, but it does sport some very convincing sun effects. This may be seen as a harsh judgment, considering the perennial popularity and general critical acclaim the series continually garners, but the truth is that FIFA has been around for over a decade now. In that time, EA Sports has blown the roof off of the game's audio-video components. Starting in 1994--with 2D sprites and flat, comparatively lifeless environments--and culminating in today's stunningly better-than-TV delivery and incredible motion-captured players, the FIFA presentation has never failed to impress. Rather than instilling the game with artificially intelligent opponents and teammates who truly mimic the nuances and dynamics of real-life, world-class soccer stars--and thus compelling the human player to act accordingly--the development team continually seems more fixated on adding incredibly complex button-pumping maneuvers that feel more clinical than sport-oriented. Furthermore, though FIFA's AI programming is quite acceptable in the short term, it begins to feel downright repetitious after you've played a couple dozen contests. This sort of thing was perfectly fine for much of the first 10 years, but recently it's all beginning to feel a little old. We'll explore this concept further, but let's first look at some of FIFA 2004's more noticeable practical innovations. As is typical of the series, EA Sports has once again tweaked its gameplay/AI engine just enough to keep us interested. For the most part, the game does feel marginally better. You're likely to notice, right off the bat, that it features a comparatively large number of deflected and intercepted balls. Whether you're shooting or passing, chances are that if you're in the midst of a group of players, your ball will strike something on its way to the target. This is a good thing, as are the newly modified defensive alignments and structuring. In FIFA 2004, AI defenses tend to back off the ball carrier somewhat and, thus, clog your path to the net. This, in turn, forces you into a far more passing-oriented attack than ever before. To really excel in FIFA 2004's more-imposing difficulty levels, you'll have to do more than learn the fine art of pinpoint passing. The game's new ~off-the-ball control,~ accessed during gameplay by clicking a specified button or key, allows you to take command of your nonball-carrying players while you're still controlling the ball carrier. A great concept, off-the-ball control lets you direct a given player to a new location, and it makes him perform other actions he most likely would not have made if left under the guidance of the game's programming. The most challenging aspect of off-the-ball control is its inherent complexity. Put simply, it's danged difficult to do all the stuff you normally do, while, at the same time, working the myriad other buttons to control other players. Still, most quick reflex gamers should eventually get the hang of it and will enjoy it once they do. They'll enjoy it even more once they've developed a patient approach to their attacks--by biding their time and working the ball around carefully while waiting for passing lanes to open up. In this way, FIFA 2004 does seem more authentic. Moreover, the game's improved on-the-fly management utility, which permits a bunch of tactical modifications while play continues, is tailor-made for veteran players who are looking to add weapons to their arsenals. In FIFA 2004, clean chances, like this one inside the goal box, are very rare indeed. Even with the new enhancements, FIFA's gameplay doesn't effectively duplicate the ebb and flow or real-world intricacies of real-life soccer. Granted, the game will undoubtedly awe rookies. It is, after all, an amazing achievement when compared to many of the alternatives--both past and present. Yet there's a pattern to the AI programming that feels both repetitious and artificial. And good AI is, of course, the key to any game of this nature. You'll need a few contests under your belt before you begin to notice it, but soon you'll see that FIFA 2004's AI defenders habitually repeat their actions. For example, virtually any time you're able to negotiate your ball carrier into the opposing box, the defending side quite suddenly displays amazing speed and prowess. Almost immediately, you're dispossessed of the ball. Conversely, there are certain maneuvers you can enact outside the box that will cause any immediate defenders to become ridiculously confused, thus causing them to run to the wrong spot or to stand still as you saunter on by with the ball. Furthermore, if you should instead try to use an open field speed burst to blow past a defender--a maneuver that should usually meet with success if your player is an acknowledged star while the defender is not--you'll almost always be stripped of the ball. That is, unless you're making the run down a wing, where the defenders seem curiously untalented. Worse still, FIFA 2004 will--once again--give you the impression that some of its plays and some of its results are preordained. Certainly there can be no other logical explanation for why a world-class striker would miss a wide-open cage from just 10 yards out. This would also explain last-minute equalizers that wouldn't find the back of the net in a local sandlot pickup game. Yet these sorts of incidents are, once again, rather commonplace in FIFA, thus making it seem as though they happen for no other apparent reason than to keep the score irrationally close. The players--and even the ball--in FIFA 2004 are gorgeously rendered. To reiterate, the FIFA AI engine is by no means horrific. Certainly it is one of the reasons the game sits at or near the top of the PC sports world. You'll undoubtedly find that your own teammates behave in a generally believable fashion, but it still doesn't change the fact that hardcore soccer gamers who study and learn the game from top to bottom will likely find its AI repetitive, patterned, and sometimes highly questionable. One area that clearly could have been brilliant but suffers from a seemingly incomplete development cycle is FIFA 2004's depiction of fouls. It's obvious from the first time you play the game that EA Sports has decided to add much more middle ground to the foul routine. Now, you don't necessarily have to commit an aggressive tackle to knock a player to the ground; a normal tackle can also result in a spill. Likewise, an aggressive tackle no longer guarantees that the targeted player will hit the turf. This is a much more authentic routine that more faithfully re-creates real-life tackles. However, the officials often seem blissfully blind to the whole thing, thus whistling down tackles that are completely legit and letting vicious tackles go unpenalized. As a result, you're stuck in the middle, and you don't really know what to do. Visually, the latest FIFA is, by and large, the finest installment to date. If you're unfamiliar with the series, you should know that FIFA 2004 is uncannily reminiscent of a televised world-class match. The game features 500 teams from 18 leagues and includes a truly grand total of 10,000 players, each modeled after his real-life counterpart. EA Sports boasts that it has secured 500 official licenses, and it shows. Corporate logos are everywhere--from uniforms to stadiums and even to off-field interfaces. Bone-crunching tackles, like this one, can come in a wide variety of ways in FIFA 2004. FIFA 2004 players are downright spectacular. Certainly they're the most lifelike to ever grace a PC soccer game. One of the obvious high points are the player faces, which have now lost any remaining cartoonlike detail and now look eerily similar to the real thing. Player bodies are perhaps even more impressive, simply because they are capable of so many fluid humanlike movements. The development team has really gone to town in developing appropriate arm and torso animations, and the results are phenomenal. Now, when players bump and tussle, they do so using their arms for balance and as weapons. Post-whistle scrums are particularly delicious, what with all the new yapping and pushing going on. And when your little players finally emerge from a long half or contest, they sometimes do so with dirty uniforms. The game's stadiums are as wonderful as always, only now EA Sports has supplemented them with incredible sun glare and lens flare effects. Sadly, you may not always see what you should be seeing. Your experience may vary, but we initially found that FIFA 2004's graphics were too dark to be considered playable. We maxed out the brightness control on our monitor and searched for a nonexistent gamma correction tool, but the game continued to look as if it was being played at night with no artificial lighting. Then, suddenly--and without warning--all was well. We were never able to replicate the lousy lighting of the first few forays. We did try the game on a second PC, where it looked fine for the first few sessions, then--once again--assumed its darkened alter ego. Thankfully, the game reverted to its more-playable self after that and has remained that way ever since. While it's true that some stadiums offer different lighting than others, surely no stadium was intoned to be this ludicrously murky. Worse still, FIFA 2004 will--once again--give you the impression that some of its plays and some of its results are preordained. Certainly there can be no other logical explanation for why a world-class striker would miss a wide-open cage from just 10 yards out. This would also explain last-minute equalizers that wouldn't find the back of the net in a local sandlot pickup game. Yet these sorts of incidents are, once again, rather commonplace in FIFA, thus making it seem as though they happen for no other apparent reason than to keep the score irrationally close. The players--and even the ball--in FIFA 2004 are gorgeously rendered. To reiterate, the FIFA AI engine is by no means horrific. Certainly it is one of the reasons the game sits at or near the top of the PC sports world. You'll undoubtedly find that your own teammates behave in a generally believable fashion, but it still doesn't change the fact that hardcore soccer gamers who study and learn the game from top to bottom will likely find its AI repetitive, patterned, and sometimes highly questionable. One area that clearly could have been brilliant but suffers from a seemingly incomplete development cycle is FIFA 2004's depiction of fouls. It's obvious from the first time you play the game that EA Sports has decided to add much more middle ground to the foul routine. Now, you don't necessarily have to commit an aggressive tackle to knock a player to the ground; a normal tackle can also result in a spill. Likewise, an aggressive tackle no longer guarantees that the targeted player will hit the turf. This is a much more authentic routine that more faithfully re-creates real-life tackles. However, the officials often seem blissfully blind to the whole thing, thus whistling down tackles that are completely legit and letting vicious tackles go unpenalized. As a result, you're stuck in the middle, and you don't really know what to do. Visually, the latest FIFA is, by and large, the finest installment to date. If you're unfamiliar with the series, you should know that FIFA 2004 is uncannily reminiscent of a televised world-class match. The game features 500 teams from 18 leagues and includes a truly grand total of 10,000 players, each modeled after his real-life counterpart. EA Sports boasts that it has secured 500 official licenses, and it shows. Corporate logos are everywhere--from uniforms to stadiums and even to off-field interfaces. Bone-crunching tackles, like this one, can come in a wide variety of ways in FIFA 2004. FIFA 2004 players are downright spectacular. Certainly they're the most lifelike to ever grace a PC soccer game. One of the obvious high points are the player faces, which have now lost any remaining cartoonlike detail and now look eerily similar to the real thing. Player bodies are perhaps even more impressive, simply because they are capable of so many fluid humanlike movements. The development team has really gone to town in developing appropriate arm and torso animations, and the results are phenomenal. Now, when players bump and tussle, they do so using their arms for balance and as weapons. Post-whistle scrums are particularly delicious, what with all the new yapping and pushing going on. And when your little players finally emerge from a long half or contest, they sometimes do so with dirty uniforms. The game's stadiums are as wonderful as always, only now EA Sports has supplemented them with incredible sun glare and lens flare effects. Sadly, you may not always see what you should be seeing. Your experience may vary, but we initially found that FIFA 2004's graphics were too dark to be considered playable. We maxed out the brightness control on our monitor and searched for a nonexistent gamma correction tool, but the game continued to look as if it was being played at night with no artificial lighting. Then, suddenly--and without warning--all was well. We were never able to replicate the lousy lighting of the first few forays. We did try the game on a second PC, where it looked fine for the first few sessions, then--once again--assumed its darkened alter ego. Thankfully, the game reverted to its more-playable self after that and has remained that way ever since. While it's true that some stadiums offer different lighting than others, surely no stadium was intoned to be this ludicrously murky. Unfortunately, the game's interfaces are bad from beginning to end. They're a confusing mess that seem to make efficient navigation as difficult as possible. In fact, this may well be the worst menu structure of any recent vintage EA Sports product. Furthermore, the selection of gameplay options is woefully minimal. You can't, for example, adjust graphical minutia like lighting, on- or off-player detail, grandstand detail, or environmental effects. You can't increase the length of a half to more than 10 real-time minutes. And you certainly can't request to play in rainy conditions, because, despite early marketing to the contrary, the game does not support precipitation or dynamic weather of any sort. Incoming! A goalkeeper makes his move toward a powerful shot that's just been delivered from just outside the penalty box. The menu does hold some pleasant surprises, not the least of which is a career mode. In career mode, you'll undertake a five-season struggle to lift your team from the depths of the soccer world to the top of it. Along the way, you'll transfer players, initiate training sessions, earn money and, hopefully, increase your prestige to such lofty heights that you'll be hired away by a better, more-celebrated club. We had an issue with the training routine, which simply involves clicking a few mouse buttons rather than rewarding you for the skillful new moves that you've developed on the pitch. Certainly, the career mode isn't as deep as it could be. Nevertheless, it's otherwise a welcome new amenity. Rookies and anyone who feels the need to work on the finer points of their game will certainly appreciate FIA 2004's practice mode. This feature has been bounced around quite a bit during FIFA's history. Sometimes it's included, sometimes it's missing in action, and sometimes it appears without an option to practice alone on the pitch. This year's version has it all, going so far as to offer ~urban~ and ~rural~ settings, complete with appropriate neighborhood sound effects. Speaking of audio, FIFA 2004 is wonderful in this regard. For starters, the game ships with more than a dozen cool musical tracks that run the gamut from Brit pop to golden oldies, electronica, and world music. Back in the broadcast booth for another go is John Motson, this time with Ally McCoist. Though the game has trouble pumping out the phraseology quickly enough for frantic action sequences, both Motsen and McCoist deliver a good flow of dialogue that seems less rigid and more improvised than that found in prior editions. Laughter and good-natured bantering are not uncommon. For the 2004 edition, EA Sports has recorded 300 individual crowd chants that really add local flavor to the contests. Too bad the crowds don't wave banners and flags as they did in previous years. It should be noted that FIFA's normally superb replay component has been downgraded. Most critically, manual camera control has inexplicably become more difficult to operate. Furthermore, replay saves are not permitted without downloading and installing the first of what are likely to be several patches. You'll also need to download this patch if you want to customize your controller. If you don't, you're stuck with EA Sports' preconfigured button setup. With any luck, future patches will address some of the game's other issues. Three players bask in the afterglow of a well-driven shot. Multiplayer fans will undoubtedly rejoice over FIFA 2004's EA Sports Online compatibility. Sure, it will cost you a few bucks after your 14-day trial has expired, but never has finding human competition been easier. We logged-in and sourced a likely candidate within 30 seconds. Granted, we were annihilated 5-0, but we were able to start up another game, following the conclusion of the first one, within another half-minute. Of course, one of the benefits of playing another human is that you won't have to endure a fully AI-controlled side. In this respect, it's a wholly different game. Happily, our frame rates remained reasonable and lag times were bearable in both our online jaunts. That's not to say the game doesn't slow down some. It does, but it doesn't slow down so much that you'll want to pull the plug. All in all, FIFA 2004 seems to take several steps forward, while at the same time it takes a few steps back. It definitely does not push the gameplay to the high level that so many FIFA fans have waited for it to reach. Still, it is in many ways the best soccer game to be found on the PC. If you're a soccer buff who's never played the game on your PC, it will surely be a positive experience. If you're a returning veteran, you may want to weigh the game's new perks against some of its downfalls before you set down your hard-earned cash. Unfortunately, the game's interfaces are bad from beginning to end. They're a confusing mess that seem to make efficient navigation as difficult as possible. In fact, this may well be the worst menu structure of any recent vintage EA Sports product. Furthermore, the selection of gameplay options is woefully minimal. You can't, for example, adjust graphical minutia like lighting, on- or off-player detail, grandstand detail, or environmental effects. You can't increase the length of a half to more than 10 real-time minutes. And you certainly can't request to play in rainy conditions, because, despite early marketing to the contrary, the game does not support precipitation or dynamic weather of any sort. Incoming! A goalkeeper makes his move toward a powerful shot that's just been delivered from just outside the penalty box. The menu does hold some pleasant surprises, not the least of which is a career mode. In career mode, you'll undertake a five-season struggle to lift your team from the depths of the soccer world to the top of it. Along the way, you'll transfer players, initiate training sessions, earn money and, hopefully, increase your prestige to such lofty heights that you'll be hired away by a better, more-celebrated club. We had an issue with the training routine, which simply involves clicking a few mouse buttons rather than rewarding you for the skillful new moves that you've developed on the pitch. Certainly, the career mode isn't as deep as it could be. Nevertheless, it's otherwise a welcome new amenity. Rookies and anyone who feels the need to work on the finer points of their game will certainly appreciate FIA 2004's practice mode. This feature has been bounced around quite a bit during FIFA's history. Sometimes it's included, sometimes it's missing in action, and sometimes it appears without an option to practice alone on the pitch. This year's version has it all, going so far as to offer ~urban~ and ~rural~ settings, complete with appropriate neighborhood sound effects. Speaking of audio, FIFA 2004 is wonderful in this regard. For starters, the game ships with more than a dozen cool musical tracks that run the gamut from Brit pop to golden oldies, electronica, and world music. Back in the broadcast booth for another go is John Motson, this time with Ally McCoist. Though the game has trouble pumping out the phraseology quickly enough for frantic action sequences, both Motsen and McCoist deliver a good flow of dialogue that seems less rigid and more improvised than that found in prior editions. Laughter and good-natured bantering are not uncommon. For the 2004 edition, EA Sports has recorded 300 individual crowd chants that really add local flavor to the contests. Too bad the crowds don't wave banners and flags as they did in previous years. It should be noted that FIFA's normally superb replay component has been downgraded. Most critically, manual camera control has inexplicably become more difficult to operate. Furthermore, replay saves are not permitted without downloading and installing the first of what are likely to be several patches. You'll also need to download this patch if you want to customize your controller. If you don't, you're stuck with EA Sports' preconfigured button setup. With any luck, future patches will address some of the game's other issues. Three players bask in the afterglow of a well-driven shot. Multiplayer fans will undoubtedly rejoice over FIFA 2004's EA Sports Online compatibility. Sure, it will cost you a few bucks after your 14-day trial has expired, but never has finding human competition been easier. We logged-in and sourced a likely candidate within 30 seconds. Granted, we were annihilated 5-0, but we were able to start up another game, following the conclusion of the first one, within another half-minute. Of course, one of the benefits of playing another human is that you won't have to endure a fully AI-controlled side. In this respect, it's a wholly different game. Happily, our frame rates remained reasonable and lag times were bearable in both our online jaunts. That's not to say the game doesn't slow down some. It does, but it doesn't slow down so much that you'll want to pull the plug. All in all, FIFA 2004 seems to take several steps forward, while at the same time it takes a few steps back. It definitely does not push the gameplay to the high level that so many FIFA fans have waited for it to reach. Still, it is in many ways the best soccer game to be found on the PC. If you're a soccer buff who's never played the game on your PC, it will surely be a positive experience. If you're a returning veteran, you may want to weigh the game's new perks against some of its downfalls before you set down your hard-earned cash."}