{"ref": "https://www.gamespot.com/reviews/heroes-of-might-and-magic-iv-review/1900-2859752/", "date": "May 17, 2006", "game_name": "Heroes of Might and Magic IV", "text": "The Heroes of Might and Magic strategy series dates back to 1990 with the series' precursor, King's Bounty. Since then, the series has given rise to three games and several expansion packs over the course of about a decade. But none of that history really seems to matter at this point. The last game was released in 1999, and devoted Heroes fans--the group that developer New World Computing has worked hardest to please--have had more than enough time to play Heroes III to death. And as you might expect from hard-core fans, these dedicated Heroes players have demanded that Heroes IV be both completely fresh and new--but also that it remains true to the core gameplay of the series. And it turns out that Heroes IV succeeds in doing both, so if you're a serious Heroes fan, you can stop reading now and pick up a copy of the game if you haven't already. If you're not a die-hard fan of the Heroes series but have heard something about it, you might know that it's a series of turn-based strategy games that take place in a colorful fantasy setting, which is actually the same universe as the one in New World's Might and Magic role-playing series. And Heroes IV's essential formula is similar to that of the previous games. You create a hero character specialized either in magic or in might (physical combat). From an initial town, this hero raises an army of troops and ventures out to explore the map, capture resources and items, and conquer enemy towns and armies. Each hero type corresponds to a different town type; and each town produces different types of monsters and soldiers you can recruit for your army. This is Heroes IV at its most basic level, and this formula is at least as engaging and addictive in the new game as it's ever been in the series. If you've ever played a game in the Heroes series, you're probably familiar with the almost insidious way that the games keep you playing for hours. You conduct your exploration and conquest over the course of many turns, and the games always coax just one more turn out of you to capture that last gold mine, treasure chest, or artifact. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Heroes of Might and Magic IV Video Review Heroes IV does an even better job of being this addictive. This is true, thanks to its well-designed maps, which are all jam-packed with treasures, resources, artifacts, and event-triggering buildings that can do all sorts of things, including temporarily strengthening your heroes, giving them quests, and letting them recruit new creatures for their armies. And despite the fact that Heroes IV has no multiplayer options to speak of, there's no shortage of maps to keep you busy. The game itself has six full campaign games, lots of individual scenario maps, and a full campaign editor that lets you create your own custom scenario maps (and connect them into a custom campaign if you wish). You'll also find a typical game session packed with different options to choose. You'll have to choose the composition of your armies wisely, as well as choose from a great variety of skills that your heroes will learn as they grow stronger. When you first play Heroes IV, all of the game's new options may seem foreign, even bewildering--even if you're a veteran Heroes player. Right off the bat, Heroes IV has added several new features that have crept in from other turn-based strategy games. Like Age of Wonders and Warlords, Heroes IV lets you resolve some fights by using a quick combat option that takes far less time than standard tactical combat. And like this year's Disciples II, Heroes IV has wandering monsters (that will move across the map and attack you) and a branching path of development for your armies. As with other Heroes games, you need to buy creature buildings in your town to recruit new creatures, but in Heroes IV, you must choose between monsters of a comparable level. Instead of buying up as many creature-generating buildings as possible, you'll need to choose whether you want minotaurs or evil eyes, for instance, or choose between black dragons or titans. These choices may seem limiting, but they actually keep each of the game's different town types (or ~alignments~ as they're referred to in Heroes IV) interesting over the course of the game. In many cases, your choices can help you develop an army that consists of mostly fast-moving flying units, long-ranged archers, magic users, or close-range melee brawlers. And every creature in Heroes IV has at least one distinctive ability, if not two or three or four, so between your armies' abilities and the ability to include multiple hero characters in the same war party, you should have no trouble creating a powerful, versatile army or two. As in the previous games, your armies will do battle with both wandering monsters and the armies of enemy heroes. Heroes IV's combat system has a number of minor changes that are intended mainly to make combat a bit more balanced. Previous games in the Heroes series had been criticized for allowing too much momentum; that is, if you could create a powerful enough army, nothing could stand in your way. Heroes IV's system of simultaneous attacks (in which most creatures attack and take damage from each other simultaneously) and its new line-of-fire aiming for ranged units mean that you can't continuously blunder forward and pummel your enemies to death. Fortunately, your forces can call upon their own special abilities in combat, including the ability to cast some magic spells, just like a spell-casting hero. Heroes IV retains Heroes III's basic system of magic (both in combat and out of it) and improves upon it by slightly rearranging some older spells and also letting heroes become grandmasters in a specific school of magic. Through your many fights and raids, your heroes will accrue great numbers of experience points that will in turn lead to new skills. There are lots of old and new skills in Heroes IV--more than enough to help you create distinctive heroes. While your heroes will definitely seem more distinctive, Heroes IV's graphics unfortunately aren't. The series was previously well known for its colorful, storybooklike portraits and units, which often had humorous animations and funny sound samples. Unfortunately, most of Heroes IV's characters and units are represented by the same kind of generic-looking rendered sprites that appeared in Might and Magic VII and VIII. Heroes IV's creatures don't look horrible; each is represented well enough to distinguish them at a glance, but they simply aren't the memorable and occasionally goofy denizens of Heroes I and II. Instead, Heroes IV features stiffly animated 3D-rendered sprites that seem less like fantastic mythical creatures and more like stop-motion movie monsters. Outside of battle, Heroes IV's town and overland graphics are clearly intended to paint a picture of a brightly colored, otherworldly realm, but the same sort of density that makes exploring Heroes IV such a joy also makes it occasionally difficult to look at. Heroes IV's overland areas sometimes seem too bright and colorful--there's too much going on at one time on the screen. This can make distinguishing important objects from background scenery needlessly difficult, and, along with the game's equally busy-looking interface menus, may make the game seem overly complex to new players. But just about anyone--Heroes veterans or newcomers--will be able to appreciate Heroes IV's sound, especially its music. Heroes IV's sound effects aren't the least bit noteworthy, and many were recycled directly from the previous game, but the soundtrack is another matter entirely. Developer New World decided to split the difference between the synth instrumental soundtrack of Heroes III and the operatic soundtrack of Heroes II and include elements of both. While you're in battle, you'll hear the same sort of stirring, yet subdued, background music as in Heroes III--percussion- and string-heavy instrumental arrangements that suit battles well. And while you're exploring the overland map or developing your town, you'll be treated to the same sort of lush opera music that graced the Heroes II soundtrack. Heroes IV has a lot of new additions, but ultimately, it still plays like a Heroes game. That's definitely a good thing, as the Heroes formula clearly stands the test of time in Heroes IV and is every bit as enjoyable as it's ever been in previous games. An overly cynical (and not entirely accurate) way to assess the game would be to call it a revamped version of Heroes III with a new coat of paint--or many, many layers of paint. However, it's really to New World Computing's credit that the developer was able to incorporate so many new and interesting features into this sequel while still making sure it kept all the core elements that made all the previous games so great. Heroes IV is clearly a worthy successor to the series and has very clearly been worth the wait."}