{"ref": "https://www.gamespot.com/reviews/super-mario-galaxy-2-review/1900-6263170/", "date": "May 21, 2010", "game_name": "Super Mario Galaxy 2", "text": "It may be easy to take one look at Super Mario Galaxy 2, see the same gravity-altering traps and spherical worlds from its predecessor, and dismiss this as a by-the-numbers sequel to the superb original. But by assuming you know what to expect from Mario's latest adventure, you would be doing yourself and this game a great disservice. This is not only the new standard against which every 3D platformer must now be judged, but it also seamlessly integrates so many elements from Mario's 2D roots that it stands toe-to-toe with even its genre-defining progenitors. Every aspect of this game is absolutely bursting with joy. The vibrant artistic design immediately welcomes you into this colorful world, and the catchy soundtrack deftly mixes classic tunes with new compositions to provide the perfect backdrop for your goomba-stomping, star-snatching fun. But it's the expertly designed levels that will keep you coming back, even after you've seen everything this game has to offer, just to experience it one more time. This is an instant classic that belongs alongside the best games Nintendo has ever created. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Super Mario Galaxy 2 Video Review Things are once again rotten in the Mushroom Kingdom. Bowser has taken Princess Peach prisoner for the umpteenth time, forcing Mario to momentarily put his plumbing gig on hold to rescue his fair lady. The best thing that can be said about the story is that it mostly stays in the background. A few lighthearted exchanges between Mario and his foes precede major battles, but there is only a brief break in the action before you get back to flinging fireballs and cracking shells. In fact, Galaxy 2 is much more streamlined than its predecessor. The elaborate hub world that has appeared in each of Mario's previous 3D adventures has been scrapped and replaced by an easy-to-navigate map that lets you hop right into the next level. Galaxy 2 has less downtime than the original, ensuring you're always engaged and entertained. And you'll be happy to jump right into the action because Galaxy 2 is a long and often challenging adventure. There are lots of different activities to take part in, but everything comes with the same prize: a shining star. It takes 70 of these celestial bodies to make it to the end of the game, but there are many more hidden throughout the universe waiting to be discovered. No matter what you're doing in Galaxy 2, everything feels just right, thanks to the ultraprecise controls. It's a breeze leaping between walls, performing deadly butt-stomps, or jumping across lava-filled pits. There is an unabashed joy in movement that makes even running around the colorful worlds and taking in the uplifting atmosphere feel special. The camera does an admirable job of framing the action, giving you a clear view even when you're dancing on the ceiling in a reverse-gravity room or leaping between floating meteors in space. There are a few times where the angle is less than ideal, making it difficult to line up an exact jump, but for the most part, the camera performs its duty with flying colors. Even with a belly full of pasta, Mario is still lighter than air. The wealth of different objectives in Galaxy 2 is mind boggling. Just about every star introduces at least one new mechanic, generating a truly stunning degree of variety. Whether you're grabbing onto the talons of a powerful bird, competing in score-based challenges for a monkey that's wearing sunglasses, or slamming into enemies while ice skating, you're constantly presented with a new activity. Even though many of these situations only appear once or twice during the course of the game, they're all fully fleshed out and incredibly fun. It's really interesting how varied objectives can be even within the same level. The first time you enter a level, you may have to zip down a sand slide at breakneck speed, dodging cactuses and nabbing coins all the while. But when you enter the level again to try for a different star, you may have to navigate an underground obstacle course from a side-scrolling perspective. Because your goals are constantly changing and always at a high level, Galaxy 2 never gets stale or predictable. If the huge variety of goals doesn't sound like a big enough change, there are also power-ups that further mix things up. One of the few weak spots in the original Galaxy was a lack of interesting power-ups to play around with, but that has been rectified here. The most notable addition is Yoshi, the lovable dinosaur with the prehensile tongue. Once on this green fellow's back, you can point at enemies or objects with the remote and swallow them whole. You can snatch up a spiny and then shoot it like a projectile, inhale a pepper to receive a massive speed boost, or chow down a bulb to light up hidden pathways. There's also a power-up that lets Mario roll around like a Goron from the Zelda series, a special suit that gives you the ability to create clouds in midair, and a drill for digging through soft dirt. All of these power-ups build on their most basic functions as you get deeper into the game, forcing you to look beyond your preconceptions to use them in unique ways. Although most of the game is in 3D, letting you explore the environments with few restrictions, there are also 2D sections that are just as entertaining to run through. These stages are exceptionally well designed, going much further than the standard running and jumping for which Mario is known. In certain cases, gravity is your biggest opponent. Rooms will change their gravitational pull at a moment's notice, turning the walls or even the ceiling into your temporary floor. At other times, you'll be running along without a care in the world when you'll come across a pool of water floating above your head. These brief forays into swimming give you a chance to avoid cheep-cheeps and slow-moving urchins before you exit once more onto dry ground. Levels freely shift between the two perspectives. You'll be floating lazily around as bee Mario and then all of a sudden you'll be in a 2D world, swinging on vines and nabbing coins without an extra dimension to distract you. These 2D levels are a great changes of pace from the free-roaming action and are as inventive and fun as every other section of this game. While attempting to nab every star within these stages you should also keep an eye out for hidden comet coins. These special tokens summon a comet that gives you a new challenge to experience. Sometimes, you need to sprint through a world as fast as possible, running at top speed and performing long jumps so you can shave off precious seconds. Other times, you must collect purple coins or defeat a boss without taking any damage. The comet challenges are the most difficult goals in the game, but it's a blast to sink your teeth into these levels to try to overcome their punishing traps. In one stage, you create clones of Mario with every step you take and you lose health if you touch one of the clones. Trying to coordinate your movements so you can still make it to the end without running into your clones can be difficult, but when you finally outsmart yourself and nab that star, it's extremely rewarding. Most of Galaxy 2 starts out relatively easy for platforming veterans, but there are plenty of stars that will push you to your limits, and these prove to be the most satisfying to earn. Many of the levels end in boss fights, which are just as varied and exciting as the other aspects of the game. One of the early battles has you take on a slithering dragon that floats above a craterous moon. It flies dangerously overhead, showing off its colossal might, before it dives toward the surface and borrows underground. That's your chance to attack its glowing red pustules, but it's not easy. Dragons don't like to be punched, and it floods the screen with a wall of fire to keep you from poking its weak spot. Every boss requires a different strategy to overcome, and it's a real treat figuring out what needs to be done and then going in for the kill. The Bowser battles are particularly impressive. He is absolutely gigantic in this game, and striking him down is immensely satisfying. There is nothing quite like bringing down a treacherous foe who has been hounding you, and Galaxy 2 does a fine job of making its bosses big and imposing enough to ensure they are rewarding to conquer. The incredible action is tied together beautifully by the visuals and music. This is a gorgeous-looking game. The levels may be home to snapping piranha plants and explosive bullet bills, but they are eminently welcoming. The attention to detail is outstanding. From the puffs of smoke billowing from the chilly rabbit's snow-covered cabin to Mario's graceful spin when performing a triple lutz, every aspect of this game looks incredible. But the music is even more impressive. Using a great combination of classics and new material, all of the music fits the action perfectly. The older songs have been remixed, and what's most interesting is how they sound even better than they did before. For instance, the haunting theme from Bowser's levels that first appeared in Super Mario 64 now has a choir singing the higher sections, and it adds an eerie note that will send shivers down your spine. Galaxy 2 is a game you do not even have to touch the controller to enjoy. The sights and sounds are so enthralling that you can just sit back, relax, and take in everything. Even Luigi gets a chance to take part in the star-grabbing action. Super Mario Galaxy 2 is simply an outstanding game. It never rests on its laurels for a second, constantly presenting new objectives and mechanics to push you to never before seen places. Even the two-player mode offers new abilities and delights, making it even more fun to play with a friend by your side. Everything is so well designed and so entertaining that it's easy to get sucked into this world for hours. Super Mario Galaxy 2 is so phenomenal that it's difficult to imagine where Mario could possibly go in the future. But that's hardly your concern now. Mario proves that he is still the king of fun. Although most of the game is in 3D, letting you explore the environments with few restrictions, there are also 2D sections that are just as entertaining to run through. These stages are exceptionally well designed, going much further than the standard running and jumping for which Mario is known. In certain cases, gravity is your biggest opponent. Rooms will change their gravitational pull at a moment's notice, turning the walls or even the ceiling into your temporary floor. At other times, you'll be running along without a care in the world when you'll come across a pool of water floating above your head. These brief forays into swimming give you a chance to avoid cheep-cheeps and slow-moving urchins before you exit once more onto dry ground. Levels freely shift between the two perspectives. You'll be floating lazily around as bee Mario and then all of a sudden you'll be in a 2D world, swinging on vines and nabbing coins without an extra dimension to distract you. These 2D levels are a great changes of pace from the free-roaming action and are as inventive and fun as every other section of this game. While attempting to nab every star within these stages you should also keep an eye out for hidden comet coins. These special tokens summon a comet that gives you a new challenge to experience. Sometimes, you need to sprint through a world as fast as possible, running at top speed and performing long jumps so you can shave off precious seconds. Other times, you must collect purple coins or defeat a boss without taking any damage. The comet challenges are the most difficult goals in the game, but it's a blast to sink your teeth into these levels to try to overcome their punishing traps. In one stage, you create clones of Mario with every step you take and you lose health if you touch one of the clones. Trying to coordinate your movements so you can still make it to the end without running into your clones can be difficult, but when you finally outsmart yourself and nab that star, it's extremely rewarding. Most of Galaxy 2 starts out relatively easy for platforming veterans, but there are plenty of stars that will push you to your limits, and these prove to be the most satisfying to earn. Many of the levels end in boss fights, which are just as varied and exciting as the other aspects of the game. One of the early battles has you take on a slithering dragon that floats above a craterous moon. It flies dangerously overhead, showing off its colossal might, before it dives toward the surface and borrows underground. That's your chance to attack its glowing red pustules, but it's not easy. Dragons don't like to be punched, and it floods the screen with a wall of fire to keep you from poking its weak spot. Every boss requires a different strategy to overcome, and it's a real treat figuring out what needs to be done and then going in for the kill. The Bowser battles are particularly impressive. He is absolutely gigantic in this game, and striking him down is immensely satisfying. There is nothing quite like bringing down a treacherous foe who has been hounding you, and Galaxy 2 does a fine job of making its bosses big and imposing enough to ensure they are rewarding to conquer. The incredible action is tied together beautifully by the visuals and music. This is a gorgeous-looking game. The levels may be home to snapping piranha plants and explosive bullet bills, but they are eminently welcoming. The attention to detail is outstanding. From the puffs of smoke billowing from the chilly rabbit's snow-covered cabin to Mario's graceful spin when performing a triple lutz, every aspect of this game looks incredible. But the music is even more impressive. Using a great combination of classics and new material, all of the music fits the action perfectly. The older songs have been remixed, and what's most interesting is how they sound even better than they did before. For instance, the haunting theme from Bowser's levels that first appeared in Super Mario 64 now has a choir singing the higher sections, and it adds an eerie note that will send shivers down your spine. Galaxy 2 is a game you do not even have to touch the controller to enjoy. The sights and sounds are so enthralling that you can just sit back, relax, and take in everything. Even Luigi gets a chance to take part in the star-grabbing action. Super Mario Galaxy 2 is simply an outstanding game. It never rests on its laurels for a second, constantly presenting new objectives and mechanics to push you to never before seen places. Even the two-player mode offers new abilities and delights, making it even more fun to play with a friend by your side. Everything is so well designed and so entertaining that it's easy to get sucked into this world for hours. Super Mario Galaxy 2 is so phenomenal that it's difficult to imagine where Mario could possibly go in the future. But that's hardly your concern now. Mario proves that he is still the king of fun."}