{"ref": "https://www.gamespot.com/reviews/fract-osc-review/1900-6415745/", "date": "August 5, 2015", "game_name": "FRACT OSC", "text": "~Writing about music is like dancing about architecture~ goes the oft-quoted saying. It's a snide little shiv of an expression: reductive and crude, but I imagine it's good for a messy ambush on a music journalist's ego. Our flailing attempts to render sounds with words can certainly leave something to be desired; take a trip through an audiophiles' forum, and you'll reliably find linguistic gesticulations like ~extra bass, insight, and depth of music~ being used to justify $600 digital cables. But there's an appreciable skill in capturing the essence of one art in the form of another. That's what makes endeavors like Fract OSC, which seeks to illustrate music within the strictures of a video game, worth the effort of an honest appraisal.The act of transliteration to or from an art can reveal its fundamental qualities. Take the Game of Thrones novel, blessed with an ability to convey characters' internal monologues in a manner we know just wouldn't be suitable in HBO's version. Analyzed in that fashion, video games might be uniquely suited to placing you inside an imaginary space. That's a notion that Tron took quite literally when it digitized Jeff Bridges and cast him inside a video game, and Fract OSC doesn't stray far from its neon-blue footprints. Here you find yourself within an abstraction of a synthesizer instead of a CPU, though when you're dealing with digital instruments, the distinction is probably immaterial. That might be why Fract's world looks so much like Tron's, full of floating geometries and backlit monoliths; and it might be why that resemblance feels appropriate enough.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: FRACT OSC Video ReviewThe first sight you see in Fract is awash in black, though. In first-person view, you fumble your way over to a darkened computer terminal, only to find it locked. The synthesizer is broken, you see, split into a trio of color-coded components (lead, bass, and pads) that need to be reconstructed in order to restore the larger machine's functionality. After a loading screen, the game branches outward into layered networks of geodesic caves and temple-like puzzle rooms. Each component's puzzle comes in two flavors: a generalized brainteaser and a more musically inclined variant. When solved, these puzzles fill their immediate environment with house music and unlock corresponding portions of the larger instrument back at its terminal.Since Fract doesn't offer much in the way of direction, the onus is on you to wander the game's tunnels and gangways in search of promising landmarks. Thankfully, the sometimes organic, sometimes mechanical scenery holds quite a few of them. Superstructures cantilever out over glowing lava. Giant soundstages unfold themselves at the foot of honeycomb towers, and luminescent glyphs flit up from the ground to light your way through the twisting passages. It's an impressive labyrinth, and you gain a better appreciation for its complexity when you take a ride on the fast-travel monorails that link it all together. But just off the beaten path, you find ugly, half-designed areas, the parts of Fract where the complex, undulating geometries resolve themselves into slipshod connections and dead ends. It's a particularly damning problem because without a map, you're bound to spend a few hours treading through these parts of Fract in a vain search for your next objective.All that time wandering might be less arduous if you could kick back with some engaging songs, but Fract is surprisingly quiet for a game about music. The odd glowing pylon might emit a bass riff now and again, but the bulk of the soundtrack is given over to intermittent rumbles and chirps. Players expecting a robust musical experience might be surprised to find that Fract's soundscape trends closer to Billy Corgan's eight-hour ambient interpretation of Siddhartha than it does toward, say, Siamese Dream. The exception comes when you're putting the finishing touches on one of those secondary puzzles, which usually involve laying down a set of tones in a repeating musical measure. An accompaniment chugs along patiently until you can find a suitable tune to run alongside it. Successfully integrating your portion of the song causes additional instruments to come crashing into the music, and the resulting cavalcade of sound makes for a wonderful punctuation to your solution.The strength of such puzzles is their ability to change sound into something you interact with. Instead of calculating octaves or scales, you're watching your notes open gates, move dials, or convey a beam of energy across nodes. It's a natural and fitting use of the things video games do best, like a visualization of audio that you can occupy and manipulate. You can almost understand the appeal of dubstep when you get to watch the bass get physically dropped.Successfully integrating your portion of the song causes additional instruments to come crashing into the music.Enjoyable as such puzzles are, they're overshadowed by the many that don't feel remotely relevant to the game's musical leanings. Fract is overstuffed with platforms that need raising, sliders that need switching, and tumblers that need rotating. Without any mooring to the game's theme, they're left to sink or swim on the enjoyment they can provide in isolation. Yet most of them lack sophistication, and they're further hampered by...well, let's call it the roughness of demo tape. Wayfinding is frequently unintuitive, requiring you to find and cross doorways that don't look like doorways, or flip switches that don't look like switches. Confusingly, gaps between platforms can sometimes be walked over (there's no jump here), but once in a while you plummet through a small crack in an upper floor of a puzzle and have to hoof it all the way back up from the bottom.Still, Fract comes tantalizingly close to transcending that bit of static. When it's got a full head of steam, Mogi Grumbles' soundtrack feels like it's on the verge of busting through to the overworld. If only it could follow you as you moved around the space, growing and warping to your input. But the guts of your grand instrument--all the conduits, gauges, and pistons that you've been painstakingly repairing--are a loading screen apart from the synthesizer's actual controls. They might as well be in another dimension. You spend the lion's share of your time in Fract wandering among giant neon Tesla coils and discotheque circuit boards; that the culmination of that experience is an appearance of a couple of new buttons at some remote computer screen seems an arbitrary and irrelevant reward. There isn't any reason to check in on the synth while it remains incomplete, and any rudimentary compositions you build at the terminal don't follow you to the other side, anyway.Eventually, though, you find yourself back at the synthesizer. You set yourself before its glowing dials and their nebulous descriptors--gravity, orbit, haste--and you note that the hours spent puzzling over rotating platforms and flicking switches haven't imparted much of an ability to suss out their meaning, let alone bend and shape them into something resembling music. Something's getting lost in translation here; some precious meaning is slipping through the crack between ~gravity~ as a synthesizer effect and ~gravity~ as the thing that makes you fall off a video game's platforms."}