{"ref": "https://www.gamespot.com/reviews/mc-groovz-dance-craze-review/1900-6116469/", "date": "January 14, 2005", "game_name": "MC Groovz Dance Craze", "text": "Rhythm action games used to be fairly obscure, Japanese affairs. Suddenly, largely due to the popularity of Konami's Dance Dance Revolution games and Sony's PaRappa the Rapper titles, the genre generated mainstream US interest. Yet, while Donkey Konga and Taiko Drum Master have given GameCube owners a taste of the action, few GameCube games have involved fancy footwork. Enter MC Groovz Dance Craze, which the game's unlikely developer, Mad Catz, is packaging with a dance mat of the sort that it has been making for the PS2 and the Xbox for quite a while. Unfortunately, the mat isn't particularly good and the DDR-style game is just terrible. MC Groovz may feature The Fresh Prince's ~Parents Just Don't Understand,~ but dancing to its poorly stepped, overly lengthy tracks just makes us feel like Carlton Banks. This just may be the worst rhythm action game available. MC Groovz's first and most serious problem is its paltry song selection. The game features a dozen or so tracks, only a handful of which are recognizable. Its most heavily promoted song is a remix of Jessica Simpson's ~Irresistible~ that lasts about seven minutes, which is actually MC Groovz's average track length. This is much, much longer than rhythm action fans have come to expect, and it seems like an effort to add more dancing content without licensing additional songs. Party games should involve frequent breaks in the action, so a large group of people can take turns. Watching someone waddle to Jewel for an extended period of time is no one's idea of fun. By default, MC Groovz displays its dance steps in a circular format. While this layout is more analogous to that of the actual mat, those accustomed to DDR's vertically oriented step arrows will want to switch the game to scrolling mode. From here, Groovz gives up on originality, and attempts to approximate the standard virtual Terpsichore experience as closely as possible. Unfortunately, it fails in this endeavor, as its steps land woefully offbeat and almost don't appear to have been written to match the music. After you finish a song, you'll usually have about 15 to 20 seconds of steps left to perform, which is totally ridiculous and simply feels broken. The upswing is that you'll have just as easy a time playing the game with the sound off as with it on. As the mat's Z button is dedicated to toggling sound, it's easy to test this theory...even when you're not actually trying to. Even the game's ~expert~ difficulty won't at all challenge anyone who has played any rhythm action game before, be it DDR or Samba de Amigo. This would have been fine, had this game been conceived as a sort of dancing game for kids, but its song list would never appeal to such an audience. Most tykes don't remember KC & the Sunshine Band or DJ Jazzy Jeff. Dance Craze is about as barebones as a rhythm game can get. Like DDR, MC Groovz lets you play against a friend or engage in a workout mode. In this case, workout mode doesn't differ at all from the standard game type, except that it counts your expended calories. If you ask us, there are better ways to burn 23 calories than dancing to an obscure, overproduced song, like those of Rupee or Rithma, for seven minutes. MC Groovz Dance Craze fails to accomplish the few things asked of a dance game. The song selection is terrible, and each track's dance moves seem incidental and completely unrelated to the music. You won't even see anything onscreen to distract you from the ugly, arrhythmic arrows you're supposed to follow. As there's really no other application for this GameCube-only dance mat, Mad Catz's seemingly reasonably priced package turns out not to be such a great value after all."}