{"ref": "https://www.gamespot.com/reviews/voice-of-cards-the-isle-dragon-roars-review-cards-against-humanity/1900-6417775/", "date": "November 2, 2021", "game_name": "Voice of Cards: The Isle Dragon Roars", "text": "Yoko Taro is a weirdo. Don't just take my word for it--the man himself has said as much with game development presentations on making ~weird games for weird people~--and there's a certain level of subversion and existential terror that permeates everything he touches. This is certainly the case with Voice of Cards: The Isle Dragon Roars, a somewhat surprising game to make after the smash-hit success that was Nier: Automata. But this is Yoko Taro, and this choice is itself a subversion. Voice of Cards: The Isle Dragon Roars takes the writer-director's signature style and adapts it for a role-playing game that retains just enough classic role-playing elements to keep it approachable.Taro is listed as creative director in Voice of Cards' credits, and though he actually isn't listed as the game director--suggesting he may have taken a less hands-on approach to its creation--its narrative beats and visual style certainly have his influence all over them. You play as an aspiring adventurer joined by a ragtag group of would-be heroes hoping to slay a dangerous dragon, beat a stuck-up group of nobles looking to find the dragon first and get a substantial reward from the local queen. The text's font appears to be the same as in the Nier series, and longtime Taro collaborator Keiichi Okabe returned to compose its music, which is so Nier-y you'd think Voice of Cards was a surprise new entry in the series (it isn't, but I kept waiting for the reveal). The Nier music DLC you can buy is almost redundant, considering how similar it is to what's included in the standard version. As you may infer from the game's name, you'll be completing your tasks entirely through cards. Every element of Voice of Cards is represented with a separate card, from the terrain to the characters and even the menu. It can occasionally be a little counterintuitive to commit so completely to this system, but there's also a unique charm to it that would be lost in a more traditionally-structured RPG. As you move throughout the world, cards flip over, sometimes revealing dead-ends or initiating a battle, and your characters use--you guessed it--one of a few cards in a battle system that seems to have taken equal influence from Yu-Gi-Oh and Hearthstone. Certain enemies have weaknesses, which you'll need to remember, and some of your attacks can plague them with status effects like freezing, poison, or paralysis.Battles are infrequent enough that they don't wear out their welcome, and a ~jump~ mechanic lets you quickly move between areas you've already visited, which in turn cuts down on the random encounters you're forced to endure. In fact, it almost feels like you have too much help on your journey; aside from a few moments later in the game, Voice of Cards is remarkably easy, with very few enemies posing a real threat. The ~freeze~ status can be applied to nearly every enemy in the game, rendering them unable to attack for multiple turns at a time and without a limit on how often it can be reapplied. I hit a game over screen just once, and though a story-focused game like this rarely benefits from a high difficulty, having a little bit more of a challenge wouldn't have hurt.Every story thread feels like it's there for a reason, with anything dark or unusual serving the story rather than being there to merely shock you.The card-based structure also plays into much of Voice of Cards' humor, of which there is a lot. It might be the funniest game Taro has ever had a hand in, despite the melancholy themes. Characters ~bowing~ by turning their cards at a 45-degree angle made me giggle quite a few times. Excellent translation for the dialogue and character names--one buff hero is literally called ~swole~--gives it a distinct feel from the generic ~heroes fight dragon~ tropes it's clearly trying to avoid. Even the game master, the literal ~voice of cards,~ gets in on the fun, at one point mispronouncing a difficult name and having to try again.The turn-based combat and simple aesthetic make Voice of Cards a great choice for handheld play on the Nintendo Switch, especially because it uses a save system that makes use of both manual and auto-save slots. The text is noticeably harder to read when playing on the handheld's screen, however, and without a major visual difference on the OLED version, I found myself mostly sticking to the docked mode.Having played both Nier games--Automata remains my favorite game ever--I expected some dark and, well, unexpected turns to come in Voice of Cards. They certainly did, especially with townspeople who appeared somewhat harmless at first glance, but I was also surprised by just how straightforward the game is. Taro's games don't rely on deus ex machina moments and he famously uses a ~backward~ writing technique to ensure any final ending is earned through preceding story beats, but it could have, and probably should have, been weirder. Still, it's a great first Taro game to play for newcomers, easing you into the mind of one of the industry's most talented and inspired creators. Every story thread feels like it's there for a reason, with anything dark or unusual serving the story rather than being there to merely shock you.Voice of Cards: The Isle Dragon Roars is almost exactly what I was expecting from a Yoko Taro-led card-based RPG. That is primarily a compliment, as it still managed to take some odd turns and retained the somber, melancholy aesthetic of his past projects without sacrificing humor. Somehow, the games' all-card structure actually works within the confines of a traditional role-playing game, and it does it with so little fat that it never overstays its welcome. It also sacrifices some of the more jaw-dropping moments I want in a Taro game--what I expect most from him is the unexpected, and it's why Nier: Automata 2 is such a bad idea. But failing to make my eyes fill with tears as I contemplated the nature of my existence and the necessity of hope a second time isn't exactly striking out on three pitches."}