{"ref": "https://www.gamespot.com/reviews/prince-of-persia-the-forgotten-sands-review/1900-6262722/", "date": "May 21, 2010", "game_name": "Prince of Persia: The Forgotten Sands", "text": "Prince of Persia: The Forgotten Sands is a direct sequel to the superb 2003 release The Sands of Time, but this latest adventure does not focus on the intriguing time mechanic that served as the backbone for that game. Rather, the prince now has the ability to create handholds, airlifts, and other tools to help him move around the environment, and these abilities open the door for unique obstacles that evolve throughout the course of the game. Unfortunately, the shallow combat pulls you away from the free-flowing platforming. These dull duels force you to swing your arms frantically to dish out damage, and it's a chore to dispose of your attackers so you can get back to the fun moments. It's a shame the battles are so boring, but the clever level design and strong artistic direction make The Forgotten Sands another good entry in the long-running franchise. Nature can be cruel, but at least it has the decency to make poisonous leaves red. A prince without a city to call his own is a very sad thing, indeed. A sprightly genie has promised the nomadic hero the wealth and power to match his impressive title, but success is not obtained by merely showing up. Rather, the prince must fight for his birthright, besting a mystical witch and her teeming henchmen to take control of the deserted city he so desperately covets. The story is one of the more interesting elements of this game, transforming a simple plot about the prince's quest for power into a fantastical tale that is more intent on posing questions than on giving definite answers. It takes a long time for your actions to take shape, but the quiet strength of your struggles adds up to something larger as you venture deeper into your journey. Although the sarcastic humor that has so often been the prince's trademark is nowhere to be found in his latest adventure, the twists and turns you encounter along the way make up for its absence. The levels are laid out in a linear manner, and the obstacles and puzzles slowly build on your past experiences to create cool situations. As in most Prince of Persia games, you can run along walls and swing on conveniently placed poles, but there are new moves in The Forgotten Sands that spice up the standard action. New powers are unlocked every few hours, and these add a couple of wrinkles to the classic formula. The first of these lets you activate power pads along the walls and spread out on the floor to help you cross treacherous gaps or climb up towering walls. These serve as either handholds or wind-boosting lifts, and stringing a series together to make your way past a daunting trap can provide quite a rush. The later powers you unlock are even more interesting. You earn the ability to create one handhold at a time on bare walls, conjure wind ladders on the ground, and even create a sphere that lets you float in midair. These tools are used in unique ways, forcing you to plan out how you're going to pass a challenging obstacle rather than just rushing in headfirst and improvising on the fly. The camera is intelligently designed in The Forgotten Sands, pointing you in the direction you need to go, so you rarely find yourself lost. But there are some slight problems that can lead to moments of frustration. When you're making your way through confined rooms, the camera sometimes gets stuck on objects, making it difficult to see where you need to go. And it's zoomed in too far during combat, so enemies can easily circle behind you and attack when you're unaware. You have the option to switch to expert camera mode, which gives you full control over your view, but this is too unwieldy to use during fast-paced action sequences. These are small issues, though. For the most part, you can run through the levels with ease, worrying more about how you're going to pass the next obstacle than trying to maneuver the camera into place. Platforming is exciting, but fighting enemies is as dull as counting sand in an hourglass. Combat is almost entirely motion based and lacks the sort of energy that could have made these battles thrilling. Every move is performed by frantically shaking the remote, nunchuk, or both together, and the constant waving needed to achieve victory is downright annoying. You do earn new moves along the way, but the camera and controls conspire to make these new powers a chore to use. For instance, you can freeze enemies in place by pointing at them and pressing B. However, it's difficult to line up a precise shot in battle when you're being attacked by aggressive foes and the camera refuses to give you a good view of your enemies. And the motion-based moves don't even work all the time. Oftentimes, you will rapidly shake your arms and watch in horror while the prince stands there stupidly, not swinging his sword even though you desperately need him to. There isn't a lot of fighting in The Forgotten Sands, but what's there just takes away from the exciting platforming sections. All the flying stabs in the world can't make the fighting interesting. As lousy as the combat is, the arenas in which you do battle are a sight to behold. The Forgotten Sands has strong artistic design, painting each new area you visit with a fresh look that continually impresses. During early moments, you must hunt down ravenous vines that are thwarting your progress, and the foliage-rich rooms you make your way through have an organic feel rarely seen in the Prince of Persia series. These deadly greenhouses pave the way for dimly lit temple ruins and water-drenched oases. The most impressive of the fantastical places you visit comes late in your quest when the walls that previously boxed you in have broken down and have been replaced by an endless expanse of space. This section has more in common with Super Mario Galaxy than other Prince of Persia games, and it's a joy to run along floating blocks as you marvel at the vast emptiness around you. The Forgotten Sands takes roughly 10 hours to play through, and there are plenty of unlockables to keep you entertained long after the credits roll. The most interesting of these are extra levels you earn by accomplishing specific tasks during the main adventure, highlighted by 2D levels that focus on the best elements of this game. Thankfully, the main quest is just as fun as these bonus levels. The exciting platforming throws enough new ideas at you to keep you on your toes, and the fantastic artistic design makes every section a treat to look at. It's disappointing that the combat isn't any fun, because it distracts from the entertaining portions of the game. But if you can put up with those dull tussles, there is plenty to like in the prince's latest adventure. Editor's Note: The preceding review replaces the Prince of Persia: The Forgotten Sands review that was originally posted on GameSpot, which--as detailed in our reviews blog--contained erroneous information about the game's camera. GameSpot regrets the error."}