{"ref": "https://www.gamespot.com/reviews/mega-man-legends-2-review/1900-2640514/", "date": "May 17, 2006", "game_name": "Mega Man Legends 2", "text": "With the birth of Mega Man Legends, Capcom provided a classic 2D series with a smooth and graceful transition into 3D. While it may have lacked some refinement, Legends was an enjoyable action-RPG that was successful enough to warrant a spin-off (the recently released prequel The Misadventures of Tron Bonne) and now a true sequel. With improvements on almost every aspect of the original - most notably in the graphics and control categories, where Legends fell short - Mega Man Legends 2 is another step in the right direction for the series and a fun experience. Like the original Legends, the sequel features an entertaining and overall lighthearted feel, but this time with slightly more serious overtones. An enigmatic girl and a legendary treasure have been discovered in an icy wasteland. The treasure is the legendary Sealed Key, which is said to unlock something known only as the Great Legacy. Almost all the major characters from the previous games return: Mega Man, Roll, the infamous Bonne family, the small army of comic relief known as the Servbots, the perpetually dancing monkey Data, and even the effeminate Glyde. After throwing some new faces into this already personality-laden cast, the story is primed and ready to go. Mega Man Legends 2 features the same action-RPG gameplay as the first, but with a lot of expansion and substantial improvements. To begin with, the adventure isn't limited to a one-town island anymore. Mega Man's adventure now spans a sizeable chunk of world that contains several towns, a few remote areas, and gargantuan airships. You'll travel on a world map to different areas in your own airship, the Flutter, which is a small location in itself. Once you've landed, you can poke around town, explore the outlying areas, or descend into one of many dungeons for a dig. With emphasis on exploration and a world map comes increased longevity, making MML2 closer to the length of a standard RPG. Like its forerunner, the action and RPG elements in MML2 compliment each other nicely. A good deal of RPG-style interaction with other characters is necessary to move the story forward, and there are a lot of additional bits of info and items to be gained for those willing to put forth the effort. The items you find in dungeons will often need to be combined with something purchased from a shop or found around town for Roll to create a helpful new weapon or accessory. Finding these special weapons - along with upgrading them, your armor, and the standard buster arm - will aid greatly in your progression in the action areas of the game. Mega Man has never been one to skimp on action, and you'll spend a lot of time in dungeons and above ground blasting through hordes of Reaverbots and solving the occasional puzzle. The dungeon layouts aren't quite as cerebral as those in Zelda, but they still provide challenge and variety. RPG-like status ailments will come into play, and many boss encounters will require a deeper strategy than strafing in circles and firing with the buster arm. Some action sequences come with specific objectives, like putting out a kitchen fire on your ship or holding off invaders until you can pull the switch to activate an antiaircraft gun. Many dungeons are large enough to require multiple trips to clear out all the goods, and you'll occasionally want to come back with a specific weapon like the drill arm to access certain areas or the homing missiles to deal with annoying flying enemies.Control was one of the biggest problems in Legends, and the sequel offers the flexibility and Dual Shock analog support the first title screamed for. Four basic control schemes and several adjustable control options make it easy to find something that works for you, and you can take a short quiz that will help the game suggest a scheme based on your answers. Worth mentioning is the inclusion of a dual-analog layout that lets you move in any direction with the left stick and look and aim freely with the other. If you can acclimate yourself to using the shoulder buttons for jumping and firing, you can effectively control the view on the fly, which all but eliminates bad camera angles and provides ease and freedom in your movement. Additionally, the lock-on feature of the original has been upgraded to let you move freely while targeting an enemy. The same bright cartoon-style graphics that really seemed to fit Mega Man Legends have been employed once again but come with substantial polish. The graphics, in general, look much cleaner than the original's, with much larger areas and more attention to detail. Environmental features like a fierce snowstorm and shimmering heat waves come together with small touches like lens flare and light produced from explosions. Complimenting these enhancements is a nice variety of environments. Each local has a distinct feel and music, and examples of thematic dungeons include an Aztec temple-style level and an organic looking level brimming with mechanical nature. Most of the music is catchy and varied, and the sound effects are very Mega Man. The cutscenes feature a wide range facial animations and emotions, and the voice actors do a nice job of injecting the characters with personality. Even with the limitations of the PS hardware, the game often manages to come close to a playable 3D anime. As the Legends series is further refined, it becomes obvious that the series going 3D was not merely a gimmick. Mega Man Legends 2 fixes a lot of the flaws in the original and is a substantial improvement on the Legends formula. Capcom has turned what began as a mere spin-off into a worthy stand-alone franchise.Control was one of the biggest problems in Legends, and the sequel offers the flexibility and Dual Shock analog support the first title screamed for. Four basic control schemes and several adjustable control options make it easy to find something that works for you, and you can take a short quiz that will help the game suggest a scheme based on your answers. Worth mentioning is the inclusion of a dual-analog layout that lets you move in any direction with the left stick and look and aim freely with the other. If you can acclimate yourself to using the shoulder buttons for jumping and firing, you can effectively control the view on the fly, which all but eliminates bad camera angles and provides ease and freedom in your movement. Additionally, the lock-on feature of the original has been upgraded to let you move freely while targeting an enemy. The same bright cartoon-style graphics that really seemed to fit Mega Man Legends have been employed once again but come with substantial polish. The graphics, in general, look much cleaner than the original's, with much larger areas and more attention to detail. Environmental features like a fierce snowstorm and shimmering heat waves come together with small touches like lens flare and light produced from explosions. Complimenting these enhancements is a nice variety of environments. Each local has a distinct feel and music, and examples of thematic dungeons include an Aztec temple-style level and an organic looking level brimming with mechanical nature. Most of the music is catchy and varied, and the sound effects are very Mega Man. The cutscenes feature a wide range facial animations and emotions, and the voice actors do a nice job of injecting the characters with personality. Even with the limitations of the PS hardware, the game often manages to come close to a playable 3D anime. As the Legends series is further refined, it becomes obvious that the series going 3D was not merely a gimmick. Mega Man Legends 2 fixes a lot of the flaws in the original and is a substantial improvement on the Legends formula. Capcom has turned what began as a mere spin-off into a worthy stand-alone franchise."}