{"ref": "https://www.gamespot.com/reviews/bee-movie-game/1900-6183197/", "date": "November 20, 2007", "game_name": "DreamWorks Bee Movie Game", "text": "Like its counterparts on the Wii, PC, PS2, and Xbox 360, the Nintendo DS version of Bee Movie Game lets players explore the 3D world from the movie and tackle numerous missions as the film's hero, Barry B. Benson. However, unlike its console-based siblings, this portable rendition of Bee Movie is short, repetitive, and lacking in variety. At first, you might enjoy playing the minigames, fetching items, and flying back and forth. Soon, though, the relative lack of substance and flair will cause you to lose interest. The 3D graphics are the game's sole bright spot. Barry, the other bees, and the dangerous creatures you'll encounter out in the wild are cute and detailed. All the different locations, including the hive, the park, and the warehouse, are vividly brought to life thanks to the clean textures and a high polygon count. The top-down viewpoint isn't any different than that of the typical adventure romp, but since you can freely explore each environment and adjust your flight level to discover shortcuts, you really feel as though you're getting the unique sense of what it must be like to interact with the world as a fluttery insect. While they're impressive for their technical qualities, the graphics don't deliver a whole lot of excitement. Of course, the massive flowers, benches, garbage cans, and other objects you'll encounter outside the hive are larger than life. However, they just sit there, and you can't do anything to them except hide under them or whack them to knock pollen drops out of them. Frogs, dogs, birds, and other nasty animals patrol small zones in each area, but their movements are matter-of-fact and their attack animations are so short that you often won't notice that you've actually been attacked until Barry gets knocked back. In general, the presentation is cheap. There's not much to the audio, apart from some dramatic music and a few brief snippets of Jerry Seinfeld saying ~ouch,~ and the story scenes that are displayed at the end of each mission consist simply of still images from the movie and plain text dialogue. As for the hands-on aspects, they're obviously geared toward the less developed gaming skills of young children. You can freely explore the environment, but missions and upgrades are doled out in linear, regimented fashion. A green dot appears on your radar, you go there, another bee gives you your orders, and you head to the next green dot to collect an item or rescue somebody. Barry has a limited range of abilities. He can fly, dash into things, carry objects, and hide under surfaces to avoid the rain or larger creatures. Once or twice per mission, you'll face off against a human in a battle that involves dragging and drawing on the touch screen. If you accumulate enough points in those battles, Barry will dodge all of his opponent's attacks and cause the meanie to fall down dizzy. Those battles are fun. It's just too bad there are so few of them. Occasionally, you'll notice insects standing around that aren't part of the mission narrative. If you talk to them, they'll ask you to fetch something or deliver items to other insects in exchange for a major pollen payout. Using that pollen, you can visit the Pollen Jocks at the hive and pay them to take a crack at one of their minigames. These minigames are simple reflex challenges involving the touch screen. For example, in the speed training minigame, you have to drag a puck back and forth between the goals while dodging a spiked ball that's bouncing around the screen. The different minigames are nice diversions, and they allow you to upgrade Barry's speed, stamina, and strength ratings. Unfortunately, there are only three minigames in all, so they don't actually do much to extend the life of the game. Not that there's much life to begin with. Including the hive, there are only four different environments, and it won't take you much longer than three hours to talk to everyone and complete all the quests they offer. You could argue that the reason the game is simple and short is because it's geared toward young kids. While there's some merit to that argument, it really doesn't explain why the overall design and presentation are so underwhelming. Besides the nice 3D visuals, there's nothing here to keep kids entertained once they get bored of buzzing back and forth and fetching junk for other insects."}