{"ref": "https://www.gamespot.com/reviews/yanya-caballista-city-skater-review/1900-2815502/", "date": "May 17, 2006", "game_name": "Yanya Caballista: City Skater", "text": "Originally titled Yanya Caballista Featuring Gawoo, this Koei cel-shaded skateboarding game is now on its way to the US PlayStation 2 in the form of Yanya Caballista: City Skater. It's the first action-sports game from KOEI, and while it bears a passing similarity to Jet Grind Radio, the unresponsive and overly simplistic gameplay and repetitive mission objectives keep it from reaching the same level as Smilebit's innovative and engaging in-line skating game.It's apparent that Yanya Caballista is not your average skateboarding game from the get-go. The story takes place in New San Francisco, a peaceful berg that has been overrun by a race of ghostlike aliens called gawoo. The only citizens able to stop these ethereal creatures are the skateboarders of New San Francisco, who have been nicknamed caballistas. For an unexplained, and admittedly irrelevant reason, the gawoo have a tendency to disappear when they see a caballista land a cool skateboarding trick.As if the setup weren't bizarre enough, Yanya Caballista's control relies on a miniature skateboard that clips onto the dual analog sticks on the Dual Shock 2 controller, much like the surfboard controller used in Rockstar's Surfing H3O. As all control in the game is executed using this skateboard, Yanya eschews the deep trick systems found in most action-sports games. The tricks your caballista can execute are limited to simple grind, flip, grab, and spin tricks that can be executed one after the other for combo bonuses. The limited trick system makes the game easy to pick up, but the shallow gameplay makes it even easier to put down, as there is little challenge in pulling off the few tricks that are available. The floaty physics engine further exacerbates the game's lack of difficulty, as your skater will gently glide back down to the ground after jumping, allotting a leisurely amount of time to decide what trick you want to do. The level objectives are equally simple: Find the gawoos scattered through each level and do a trick in front of them, which will cause the gawoo to vanish. Once all the gawoos in the area have been vaporized, another area chock-full of gawoos is opened up in the level. This process is repeated through the entire game, and it's only broken up by boss fights at the end of each level, which essentially add some uncomplicated pattern recognition to the existing gawoo-killing formula. As you progress through the game, different varieties of gawoo will start showing up. Some have limited line of sight, and others are only impressed by certain types of tricks. Even still, the monotonous process of finding gawoos and doing tricks in front of them gets old fast. There is a multiplayer mode as well, though it is nothing more than a two-player version of the single-player game.While the cel-shading technique pioneered by Jet Grind Radio was fresh and interesting when the game came out, games like Yanya Caballista are fast turning it into an overused gimmick. Though the cel-shading found in Yanya Caballista isn't the most impressive we've seen, it is definitely serviceable. The game dollops on heavy amounts of motion blur when your skater speeds up, which has the dual impact of hindering your sight and making you slightly woozy. The environment geometry is relatively boxy and simple, though this has the added side benefit of keeping frame rates up. The characters have a greater level of detail, and the character designs are pretty flamboyant across the board, which is a good fit for the rest of the game's cartoonish feel. Some of the standout characters include the fat blue Atlantean, BlueBee, and the blonde, anime-haired Jet. The aural presentation of Yanya Caballista is equally fitting, consisting mostly of simple skating sounds, cartoony character exclamations, and an unobtrusive, upbeat soundtrack.Those intrigued by the game's bizarre premise or cel-shaded presentation will likely be disappointed by the shallow gameplay and repetitive mission objectives. Yanya Caballista: City Skater is a game targeted at a younger age group, and if there is a preteen gamer in your house, the colorful presentation, flamboyant character design, and simple controls may be enough to keep him or her engaged."}