{"ref": "https://www.gamespot.com/reviews/super-smash-bros-melee-review/1900-2829090/", "date": "November 30, 2001", "game_name": "Super Smash Bros. Melee", "text": "Nintendo unveiled Super Smash Bros. Melee at its E3 2001 press conference, to the collective awe of all the fans in attendance. The video reels displayed characters new and old to the series, several of which genuinely shocked the audience. What the footage alluded to, however, would become much more evident the following day, when the game was open for play to showgoers: that Super Smash Bros. Melee was a slightly updated version of its predecessor, one that had been given an extremely pleasing face-lift. Now that the game has been released, that much can be confirmed--aside from a few minor additions and alterations to the fighting system, Super Smash Bros. Melee plays exactly like its predecessor. But rest assured, this is certainly a good thing. Few games were able to match the maddening pace of its predecessor, while still remaining playable. Even fewer have been able to work that kind of feel successfully into a multiplayer mode, much less one that allows for four players. And when you consider the sheer amount of play modes, secrets, and extras packed into Melee, it becomes that much more enticing. Super Smash Bros. has always been about extremely fast-paced multiplayer fighting, and Melee is no different. It's an experience that's at its best in the company of other humans. It's easily among the most inventive fighting games released in recent years, 2D or otherwise, and its accessible nature can often hide the reasonable bit of depth its fighting system offers. The game is very good at working wild cards, of sorts, into its matches, which can often change the tide of a battle in a moment's notice. The hammer item is a great example of this: A novice player could theoretically be getting pummeled by a trio of veterans, only to pick up the hammer and pound his or her way to victory within a span of a few seconds. The Smash Bros. system is very good at evening the odds in ways like this, and given the mad pace of the matches, you'll seldom notice until it's all over. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Super Smash Bros. Melee Video Review One of the original Smash Bros.' weaker areas was its single-player modes, or lack thereof. Aside from a halfhearted ~story~ mode, there really wasn't anything compelling, outside of the multiplayer game. Melee thankfully remedies this in many ways. The classic single-player mode is back, bonus stages and all, and the progression changes each time you play through it. The game is also pretty good at mixing things up by introducing several kinds of variations on the characters you'll fight. In one stage, for instance, you might encounter a giant-sized Yoshi, while another may pit you against a team of tiny Donkey Kongs, 15 deep. You can even add these kinds of parameters during multiplayer matches, but that's a whole other story. The adventure mode is Melee's new variation on the single-player game. In it, you'll progress through a series of side-scrolling levels, all of which are based on or otherwise inspired by Nintendo's extensive and classic back catalogue. The first stage will take you through span of the Mushroom Kingdom that's inspired by the look and feel of the original Super Mario Bros., right down to the strolling goombas and patrolling koopa paratroopas. Another has you running down the lanes of F-Zero's Mute City, all the while avoiding the hazards of oncoming traffic traveling at 500mph. It's easy to let your heartstrings be pulled by these clever homages, but in the end, these adventure stages are really a hit-or-miss experience. Some, like the Super Mario stage, seem well thought-out and flawlessly executed, right down to the memorable Mario theme. Others don't fare so well and wind up feeling jury-rigged and shallow. Sadly, the adventure stage based on Zelda is a bit on the weak side--what could have been brilliant homage to Zelda II's side-scrolling dungeons turned out as an odd mishmash of the series' aesthetics. HAL at least got the classic dungeon theme right, though. Fans will no doubt miss a beat the first time they hear it, in all its remixed and rearranged glory. In the end, at any rate, you'll still play through the adventure mode several times--some of the game's hidden elements can only be unlocked through completion of it in some special way.The robust event mode rounds out the single-player game nicely. You can consider it analogous to Soul Calibur's mission mode--special matches are set up, and more often than not, the scales are tipped against you. One match has you fighting invisible versions of Star Fox characters, while another has you fighting the whole Super Mario Bros. gang. Many of these matches make for Melee's most engaging single-player experiences, and a good portion of them are incredibly challenging. Again, though, you'll doubtlessly find yourself playing through them, as a fair bit of the game's unlockable elements are hidden therein. But just as with its predecessor, Super Smash Bros. Melee has been primarily designed as a multiplayer game. In this respect, you'll likely be completely satisfied. The default multiplayer mode is a standard free-for-all--you and up to three others can go at it in one of the arenas, with computer players optionally taking up any vacant spots. You can set the matches to end after a given time, or you can tweak the number of lives each player gets, so that the last one standing wins. You can also set up teams and skew them any way you wish--three-against-one matches are entirely possible. The item set is also customizable, allowing you to nix any potentially game-breaking items, such as the aforementioned hammer. A whole bunch of special match settings are available as well. You can play a match with giant-sized, tiny, or invisible versions of all the players, or you can mess with the game's speed, making it lighting fast or super slow, among other things. All these things come together to make Super Smash Bros. Melee one of the most compelling multiplayer experiences on any console. That's provided you're into the game's fighting system, of course. There's really no question about it: Smash Bros. is very fast and loose compared with most other fighting games--so much so that many consider it a traditional party game, rather than a genuine fighter. Be that as it may, there is a bit of technique to the game. It's just that it's very easy to get by without bothering to learn it very well. The game revolves around the concept of smash attacks--moves that will send your opponents flying with the sheer force of their impact (entirely off of the map, ideally). In order to score a proper smash move, you have to damage your opponents heavily--otherwise, they won't fly very far. Every character has a set of these attacks, and they're executed by ~charging~ the analog stick for a second or so prior to inputting an attack command. Depending on your character, you can perform smash attacks in many different directions, on the ground, and in the air. The fighting system overally feels pretty identical to the original game's, though there are a few notable changes. Most important is how grabs are dealt with. In the original game, you were able to grapple an enemy with the R button and very easily send him or her flying just as far as you would with a smash attack. Melee makes it a bit harder to actually connect with a grab--Link's hookshot will fall limp much sooner than before, and Samus' grapple beam doesn't have nearly as ideal of a trajectory as it does in the original. Furthermore, you don't get nearly as much mileage with throws as you used to. You can, however, execute a number of grab attacks when you actually connect--multiple-hit combo throws, and the like, similar to what you'd find in a traditional fighting game. Rest assured, though, that de-emphasizing the throws really does a whole lot of good for Smash Bros. Before, it was way too easy to let the game devolve into a boring throw-fest. A couple of evasive moves were added to the system, though overall, their effects don't have too much of an effect on the actual proceedings. Inputting a block command while in the air now lets you evade attacks while jumping, and you can sidestep an opponent's attack by hitting A in tandem with one of the block buttons and a directional input. Granted, these moves can be useful to those who master them, but they don't drastically change the pacing of the game--it's rare that one thinks defensively when playing Smash Bros., so working these techniques into your strategy could very well take a while.The robust event mode rounds out the single-player game nicely. You can consider it analogous to Soul Calibur's mission mode--special matches are set up, and more often than not, the scales are tipped against you. One match has you fighting invisible versions of Star Fox characters, while another has you fighting the whole Super Mario Bros. gang. Many of these matches make for Melee's most engaging single-player experiences, and a good portion of them are incredibly challenging. Again, though, you'll doubtlessly find yourself playing through them, as a fair bit of the game's unlockable elements are hidden therein. But just as with its predecessor, Super Smash Bros. Melee has been primarily designed as a multiplayer game. In this respect, you'll likely be completely satisfied. The default multiplayer mode is a standard free-for-all--you and up to three others can go at it in one of the arenas, with computer players optionally taking up any vacant spots. You can set the matches to end after a given time, or you can tweak the number of lives each player gets, so that the last one standing wins. You can also set up teams and skew them any way you wish--three-against-one matches are entirely possible. The item set is also customizable, allowing you to nix any potentially game-breaking items, such as the aforementioned hammer. A whole bunch of special match settings are available as well. You can play a match with giant-sized, tiny, or invisible versions of all the players, or you can mess with the game's speed, making it lighting fast or super slow, among other things. All these things come together to make Super Smash Bros. Melee one of the most compelling multiplayer experiences on any console. That's provided you're into the game's fighting system, of course. There's really no question about it: Smash Bros. is very fast and loose compared with most other fighting games--so much so that many consider it a traditional party game, rather than a genuine fighter. Be that as it may, there is a bit of technique to the game. It's just that it's very easy to get by without bothering to learn it very well. The game revolves around the concept of smash attacks--moves that will send your opponents flying with the sheer force of their impact (entirely off of the map, ideally). In order to score a proper smash move, you have to damage your opponents heavily--otherwise, they won't fly very far. Every character has a set of these attacks, and they're executed by ~charging~ the analog stick for a second or so prior to inputting an attack command. Depending on your character, you can perform smash attacks in many different directions, on the ground, and in the air. The fighting system overally feels pretty identical to the original game's, though there are a few notable changes. Most important is how grabs are dealt with. In the original game, you were able to grapple an enemy with the R button and very easily send him or her flying just as far as you would with a smash attack. Melee makes it a bit harder to actually connect with a grab--Link's hookshot will fall limp much sooner than before, and Samus' grapple beam doesn't have nearly as ideal of a trajectory as it does in the original. Furthermore, you don't get nearly as much mileage with throws as you used to. You can, however, execute a number of grab attacks when you actually connect--multiple-hit combo throws, and the like, similar to what you'd find in a traditional fighting game. Rest assured, though, that de-emphasizing the throws really does a whole lot of good for Smash Bros. Before, it was way too easy to let the game devolve into a boring throw-fest. A couple of evasive moves were added to the system, though overall, their effects don't have too much of an effect on the actual proceedings. Inputting a block command while in the air now lets you evade attacks while jumping, and you can sidestep an opponent's attack by hitting A in tandem with one of the block buttons and a directional input. Granted, these moves can be useful to those who master them, but they don't drastically change the pacing of the game--it's rare that one thinks defensively when playing Smash Bros., so working these techniques into your strategy could very well take a while.If there's one serious flaw in Melee, it's the hyper-responsiveness of the controls. You'll likely only notice it when you have to make very precise movements--like when moving over an item to pick it up, for instance. Characters seem to dash more often than they should, and in some of the more precarious environments, this can be quite deadly. You'll also likely have trouble switching directions, especially when you've just finished attacking. Again, this isn't such a serious kink, but it's likely to earn you some underserved blows. The game's spastic nature helps hide these little warts, but they'll surface on occasion, and you'll likely be irked. So it's been established that the gameplay wasn't drastically messed with. The graphics, on the other hand, have been lovingly retouched, and the effects are immediately noticeable. The character models are pleasantly full-bodied, and the quality of their textures is amazing. The denim on Mario's overalls looks like the denim on your jeans, and the grit on Bowser's shell is almost tangible. The animations are similarly untouchable, and the fact that everything moves at 60fps makes the wonderful level of detail sink in even deeper. One look at Sheik's ninja-like grace, and you'll be immediately sold. Executing special moves bathes entire stages in gorgeous particle effects, and the stages often boast a fair number of effects themselves. The end result is as amazing, though it's also impressively subtle. The sheer pace of the game keeps you from noticing everything outright, though a quick press of the pause button will allow you to zoom in and enjoy the sights. As you'd expect, all the characters have been faithfully rendered. It's safe to say that most of them have never, ever looked better. There are 14 playable characters available at the outset, and 11 more are hidden throughout the game. Sometimes you'll be challenged by a new character during a multiplayer match, while other times, you'll get to fight one at the end of a single-player game. In most cases, there are numerous ways to unlock the hidden characters, so you'll likely end up with all of them if you play often enough. While all 14 original characters enjoy sufficient distinction from one another, a disappointing percentage of the hidden characters are merely ~clones~ of certain original characters. Granted, the identities of the hidden characters themselves somewhat makes up for this--you'll be nicely amused, most of the time--but the cosmetically altered move sets and minor tweaks on damage outputs and attack priorities are quite disappointing. Still, with a final roster of 25 characters, you'll likely find several that you like. The faces that make up the roster are drawn from many of Nintendo's classics: Mario, Peach, and Bowser represent the Super Mario Bros. series, while Zelda/Sheik and Link uphold the name of their similarly classic franchise. Metroid's Samus is also in attendance, as is Ness from the Earthbound/Mother series, along with a whole gang of Pokmon. Some of the lesser knowns include Popo and Nana, Ice Climbers' titular characters, as well as some faces from Nintendo's Japan-only RPG series Fire Emblem. Finally, there's also a certain character who more-than-aptly represents Nintendo's early excursions into the realm of handheld gaming. Needless to say, the roster is extensive and clever, and the act of filling it in its entirety will be something that few Nintendo fans will want to miss. Same with the stages--they all hearken back to a specific Nintendo game, and fans will immediately recognize them. The Super Mario stages, for instance, include variations on several Mario games. One features the breakable blocks of the original Super Mario Bros, as well as the weight-sensitive platforms. The Super Mario 2 stage features a flying-carpet-riding Pidgit and an assaulting 8-bit Birdo, and the one based on Super Mario World is built around the game's revolving blocks and steep inclines. As you've probably gathered, each of the stages is dynamically interactive in its own particular way, and learning the ways that each one behaves is almost as important as learning your chosen character's move set. Certain stages have built-in environmental hazards, while others are populated by pseudo-characters who assail you at every given chance. Some stages will remain fairly static throughout the length of matches, while others will change dramatically--the hidden Metroid stage counts among this group, and it's safe to say that fans of the classic series will almost shed a tear once they see it in action. Each of these worlds, in any event, is brought to life by brilliant music that's based on the actual game soundtrack it was inspired by. Some are fairly faithful adaptations of the games' music, while others are remixed entirely. It all sounds brilliant, for the most part, and fans of the respective games will no doubt eat it all up.If there's one serious flaw in Melee, it's the hyper-responsiveness of the controls. You'll likely only notice it when you have to make very precise movements--like when moving over an item to pick it up, for instance. Characters seem to dash more often than they should, and in some of the more precarious environments, this can be quite deadly. You'll also likely have trouble switching directions, especially when you've just finished attacking. Again, this isn't such a serious kink, but it's likely to earn you some underserved blows. The game's spastic nature helps hide these little warts, but they'll surface on occasion, and you'll likely be irked. So it's been established that the gameplay wasn't drastically messed with. The graphics, on the other hand, have been lovingly retouched, and the effects are immediately noticeable. The character models are pleasantly full-bodied, and the quality of their textures is amazing. The denim on Mario's overalls looks like the denim on your jeans, and the grit on Bowser's shell is almost tangible. The animations are similarly untouchable, and the fact that everything moves at 60fps makes the wonderful level of detail sink in even deeper. One look at Sheik's ninja-like grace, and you'll be immediately sold. Executing special moves bathes entire stages in gorgeous particle effects, and the stages often boast a fair number of effects themselves. The end result is as amazing, though it's also impressively subtle. The sheer pace of the game keeps you from noticing everything outright, though a quick press of the pause button will allow you to zoom in and enjoy the sights. As you'd expect, all the characters have been faithfully rendered. It's safe to say that most of them have never, ever looked better. There are 14 playable characters available at the outset, and 11 more are hidden throughout the game. Sometimes you'll be challenged by a new character during a multiplayer match, while other times, you'll get to fight one at the end of a single-player game. In most cases, there are numerous ways to unlock the hidden characters, so you'll likely end up with all of them if you play often enough. While all 14 original characters enjoy sufficient distinction from one another, a disappointing percentage of the hidden characters are merely ~clones~ of certain original characters. Granted, the identities of the hidden characters themselves somewhat makes up for this--you'll be nicely amused, most of the time--but the cosmetically altered move sets and minor tweaks on damage outputs and attack priorities are quite disappointing. Still, with a final roster of 25 characters, you'll likely find several that you like. The faces that make up the roster are drawn from many of Nintendo's classics: Mario, Peach, and Bowser represent the Super Mario Bros. series, while Zelda/Sheik and Link uphold the name of their similarly classic franchise. Metroid's Samus is also in attendance, as is Ness from the Earthbound/Mother series, along with a whole gang of Pokmon. Some of the lesser knowns include Popo and Nana, Ice Climbers' titular characters, as well as some faces from Nintendo's Japan-only RPG series Fire Emblem. Finally, there's also a certain character who more-than-aptly represents Nintendo's early excursions into the realm of handheld gaming. Needless to say, the roster is extensive and clever, and the act of filling it in its entirety will be something that few Nintendo fans will want to miss. Same with the stages--they all hearken back to a specific Nintendo game, and fans will immediately recognize them. The Super Mario stages, for instance, include variations on several Mario games. One features the breakable blocks of the original Super Mario Bros, as well as the weight-sensitive platforms. The Super Mario 2 stage features a flying-carpet-riding Pidgit and an assaulting 8-bit Birdo, and the one based on Super Mario World is built around the game's revolving blocks and steep inclines. As you've probably gathered, each of the stages is dynamically interactive in its own particular way, and learning the ways that each one behaves is almost as important as learning your chosen character's move set. Certain stages have built-in environmental hazards, while others are populated by pseudo-characters who assail you at every given chance. Some stages will remain fairly static throughout the length of matches, while others will change dramatically--the hidden Metroid stage counts among this group, and it's safe to say that fans of the classic series will almost shed a tear once they see it in action. Each of these worlds, in any event, is brought to life by brilliant music that's based on the actual game soundtrack it was inspired by. Some are fairly faithful adaptations of the games' music, while others are remixed entirely. It all sounds brilliant, for the most part, and fans of the respective games will no doubt eat it all up.Though it's hard to imagine how HAL could have included more fan fodder in Melee, the developer has indeed done so in the game's trophy mode. As you play the game, you'll have the chance to acquire bonus trophies, which are essentially mounted 3D portraits of famous (and not so famous) Nintendo characters, game items, and settings. This is obviously where HAL went nuts--among trophies of Mario, Link, and Samus, you'll find characters from such obscure games as Clu-Clu Land, Balloon Fight, and Duck Hunt. Nintendo was sure to throw in some fan favorites as well--soon enough, you'll be gazing at a 3D-rendered Pit from Kid Icarus, as well as marvelous renditions of some aliens from Metroid. For the most part, you'll gamble for the trophies--every time you play the main game, you'll gain coins that you can use in the game's lottery mode. Your chances of netting a new trophy decreases every time you gain one, though. Lucky for you, trophies start to pop up more and more within the adventure stages as you progress through the game, and certain bonus rounds allow you to snatch some up as well. In all, there are roughly 300 trophies to collect, so you should expect to be at it for a good while. Super Smash Bros. Melee has clearly been designed to appeal, foremost, to Nintendo's die-hard fans. Those who are familiar with the company's long and illustrious history will no doubt enjoy the game much more than the casual passerby. Judged on its own merits, though, Nintendo's spastic tribute to itself stands quite strong as one of the most engaging multiplayer games available for any console platform. Nintendo's last console was especially strong in the multiplayer department, and, if games like Melee are any indication, the GameCube seems like it will be too. Super Smash Bros. Melee is simply a huge game that, while best enjoyed in the company of others, will also keep the lone, die-hard fan busy for a good, long while. Though it's hard to imagine how HAL could have included more fan fodder in Melee, the developer has indeed done so in the game's trophy mode. As you play the game, you'll have the chance to acquire bonus trophies, which are essentially mounted 3D portraits of famous (and not so famous) Nintendo characters, game items, and settings. This is obviously where HAL went nuts--among trophies of Mario, Link, and Samus, you'll find characters from such obscure games as Clu-Clu Land, Balloon Fight, and Duck Hunt. Nintendo was sure to throw in some fan favorites as well--soon enough, you'll be gazing at a 3D-rendered Pit from Kid Icarus, as well as marvelous renditions of some aliens from Metroid. For the most part, you'll gamble for the trophies--every time you play the main game, you'll gain coins that you can use in the game's lottery mode. Your chances of netting a new trophy decreases every time you gain one, though. Lucky for you, trophies start to pop up more and more within the adventure stages as you progress through the game, and certain bonus rounds allow you to snatch some up as well. In all, there are roughly 300 trophies to collect, so you should expect to be at it for a good while. Super Smash Bros. Melee has clearly been designed to appeal, foremost, to Nintendo's die-hard fans. Those who are familiar with the company's long and illustrious history will no doubt enjoy the game much more than the casual passerby. Judged on its own merits, though, Nintendo's spastic tribute to itself stands quite strong as one of the most engaging multiplayer games available for any console platform. Nintendo's last console was especially strong in the multiplayer department, and, if games like Melee are any indication, the GameCube seems like it will be too. Super Smash Bros. Melee is simply a huge game that, while best enjoyed in the company of others, will also keep the lone, die-hard fan busy for a good, long while."}