{"ref": "https://www.gamespot.com/reviews/la-cops-review/1900-6416069/", "date": "March 17, 2015", "game_name": "LA Cops", "text": "The best video games get better the more you play them. You start with a rough understanding of how everything works, and gradually you find yourself triumphing against mounting odds, until finally, you're a finely-tuned weapon capable of cutting through any mess to save the day. The experience such games offer is exhilarating, rewarding, and fair--and everything LA Cops is not.After a brief tutorial, LA Cops begins with a cutscene that shows a cop finding a wedding ring and a note on a counter. You can piece together what that means, and may feel sorry for the officer, who was so married to his job that his wife decided to find a new husband. Then it's time to pick two officers from a squad of six before you tackle an isometric shooting stage. Your job is to neutralize some gang members who have taken the owner of a donut shop hostage. Collateral damage is okay.The game picks inopportune times to worry about realism.LA Cops is not a long game. It features eight story-based missions, along with an assortment of challenging secondary stages that become available as you clear the primary eight. You can repeat any scenario you like, as often as suits you, on any of three available difficulty settings. Objectives vary from one job to the next, but mostly you need to slowly work your way through a stage, slapping cuffs on goons or--more frequently--blasting them to bits and leaving blood smears on the walls and floor. The former action rewards you with more points, but makes for a tedious and risky progression, since you spend a lot of time running through rooms occupied by several alert gang members at a time.The game picks inopportune times to worry about realism. At the onset, taking a hit means that your officer is quite likely dead. He drops to the floor in a huge pool of blood, and control shifts immediately to the second officer. Generally, you can find a first-aid kit somewhere in the area that allows for one revival, and there are donuts lying around (apparently, the five-second rule doesn't apply) that you can use to restore health if somehow you take damage and live to tell the tale, but it's best to assume that a single mistake is fatal.Additional missions are a chore, not a reward.Unfortunately, the game is built so that mistakes are inevitable. Sprawling environments mean you can almost never see as far as you need to, even if you pull the camera out as far as it can go. This adds tension (which is good) while allowing for some really cheap moments (which are bad). Shoot a lone guard in the corridor ahead of you, but don't start forward just yet because the sound of your shot might cause another guard--or five, or six--to emerge from adjoining rooms with murder on their minds. Such events never happen consistently because, while enemy placement is approximately the same every time you attempt a stage, guards make the rounds in random patterns. Progression at the speed of a crawl is all but required in the later stages, even once you think you're familiar with everything, since getting rushed by a few men at once is dangerous, even if you expect it and back away into a room you've already cleared.On your first few trips through a stage, you also get to discover all sorts of neat surprises. A wall looks solid, so you creep along in search of your next threat, only to get gunned down because, actually, someone saw you through a window that you weren't aware existed. You find out about that on your next attempt, when it may or may not factor into the course of the game at all. Or maybe you're caught in a shootout and a bullet hits a propane tank, explodes, and vaporizes you. That's all part of the learning process.Everything looks good enough to provide a sense of place, but minimalism is the order of the day.The fact that you have a partner is supposed to make the rigmarole easier to handle, but it doesn't. Technically, you can set up ambushes and work as a team. Any time you like, you can switch from one officer to the other at the press of a button. Or you can invite your friend to join you by pointing the finicky cursor to a likely spot and pressing a different button. If you time it right, a load screen tip explains, both of you can burst into a room at the same time and give your adversaries hell. In theory, this is wonderful, and adds depth to the game. In practice, it doesnt work. The timing is touchy, for one thing, but a bigger issue is your ally's tendency to get gunned down the minute he's spotted by anyone. The bad guys always seem to shoot first, unless you lure them around a corner where your partner is positioned and he happens to feel ambitious. Except in rare cases, your backup works better as a second life than as a means of getting more juice out of the first one.Character customization is offered, and you might suppose it would impact how everything plays out, but it doesn't, really. You earn two, three, or four skill points when you clear a stage, depending on your rating, and you can assign those to any officer on the force. Each character can be maxed out with 100 points that allow them to use weapons besides pistols--an all but mandatory skill in later stages--and to lengthen life meters, improve speed, expand weapon clip size, and increase the damage that bullets inflict. You have to accumulate a lot of points before you see a difference, and even then, a bullet or two is just as fatal.The bad guys always seem to shoot first, unless you lure them around a corner where your partner is positioned and he happens to feel ambitious.LA Cops also has problems with difficulty balance. The first four missions are a nice warm-up. They'll frustrate you if you try to rush through them, but they feel fair unless shots don't line up, which is a random but rare occurrence. Then the fifth stage is suddenly packed with goons and you have to work much harder to survive, but that's still not so bad. Next, the sixth stage comes along and presents a large area with garage doors that suddenly lift so that waves of enemies can swarm you. When you advance to the building's second floor, an action that previously activated checkpoints that you could return to as often as you wished, you are notified that failure means a trip back to the beginning of the stage. The game neglects to mention that you can keep retrying as long as the restrictive timer remains (it carries over even if you continue after both officers fall). The best strategy is thus to run through the rooms as quickly as you can, guns blazing, only the game doesn't tell you that, instead punishing you for not figuring it out in time. From then on, new stages produce extra wrinkles that are similarly exasperating. Additional missions are a chore, not a reward.If the game offered meaningful incentives for triumphing over its quirks, that would go a long way toward making the play more enjoyable, but the cutscenes are too brief and disjointed to be interesting. They tell a slightly humorous story, filled with bad dialogue, making fun of 70s cop films without doing anything to improve on them. Character models are drawn just well enough that you can see them for the stereotypes they are, which could still work well if most of the characters weren't apparently voiced by one guy, who sounds disinterested in everything he says. If the soundtrack weren't so delightful and appropriate, you'd almost be better off playing with the sound muted. In the actual levels, everything looks good enough to provide a sense of place, but minimalism is the order of the day, and the splashes of crimson that result when you gun down a bunch of thugs are the most interesting thing you ever see.LA Cops has the pieces that could have been used to build an interesting shooter, but they only occasionally come together. The result is a frequently maddening slog through isometric hell, framed by a broken story and sloppy mechanics, suggesting that what the game needed more than anything was further play testing and refinement. You're better off replaying something you already like that does a better job of treading similar ground, rather than enduring this cop story gone bad."}