{"ref": "https://www.gamespot.com/reviews/abzu-review/1900-6416489/", "date": "August 2, 2016", "game_name": "ABZU", "text": "When I die, I hope whatever happens next is even half as beautiful as Abzu. Its mesmerizing soundtrack and Wind Waker-esque visuals are among the most enrapturing in recent memory, yet the game's true beauty stems not from its bittersweet score and inviting undersea environments but from its unfailing ability to imbue every moment with childlike wonder. Abzu is serene and meditative, calming and cathartic, moving and timeless, its simple components assembled so elegantly as to become something altogether richer.There's a striking sort of purity about Abzu that invites comparison to another, equally powerful game: Journey. As in Journey, Abzu's characters are nameless, its story wordless, its campaign brief. It also eschews many mechanics we might consider standard for a modern adventure/exploration game, including combat, character progression, and fail states. It even lacks the ambient multiplayer that made Journey such a profound experience for many players. But Abzu finds meaning in other places and, like Journey, evokes a vast array of emotions with grace and ease.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: ABZU - ReviewThough the campaign follows a linear path, you're typically free to explore areas at your own pace, following subtle environmental cues toward hidden details or grasping on to massive creatures like orcas and manta rays as they glide effortlessly through the blazing blue water. You can even pause to ~meditate~ at certain statues, allowing you to experience the world from the perspective of the animals around you. Doing so doesn't earn you anything; it's simply an opportunity to observe and enjoy the thriving ecosystems layered into every environment.With lush kelp forests, pink coral reefs, and murky black trenches, Abzu captures the otherworldly beauty of the ocean and populates each breathtaking backdrop with its own unique fauna. You'll find all manner of fish, sharks, eels, whales, crustaceans, and more, all of which behave believably. And yet, somehow, I never felt threatened--curious, awestruck, even intimidated, but never threatened. There's something profoundly peaceful about drifting through that world with no score or objectives or heads-up display to break the spell.That's not to say, however, that Abzu abandons gameplay completely. In fact, the swimming itself feels surprisingly satisfying, thanks in part to the game's novel control scheme. You swim straight ahead by simply squeezing the right trigger, leaving you to look around with the right stick and change direction with the left. Regardless of how you twist and maneuver, your character fluidly adapts to your every input.Meanwhile, tapping X with the proper rhythm builds up your boost, allowing you to flit gracefully through obstacles and breach into the air if you speed toward the surface. Silly as that may sound, it's actually pretty exhilarating, especially when you can entice a school of fish to swim alongside you or get dolphins to flip and squeak almost as if they're playing with you.Abzu is also more than a simple ocean-life simulator. As you push forward, you'll encounter several straight-forward exploration puzzles and even a few tense moments of action, but more importantly, you'll begin to dive deeper and deeper into the game's unspoken narrative. You'll uncover some strange yet adorable robots almost immediately and start to notice scattered ruins of an ancient civilization shortly thereafter.The further you progress, the more exquisite the ruins grow, with gilded paintings, intricate tile work, and ornate, Moroccan-style windows hinting at some tragic past. Suffice it to say the game grows in some truly unexpected and borderline mind-blowing ways. Later areas and gameplay evolutions, though simple, prove remarkably affecting within the context of the experience, cleverly subverting expectations established by the game's earlier portions.Of course, Abzu isn't perfect. The camera occasionally clips through larger objects, for example, and the mechanics walk a very fine line between minimalist and just straight-up simplistic. But these shortcoming are utterly inconsequential in the face of Abzu's countless artistic triumphs--like the music. The soundtrack shifts dynamically as you progress through the environments, stitching together various compositions on the fly to create a mood that matches your surroundings without explicitly calling attention to itself.And that's not all. At certain moments, the camera slowly pulls back to communicate the overwhelming scale of certain creatures and environments. I swam eye to eye with a blue whale and have never felt more awestruck or insignificant in a video game. On another occasion, I emerged from a tight cavern and was suddenly enveloped by a vast, empty chasm with an endless darkness beneath me. Again, the deft camerawork turned an already memorable moment into something truly incredible.Art exists to bridge a gap, to communicate emotions or ideas that would otherwise be impossible to articulate. Abzu does this--courageously, confidently, sincerely. Its stirring soundtrack, vivid colors, subtle storytelling, living world, and thoughtful execution combine to create a singularly moving, transcendent experience. In a word: Abzu is beautiful."}