{"ref": "https://www.gamespot.com/reviews/aliens-versus-predator-2-review/1900-2823809/", "date": "November 9, 2001", "game_name": "Aliens Versus Predator 2", "text": "In lieu of the traditional review preamble, here's the answer to the question you're probably wondering about: Yes, Aliens vs. Predator 2 lets you save anywhere. In fact, the first game is so notorious for its end-of-level-only save system that the sequel has become the first shooter to proudly list its unrestricted save feature right on the box. Monolith, taking over the series from UK-based developer Rebellion, has also added a few other things that the first game lacked, such as a compelling campaign structure, an in-game server browser, some interesting multiplayer modes, and the ability to play all the various Alien life stages. About the only thing it managed to screw up was the unimpressive single-player demo released a couple of months ago. So in answer to your second question: Yes, Aliens vs. Predator 2 is better than its demo. It's better than the demo, it's better than the original Aliens vs. Predator, and it's one of the best action games released so far this year. The original Aliens vs. Predator was essentially a series of unrelated levels. It concentrated on creating a mood of relentless dread while relying on the well-developed and well-known Alien and Predator universes to provide an implicit story. For the sequel, however, Monolith has made a complete turnaround. Aliens vs. Predator 2 not only has a plot, but also has one of the most cleverly constructed plots ever attempted in a shooter. Each of the three seven-level single-player campaigns takes place simultaneously. The events that are made up of one especially bad day for the humans manning a research station on planet LV-1201 are presented from three different perspectives: an alien research subject, a member of a predator hunting party, and a colonial marine who is part of a squad sent in response to a distress beacon. Though each story is self-contained, all three intersect at certain points, and the results of actions in one campaign can be seen in the others. For instance, as the marine, you'll encounter a predator trapped in a cryogenic stasis pod, which you must move so that it can fit down a ventilation shaft. During the predator campaign, it's you in stasis watching as the marine works the pod controls, inadvertently freeing you. The game is filled with little crossovers like these, and it becomes almost like a minigame in itself just keeping track of them, if for no other reason than to appreciate the impressive level of thought that went into creating the story's complex underlying structure. Each of the three campaigns takes about four to five hours to complete, but what each lacks in length more than makes up for in density. A lot of content has been packed into these levels; every one is rich with scripted sequences and little unexpected play elements. As in Monolith's No One Lives Forever, virtually every set of human characters that you encounter can be found engaged in some sort of idle chatter, often about some chaos that you caused while playing as one of the other species. This chatter is especially evident in the Alien and Predator campaigns, which both involve a lot more fights against human opponents and a lot more sneaking around. Unlike in the original, large portions of Aliens vs. Predator 2 take place outside. The graphics are powered by the latest iteration of Monolith's Lithtech engine, and, while it has a reputation for being technologically somewhat behind the curve, it certainly gets the job done here. If objects occasionally appear a little blocky, the overall art direction--both in terms of its faithfulness to the films and the otherworldly look of the outdoors environments--is beyond reproach. As you stand on a high cliff and watch two perfectly rendered colonial dropships fly by you, bank left, and continue off into the distance, you'll quickly forgive a few too many squared-off desk chairs. The first game relied almost exclusively on moody lighting to support its somewhat simple-looking environments. The sequel, while not needing it so much as a crutch, continues the trend of fear-inducing lighting schemes. Red security lamps, strobe lights, and pitch-blackness are all put to excellent use. The shoulder-mounted lamps worn by most human soldiers are the game's best lighting effect. The lamps cast a cone of white light that points in whichever direction a soldier is looking. The effect is especially good when several guards are creeping around a murky environment, their lamp cones intersecting as they cross paths. The soundtrack is also excellent. It's a moody mix of ambient clanks and hisses, low bass hums, and screeching strings. The score dynamically changes to a more dramatic composition when you enter a battle. Strangely, it often switches before you're even aware that enemies have detected you, occasionally making the soundtrack a more effective danger signal than the marine's motion detector.The basic play mechanics of the original remain largely unchanged, with a few important exceptions. The marine is still the most familiar and the most fragile of the three species. He's been beefed up a little, however. Unprotected, he'll now last somewhat longer against an alien attack. His weapons are essentially the same satisfying mix of armaments from the movies, with the pulse rifle and the auto-tracking smart-gun being his standbys. A sniper rifle is the most notable addition to his arsenal. Unfortunately, it's basically unused in the single-player campaign; sort of absurdly, you pick it up literally about five seconds before the end of the last level. The sequel's big outdoor areas are a departure from the original game. Since he's clearly meant to be part of a team, the marine's campaign suffers somewhat from a total lack of squad combat. The game teases you with the possibility that you might eventually fight shoulder to shoulder with your fellow marines, but they all tend to get killed just before or just after you come across them. The plot ends up relying on a lot of contrived circumstances to keep you alone, some more ludicrous than others. At one point, you have to open of series of doors for the rest of the squad, who all wait for you in the safety of the APC. You're told that one man ~just might be able to make it through,~ though there's absolutely no evidence that three or four wouldn't have been a much safer plan. The predator has a few new weapons, most notably a net gun for trapping enemies and a remotely detonated mine launcher. Along with the original's medicomp, which transfers energy to health, the predator now has a device that also recharges his energy. This permits him to fully charge both his energy and health in between fights, and it ends up making him potentially more unstoppable than he was before. To counterbalance this, he's somewhat weaker now--just barely sturdier than the marine, in fact. The alien has undergone the biggest overhaul. Along with its standard tail and claw attacks, it now has a pounce attack that's essentially a superlong jump that causes hapless humans to explode on contact. To help line up jumps, the alien's heads-up display now includes a small aiming reticle. This reticle also helps in the successful execution of the alien's health-replenishing head bite, which is a lot easier to pull off now. Perhaps the biggest change to the alien game is the new ability to play as all of the various alien life stages. In the campaign's first level, you're a relatively defenseless face hugger scurrying through the shadows while looking for a host. Both the low perspective and the sneaking mechanic are handled perfectly, and the transition to the next stage is surprising, funny, and really satisfying. Despite a few problems, AVP2 is one of the year's best shooters. Multiplayer now includes an in-game server browser and a few new modes of play. Deathmatch and team deathmatch are still supported, as are last man standing and predator/alien tag, though their names have been changed to survivor and hunt, respectively. The new modes are evac, a team game in which one side must prevent the other from reaching a predetermined spot and surviving there for 10 seconds, and overrun, which is a team game in which one side must defend a position against an enemy assault. Except for the scoring system, the two new modes are pretty similar. The co-op skirmish mode that was included in the original is now gone, and bots have not been implemented. The networking code also appears to need some work, and games are choppy even on low-ping servers--both of which could be due to the paucity of decent servers at this point. However, it's possible that this will be fixed in a patch. Either way, if you're planning on buying the game strictly for multiplayer over the Internet, you may want to wait for a patch or two. Laggy multiplayer matches, however, don't mitigate the excellence of the single-player game. Aliens vs. Predator 2 takes everything that was good about the first iteration and expands on it. It's more complex, it's scarier, it's funnier, it's more action-packed--it's quite simply more all over. Another year, another great shooter by Monolith. Who could have predicted it? And for hard-core purists, you can even turn off the save-anywhere feature if you want.The basic play mechanics of the original remain largely unchanged, with a few important exceptions. The marine is still the most familiar and the most fragile of the three species. He's been beefed up a little, however. Unprotected, he'll now last somewhat longer against an alien attack. His weapons are essentially the same satisfying mix of armaments from the movies, with the pulse rifle and the auto-tracking smart-gun being his standbys. A sniper rifle is the most notable addition to his arsenal. Unfortunately, it's basically unused in the single-player campaign; sort of absurdly, you pick it up literally about five seconds before the end of the last level. Since he's clearly meant to be part of a team, the marine's campaign suffers somewhat from a total lack of squad combat. The game teases you with the possibility that you might eventually fight shoulder to shoulder with your fellow marines, but they all tend to get killed just before or just after you come across them. The plot ends up relying on a lot of contrived circumstances to keep you alone, some more ludicrous than others. At one point, you have to open of series of doors for the rest of the squad, who all wait for you in the safety of the APC. You're told that one man ~just might be able to make it through,~ though there's absolutely no evidence that three or four wouldn't have been a much safer plan. The predator has a few new weapons, most notably a net gun for trapping enemies and a remotely detonated mine launcher. Along with the original's medicomp, which transfers energy to health, the predator now has a device that also recharges his energy. This permits him to fully charge both his energy and health in between fights, and it ends up making him potentially more unstoppable than he was before. To counterbalance this, he's somewhat weaker now--just barely sturdier than the marine, in fact. The alien has undergone the biggest overhaul. Along with its standard tail and claw attacks, it now has a pounce attack that's essentially a superlong jump that causes hapless humans to explode on contact. To help line up jumps, the alien's heads-up display now includes a small aiming reticle. This reticle also helps in the successful execution of the alien's health-replenishing head bite, which is a lot easier to pull off now. Perhaps the biggest change to the alien game is the new ability to play as all of the various alien life stages. In the campaign's first level, you're a relatively defenseless face hugger scurrying through the shadows while looking for a host. Both the low perspective and the sneaking mechanic are handled perfectly, and the transition to the next stage is surprising, funny, and really satisfying. Multiplayer now includes an in-game server browser and a few new modes of play. Deathmatch and team deathmatch are still supported, as are last man standing and predator/alien tag, though their names have been changed to survivor and hunt, respectively. The new modes are evac, a team game in which one side must prevent the other from reaching a predetermined spot and surviving there for 10 seconds, and overrun, which is a team game in which one side must defend a position against an enemy assault. Except for the scoring system, the two new modes are pretty similar. The co-op skirmish mode that was included in the original is now gone, and bots have not been implemented. The networking code also appears to need some work, and games are choppy even on low-ping servers--both of which could be due to the paucity of decent servers at this point. However, it's possible that this will be fixed in a patch. Either way, if you're planning on buying the game strictly for multiplayer over the Internet, you may want to wait for a patch or two. Laggy multiplayer matches, however, don't mitigate the excellence of the single-player game. Aliens vs. Predator 2 takes everything that was good about the first iteration and expands on it. It's more complex, it's scarier, it's funnier, it's more action-packed--it's quite simply more all over. Another year, another great shooter by Monolith. Who could have predicted it? And for hard-core purists, you can even turn off the save-anywhere feature if you want."}