{"ref": "https://www.gamespot.com/reviews/aliens-vs-predator-2-primal-hunt-review/1900-2877990/", "date": "August 21, 2002", "game_name": "Aliens Versus Predator 2", "text": "Primal Hunt, the first expansion pack for last year's excellent Aliens Versus Predator 2, will take you around six hours to finish. But it's hard to fault Primal Hunt for its length. For better or worse, 20 bucks for every six hours of gameplay is about average for a modern shooter. However, the expansion doesn't manage to squeeze any memorable settings, set pieces, story elements, or surprises of any kind into those six hours. The single-player campaign is frustrating and boring in equal measures, and nothing really noteworthy has been added to the multiplayer game, so you can feel free to hold all that against it. As in the original, the expansion features separate human, alien, and predator campaigns (three levels for each) that all intersect at certain points. Primal Hunt feels like a retread of segments from Aliens Versus Predator 2, but without that game's novelty, great pacing, or skillfully executed action sequences. On top of that, while the new developers at Third Law have copied Monolith's design, they haven't done it closely enough, and they generally screw up the parts that worked in the original. For example: In both Aliens Versus Predator 2 and Primal Hunt, the first alien mission involves scurrying through the level as a face hugger attempting to find a suitable host. The original made this into a sort of interactive cutscene with a clear but cleverly camouflaged path through it. Primal Hunt, on the other hand, attempts to turn it into more of an action sequence with dismal results. In the original, you had to avoid humans, whose overheard conversations not only added some color to the mission but also gave you an indication of what they were likely to do, so you could plan when to move and when to stay hidden. In Primal Hunt, you're avoiding predators, who communicate using uninteresting and indecipherably monotonous shrieks. The level consists of avoiding the apparently arbitrary movements of these predators while searching for the often disguised cracks and vents that will lead you to the next section of the ship. The humans in the original were all either unreachable or in tight groups, making them clearly unsuitable targets for face-hugging. In Primal Hunt, it's entirely possible for a solitary predator to get separated from its pack, at which point you can pounce on it and attach yourself to its head. But unless it's the single correct target at the end of the level, you'll simply die, even though, by all appearances, you've successfully face-hugged a victim. There's one rigidly enforced path through the level, but the design is so sloppy that it becomes a save-and-reload drill as you try to figure out exactly what the developers want you to do. For the human marine campaign, Primal Hunt eliminates the creeping dread of the best parts of the original and instead focuses on an extended running battle. Rather than setting up some cunning action sequences, the game primarily relies on one trick used over and over again--dropping aliens either right on top of your head or right behind you. This is especially frustrating both because the humans are so fragile and because their weapons are primarily useful at medium to long range. Your survival ultimately hinges on saving and reloading enough to memorize where the aliens are coming from at any point, turning the entire human campaign into a grim, futuristic homework assignment. Conversely, the predator's levels are the most consistently entertaining in the game, though not because any one thing stands out as surprisingly good, but simply because nothing in them is especially bad. The graphics and sound are all about the same as in the original. Most of the environments, in fact, appear to be taken almost directly from Aliens Versus Predator 2. Three new monsters have been added, though they all look too goofy and cartoonlike for their surroundings. As sort of an acknowledgement of their weakness, two of them are really utilized only once or twice. The third--a big worm that, in a really annoying reversal of the developer's alien strategy, arbitrarily pops up from directly beneath your feet--is used too often. Four completely undistinguished multiplayer maps are included in the expansion. No new game types have been created, and none of the four maps can be used in the overrun or evac modes. The humans get a new short-range 360-degree motion detector, a double pistol, and mountable turrets, the predators get an unexciting flchette gun and a really underpowered suicide detonation attack, and the predaliens can now bite heads. None of these subtle changes will make an impression on anyone but the most hard-core Aliens Versus Predator players. Improbably, Primal Hunt suffers from copying the original both too much and not enough. The original Aliens Versus Predator 2 was a much better game, and you'd be better off going back and playing it again instead."}