{"ref": "https://www.gamespot.com/reviews/sudden-strike-review/1900-2669531/", "date": "January 2, 2001", "game_name": "Sudden Strike", "text": "Sudden Strike is a real-time strategy game that takes place during World War II and has lots of little soldiers, tanks, and artillery pieces. And that's it. The game might initially rekindle nostalgic childhood memories of playing with plastic toy soldiers, thanks to its clean graphics and its variety of authentic-looking World War II military units. However, Sudden Strike's simplistic, straightforward gameplay prevents the game from staying interesting for very long. Despite how it looks, Sudden Strike is not a realistic war simulation. There may be a superficial resemblance to the Close Combat series, but Sudden Strike doesn't attempt to model any of the factors - weapon lethality, vehicle armor thickness, and unit morale - that made Close Combat a real-time wargame. Sudden Strike takes the conventional 2D isometric real-time strategy perspective and, instead of filling it with aliens or futuristic tanks, fills it with the sights and sounds of World War II. It's an interesting setting, and it gives a great first impression. However, though the graphics are superficially attractive, it can be somewhat difficult to discern different infantry types, especially behind obstacles. Nevertheless, the game does superbly reproduce a number of historical units, and this helps give Sudden Strike its realistic appearance. But that realism doesn't carry through to the gameplay, which would be fine if the gameplay had something else to recommend it. Unfortunately, it doesn't. In practice, Sudden Strike is just like most any other 2D real-time strategy game, except without the depth introduced by building or resource management. Each scenario starts with a fixed force of mixed units (that may be increased by reinforcements later on), which you must use to achieve your objectives. Your units have capabilities that don't exactly correspond to real life: Infantry can easily destroy tanks, antitank guns are equally deadly against armor and infantry, and the standard real-time-strategy fog of war replaces any kind of realistic line-of-sight system. While there are tactical considerations to troop deployment, there is little real strategy that doesn't involve marshalling your forces and attacking en masse. The simplicity of the gameplay in Sudden Strike might be bearable, but the unit pathfinding is so bad that it makes the act of moving units over anything other than short distances an exercise in frustration. You can set waypoints and queue orders, but since your units typically can't find their way from one waypoint to another, these features aren't of much use. When dealing with some of the larger scenarios, this problem even threatens to make the game unplayable. Luckily, Sudden Strike lets you pause the game to give orders to your units. Without this ability, the lack of formations and the abysmal unit pathfinding would reduce the game to the equivalent of cat herding. In the single-player game, you'll have to pause often to sort out the units that will inevitably stray and scatter when they perform even the most basic maneuvers. Sudden Strike includes full campaigns from the German, Russian, and Western Allied sides. The solo campaigns contain some truly huge missions, which have literally hundreds of individual units doing battle. Furthermore, the game comes with an entire second CD of additional scenarios, which brings the total number of scenarios to 50. This only partially compensates for the fact that there is no skirmish mode, which means that you can't just choose a map and some starting units and have the computer generate a scenario. The lack of a random scenario generator is a big drawback for the multiplayer mode as well. Also, the absence of a campaign autosave means that you can lose a lot of progress if you don't explicitly save your game from time to time. But moreover, because of the fundamental lack of depth in the gameplay, Sudden Strike boils down to tedious pointing and clicking (exacerbated by that awful pathfinding) that wears thin as soon as the novelty of the World War II environment wears off. The designers of Sudden Strike cleverly recognized what 8-year-olds around the world have known all along: It's fun to watch little toy soldiers and tanks get blown up. Unfortunately, Sudden Strike can't get past this simple idea - but once you've seen it enough, there's no reason to stick around. All the clever animations, amusing sounds, and pretty battle graphics in the world can't replace an interesting combat system. It's enjoyable to see little tanks and airplanes act out their little version of World War II in Sudden Strike, but this doesn't make the game fun to play - at least not for long. Sudden Strike sometimes manages to evoke the atmosphere of World War II, but this atmosphere is all that's going for it."}