{"ref": "https://www.gamespot.com/reviews/nba-ballers-rebound-review/1900-6151593/", "date": "May 19, 2006", "game_name": "NBA Ballers: Rebound", "text": "When the original Ballers was released in 2004, it brought a breath of fresh air to the arcade basketball genre. Not since Dr. J versus Bird had anyone pulled off a one-on-one basketball game that was quite as compelling. The experience of the original Ballers game has now been shrunken down into portable form on the PlayStation Portable with NBA Ballers: Rebound. While it still retains the same modes and fun gameplay from the original, that's also part of the problem--you're hard pressed to find what's new in the game. But as a straight port of the original, Rebound gets the job done and delivers a fun basketball experience on the go. All the rim-rattling, ankle-breaking action you enjoyed from the original game is distilled into a portable format. The first thing you'll notice about Rebound is that the sharp-looking graphics from the original game have been translated nicely over to the PSP. The player models look great, and they animate nicely, whether they're pulling off some streetball dribbling moves or getting up high in the air to throw down a vicious dunk. Frame rates hold up nicely and the animations all blend together pretty well. Player faces are also spot-on for the most part, and all the players are easily recognizable. On the downside, some of the nice details in the various player cribs have been lost or muddled in translation to the PSP, but since you're spending most of your time looking at the players on the court anyway, it's not a huge loss. The game's sound effects are also pretty good, with spirited play-by-play from MC Supernatural and typical NBA Jam-like sound effects used for steals and blocks. If you rip the ball or swat it, you'll definitely know it. As in the original game, Rebound is primarily a one-on-one affair. There is also a one-on-one-on-one mode (also known as 21 in some playgrounds), but the main modes in the game, TV Tournament and Rags to Riches, are just one on one. TV Tournament has you taking the role of an NBA star as you play against other all-stars and legendary players in a tiered tournament to unlock more players, as well as points that you can use to buy other goodies such as cribs and gear. You'll eventually unlock dozens of players, both current and from the past. Rosters in Rebound have been updated to current day, so instead of seeing Vince Carter in a Raptors uniform as you did in the original Ballers, you'll see him repping the New Jersey Nets. Young stars such as Ben Gordon are available, as well, but you'll still get to play with favorites such as Kevin Garnett and unlock the all-time greats such as Magic Johnson. Rags to Riches is where the meat of the game lies. This story-based mode will have you create your own baller at the start and attempt to bring him up through a series of televised one-on-one tournaments, where you'll earn notoriety, points, jewelry, and eventually a gawdy crib of your own if you make it all the way through. The options available to customize your appearance are pretty robust, and of course, you have the option to buy new gear to outfit your character with as you earn points by completing tournaments. The problem with all this is that much like the original Ballers on the PlayStation 2, navigating menus in Rebound is a total pain because of long load times. This makes shopping for your created baller a chore and takes away from the value of all the bling and crazy clothes you can earn. Despite this problem, it's quite satisfying to play through the two campaigns in Rebound, which are lengthy, albeit somewhat repetitive by nature. The fact that the basic gameplay in Rebound is fun takes a lot of the edge off the fact that you're just playing a lot of one on one. While the focus of Rebound is squarely on street-style basketball, much of the gameplay centers on doing crazy moves and juking your opponent out of his shoes. There are a variety of ways to do this--simply tapping on the juke button will unleash a series of different maneuvers. You can also combine that button with the ~juice~ (basically, turbo) buttons to do different tricks, such as throwing the ball off your opponents face, as well as more elaborate stunts such as passing the ball between his legs or throwing the ball up from behind your back over your opponent. The more outrageous maneuvers you can string together before making a basket, the more points you earn, and the more you build up your ~house~ meter. Fill up that house meter, and you can do the special ~juice house~ alley-oop, which will break the basket off its stanchion and win the game for you, regardless of the score. The juice house oop breaks the backboard and ends the match. You can unlock more moves in the game, as well, such as the ability to pass the ball out of bounds to a friend who can pass it back to you or do acrobatic stunt dunks where you climb up on an opponent before throwing it down on him. There's also a way to post up players, which involves a button-mashing minigame to fight for position when you back down your opponent. But for the most part, the most fun and effective way to play Rebound is to use a slick-handling guard who can pull off a lot of ankle-breaking moves and throw alley-oops to himself off the glass or the opponent's head. As far as defense goes, since there isn't really much in the way of collision detection in the game, position defense doesn't work out as well as going for lots of steals or blocked shots, which makes for entertaining, offensive-oriented basketball that occasionally offers a spectacular block or steal. If you tire of the game's single-player modes, Rebound offers local Wi-Fi ad-hoc play for up to two players. There's no game-sharing mode, but you can take your unlocked ballers into the game and play on any cribs you've unlocked. The game works about as well as you'd expect in this mode, and you can tweak options, such as winning conditions, to your liking. Overall, NBA Ballers: Rebound is a competent arcade basketball game for the PSP, retaining everything that was cool about the original game, such as the gameplay design and graphics, but also keeping a lot of the not-so-great aspects, such as long loading times and not enough unlocked content at the outset of the game. If you never played the original game or just want a good basketball game to play on the go, Rebound fits the bill. If you already played Ballers and were hoping for more refinement or something a little different, the game is pretty much the same one you played two years ago."}