{"ref": "https://www.gamespot.com/reviews/borderlands-the-zombie-island-of-dr-ned-review/1900-6241371/", "date": "November 25, 2009", "game_name": "Borderlands", "text": "While it may be mixed up about which holiday season it belongs in, The Zombie Island of Dr. Ned is right on target when it comes to entertainment. This undead-themed add-on freshens up your Pandoran adventuring with swampy new environments that provide a great backdrop for satisfying gunplay. Your innumerable zombie targets crawl, lurch, and run at you from every direction, and bigger, quicker Halloween-flavored foes spice things up in some clever ways. There's a lot to do on the Zombie Island, and though you can complete the main quest in a little over four hours, side quests can extend your play time significantly. While there are some minor issues to consider, the overall package is strong. And with much more humor per pound than the original game, The Zombie Island of Dr. Ned is a lot of entertainment for only 800 Microsoft points ($10). When you download The Zombie Island of Dr. Ned, a new location becomes available from any fast travel kiosk, even if you haven't unlocked fast travel yet. Jakob's Cove is a mill town owned by the gun manufacturer (~Remember, if it took more than one shot, you weren't using a Jakob's!~) and is set on a swampy island covered with massive trees. These gnarly plants loom overhead, and dark green vines dangle from their branches, creating a gloomy, verdant atmosphere. Other environments feature hillside graveyards, ramshackle towns, and familiar zombie-filled streets. Throughout your adventures, you are treated to a much heftier dose of humor than you are in the main game. Amusing recordings give you silly glimpses of other adventurers, and a cheerfully coldhearted company representative reminds you to never, under any circumstances, engage in oral contact with the undead. Dr. Ned himself has some great lines, and he preserves his general apathy throughout the revealing campaign to hilarious effect. This liberal dose of humor, combined with the new environments, helps create a healthy variety both within the add-on and when compared to the main game. Pretty much every place you go is crawling with zombies. They drop down from trees, emerge out of the ground, and otherwise stand around waiting for fresh brains to wander by. You'll fight torsos that crawl, midgets that leap, and shambling workers with beer helmets. Some zombies spit on you to cloud your vision and slow your movement, while another sprints toward you and explodes just after ripping his own arm off like a gruesome grenade pin. Many zombies explode more enthusiastically than their living counterparts, and you'll see limbs popping off in a variety of amusing ways. These variations can be humorous as well as strategically relevant. Scoring a headshot on a zombie will cause its brain to pop out, and these can be collected as part of an amusing quest, provided you find the right fellow. And the hulking Tankensteins don't just look like their cinematic inspiration, but they share his affinity for electricity, so you'd be wise to avoid dealing them shock elemental damage. Though sometimes the hectic action can result in visual slowdown, these moments are few enough that they won't hinder your enjoyment. As you blast your way through quests and mow down hordes of the undead, you'll be treated to the steady stream of loot you've come to expect from Borderlands. To get loot and face enemies commensurate with your level, it's important to keep the following in mind: The Zombie Island of Dr. Ned scales everything according to your progress through the main story of Borderlands, not according to your character's level. So before you head to Jakob's Cove, take stock of your situation. If the enemies and the level of your current main story quest are about on par with your character's level, then you'll find a good challenge and good loot on the Zombie Island. If you've been spending time leveling but not advancing the story (that is, by doing lots of side quests or playing cooperatively with someone at a different point in the story than you), you may be overleveled for your current story progress. This could make Zombie Island too easy and make your loot haul unsatisfying. You'll get the most out of it if your character level is on par with your story progress, but, of course, once you complete Zombie Island and go back to your campaign, you'll likely be a bit overleveled. Still, it's better to tackle this content straight on and be overleveled when you return to the main game. Aside from getting more bang for your buck, you'll get to experience boss battles and set-piece battles as you were meant to. The Zombie Island of Dr. Ned is a nicely distilled slice of Borderlands that bodes well for future DLC potential. The dramatic moments that are fairly strung out in the main game happen with invigorating regularity. And the flashes of comedy are much more frequent, giving the action a lively, entertaining vibe. From voice recorders chronicling the exploits of unsuccessful zombie hunters, to the casually maniacal hilarity of Dr. Ned, to heartbreaking Claptrap-on-Claptrap violence, The Zombie Island of Dr. Ned delivers the game's distinctive humor even better than the original and has all the great gunplay and satisfying loot to boot. If you've got any kind of desire to seek out further adventures on Pandora, you should definitely pay the Zombie Island a visit."}