{"ref": "https://www.gamespot.com/reviews/sunny-garcia-surfing-review/1900-2828761/", "date": "May 17, 2006", "game_name": "Sunny Garcia Surfing", "text": "In the realm of video games, few things stink as badly as a cash-in, be it a licensed game where the license is the only thing worth mentioning or a game being recycled under the pretense of being a new game. Sunny Garcia Surfing, the latest offering from Australian developer Krome Studios, is an example of the latter in the worst way. Krome Studios has gussied up the Championship Surfer engine slightly, bringing essentially the same game to the PlayStation 2. The age of the engine is apparent, and the presentation and gameplay simply aren't up to par with those of more modern surfing games.If you've played Championship Surfer, then you'll have no problem picking up Sunny Garcia Surfing, as the gameplay systems of the two games are virtually identical, though Sunny Garcia has a much easier learning curve. The tricks consist of the variety of aerial, lip, wave-face, and barrel-riding tricks that you'd expect from a surfing game, but the trick system is still needlessly complicated and totally unintuitive, forcing you to constantly refer to the archaic in-game tutorial screen, which gives instructions on how to execute any of the game's 55 tricks. While Sunny Garcia Surfing easily exceeds the playability of Surfing H3O, the other PlayStation 2 surfing game, pulling off tricks in the game simply isn't as much fun as it should be. The gameplay modes found in Sunny Garcia Surfing are essentially a carbon copy of those found in Championship Surfer, sans the trick attack mode and the eight-player multiplayer support. There's the championship mode, which puts you in a surfing competition, complete with the time limits, ladder eliminations, and panel-style scoring. In the arcade mode, you're charged with scoring a certain number of points by pulling off tricks before you can advance to the next level, all while avoiding obstacles like buoys, mines, and other water-sports enthusiasts. The rumble mode is the most unique mode in Sunny Garcia Surfing, as it puts two surfers on the same wave, with points awarded for knocking your opponent off his or her board and for using the various power-up items that are scattered about each level. King of the waves is another multiplayer competition mode. Unlike the rumble mode, king of the waves is scored strictly on the tricks you perform. Time attack is a simple time-based surfing session, and the free surf mode allows you to goof around with unlimited bails and unlimited time. The game offers plenty of modes of play, more than most of the competition, but they are all slight variations on the same theme, and the gameplay itself just isn't engaging enough to make any of them terribly interesting.While the game admittedly looks better than its PlayStation and Dreamcast ancestors and addresses some of the camera and slowdown issues that stifled Championship Surfer, it's still way behind the curve for current PlayStation 2 games, barely competing with first-generation PS2 software. The water has no natural roll to it, as the waves look far too sharp and angular and seem to emerge from nowhere. The textures on the water vary from level to level, but within each environment they are repeated infinitely, giving an eerie uniform look to the ocean. The surfer models are generally well constructed, but their animation is stiff and paltry. The only time the surfers seem to actually animate is when standing up to catch a wave or when performing a complex aerial trick--the rest of the time they generally stand still, giving a slight twist of the hips when making cuts in the wave.As has become the norm in action sports games, Sunny Garcia Surfing features a soundtrack loaded with licensed music. Sticking primarily with bands of the punk persuasion, such as MxPx, Mustard Plug, Sprung Monkey, and 88 Finger Louie, the soundtrack will undoubtedly please fans of second- and third-wave punk rock, but the lack of variety limits its general appeal greatly. However, the soundtrack greatly overshadows the game's environmental sounds, which basically serve as filler for silences in the songs and consist of the ocean's roar and your surfer's screams as he or she falls off a wave. A year ago, a surfing game like Sunny Garcia may have been given some leeway, as both the surfing genre and the PlayStation 2 were both in their infancy. But since then, the surfing genre has been greatly refined, and the PlayStation 2 has experienced a massive influx of quality games. Surfing fans may get a kick out of Sunny Garcia Surfing regardless of its many flaws, but it's highly recommended that you test the water with a rental first."}