{"ref": "https://www.gamespot.com/reviews/college-hoops-2k6-review/1900-6140557/", "date": "November 29, 2005", "game_name": "College Hoops 2K6", "text": "On the heels of its excellent pro basketball game, NBA 2K6, 2K Sports has shipped College Hoops 2K6 for the Xbox and PlayStation 2. College Hoops borrows a lot of the new control features introduced in NBA 2K6, including the revamped isomotion jukes and the shot stick for flexible control over your jukes and the types of shots you attempt. But as in NBA 2K6, the real draw to College Hoops is its artificial intelligence and deep legacy mode for hardcore hoops fans. It's too bad that the visuals and sound in the game just don't measure up to the rest of the package. College Hoops 2K6 has arrived just in time for college basketball season. The first thing that longtime players of College Hoops will notice in 2K6 is the brand-new control systems, which were introduced in NBA 2K6. First of all, the new isomotion juke system is now in the series. Instead of using the right analog stick to execute fancy dribble maneuvers, you toggle the right and/or left trigger buttons to put your ball handler into an aggressive stance. Once you do that, jiggling the left analog stick will not only move your player, but it will also execute juke moves. If the ball's in your player's right hand, toggling the stick from right to left will execute a crossover. Do a half circle and he'll wrap the ball around his back instead. As you experiment with the isomotion, you'll find that you can easily chain together moves ranging from jab steps to crossovers, to backspins and more. It's not an easy system to learn for sure, but once you get it down, you'll find that you have a lot of control over how your ball handler moves. The new shot stick is also included in College Hoops 2K6. Since the juke moves have been switched off of the right analog stick, that part of the controller now serves as another means to shoot the basketball. The interesting thing about the shot stick is that it lets you emote different types of shots. Tap away from the basket from midrange and you can execute a fallaway jumper. Drive the hoop and tap to either side, and your shooter will try a one-handed scoop with either hand. Different types of dunks can also be executed depending on how you move the stick as you drive an open lane--the more agile dunkers can do some spectacular throw-downs. The post game is also made more interesting by the shot stick, as you can execute different types of post moves like spins, drop steps, fallaways, and up-and-unders with a combination of the shot stick and the aggressive modifier. For the faint of heart, the standard shot button still remains, which will allow the computer to select a shot for you as with any other basketball game. But for those of us who want the added control, the shot stick works pretty well once you get the hang of it. Other new tweaks to the gameplay have also been made, such as the intuitive pull-and-release free-throw mechanism, which works just as well in this game as it did in NBA 2K6. Perhaps more important is the inclusion of a flexible quick menu system called the ~coach's clipboard~ that pops up at every play stoppage. This great feature lets you quickly make player substitutions, as well as other adjustments to your defense. There are quite a few options made easily available to you, so you can fine-tune when you want to execute presses and traps (your options include always executing your press, never, occasionally, or only after made baskets). There is also quite an array of different presses you can do, ranging from simple half-court traps to a two-two-one zone press. You can also adjust double-team frequencies on certain players, change matchups for man-to-man defenses, and even call out points of emphasis for your players to focus on, like rebounding and ball control. It's a little tough to tell how much effect the points of emphasis have on your players, though. Hundreds of schools are available in the game, so your alma mater is almost surely available. On the court, you now have access to up to eight different quickplay calls from the D pad. You can press any direction to execute a play that you've designated from the game's extensive playbook, and you can also toggle the left shoulder or trigger button to call up a second set of four plays from the D pad. There are dozens of plays available, and there are a few different playbooks available depending on the type of offense your school runs, including flex and motion offenses. Only four different quick defenses are available from the D pad, but you can assign these from the usual array of different zone defense types like three-two, two-three matchup, and box-and-one. Traps in this game can be particularly effective, as you can often tie up a ball handler by bringing a quick double-team on him. It's pretty satisfying to generate a lot of turnovers (and thus, easy baskets) by running full-court presses, but you can just as easily get burned by teams that break the press with crisp passing. The gameplay in College Hoops 2K6 is excellent. Schools seem to run the type of game that they do in real life. You'll see squads like Wisconsin play hard-nosed defense and grind out the shot clock on offense. Other teams like Washington will attempt to run and gun up and down the court and shoot earlier in the shot clock to generate tempo. Opponents will also mix up defenses on you and press at different times to show you different looks. Perhaps most impressive is that teams actually appear to run offenses in the half-court games, so you'll see players moving off the ball and usually in an intelligent manner. It's important to be able to read the type of defense being run on you so you can attack the open spots. Zone-buster plays that overload one side of the floor can be effective against two-three zones. You can also find open spaces to shoot in the corners against three-two zones. The offense/defense chess match is best exemplified in College Hoops' coach mode feature, where you don't take direct control of any players, but instead call out offensive sets and defenses as you watch the computer play for you. For us, it's not as fun to not have control over the game, but the coach mode seems to work pretty well if you're into that sort of thing. Just be sure to load up your quickplay slots with actual plays. If you leave the computer to its own devices, it doesn't seem to run a very efficient offense for you without your guidance. College Hoops 2K6's legacy mode is another clear highlight of the game. In this mode you can take control of a school of your choice and try to lead it to the top of the college hoops over a period of years. You'll have total control of a college basketball program, and many of the coaches are even named for you, such as Ben Braun at Cal. For some reason, though, many other high-profile coaches like Mike Krzyzewski at Duke are named generically. The legacy mode includes access to rosters, stats, standings, and playbooks, so you can adjust the style of basketball your school plays. The calendar contains full schedules of games, which seem very accurate for the 2005-06 college basketball seasons, including regional preseason tournaments. You'll even see special shows like a season preview special and a Selection Saturday special hosted by veteran college basketball commentators Greg Gumbel and Clark Kellogg. Practice regimens can be adjusted for your players to focus on areas like shooting and the post game. You'll even get e-mails from time to time regarding players who are disgruntled about playing time and other issues for you to deal with. It may not look like much... The heart of the legacy mode is, of course, recruiting, which is year-round in College Hoops 2K6. You're presented with a large list of recruits who are ranked for you based on the primary and secondary attributes that your program looks for in college players. These general attributes include skill, potential, athleticism, and intelligence. So depending on what your program values are, the types of recruits you'll look for may vary. The recruiting trail requires you to assign coaches to contact or scout recruits, and doing so costs you time points on a weekly basis. Time spent on the recruiting trail means less time available for your coaching staff to scout opponents and practice with the team--so you'll need to balance everything carefully depending on the schedule, your coaching staff's strengths (some coaches are better at recruiting, some are better at scouting players and teams), and your team's needs. This is all fun and compelling content for those who love the micromanagement aspect of legacy modes in college sports games. Unfortunately, for those who might feel out of their depth, the computer doesn't seem to put any effort into recruiting players for you if you're not interested or able to handle that aspect. If you simulate through the whole season (playing or coaching games without diving into the recruiting side), it's very possible you'll end up without any incoming players for the next season. The legacy mode is also not without some other quirks, too. For example, while individual player and team stats seem generally realistic and reasonable from year to year, we've noticed that the NCAA tournament sometimes invites far too many teams from one conference and not enough from others. For example, one year we simmed resulted in a whopping 10 schools from the Big East getting an invite to the big dance, while the Pac-10 was limited to only one school--and it was USC, not traditional powers like UCLA or Stanford. In real life, even a down year would result in at least three invites for a major conference. Quirks aside, College Hoops 2K6's legacy mode is still a great part of the game, and hoopheads are likely to lose themselves for hours upon hours in the mode, handling recruiting and coaching their favorite schools to glory. The Xbox version does, of course, simulate through games noticeably faster than the PS2 version, so if you're likely to spend a lot of time in legacy mode, this is worth keeping in mind. ...but it's easily your best option for a college basketball video game. College Hoops 2K6's primary faults are in its presentation, which isn't nearly as polished as its pro-basketball cousin, NBA 2K6. The graphics in the game benefit from a lot of the slick animations used in NBA 2K6, but unfortunately, the other aspects of the visuals are almost primitive. The lighting, even in the Xbox version, is disappointing, resulting in floors that look drab and flat. The character models are noticeably blocky and lack detail, and the crowds in particular are downright ugly at times. The general sound effects from the court and crowd are pretty decent, but the new announcing crew of Verne Lundquist and Bill Raftery is a clear downgrade from last year's duo, Mike Patrick and Jay Bilas. Lundquist does a passable job, but Raftery's vapid and oddly nuanced remarks pale in comparison to almost any other color commentator, let alone someone as knowledgeable as Bilas. What might be even more disappointing is the lack of fight songs available in the game. Only a handful was included, and they don't even cover many of the traditional basketball powerhouses. You'll hear Maryland's and Arizona's fight songs, but there's no Duke, Michigan State, or Indiana fight songs available. Instead, you'll have to choose from the likes of New Hampshire's, Sacramento State's, or Southern Methodist's fight songs. Don't let the compromises in College Hoops 2K6's presentation dissuade you if you're a big-time college basketball fan. College Hoops 2K6 is still an excellent simulation of NCAA basketball, and the improvements in control that were imported from NBA 2K6 only improve on an already-winning formula. The lower $30 price point should also help justify the budget-level graphics and sound on a game that otherwise plays wonderfully. College Hoops 2K6's legacy mode is another clear highlight of the game. In this mode you can take control of a school of your choice and try to lead it to the top of the college hoops over a period of years. You'll have total control of a college basketball program, and many of the coaches are even named for you, such as Ben Braun at Cal. For some reason, though, many other high-profile coaches like Mike Krzyzewski at Duke are named generically. The legacy mode includes access to rosters, stats, standings, and playbooks, so you can adjust the style of basketball your school plays. The calendar contains full schedules of games, which seem very accurate for the 2005-06 college basketball seasons, including regional preseason tournaments. You'll even see special shows like a season preview special and a Selection Saturday special hosted by veteran college basketball commentators Greg Gumbel and Clark Kellogg. Practice regimens can be adjusted for your players to focus on areas like shooting and the post game. You'll even get e-mails from time to time regarding players who are disgruntled about playing time and other issues for you to deal with. It may not look like much... The heart of the legacy mode is, of course, recruiting, which is year-round in College Hoops 2K6. You're presented with a large list of recruits who are ranked for you based on the primary and secondary attributes that your program looks for in college players. These general attributes include skill, potential, athleticism, and intelligence. So depending on what your program values are, the types of recruits you'll look for may vary. The recruiting trail requires you to assign coaches to contact or scout recruits, and doing so costs you time points on a weekly basis. Time spent on the recruiting trail means less time available for your coaching staff to scout opponents and practice with the team--so you'll need to balance everything carefully depending on the schedule, your coaching staff's strengths (some coaches are better at recruiting, some are better at scouting players and teams), and your team's needs. This is all fun and compelling content for those who love the micromanagement aspect of legacy modes in college sports games. Unfortunately, for those who might feel out of their depth, the computer doesn't seem to put any effort into recruiting players for you if you're not interested or able to handle that aspect. If you simulate through the whole season (playing or coaching games without diving into the recruiting side), it's very possible you'll end up without any incoming players for the next season. The legacy mode is also not without some other quirks, too. For example, while individual player and team stats seem generally realistic and reasonable from year to year, we've noticed that the NCAA tournament sometimes invites far too many teams from one conference and not enough from others. For example, one year we simmed resulted in a whopping 10 schools from the Big East getting an invite to the big dance, while the Pac-10 was limited to only one school--and it was USC, not traditional powers like UCLA or Stanford. In real life, even a down year would result in at least three invites for a major conference. Quirks aside, College Hoops 2K6's legacy mode is still a great part of the game, and hoopheads are likely to lose themselves for hours upon hours in the mode, handling recruiting and coaching their favorite schools to glory. The Xbox version does, of course, simulate through games noticeably faster than the PS2 version, so if you're likely to spend a lot of time in legacy mode, this is worth keeping in mind. ...but it's easily your best option for a college basketball video game. College Hoops 2K6's primary faults are in its presentation, which isn't nearly as polished as its pro-basketball cousin, NBA 2K6. The graphics in the game benefit from a lot of the slick animations used in NBA 2K6, but unfortunately, the other aspects of the visuals are almost primitive. The lighting, even in the Xbox version, is disappointing, resulting in floors that look drab and flat. The character models are noticeably blocky and lack detail, and the crowds in particular are downright ugly at times. The general sound effects from the court and crowd are pretty decent, but the new announcing crew of Verne Lundquist and Bill Raftery is a clear downgrade from last year's duo, Mike Patrick and Jay Bilas. Lundquist does a passable job, but Raftery's vapid and oddly nuanced remarks pale in comparison to almost any other color commentator, let alone someone as knowledgeable as Bilas. What might be even more disappointing is the lack of fight songs available in the game. Only a handful was included, and they don't even cover many of the traditional basketball powerhouses. You'll hear Maryland's and Arizona's fight songs, but there's no Duke, Michigan State, or Indiana fight songs available. Instead, you'll have to choose from the likes of New Hampshire's, Sacramento State's, or Southern Methodist's fight songs. Don't let the compromises in College Hoops 2K6's presentation dissuade you if you're a big-time college basketball fan. College Hoops 2K6 is still an excellent simulation of NCAA basketball, and the improvements in control that were imported from NBA 2K6 only improve on an already-winning formula. The lower $30 price point should also help justify the budget-level graphics and sound on a game that otherwise plays wonderfully."}