{"ref": "https://www.gamespot.com/reviews/froggers-adventures-the-rescue-review/1900-6078562/", "date": "May 17, 2006", "game_name": "Frogger's Adventures: The Rescue", "text": "Frogger, gaming's classic amphibian with a knack for dodging oncoming traffic, saw his initial rebirth onto modern-day consoles back in 1997 with Frogger for the PlayStation. It was the first Frogger title to bring the series to a 3D universe, and although the game wasn't problem-free, it did a pretty good job of translating the classic style of hop-and-dodge gameplay the original arcade Frogger had made so famous. Since that initial remake, numerous sequels have followed, each taking the series further and further into more dynamic and bizarre directions, such as by giving the Frogger character himself a voice (and pants to go along with it), by creating side characters and plots to go with the games, and even by attempting to turn Frogger into a straight-up platformer game. The latest Frogger title to hit shelves is Frogger's Adventures: The Rescue, a game that continues the style of 3D puzzle gameplay found in the PlayStation remake. However, the game's heavy emphasis on a disjointed and needless plot and some generally unimpressive production values are Frogger's Adventures main drawbacks, though they don't prevent the game from being enjoyable overall. Everyone's favorite car-dodging amphibian has returned, and this time, he's up against the ever-dangerous Tyrannical Reptiles in Power. Frogger's Adventures finds our amphibious hero and the other residents of Firefly Swamp facing the threat of annihilation by the Tyrannical Reptiles in Power--or TRIP--who have uncovered an ancient weapon of mass destruction. Adding insult to injury, TRIP has also kidnapped Frogger's beloved girlfriend, Lily. Ultimately, it's up to Frogger, along with the assistance of the Frog International Rescue Support Team--or FIRST--to defeat TRIP and save the day. As completely nonsensical as this may sound, it's even more nonsensical in its execution. The game's entire story is told through cutscenes in between each level--unfortunately, none of them do a particularly good job of giving you any good sense of what's going on. New characters will appear with no introduction to speak of, and key points of explanation are simply bypassed in favor of a brief, near-useless summarization at the end of each scene, leading you to believe that perhaps hefty portions of the intended story were simply left on the cutting-room floor. Further, the story itself is decidedly geared toward a very young audience, so much so that anyone not of the targeted age group will inherently find the story more a bothersome nuisance than anything else. But who cares about the story? The whole point of Frogger is the gameplay, and in that respect, Frogger's Adventures does the franchise some due justice. The game plays near identically to some of the more recent Frogger titles, such as Frogger Beyond. The game puts in front of you seven levels, each with four to five unique stages that contain a bevy of traps, moving obstacles, moving platforms, and so on. Frogger can't attack, so it's up to you to navigate him from the beginning to the end of each stage without being hit. Essentially, the game is broken up into blocked spaces that Frogger can traverse. You control Frogger by pressing a direction on either the left control stick or directional pad. You can also make him jump an extra space by pressing the jump button, make him turn either left or right by pressing the right or left shoulder buttons, and make him use his tongue to move objects and pull himself across extensively wide gaps. There are also a number of coins and extra life power-ups scattered throughout any given stage for you to collect. Also found in each stage are a number of save points. As you will likely die from time to time, hitting these points allows you to start back at each one following your untimely demise. Unfortunately, once you're out of lives, you'll have to restart that stage all over again. Although there are a pretty good number of save points in every stage, certain sections seem like they could have benefited from one or two more, due to the trial-and-error-like nature of some of the game's puzzles. Thankfully, the game auto-saves to your memory card at the end of every stage, so you don't have to get through a full level before being able to save. This is especially needed for the game's boss stages. The techniques needed to beat each of the game's bosses are pretty basic, but learning the bosses' attack patterns can often require more than one attempt, and trying to get away from them at key times can be a bit frustrating, as the controls don't always respond as quickly as you'd like them to. However, after a few tries, you should be able to breeze past any boss. Frogger's Adventures also contains challenge and multiplayer modes to complement the main story mode. Challenge mode lets you play through any previously defeated stage in a timed run, with the goal being to try to beat the stage as quickly as possible. Multiplayer mode actually has several games, like panel puzzle, where you have to flip tiles by hopping on them to complete a puzzle; coin collecting, in which your goal is to collect more of the available coins in the level before time runs out or before one of your opponents collects them; and rapid race, which is basically just a quick race across a randomly generated stage. Every multiplayer game is a four-player game, but you can play them with any number of real players, with the remaining slots being filled by CPU players. Not every game is particularly fun, but most of them are plenty entertaining. The classic style of 3D Frogger gameplay is fully intact in Frogger's Adventures, but the game's insipid storyline does hamper the overall experience a bit. In terms of presentational aspects, Frogger's Adventures is serviceable, though not especially impressive. The overall look of the game is identical to last year's Frogger Beyond in nearly every conceivable way. The level designs are new and reasonably cool, but they're also fundamentally similar in concept to those in last year's game. None of the game's cutscenes are especially good looking, and the video compression used on them, especially in the PS2 version, makes them look even worse. Additionally, the game's camera, though good at letting you see exactly what you need to see, has a tendency to stutter when you're moving Frogger through a section too quickly. Frogger's Adventures' sound fares somewhat better, thanks primarily to some good in-game and menu music and competent, if somewhat overwrought, voice acting. There aren't many sound effects to speak of, but what's there is equally as good as the rest of the audio design. Frogger's Adventures doesn't take the series into any real new territory, which is both a blessing and a detriment. While it retains the same solid gameplay of its recent predecessors, the story is far too elementary to appeal to anyone outside of the youngest gaming audience, and its noticeably aging graphics don't do much to help the cause. However, if what you seek is solely some quality Frogger gameplay, and you're willing to forgive the facile story and run-of-the-mill graphics, Frogger's Adventures is certainly worth a look. It may not reinvent the franchise, but hey, it's still Frogger, and that's certainly worth something."}