{"ref": "https://www.gamespot.com/reviews/punch-king-review/1900-2872689/", "date": "May 17, 2006", "game_name": "Punch King", "text": "It's been quite a while since Nintendo dusted off its Punch-Out!! series. To be exact, it's been a long 15 years. At that rate, it's fair to say that other companies can take a shot at the formula without angering fans of the series. Apparently, Full Fat, the developer of Punch King, feels the same way. In just about every respect, Punch King is a direct descendent of Nintendo's legendary boxing game, but it fails to deliver where Punch-Out!! always did: in the gameplay department. Punch King includes 12 boxers to choose from and just a scant three gameplay modes. The arcade mode plays very similarly to the arcade versions of Punch-Out!!. You play as Tiger Armstrong, a young boxer looking to make his mark in the sport. The arcade mode is basically a ladder of opponents you have to defeat on the way to becoming the punch king, with a simplistic story thrown in for good measure. The fights last three rounds, and there's a three-knockdown rule in effect. In between rounds, you come back to your corner to get some suggestions from your trainer, and in order to succeed, you basically have to memorize the patterns of each opponent. Survival mode pits you against another boxer with no definitive rounds to speak of. You simply fight boxer after boxer until you can go on no longer, and you do not recover health between fights. The versus mode is misleading because it doesn't allow you to box against other humans using the Game Boy Advance Link Cable. Instead, you choose from any AI-controlled boxers you've defeated in the arcade mode and duke it out. Playing Punch King is frustrating because timing the dodges and ducks is far too difficult. It can take the better part of an hour to really learn the right time to dodge incoming punches, and in the end you'll find yourself looking to slip in punches between the animation routines of opponents instead of waiting to dodge. Young players will have problems defeating even the very first opponent in the game, and with only three continues and no save option, frustration levels can be very high when first getting started. Even after you have the timing down, with each new opponent comes a completely new set of punches to time, and the frustration begins all over again. The fighters in Punch King are about as close to those in the Punch-Out!! series as they can get without inviting a lawsuit. Wan Jab Lo fights and looks just like Dragon Chan, while Bucky Tooth is a dead ringer for Super Macho Man. All the opponents have a special attack that is more difficult to dodge than their regular punches, and just like in Punch-Out!!, their eyes give you clues as to when they're going to unleash them. The animation for the game is very poor and seems to be missing a number of frames, which makes timing your moves even more difficult. The boxers are very large onscreen and somewhat pixilated, and during fights your boxer is transparent so you can better see your opponents. In all, Punch King looks fairly good, though its look decidedly lacks any sort of originality. Punch King tries its best to be the next Punch-Out!!, but it falls well short of the mark. It's is a tempting game because it's the closest thing to Nintendo's boxing franchise released in the past decade, but its substandard gameplay and jerky graphics ensure that it will never reach the same status as the series that inspired it. The difficult timing and the lack of a convenient save features make it a very difficult game to play, so fans of Nintendo's boxing franchise will just have to continue waiting for the real thing."}