{"ref": "https://www.gamespot.com/reviews/sonic-gems-collection-review/1900-6131881/", "date": "May 17, 2006", "game_name": "Sonic Gems Collection", "text": "Most big game publishers are content to get some extra mileage out of their back catalog with broad classic compilations. Sega has instead focused its nostalgic energy specifically on the Sonic the Hedgehog franchise. Having already repackaged all the original Sonic games for the Genesis with Sonic Mega Collection and Sonic Mega Collection Plus, Sega and Sonic Team return with nine rather obscure Sonic games in Sonic Gems Collection. Unless you're a devout Sonic fan, you probably haven't heard of most of the games included here--and, with a few exceptions, most of these games aren't really worth hearing about. Sonic Team gets obscure with Sonic Gems Collection. Interestingly, while Sonic Team supervised the compilation of Sonic Gems Collection, the studio, which originally conceived Sonic the Hedgehog, had little to do with the development of most of the games included. AM2, the studio behind Virtua Fighter, applied its 3D fighting know-how to Sonic and friends in Sonic the Fighters. Originally powered by Sega's Model 2 arcade hardware, Sonic the Fighters looks and plays pretty much like a stripped-down version of Virtua Fighter 2. Sonic Gems Collection marks the first proper US release for Sonic the Fighters, but that bit of novelty is the main draw here, as the game just feels dated and simplistic. Sonic CD, on the other hand, is a far more playable game. Released originally for the Sega CD and the PC, Sonic CD takes its cues from the original side-scrolling Sonic the Hedgehog games, though Sonic CD's unique time-traveling mechanic definitely helps set it apart. Since it came on a compact disc--a rarity for video games at the time--one of the most standout aspects of Sonic CD when it was originally released was the fidelity of the soundtrack. Though some exceptionally obsessive Sonic fans may turn all red in the face because the game uses the US soundtrack rather than the original Japanese soundtrack, the hot guitar licks of ~Sonic Boom,~ the game's opening theme, still sound as crisp and ridiculously over the top as they originally did in 1993. Nostalgia or no, Sonic CD is easily the best game in this package. One of only two original Sonic games to make it to the Sega Saturn, Sonic R is basically a 3D foot-racing game featuring Sonic characters. Originally developed by UK studio Traveller's Tales, Sonic R was a pretty crummy game in 1997, and in 2005 the game's only redeeming quality is its laughably bad soundtrack. The version included here is actually based on the PC version of Sonic R, so the textures look cleaner and the frame rate is smoother than in the Saturn version; but this still isn't enough to make Sonic R worth more than a few minutes of your time. Though Sonic the Fighters, Sonic CD, and Sonic R are the set's main attractions, Sonic Gems Collection also features six Sonic games that originally appeared on the Game Gear. Sonic the Hedgehog 2 and Sonic the Hedgehog Triple Threat feature some typical Sonic side-scrolling action, though Triple Threat, having been developed later on in the life of the Game Gear, isn't as technically limited and does a better job of capturing the Sonic side-scrolling feel. Sonic Spinball, a game essentially based on the pinball-style casino levels from the original Sonic the Hedgehog, suffers from lousy collision detection and a thin premise. Sonic Drift 2 is a quasi-3D kart racer that is basically unplayable because of poor handling and a really short horizon. Tails' Skypatrol is a unique and challenging little action puzzle game in which you take Sonic's two-tailed buddy through a series of forced movement levels, using a special ring to attack enemies and activate machinery that moves otherwise life-threatening obstacles out of your way. Finally, Tails Adventure is a generic and vaguely European 2D side-scroller that severely slows down Miles Prower's gait and arms him with bombs that he throws at enemies. These Game Gear titles are all over the place in terms of quality, but all of them are hampered by what appears to be poor Game Gear emulation, which makes for some frustrating frame rate issues. Are you willing to pay 30 bucks for Sonic CD? In addition to these nine Sonic titles, you can unlock Vectorman and Vectorman 2, both of which originally appeared on the Genesis. Vectorman's unique graphical style still looks pretty solid, and the series' challenging brand of plaforming action remains quite engaging, though Vectorman 2 simply isn't as good as the original. These games are nice--if somewhat arbitrary--additions to the package, though we would have preferred to see the Streets of Rage games included instead, as was the case in the Japanese version of Sonic Gems Collection. Still, there are a wealth of other bonuses you can unlock here, such as music, character art, and more. With its current $29.99 price tag, Sonic Gems Collection is a tough pill to swallow. Despite the inclusion of some fan favorites and rarities, most of the games in Sonic Gems Collection simply aren't good enough to warrant being called ~classics.~"}