{"ref": "https://www.gamespot.com/reviews/dead-or-alive-2-hardcore-review/1900-2649208/", "date": "November 1, 2000", "game_name": "DOA2: Hardcore", "text": "Not content with the wide acclaim that the Dreamcast version received when it was released earlier this year, Tecmo has added even more new features to its flagship fighting game, Dead or Alive 2. The game, now titled Dead or Alive 2: Hardcore, adds new costumes, stages, and voices to the mix, and for the most part the game has retained its extremely smooth look. The original Dead or Alive was powered by Sega's Model 2 arcade hardware, and it played quite a bit like Virtua Fighter 2 with the addition of special danger zones that delivered various new effects. DOA2 breaks out of the Virtua Fighter mold: It has full 3D movement, a rather necessary countering system, and overall it's a more interesting game. DOA2 offers a variety of mostly standard modes, from the regular story mode, to versus, tag-team-battle, training, and survival. The tag-team-battle mode is pretty exciting, because DOA2's tags occur almost instantaneously. This makes it easy to start a juggle combo and keep the juggle going. Unlike Tekken Tag Tournament, DOA2's tag-team battles are down to the last man, so one-on-two fights can and do occur. The story mode consists of one-round fights and hilariously meaningless prefight exchanges between characters. The horrific English voice work only amplifies the humor. While DOA2's fighting leans toward the button-mashing side of things, there's plenty of depth to be found, thanks in part to the countering system, which makes countering moves as easy as hitting back, and to the ~free~ button, which lets you walk around the stage in full 3D. This occasionally leads to counter syndrome, where both players run at each other and immediately counter over and over again, hoping to catch the other player off guard. It looks incredibly silly. Still, regardless of your methods, DOA2 is a fun multiplayer game, and the four-player option in tag-team-battle mode is especially exciting. DOA2: Hardcore looks simply amazing. The animation is smooth, but the character models are what really stand out. The fighters all look extremely smooth. Little things like clothes, hair, and tassels move appropriately, almost never clipping into the characters' bodies. And, of course, the series' trademark gimmick - large, bouncing breasts - is as prevalent as ever. The soundtrack is a little annoying. While the fighting sounds are great, the music - mostly a collection of fairly generic and slightly annoying guitar tracks - fails to impress. The other piece of audio, newly added for this ~hardcore~ edition, is English speech. While you can reset the speech to Japanese and turn on subtitles, the game defaults to some of the worst voice work in recent memory. The delivery is off, the script is absolutely lame, and overall it makes the game laughable. Dead or Alive 2: Hardcore is a pretty good fighting game. The fighting system is fast and fun, though not the deepest system in town. Still, the pretty graphics make it a good showpiece (though, to be honest, it doesn't look that much different from the Dreamcast release), and the game has enough options to make it a worthwhile purchase for fight-hungry PS2 owners."}