{"ref": "https://www.gamespot.com/reviews/star-wars-knights-of-the-old-republic-ii-the-sith-/1900-6118100/", "date": "February 7, 2005", "game_name": "Star Wars: Knights of the Old Republic II - The Sith Lords", "text": "Star Wars: Knights of the Old Republic wasn't just the best role-playing game of 2003. It was one of the best things to happen to Star Wars in years. Knights of the Old Republic impressively succeeded on several counts: It delivered a memorable and open-ended story featuring lots of excellent voice acting, an entertaining strategic combat system, and a lengthy, highly replayable quest. Now all those good traits--as well as the game's few shortcomings--are back once again in Knights of the Old Republic II: The Sith Lords. The sequel is clearly aimed at fans of the original, since it's a very similar game whose storyline picks up not long after the first one left off. Given that The Sith Lords arrives only about a year after its predecessor, it's remarkable that the game's quest is every bit as big and complex as the original's. On the other hand, some unsightly technical issues and a general feeling of dj vu will probably prevent you from feeling as strongly about The Sith Lords as you did or still do about the first game. Nevertheless, it's hard to fault The Sith Lords for following in the footsteps of the original so faithfully. Prepare for another journey of self-discovery and major consequence in The Sith Lords. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Star Wars Knights of the Old Republic II: The Sith Lords Video Review Like its predecessor, The Sith Lords takes place thousands of years before any of the Star Wars movies and is focused on some of the formative struggles between the Jedi and their power-hungry counterparts, the Sith. In the first game, you eventually discovered your Jedi powers, as well as your mysterious past. This time, you play as a different character that begins the adventure as a Jedi--but your knowledge of the character's past, the character's Force powers, and even the character's lightsaber are all missing. A journey of self-discovery awaits, and as you pick up the pieces of your character's past and discover the reasons for his or her exile from the Jedi order, your path will lead you to the few Jedi who survived the catastrophic events that took place at the conclusion of the original game. In your search for them, you'll once again visit the remnants of the Jedi enclave on Dantooine. You'll take sides in a political struggle on Onderon between a queen and a general in her army, and you'll search through the lush jungles of its moon, Dxun. You'll also see some ancient Sith burial grounds on Korriban, and more. The story of The Sith Lords turns out to be quite intriguing most of the way through, thanks to some enigmatic and complex characters and a few exciting episodes you'll experience along the way. However, a fairly terse resolution and some occasionally strange leaps of logic near the end are mildly disappointing, especially given how much exposition there is leading up to the climactic confrontations that occur. But the course of the adventure (which should take you 30 to 40 hours each time through) is rewarding enough as it is, and the story is ultimately about as good as that of the original, and is therefore one of the new game's main attractions. At the heart of Star Wars has always been a traditional struggle of good versus evil, but the franchise is at its best when its conflicts are a little more sophisticated. Much like Knights of the Old Republic before it, The Sith Lords does a great job of making you feel like your actions can have real consequences, one way or another. You'll constantly be faced with good or evil options in your discourse with the game's many characters, and the story pans out differently no matter what you decide. Better yet, the decision making isn't always so cut-and-dried. For instance, one of your companions, a mysterious old Jedi named Kreia, might chastise you for doing what you felt was certainly the right thing. Kreia makes a convincing point, causing you to second-guess yourself: Sometimes, people must learn life's hard lessons firsthand, and helping them out of a bind at these critical moments may not be what's ultimately best for them. The Sith Lords' morally ambiguous storyline has a number of poignant moments along these lines, and since much depends on the decisions you make and the traveling companions you take with you, there will be plenty left to see after you've finished the game for the first time. It also has some nice throwbacks to the original story, most notably in the form of several returning characters whom you'll probably appreciate seeing (and hearing) again. This will be a very familiar experience for Knights of the Old Republic fans, but a completely new story and some new gameplay twists help keep it fresh. From a gameplay standpoint, The Sith Lords doesn't make many changes to the formula established by Knights of the Old Republic. Apart from the numerous superficial similarities between the two, the new game turns out to be roughly as long and as challenging as the first, and it too begins with a few linear sequences before later opening up, allowing you to visit key locations in any order. As before, the gameplay fundamentally consists of three different elements: running from place to place across relatively flat, typically corridor-like environments; interacting with the game's huge cast of characters by choosing from multiple dialogue options (some of which are determined by your character's particular abilities); and doing battle with various types of enemies. The latter two aspects of play are once again far more interesting than all the running around, which can occasionally get a little tedious when you're required to travel back and forth between the same areas, especially when they're separated by loading screens. Meanwhile, the controls and interface are virtually identical to those of the first game, so you'll once again typically travel with two companions, who will gain experience levels at the same rate as your main character. And the underlying role-playing system is basically the same as before, too, so if you wanted to create a character with the same skills and proficiencies you had in Knights of the Old Republic, you certainly could. The Sith Lords even features variations on the same turret-shooting, swoop-racing, and gambling minigames as its predecessor. Despite the overarching similarities, you'll spot a few new twists this time around. You'll find some new weapons, armor, and items on your journey, and the game's cast of characters (including those who'll become your traveling companions) is almost completely original. The Sith Lords also features some new feats and Force powers that your character can learn, and thanks to the new prestige classes, you'll be even stronger at the end of this game than you were at the end of the original. The prestige classes are extensions of the three Jedi classes introduced in Knights of the Old Republic, allowing you to further specialize in lightsaber combat, Force powers, or a well-rounded combination of the two. For good measure, both light and dark versions of the prestige classes are available and have slightly different abilities accordingly. They're a nice addition to the game, although they don't really cause you to rethink your strategy or anything. You'll meet some intriguing new characters, as well as some old ones you'll fondly remember. There's some added depth in The Sith Lords in the ability to either create various useful items in labs or upgrade virtually all your existing equipment to make it more powerful, but you won't feel the need to take advantage of these systems very often since you'll be finding so much new stuff everywhere you go. Another new system involves the ability to gain or lose influence with your traveling companions depending on whether you tell them what they want to hear. Your influence will largely determine whether your allies will loosen their lips (or the equivalent) with regard to some of the most important aspects of their pasts. It's pretty subtle and basically not that different from how Knights of the Old Republic would let you try to persuade certain characters into telling you what you wanted to know, but it helps flesh out your relationships with your party members a bit more. Also, once you regain your lightsaber--which takes a surprisingly long time, but there's a good sense of payoff as a result--you'll learn a variety of different fighting forms with the weapon, each suited to a different type of combat situation. These are good in theory but don't have a particularly noticeable effect in practice. You'll once again be able to veer toward the light or dark side of the Force as you make good or evil decisions. It's usually pretty obvious which is which. Compassionate or humble responses will move you toward the light side, while arrogant or angry responses will move you toward the dark side. Either way, you'll gain experience points by solving quests, so both methods are rewarding. Of course, you'll experience some different conversations and different confrontations depending on which side you choose. And since many Force powers are light-inclined or dark-inclined, you may gradually gain an affinity for one set of powers, letting you use them more efficiently. For this reason, The Sith Lords entices you to at least be consistent in your choice of good or evil responses, though you can go through the game flip-flopping between the two if you prefer. Your alignment will probably also help you decide which of your companions to take with you into the field, since some of them will naturally favor one type of behavior over the other. They'll follow you regardless, but they might complain if you continually act in a manner that's inconsistent with their sensibilities--which may be to your liking, depending on how you wish to play. Watching how the quests pan out depending on whether you choose a good or evil approach is one of the best parts of the game. So The Sith Lords is structurally very similar to the original game, but there's a notable exception. At certain points in the adventure, the action will shift its focus away from your main character to his or her companions. This tends to work well from a storytelling standpoint, but it also means that you no longer have control over the strongest character on your team, so you'll suddenly need to make do with some relatively weaker combatants. Since it's tempting to quickly ~autolevel~ your companions throughout the game, rather than take the time to wisely spend the skill points and choose the new feats and Force powers you get as you level up (which you'll definitely want to do with your main character), it's possible that by the time you stumble into these sequences, your companions will feel woefully unprepared for them. Only by taking advantage of some cheap tricks in the combat system--for example, by putting an obstacle in between ourselves and some sword-wielding opponents and then blasting away with ranged weapons while our enemies tried in vain to reach us--were we able to get past some of these bits. Despite the overarching similarities, you'll spot a few new twists this time around. You'll find some new weapons, armor, and items on your journey, and the game's cast of characters (including those who'll become your traveling companions) is almost completely original. The Sith Lords also features some new feats and Force powers that your character can learn, and thanks to the new prestige classes, you'll be even stronger at the end of this game than you were at the end of the original. The prestige classes are extensions of the three Jedi classes introduced in Knights of the Old Republic, allowing you to further specialize in lightsaber combat, Force powers, or a well-rounded combination of the two. For good measure, both light and dark versions of the prestige classes are available and have slightly different abilities accordingly. They're a nice addition to the game, although they don't really cause you to rethink your strategy or anything. You'll meet some intriguing new characters, as well as some old ones you'll fondly remember. There's some added depth in The Sith Lords in the ability to either create various useful items in labs or upgrade virtually all your existing equipment to make it more powerful, but you won't feel the need to take advantage of these systems very often since you'll be finding so much new stuff everywhere you go. Another new system involves the ability to gain or lose influence with your traveling companions depending on whether you tell them what they want to hear. Your influence will largely determine whether your allies will loosen their lips (or the equivalent) with regard to some of the most important aspects of their pasts. It's pretty subtle and basically not that different from how Knights of the Old Republic would let you try to persuade certain characters into telling you what you wanted to know, but it helps flesh out your relationships with your party members a bit more. Also, once you regain your lightsaber--which takes a surprisingly long time, but there's a good sense of payoff as a result--you'll learn a variety of different fighting forms with the weapon, each suited to a different type of combat situation. These are good in theory but don't have a particularly noticeable effect in practice. You'll once again be able to veer toward the light or dark side of the Force as you make good or evil decisions. It's usually pretty obvious which is which. Compassionate or humble responses will move you toward the light side, while arrogant or angry responses will move you toward the dark side. Either way, you'll gain experience points by solving quests, so both methods are rewarding. Of course, you'll experience some different conversations and different confrontations depending on which side you choose. And since many Force powers are light-inclined or dark-inclined, you may gradually gain an affinity for one set of powers, letting you use them more efficiently. For this reason, The Sith Lords entices you to at least be consistent in your choice of good or evil responses, though you can go through the game flip-flopping between the two if you prefer. Your alignment will probably also help you decide which of your companions to take with you into the field, since some of them will naturally favor one type of behavior over the other. They'll follow you regardless, but they might complain if you continually act in a manner that's inconsistent with their sensibilities--which may be to your liking, depending on how you wish to play. Watching how the quests pan out depending on whether you choose a good or evil approach is one of the best parts of the game. So The Sith Lords is structurally very similar to the original game, but there's a notable exception. At certain points in the adventure, the action will shift its focus away from your main character to his or her companions. This tends to work well from a storytelling standpoint, but it also means that you no longer have control over the strongest character on your team, so you'll suddenly need to make do with some relatively weaker combatants. Since it's tempting to quickly ~autolevel~ your companions throughout the game, rather than take the time to wisely spend the skill points and choose the new feats and Force powers you get as you level up (which you'll definitely want to do with your main character), it's possible that by the time you stumble into these sequences, your companions will feel woefully unprepared for them. Only by taking advantage of some cheap tricks in the combat system--for example, by putting an obstacle in between ourselves and some sword-wielding opponents and then blasting away with ranged weapons while our enemies tried in vain to reach us--were we able to get past some of these bits. Like its predecessor, The Sith Lords isn't necessarily well balanced in terms of its combat system, but this mostly just helps keep you guessing. The combat is in the same quasi-turn-based style of the original, so you can pause and issue orders to any of your characters at any time, but more often, you'll simply watch as they automatically close the distance to attack their foes with melee weapons or hang back and fire away with blasters. Once again, the ranged weapons feel rather underpowered, though, to be fair, this seems consistent with the Star Wars mythos. Nevertheless, if you focus on building up your melee and lightsaber combat skills, you'll soon start to feel virtually unstoppable. Some fights can still be challenging, such as when you're faced with maybe a dozen enemies at once, but the same tactics for consistently winning battles in Knights of the Old Republic apply here as well. As a result, most of the battles in The Sith Lords are probably going to seem easy at the default difficulty, but since there are a few tough fights thrown in every now and then, it's not so easy that you'll automatically want to crank up the difficulty setting. Of further note, the game's combat largely recycles the animations and effects used in Knights of the Old Republic, but it's still surprisingly fun. Something about cutting down droves of Sith troopers with a double-bladed lightsaber just never gets old. Lightsaber combat still looks impressive, but the visuals are a relative weak point in The Sith Lords. A disappointing presentation hurts The Sith Lords, especially on first impression. We encountered a number of minor issues during the course of the game, such as characters who'd occasionally pass through walls (no, it's not a Force power) or dialogue options that would unexpectedly throw us back into the same dialogue loop. The game also sporadically crashed to the desktop in transition between areas, and our computer-controlled companions were prone to some bone-headed tactics when left to their own devices. And it doesn't really look any better than the original, but since it tries to get away with a few new graphical effects, its frame rate is prone to taking nosedives on all but the fastest systems. Given that the game's character models and relatively small environments aren't particularly detailed or attractive to begin with, this is rather unfortunate, since a role-playing game of this caliber really deserves better. On the other hand, the lightsaber action you'll be seeing frequently throughout the second half of the game is impressive, and the characters you'll be speaking with look reasonably good, mostly because their lips (again, if they have lips) are properly synced with their speech. All things considered, The Sith Lords looks fair at best. Fortunately, graphics aren't what's most important to a high-quality RPG. As with the original, the best part about The Sith Lords' audio is its extensive use of speech, of which there must be hours and hours. Most of it is solid, though there are only a few standout performances, such as from Kreia and a certain model of sociopathic droid, with whom you'll get to exchange words, among other things. One blemish in this respect is that the game makes conspicuous use of alien characters during some major plot points, and they noticeably repeat the same alien-sounding speech clips over and over while the actual content of the dialogue drones on in subtitles. The rest of the sound effects are fine, though they're pretty much all recycled from the previous game and countless other Star Wars properties, so they get repetitive quickly. And the musical score consists of the sorts of grand, symphonic compositions that are innate to Star Wars, although the game's attempts to dynamically mix the soundtrack aren't always successful--sometimes the transitions between music pieces can be pretty jarring. But The Sith Lords still sounds great, so it would have been nice if its visuals had been on the level of its audio. The Sith Lords will be perfect for you if Knights of the Old Republic left you wanting more. If Star Wars: Knights of the Old Republic left you wanting more of its near-perfect blend of exploration, combat, and role-playing, then The Sith Lords is going to give you your fill. It's the first product from Obsidian Entertainment, a studio composed of veteran RPG designers that took the development reins on this sequel from BioWare, and it evidently stayed true to the original style and vision in the process--that is, you wouldn't be able to guess just from playing The Sith Lords that this was the work of a different developer. Ironically, though, since Knights of the Old Republic was such a big game, with so much replay value, it didn't necessarily scream for such a similar sequel. As a result, you might have a much tougher time settling into The Sith Lords, since chances are you'll feel like you've played this game before, only you'll swear it looked better the first time. But, on the other hand, so what? It's just as important to note that no other game since Knights of the Old Republic has managed to deliver this excellent style of role playing. If you're a Knights of the Old Republic fan, then you should find a certain satisfaction in knowing almost exactly what you're in for going into The Sith Lords. Like its predecessor, The Sith Lords isn't necessarily well balanced in terms of its combat system, but this mostly just helps keep you guessing. The combat is in the same quasi-turn-based style of the original, so you can pause and issue orders to any of your characters at any time, but more often, you'll simply watch as they automatically close the distance to attack their foes with melee weapons or hang back and fire away with blasters. Once again, the ranged weapons feel rather underpowered, though, to be fair, this seems consistent with the Star Wars mythos. Nevertheless, if you focus on building up your melee and lightsaber combat skills, you'll soon start to feel virtually unstoppable. Some fights can still be challenging, such as when you're faced with maybe a dozen enemies at once, but the same tactics for consistently winning battles in Knights of the Old Republic apply here as well. As a result, most of the battles in The Sith Lords are probably going to seem easy at the default difficulty, but since there are a few tough fights thrown in every now and then, it's not so easy that you'll automatically want to crank up the difficulty setting. Of further note, the game's combat largely recycles the animations and effects used in Knights of the Old Republic, but it's still surprisingly fun. Something about cutting down droves of Sith troopers with a double-bladed lightsaber just never gets old. Lightsaber combat still looks impressive, but the visuals are a relative weak point in The Sith Lords. A disappointing presentation hurts The Sith Lords, especially on first impression. We encountered a number of minor issues during the course of the game, such as characters who'd occasionally pass through walls (no, it's not a Force power) or dialogue options that would unexpectedly throw us back into the same dialogue loop. The game also sporadically crashed to the desktop in transition between areas, and our computer-controlled companions were prone to some bone-headed tactics when left to their own devices. And it doesn't really look any better than the original, but since it tries to get away with a few new graphical effects, its frame rate is prone to taking nosedives on all but the fastest systems. Given that the game's character models and relatively small environments aren't particularly detailed or attractive to begin with, this is rather unfortunate, since a role-playing game of this caliber really deserves better. On the other hand, the lightsaber action you'll be seeing frequently throughout the second half of the game is impressive, and the characters you'll be speaking with look reasonably good, mostly because their lips (again, if they have lips) are properly synced with their speech. All things considered, The Sith Lords looks fair at best. Fortunately, graphics aren't what's most important to a high-quality RPG. As with the original, the best part about The Sith Lords' audio is its extensive use of speech, of which there must be hours and hours. Most of it is solid, though there are only a few standout performances, such as from Kreia and a certain model of sociopathic droid, with whom you'll get to exchange words, among other things. One blemish in this respect is that the game makes conspicuous use of alien characters during some major plot points, and they noticeably repeat the same alien-sounding speech clips over and over while the actual content of the dialogue drones on in subtitles. The rest of the sound effects are fine, though they're pretty much all recycled from the previous game and countless other Star Wars properties, so they get repetitive quickly. And the musical score consists of the sorts of grand, symphonic compositions that are innate to Star Wars, although the game's attempts to dynamically mix the soundtrack aren't always successful--sometimes the transitions between music pieces can be pretty jarring. But The Sith Lords still sounds great, so it would have been nice if its visuals had been on the level of its audio. The Sith Lords will be perfect for you if Knights of the Old Republic left you wanting more. If Star Wars: Knights of the Old Republic left you wanting more of its near-perfect blend of exploration, combat, and role-playing, then The Sith Lords is going to give you your fill. It's the first product from Obsidian Entertainment, a studio composed of veteran RPG designers that took the development reins on this sequel from BioWare, and it evidently stayed true to the original style and vision in the process--that is, you wouldn't be able to guess just from playing The Sith Lords that this was the work of a different developer. Ironically, though, since Knights of the Old Republic was such a big game, with so much replay value, it didn't necessarily scream for such a similar sequel. As a result, you might have a much tougher time settling into The Sith Lords, since chances are you'll feel like you've played this game before, only you'll swear it looked better the first time. But, on the other hand, so what? It's just as important to note that no other game since Knights of the Old Republic has managed to deliver this excellent style of role playing. If you're a Knights of the Old Republic fan, then you should find a certain satisfaction in knowing almost exactly what you're in for going into The Sith Lords."}