{"ref": "https://www.gamespot.com/reviews/super-bust-a-move-review/1900-2827182/", "date": "May 17, 2006", "game_name": "Super Bust-A-Move", "text": "Ubi Soft's Super Bust-A-Move for the Game Boy Advance is a fun, near-perfect port of the PlayStation 2 game of the same name. Using a launcher at the bottom of the screen, you need to shoot colored bubbles toward a larger collection of bubbles on the ceiling in order to match the like colors and clear them away before the mass reaches the bottom. Sure, it sounds simple enough, but a bevy of bizarre obstacles and freaky power-ups gives Super Bust-A-Move a level of addictiveness and challenge rarely seen on handheld systems.Like the PS2 version, the GBA port of Super Bust-A-Move features a single-player puzzle mode and a two-player battle option. The single-player selection offers 270 different boards to complete, split equally between normal and classic variations. Longtime fans of the series will recognize the puzzles in classic mode, while the normal mode offers power-ups and obstacles unique to this particular rendition of the game. The battle mode may be played against the CPU or against a human opponent, and it allows each player to pummel his or her opponent with extra bubbles for every successful cluster matched.Super Bust-A-Move isn't difficult to play, in that you merely need to ricochet bubbles off the walls and ceiling in order to match like colors. However, if you're new to the series, or haven't played in a while, you'll be pleased to note that this rendition is packed with all-new power-ups and obstacles. Giant bubbles transform adjacent bubbles into their color when stricken, tiny bubbles let you ricochet into tight spots, rainbow bubbles alter the color of nearby bubbles whenever you complete an adjacent cluster, gem ~cross~ bubbles clear away all matching bubbles, arrow bubbles move the position of the launcher, and iron-ball bubbles tear through entire rows of bubbles. Despite the helpfulness of these items, you still have to be mindful of wooden posts, metallic bubbles, and conveyor-belt walls that impede your progress.Although Super Bust-A-Move for the GBA is intricate and enjoyable, the things that separate it from its Game Boy Color predecessors are its gorgeous background designs and crisp, well-defined bubble sprites. The purple, blue, and pink hues give the game a soothing feel, and they never distract players from the bubble field itself. It is sometimes difficult to discern between similar colors, such as pink and white or purple and black, but this is mostly an effect of the GBA's dim screen, as the problem is less pronounced in well-lit locations.There isn't much to say about the game's background music and sound effects, though. An assortment of cheesy yet cute music tracks accompanies each stage, while the sound samples for bubble launches, popping, and chain reactions are crisp and defined. Sadly, there aren't any voice samples.The PlayStation 2 version drew sharp criticism for bringing nothing new to the series, but Super Bust-A-Move comes into its own on the GBA. Although it's an amalgam of older efforts and could have used a few more gameplay modes, this is the first handheld version of Bust-A-Move that's both playable and visually appealing."}