{"ref": "https://www.gamespot.com/reviews/spider-man-2-review/1900-6103246/", "date": "July 22, 2004", "game_name": "Spider-Man 2", "text": "Activision has dedicated itself to bringing games based loosely on the movie Spider-Man 2 to as many platforms as possible. This includes the N-Gage, which has received a 2D platformer that is broken up by some 3D swinging segments. While portions of the game show promise, Spider-Man 2's jerky gameplay and occasional crash bugs overshadow these promising points. Spider-Man 2's 3D segments are pretty broken. The N-Gage Spider-Man 2's most apparent failure is its poor use of 3D. After every few stages, you'll be forced to endure a short time trial, the goal of which is to triumph over poor webslinging mechanics--and even worse crash detection--to arrive at your destination before the clock runs out. The N-Gage's clunky, low-poly 3D segments are never enjoyable, and they feel like last-minute additions to the game's comparably decent 2D segments. Spider-Man 2 is loosely linked to the eponymous movie via a series of dialogue-laden, rendered stills of the film's characters. These tend to drag on too long, and they can't be skipped. Spider-Man's action sequences comprise beat-'em-up fare that's typical of Spider-Man offerings. Spidey must navigate the game's stages by webslinging and webzipping, and there is a single attack key that can be used in conjunction with webbing projectiles and shields. Spider-Man's webslinging and webzipping are controlled by the 5 and 3 keys, respectively. These buttons do a good job of remaining context-sensitive, so this control setup isn't quite as limited as it sounds. The game's sound nicely complements the onscreen action, replete with all the ~thwaps~ you might expect from a video game starring a comic book hero. The MIDI music that backs up the action is fast-paced and reasonably varied. Most of Spidey's gameplay involves rescuing hostages or disarming explosives. This basic action is punctuated by the occasional boss fight. Since Spider-Man 2 the movie involved only one villain, Doctor Octopus, some of Spider-Man's lesser foes have been brought in for cameo appearances. As a result, expect to face second-tier criminals like Lizard and The Shocker as they terrorize subterranean Manhattan. Unfortunately, rescuing nuns and defeating anthropomorphic villains from the annals of Spider-Man comics by rapidly pressing the 7 key becomes tiresome quickly. The fact that these skirmishes are more about button mashing than skill development doesn't help. Aside from mashing on the 7 key and swinging around the city, you can also take photographs in each level. Getting shots of villains and their hideouts will unlock extra items in the secrets menu. You can take photos for the Daily Bugle to unlock extra game features. The N-Gage version of Spider-Man 2 is further marred by a smattering of bugs, which usually crop up around level loads. One particular swinging level displays an error message every time it loads. Occasionally this error causes the game to crash. Between the uninspired gameplay and the occasionally crippling bugs, Spider-Man 2 for the N-Gage is a very difficult title to recommend. While the N-Gage doesn't have very many side-scrolling 2D games, this one doesn't fill the gap very well at all."}