{"ref": "https://www.gamespot.com/reviews/spider-man-2-review/1900-6113671/", "date": "November 19, 2004", "game_name": "Spider-Man 2", "text": "Spider-Man 2 is one of the more obviously appealing launch titles for the new Nintendo DS, since it's based on one of the year's best, most popular action movies. The game does a fine job of showcasing the new portable's relative power compared with Nintendo's own Game Boy Advance, in that it features an instantly recognizable, very fluidly animated Spider-Man, who's actually a lot of fun to control as he webswings his way around New York, beating up thugs and robots. Yet while Spider-Man 2 sure looks great, it suffers from extremely frustrating level design (and it doesn't really take advantage of the dual-screen layout of Nintendo's new portable, either). Some of these levels can be so annoyingly difficult that they'll make you want to wreck your brand-new Nintendo DS. And you wouldn't want to do that. If you thought Peter Parker not being able to tell MJ about his true feelings for her was frustrating, wait'll you see this. You'll play as Spidey in a linear series of chapters that very loosely follow the events of the movie, but also involve battles against supervillains Mysterio and the Vulture, in addition to good old Doc Ock. This is mostly a standard side-scrolling action game, though it features great fully 3D graphics that maintain a beautifully smooth frame rate, despite the good amount of detail in the game's characters and environments. Levels twist and turn in an almost mazelike fashion, but you're always effectively moving left, right, up, or down--there's no true 3D movement. This is fine, since it keeps the gameplay simple and focused, but with some very pleasant eye candy to draw you in. For comparison's sake, the Game Boy Advance could never pull off 3D visuals like this, so it's impressive to see them on a small screen. Meanwhile, Spider-Man 2's audio is solid but less remarkable. The game's bosses spout a few digitized speech clips, and the random thugs you'll fight cut loose with some great canned scream effects when you send them flying off tall buildings. The music is fast-paced and well suited to the theme of the game, but it's unfortunately cut into short loops, so it becomes highly repetitive and quite irritating after a while. You'll be inclined to turn the volume off, but that's not a good idea--many of the levels require you to locate bad guys or hostages, whom you can hear offscreen if you listen carefully. As you'd expect, Spider-Man is highly mobile. He can run quickly, jump high, and effectively fly by webswinging from point to point (you just keep tapping the jump button to keep swinging). He can also shoot webbing onto walls in any direction, pulling himself quickly toward that location. Of course, Spidey can fight, too, primarily using a small assortment of punches and kicks. Most of his enemies actually have a longer reach than he does, forcing you to get in very close and then pound on the opponent using the same combos over and over. The fighting looks pretty good, but just isn't very satisfying, especially when your enemies pin you down with a string of cheap shots. One neat trick is that you can trigger Spidey's spider senses while in close combat, causing the action to move in slow motion, though this can be detrimental in the timed missions--the mission timer doesn't slow down when everything else does. Spider-Man also has access to several special moves (most of which must be unlocked), allowing him to throw his enemies using his webbing, shoot web projectiles at him, execute a sliding attack, and more. Again, the character really looks great in motion, and the controls are generally very responsive. The best part of the game, much like in its console counterparts, is how well it captures the feel of Spider-Man's amazing agility. This is obviously very important for a game based on the character, and it makes Spider-Man 2's poor level design even more disappointing. Many of the missions require you to take out a certain number of enemies, or locate a certain number of objects, and then make it to the exit--occasionally in a limited amount of time. The game's hazardous environments (fires and exposed electrical circuits are a common sight) and fairly powerful bad guys make these types of tasks inherently challenging. What can make them infuriating, though, is that you don't have any way of knowing where you have and haven't explored, short of memorizing the game's sprawling levels. There's no map to guide you around a mission, no sort of waypoint marker to direct you to your next objective, and no way to see past the edges of the screen without moving in the direction you're searching in. So you just have to explore, and in many cases painstakingly hunt down that very last bad guy or hostage under time pressure. Imagine spending nearly 15 minutes hunting down two or three dozen bad guys, only to run out of time or get knocked into a bottomless pit with just one or two bad guys remaining, and being forced to start the process all over, and you'll have a clear picture of what Spider-Man 2's gameplay boils down to more often than not. This is not fun. The game's smattering of boss battles are a good change of pace, at least. These supervillains will attack in various patterns, so you'll need to avoid their strikes and retaliate with your relatively wimpy punches and kicks. Sometimes they'll start throwing stuff at you, which moves the action onto the DS's bottom screen, where you'll need to tap on the incoming projectiles to destroy them. This mechanic is somewhat novel, but it isn't very challenging, and it's actually sort of annoying to have to switch from moving and attacking with the D pad and buttons to using the stylus. Spider-Man 2 demonstrates that the DS can do some great-looking 3D, but it's much better as a technological showcase than as a game. For most of the game, though, the DS's bottom screen is squandered. You use it to check your mission objectives and choose from Spider-Man's special abilities, but you'll probably just stick to one or two favorites, so this functionality could have been easily serviced by a pause menu. Some textual dialogue also occasionally pops up on the bottom screen, but since the bottom screen usually serves no purpose, it only makes the absence of any sort of in-game map all the more glaring. Spider-Man 2 technically isn't a long game, since it consists of about 15 levels that can be finished in five to 10 minutes on average--but it can be so difficult that you might never reach the finish line. There's always room for greatly challenging gaming experiences, but the challenge here mostly just comes from having to work around lousy level designs. For what it's worth, though, the game has some unlockable extras and bonus objectives, and it challenges you to complete the missions in as little time as possible (indeed, the first time you actually manage to pass one of these levels, chances are you'll have earned an F or maybe a D for your efforts--gee, thanks). So, in theory, you could memorize all these levels and where their dozens of enemies and other points of interest are located, and then keep playing them over and over for more-efficient results. But, in practice, you'll probably become frustrated by the fact that this game's mazelike levels and stringent victory conditions undermine what could have been a much more entertaining experience."}