{"ref": "https://www.gamespot.com/reviews/karaoke-revolution-presents-american-idol-review/1900-6163822/", "date": "January 5, 2007", "game_name": "Karaoke Revolution Presents: American Idol", "text": "Konami's Karaoke Revolution series and the talent-search phenom American Idol seem like such a natural match it's surprising that the publisher has taken this long to pair its prolific singing franchise with the smash-hit TV show. Karaoke Revolution Presents: American Idol arrives just in time for the start of the program's 2007 season, and while it hits most of the high notes you'd expect from a game with the American Idol license--authentic venues, video clips of famous performances, (mostly) celebrity judges--the trappings of the television show make the game feel a little lackluster overall. Luckily, that fact doesn't really impact the underlying karaoke gameplay, which is just as entertaining and accessible as it's been throughout the last several versions of the franchise. The celebrity judging can be lame at times, but that shouldn't affect your enjoyment of the karaoke much. The American Idol mode here is essentially a career mode, in which you start out singing in front of the series' infamous judges to earn your ~golden ticket~ to the next elimination round in Hollywood. As you successfully clear each song, you'll move on through the Hollywood round to the semifinals and then, finally, the big stage of the top 12. All the sets and venues are realistically re-created here, which lends a feeling of authenticity if you've watched much of the TV show. However, even casual fans will quickly notice that while rambunctious Randy Jackson and acerbic Simon Cowell are here in both likeness and voice, Paula Abdul is nowhere to be found. In her place is a generic judge named Laura, who looks somewhat like Abdul but is considerably less zany. In fact, her dialogue is pretty flat and bland. Given some of Abdul's bizarre hijinks on the last season of the show, though, her absence may not bother you much. At any rate, the judges will critique your performance as you'd expect, commenting on your pitch or timing in their respective styles. Unfortunately, the dialogue is pretty stilted and sounds as though it was recorded in a studio (which it was, of course). Jackson will mention the dog pound now and again, and Cowell's trademark insults are pretty similar to the kind of bile he spews on the air, but their delivery isn't very enthusiastic. They'll also seem to contradict themselves once in a while, such as starting out with a pointed criticism of your pitch but going on to describe your performance as brilliant overall. You might also hear the exact same line only a few songs apart while playing through the American Idol mode. More often than not, the judges offer what seems like accurate and thoughtful criticism, but even then, it's not terribly exciting. It does get the job done, though, and you can skip it if you want. The game's judging aspect has nothing to do with the actual gameplay, however. Heck, previous games didn't even have this feature, and so this version plays just as well as its predecessors. That's largely because it plays just like its predecessors, with song lyrics and visual cues indicating pitch scrolling along the bottom of the screen. The Idol-influenced track lineup is quite solid and reasonably diverse; you'll find at least a handful of songs on the 40-strong list that you've sung or at least heard at a bar or box, as many of them are karaoke staples. Many of the songs are either taken from some of the show's biggest performances and auditions (~Proud Mary,~ ~Alone,~ ~Don't Let the Sun Go Down on Me~) or taken from the Idol winners' own repertoires (~Do I Make You Proud,~ ~Breakaway~)--though the latter may be a turnoff to some. There are plenty of other good songs here, though: ~Easy,~ ~Stand By Me,~ ~Hungry Like the Wolf,~ and ~Let's Stay Together~ are just a few examples. Even William Hung's inauspicious debut performance of ~She Bangs~ is represented by that song's inclusion on the list. You'll have access to most of the songs off the bat, but you can unlock a few more as you successfully achieve high scores on various songs. Of course, these are all covers, just like the songs in the past games have been, but the quality of the covers is generally high enough that even when you notice they're not the originals, you won't really care. All told, the songs here should make for a good karaoke experience with a group of people, and the song list feels more diverse and satisfying than Karaoke Revolution's only recent competition, SingStar Rocks! The venues from the TV show are nicely re-created in the game. Aside from the core American Idol mode, the game has all the requisite game types you'd expect, from a basic scoreless karaoke mode to full eight-player support with variations like duets, medleys, and elimination-style knockouts. A functional character creation utility is also available, including EyeToy Cameo support for creating a character based on your own image. There's a decent amount of American Idol-themed content to unlock, composed mainly of video clips from the show. Some clips show notable past contestants in some of their most memorable performances, while others highlight particularly embarrassing moments from the audition rounds. There are also new characters and costumes. The game methodically tracks how well you've done on each song and shows how much content you've correspondingly unlocked, and how much you have left to go. The team at Blitz Games has done a good job of re-creating the audition room, Hollywood theater, and semifinal and top-12 stages, and the whole package is unmistakably American Idol-themed. The included judging will be pretty take-it-or-leave-it unless you're a diehard fan of the TV show, but since the core karaoke game is solid, that's not a huge knock against the game. It's worth noting that if you bought last year's SingStar Rocks!, the microphones included in that package won't work with American Idol--you'll need to spring for Konami's bundle package, or provide your own USB microphone or headset to play the game with. Overall, if you've burned through all of the previous Karaoke Revolution games or you're just looking to try the series for the first time, the American Idol edition should do the trick just fine."}