{"ref": "https://www.gamespot.com/reviews/steel-battalion-line-of-contact-review/1900-6090381/", "date": "March 2, 2004", "game_name": "Steel Battalion: Line of Contact", "text": "Steel Battalion: Line of Contact is Capcom's online-only upgrade to the previously released mech combat game Steel Battalion. The original game was made famous by its enormous controller, which featured more than 40 buttons, and its enormous $200 price tag. Steel Battalion: Line of Contact puts players in direct competition against one another in typical online gaming scenarios, such as capture the flag and deathmatch, but it also includes a more in-depth campaign mode in which players have to work together to progress through the game. Ultimately, Steel Battalion: Line of Contact is geared exclusively for fans of the original who want to take the experience online, and they'll likely have some fun playing the game with other players like them. Line of Contact is only playable over Xbox Live or system link. The game contains four online modes of play, including campaign, battle royale, capture the container, and conquest. The game's campaign mode is the main mode of play, and it allows you and up to nine other players to meet up online for a little mission-based competition that pits you against other players in a battle for control of as many enemy strongholds as possible. Along the way you can take out enemy VTs (vertical tanks--the game's own personal term for ~mech~), aircraft, and other mission-specific objectives. Each item destroyed takes away from your enemy's total battle points, and when these points run out, the team with points remaining is declared the victor. Steel Battalion: Line of Contact's battle royale mode lets you and nine other online players simply scrap it out to see who the best VT pilot is. Conquest mode is similar in setup to the game's campaign mode, except that it allows the player who creates the game to select a single mission for play. Finally, the capture the container mode is similar in gameplay to the typical capture the flag mode, except here the players are tasked with going forth to retrieve a container from the enemy base while trying to protect their own containers inside their own bases. All of the missions in Steel Battalion: Line of Contact are online-only, and they require that you use the Steel Battalion controller, which is sold separately along with the original game. You can also plug in a separate Xbox controller to help you navigate the game's menu screens, and you can plug in the Xbox Live communicator so that you can communicate with other online players. Although the game's specialized controller may look pretty intimidating at first--with its 40-plus buttons, three pedals, two control sticks, and gearshift--the fact is that during battle you only ever really have to worry about moving and shooting. Sure, you'll want to dump out the occasional chaff or activate your fire extinguisher when your VT catches on fire, but for the most part, you're only occasionally tasked with taking one of your hands off of the control sticks to activate an onboard system or to change a weapon magazine. Once you get the basics of controlling your VT committed to memory, it's a fairly easy task to get your VT started so that you can go out to look for enemy units to destroy. You use your VT's built-in navigation system to see where enemy VTs and/or mission objectives are relative to your starting position. Targeting enemy VTs involves the fairly easy task of locating them with your radar and then firing on them when they are within range. Some weapons operate like artillery and allow you to deliver fire from great distances while also allowing you to fire over obstacles, like hills and walls. Most of your weaponry, however, is line-of-sight based, which means that you have to be able to see your target to fire your missiles, machine guns, and other direct weapons. While the basic gameplay boils down to pointing and shooting, there are some details that stick out and add a little more strategy to the mix. Fast-moving enemies coming at you from an angle will often move faster than your lock-on reticle can handle, so you'll have to manually lead your target to score hits. One cool feature is the ability to defeat enemy lock-on by shutting down your mech's systems. Also, the VTs in Line of Contact have the ability to boost along the ground with a jetpack-like system. This speeds up the game quite a bit over the original. Additionally, a well-placed shot to the legs can knock an enemy VT over, especially if it's boosting along at high speeds. Visually, Steel Battalion: Line of Contact is an impressive-looking Xbox game that uses just about every visual effect the Xbox can muster to deliver the most convincing visual experience possible. The view you have is always from the cockpit of your VT, and as such, you see the action from a main-view screen, which even features a visual effect that makes it look as though you are checking out all of the action from a monitor instead of firsthand. Additional information--such as map data, ammunition count, and even additional external views--is displayed on other monitors that are arranged around your main-view screen. The models used for the VTs are extremely detailed and move as you might expect a giant robot to move, although with the addition of propulsion jets they move a lot quicker than you might think. The environments are also very detailed and feature a vast viewing distance that can be zoomed in on to give you a closer look at an enemy unit or at the terrain ahead. All of the graphics for the game's menu system and pilot selection are fairly rudimentary looking, but altogether they're functional. In the audio department, Steel Battalion: Line of Contact supports in-game Dolby Digital 5.1surround sound, which makes a huge difference when trying to pinpoint the sounds that are made by enemies who are firing upon you. Even if you don't have a Dolby Digital decoder, the audio in Steel Battalion: Line of Contact is extremely rich with range. It features rumbling low bass for explosions, and you'll hear screeching highs for those instances when you scrape the side of your mech on a nearby object. Steel Battalion: Line of Contact can really only be recommended to those who already have the original game. As a network-only game, its Internet performance is a make-or-break feature. The performance online is pretty solid here, though like all Xbox Live games, it comes down to the connection speed of the player who's hosting the game (so the game can and does get a bit laggy on weaker connections). For what it's worth, you can also play the game over a LAN via system link. Additionally, the price of entry is quite high since you have to have the original game's bulky, expensive controller, along with a broadband Internet connection and an Xbox Live account. Given all these hurdles, it's no surprise that you won't find as many online games available as you would with, say, MechAssault. We had no problems finding at least one game to join, and the process of joining a game and moving through the lobby is a pretty easy one. However, you may have to wait awhile before enough players join to fill up a game completely. Steel Battalion: Line of Contact can really only be recommended to those who already have the original game. If you've already made the investment in the original game and its controller, then you might as well get some more use out of it by picking up the online game. However, if you skipped over the first game, then there really isn't enough additional content in Line of Contact to make the package much more worthwhile."}