{"ref": "https://www.gamespot.com/reviews/warioware-get-it-together-review-a-platform-for-change/1900-6417725/", "date": "September 14, 2021", "game_name": "WarioWare: Get It Together!", "text": "Wario has transitioned from a platformer antagonist in Super Mario Land 2 to platforming antihero in the Wario Land series to indie game developer in the WarioWare series. In WarioWare: Get It Together, the character comes full circle with a microgame collection that loosely goes back to his platforming roots and brings his own original characters along for the ride. It's a much different WarioWare experience, and the new twist is mostly for the better.If you've played any prior WarioWare games, you have a basic idea of what to expect in Get it Together. Wario and his cadre of weirdos have created a series of ~microgames~ that only last a handful of seconds. You'll find yourself plopped onto a game screen with an instruction consisting of no more than a few words, meaning you have to figure out the goal and execute the right action with quick-thinking and sharp reaction times. These microgames are then thrown into a blender, demanding quick responses one after another in a gauntlet of zany action. It's a formula that has been fun since Mega Microgames on the Game Boy Advance, and it still works exceptionally well--and maybe even better--with this new take on the concept.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: WarioWare: Get It Together! Video ReviewThe twist in Get It Together is that all of the microgames involve some degree of character platforming. While previous WarioWare games might have simply had you press the A button at the right moment to manipulate an on-screen device, in Get It Together you'll always be controlling a character. Characters include Wario, complete with his Wario Land-style shoulder slam, along with all of the WarioWare-specific characters who have been introduced throughout the series' history. As a story device, they've all been sucked into their own video game which is being plagued by bugs.Each of the characters controls fairly differently, within a few broad archetypes. Some like Wario, Dribble and Spitz, and Orbulon are hovering characters who can move freely but have different functions like the aforementioned shoulder-charge, firing a cannon, or extending a tractor beam. Young Cricket is more of a traditional platforming character who can walk along the ground and jump. 9-Volt continuously skateboards back and forth and fires his yo-yo straight upwards to knock away enemies and obstacles, and to grab onto grapple points. Similarly, his older brother 18-Volt is stationary with an omnidirectional firing ability that can also cling onto grapple points. Some characters, like 5-Volt, have abilities that are themselves cute references to roles in past microgames.Wario's colorful cast is really brought to life here with new 3D models that maintain the look of the sprite-based artwork of their original incarnations while animating more fluidly. More significantly, this character approach has a major impact on gameplay, introducing an entirely new layer to the tried-and-true recipe for the WarioWare series. Now, on top of quickly interpreting a goal and reacting, your brain also needs to process which character you're using and how their unique abilities can accomplish that goal. One might need you to jump over an obstacle to reach an object, so quickly assessing that goal will be very different for a hover character than a grapple character. This is a neat and altogether welcome change that makes the microgames that much more complex and satisfying by forcing your brain to do two things at once.The frenetic pace of constantly dealing you new microgames means that if you flub one, you're off to the next and having fun before you can even take a breath.As always, sometimes the instructions are too vague so it will take a few attempts to understand what you were even supposed to do. The more severe problem, and an obvious drawback to this character-based system, is that some characters just aren't well-suited to the goals of a stage. Get It Together even openly recognizes this--if you go to take on an individual mission through the Play-o-Pedia, you'll see the individual characters rated for the tasks on a scale from ~Bad Fit~ (angry red face) to ~Good Fit~ (happy green face).The worst of these offenders is 9-Volt, whose combination of fast skateboarding and yo-yo grappling means he's rarely the ideal character to tackle a task. There are some in which he's acceptable, but 9-Volt cannot be good; he can only suck less. Having one particular character so poorly equipped for handling these challenges means he sticks out, and I always felt a little pang of frustration when I saw he was queued up for the next microgame.To an extent, this is just an inevitable outcome of this new approach. When the central hook revolves around randomly pairing differentiated characters and tasks, you're going to get a bad match once in a while. But knowing that on an intellectual level doesn't keep it from feeling unfair when you randomly get assigned a character who is poorly equipped for a microgame, only to spend your last life and fail out of your run. Still, the frenetic pace of constantly dealing you new microgames means that if you flub one, you're off to the next and having fun before you can even take a breath.The main story is low-impact and forgiving, too. Most of the areas require you to complete between 10-20 microgames without four failures, but even if you do fail, it lets you spend a pittance of in-game currency to just continue instead of starting over from scratch. The story campaign is how you're introduced to all of the characters and extra modes, so it's worth it to get through that content without the fuss so you can move on to the post-game, which is where WarioWare games find the most longevity.At their core, WarioWare games are score challenges. The wealth of microgames means you'll be encouraged to rack up a high score both in ever-harder and -faster versions of individual games back-to-back, and mixes of games. Running through story stages a few more times will help fill out the Play-o-Pedia with all of the microgames, and since you unlock new characters throughout the campaign, going back to old stages will also let you use new mixes of characters. You can choose to play as one particular character (thus assuring you always have the ideal match for a task and know exactly what to expect), hand-select a crew of three, or toss caution to the wind and go with a mix of every unlocked character.For obvious reasons, choosing ~All~ is the most challenging way to go, but a Mission system rewards you for being daring. That area has an array of goals to complete, from reaching certain score targets, to unlocking all of the game types in a certain area, to completing stages with all characters. Your reward for these are play coins, the same ones that let you continue after failing out in the story campaign.In the post-game, coins are mostly used to buy ~Prezzies,~ gifts you can give your characters to level them up. You can buy them directly from a shop that refreshes on a timer, or use a gacha-style capsule machine to get a random assortment of gifts. Different characters like different gifts, and leveling them up with Prezzies unlocks new job titles and cosmetics for them. During the review phase I dumped all of my Prezzies into Wario, attempting to see how high the leveling system goes. It appears to go up to level 30, with stacking prestige levels after that, so reaching that point with all of the characters will keep you occupied for quite some time.Completing the story campaign unlocks the Variety Pack. While a few are new minigames unique to the mode--and slightly larger than the microgames that comprise the main game--most of the 2-4 player modes are different iterations of microgame mixes. That means there isn't quite as much variety in the Variety Pack as it first appears. But the story is all available with two players as well, effectively doubling your characters. While the story missions feel generally balanced on their own in single-player, it's a little easier and more fun to manage the hectic action with a partner.The post-game also includes the Wario Cup, a weekly challenge that awards big payouts and, if you have a Switch Online subscription, ranks you against other players worldwide. The weekly Wario Cup during the review period was a remix of story campaign stages with an extra twist, like completing a predetermined lineup of stages as a super-fast 9-Volt. (Related: 9-Volt is the worst.)For the most part, the new character-based approach is a welcome addition to the WarioWare blueprint. The characters themselves are differentiated and expressive, and mechanically they make the traditional microgame challenges that much more engaging. The WarioWare series has been fertile ground for Nintendo to experiment with concepts like touchscreen capabilities in Touched or accelerometer-based motion in Twisted, which makes Get It Together's platforming riffs a little more traditional than usual. But that also makes it less reliant on a gimmick, and that's a change for the better."}