{"ref": "https://www.gamespot.com/reviews/flight-simulator-x-acceleration-review/1900-6183369/", "date": "November 26, 2007", "game_name": "Microsoft Flight Simulator X", "text": "While you can compile a laundry list of features that make Flight Simulator X a jaw-dropping piece of software, it's the wide variety of aircraft and goal-oriented missions that create such a compelling experience for even the casual flight-sim fan. Microsoft's new add-on, Flight Simulator X: Acceleration, adds more of what makes the sim great, offering three new aircraft, more than 30 new single-player missions, and 19 multiplayer missions/races. If you're a Flight Simulator X aficionado, this expansion pack is a must-have. This is not going to be a good landing. The three new aircraft are very different from one another and provide fascinating new capabilities, introduced via the new missions. The Boeing F/A-18A Hornet is a fighter/attack jet with a breathtaking amount of power. While there are, alas, no useable weapons on this simulated jet, it is fully capable of carrier operations, and most of the included missions involving the Hornet require both a takeoff and landing on a carrier. Taking off is a blast, literally: Gently taxi up to the catapult, lower and attach the launch bar, throttle up, and then fire the catapult and hang on as you're launched off the edge of the carrier. Easy enough, but as any naval flight sim fan can tell you, landing on the deck of a moving carrier is a nerve-racking experience in the best of conditions; throw in bad weather and/or darkness and you'll be wiping the sweat off the keyboard. Acceleration provides a superb re-creation of carrier landings, complete with ~calling the ball~ and an on-deck flight officer talking you in. For a palpable thrill, set the weather to dark and stormy and clench your teeth as you come in out of the dark clouds in a storm, trying to find your carrier, find the twinkle of the lights emerging as you close in, line up with the carrier, bang your plane onto the moving deck, and then start breathing again as the wires catch and stop your plane. In most sims, the focus of missions involving an F/A-18 would involve finding bad guys and shooting them down. Since Flight Simulator X doesn't support combat operations, the missions here are more varied and, in some cases, unusual. A couple of the missions are well-done tutorials on carrier takeoffs and landings. The others include everything from flying cover to protect a rocket launch from Cape Canaveral to investigating and tracking an unusual flying vehicle over Area 51. Be sure to experiment with the knobs in your cockpit; we were surprised to find the radar and other electronics (other than weapon systems) were fully functional. Once you've played through the missions, you are, of course, able to set up your own free flights with the Hornet, and if you explore the oceans you'll find other operational carriers. All in all, the power and capabilities of the F/A-18 make it a joy to fly and a superb addition to the simulation. The next aircraft introduced in Acceleration is as different from the F/A-18 as a Ford pickup truck is from a Ferrari: the AugustaWestland EH101 medium-lift helicopter. This is a tough workhorse of a chopper with sling-load and hoist systems, specializing in picking up people and ~things.~ After the sleek, sexy Hornet, the EH101 may come across as pretty mundane and boring, but it is the focus of some of the most interesting new missions in Acceleration. Missions such as tracking down smugglers in the Florida Keys, trying to rescue geologists stranded at Mt. St. Helens before it erupts, and transporting avalanche-prevention crews provide a very different type of tension and drama than those provided in a supersonic jet. Of course, in the tradition of Flight Simulator X missions, what can start out as a fairly routine assignment may suddenly take a dramatic turn due to unexpected events or as a result of your decisions (for example, do you follow the smugglers in the transport that may contain a large contraband shipment, or the small plane that may be carrying someone important in the criminal world?) There's a reason they call this zero-gravity test flight the Vomit Comet. The chopper itself, like most sim helicopters, can be a bear to control if you're a novice to virtual rotary aircraft, but it will also provide a challenge to sim-chopper veterans. Lining up the helicopter so that you are directly above the cargo or personnel that needs to be retrieved or lowered, ensuring that you're not too high or too low, and maintaining a stable hover during the operation requires a light and steady touch. Even when you have retrieved an item to be transported, the swinging motion of that cargo beneath the chopper can overwhelm your control of the aircraft (especially in bad weather). While helicopters have been present in the Flight Simulator series for some time, this hoisting/retrieval capability adds a new, challenging dimension to missions. The P-51D Mustang offered here is a race-customized version, with double the horsepower of the original and other modifications focused on tailoring the aircraft for the Reno-style air races. The result is an aircraft that flies like a bat out of hell. Take this Mustang out on the Reno racecourses, crank the boost up, and judiciously apply doses of the ADI system to prevent engine lockups, and you can demonstrate why the comparisons of Reno air racing to NASCAR are about 300mph too slow and one directional dimension too low. When you fly the tutorial missions or simply fly in freestyle around the race courses in order to familiarize yourself with the track, it may seem a bit boring--after all, you fly fast and turn left, fly fast and turn left, and so on. But when you try doing that at 500mph with a cloud of competitive aircraft above, below, and beside you, wingtip to wingtip, ~boring~ is not the adjective that comes to mind. The P-51D here is quick and agile, and it's a lot of fun just to buzz through the buildings and bridges of your favorite city. However, the Mustang is limited when it comes to missions in Acceleration, with only racing missions available. Not all of the new missions involve the new aircraft. For example, one fairly simple mission (with a twist) involves flying the Secretary of Defense on a tour of Edwards AFB in a Beechcraft King Air 350. Unfortunately, he is a demanding and vocal SOB, and he can either make or break your career depending upon how the tour goes. Another mission places you in the pilot's seat of the ~Vomit Comet,~ a Boeing 737-800 in which you will be taking a crew through a series of zero-gravity parabolas in order to provide them with weightlessness for about 20 seconds per maneuver. There's a variety of such interesting missions, some dramatic, some just fun. But the wildest new mission type is the Red Bull Racing series. Red Bull racing is, in a word, insane. In Acceleration you're provided with three Red Bull racing venues: Istanbul, Longleat in the UK, and Tempelhof AFB in Berlin. Flying an extremely nimble Extra 300S, you are required to fly through a series of very closely spaced pylons, extremely low to the ground, with some requiring a wings-level pass, some requiring a knife-edge pass, and some allowing either. At certain points during the race you'll also be required to perform specific aerobatic maneuvers. Fly too high through a gate: penalty. Go through the gate in the wrong position: penalty. Touch a pylon: big penalty. Flying at more than 200mph, a few measly feet above the ground while making tight turns and aerobatic moves in a competitive atmosphere, makes you admire the courage and skill of the pilots who compete in this real-world air-racing series and question their sanity and will to live. The single-player racing missions in Acceleration (both Reno and Red Bull) are intended as practice for the multiplayer mode. Multiplayer offers 19 racing ~missions,~ including the aforementioned Reno and Red Bull formats, cross-country races in both small prop planes and gliders, and an exhilarating race through a deep canyon in F/A-18s. The EH101 can do everything from hauling cargo to chasing dope smugglers in the Keys. In addition to the added missions and aircraft, Acceleration applies the latest SP2 upgrade to Flight Simulator X. Our tests showed a relatively small frame rate increase on a midrange system, and reports in the forums seem to indicate that SP2 isn't magic; it won't allow you to significantly raise the graphics level at which you can effectively run the sim, but you may gain a few frame rates here and there. One caveat: If you have a lot of third-party add-ons for Flight Simulator X, SP2 and some SDK changes may result in a few odd quirks, with some reporting the need to do a fresh install of Flight Simulator X, followed by an install of Acceleration, to smooth out the issues. As always in today's world of infinite configurations, your mileage may vary. In our case, the install over a current Flight Simulation X installation, with a few third-party add-ons, was trouble-free. There are a lot of third-party add-ons for Flight Sim X, and you can make an argument that, for example, the detailing is higher in one of these add-on F/A-18s. But the added capabilities that Acceleration brings to the sim, such as the hoist and retrieval capability with the new helicopter, the carrier operations, and the new multiplayer racing missions, make this a very attractive and recommended expansion for any Flight Simulator X fan."}