{"ref": "https://www.gamespot.com/reviews/ghost-in-the-shell-stand-alone-complex-review/1900-6113654/", "date": "November 19, 2004", "game_name": "Ghost in the Shell: Stand Alone Complex (2004)", "text": "Considering how popular the 1995 anime Ghost in the Shell is on both sides of the Pacific, it's kind of surprising that this is only the second game ever based on it. With its rabid cult of fans and its mixture of gunplay, hacking, missile-launching robots, and hot cyborg chicks bouncing around in spandex jumpsuits, it seems like a natural progression to make the transition from screen to game at least once every few months. Given the somewhat dismal track record of games based on licensed material, it's also surprising that Ghost in the Shell: Stand Alone Complex isn't half bad. Though, thanks to its brevity, a few too many frustrating jumping puzzles, and some bland environments, it is about 40 percent bad. Motoko in a typical leaping position. You play Motoko Kusunagi, an agent for Public Security Section 9, a high-tech, futuristic rescue team with a top-secret mandate to combat terrorism. Motoko is an acrobatic cyborg whose only remaining human parts are her brain and a small piece of spine. You also get to play another Section 9 cyborg called Batou. He isn't nearly as agile as Motoko but he can carry bigger guns. The story starts as an investigation into virus-tainted rice, and then somehow ends with an enormous Karl Marx spider robot screaming utopian, anticapitalist slogans at you while belching rockets. Unless you're paying really close attention to the almost constant stream of chatter coming over your headset, it's easy to lose track of what exactly is going on in the plot. Luckily, the plot doesn't make any damn difference. The game is a third-person platformer with a heavy emphasis on combat. The action has a lot in common with Bungie's pre-Halo commercial flop, Oni, which was itself inspired by Ghost in the Shell. You spend roughly half of the game's 12 missions controlling Motoko. She can fire weapons, engage in hand-to-hand combat, and perform acrobatic stunts, such as triple jumps off of walls. The melee combat isn't nearly as complicated as it was in Oni. It's a one-button affair that generally involves standing next to an enemy and then mashing on the attack button as fast as possible. Still, even though they're not really under your control in any meaningful way, the animations for the punches and kicks are varied and entertainingly brutal. Melee kills trigger a Matrix-like slow-motion sequence that's just short and unobtrusive enough not to get annoying over the course of the game. Along with the combat, most of Motoko's levels include plenty of environmental puzzles. Most involve figuring out how you can use her jumping skills to advance from one point to another. A few of the required jumps are frustratingly tough. Anyone who doesn't have patience for precision jumping should stay far, far away. Since Batou's jump barely moves him at all, his levels are composed almost entirely of combat. When they're not simply replaced by more shooting, the environmental puzzles take the form of corridor mazes that Batou must navigate in order to reach some objective. Combat is handled competently. Enemies use cover just enough to present a challenge, though there's nothing about the weapon selection or enemy behaviors that's especially surprising. It all works well enough, but the combat is strictly by the books. Hacking, a big part of the anime, is included in the game. For the most part, though, it involves walking up to a terminal, pressing the X button, and then listening to some dialogue about hacking. There is a way to ~ghost hack~ a few predesignated enemy soldiers. This lets you control them for a short time, during which you can use them to attack their comrades. In order to take control of an enemy, you need to successfully complete a timed minigame that requires you to match up spinning discs. By about the halfway point of the game, though, the discs start moving so blindingly fast that it's simply easier to ignore the ghost hack altogether and just shoot the enemy and all his friends yourself. The game's clean, simple art style is certainly reminiscent of the anime that inspired it. Unfortunately, it portrays none of the original's busy crowd scenes or kinetic camera work. The resulting static, empty spaces get boring pretty fast. Though there are some occasionally impressive cityscapes, most of the levels take place in warehouses, military complexes, or featureless expanses of corridor, all of which only adds to the blandness. The character animation, on the other hand, is excellent. Caught in your spray of bullets, enemies do a vibrating death dance that's especially satisfying. The cast of the recent TV series handles the voice acting, and so it's completely professional, even when the dialogue itself is a soporific jumble of inane techno-babble. The soundtrack is largely forgettable. One piece that plays during several levels consists of a whooshing noise and six or seven atonal beeps repeated in an infinite loop. That one, unfortunately, is harder to forget. Batou versus some robots. Depending on how stuck you get in a few of Monoko's jumping puzzles, the game should only take about six hours to finish. You can unlock a couple of secret weapons by uncovering 10 fans on each level, but it's hard to imagine anyone being inspired enough to do this. There's also a split-screen deathmatch mode for up to four players, but this isn't deep or engaging enough to add any real value to the game. Stand Alone Complex isn't a disaster by any means, but it's not exactly a rousing success either. It's a professionally executed but thoroughly conventional action game that's more tepid than it is thrilling."}