{"ref": "https://www.gamespot.com/reviews/pentiment-review-layers-of-history/1900-6417998/", "date": "November 14, 2022", "game_name": "Pentiment", "text": "I loved reading history books growing up, especially those written more like a storied account of what happened as opposed to straight facts on the page. There's an implied truth to history when it's told moreso as a story, as it admits that there's no objective truth to the past. History is simply what we make of it. Pentiment is written around this idea, providing a means of exploring a point in history from an outsider's perspective--the protagonist is not native to the region and we, the player, aren't native to the time period. Rather than simply retell history, Pentiment affords the chance to influence it, and in doing so, delves into the subjectivity of historical record. Pentiment also features some fun nods to history with its fabulous art style and stylish fonts, but the narrative throughline of its three acts--a conspiracy of murder mysteries--feels lacking, given the frustrating restrictions to each investigation and the unceremoniously abrupt ending.In Pentiment, you play as artist Andreas Maler, who is attempting to finish up his masterpiece while working for the Kiersau Abbey, which overlooks the Bavarian town of Tassing. A visiting baron draws the ire of both the farmers and craftspeople in town, as well as the Christian nuns and brothers of the abbey, but no one is prepared when he winds up dead. With Andreas' mentor--a man too old and feeble to have possibly overpowered the baron--pinned for the crime, the young illustrator vows to conduct his own private investigation in hopes of bringing the true culprit to justice. In doing so, Andreas is drawn into a strange conspiracy of cryptic notes and unspoken secrets, and his actions shape both Tassing and Kiersau Abbey in a story that spans a quarter of a century.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Pentiment ReviewYour actions have consequences in Pentiment. Most conversations can branch in a number of ways depending on the choices you pick, and Andreas' relationship with those around him is further shaped by the resulting consequences. Oftentimes, these consequences are felt immediately--a worried wife catching you in a lie might not offer information on her husband, for example--but there are quite a few with much longer-reaching effects. During the second act of Pentiment, the game kept telling me that choice after choice I was making would ~be remembered,~ but it wasn't until the final minutes of the act that the results of my actions were revealed. And in a twist of fate, my decision to repeatedly be nice to someone in the hours up to that point meant that they wouldn't abandon me during a dangerous situation.Pentiment often delights in these shocking outcomes in the latter half of its story, making for a far more exciting Act II and III in comparison to the rather meandering start. It certainly doesn't help that the moment-to-moment gameplay isn't all that exciting. Exploration is tediously slow, as fulfilling quests for folks can see you having to run from one side of Tassing to the other. Though Pentiment is depicted in a beautiful artistic style meant to emulate illuminated manuscripts and printed books of 16th-century Europe, the design of the world only changes between acts, and even then it's not by a substantial degree. Until the story starts getting interesting, there's not much to the experience beyond walking around and meeting people.Talking with characters to learn more about Tassing and the case you're trying to solve is a lot of fun, but the game frustratingly limits how much of that you can do. Each day is divided into sections, with slots of time reserved for working, praying, and eating. Longer conversations will take up all of your available time for any one slot, meaning you're unable to meet and talk to every single person over the course of your investigation.All Pentiment entails, however, is meeting with and getting to know the interesting characters or pursuing leads for the case at hand. That's the extent to which you interact with Pentiment's world. Putting a limit on how much of that you can do isn't inherently bad on its own--lots of visual novels and RPGs utilize something similar so players are encouraged to best use their time and get to know the characters they like more. But within the scope of a mystery, too much of a limitation gets in the way of the fun. You just can't dig enough into the people of Tassing within the confines allowed, leaving a lot of stones unturned when it's time to present your evidence.In theory, this system seems designed to push you to commit to one suspect, maybe two, and put any and all time you have into figuring out their motive. But many lines of investigation in Pentiment lead to clear realizations that the person you thought might be the killer is, in all likelihood, innocent, and all the time you spent considering them a suspect was for nothing. So if you commit to probing the wrong person, you're left with no time to scrutinize someone else upon realizing your mistake. But if you spread your investigation too thin, you might not have enough time to finish looking into anyone in depth. A system like this helps differentiate one playthrough from another, giving repeat playthroughs some variety, but it can make your first time through the game feel like you're being needlessly taxed for wanting to conduct a detailed examination of every available suspect. I'm also not a fan of the fact that grabbing dinner with someone can eat into your limited time as well, punishing you for wanting to learn more about the town and the characters unrelated to the case at hand.There's some fun to be had in how you approach situations at least. Early on, you construct Andreas' backstory--deciding what he studied in school, for instance. I opted for a man who had spent a bunch of time in Italy, had a knack for public speaking, the law, and the forbidden occult, and wanted to jump into the skirt of every woman in Tassing. And it was fun to have extra dialogue options that allowed me to flirt or talk about getting drunk in every other conversation or tell spooky ghost stories to the kids in town. And I used my knowledge of the law to aid the peasants in their troubles whenever I could. Pentiment goes a long way in rewarding the ways you shape Andreas, especially in how it allows you to get a better idea as to how people are feeling about what's going on in the world. I just wish the game had allowed me the space to interact this way with everyone instead of cutting me off from all but the few I had time to deeply engage with.As it takes place in the early 16th century, Pentiment sees you exploring a Bavaria that is undergoing a great religious and social transformation--Martin Luther is becoming a well-known name in Christian circles across Germany at this time, and more and more peasants are being taught to read. For a town like Tassing, built upon the ruins of Roman cities and with a history of druidic paganism, this has resulted in a great variety of people with different beliefs and morals, all striving to live together in relative peace.Pentiment makes this history quite approachable, even if you know very little about what was going on in Germany and the rest of Europe in the 1500s. At the push of a button, the game will pull back and detail any significant person, place, religion, or event mentioned in the conversation at hand, scribbled out like a student's notes in the margins of a reference book. It's never enough to bore, but just enough to give you an idea as to why something or someone is relevant. Thankfully, the system extends to the characters who live in Tassing and Kiersau Abbey as well--even featuring pictures of what they look like--so you can always know who folks are talking about.And you'll want to know who's who. The characters and their stories are the best part of Pentiment, whether it's watching them grow older and mature over the course of 25 years or witnessing how the ever-changing perception of religion and economic class influences the dynamics of a town. There's a lot of intriguing history to learn and witness within Pentiment's story, especially as the game delves into the events that--though memorable in hindsight--don't seem like anything more than a tragic series of misfortune at the moment.This, of course, lines up because there's an inherent tragedy to history, which is basically just a collection of stories, legends, and folklore about the past that those in the present do all they can to preserve as some semblance of truth, so as to inform the future and encourage new generations to be better. History is tragic because so much of it is pure malarkey--much of history is he said versus she said ad nauseam, an assortment of memorable hearsay that masks otherwise far more boring truths. It remembers the murderer but oftentimes glosses over the effects of the crime; it immortalizes the ideals of a revolution but too quickly forgets the initial cause and the cost. In the ever-ticking clock of history, the truth of what happened so quickly gives way to what people want to believe.This is the core narrative theme of Pentiment, playing out over the course of several decades as Andreas' choices influence the lives of those who inhabit the small town of Tassing and the nearby abbey. Regardless of how your investigation in Act I plays out, Andreas will return to Tassing years later in Act II to find much has changed. Even the most flimsy of reasonings years prior can pass into gospel over the course of years, and the accusations levied against the condemned will become truth accepted by all. Most fully believe that the person accused of killing the baron actually did it, and the ripples of that assumed truth have affected the lives of those who are left--some for better, and others for worse. And in the same way, your choices in Act II build into a perceived truth in Act III.The idea that history is but a series of causes and effects is not a particularly novel observation, culminating in a twist that--though earned--isn't all that interesting. It's left Pentiment as an intriguing conundrum for me. If you asked me whether I liked the story Pentiment told, my answer would be no, as you don't get to see the effects of the concluding revelation play out. And in a game where my choices matter in the moment-to-moment, I want to know how my handling of the final moment affects the lives of the few characters I got to know, if at all. And yet, despite my frustrations with how narratively unsatisfying the ending of Pentiment is, the game so clearly captures the essence of what history ultimately is within that final moment--a collection of tales and retellings so twisted together that there's really no definitive resolution for anyone. And I respect developer Obsidian Entertainment's commitment to remaining true to that.More than anything, I love the developer's commitment to stylized fonts throughout the game. Pentiment utilizes an assortment of fonts, with messy and curved letters used for the peasants' simpler way of speaking while something more highly stylized is used for those with an education. The brilliance in this style of characterization is best seen when a person's font changes. After Andreas learns that a simple farmer knows how to read, the farmer's letters are erased and rewritten in the more structured font of an educated, literate person, for example. It's such a fun and clever way of showcasing how men like Andreas judged people primarily on their station and appearance, but that perception could be changed on a dime upon learning whether or not someone is educated--one of the only times in any game I've played where I think literally spelling something out actually carries some intriguing narrative weight.There's not as much narrative complexity to the visual style of Pentiment, but it's striking all the same. The illustrated character models convey a great deal of detail and further carry the idea of history resembling a painting that an artist adds to over and over, with the underlying pentiment--the original image in a painting that reemerges when the top layer fades or is scrubbed away--occasionally shining through. The characters in Pentiment are just pictures being painted over again and again, and you could argue that they aren't even the original image, seeing as Tassing is built upon the ruins of the Romans. It's an interesting concept that Pentiment unfortunately only touches upon in snippets throughout its runtime, saving the intriguing questions posed in comparing history to a pentiment for the final moments of the third act. I wish it had pulled those elements to the forefront much sooner.As is, Pentiment strives to exist somewhere between a history book and historical fiction, not quite committing to a detailed look at history or fulfilling a narrative arc. This is a detriment to the game's conclusion, dampening my memories of the game save for the stories of individual characters. I retain a soft spot for the wise Illuminata and her conversations with Andreas about literature and religion, and I have a parental fondness for a young peasant girl who I watched grow from a gurgling toddler to a young woman. Witnessing their lives play out is a narrative delight, only enhanced by the creative use of Pentiment's different fonts to better convey a person's societal station or education. But limiting how much time the player actually has to engage in the game's best parts hurts the overall experience too much."}