{"ref": "https://www.gamespot.com/reviews/invisible-inc-console-edition-review/1900-6416421/", "date": "May 3, 2016", "game_name": "Invisible, Inc.", "text": "How amazing that a turn-based game can feel so urgent. In invisible, Inc., I have as much time as I need to position my agents just so, but Im always paying attention to the security level at the top right of my screen. That meter tells you when security will be heightened during your heist, and its a vital part of what makes this stealth game worth the gray hairs it causes.Its tense and challenging, yes, but Invisible Inc. is also simple, elegant, and always logical. It introduces new concepts in a slow drip, giving you plenty of time to work out the details. The titular spy agency is violently infiltrated, initiating a time-sensitive series of global heists and sneakabouts, each of which you control from an isometric perspective in the style of strategy games like XCOM. You begin with a duo but steadily add imprisoned agents to your roster as you spring them from holding cells. Ultimately, you take up to four agents on missions, which typically involve obtaining sensitive data from a terminal, grabbing ill-gotten credits, and hightailing it out of there.Of course, its rarely that simple. There is the draw of credits, for one, which you spend on leveling up your agents skills as well as on gadgets like weapons (both ranged and melee), augments (implants that offer passive bonuses), and other useful objects. Ranged weapons dont come with unlimited ammo--they must be recharged with a one-use charger when they go empty--and agents you rescue dont have weaponry on them. Other mechanics further complicate your economic considerations; needless to say, credits are highly valuable, and while you could engage in a straightforward infiltration, safes and terminals lure you from one room to the next. They have gravity, and escaping it requires superhuman resolve.But that pesky security meter is always climbing. When it arrives at the next level, security cameras that you hacked into might reset, or additional guards may be deployed. With every agent action, you must weigh a number of possible consequences, each of which is informed by multiple factors. You order Agent Prism next to a door and peek through it to reveal a patrolling guard. If she were closer, you could predict the guards route for the next turn, but thats just not working out. Do you open the door and risk alerting the guard so you can set up an ambush? And what about that security camera in there? Do you activate Agent Deckers stealth rig and send him in knowing that the rig has a six-turn cooldown, or do you use your portable AI program Incognita to hack the security camera but use up all of your power resource in the process? You need power to fire your weapons and hack terminals, so this isnt a decision to take lightly.Easier difficulty levels give you a limited number of chances to rewind a turn if you dont care for the outcome, and the easiest difficulty also lets you restart a mission if it goes awry, albeit with a new procedurally-generated layout. Losing progress with a rewind or a restart feels like its own kind of failure, and this negative reinforcement ensures that even easy mode can be stressful, even when you know you can call backsies.Should you lose any agents, theyre gone from the current campaign for good, unless you revive them with medigel. This requires not only having the healing kit on hand, but maneuvering another agent into a potentially disastrous situation. Brilliantly, however, your downed agent may be taken alive by the mysterious enemy organization, which leads to a jailbreak mission. The captured agent may represent an acceptable loss: you have a limited number of in-game hours before the final mission is initiated. Feel free to let Agent Decker languish in his cell; youve got to think about the greater good (if money and revenge can be considered the greater good, anyway.)You might be more inclined to rescue a captured agent--or to mourn her if she bleeds out during the heist--if youve developed a connection with her. Unit perma-death is another mechanic that invites comparisons between Invisible, Inc. and XCOM, but I was never attached to any given agent. Theres a little flavor dialogue between agents here and there, but its too brief and sporadic to engender any emotional response.The cool-future visuals and angular character designs are decisively slick, but the vaults and offices you infiltrate look more or less the same as you progress. You know youre in Australia or Brazil, but theres no audiovisual hook to remind you of the international stakes. Strolling guards always mutter the same handful of bland responses when alerted, and the tilesets dont evoke the locale. In Invisible, Inc., I regretted losing agents not because I mourned the loss of a comrade Id trained and groomed, but because Id lost a flesh-and-bones tool from my toolbox.Nonetheless, this emotional distance is merely a minor issue. I dont care much about Invisible Inc.'s throwaway story and its last-minute grasps at meaningful themes, or about my agents personal backgrounds. Like the game, my efforts are focused on getting the job done, emotionally disengaged but intellectually centered. I bask in the stylish cutscenes and the sharp voiceover, but my attachment is not to the agency or its people but to the sheer pleasure of a successful heist."}