{"ref": "https://www.gamespot.com/reviews/tropico-5-review/1900-6415769/", "date": "May 22, 2014", "game_name": "Tropico 5", "text": "Everything is just one big joke on the island of Tropico. Your research team is incompetent, your diplomat is a snob, and your radio DJ is absolutely shameless. But that's OK, because both Tropico 5 and its digital inhabitants don't take anything too seriously. This management sim wraps its irreverent wit around some easily approachable mechanics that smartly grow in complexity as you move through the ages and become more familiar with your new role as El Presidente.I'm getting ahead of myself, since you're not actually El Presidente in the beginning. Instead, Tropico 5 starts you off as a lowly governor in the Victorian era under the service of the Crown. From these humble beginnings, you must guide your people through World War II, the Cold War, and beyond. Each age brings with it a new set of challenges because your tiny island nation is sandwiched between the world's rotating superpowers. But as your trusted advisors say, it is your will alone that is holding Tropico together, and that means doing anything and everything necessary to stay in office, whether it's rigging the next election or putting down civilian riots. After all, you're doing this for the good of the people, and your Swiss bank account.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tropico 5 - ReviewThroughout the ages, your advisors take excellent care of making sure Tropico 5 is easy to pick up and enjoy, whether you're familiar with this series' long history or not. You start in the Victorian era, where Lord Oaksworth, emissary to the Crown, guides you through building your first resource-gathering structures. These assignments are always couched in some harebrained scheme the king has cooked up back home, such as requesting that you build a logging camp so the king can complete his underwater palace.These missions to build certain structures or complete certain tasks continue throughout the game, and as you grow and define the style of your nation, they can be accepted or ignored as needed. In the beginning, you're just trying to stay in the black and keep your people happy, but as you advance through the eras, you may wish to shape your island into a high-end tourist trap or become the world's leading producer of cigars and rum. The types of missions selected for you are different each time you play and together they try to shape your island towards a certain style, but the game is also flexible enough for you to strike your own path as well.However, each mission carries with it some sort of political consequence. Usually it's a trade-off between appeasing one faction on the island and angering another, such as siding with the Crown over the revolutionaries, or later the Axis supporters over the Allied supporters. You don't have to please all of the people all of the time; you just have to stay in power. Forever. Virtually every choice you make--from the buildings you build to the people you trade with--has some sort of impact on your standing with the island's various factions. Molding popular opinion to your advantage is an enjoyable and ever-changing challenge that grows in complexity as you move through the ages and more factions are introduced.But while this game's simple mission design is there to reel you in, it's Tropico 5's sense of humor that baits the hook. From the wording of your island's constitution to the musings of your radio DJ, this game's irreverent streak touches every aspect of the island. And in its own way, this devil-may-care attitude is fitting for Tropico 5 since the game isn't concerned with breaking down every little bit of minutia for you. It gives you just enough information to make an informed decision without leaving you lost in a maze of submenus.Consider your budget. In Tropico 5, you're not earning money at a constant rate; rather, it comes in large lump sums when your trade ships arrive at port. And when you have that huge influx of cash burning a hole in your pocket, it's hard not to blow it all right away on new structures and other island improvements. Your citizens will love you for it, but you'll also be putting yourself back in crippling debt. Now, were I an egocentric island dictator in this goofy parody of real life, then I, too, would likely spend beyond my means when the time was ripe and then sweat it out during the off-season. Tropico 5 is full of little design touches--like how your money is doled out--that help reinforce its fiction that you are, frankly, a buffoon.There is a lot to enjoy on the sandy beaches of Tropico 5. Whether you're playing alone or with up to three others online, the game strikes a good balance between style and substance that is easy to digest for all types of strategy fans. The constant power struggle between the game's various factions--both internal and abroad--creates an ever-changing challenge for you to manage as El Presidente, whether through force or appeasement. And while the rest of the world tears itself apart with World War-this and Cold War-that, the simple-minded Tropicans are there to kick their feet up and take it easy for all us sinners."}