{"ref": "https://www.gamespot.com/reviews/madden-nfl-07-review/1900-6156201/", "date": "August 22, 2006", "game_name": "Madden NFL 07", "text": "When the Xbox 360 debuted late last year, so too did the newest iteration of EA-brand football, in Madden NFL 06. Rather than churn out a cheap and dirty port of its other console versions of the game, EA Tiburon built a new version of Madden from the ground up. The result was a much more attractive game of football, complete with a new menu presentation and excellent new player models, stadiums, and the like. The trade-off for that newness, however, was an incomplete game. It played like Madden, but it lacked the depth of its predecessors, offering only a barren franchise mode and online play as extra features. Madden NFL 07 builds off of that previous game, tossing back in some of the missing features from the other console versions, as well as including some new components. Unfortunately, Madden 07 comes encumbered with some quirks and bugs, as well, and it's still not nearly as complete of a football game as the other console and PC versions of 07 currently available. But despite all that, this is a definite step in the right direction for the series on the Xbox 360--just not a leap. The NFL returns to the Xbox 360 not even a full year after its last visit in Madden NFL 07. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Madden NFL 07 Video Review Madden NFL 07 brings back practically every feature that was in Madden 06 (not a tough feat, considering how little there was to the package), as well as the superstar mode, which was heavily featured in the other console versions of Madden 06 but was absent in the 360 version. On top of that, a number of new gameplay upgrades have been brought to the table, the majority of which are available in all versions of the game. By themselves, none of these individual changes or upgrades is particularly game changing, but taken as a whole, they add a nice dimension of depth to the gameplay experience. These features include the highlight stick, a new kick meter, and lead blocking controls. The highlight stick is a new version of the truck stick used for runners on offense. Here, you can use the right analog stick to pull off the sorts of crazy jukes and steps that star running backs are so well known for, and on top of that, depending on the type of back you're playing, you can opt to use more-powerful moves, or more finesse-based maneuvers. This feels like the natural evolution of last year's truck stick, though most experienced Madden players will be able to get by just as easily using the button-based moves rather than making liberal use of the stick. But if you take the time to learn the stick and figure out how to use it and the button controls together, you can be a very hard runner to stop. The new lead blocking controls are likely to inspire some new tactics from all types of players. Here, while on offense, you can opt to switch your controlled player to any of the available blockers during a running play. This includes offensive linemen, tight ends, fullbacks, or whoever else might be blocking on a play. When blocking, you can just do standard blocks, or you can even get dirty and do some mean-spirited cut blocks. This is an interesting mechanic, because it stops you from having to rely on CPU blockers, which as any experienced player will tell you, are not always the most reliable players on the field. You can also quickly switch back to control the running back once you've laid down your block, which is good, because the CPU running back doesn't always manage to find the holes you're creating. At first, you may find yourself unable to effectively use this feature, as setting up the right blocks isn't always the most intuitive thing in the world. But after some time, this control method gives the running game a really interesting new perspective, and those who love finding new strategies are bound to eat this up. The other changes to the gameplay are less significant, but they're enjoyable all the same. The new kick meter is probably the most accurate representation of kicking available in a game thus far. With this meter, you use the typical arrow to line up your angle and then press down on the right analog stick to set up your power. The meter quickly fills up, and then you press forward on the right stick to set the power, as well as your accuracy. The accuracy is based on the angle at which you press up. If you press too far to the right or left, the kick will get away from you. If you land it within a set space, it'll go right where you want it to. Much like NCAA 07 this year, Madden 07 gives you the option to try and jump the snap while on defense. Pressing a single button at just the right time lets your defensive player get a lead on the blocker in front of him and gives you an advantage while trying to get to the quarterback or runner. Of course, this is a risk-versus-reward situation, as opposing offenses will often try to lure you offside by using a hard count and faking the snap. The CPU tends to make very liberal use of this feature, and it tends to lead to far more encroachment penalties than are realistic for an NFL game. If anything, it ought to lead to more false-start penalties on the offense, since offensive linemen are notorious for jumping before the snap. Still, it's nice to see a key feature from the NCAA series find its way into Madden, and when timed properly, it gives a tangible advantage to the defense. Beyond that, the changes from 06 to 07 are mostly ancillary, and fundamentally, the game plays very much as its predecessor did. The basic feel of the game seems a little bit on the easy side, especially on the default difficulty. Namely, the defensive-back artificial intelligence doesn't seem terribly adept at handling certain types of routes, so it's possible to exploit those routes for easy gains on a regular basis. However, upping the difficulty to all-pro and all-Madden tends to fix that right up. On defense, there are a few more available options in terms of positioning your DB, LB, and DL corps, and you can commit your defense in a certain direction the moment the ball is snapped. But individual defensive-playmaker controls are still missing, which is unfortunate. The quarterback vision cone, which made its debut last year, is still available, though it's not a required feature. You can tap the right analog stick after snapping the ball, and the cone will pop on, letting you use it for a little accuracy boost. No, it's not any more fun to use than it was last year, but that's not altogether surprising. It's also worth mentioning that the achievements in this year's game are decidedly more interesting than in Madden 06. Most of them actually require some effort to get, though few are unattainably hard. The new superstar mode inarguably benefits from the new role and influence system. In terms of features, Madden NFL 07 brings back the franchise mode and online play from last year's game--literally. The franchise mode is practically untouched in most every way, with only a basic off-season menu list to mess around with and none of the presentational pizzazz of the other console versions--no Tony Bruno radio show, no newspapers, no e-mail dialogue with your roster, no owner mode. It's certainly functional as is, but that's about all that can be said for the mode. The online play hasn't evolved terribly far, either, with the usual list of EA Sports features included, such as the usual head-to-head play, lobbies, the EA Sports locker, and such. One new feature that sounds very cool on paper is the live franchise game. While in the franchise mode, you can opt to play one of your franchise games against an online opponent by switching on a toggle in the team-select menu. This sends an invite to players sitting in a live franchise game queue on Xbox Live. You also have the option of inviting friends to a game. Unfortunately, we were never able to connect up with one of these games. Every attempt we made resulted in an immediate connection drop, both by inviting friends and going through the player queue. Fortunately, all our head-to-head games played just fine, and we experienced little, if any, lag. The big new addition to the feature roster this year is superstar mode. If you played the Xbox, PlayStation 2, GameCube, or PC version of Madden last year, you're probably already familiar with this feature in its basic form. You take a fresh rookie player, of any position, through his NFL career, facing the various trials and tribulations that are typical for an NFL player. The version last year suffered from some annoying quirks and interface issues. Some of those problems still exist in the other console versions of Madden 07, but less of them appear on the 360. You no longer hang out in a cheesy hub area modeled after a player's house, nor do you have to worry about taking on movie roles or getting haircuts, and so on. Instead, the sole focus of the mode is on making your player one of the greatest NFL players of all time and eventually getting him into the Hall of Fame. All throughout your superstar's career, a meter will depict how far along your player is toward establishing his legacy as one of the best of all time. There's no specific list of things you have to do to become a Hall of Famer, but obviously you want to have the most storied career possible. Apart from throwing a lot of touchdown passes while playing as a quarterback or intercepting a billion passes as a defensive back, you have to interact with your team and establish a personality. You do this through various interviews, which give you specific answers that gear you toward a team-minded player or a Terrell Owens-like brat, as well as through a new influence system. In this system, every superstar has the ability to play certain roles on the field, and these roles range from, say, a field general for a quarterback to a possession receiver for a wide receiver to a rookie for, you guessed it, a rookie. Lead blocker controls sound kind of weird on paper, but really do add a nice new dimension to the running game. These roles give you tangible bonuses and control over players on the field. A quarterback using the field-general role, for instance, can upgrade his passing-accuracy rating, as well as the blocking ratings for his various offensive linemen. Another role he can take, the team leader, lets him upgrade the awareness, injury, acceleration, and agility ratings for all the other offensive players on the field. You gain these points by upping your influence rating. This rating goes up or down based on what you do on the field. Make a huge completion for a first down, and you'll get a nice bonus. Throw a lame interception that's returned for a touchdown, and it will drop through the floor. It's a great and addictive system that makes you want to play through superstar mode games, rather than just simulate them. This system is the reason you'll want to play through the superstar mode. The other big feature to make its way into this year's game, the training minigames, sadly isn't all that great. When you first create your superstar, you put him through a number of workouts with teams and at the combine. In this mode, you run a 40-yard dash, do a number of bench-press reps, and do one position-specific game that's somewhat similar to the minicamp games from the other versions of Madden. The trouble is that none of these games are anywhere near as good as the classic minicamp games. The 40-yard dash and bench-press games are very awkward at first, and the instructions for each game use some confusing language when explaining how to play. With some practice, you'll get the hang of it, but even when you do, the games aren't much fun. The same goes for the position-specific games, which don't feel especially fleshed out. You can play any of these games throughout the superstar mode if your agent has access to the performance institute, and there's also a separate minigames mode that includes all of these, as well, but odds are, you'll never much want to bother with them outside of the requisite superstar-mode workouts. Some of the issues with the original superstar mode rear their ugly head here, too. Mainly, there's no particularly good sense that your agent, wealth, or status really make much difference beyond the Hall of Fame aspect. You could hire the best agent available, sign a gigantic free-agent contract, and never notice a difference save for the change in uniform. There's not much flash to the life of an NFL superstar, and trudging through menus on a constant basis doesn't give you the right kind of vibe. Another issue is that, like last year, some positions just don't play very well. The game uses a zoomed camera angle during the mode that effectively limits your vision to the area immediately surrounding your player, and for some positions, like defensive back, it makes playing it a huge pain. In fact, the camera angle kind of makes all positions a bit more of a pain, but with some positions like quarterback, running back, and linebacker, it doesn't hinder your ability to play properly terribly much. Also, the superstar mode doesn't run as well as the rest of the game, especially when you're playing actual games. Since you're not controlling anyone but your own player, sequences on the other side of the ball from where you play are sped up and played solely by the computer. You'll see some wonky aspects during the sped-up simulation, including a liberal amount of encroachment calls as the CPU-controlled offense goes nuts with the hard counts. As for when you're on the field, the game seems to struggle to load up plays and transition between cutscenes and on-field action. You can hear the disc thrashing badly in the 360 disc tray while this is going on, so there's definitely something unpleasant happening there. That's not the only technical issue you'll run into with Madden 07, either. There are a number of odd bugs and glitches scattered throughout the game. The biggest one, by far, is the lack of functioning fatigue meters. Fatigue never appears to drop when you're playing the game, meaning players are evidently fully energized all throughout a game. It's something that seems easily patchable, but it's annoying that the game is shipping with such a key feature broken. Another weird bug involves the kick meter sometimes disappearing. This mainly happened to us during franchise games. At random times during games, the kick meter would either completely refuse to appear onscreen or the arrow would appear without the strength/accuracy meter. This was infrequent, and you could still make the kick happen without the meter displaying, but it's an annoying bug all the same. There are some other weird design issues in the game that aren't exactly bugs so much as they are poor choices. One pertains to the game's Madden gamer level and the connected Hall of Fame feature. As you play through the game, your profile has a level associated with it that increases as you perform specific tasks. It's similar to the whole Madden card system from the old console versions. Upping your level unlocks classic NFL players that are currently enshrined in the Hall of Fame, both as video reels you can watch and as players that hit the free-agent pool in the game. Neat as that is, a problem arises when you start a new franchise or superstar mode after unlocking some of these guys. They appear in these modes' free-agent pools, too, and quickly get snapped up by various teams. If you're the type that wants to keep your roster pure, you essentially have to save your default roster when you boot up the game for the first time and reload that roster every time you start a new franchise or superstar. A simple on/off toggle in the options menu for the Hall of Fame players would have gone a great distance toward eliminating this issue. It's been significantly less than a year's time since Madden 06 debuted on the 360, so it's not entirely shocking that the graphics engine in this year's game is fundamentally identical to last year's. It seems like a few more players have faces that match up to their real-life looks, and there are some nice new on-field animations (as well as an off-field team-introduction animation that plays before every game), but primarily, 07 looks a lot like 06. That's not necessarily an indictment, mind you. Madden looked great last year, and it still does this year. There are some definite issues with off-kilter animations appearing on the field (clipping issues, clumsy transitional animations, and the like), and the aforementioned chugging in transitions between cutscenes and on-field action does get in the way during the superstar mode, but otherwise, the action looks excellent, especially in high definition. It's safe to say Brett Favre's never looked better than he does here. Similarly, the audio presentation hasn't changed to any notable degree. John Madden is still relegated to Ask Madden play-calling scenarios, and commentary is handled by an unknown EA Sports radio announcer who delivers 10 times the enthusiasm his predecessors ever could. On-field audio is a delight, with some really top-notch player banter and plenty of bone-crushing hits. The soundtrack is once again made up of a mishmash of popular rock and hip-hop, and just like every other year, it's a wildly varied mix that doesn't gel at all. Not to mention that some song choices, such as Spank Rock's ~Backyard Betty,~ seem a little seedy for an E-for-Everyone game, even with lyrical edits. There's no denying that Madden NFL 07 comes up short on delivering all the improvements one would hope for after last year's disappointing debut on the 360. However, it does at least push the series in the right direction. There's no one big, game-changing feature added to this year's game, and the bugs are certainly going to hamper your enjoyment, but the culmination of re-added features and control upgrades give the necessary oomph to make the 360 version feel like more than just last year's game all over again. If you skipped 06, definitely give 07 a look, as it's far more representative of what a football game on the 360 ought to be like. All throughout your superstar's career, a meter will depict how far along your player is toward establishing his legacy as one of the best of all time. There's no specific list of things you have to do to become a Hall of Famer, but obviously you want to have the most storied career possible. Apart from throwing a lot of touchdown passes while playing as a quarterback or intercepting a billion passes as a defensive back, you have to interact with your team and establish a personality. You do this through various interviews, which give you specific answers that gear you toward a team-minded player or a Terrell Owens-like brat, as well as through a new influence system. In this system, every superstar has the ability to play certain roles on the field, and these roles range from, say, a field general for a quarterback to a possession receiver for a wide receiver to a rookie for, you guessed it, a rookie. Lead blocker controls sound kind of weird on paper, but really do add a nice new dimension to the running game. These roles give you tangible bonuses and control over players on the field. A quarterback using the field-general role, for instance, can upgrade his passing-accuracy rating, as well as the blocking ratings for his various offensive linemen. Another role he can take, the team leader, lets him upgrade the awareness, injury, acceleration, and agility ratings for all the other offensive players on the field. You gain these points by upping your influence rating. This rating goes up or down based on what you do on the field. Make a huge completion for a first down, and you'll get a nice bonus. Throw a lame interception that's returned for a touchdown, and it will drop through the floor. It's a great and addictive system that makes you want to play through superstar mode games, rather than just simulate them. This system is the reason you'll want to play through the superstar mode. The other big feature to make its way into this year's game, the training minigames, sadly isn't all that great. When you first create your superstar, you put him through a number of workouts with teams and at the combine. In this mode, you run a 40-yard dash, do a number of bench-press reps, and do one position-specific game that's somewhat similar to the minicamp games from the other versions of Madden. The trouble is that none of these games are anywhere near as good as the classic minicamp games. The 40-yard dash and bench-press games are very awkward at first, and the instructions for each game use some confusing language when explaining how to play. With some practice, you'll get the hang of it, but even when you do, the games aren't much fun. The same goes for the position-specific games, which don't feel especially fleshed out. You can play any of these games throughout the superstar mode if your agent has access to the performance institute, and there's also a separate minigames mode that includes all of these, as well, but odds are, you'll never much want to bother with them outside of the requisite superstar-mode workouts. Some of the issues with the original superstar mode rear their ugly head here, too. Mainly, there's no particularly good sense that your agent, wealth, or status really make much difference beyond the Hall of Fame aspect. You could hire the best agent available, sign a gigantic free-agent contract, and never notice a difference save for the change in uniform. There's not much flash to the life of an NFL superstar, and trudging through menus on a constant basis doesn't give you the right kind of vibe. Another issue is that, like last year, some positions just don't play very well. The game uses a zoomed camera angle during the mode that effectively limits your vision to the area immediately surrounding your player, and for some positions, like defensive back, it makes playing it a huge pain. In fact, the camera angle kind of makes all positions a bit more of a pain, but with some positions like quarterback, running back, and linebacker, it doesn't hinder your ability to play properly terribly much. Also, the superstar mode doesn't run as well as the rest of the game, especially when you're playing actual games. Since you're not controlling anyone but your own player, sequences on the other side of the ball from where you play are sped up and played solely by the computer. You'll see some wonky aspects during the sped-up simulation, including a liberal amount of encroachment calls as the CPU-controlled offense goes nuts with the hard counts. As for when you're on the field, the game seems to struggle to load up plays and transition between cutscenes and on-field action. You can hear the disc thrashing badly in the 360 disc tray while this is going on, so there's definitely something unpleasant happening there. That's not the only technical issue you'll run into with Madden 07, either. There are a number of odd bugs and glitches scattered throughout the game. The biggest one, by far, is the lack of functioning fatigue meters. Fatigue never appears to drop when you're playing the game, meaning players are evidently fully energized all throughout a game. It's something that seems easily patchable, but it's annoying that the game is shipping with such a key feature broken. Another weird bug involves the kick meter sometimes disappearing. This mainly happened to us during franchise games. At random times during games, the kick meter would either completely refuse to appear onscreen or the arrow would appear without the strength/accuracy meter. This was infrequent, and you could still make the kick happen without the meter displaying, but it's an annoying bug all the same. There are some other weird design issues in the game that aren't exactly bugs so much as they are poor choices. One pertains to the game's Madden gamer level and the connected Hall of Fame feature. As you play through the game, your profile has a level associated with it that increases as you perform specific tasks. It's similar to the whole Madden card system from the old console versions. Upping your level unlocks classic NFL players that are currently enshrined in the Hall of Fame, both as video reels you can watch and as players that hit the free-agent pool in the game. Neat as that is, a problem arises when you start a new franchise or superstar mode after unlocking some of these guys. They appear in these modes' free-agent pools, too, and quickly get snapped up by various teams. If you're the type that wants to keep your roster pure, you essentially have to save your default roster when you boot up the game for the first time and reload that roster every time you start a new franchise or superstar. A simple on/off toggle in the options menu for the Hall of Fame players would have gone a great distance toward eliminating this issue. It's been significantly less than a year's time since Madden 06 debuted on the 360, so it's not entirely shocking that the graphics engine in this year's game is fundamentally identical to last year's. It seems like a few more players have faces that match up to their real-life looks, and there are some nice new on-field animations (as well as an off-field team-introduction animation that plays before every game), but primarily, 07 looks a lot like 06. That's not necessarily an indictment, mind you. Madden looked great last year, and it still does this year. There are some definite issues with off-kilter animations appearing on the field (clipping issues, clumsy transitional animations, and the like), and the aforementioned chugging in transitions between cutscenes and on-field action does get in the way during the superstar mode, but otherwise, the action looks excellent, especially in high definition. It's safe to say Brett Favre's never looked better than he does here. Similarly, the audio presentation hasn't changed to any notable degree. John Madden is still relegated to Ask Madden play-calling scenarios, and commentary is handled by an unknown EA Sports radio announcer who delivers 10 times the enthusiasm his predecessors ever could. On-field audio is a delight, with some really top-notch player banter and plenty of bone-crushing hits. The soundtrack is once again made up of a mishmash of popular rock and hip-hop, and just like every other year, it's a wildly varied mix that doesn't gel at all. Not to mention that some song choices, such as Spank Rock's ~Backyard Betty,~ seem a little seedy for an E-for-Everyone game, even with lyrical edits. There's no denying that Madden NFL 07 comes up short on delivering all the improvements one would hope for after last year's disappointing debut on the 360. However, it does at least push the series in the right direction. There's no one big, game-changing feature added to this year's game, and the bugs are certainly going to hamper your enjoyment, but the culmination of re-added features and control upgrades give the necessary oomph to make the 360 version feel like more than just last year's game all over again. If you skipped 06, definitely give 07 a look, as it's far more representative of what a football game on the 360 ought to be like."}