{"ref": "https://www.gamespot.com/reviews/winback-review/1900-2545490/", "date": "October 21, 1999", "game_name": "WinBack: Covert Operations", "text": "When you think of covert government operatives, you think of the good life: fast cars, beautiful women, big guns, and all sorts of cool secret gadgets. Cultural icons like James Bond and Ethan from Mission Impossible have made the life of a secret agent the fantasy of millions. And why not? Who wouldn't want to swoop into a secret terrorist hideout, cap a few bad guys, down a martini or two, and then zoom away in your rocket-powered supercar? But while Hollywood has been successful in capturing the magic of a spy's lifestyle, video games have struggled to translate the complete experience of having a license to kill.Certain milestone games such as Metal Gear Solid and GoldenEye 007 have shown that there's more to being a covert operative than knowing how to squeeze off a few rounds. To be any sort of special agent you're gonna need smarts, tons of cool items, and a specific weapon for every purpose. Unfortunately, this isn't the case with WinBack - a game that would have you believe that all you need to infiltrate a terrorist base is a pistol with a bottomless clip.WinBack's plotline involves a terrorist group seizing control of a satellite capable of destroying the world. (Did someone say GoldenEye?) You take on the persona of Jean-Luc, a highly trained agent of the secret government agency SCAT (which stands for Strategic Covert Actions Team  I'm not going to comment on this one). SCAT has been sent to infiltrate the hideout of the terrorist group that's taken control of the satellite, but before SCAT agents can properly set their plan of attack into motion their airship is destroyed and the team is SCAT-tered about the island. So now it's just you, your cool secret-operative jumpsuit, and your trusty magical pistol against a huge island full of terrorists. But don't worry, you won't have to find or use any cool items, and the terrorists aren't really that smart. In fact, all you'll have to do is hide behind stuff, jump out and shoot bad guy after bad guy, and then shoot the big yellow boxes that control the kill-you-with-one-touch laser tripwires. Imagine a seemingly endless cycle of this process and you'll see how WinBack becomes a repetitive, mundane experience.The lackluster play style could have probably been overlooked in the light of the cool hide-'n'-shoot system, if it weren't for the horrible camera and the difficult control. The camera floats behind Jean-Luc, who is the primary focus. That means that if he rounds a corner, the camera is still pointing at him. If he turns around, the camera is still looking in the same direction. You can adjust the camera, but it takes forever, and you're sure to get shot at before you can bring the camera to bear on your enemy. On top of that, Jean-Luc isn't particularly fast, especially when turning around. To do so, he's got to take a step or two in the indicated direction, making negotiating tight spaces an impossibility. And instead of having a whole arsenal at his disposal, Jean-Luc only gets to use three different weapons - his pistol, a shotgun, and an SMG (none of which he can fire while moving). Occasionally, he'll run into something cool like a rocket launcher, but the game's ammo drought keeps you stuck with your pistol.In true gunfight fashion, WinBack lets you flatten against a wall, pop out and draw your sidearm, then return to the safety of the wall when you choose. This is a great concept, but there simply aren't enough walls around to put this to good use. Another cool control concept is crouching. You can walk crouched, roll, and even use crates for cover. A good combination of the two is enough to let you kill most of the baddies encountered during the game.It appears it doesn't take all that much to be a terrorist these days, as the enemies in this game are ridiculously dense. You can run right up to the cover they're standing behind, crouch, and not get shot. On top of that, every time an enemy spots you he'll scream, ~Freeze!~ or, ~There he is!~ before he starts shooting. These ~ask questions first~ terrorists are pretty odd, maybe even more so that the brightly colored yellow laser tripwires.WinBack isn't all bad. The soundtrack is very refreshing and full of crazy drum-'n'-bass that helps increase the sense of tension in a hostile situation. On top of that, the closer you are to taking a dirt nap the more exciting the music gets. Unfortunately, the sound effects aren't as good as the soundtrack. WinBack contains no speech, and as such you don't feel like you're really involved in the story. In fact, it's difficult not to skip the in-game cinemas, as they are bogged down with text-based conversation.The graphics are nice enough, even though the game doesn't take advantage of the N64's expansion PAK, but they do have a few flaws. The wall textures look recycled in places, and every crate looks pretty much identical. Meanwhile, your enemies are slightly varied, but for the most part you won't notice, as most of them attack you from pretty far away. And the game also looks slightly blurry, as if someone rubbed Vaseline on your screen.The multiplayer aspect isn't all that different from the single-player game. You start in a small room and scramble for cover, and then shoot it out. Thanks to the terrible camera work you're bound to discover yourself directly next to your opponent at some point, in which case the first person to notice wins. And because you can't move while shooting, the game boils down to running into each other, shooting, and then running away.WinBack is a game that had some great potential. With a truly innovative hide-then-shoot system, an interesting premise, and tons of examples from the spy genre, WinBack had a lot of good material that could have been crafted into a great game. But somewhere along the way WinBack lost sight of its goal, and we ended up with a rather bland adventure that really only skims the surface of a secret-agent scenario. Unfortunately, the game reaches its peak in the first level and from there turns into a mundane, tiresome process. The game's multiple flaws outweigh its good points and turns what could have been the next GoldenEye 007 into another boring shooter."}