{"ref": "https://www.gamespot.com/reviews/the-last-of-us-part-2-spoiler-review-dog-eat-dog/1900-6417487/", "date": "June 25, 2020", "game_name": "The Last of Us Part II", "text": "Editor's note: You may have seen our spoiler-free The Last of Us Part II review, originally published on June 12, 2020. Due to a strict embargo, we were limited in what aspects of the game we could touch on in that review. Now that the embargo has lifted and the game is now available, I've expanded on my thoughts here; this review has the same arguments and score as the first one and is simply more detailed in my analysis. Note that this review contains spoilers, including one major character death. We also have a full spoiler chat covering every story beat in the game if you're looking for even more in-depth analysis of the story.The Last of Us Part II begins with serious tonal whiplash. One moment, Ellie and her close friend Dina are becoming more than friends in a basement filled with weed plants and Naughty Dog porn puns; the next, Joel is being savagely beaten to death with a golf club. It's the first of many, many gruesome deaths. Some happen whether you want them to or not, in intimate cutscenes that are hard to watch, while others happen just because an NPC got in between you and your objective and killing them was the easiest thing to do. Either way, that brief glimpse of happiness at the beginning is left very much in the dust.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: The Last Of Us Part II Spoiler Review VideoBut while the scale and severity of death and loss in this game is incredibly high, The Last of Us Part II is more a character study than a musing on the nature of violence. On that front, the story of Ellie, her playable foil Abby, and their quests for revenge and redemption is a gripping and harrowing one, and I found myself deeply emotionally entangled with each woman and her strengths and flaws. The bloodshed is very much a part of that story, but it's far from the most effective one, and it's where the game stumbles a bit.Throughout the game, I often wanted to stop Ellie from making the choices she was making. Joel's death sends her on a relentless quest for revenge, and I had a hard time buying into it. Ellie's life in the settlement of Jackson is a good one--she has a new girlfriend, and it's about as nice a place to live as you could expect from a post-apocalyptic community. It was hard for me at first to understand why she'd want to risk all that for a dangerous revenge quest when she could process her grief among friends and loved ones in relative safety.But Ellie decides to get revenge, so you go. As Ellie, you play three days in Seattle as you hunt down any and all the people present when Abby killed Joel. They're all members of the Washington Liberation Front, or WLF for short, and much of your time is spent killing random ~Wolves~ from one combat scenario to the next. You collect resources and weapons, upgrade those weapons, unlock new skill paths, and generally get very used to killing people (and infected) as the scrappy, agile Ellie.Like I said in my spoiler-free review, the combat is intense and exhilarating. Ellie's movements are smooth enough that they almost look scripted; you can duck and dodge in a fight and deliver a return blow with a series of button presses that translate into a strangely graceful dance. You can accidentally alert an enemy to your presence only to slip through a tight space in the wall, vault through a window, and outrun your pursuer through a building to reestablish your cover and gain the upper hand. You can also easily get surrounded and die horribly, whether you're fighting people or infected.Navigating any given combat scenario is a puzzle in which you have to figure out exactly how to get from point A to point B with the resources you have. I'm partial to stealth when possible, and it's especially rewarding to decide how you're going to silently kill each enemy with only a flimsy silencer, two arrows, and your default knife. Should you kill the blind clickers first because they're strong and deadly, or should you kill the infected runners first because they can see you? Can you retrieve an arrow from a corpse to be reused on their friend? Most importantly, where's the exit?And, of course, it is brutal. Enemies use each other's names and cry out when you kill their friends. Killing someone's dog is a priority, as they can track your scent and maul you to death, and you have to hear them mourn the dog in real-time. But frankly, the fact that your enemies have names doesn't make them any less in your way. You have to do what you have to do to get to the next location, and you want to do that to see where the story goes next. They might as well be anonymous at that point.The fact that your enemies have names doesn't make them any less in your way.Overall, Ellie leaves an unbelievable amount of destruction in her wake in just three days. Day 3 itself ends in chaos, but before it can be resolved, the game cuts. The next thing you know, it's Seattle Day 1 again, and you're controlling Abby. This is where The Last of Us II contextualizes Ellie's rampage, and it's the entire reason the story works at all.It can certainly be jarring to suddenly switch characters. In many ways, you have to start from scratch; you have a whole new set of weapons and skills to unlock, and Abby feels different in a fight. But you also know much of what happens to Abby's friends, and on Day 1, you see a lot of ghosts. There's a pang of sadness and overwhelming inevitability in every interaction you have with them; you wish you could change the outcome, but you can't.Like Ellie, Abby was driven by revenge--and she got it. Through flashbacks, you learn exactly what happened and where she's come from, and it doesn't take long to side with her over Ellie despite any lingering feelings you might have for Joel. Done with a years-long search for vengeance, hers is a story of redemption. Unlike with Ellie, it's easy to get invested in Abby's goals, which include saving her friend and then saving some kids. Her motivations are complicated, sure, but it's not at all a struggle to get on board with what you're doing.Abby is clearly a foil to Ellie, just further along in her journey. Through Abby, you get to see what redemption for Ellie might look like, even after all that she's done. It's a testament to Abby's characterization that I ended up more attached to her than I was to Ellie, and when the game ripped me back to Ellie's perspective for the final stretch, I was more concerned about Abby's safety than Ellie's pain.It's a testament to Abby's characterization that I ended up more attached to her than I was to Ellie.Like Ellie, though, Abby still kills a lot of people. Abby's main enemy is a religious group called the Seraphites, and they, too, are composed of mostly anonymous soldier types. They do get some humanization through Abby's companion, an exiled Seraphite boy named Lev, but it's about the same as that of the Wolves: just enough for the story, and not enough to make you change how you fight. In Abby's case, the onslaught of combat against human enemies feels more at odds with her character development, especially by Day 3, and a lot of that violence goes unexamined. Neither Abby nor Ellie faces real consequences for most of those deaths.For both characters, this disconnect between the gameplay and the grander narrative is compounded by looting and collectible-hunting. Looting during a fight is exciting, especially when you find the one extra bullet you need or a bit of health that can keep you going. But more often than not, I'd loot and look for collectibles only after I'd killed every enemy in the vicinity. It's far easier and safer, for one, and I didn't want to miss any of the interesting sub-plots found in scattered notes and photographs just because I wanted to kill fewer people.Most of the time, there aren't any collectibles to find in combat-heavy areas. But there are occasionally notes and things to find when enemies are around, and as a result, I ended up scouring every corner of every area in the hopes of finding something cool. Because most combat arenas give you multiple avenues of attack and escape, though, I ended up backtracking through most of them to try to find things, and that can severely disrupt the pacing. The nooks and crannies that work well in combat just become one more place to look for a note or trading card, and the fact that you're looking for trading cards at all often feels too game-y for the otherwise sobering tone.I ended up enabling an accessibility option called high-contrast mode to help with my collectible hunt, not because it was difficult, but because I was getting annoyed. When toggled on, it mutes the background, removes textures, and highlights interactable objects and enemies. I used it after clearing an area of enemies to speed up the looting part, and while it wasn't the most elegant solution, it did help the pacing. It's one of a litany of accessibility options, too, which allow you to fine-tune the gameplay, sound, and visuals to your needs. It's a commendable suite that's incredibly inclusive, though I enabled an option just to circumvent a gameplay annoyance rather than to fit a need.Abby is a fantastic character in her own right, and the way the game pits her against Ellie is what makes the story powerful.Despite those annoyances, finding collectibles and piecing together the stories held within them is rewarding and paints a picture of the outbreak as it developed through the years. A bank robbery gone wrong sticks out as a favorite, and there are quite a few other stories worth finding. A lot of the time, seeking out these collectibles will force you to get creative--things like breaking windows to bypass a locked door or swinging on a cable to get to an area that's just out of reach. There's nothing so difficult that you feel like a genius for figuring it out, but it does make you feel appropriately resourceful.It's a bleak, pessimistic world, and exploration issues aside, I didn't exactly want to leave it. The ending is devastating, and I almost wanted more time in-game to reflect on it. I instead put the game down for a full week after I was done so I could fully process what had happened.In the original Last of Us, I wanted to make Joel's bad decisions right along with him; I knew it was ~wrong,~ in a sense, but I wanted to save Ellie anyway. In Part II, I wanted nothing to do with Ellie's bad decisions. There's no ~oh god, I'm the monster~ moment; just profound sadness about all the pain she's caused. Without Abby, none of that works. Abby is a fantastic character in her own right, and the way the game pits her against Ellie is what makes the story powerful. It's a tragic, heartbreaking exploration of the consequences of the first game, even if not all your actions here have real consequences."}