{"ref": "https://www.gamespot.com/reviews/conflict-vietnam-review/1900-6110478/", "date": "October 13, 2004", "game_name": "Conflict: Vietnam", "text": "Conflict: Vietnam is the best of the recent spate of Vietnam War-themed shooters. Unfortunately, it earns that distinction primarily because of how bad the competition has been. It's a solidly average game whose few original ideas are compromised by screwy controls, some pacing problems, and a punishing save-game system. You can upgrade each character's skills between levels. Like every other recent Vietnam War game, you play a raw recruit, learning the ropes from your potty-mouthed fellow soldiers. In an interesting twist, you also play the potty-mouthed fellow soldiers. The game is actually a squad-based third-person shooter. You take control of four grunts, each with a specialty: a medic, a heavy gunner, an assault weapons expert, and a sniper. You directly control one team member at a time, but you're free to switch between them at will. When you're not directly controlling a character, that character will move and shoot autonomously, though you can issue several general orders such as hold fire, fire at will, stand ground, and follow. You can also give specific orders to a teammate. Through a series of button presses, you can remotely order characters to embark on various tasks. Generally speaking, these fall into four categories: go here, pick this up, attack this target, and heal this person. In theory, it's a nice idea, but it's largely unnecessary, as it generally takes less time, effort, and button presses to just switch to that character and perform the action yourself. The extraneous controls are a little aggravating, because other squad-control options that would have actually been useful are simply missing. For instance, it would have been nice to be able to order the squad to grab ammunition on its own, rather than constantly having to switch between members and having to do it manually. The first-person iron sights mode is relatively useless as well. The aiming interface is blurry and overlaid with a gun-sight graphic that obscures a large part of the screen. In almost all cases, it's easier just to aim in the third-person mode. This is especially true on the Xbox and PS2 versions, where the default auto-aiming feature homes in on enemies across a wide arc, often before you even notice them. When you're not controlling them, your teammates are generally smart enough to fire on anyone who's shooting at them. That's about the extent of their intellect, however. They won't look for cover (in fact, they'll barely move), and they pretty much refuse to run from incoming grenades. Unlike most of the other recent Vietnam War games, cover doesn't play a big part in Conflict: Vietnam. Or rather, cover is replaced by lying prone, which makes you much harder to hit. The battles are generally a matter of having everyone go prone, and, if there's enough time, will include moving one guy to the rear or off to the side so that the entire squad isn't wiped out if a grenade comes rolling in. When a character's health reaches zero, he becomes incapacitated, and there's roughly a two-minute window during which any other character with a med kit can heal him. If he's not healed in time, he dies and you fail the mission. Once you become acclimated to the rhythm of the game--the combination of squad positioning and healing under fire--the combat system becomes much more manageable and occasionally satisfying. The game features 14 long missions, covering a wide variety of tasks. There are a bunch of straightforward advance-and-kill-whatever-you-find levels, but these are punctuated by a couple of decent on-rails levels. The squad mechanic adds some complexity to the typical on-rail mission, as you're forced to constantly switch between four mounted guns, each with its own viewing angle on the action. At certain points during various levels, you'll also take control of a couple of different vehicles, including a jeep and a tank. At the end of each level you're awarded points for your performance. These points can then be used to boost any of nine different skills for each character. The tangible effects of these skill boosts are subtle, however. The Xbox version supports a four player, split-screen cooperative mode through the single-player campaign; the PS2 supports two players; and the PC, unfortunately, has no multiplayer at all. The biggest problem with the missions is the stingy save system. The game saves automatically at the beginning of each level. After that, you're granted only two saves per mission to use at your discretion. Given the length and relative difficulty of the game--and the frequency with which your entire squad will be wiped out by an incoming RPG --that's at least four or five saves too few. Unless you're willing to split your squad into two manually controlled groups (so that one can heal the other) and painstakingly creep through the long levels, you'll definitely be replaying large sections of various missions. The iron sights aiming feature is kind of clunky and useless. Visually, the game is pretty much par for the Vietnam course. Texture detail is sacrificed for dense jungle geometry, but it does a good enough job of making you feel as if you're creeping through the underbrush. Since no Vietnam game is complete without a few licensed period songs, Conflict Vietnam includes recognizable tunes from the Rolling Stones, Jefferson Airplane, Martha and the Vandellas, and Canned Heat. Surprisingly, both the cutscenes and the voice acting are pretty well done and, in a first for the Vietnam War genre, not especially embarrassing. Not especially embarrassing is a pretty good description of Conflict: Vietnam in general. While not exactly a ringing endorsement, it at least places its head and shoulders above its competition. Meanwhile, we're still waiting for the definitive Vietnam War shooter."}