{"ref": "https://www.gamespot.com/reviews/rock-band-4-review/1900-6416264/", "date": "October 5, 2015", "game_name": "Rock Band 4", "text": "I cant stop listening to The Protomen. Ive known about this band and their Mega Man-inspired tunes for years now, but I never really gave them a chance until ''Light Up the Night'' popped up during a Rock Band 4 set. Turns out that song is perfect: triumphant sing-along vocals, driving synths straight out of an 80s training montage, pounding drums that subtly ramp up the songs unstoppable intensity. Its an absolute blast both to hear and to play, and without experiencing the song through the immediacy of Rock Band, I may never have fallen in love with it.That, in essence, is the power of Rock Band. It harnesses the intrinsic joy of music and presents it in a way that we can not only play but share as well. The pure euphoria that washes over you when a song begins to build and you're nailing every note and you finally hit that pinnacle and the crowd erupts in cheers and applause... Not many games can elicit that feeling so frequently, consistently, and authentically. Its a rare and laudable accomplishment, one that propelled the franchise to great heights in the late 2000s and that lives on in Rock Band 4.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Rock Band 4 - Video ReviewWhile this fourth installment ditches Rock Band 3s button-heavy Pro Guitar and superfluous keyboard controller, the core gameplay remains almost entirely unchanged. You (and ideally a few of your friends) can grab a classic five-button guitar controller, plastic drum kit, or USB microphone to match scrolling, color-coded notes in time with a variety of licensed tracks from rock gods like Ozzy Osbourne, Van Halen, and, uh, Bruno Mars. As before, your instruments audio drops out when you start missing notes, but maintaining an unbroken streak increases your combo multiplier, Overdrive meter, and number of stars earned. So yes, its exactly the gameplay you already know and love.Unfortunately, therein lies the problem. Great as that gameplay may be, Rock Band 4 does little to distinguish itself from its predecessors outside of a handful of hit-or-miss ideas and, in some cases, even takes a small step backwards. For example, the games loosely story-driven campaign mode follows the same rote formula employed by several previous music games: select multi-song ''shows'' from a world map, earn stars and fans to unlock new shows, and so on.Rock Band 2 handled this same subject matter in a far more elegant way. Remember those loading screens that showed your band casually hanging around a heavily lived-in practice space or riding the subway with all their instruments in tow? Simple as they were, those scenes subtly relayed a story in a very universal way. This game? Nothing but expositional menu text, which made any feelings of immersion or investment nearly impossible.Unfortunately, therein lies the problem. Great as that gameplay may be, Rock Band 4 does little to distinguish itself from its predecessors outside of a handful of hit-or-miss ideas and, in some cases, even takes a small step backwards.Even the games opening cutscene--which were generally massive, over-the-top spectacles bursting with personality in previous games--just shows your band tuning up on stage for a few seconds. Its disappointingly predictable and boring, and while none of this detracts from your ability to rock out with Ozzy, it does feel like a missed opportunity.Character customization doesnt fare much better. Where previous games provided a respectably deep well of options, Rock Band 4 doesnt even let you adjust a characters body type. You can eventually unlock an entire wardrobe of wacky outfits, but because the vast majority of those options must be gradually earned through campaign progression, I found it difficult to develop a sense of ownership over my band.Compounding this lack of ownership: the game forces you to use pre-created ''stand in'' characters anytime your friends arent present to play as your custom characters, which means its literally impossible to maintain a consistent lineup. Given that a band is, by definition, a set group of people, thats a pretty frustrating betrayal of the rock-n-roll fantasy the campaign is designed to fulfill.Outside of the campaign, Rock Band 4 also offers a new, slightly richer Quickplay mode appropriately named ''Play A Show.'' When a track ends, Play A Show presents players with a selection of songs and lets band members vote on what to play next the same way some shooters let lobby members vote on the next map.Its a novel idea that occasionally proved convenient, but its also kind of pointless when youre standing in the same room as the rest of your band. Rock Band 4 eliminates synchronous online multiplayer, and while thats not a huge loss, it does mean anytime youre playing with other people you can just turn to one another and ask, ''Okay, whats next?'' Like the campaigns story elements, this mode doesnt diminish your ability to enjoy the gameplay, but it also doesnt add much to the overall experience.Beyond those modes, Rock Band 4 feels a bit content light. Bafflingly, you wont find a practice mode, for instance, or anything resembling, say, Rocksmith 2014s collection of Guitarcade mini-games. You will, however, find a couple of crucial tutorials for Rock Band 4s one truly original and truly exceptional idea: Freestyle Solos. In the past, the team at Harmonix painstakingly authored each and every note of a songs recorded solo. That style is still an option, but Freestyle Solos are now on by default.Beyond those modes, Rock Band 4 feels a bit content light. Bafflingly, you wont find a practice mode, for instance, or anything resembling, say, Rocksmith 2014s collection of Guitarcade mini-games.Accordingly, sections that were previously populated with colorful notes now give way to less cluttered runways filled with subtler visual cues. If you want to maintain your combo multiplier, you might be asked to hold notes on the high frets or strum 16th notes on the lower buttons depending on the pattern displayed on the track. Regardless of whether you follow along or just totally do your own thing, the game will produce a unique new solo that matches your inputs.Like the old drum fill sections, mashing buttons at random creates a disruptive cacophony that momentarily ruins the song, but once I took the time to really internalize those tutorials, I started to understand how sophisticated this mechanic really is. It uses logical abstractions of several real-life guitar techniques--from finger tapping to feedback--to equip players with a whole palette of sonic tools.If you implement these techniques thoughtfully, you can actually create some really cool sounding stuff. Like, surprisingly cool. And its weirdly addictive. Its not the same adrenaline-fueled, fist-pumping thrill of nailing every note in a really technical section, but there is an unexpected sense of discovery and reward. Just fire up Endless Solo Mode and riff over entire songs until youre comfortable.Guitarists arent the only ones who get a little added room for creativity. In addition to the inclusion of three part harmonies, singers can now earn points for singing basically anything in the right key. Similarly, drummers now have three options when it comes to solo sections: Static Fills, which mirror the actual recorded fill; Classic Fills, which let you just go nuts; and Dynamic Fills, which pull a random, pre-authored fill from a library, providing a welcome compromise between the chaos of Classic Fills and the predictability of Static Fills.Of course, all of this--the solos, the modes, the story--means nothing without the right soundtrack. Sadly, Rock Band 4 contains the weakest selection of songs of any Rock Band game to date: lesser known tracks from big name artists, songs from smaller acts many of us arent familiar with, and only a handful of genuinely exciting bangers.That doesnt mean the whole games a lost cause, though. Sure, the tracklist looks a little underwhelming at first, but the on-disc songs still provide enough variety to keep repetition at bay for a solid few hours. Plus, I guarantee youll find a few new favorites among the bunch. There are some seriously inspired choices here, Protomen being a prime example. I was consistently pleasantly surprised by the tracks I didnt know beforehand, and when it comes to the classics, I have one word for you: PANAMA. PANAMA-AH.There are some seriously inspired choices here, Protomen being a prime exampleTheres one other factor to consider here as well: DLC. According to Harmonix, youll eventually be able to re-download nearly every song you already own, with over 900 legacy tracks available at launch and roughly 800 more coming in the next few months. Basically, if you own a song, the system will recognize it and let you download the track to your new console for free. Even better, all those classic tracks have been re-worked to include new Rock Band 4 functionality like Freestyle Solos.We were unable to test this functionality because it was not available prior to launch but, suffice it to say a larger song library would dramatically improve Rock Band 4s appeal. If you have a ton of songs languishing on an old account, this is your chance to give them new life and to grow your Rock Band 4 library with hand-picked personal favorites from among the wealth of excellent songs available in Rock Band's robust, feature-rich store. Its disappointing Rock Band 4s on-disc offerings arent stronger, but at least the Rock Band platform remains as strong as ever.As always, Harmonixs authored note tracks prove exceptionally inventive, capitalizing on each songs unique rhythms and arrangements. Even songs I wouldnt necessarily listen to in real life ended up being a blast to play. The various difficulty levels felt well balanced, rarely dragging into boredom or spiking into impossibility. I even experimented with the always challenging Breakneck Speed option, which accelerates note tracks to a comically fast pace.Rock Band 4s new hardware looks and feels almost identical to previous models, so theres no need to upgrade if your old gear is still collecting dust in a closet. According to Harmonix, a substantial majority of that old equipment will be compatible with Rock Band 4. We were unable able to gather all the gear and test it ourselves, but Mad Catz created a chart that outlines exactly what they believe works and doesnt work.Backwards-compatibility would make Rock Band 4 more accessible and appealing, but if you sold off all your instruments years ago, dont worry: the new gear works just fine. Every now and then the game failed to register a note I swear I hit, but it wasnt frequent or consistent enough to really raise any red flags.Rock Band 4 recaptures the unadulterated gratification that made the series such a hit half a decade ago, but mainly because its a relatively unchanged, repackaged Rock Band 2. A lack of content and general stagnation hold this particular iteration of Rock Band back, but new ideas like Freestyle Solos genuinely enhance the core experience, which remains a sincere and joyful celebration of music."}