{"ref": "https://www.gamespot.com/reviews/switchball-review/1900-6184083/", "date": "December 17, 2007", "game_name": "Switchball", "text": "Switchball could have just as easily been titled: ~Physics: The Game.~ This puzzle game essentially mashes Marble Madness and Archer MacLean's Mercury into a single entity. Like those two games, Switchball effectively transforms tricky physics into hours of entertaining gameplay. The tech demo nature is palpable, but developer Atomic Elbow has crafted a legitimate game out of that technology; one with some diabolically ingenious puzzles, to boot. It's a ball that you switch. Hence: Switchball. In Switchball, you control a small sphere that, using various stations scattered throughout each stage, can transform into new forms, each with unique abilities. For instance, there's the heavy ball, which can be used to move around heavier objects and knock over pieces of the scenery that would otherwise stand pat. There's the air ball, which is extremely light, easily traversing any steep incline and floating for short periods of time when you encounter specific air stations. Then, there's the power ball, which can use power stations to charge up with the ability to jump, dash, and even magnetize. All of the game's puzzle designs play into the abilities of each ball. If you see a patch of cloth you need to bounce off of, make sure you're not the heavy ball, or you'll tear right through it (or, in some cases, make sure you are the heavy ball to tear right through). Maybe you'll encounter a magnet nearby that you must use to pull yourself across a gap, but it's currently switched off, and the switch is up on a nearby ledge. In that situation, there may be a power station you can use to dash or jump up to the ledge, then once you've hit the switch, you can take on the magnetism ability and pull yourself across. These are just some standard examples of the types of scenarios you might encounter throughout the game. Early on, they aren't quite this involved, but late in the game, they become extremely complicated and require some serious problem-solving skill to tackle. And yet, as labyrinthine as the game can get, it doesn't often feel cheap or frustrating. These puzzles are most often satisfying in the way that puzzles should be--the satisfaction that comes from feeling smart after solving a particularly daunting challenge. In some situations, satisfaction is replaced by relief, in that sort of, ~I never want to do that again,~ kind of way, and usually, this is due to one of the game's few mechanical faults. Whether it is the camera that periodically can't be placed somewhere even remotely useful for the task at hand or the occasional bouts of irritation that stem from a few control mechanics (swinging magnets that just won't swing right, ledges so narrow you'll roll off a dozen times before finally, magically making it over), there are times when the game's mechanics conspire against you instead of helping you out, but these aren't frequent enough to be a constant problem. The single-player portion of the game contains 30 different levels spread across five different worlds. Most of those worlds are simple background changes (one is snowy, one is filled with lava, one is in the sky, and so on), and regardless of where you are, all the basic puzzle set pieces still look the same. Still, while the aesthetics don't change much, this is still a fairly good-looking game and runs pretty well (except for some of the ugly screen tearing that pops up now and again). A few mechanical frustrations aside, the gameplay can be exceptionally satisfying. There is also a multiplayer component, albeit a slightly limited one. There are four multiplayer maps, each of which can be played either in a race for up to eight players or cooperatively for two players. The co-op play is definitely the more interesting of the two, with some really well-designed challenges that require some quick cooperative thinking to best. The race mode essentially devolves into a lot of bumping between each player as each tries to get to the end, but that methodology certainly isn't devoid of amusement. For 800 points ($10), Switchball offers up a good chunk of addictive and clever content that's sure to please puzzle fans. The challenge level is well balanced, the mechanics are solid, and the multiplayer adds a nice chunk of replay value beyond the standard single-player stages. It's not a game for the easily frustrated or impatient, but anyone else would do well to give it a look."}