{"ref": "https://www.gamespot.com/reviews/madden-nfl-2004-review/1900-6073501/", "date": "August 15, 2003", "game_name": "Madden NFL 2004", "text": "EA Sports has a reputation for halfheartedly updating its sports games from year to year. Though the new console and PC versions of Madden NFL 2004 are exceptional games that buck this trend, the GBA version isn't quite as impressive. It's a game that will please diehard football fans even though it doesn't significantly improve upon Madden NFL 2003. Regardless, Madden NFL 2004 is the portable football game of choice this season, because it's the only football game on the GBA that allows you to carry all 32 NFL teams through an entire season, trade players with other teams in the league, and use the create-a-player mode to insert your own fantasy players onto teams. You can throw to up to four receivers on passing plays. Other than a few minor tweaks to gameplay, the most significant addition to Madden NFL 2004 is GameCube connectivity. If you connect the game to the GameCube version using Nintendo's proprietary cable, you can transfer player cards between the two versions and unlock additional cheats and teams on the GameCube. For the most part, Madden NFL 2004 plays just like Madden NFL 2003. The playbook includes more than 150 offensive and defensive plays, and the CPU-controlled players on both sides stick to their assigned marks and cover their designated opponents fairly well. The iconic passing system allows you to toss the ball to up to four receivers using the GBA's button array. Audible plays are still an entertaining, albeit optional, facet of gameplay. Basically, you can assign a series of plays to each button before the game starts. During the game, if you change your mind and decide you don't want to run a play from the playbook, you can push a button before the snap and instruct your players to execute one of the audibles instead. From fatigue and injuries, to false starts and roughing calls, every nuance of football is present. If you played Madden NFL 2003 to death, you'll notice that the CPU in this iteration is a little more balanced on defense. Passing plays still work more often than not, but the CPU is more likely to deflect the ball after one or two successful gains using similar plays. Interceptions are also much more common when the score is lopsided. On the running side of things, it's still fairly tough to push a receiver through the middle of the line--but not nearly as impossible as it was in last year's game. Holes on the sides tend to open up if you choose the right plays. Despite the fleshed-out AI, it's pretty easy to run up the score on the CPU on the standard difficulty setting. After you play a game or two to get used to the controls, you're probably going to switch to the harder setting just to keep games close. The playbook has multiple subsections. In all, there are more than 150 different plays. Visually, Madden 2004 looks fine--like the old Super NES and Genesis Madden games actually. Even so, the animation isn't as smooth as the GBA is capable of. The various types of grass on each field are realistic, and the players have a wide variety of actions, but they don't transition between the actions very well. The top-down perspective provides a good view of the field, even when you consider that the camera has been zoomed closer this year to make players and the ball larger and easier to see. Every time a play ends, portraits of John Madden or Al Michaels pop up to recap what just happened. You can view an instant replay by pressing the start button from the playbook screen. One of the nice things about the GBA is that it can reproduce speech clips with decent clarity. Madden and Michaels throw in a few good one-liners from time to time, such as ~Looks like he got in the way of a freight train!~ and ~I heard their helmets collide way up here!~ Otherwise, the sound effects and music are average for this sort of game: a typical assortment of slaps and grunts. Overall, Madden NFL 2004 does a nice job of stuffing the Madden experience into a go-anywhere format. There are a number of things that EA Sports could have improved upon from the previous game, but this series is still far and away the best for anyone looking for a traditional football game on Nintendo's popular handheld."}