{"ref": "https://www.gamespot.com/reviews/nhl-2001-review/1900-2636838/", "date": "May 17, 2006", "game_name": "NHL 2001", "text": "Hockey is a sport that inherently translates well into the realm of video games. The sport's breakneck pace and aggressive nature make for a level of excitement that, when done right, is hard to beat when it comes to sports games. EA has been doing hockey right for years, and one thing you have always been able to count on is buying the latest version of NHL with confidence. It seems EA has delivered again, as NHL 2001 is one hockey game that's hard to stop playing. NHL 2001 gives you just about every gameplay option any hockey-head could dream up. Along with the full roster of teams from last year, the expansion Minnesota Wild and Columbus Bluejackets make their first bids for video game stardom. You have the option of playing head-to-head exhibition games, a full season, the Stanley Cup Playoffs, a shoot-out, or a fully customizable tournament in four different difficulty settings. You may also create a player, sign him, and then develop him into a cup-hoisting powerhouse. Taking a cue from its Madden franchise, EA has included a challenge mode, where achieving certain criteria - such as four goals in a game or shutting out the opposing team - awards you with points to use to beef up your created player. The controls in NHL 2001 are sweet simplicity. Anyone can pick up the Dual Shock and skate, shoot, pass, and score. But for those who like to spend those quiet hours mastering the finer techniques, NHL 2001 does not disappoint. In addition to the usual one-timers and spin-o-ramas, you may load up for a cannon shot, perform a super deke, or control the trajectory and speed of your shots with the utmost accuracy. On the defensive side, you may send an opposing player to the bench for some freeze spray with a super check, take one for the team by laying down to block a shot, or poke-check the puck away for one of your teammates to scarf up. The more hours you log playing the game, the more the thinking behind its control scheme becomes apparent. The NHL series is better known for its gameplay than its graphics, but NHL 2001's graphics are nothing to scoff at. The way the players skate and wind up for slap shots is very convincing, and there are so many different ways that they react to hits and changes in the game that it's almost impossible not to get pulled in. The play flies along with nary a stutter, almost to the point of excess. Things happen so fast that the camera sometimes gets left behind in an ice spray - blocking the view of the player trying to score from top to bottom. Ever since NHL 98's bothersome frame rates, EA has gradually dropped the number of polygons per player each year in an attempt to free up some valuable PlayStation processing power. NHL 2001 is no exception. The players appear even more squared off than last year, and some of their animations seem to have lost a few frames. In return, EA has rewarded players with a game that's lightning fast and plays like a dream.Like other EA Sports games of this pedigree, NHL 2001 is full of nuances that set it apart from the competition. If you rush the opposing goalie after he's trapped or gloved the puck, his teammates will come to his rescue and scrum about the net. Banging a shot off the post causes the goalie to jerk his head wildly looking for the ricochet. If you pressure the computer while it's trying to bring the puck out of its own end, it will skate behind the net and reset the play. If you manage to mount a solid rush of offense or bust someone up with a check, your momentum meter grows. If your meter reaches its threshold, your next chance almost always results in a goal. This is a new feature to the NHL series, and while the idea behind the momentum meter is true to game of hockey, it sometimes spirals out of control. Once you get a couple of quick goals, they just keep on coming. What you end up with is a snowball effect that results in many a lopsided score. Fortunately, the feature can be disabled. Fighting has returned again this year, but the winner is normally determined by the player who mashes the buttons with the most fervor. On the auditory front, NHL 2001 shines. The crowd reactions to the on-ice events are deadly accurate and trigger right on cue. The play-by-play does its best to keep up with the action, and ESPN's Bill Clement barks out the color commentary, which provides an air of authenticity to the game. Like most sports video games, however, extended periods of play give way to the same snippets repeating constantly. While it's not the most beautiful hockey video game, NHL 2001 comes through where it counts - the gameplay. The amount of control you have over your players, coupled with the game's tight execution, guarantees that this is one game you can pull out of closet years from now and still enjoy playing. NHL 2001 makes all the right compromises on its way to becoming the PlayStation's best hockey game. Like other EA Sports games of this pedigree, NHL 2001 is full of nuances that set it apart from the competition. If you rush the opposing goalie after he's trapped or gloved the puck, his teammates will come to his rescue and scrum about the net. Banging a shot off the post causes the goalie to jerk his head wildly looking for the ricochet. If you pressure the computer while it's trying to bring the puck out of its own end, it will skate behind the net and reset the play. If you manage to mount a solid rush of offense or bust someone up with a check, your momentum meter grows. If your meter reaches its threshold, your next chance almost always results in a goal. This is a new feature to the NHL series, and while the idea behind the momentum meter is true to game of hockey, it sometimes spirals out of control. Once you get a couple of quick goals, they just keep on coming. What you end up with is a snowball effect that results in many a lopsided score. Fortunately, the feature can be disabled. Fighting has returned again this year, but the winner is normally determined by the player who mashes the buttons with the most fervor. On the auditory front, NHL 2001 shines. The crowd reactions to the on-ice events are deadly accurate and trigger right on cue. The play-by-play does its best to keep up with the action, and ESPN's Bill Clement barks out the color commentary, which provides an air of authenticity to the game. Like most sports video games, however, extended periods of play give way to the same snippets repeating constantly. While it's not the most beautiful hockey video game, NHL 2001 comes through where it counts - the gameplay. The amount of control you have over your players, coupled with the game's tight execution, guarantees that this is one game you can pull out of closet years from now and still enjoy playing. NHL 2001 makes all the right compromises on its way to becoming the PlayStation's best hockey game."}