{"ref": "https://www.gamespot.com/reviews/serious-sam-the-second-encounter-review/1900-2845606/", "date": "May 17, 2006", "game_name": "Serious Sam: The Second Encounter", "text": "Serious Sam: The First Encounter was last year's most surprising first-person shooter. Featuring a never-before-seen 3D engine that could render literally hundreds of weird, dangerous creatures simultaneously within huge environments, Serious Sam offered no shortage of pure arcade action. For good measure, the game included an extremely enjoyable cooperative multiplayer mode and a lot of good-natured humor, and the whole thing retailed for less than $20. The game was a steal, as well as a promising breakthrough for the previously unheard of Croatian developer, Croteam. Now, nearly a year after the release of the original, Croteam is back with the predictably named sequel. And while it uses the same engine, stars the same tough-as-nails wisecracking hero, and once again requires you to fight through thousands of monsters before you reach the final climactic battle, Serious Sam: The Second Encounter is not necessarily what you'd otherwise expect. It's not just more of the same--this creative, fun, extremely intense shooter is even better than the original. The Second Encounter picks up moments after the first game left off. Having traveled back in time to ancient Egypt and defeated countless minions of the nefarious Mental, Sam ~Serious~ Stone has managed to hop aboard an alien spaceship that will take him straight to the heart of his archrival's domain. Unfortunately, it unceremoniously crash-lands right back on Earth, this time in South America. Like the first game, Serious Sam: The Second Encounter isn't heavy on plot. The context is really just there as an excuse to set the game within a number of colorful, exotic levels and to fill these with monsters, traps, weapons, and power-ups. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Serious Sam: The Second Encounter Video Review While all the levels in the first game were set in Egypt, which made them start to look pretty redundant after a while, The Second Encounter features three distinctive environments--Mesoamerica, ancient Babylon, and medieval Eastern Europe. All three are just gorgeous. Serious Sam's 3D engine creates what are certainly the most gigantic levels found in any shooter, and within each level in The Second Encounter, there's a lot of variety as you travel through both indoor and outdoor areas, both above and beneath the surface of the earth. The game plays like the original, though the improved level design makes the action more enjoyable than before. As Sam, you can run much faster and jump higher than just about any other shooter protagonist. You can carry more than a dozen high-powered weapons and plenty of ammo for each of them. You can take a tremendous amount of punishment, and you'll find power-ups to replenish both your health and your ammo reserves throughout each level. Sam's so strong that any other first-person shooter would be a total cinch for him. But in this one, he'll be up against an impressive variety--and a truly staggering number--of fast, vicious, deadly oddball monsters. The Second Encounter provides a daunting challenge at its default difficulty setting, though it offers easier settings suitable for the faint of heart as well as tougher settings suitable for masochists. The most obvious additions in The Second Encounter are three new weapons you can use, more than half a dozen new monsters to fight (as well as three exciting, new boss battles spread out over the game), and four new power-ups. The most precious of these power-ups works like a smart bomb from classic arcade games--when things get really bad, you can use one to frag every monster in your vicinity, no questions asked. Meanwhile, the new monsters in The Second Encounter round out the roster quite nicely. The best of them is a chainsaw-wielding maniac sporting nothing but overalls and a jack-o'-lantern instead of a head. Make no mistake: All your favorite, and least favorite, monsters from the first game can be found in force throughout The Second Encounter, and some have a few new tricks. Old and new foes alike will attack you with reckless abandon, and as you frantically fight back, you'll feel elation mixed with anxiety--a real adrenaline rush. By mixing in the old with the new creatures and presenting all of them in a wide variety of new situations, the game succeeds in feeling substantially different from the original. That is, even if you felt exhausted by the conclusion of The First Encounter (and how could you not?), you'll be anything but bored while fighting your way through the new game. The first game had a ton of weapons in it, but these new additions are great--there's the chainsaw, which usually isn't practical but is still fun to use (especially in multiplayer deathmatch) and a great throwback to the weapon from id Software's classic, Doom. The other two new weapons you simply cannot live without--your high-tech flamethrower becomes the single best crowd-control tool for close-quarters battles. It's visually stunning as it instantly causes everything--monsters and scenery--to ignite in flames and then to blacken to a crisp. Not to be outdone, the new high-powered sniper rifle is equally useful--its 8X magnifying scope lets you draw a bead on enemies from miles away and deliver an instant-hit, often fatal, high-caliber round. Since some monsters will bombard you from long range, the sniper rifle becomes essential for taking them out.Though the original Serious Sam has a reputation for being a mindless action game, The Second Encounter has some real depth that lurks just beneath the game's lighthearted, frenetic surface. Serious Sam: The Second Encounter expects you to be constantly prepared to face off against dozens of different types of monsters, many of which demand different types of tactics. Fortunately, each weapon in your arsenal is well balanced and useful, whether against certain types of foes or in certain situations. You'll use a majority of your weapons during each level. Some battles seem to stretch on indefinitely, never letting up, only escalating and never giving you the opportunity to conveniently reach over to quick-save. Even if you do know what's in store around the next corner, defeating wave after wave of monsters is never an easy task, as your reflexes, your precision, and your endurance will constantly be put to the test. You'll also need to keep your ears open as each enemy makes distinctive noises, and you'll often hear your foes before you see them. Time seems to stand still during some of the more hectic battles in The Second Encounter--it'll seem like you're fighting an endless onslaught of foes, burning up all your ammo for all your weapons in the process. Suddenly it's over, and you'll hear yourself exhale as though you were holding your breath for all those minutes. The action in Serious Sam: The Second Encounter is some of the best you'll find in any shooter to date. Calling it mindless is selling it way too short. New foes like this one are tough and fun to fight. If the action itself weren't incentive enough, Serious Sam: The Second Encounter is loaded with unique secrets--there are tons of them in every level, and discovering them yields absurd, funny, and always rewarding results. This is a genuinely funny game with a truly inspired sense of humor, and you'll know it not just because of the secrets, but also because of some of Sam's amusingly self-conscious one-liners. ~I hate running backwards,~ he exclaims on more than one occasion as you're desperately trying to fend off a tidal wave of monsters, fleeing for dear life. The Second Encounter has a lot of really great, unusual sequences in it. In an early scene, a bridge crumbles beneath your feet and you start bouncing uncontrollably on an elastic floor. Sure enough, the room fills with monsters, including those ubiquitous beheaded kamikazes. As you're spraying the whole room with your flamethrower, bouncing around on a giant trampoline along with countless monsters, hearing the cacophony of the kamikazes' screams pitching higher and lower due to the Doppler effect, you'll be downright stupefied. The whole game goes on like this--it's pure sensory overload and incredible fun, and while some parts are especially good, every level is rife with them. As you play, you'll be struck by the sense that the designers must have really had a lot of fun making the game. The production values in The Second Encounter are even better than those in the original game. Each enormous level is colorful and boasts plenty of beautifully detailed high-resolution textures everywhere. Ambient lighting is used to excellent effect, and in general, the game's special effects are top-notch. The three boss monsters you'll face all look great too, and as in the first game, even when you're fighting hundreds of enemies at once, the frame rate remains smooth. The Second Encounter also sounds great--the game features an excellent, effective musical score. Each level has its own music that fits perfectly with the pacing and the theme, grows more intense when you're fighting, and cools down when the coast is clear. The sound effects themselves, many of which are recycled from the first game, are as good as ever. Like the original, The Second Encounter uses audio as a vitally important part of the gameplay. The Second Encounter is even better than the first. The single-player mode of Serious Sam: The Second Encounter is easily worth the low price of admission all by itself. But just like the original, the game comes packaged with a complete multiplayer mode, plus mod-making tools for anyone inclined to use them. Once again, the cooperative mode steals the show. You can easily find multiplayer servers running co-op Serious Sam and jump right in with friends or strangers to fight even more enemies than usual. It's tremendously entertaining, and The Second Encounter's bigger, better levels make it even better than the co-op mode in the first game. The Second Encounter sports an excellent deathmatch mode too. Croteam provides eight different deathmatch maps (obviously much smaller than the game's standard levels), but The Second Encounter also comes packaged with Seriously Warped Deathmatch, a mod featuring more than 20 deathmatch levels, variable gameplay modes including capture the flag, new weapons, and more. There are already plenty of Internet servers running all these different multiplayer variations. Serious Sam: The Second Encounter is one of a very small percentage of games that can be wholeheartedly recommended to everyone, especially because it retails for less than $20, just like its predecessor. While there were many outstanding shooters in the last year, most of them had to be recommended with a caveat or two: ~This is a much better game in multiplayer,~ ~This game isn't as realistic as you might expect,~ and so on. In contrast, there are only pleasant surprises to be found in Serious Sam: The Second Encounter. Regardless of what sort of action you prefer--whether you like it lighthearted or visceral, whether you want to play solo or with others, or whether you want a quick fix or a game with real lasting value--you'll find virtually everything there is to like about action gaming in the stunning sequel to Serious Sam.Though the original Serious Sam has a reputation for being a mindless action game, The Second Encounter has some real depth that lurks just beneath the game's lighthearted, frenetic surface. Serious Sam: The Second Encounter expects you to be constantly prepared to face off against dozens of different types of monsters, many of which demand different types of tactics. Fortunately, each weapon in your arsenal is well balanced and useful, whether against certain types of foes or in certain situations. You'll use a majority of your weapons during each level. Some battles seem to stretch on indefinitely, never letting up, only escalating and never giving you the opportunity to conveniently reach over to quick-save. Even if you do know what's in store around the next corner, defeating wave after wave of monsters is never an easy task, as your reflexes, your precision, and your endurance will constantly be put to the test. You'll also need to keep your ears open as each enemy makes distinctive noises, and you'll often hear your foes before you see them. Time seems to stand still during some of the more hectic battles in The Second Encounter--it'll seem like you're fighting an endless onslaught of foes, burning up all your ammo for all your weapons in the process. Suddenly it's over, and you'll hear yourself exhale as though you were holding your breath for all those minutes. The action in Serious Sam: The Second Encounter is some of the best you'll find in any shooter to date. Calling it mindless is selling it way too short. If the action itself weren't incentive enough, Serious Sam: The Second Encounter is loaded with unique secrets--there are tons of them in every level, and discovering them yields absurd, funny, and always rewarding results. This is a genuinely funny game with a truly inspired sense of humor, and you'll know it not just because of the secrets, but also because of some of Sam's amusingly self-conscious one-liners. ~I hate running backwards,~ he exclaims on more than one occasion as you're desperately trying to fend off a tidal wave of monsters, fleeing for dear life. The Second Encounter has a lot of really great, unusual sequences in it. In an early scene, a bridge crumbles beneath your feet and you start bouncing uncontrollably on an elastic floor. Sure enough, the room fills with monsters, including those ubiquitous beheaded kamikazes. As you're spraying the whole room with your flamethrower, bouncing around on a giant trampoline along with countless monsters, hearing the cacophony of the kamikazes' screams pitching higher and lower due to the Doppler effect, you'll be downright stupefied. The whole game goes on like this--it's pure sensory overload and incredible fun, and while some parts are especially good, every level is rife with them. As you play, you'll be struck by the sense that the designers must have really had a lot of fun making the game. The production values in The Second Encounter are even better than those in the original game. Each enormous level is colorful and boasts plenty of beautifully detailed high-resolution textures everywhere. Ambient lighting is used to excellent effect, and in general, the game's special effects are top-notch. The three boss monsters you'll face all look great too, and as in the first game, even when you're fighting hundreds of enemies at once, the frame rate remains smooth. The Second Encounter also sounds great--the game features an excellent, effective musical score. Each level has its own music that fits perfectly with the pacing and the theme, grows more intense when you're fighting, and cools down when the coast is clear. The sound effects themselves, many of which are recycled from the first game, are as good as ever. Like the original, The Second Encounter uses audio as a vitally important part of the gameplay. The single-player mode of Serious Sam: The Second Encounter is easily worth the low price of admission all by itself. But just like the original, the game comes packaged with a complete multiplayer mode, plus mod-making tools for anyone inclined to use them. Once again, the cooperative mode steals the show. You can easily find multiplayer servers running co-op Serious Sam and jump right in with friends or strangers to fight even more enemies than usual. It's tremendously entertaining, and The Second Encounter's bigger, better levels make it even better than the co-op mode in the first game. The Second Encounter sports an excellent deathmatch mode too. Croteam provides eight different deathmatch maps (obviously much smaller than the game's standard levels), but The Second Encounter also comes packaged with Seriously Warped Deathmatch, a mod featuring more than 20 deathmatch levels, variable gameplay modes including capture the flag, new weapons, and more. There are already plenty of Internet servers running all these different multiplayer variations. Serious Sam: The Second Encounter is one of a very small percentage of games that can be wholeheartedly recommended to everyone, especially because it retails for less than $20, just like its predecessor. While there were many outstanding shooters in the last year, most of them had to be recommended with a caveat or two: ~This is a much better game in multiplayer,~ ~This game isn't as realistic as you might expect,~ and so on. In contrast, there are only pleasant surprises to be found in Serious Sam: The Second Encounter. Regardless of what sort of action you prefer--whether you like it lighthearted or visceral, whether you want to play solo or with others, or whether you want a quick fix or a game with real lasting value--you'll find virtually everything there is to like about action gaming in the stunning sequel to Serious Sam."}