{"ref": "https://www.gamespot.com/reviews/darksiders-ii-review/1900-6400372/", "date": "October 7, 2013", "game_name": "Darksiders II", "text": "The Wii U version of Darksiders II may suffer from some additional technical hitches, but this vast adventure is so absorbing, it's still easy to lose yourself in its oppressive world. And what a world it is, with architecture so sharp that every spire threatens to puncture the heavens and make them bleed. You needn't worry about too many confusing story details if you missed out on the original Darksiders: this sequel's narrative isn't so much about plot as it is about place and tone. And that tone is what sets Darksiders II apart. The skies are ominous, the armor is impossibly chunky, and the game's star--Death himself--speaks with gravelly, somber tones, save a few moments of sarcastic humor that betray his agitation. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Video Review - Dark Siders II This port isn't the finest way to lose yourself in Darksiders II's fantastical universe, however. On the bright side, the Wii U release includes Argul's Tomb, downloadable content delivered for the earlier versions. The tomb isn't Darksiders at its best, with a protracted shooting segment lasting too long to be fun. (Though to be fair, you could take the melee approach in spite of all the guns scattered around.) This content can be accessed at any time, and provides you with the abilities necessary to complete it if you haven't unlocked them in the main campaign. But significantly, the game suffers from some frame rate problems, distracting loading times as you move through the overworld, and longer loading times when opening doors than in the other iterations. Technical hiccups aside, Wii U owners get the same experience as everyone else, though with some gamepad tweaks: menus are accessible on the touch screen, special abilities can be (but don't have to be) activated by touching their icons, and tilting the pad changes your direction when swimming and pushing boulders. As for the basic mechanics, an icy opening introduces you to combat and movement. In traditional action game style, you slash away at clawed creatures with primary and secondary weapons. You run along walls and jump across beams like a devilish Prince of Persia. There are also role-playing elements: your enemies drop coins, armor, and weapons. You can don equipment, sell it to a merchant, or sacrifice it to level up rare possessed weapons, which you can customize at certain thresholds. It's a good thing Death is half naked in this dungeon--it must be a hundred degrees in there! Darksiders II is clearly reminiscent of other games you have probably played. It recalls the structure of The Legend of Zelda, the parkour of Prince of Persia, and even the dimension-bending puzzles of Portal. Yet in spite of how heavily it wears its inspirations, Darksiders II establishes an identity all its own. The game's large scope and thoughtful pace allow you to breathe between battles, and each new mechanic has time to settle in before a new one is introduced. The leisurely sense of pace is obvious in the first level, where you can take in the frozen chasms beneath you, and enjoy the slick motion mechanics that have you defying gravity in heady flights of fancy. If you played the original Darksiders, you might miss the up-front barrage of action at first, but Darksiders II is more about adventure than constant onslaught, though there are plenty of battles waiting ahead. As you ride your steed to the first main dungeon, you can relish the green fields of the first of multiple major regions, and simply enjoy the act of being. If you want, you can explore some of the surrounding ruins, where treasure chests protect valuable pauldrons and cloaks. Or you can slash up the baddies that roam the land, even from atop your horse. But once you get into the dungeons, Darksiders II becomes special--more cerebral than your average action game, and more energetic than your average exploration game. This big boy looks intimidating, but show a little patience, and he's annihilated before you can break a sweat. As expected, each dungeon requires that you puzzle out how to get from one point to the next. At first, this involves scaling walls, throwing the naturally occurring bombs you stumble upon, and pulling a few levers. Then, you get a phantom grapple hook that allows you to swing from glowing hooks and extend your wall runs. Later, you split yourself in three, petrifying your main form and using two doppelgangers to stand on switches and move platforms. Ultimately, you fire portals to travel across great ravines and even through time itself--and these are hardly the extent of the tools you use to make progress through Darksiders II's clever self-contained puzzles. Where the original Darksiders' puzzles could drag, Darksiders II's are more expertly crafted, each one a little more difficult than the last--but never too difficult as to be frustrating. The learning curve is silky smooth, and once you reach the final dungeons, there are some outstanding moments when puzzling out a solution makes you feel remarkably smart. It's a tough balance for a developer to maintain: making environmental puzzles feel challenging without unduly impeding the player's steady progress. Darksiders II's dungeons get it just right, giving you enough hints through camera angles and other subtle cues, and then trusting you to work out the solution. The only cue you can't rely on too heavily is your crow, Dust, who is supposed to point out your final destination should you get stuck, but might lead you astray, or flutter high above you and then teleport back. Sometimes, when a giant demon explodes, it's best to just bask in the glow. Fortunately, you don't often need Dust's services, given each dungeon's natural progression. Nor do you need to worry about using a spinning blade to play connect-the-bombs, which was part of Darksiders' less appealing puzzles. You also needn't constantly fiddle with the interface to switch between items and abilities, which is just as well, considering the sluggish performance of the main-screen menus. Given the sheer breadth of abilities, you still do a bit of controller micromanagement; you might need to switch between an ability and your revolver often in a particular level, for instance, though the related ability wheel is easily accessed with the D-pad. Nevertheless, managing your abilities and equipment is smoother than it was in the original. Combat skills are divided into two trees and allow for powerful offensive moves (a vicious spin attack, for instance) or for summoning creatures to assist in battle (a murder of crows, perhaps). The action is largely satisfying: it's smooth and responsive under the fingers and is colorful and bloody onscreen. Death's primary scythes make for fluid combat, while his secondary weapon provides rhythmic diversity. That weapon might be a huge axe that sets wraiths on fire, or superfast gauntlets with an electric charge. Your grapple and your gun can also be valuable assets when certain foes join the fray, and battles are at their best when you confront multiple creatures with diverse attack patterns. The shooting sequences get a little tedious; thankfully, you can drop the gun and hack away if you get bored. That isn't to say that Darksiders II's combat is all that challenging on normal difficulty, though it is energetic. You can occasionally perform a single-button finishing move if you whittle an enemy's health down enough, though the option isn't overly frequent, and some equipment can raise your chances. Provided you have enough health potions (and there's no reason you shouldn't, given your easy wealth), you won't often feel in danger. Even certain bosses can be conquered in a single go, in contrast with Darksiders' more challenging endeavors. That's a particularly disappointing development when you reach the final monstrosity and realize it's an anticlimactic pushover. The challenge is hit-and-miss, but the thrills are unmistakable. Easy as many are, the bosses are often enormous in scale, and some require the use of your special abilities--your grapple, for instance--to succeed. With only a couple of exceptions, Darksiders II doesn't use quick-time events to elicit excitement: the torrents of blood that spew across the screen are the direct result of your combos and volcanic fury. The biggest battles are pure power fantasy, reinforced by Death's ever-more-threatening armor and ever-more-potent weapons. Even the way Death opens doors and chests is part of this power trip, with the horseman summoning ghostly arms to perform such lowly labors. Remember, kids: don't use steroids. The Wii U version's execution problems are a disappointment considering the overall quality of Death's dark adventure. Yet the frame rate jitters and loading hitches don't greatly detract from the bloody appeal of Darksiders II's combat, nor the gradually evolving complexity of its enjoyable dungeons. Death may have plenty of contempt for the denizens of this burning world, but the game he appears in tempts you ever onward with its promise of new abilities to exploit and new paths to explore. Where the original Darksiders' puzzles could drag, Darksiders II's are more expertly crafted, each one a little more difficult than the last--but never too difficult as to be frustrating. The learning curve is silky smooth, and once you reach the final dungeons, there are some outstanding moments when puzzling out a solution makes you feel remarkably smart. It's a tough balance for a developer to maintain: making environmental puzzles feel challenging without unduly impeding the player's steady progress. Darksiders II's dungeons get it just right, giving you enough hints through camera angles and other subtle cues, and then trusting you to work out the solution. The only cue you can't rely on too heavily is your crow, Dust, who is supposed to point out your final destination should you get stuck, but might lead you astray, or flutter high above you and then teleport back. Sometimes, when a giant demon explodes, it's best to just bask in the glow. Fortunately, you don't often need Dust's services, given each dungeon's natural progression. Nor do you need to worry about using a spinning blade to play connect-the-bombs, which was part of Darksiders' less appealing puzzles. You also needn't constantly fiddle with the interface to switch between items and abilities, which is just as well, considering the sluggish performance of the main-screen menus. Given the sheer breadth of abilities, you still do a bit of controller micromanagement; you might need to switch between an ability and your revolver often in a particular level, for instance, though the related ability wheel is easily accessed with the D-pad. Nevertheless, managing your abilities and equipment is smoother than it was in the original. Combat skills are divided into two trees and allow for powerful offensive moves (a vicious spin attack, for instance) or for summoning creatures to assist in battle (a murder of crows, perhaps). The action is largely satisfying: it's smooth and responsive under the fingers and is colorful and bloody onscreen. Death's primary scythes make for fluid combat, while his secondary weapon provides rhythmic diversity. That weapon might be a huge axe that sets wraiths on fire, or superfast gauntlets with an electric charge. Your grapple and your gun can also be valuable assets when certain foes join the fray, and battles are at their best when you confront multiple creatures with diverse attack patterns. The shooting sequences get a little tedious; thankfully, you can drop the gun and hack away if you get bored. That isn't to say that Darksiders II's combat is all that challenging on normal difficulty, though it is energetic. You can occasionally perform a single-button finishing move if you whittle an enemy's health down enough, though the option isn't overly frequent, and some equipment can raise your chances. Provided you have enough health potions (and there's no reason you shouldn't, given your easy wealth), you won't often feel in danger. Even certain bosses can be conquered in a single go, in contrast with Darksiders' more challenging endeavors. That's a particularly disappointing development when you reach the final monstrosity and realize it's an anticlimactic pushover. The challenge is hit-and-miss, but the thrills are unmistakable. Easy as many are, the bosses are often enormous in scale, and some require the use of your special abilities--your grapple, for instance--to succeed. With only a couple of exceptions, Darksiders II doesn't use quick-time events to elicit excitement: the torrents of blood that spew across the screen are the direct result of your combos and volcanic fury. The biggest battles are pure power fantasy, reinforced by Death's ever-more-threatening armor and ever-more-potent weapons. Even the way Death opens doors and chests is part of this power trip, with the horseman summoning ghostly arms to perform such lowly labors. Remember, kids: don't use steroids. The Wii U version's execution problems are a disappointment considering the overall quality of Death's dark adventure. Yet the frame rate jitters and loading hitches don't greatly detract from the bloody appeal of Darksiders II's combat, nor the gradually evolving complexity of its enjoyable dungeons. Death may have plenty of contempt for the denizens of this burning world, but the game he appears in tempts you ever onward with its promise of new abilities to exploit and new paths to explore."}