{"ref": "https://www.gamespot.com/reviews/college-hoops-2k8-review/1900-6184433/", "date": "January 8, 2008", "game_name": "College Hoops 2K8", "text": "Though its NBA franchise gets plenty of attention, 2K Sports' College Hoops series has flown under the radar of many sports fans, despite being quite good in its own right. Like 2K7 before it, College Hoops 2K8 isn't tremendously different from its predecessor, but it's the small changes, like new gameplay mechanics and an improved legacy mode, that make this year's installment great and one sure to please college basketball fanatics. The sixth man will help you pull out those close victories. There are plenty of ways to stay busy in College Hoops 2K8. You can create your own chants, players, schools, sound clips, and highlight reels, and new this year, you can create your own plays. The interface isn't particularly easy to use and requires a lot of sometimes frustrating trial and error. But you get out of it what you put in, and all the work pays off when you've created the perfect play. If you're the sharing type you can share all this content online, or you can hoard all your knowledge and use it to crush your foes. There are more ways to play the game than ever. You can set up your own conference tournaments and even the NCAA Championship in the Pontiac Tournament mode, or take part in the College Hoops Classic. Coach mode lets you call the plays while your players execute them, and new this year are the All-American training challenge and tutorial modes. Here you'll go through a number of drills against well-known former college ballers designed to teach you the ins and outs of 2K8's somewhat convoluted control scheme. Going through this training mode still doesn't make the new passing control any less complex, since you still have to decide what type of pass you want to throw by pressing a shoulder button and then a face button. But it does a good job of introducing the controls--an area in which previous 2K Sports games have been deficient.~ Online play lives up to the high standards of other 2K sports efforts. A real-time ticker shows the latest sports news, and the online front page shows college hoops news as well as upcoming games and current scores. Once online, you can take part in a quick match, custom match, or unranked play against a buddy, or join or start tournaments and even leagues. Our online games suffered from a bit of lag here and there as well as the occasional jerk that does nothing but shoot three-pointers with the same guy over and over, but for the most part the games ran fine and were enjoyable. All of these modes are solid, but college basketball fans tend to head straight to legacy mode to lead their favorite team or alma mater to glory. Once again, you can play an open legacy, where you're able to take over the school of your choosing, or career legacy, where you start at a small school and either lead the school to prominence or do well enough to use the school as a stepping stone to a better coaching gig. The mode is quite similar to last year's, right down to the cumbersome menus. Frustrating menus aside, there's a lot to legacy mode--even more than last year. Amateur Basketball Leagues (high school teams) have been added, giving you unprecedented access to scouting high school players before the season starts--you can even play their games. The recruiting process has seen some changes, but they're mostly cosmetic and have little impact on how you actually recruit. You'll find some players that have at least a passing interest in your school and then request game tape, watch them in person, e-mail or call them, set up campus visits, go to their homes, and hopefully get them to sign a letter of intent. This process is fun for a few weeks, but it quickly gets repetitive and there's no way to automate the process. An odd glitch causes some talented junior college players to not get recruited by anyone, thereby letting them fall right into your lap. This makes it easier to get good players if you're at a lousy school, but it sort of defeats the whole purpose of such a detailed recruiting process. On the court 2K8 plays almost exactly the same as 2K7, with a few exceptions. Lock-on D makes its way over from NBA 2K8 and allows you to really shut down an opposing player. But as in NBA 2K8, this feature can be abused, as it's possible for slow centers to pretty much blanket smaller, faster point guards. Also new this year is the sixth man advantage, which lets your team play better when the home crowd is going nuts. It doesn't seem to affect gameplay much, but it's a lot of fun to get the meter full and throw down a big dunk just to see and hear the crowd go wild. The rest of the gameplay feels just like last year's: The controls are responsive and allow for great freedom once you learn them, and there are a wide variety of animations. The game just feels good. But there are some negatives, too: Players don't move much on offense unless you call a play, there are too many missed layups, point guards go over and back too often, and there's a bit too much goaltending. Small nagging issues aside, though, the gameplay is very strong. And so is the presentation. Cheerleaders and mascots patrol the sidelines, fans go berserk in the stands, and coaches stalk the bench yelling at their players. As was the case last year, the arenas look fantastic, and even the ones that aren't exact replicas of real courts look quite good. Players move realistically, and the transition from one move to the next is typically smooth. The one area in which player models are lacking is their heads, which just aren't up to the same level of quality as in NBA 2K8. As great as the gameplay is, players still miss too many layups. Amazingly, College Hoops 2K8 sounds better than it looks and plays. Vern Lundquist and Bill Rafferty do a nice job calling the action and are able to get excited about the play on the court without going overboard. Bonnie Bernstein is out as sideline reporter, replaced by Tracy Wolfson, who actually delivers some worthwhile information about what the coaches are doing. Most impressive, however, are the sounds of the games. The fans are lively and deliver some great chants even if you don't take the time to create your own. The number of real fight songs is staggering; even smaller schools are well represented with accurate songs from their respective marching bands. Toss in Dolby Digital support and you've got one fantastic-sounding game. While there isn't a whole lot of fresh content in College Hoops 2K8, what is new almost universally makes this version of the game better than last year's. It plays better, there's more to do, and even the presentation, which was already great, has been improved. If you're not a diehard hoops fan and you're still happy with last year's game you could probably take a pass on 2K8, but if you love college basketball and you want the latest and greatest, College Hoops 2K8 won't let you down."}