{"ref": "https://www.gamespot.com/reviews/control-ultimate-edition-cloud-version-review/1900-6417600/", "date": "November 3, 2020", "game_name": "Control", "text": "Control was among the best games of 2019--and one of the most taxing in terms of graphical fidelity. Even on the powerful PlayStation 4 Pro and Xbox One X, Control would sometimes hitch, drop frames, and struggle as protagonist Jesse Faden telekinetically hucked objects at Hiss enemies or smashed through the offices of the Federal Bureau of Control, flinging papers and wood splinters in all directions in her wake.The high graphical requirements seem like they would preclude Control from ever running on the Nintendo Switch, a less powerful game console than its Sony and Microsoft counterparts. But Nintendo and publisher 505 Games found a workaround: streaming. The release of Control: Ultimate Edition leverages cloud technology to make the game available on Nintendo's little hybrid console, and the results are surprisingly strong. With a stable internet connection (my Switch said I was getting around 30 mbps down and 8.2 mbps up over Wi-Fi), Control plays very well on the Switch, and if you haven't had a chance to check out Remedy Entertainment's killer title, this is a good way to do so.If you're not familiar, Control imbues you with supernatural powers and sets you loose in the Oldest House, a brutalist concrete office building with shifting walls and seemingly impossible scale. It houses the FBC, a government agency dedicated to the study, protection, and containment of ~paranatural~ objects and entities. If it's supernatural, weird, or possibly involved with other dimensions, it's the Bureau's purview--but the building has been invaded by a spectral force called the Hiss that has possessed many of the Bureau's employees and turned them against the survivors.As Peter Brown wrote in GameSpot's Control review last year, ~If you've played past works from Remedy Games, you will instantly recognize the studio's footprint. Control's story plays with grim truths and strange themes. Everything is a serious matter, except when it isn't and a dark sense of humor creeps in to offer a momentary respite--which, yes, includes plenty of FMV shorts. The combat system is designed for you to be equal parts agile and destructive, bearing a notable resemblance to the studio's Microsoft exclusive, Quantum Break. Combat aside, that game felt like a step removed from what Remedy does best. Control feels like Remedy has found its footing again.~ Like Jesse, the Hiss fight with a mix of guns and telekinetic powers, requiring you to utilize a host of supernatural capabilities--like levitation, throwing objects with your mind, creating shields out of random debris, and even turning the hiss to your side. Combat is always a fun, frenetic combination of gunplay with your shape-changing Service Weapon and deploying your otherworldly abilities, while constantly staying on the move so you're never overwhelmed.On Switch, Control comes in two varieties: Enhanced Performance mode and Enhanced Graphics mode. The former favors frame rate over powerful graphical accouterments like ray tracing in the latter, but in practice, both modes capture Control's impressive visuals without too much in the way of graphical differences. Especially in handheld mode, where the Switch's small screen helps to hide its lower resolution capabilities, the graphics tend to be pretty gorgeous, even if you aren't getting the tier of lighting effects, hair detail, and reflections that the Enhanced Graphics mode can deliver.The Graphics mode looks pretty great, though, both when the Switch is handheld and when it's docked. The biggest weakness of the Switch's graphical fidelity is that, through a combination of either the limitations of streaming or the lower resolution of the Switch in general, the game can look a bit hazier than it does in other versions. It's a minor weakness, however--Control still turns out multiple beautiful images and high-fidelity faces, especially in motion, in either handheld mode or TV mode. Graphics mode enjoys some prettier lighting effects and other touches, but while Performance mode is definitely something of a graphical downgrade, it's a fairly small one. Whether in handheld or on a TV, both modes of Control are pretty.Frame rate is the place where the two Control modes seem to differ the most. In Enhanced Graphics, frame rate is already a bit lower than the Enhanced Performance mode, and routinely dipped even further, both handheld and on a TV. The lower frame rate never hurt my ability to play the game, even during Control's tough and hectic firefights, but the slowdown was noticeable when the game worked to render lots of explosions, enemies, gunfire, and other effects. It's worth noting that frame rate issues are probably the biggest problem the game faces among both modes. This is likely a function of streaming, where dropped frames are a fairly common problem--but then again, similar frame rate drops sometimes plague the PS4, Xbox One, and PC versions of Control because of its graphical demands. In any event, Performance mode doesn't solve the frame rate troubles, but in playing through about four hours of the game, the hitching or slowdowns were always minor and never affected my ability to actually enjoy the game. Similarly, playing handheld in Performance mode, sounds were also slightly delayed, lagging a bit behind the pull of a trigger or the movement of a face. As with other problems, it was noticeable but didn't ruin the experience or make playing difficult.Control is a tough game on any platform, requiring fast reflexes and aiming against enemies who will pummel you relentlessly. The Switch's Joy-Cons don't always feel up to the task, though. The thumbsticks are notoriously a bit loose and floaty, and precise aiming with firearms can get frustrating. The problem is mitigated by what feels like an increased aim assist that functions very well here--I never felt like playing on Switch was notably tougher than other platforms, and in Control's difficult battles, Jesse is just as quick and formidable a paranatural combatant as on PC or PS4. But the few moments when you need to be precise with your shots can be frustrating as you swing your targeting reticle too far over a target and have to try to track back, especially as enemies are unloading on you with machine guns, rockets, and floating chunks of concrete.While it does have some minor issues, Control streaming on Switch is impressive. Even a few rooms away from my Wi-Fi router, the game always handled well, and I was able to fight through battle after battle with the Hiss with nothing more bothering me than a less-than-optimum frame rate. This isn't the most beautiful-looking version of Control, but it's also nothing to sneer at, and it's boosted by the opportunity to play such a big, technically demanding game on a handheld system. Venturing through the Oldest House on the Switch mostly feels great, and this is a solid, convenient way to experience one of 2019's best--along with all its DLC--if you haven't already."}