{"ref": "https://www.gamespot.com/reviews/wolcen-lords-of-mayhem-review/1900-6417418/", "date": "March 9, 2020", "game_name": "Wolcen: Lords of Mayhem", "text": "There's an air of familiarity to Wolcen: Lords of Mayhem. It's an action role-playing game with heavy inspiration from Diablo and Path of Exile, from their high-fantasy gothic settings to their destiny-bound protagonists and plethora of abilities to dabble in. Wolcen wears its influences on its sleeve, and while it makes changes to their established foundations, it stumbles so many times along the way that it just feels lost by the end of it.Wolcen's opening obscures some of its more novel ideas, with a stale and predictable narrative that makes it feel generic. You play as one of three siblings born and bred for battle, but cast out from the only family you know when an unknown power awakens within you. It's a plot filled to the brim with exposition, riddled with vaguely explained fantasy jargon and worldbuilding that never clicks into place. It's easy to forget about entirely after the first few hours, with only the stilted dialogue and awkward cutscenes reminding you of the uninteresting events dressing Wolcen's main draw.The setting, however, doesn't fall prey to the same oppressive medieval look. Gloomy caverns and bright, colorful forests are equally impressive backdrops for the equally outstanding visual details buried within them. The variation across Wolcen's three acts is impressive too, as it whisks you between the opulent, gold-laden halls of an ancient sacred ground to the blood-drenched trenches of a chaotic battlefield.Wolcen's most substantial twists begin with character creation. Outside of basic cosmetic options, your biggest choice from the outset is what weapon you want to start with. You aren't asked which role you want to embody or what classic archetype you want to build towards. Wolcen won't directly ask you that at any point, letting you craft whatever type of class you choose--in theory, at least.Each weapon you equip changes your basic attack, but youre free to pair that up with any combination of abilities. Abilities are picked up like loot, letting you learn spells, melee flurries, and ranged barrages and swap between them easily as any other piece of gear. Each of these abilities feeds off of either willpower or rage, which form two halves of the same resource meter. Consuming one generally fills the other, while basic attacks from your selected weapon will typically recharge one or the other in tandem. Your ability to pair together different abilities is restricted by how well they synergize within this tug-of-war between willpower and rage. Its entirely possible to open a skirmish with spells that build rage, which you then use for abilities that both require it and build willpower in return, letting you seesaw between the two disciplines.In the early stages I was able to create a mage-warrior combination, slashing foes with a single-handed sword while raining down ice on them with magical abilities. Each attack looks spectacular in motion; bright red glyphs accompany fire spells, with burning embers left in their wake glistening off the dark and dreary caves I found myself exploring the game's opening hours. As you start layering abilities onto one another the screen is filled with a gorgeous cacophony of colors, not only communicating important information to you visually but coating the surroundings in stunning effects and reactions to the destruction you're causing.Wolcen lets you redefine your combat approach at any time, too, which allowed me to eventually skew towards a full mage in the later stages of the campaign. Although theres a resource cost attached to rebuilding your character's attributes and selected skills, its low enough to facilitate experimentation a handful of times during the campaign. Its especially handy when your build just isnt working, letting you start from scratch and build in an entirely new direction if you want.You define your character's attributes by spending points on four talent archetypes--Ferocity for damage, Toughness for health, Agility for speed, and Wisdom for ailment effectiveness. You also have access to a daunting, large skill tree with rotating tiers, allowing you to create paths through it that combine talents from different disciplines. It's an extraordinary amount of agency that can have you spending hours poring over damage percentages and critical chances, carving out a path for you to follow enroute to your perfect build.The problem isn't with the freedom Wolcen affords you, but rather just how broken much of it is. The large skill tree features hundreds of nodes that make incremental differences to your character, but a large portion of them don't function as described. Abilities that are meant to cohesively work together don't react in the manner you've carefully planned out, making whole builds entirely useless. It's not only frustrating to waste the time pursuing a dead end, but it also limits the number of viable ways you can create a character entirely.You'd be forgiven for not noticing this immediately, given how unbalanced Wolcen's difficulty is. Its three long chapters are mostly padded out with extended linear sections where you're shuffled from enemy encounter to the next, with each one hardly more challenging than the last. It's satisfying at first to walk into a large group of enemies and watch them explode into a mess of gory guts, but the power fantasy wears thin when you're so rarely asked to adjust your strategy to keep up with any semblance of challenge.A sense of difficulty isn't entirely absent, though. Each of Wolcen's chapters features numerous boss fights, most of which increase the difficulty so drastically it often feels like a different game. While you were effortlessly mowing through waves of enemies just seconds before, most boss encounters give you confined spaces to work within and foes that can kill you instantly with single attacks, sending you back to the start of their multi-phased fights. These encounters forced me to entirely rework my character around them specifically, tossing aside strategies that worked just fine moments before. Overcoming these boss fights can be rewarding, with a similar sense of relief to that found in Soulsborne games. But they are continuously jarring to take on, especially when all the action surrounding them doesnt match up to the same level of difficulty. It makes the long sections between boss fights feel routine and dull in comparison.Exciting loot drops could alleviate the doldrums of making your way through Wolcen's long and protracted chapters, but free-form class system means that you will be inundated with scores of weapons, armor pieces, and more that are either too worthless to equip or don't apply to your playstyle at all. In the same vein as its skills, many of Wolcen's rarer items also drop with attributes and magical abilities that don't match the class type they belong to. You can only tell what type of item and what rarity it is at a glance, which can help you skip over many items you don't consider useful without diving into your inventory. Yet despite this it's incredibly easy to fill up your limited backpack space far too frequently, forcing you to pause the action constantly to sort it out. All this useless loot makes small excursions to side dungeons less interesting too, and you end up focusing on how repetitive their objectives are and how similar their overall structures start becoming.All of Wolcen's shortcomings are further exacerbated by an abundance of technical issues, which can range from irksome to game-breaking.All of Wolcen's shortcomings are further exacerbated by an abundance of technical issues, which can range from irksome to game-breaking. In my 20-hour campaign, I had instances where my character would refuse to walk straight, hilariously choosing to moonwalk through stages instead. This was accompanied by numerous instances of missing sound effects, enemies disappearing through level geometry, broken hit boxes preventing me from attacking, and subtitles that frequently mistook my female mage for a male protagonist. These didn't halt my progress, but various other bugs made the already challenging boss encounters all the more infuriating. The worst of them cropped up during Wolcen's final climatic encounter, which contains an incredibly easy to trigger bug that prevented me from doing damage to the boss and forcing me to restart the multi-staged fight, ending my time with Wolcen in considerable anger.This is to say nothing of Wolcen's online mode, which is kept separate from the single-player one--meaning you have to maintain two separate characters, and there's no way to transfer your character from one mode to the other. Although online play lets you cooperatively tackle the game with friends, it introduces a whole host of other issues ranging from irritating lag on inputs to disappearing gear and progression wipes.Wolcen: Lords of Mayhem is frustrating to play for the majority of its campaign, leaving you with little motivation to dedicate more time to endgame events. There are many technical issues that can be fixed to alleviate some of this frustration, but it's the deeper ingrained problems with difficulty balance and character build viability that keep Wolcen from fulfilling its enticing promise of a free-form ARPG. It has all the elements in place to become another engrossing time sink, but it doesn't execute well enough on any of them to make it worthwhile."}