{"ref": "https://www.gamespot.com/reviews/wdl-thunder-tanks-review/1900-2673001/", "date": "January 9, 2001", "game_name": "World Destruction League: Thunder Tanks", "text": "There's no question, WDL: Thunder Tanks for the PlayStation was a bona fide disaster. A tired premise, poor control, muddy graphics, and abhorrent sound made it a game to stay far, far away from. The PS2 version of WDL, however, is an entirely different story. The game's premise is hardly groundbreaking for the genre - it's the typically dystopian future, where the World Destruction League is the most popular form of entertainment. The league travels all over the world, and the matches involve combatants laying waste to each other and anything else that might happen to be around. It's an idea and a style that has been all but worn out, but as with most vehicular combat games, the premise isn't terribly important. WDL offers a handful of variations on the standard vehicular combat gameplay modes. The tournament mode is a single-player game where you choose your warrior and fight through a myriad of opponents across the globe. This mode is proficient, and it may keep you mildly entertained for a while, but it doesn't compare to the multiplayer games, which is where WDL truly excels. There are the self-explanatory deathmatch and capture the flag modes, as well as frenzy, a capture the flag variation where flags randomly appear throughout the arena and players must grab the flags and return them to their bases. The domination mode is the game's most original. There are several tank generators scattered throughout the arena, and your goal is to take control of all of them. A tank generator, while under your control, generates tank drones that will attack your opponents or any drones your opponents may have control of. All the modes are playable with up to four players, with a little help from the PS2 Multitap, save for the tournament mode. The ability to change the number of kills or flags necessary to end a round and the presence of drones is something that was sorely missing in the PlayStation version, and when combined with the variety of multiplayer modes, they make WDL one of the few worthwhile excuses to own a PS2 Multitap. The PlayStation version of WDL: Thunder Tanks suffered from a general sensation of repetition - that is, all of the arenas looked essentially the same. WDL for the PS2, however, incinerates that mold with not only better designed levels, but also with a greater number of them to boot. In an interesting turn, WDL does not hit New York, Los Angeles, and Tokyo as you might expect, instead opting for more obscure or entirely fictional cities, such as 3DO's hometown of Redwood City, Calif., and the lost city of Atlantis. In keeping with the variety motif, each tank in WDL has its own distinctive look and feel. While there are definitely certain tanks you might favor, they are all balanced fairly well. The Dragonfly and the FLP-E have the ability to strafe around their enemies, though this speed and mobility comes at the cost of their resilience. The Wraith has the ability to cloak itself, but not when moving at full speed. The tanks are accentuated by the presence of power-ups in the arena, and the power-ups available in WDL are some of the most innovative seen in a vehicular combat game yet. There are the standard power-ups, such as turbo, shield, missiles, grenades, mines, and so on. Then there are some more unusual power-ups, like the artillery and satellite strike, which, when activated, put you in a zoomed-out view of the arena and allow you to target a spot on the map and bombard it with either a barrage of missiles or a focused ion cannon blast. The guided missile power-up puts you in a third-person perspective behind the missile and allows you to steer it through the arena with a fair amount of accuracy. WDL all comes together in a nice graphical package. While the game doesn't present anything really mind-blowing, its textures are clean and varied, lighting and particle effects are put to good use throughout, and only when in the thick of a heated four-player deathmatch does it show the slightest hint of slowdown. The game's aural package is almost as nice, though the constant and grating color commentary takes away from the nuances of the grinding tank treads and blasting cannon fire. WDL: Thunder Tanks is a good entry into the vehicular combat genre. The deviations it makes are interesting, though not terribly groundbreaking. But what it lacks in innovation, it makes up for with a solid multiplayer game with respectable graphics, a healthy helping of variety, and plenty of replay value."}