{"ref": "https://www.gamespot.com/reviews/madden-nfl-23-review-high-upside/1900-6417946/", "date": "August 24, 2022", "game_name": "Madden NFL 23", "text": "Every August, a new Madden launches with some major marketing buzzword attached. It makes for easy back-of-the-box material and quickly answers the question: ~What's new in Madden this year?~ These named features often fail to live up to their proper noun naming conventions, but in Madden NFL 23, that's not the case. This year's buzzword-y feature, Fieldsense, emcompasses several other features under its wide umbrella, with all of them relating to how it feels to actually play and move around on the field. In that regard, Madden 23 is a clear step up. But several other aspects of the game, including both returning issues and new problems, keep the game from achieving its full potential at launch.Fieldsense is not one feature but the name for a collection of on-field improvements. Among them, the biggest and most enjoyable leap forward is the new Skill-Based Passing system. This is meant to remove some of Madden's attribute-driven outcomes and transfer decisiveness to the player. On the field, this is done by giving players a new throwing meter and shadowed target area that appears as the ball is being thrown. It allows players to pinpoint directly where they want the ball to go like never before--a bit like fielding in MLB The Show. Excitingly, this feature lives up to its promise, allowing skilled players to skewer defenses and hit gaps in coverage like never before in Madden history.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Madden NFL 23 Video ReviewA wonky tutorial does this feature no good, making practice best done in a live setting. After a few quarters or games with Skill-Based Passing enabled, it becomes blatantly obvious that going back to the old system, while an option in Madden 23, is never a good idea. It allows the QB to keep a pass in front of the cornerback on a crossing route, hit back-shoulder fades in the end zone, and sneak into the space between two defenders' zones in ways that, in years past, almost always resulted in turnovers. I'd go so far as to say Madden 23 is worth playing for this feature alone, because throwing the football, something you'll do 15-40 times per game, has never felt so good.Fieldsense also applies to other aspects of the game, including new tackling mechanics that remove some canned animations and give defense a more physics-based feeling. This too feels better than before, though it does result in a number of silly looking tackles as a result, with more ragdoll-like players sometimes performing ridiculous falls. The game is better off with this style, however, as the game's old shoestring tackles and pre-canned wrap-ups where you knew whether or not you got the first down before the play ended are fewer and farther between.Making cuts with ball carriers also feels better, allowing a skilled player to ease off the sprint button at the line, making a great cut through the hole, then taking off and leaving defenders out of position. This applies to kick and punt returns too, which are suddenly not rote 25-yard returns anymore. In my first week with the game, I've seen a more realistic array of outcomes on returns. Many get past--even well past--the 25 now, including some touchdowns, which previously felt almost impossible despite that being unrealistic.The pass rush in Madden 23 is amped up too, in a way that helps contain the franchise's legacy issues of a QB having an entire lunch break's worth of time to throw the ball. Pressure can be generated with just three or four rushers if they're good at their jobs, helping bring Madden closer to reality, where QBs tend to only have about two or three seconds at most to get rid of the ball. AI pass rushers also smartly disengage blockers when the player QB applies the sprint button with the QB, signaling that they intend to scramble out of the pocket.Collectively, this helps tame some of Madden's most meta-defining, but unrealistic, play calls, where a shifty passer would wiggle over to the sideline, avoid the rush entirely, and wait for a wideout to beat a defender on a comeback route five or more seconds into the play.Madden 23 is a better on-field experience without a doubt. But some of its modes and peripheral features are still lacking in such a way that feels unfathomable for one of the world's biggest video games based on one of the world's biggest brands. In Madden Ultimate Team (MUT), new Field Passes have been added, which act as free battle passes that reward you more consistently game by game, week by week. These are meant to appease the crowd that decries MUT as pay-to-win, and while they are helpful, the mode is still a mess of microtransactions, where one player can grind for 40 hours to buy a card another player can just purchase at will.On top of that, though the Field Pass rewards come often, they're dispersed unevenly and only after frustration. You might need to play one more game to complete a challenge and earn your next Field Pass reward, but at the end of the game, there's currently a guaranteed delay in when you actually get the reward. Worse, the reward screens are constantly buggy, revealing no information--the game will often just briefly sit at a purple-pink background screen as though you're given pertinent information, but it winds up being more like a loading screen, never showing you what you actually unlocked until minutes or even full games later.The Field Pass system is meant to copy MLB The Show's Programs, which are cited as the reason its card-collecting mode is the best in the sports gaming world. I can see how Madden's Field Passes could be similarly game-changing. Earning more frequent and better cards for free is certainly a welcome feature--this is the first year I plan to put hours into MUT after review season, so it must be doing something right. But right now, broken menus that share no information and rewards that come too late take what was meant to be gaming's latest overt Skinner scheme and turns it into a jumbled mess of systems that feel undercooked.In Franchise mode, the big changes come during the offseason, where more control over college scouting and more chaos in free agency are meant to deepen the experience. Free agents will now consider more than just money and team prestige when deciding where to sign. They'll also take into account factors such as where they'd be on the depth chart, whether a team plays close to their hometown, whether the team has an elite QB, and whether or not the state takes income taxes. These are fun additives, but mostly just reimagine the previous system, expanding a free agent's list of relevant factors from about three to about eight.The scouting improvements are more crucial, including the way your automated scouts now reveal pertinent information to each prospect. You don't really need to know a receiver's tackling ability, but after last year's big scouting update introduced this system, such unnecessary data were exactly what you'd get sometimes. This year, scouts will hone in on the key attributes that matter to each position you're looking at, giving you a better sense of each player come draft day.Franchise does still struggle from two things introduced last year, though. For one, the pre-game team scouting report is still liable to share totally wrong information. In theory, knowing a team's tendencies to, for example, throw it short, middle, or deep gives you an excellent advantage. In practice, it doesn't matter when the game is so often displaying false data, even as it seems designed to only base its numbers on the previous game--which itself is an issue, as gameplans can vary wildly in a league full of more human players than AI.The frustrating M-Factor system returns and seems once more to be unable to be turned off. Last year, M-Factors were introduced as a way to gamify momentum swings by giving teams boosts like better ball security, or negatively affecting the opponent's ability to call hot routes. Unlike X-Factors, which do well to simulate the way elite players can take over a game, M-Factors are usually arcadey messes that have no real-world counterparts. In a series striving for authenticity, it's odd that this unrealistic feature returns as an untouchable element to games, especially since Franchise mode can be so customizable in other ways.In the story-heavy Face of the Franchise mode, EA Tiburon continues to feel directionless. Ever since the unintentionally goofy Longshot storyline was introduced in Madden 18, the team has struggled to deliver a story mode worth playing. Seeking to rival NBA 2K's much better MyPlayer mode, the last few years have taken a more laissez-faire approach, giving players story snippets but not putting them on rails like Longshot did. The result is, once more, forgettable. This time, the premise has you signing a one-year ~prove it~ deal after your rookie contract's team option wasn't picked up. It's a novel way to start the story, since they so often focus on rising stars or injury-hampered rookies. But in the end, there's just not enough here to justify the mode's inclusion.The end goal is to join Madden's 99 Club, which you can do in just a few seasons and without much story at all. In my first instance of the story mode, I was strangely traded just two games into the preseason, which seemed to reduce the amount of story content I even saw after that, causing me to start over so I could know if this was a scripted moment. Apparently, it wasn't, which left me wondering why it's possible. It's routinely felt like Face of the Franchise is developed to merely check a box, and this annual half-measure brings nothing of value to the mode in Madden 23, unless you really like running up the stat line with your custom player every single week. In that case, you're better off playing Franchise unless you also enjoy playing The Yard, which is once again affected directly by your player's skill increases in the story mode.The Yard itself returns virtually unchanged. It's a short-game 6v6 arcade-like mode for players who don't enjoy the sim-heavy aspects and want something a bit closer to the long-dormant NFL Street. Since it was added two years ago, The Yard has dwindled in importance quickly, seemingly because much of the community ignores it. Therefore, Madden 23's instance of the mode feeds this endless cycle. Players ignore it, so it receives fewer meaningful updates, which, in turn, causes players to ignore it more, and so on. The Yard is at least present though, whereas Superstar KO has virtually been removed from the experience, diluted down to a limited-time mode that plays quite like it within MUT but seems destined to rotate in and out of the game all year.In total, this year's Madden is a lot like the past decade of Madden in that it suffers a number of self-inflicted wounds and returns features that were unpopular in years prior. However, it's crucial to reiterate, on the field, Madden genuinely feels great for the first time in a long time. The changes to Franchise are helpful but not revolutionary, the MUT Field Pass system is promising but janky at launch, and other modes are largely forgettable. This would all present quite a lackluster view of the game if not for the impressive on-field leap it performs. The improvements on gameday make Madden 23 a flawed game, but clearly an improvement in the series' most important way: the actual playing of football."}