{"ref": "https://www.gamespot.com/reviews/minecraft-playstation-3-edition-review/1900-6415767/", "date": "May 20, 2014", "game_name": "Minecraft", "text": "Minecraft is a sandbox game like no other. Over the years and across many different platforms, it has proven time and time again that with a spark of imagination and a reliable pickaxe, anything is possible. Its community has produced sprawling cities, landmarks from both real life and fiction, and even entire countries, all re-created using Minecraft's colorful voxel blocks. Since its digital release last December, Minecraft: PlayStation 3 Edition has made strides to catch up to the original PC version, introducing new materials, biomes, and villager trading. While you still can't yet create stained glass or ride horses across a grassy plain, the crux of what makes Minecraft such an absorbing and satisfying experience is right here--though the tightly constrained world may leave you disappointed. At a glance, Minecraft on the PlayStation 3 is nearly identical to its Xbox 360 brethren. In terms of controls, neither version one-ups the other. When 4J Studios ported the game to the Xbox 360 in 2012, it paired the version with sharp, fluid controls. The company has shown the same love toward the PlayStation 3. It takes minutes to get attuned to Minecraft on the DualShock controller, and soon you find yourself punching trees with the best of them. With time, you craft the necessary tools required to tackle twisting mines and dense jungle terrain as you collect precious resources while fighting off temperamental creepers and spider jockeys. Once you get into the swing of things (typically in the form of a sword or pickaxe), it's doubtful the thought of needing a mouse and keyboard to master Minecraft's untamed wilds will ever cross your mind.Also making the transition is the simplified crafting system, which streamlines the building experience. In the crafting menu, you're free to scroll through and examine every item that you can build under the square sun. Items you can craft right away are fully colored; otherwise, they are slightly opaque. This system replaces the more trial-and-error crafting found in the PC version of Minecraft, where you must manually place resources such as iron ingots or stacks of lumber on the three-by-three grid of a crafting table to create an item. If you're coming from the computer version of the game and feel that experimenting with resource placement is an important part of the Minecraft experience, this toned-down style of crafting may not impress you. However, if you're more concerned with jumping into the game and creating the items and structure pieces you want quickly and without having to scour dozens of how-to guides, you will find the more accessible crafting system a blessing. Much like a cave, the crafting in Minecraft is deep and initially daunting, but the game's passive tip system designed for new players is the torch that lights the way through. Getting from a humble structure to a vast fortress is a satisfaction that few games can deliver, but the path there isn't a cakewalk. Thankfully, Minecraft eases you into its expansive world slowly via tooltips that offer hints as you play, offering detailed glimpses into materials, tools, and other assets. The game also includes an in-depth tutorial mode that details the more complicated aspects of Minecraft, including redstone mechanics, enchantments, and potions. The major difference between the PlayStation 3 and Xbox 360 editions is not with gameplay, but with optional cosmetics. And in that regard, the PlayStation 3 is far behind. In Minecraft, you begin your adventure as the iconic blue-jeaned Steve. But what if you want to explore a dark-oak forest as Spider-Man, or Gordon Freeman? Those options are open if you choose to buy the respective downloadable skin packs on the Xbox 360. Additionally, there are skins inspired by popular indie games, and even one based on Marvel's The Avengers. And yet, none of these options are available for the PlayStation 3, though you can purchase a pack featuring console-exclusive skins based on the Uncharted and Killzone series of games, among others. Many of the texture packs, which completely change the look of the game, such as by giving it a flair of fantasy or mimicking the look of Skyrim, are also not yet available (it's not clear if they ever will be). What is most disappointing is that Minecraft: PlayStation 3 Edition takes several steps back compared to the PC version, both in content and performance. Unlike in the PC game, the space in which to build your blocky empire is miniscule (on the computer, the space is virtually ~infinite~). The land on which you begin, which is always randomly generated, is shuttered on four sides by an immense ocean. Teasing the edge of the map rewards you with an invisible wall, and attempting an escape via wooden boat causes your seafaring vessel to despawn, leaving you to humbly swim back to shore. The PC version also sports sharper, cleaner details and a greater view distance. There is also some noticeable lag on the PlayStation 3 during weather effects such as rain or snow. Regardless of the shortcomings, Minecraft on the PlayStation 3 delivers the essential gameplay experience that has made it a household name. You experience a bit of pride when you complete your first shelter, a feeling that increases exponentially as accumulated knowledge and skill result in castles or skyscrapers, or farms or lengthy railways, or all of the above. It all depends on what you want to accomplish in the world set at your feet. You delve into caverns lit by your hand-made torches, while fighting cave-dwelling spiders and bow-wielding skeletons.And despite the danger, you keep going, because you never know what treasures the next mined block will reveal. Just before you decide to return to the surface with your haul, you may stumble upon a vein of gold or rare diamond ore. Clearing a block could unearth an abandoned mine, filled with loot and danger, or a stunning cavern, glowing hot with flowing pools of lava, its ceiling reaching beyond your vision. Minecraft is a constant lesson in persistence, while effortlessly blending the joy of creation and the thrill of danger and exploration to form a game that is instantly accessible and near limitless in potential. Minecraft: PlayStation 3 Edition is a joyous adventure, despite being lighter on content than its other iterations. It offers the freedom to unlock your imagination and design your own unique world, while the included Creative mode lets you build to your heart's content without having to worry about the limitations of resources. Though the smaller world may irk you, Minecraft on the PlayStation 3 supplements the design with a more user-friendly approach, straightforward crafting, and a much easier way to connect to friends via the PlayStation Network. Split-screen multiplayer lets you get together with friends or family to plan group projects from the couch. But whether you choose to tackle the game solo or with others, Minecraft: PlayStation 3 Edition is a rewarding experience that has you coming back again and again, building a personalized world borne of your imagination--one simple block at a time."}