{"ref": "https://www.gamespot.com/reviews/dance-dance-revolution-ultramix-review/1900-6084550/", "date": "November 24, 2003", "game_name": "Dance Dance Revolution Ultramix", "text": "Ever since Konami got into the dance business with the 1999 arcade release of Dance Dance Revolution, the game has remained largely the same. More than 10 separate games have been released, and many of these have come home to the PlayStation and PlayStation 2. A pretty standard set of options has accompanied the games on Sony's consoles, so, though the song list changes from game to game, the end result is roughly the same. Dance Dance Revolution Ultramix is the first time the series has hit the Xbox, and it stands head-and-shoulders above other versions by offering four-player options, online play, and downloadable content. This Xbox installment would have benefited from a slightly easier set of songs to make it less difficult for new players to pick up, but, beyond this caveat, it's the most feature-rich version of Dance Dance Revolution ever. DDR Ultramix contains online play, which is a first for the series. For those of you who are unfamiliar with Konami's long-running rhythm series, Dance Dance Revolution is a game that is played with a flat dance mat that sits on your floor. It has four arrows on it. These arrows correspond to the onscreen action, which consists of arrows that rise to the top of the screen in time with the music. When the rising arrows hit a mark near the top of the screen, that's your cue to step on the proper arrow. It'll take a few hours for most people to really wrap their minds around the concept and to start reading the arrows with enough warning to really play properly. The game's training mode is helpful for those new players who can't seem to pick it up. The game can be played without a dance mat, but that really defeats the purpose. DDR Ultramix has three difficulty settings, and each of the game's 45-plus tracks--which span several different genres of electronic music--has a different step pattern. Of course, some of these are harder than others. So, even on the light setting, you may find a few tracks that are too tough for you at first. As you work your way toward the more challenging songs, the game ramps up to an almost insane level of play. It would have been nice to see Ultramix provide a few of the older Dance Dance Revolution songs, since even the easier songs in this game are more difficult than some of the normal difficulty tracks from the older games in the series. But for that stuff, there's always the downloadable content option. DDR Ultramix is among the first Xbox games to offer premium content downloads, which means there's a price attached to the additions. The going rate for the moment is $5 for a pack of five songs, and one pack is currently available via Xbox Live. Since new games in the series tend not to mess around with the gameplay, each new installment is basically a song disc. So it's great to see an alternate method for getting new songs, and the price seems reasonable. The game's main play mode simply lets you select a difficulty, lets you select a song, and lets you get to stepping. Battle mode is the offline multiplayer mode, and it's playable by up to four people at the same time, provided you can find a room large enough to comfortably use four dance mats. Workout mode lets you enter your weight, and then it keeps track of how many calories you're burning by playing the game. Different options available in this mode, like the ability to set a calorie target for your workout, make this a viable way to keep track of the exercise you're getting while playing the game. Challenge mode gives you specific goals to complete, like getting a string of ~perfects~ in a certain section of a song or finishing a song with a completely full dance gauge. Rounding out the offline modes is edit mode, which lets you create your own step patterns for the game's songs. It would have been a fantastic addition to see edit mode support custom soundtracks--thus effectively allowing you to place your own music into the game--but, unfortunately, this isn't an option. Online, the game takes on the standard option set you'd expect from an Xbox Live game. It lets you choose a quick match, it lets you specify settings for an optimatch, or it lets you create your own game for other dancers to join. The game has a pretty strong rankings area, and it gives you the option of uploading your best offline scores to the scoreboard and lets you take a look at how you stack up against the best Xbox dancers. Graphically, DDR has never really been much to look at. Each game has featured polygonal dancers and, more recently, video clips that play while you dance. Considering how focused players must remain on the arrows, the backgrounds are more for onlookers. So, those of you who like to watch will be pleased to know that DDR Ultramix is the best-looking version of the game to date. That's not to say that the game is the best-looking Xbox game in the world or anything, but it's an improvement over previous entries in the series. The polygonal dancers have been redesigned, and their models and motion-captured dance steps have never looked better. The game only contains a few songs with music videos, but the video quality in them is clean and clear. The game also contains new announcers. The announcers pipe up often during gameplay and talk you through the game's menus. Additionally, they keep you informed of your combo strings and let you know when you're dancing poorly. The voices are new, but they fit the game just fine and aren't annoying in the least. The game also has Dolby Digital 5.1 support, so you'll hear some sound coming out of your rear speakers if you have a compatible sound setup. If you like, the game has a few equalizer and reverb effects options that will make more use of the surround sound so that you can, for example, make the music echo like it's coming from different room sizes. It's a difficult game to figure out, but keep practicing, and you'll get the hang of it in no time. While Dance Dance Revolution Ultramix isn't quite as friendly to new players as it could have been, the new features and options are ones that should be pretty exciting to anyone familiar with the series. Song downloads and online play open up a whole new world of enhancement and competition that none of the previous console releases have contained. So whether you've been playing DDR for four years or you're just now thinking about picking it up, you'll find DDR Ultramix to be a great addition to the Xbox library."}