{"ref": "https://www.gamespot.com/reviews/pacific-fighters-review/1900-6111857/", "date": "October 29, 2004", "game_name": "Oleg Maddox presents: Pacific Fighters", "text": "The Pacific theater of operations in WWII was dominated by aircraft, from the opening air strikes at Pearl Harbor to the closing nuclear bombings of Hiroshima and Nagasaki. Pacific Fighters uses the acclaimed IL-2 Sturmovik engine to simulate this epic conflict, but unfortunately it turns out to be the biggest letdown of the series. Carrier ops add a breath of fresh air to the series. There are more than 60 flyable planes in this package, although most of those are variants of about 20 different airframes. There are a few dozen nonflyable aircraft you'll encounter in missions as well, and because of the setting, most of these planes are instantly recognizable to students of WWII. Finally, you can slip into the cockpits of F4U Corsairs, F6F Hellcats, and F4 Wildcats, along with planes that were included in previous versions of the sim, like P-38s, P-40s, P-39s, and P-51s. A-20 and B-25 bombers, along with SBD Dauntless dive-bombers, round out the American stable of flyable aircraft, meaning it isn't possible to fly torpedo bombers like the TBF/TBM Avenger or TBD Devastator. Other Allied planes you'll be able to fly include British variants of the Corsair, the twin-engine Beaufighter, the Hurricane, the Seafire, and the Spitfire. On the Japanese side, great fighters like the A6M Zero-Sen (Zeke), Ki-43 Hayabusa (Oscar), Ki-61 Hien (Tony), and Ki-84 Hayate (Frank) are included, but other famous fighters like the Ki-27 Type 97 (Nate), twin-engine Ki-45 Toryu (Nick), and N1K1 Shiden (George) are not flyable. The only other flyable Japanese plane is the D3A1 Type 99 (Val) dive-bomber, so there's no way to fly torpedo bombers like the B5N Type 97 (Kate) or B6N Tenzan (Jill), or other dive-bombers like the D4Y2 Suisei (Judy), and the most famous Japanese bomber, the G4M Type 1 (Betty), won't be available either. The developers have promised that several additional flyable planes will be introduced in a patch, as the cockpits were finished when the game shipped and wouldn't fit on the two CDs included in this package. The add-on was not available in time for review, and a third CD should have been included if those assets were truly ready when the game went gold. Newcomers to the series can install the game in stand-alone mode, but it also works as an add-on for those with both IL-2: Forgotten Battles and the Aces Expansion Pack installed. The latter option is the best, as it lets players mix and match planes from all theaters. Players also should know that opting for the stand-alone installation only lets them play in online multiplayer mode with other people who are also using the stand-alone installation option (they can't play online with those who installed this as an add-on). No Pacific air war game would be complete without aircraft carriers, and Pacific Fighters shines in this regard. Several types of carriers from the period are re-created in exquisite detail, and players participating in naval campaigns soon discover that taking off and landing on these behemoths is frequently more difficult than taking on the enemy. Crowded decks during takeoffs leave absolutely no margin for error, especially considering how quickly planes must get up to speed to have any chance of getting airborne before running out of deck. Taking off is a breeze compared to landing, which requires accomplishing several piloting feats that contradict one another. For example, using full flaps keeps your descent angle steep enough that you can easily keep the carrier deck in sight during the landing approach, but that steep angle increases the chance that the plane will bounce during the landing, eliminating any hope of the tailhook catching one of the arresting wires strung across the deck. The alternative is to come in with less flaps at a shallower angle, but that requires maintaining a faster speed, which seriously cuts down on reaction times. It also increases the likelihood that you'll end up making a two-point landing on the front wheels, which is a no-no because the tailhook will be too far off the deck to catch a wire. Bad weather makes landing even dicier, as the carrier pitches and rolls in the high seas. However, it's even worse if the carrier is stationary, because your relative landing speed is much higher than usual. Cockpits are highly detailed and look almost photo-realistic at high resolution. Some of the planes have such dingy canopies that landing in virtual cockpit mode is nearly impossible (although it's possible to raise the virtual seat for a better view), but for those willing to switch to no-cockpit mode, the designers have integrated a crutch that immensely helps during carrier landings. A small icon appears in the middle of the heads-up display that tells players exactly where their plane will end up if it stays on its current path at its current speed. Just line up the icon with the wire you want to catch, adjust the pitch and throttle to keep it in place, and landings become much less difficult. You still need to keep a close eye on your speed and descent rate to avoid bouncing or overshooting the target at the last second, but it's a great aid. The IL-2 series is known for its terrific flight models, and although the majority of the planes included in this package are a blast to fly and exhibit most of their historic strengths and weaknesses, there are some serious problems. Most of the new planes are practically impossible to stall when they are flown at full throttle, even if the stick is jerked all the way back or to the sides. Quick movements like that were enough to induce stalls in previous entries in this series, and players had to really work the stick to turn or loop efficiently without stalling in the process. All of the American naval fighters included in this package can loop indefinitely and turn indefinitely with full stick deflection throughout the entire maneuver. Some of the Japanese planes like the Val and Oscar also exhibit this behavior, as do the heavier American bombers like the A-20 and B-25. Some of these planes, early Corsairs in particular, were notorious for their tricky handling, but in this sim it is possible to yank the stick in any direction until it stops, and you can maintain impossibly long turns and loops without bleeding off a lot of speed, all without worrying about stalling. This may be intentional, or it may be the by-product of having to tweak many of these planes to have terrific low-speed behavior for carrier landings, but it just doesn't feel like the IL-2 of the past. The special effects and water are very realistic, but only if you have some serious hardware. At least the combat is entertaining. The dogfighting artificial intelligence is as good as ever, and participating in a carrier attack is about as tense as simming gets. Dauntless dive-bombers scream down on the target as AI-controlled Avenger pilots lose torpedoes and fighters swarm around looking for prey or protecting their charges. Airfields tend to be littered with targets, including many seaplanes moored at nearby docks (if the base is next to a coastline) and--if you're lucky--rows of hapless fighters trying to struggle their way into the sky to meet your attack. Graphically, this game is unmatched by any air combat simulation currently on the market, including previous entries in the IL-2 series. For the first time, vast expanses of ocean are actually interesting to look at, because with the water effects maxed out, the sun glints realistically off of waves that are generated based on the current weather conditions. Things become even more beautiful once you get to an island, with those waves lapping at the shoreline while the water realistically changes color as the seabed becomes shallower. Aircraft models, skins, and especially cockpits are rendered in excruciating detail that holds up even at the highest resolutions, and the many ship models also look fantastic. With enough computing horsepower it is even possible to turn on 3D sailors that man the guns on the ships, although LSOs (Landing Signal Officers) sadly are not implemented. In combat, with the special effects turned up all the way, everything from the tiniest bullet kicking up a rooster tail to the biggest bomb shredding a destroyer looks breathtaking. The audio hasn't improved much relative to previous versions, with thunderous gunfire offset by the relatively anemic engine noises. Radio chatter changes depending on the country you fly for, and in a realistic touch, some of the early-war Japanese planes don't have radios (historically they were ripped out to decrease weight and extend the ranges of the aircraft, and so the pilots communicated using hand signals). Mountainous island terrain is great to look at and even cooler as a setting for a dogfight, but it poses serious problems for the AI pilots. We started a Beaufighter campaign in New Guinea and couldn't even make it past the first mission because AI-controlled planes continuously slammed into the Owen Stanley Range instead of flying over it. The same thing happened in a Zero campaign during a low-level fighter sweep--the AI simply acted like some small hills didn't exist and smashed into the side of them in a single-file Kamikaze attack. The two medium bombers that are flyable let players man the gunner positions. While many of the dynamic campaign missions we've flown were action-packed, several resulted in no contact with the enemy whatsoever. Even on missions filled with enemies, getting to the fight can take several minutes whether time compression is used or not. This may be realistic, but it makes for boring gameplay and removes much of the value from the dynamic campaigns. Getting the most out of this sim means rolling up your sleeves and creating missions or campaigns using the included editor or just waiting for other fans to do the work for you. There is a lot of community support for this game already, so flying online also keeps things exciting. This is a product that evidently shipped too soon and it badly needs a patch, although it is impossible to know if a mere update can fix all of the issues with the flight models, the dynamic campaign, and the suicidal AI. Until then, this is still the best way to get your PTO air combat fix, but it unfortunately marks the low point in an otherwise excellent series. The IL-2 series is known for its terrific flight models, and although the majority of the planes included in this package are a blast to fly and exhibit most of their historic strengths and weaknesses, there are some serious problems. Most of the new planes are practically impossible to stall when they are flown at full throttle, even if the stick is jerked all the way back or to the sides. Quick movements like that were enough to induce stalls in previous entries in this series, and players had to really work the stick to turn or loop efficiently without stalling in the process. All of the American naval fighters included in this package can loop indefinitely and turn indefinitely with full stick deflection throughout the entire maneuver. Some of the Japanese planes like the Val and Oscar also exhibit this behavior, as do the heavier American bombers like the A-20 and B-25. Some of these planes, early Corsairs in particular, were notorious for their tricky handling, but in this sim it is possible to yank the stick in any direction until it stops, and you can maintain impossibly long turns and loops without bleeding off a lot of speed, all without worrying about stalling. This may be intentional, or it may be the by-product of having to tweak many of these planes to have terrific low-speed behavior for carrier landings, but it just doesn't feel like the IL-2 of the past. The special effects and water are very realistic, but only if you have some serious hardware. At least the combat is entertaining. The dogfighting artificial intelligence is as good as ever, and participating in a carrier attack is about as tense as simming gets. Dauntless dive-bombers scream down on the target as AI-controlled Avenger pilots lose torpedoes and fighters swarm around looking for prey or protecting their charges. Airfields tend to be littered with targets, including many seaplanes moored at nearby docks (if the base is next to a coastline) and--if you're lucky--rows of hapless fighters trying to struggle their way into the sky to meet your attack. Graphically, this game is unmatched by any air combat simulation currently on the market, including previous entries in the IL-2 series. For the first time, vast expanses of ocean are actually interesting to look at, because with the water effects maxed out, the sun glints realistically off of waves that are generated based on the current weather conditions. Things become even more beautiful once you get to an island, with those waves lapping at the shoreline while the water realistically changes color as the seabed becomes shallower. Aircraft models, skins, and especially cockpits are rendered in excruciating detail that holds up even at the highest resolutions, and the many ship models also look fantastic. With enough computing horsepower it is even possible to turn on 3D sailors that man the guns on the ships, although LSOs (Landing Signal Officers) sadly are not implemented. In combat, with the special effects turned up all the way, everything from the tiniest bullet kicking up a rooster tail to the biggest bomb shredding a destroyer looks breathtaking. The audio hasn't improved much relative to previous versions, with thunderous gunfire offset by the relatively anemic engine noises. Radio chatter changes depending on the country you fly for, and in a realistic touch, some of the early-war Japanese planes don't have radios (historically they were ripped out to decrease weight and extend the ranges of the aircraft, and so the pilots communicated using hand signals). Mountainous island terrain is great to look at and even cooler as a setting for a dogfight, but it poses serious problems for the AI pilots. We started a Beaufighter campaign in New Guinea and couldn't even make it past the first mission because AI-controlled planes continuously slammed into the Owen Stanley Range instead of flying over it. The same thing happened in a Zero campaign during a low-level fighter sweep--the AI simply acted like some small hills didn't exist and smashed into the side of them in a single-file Kamikaze attack. The two medium bombers that are flyable let players man the gunner positions. While many of the dynamic campaign missions we've flown were action-packed, several resulted in no contact with the enemy whatsoever. Even on missions filled with enemies, getting to the fight can take several minutes whether time compression is used or not. This may be realistic, but it makes for boring gameplay and removes much of the value from the dynamic campaigns. Getting the most out of this sim means rolling up your sleeves and creating missions or campaigns using the included editor or just waiting for other fans to do the work for you. There is a lot of community support for this game already, so flying online also keeps things exciting. This is a product that evidently shipped too soon and it badly needs a patch, although it is impossible to know if a mere update can fix all of the issues with the flight models, the dynamic campaign, and the suicidal AI. Until then, this is still the best way to get your PTO air combat fix, but it unfortunately marks the low point in an otherwise excellent series."}