{"ref": "https://www.gamespot.com/reviews/ratchet-and-clank-size-matters-review/1900-6166204/", "date": "February 21, 2007", "game_name": "Ratchet & Clank: Size Matters", "text": "Ratchet & Clank was a real breath of fresh air when the first game was released on the PlayStation 2 back in 2002. It combined the movement and action of a platform game with the firepower of a shooter, and the end result felt pretty unique. Over time, the formula shifted around a bit, but the Ratchet & Clank games we're seeing today still fall in line with that same blueprint. Size Matters is the first time the series has appeared on the PlayStation Portable, and it's got just about everything you'd want out of a Ratchet & Clank game, including a good sense of humor, interesting weapons, and sharp level design. Ratchet is a lombax, in case you were wondering. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Ratchet & Clank: Size Matters Video Review At the beginning of this adventure, Ratchet and Clank are on vacation and lounging around, when they're approached by a little girl named Luna, who wants to take some pictures of Ratchet acting heroic. He sets off to bust up some robots and the girl is kidnapped, dropping a device that points the duo toward a mysterious race of tiny creatures. So they're quickly off on their quest to get the girl back, which of course leads to another plot twist, which sets them off in search of something else, and so on and so forth. Without detailing the particulars of the game's plot, all you really need to know going in is that the game's story is good, and it drives the action along quite effectively. That action progresses along mostly linear levels. Ratchet has his full arsenal of attacks from the other games, so he's armed with a large wrench that you can swing or throw, and you earn more and more weapons along the way. The weapons have always been a big part of the series, and the guns you'll find in Size Matters stay true to the legacy of the series, starting with basic laser-pistollike weapons, a rocket launcher, a sniper weapon, acid bombs, little robots that run up and attach to your enemies, and so on. Some of the weapons are more useful than others, though. The concussion gun is the game's shotgun equivalent, but the shots are so spread out that it's practically useless. As you eliminate enemies, the weapons you use gain experience, and when you fill an experience meter, they change into more powerful versions of the same weapon. This means you'll eventually have dual laser pistols, more-damaging rockets, and so on. You can also purchase mods for your weapons in a couple of spots, and this gives a few weapons lock-on targeting or different types of shots. The weapons have always been the star of the show, and they shine just fine on the PSP. In addition to upgrading your weapons, you'll earn more life points as you eliminate enemies, getting you up to a total of 50. You can also collect pieces of armor and swap them out at will. You'll find helmets, gloves, chest pieces, and boots of different types. If you can collect a complete matching set of armor, you'll get a bonus to your wrench attacks, like fire or ice, but some of those armor pieces can be tough to find, so you'll have to search around if you want some of the more advanced sets. The gameplay stays true to the series, giving Ratchet & Clank all of their best moves. Ratchet can double-jump, and with Clank on his back, you can pop up some propellers to slow your descent after a jump. A big part of firing your weapons at enemies in these games has been your ability to strafe back and forth. By default, the game puts strafing controls on the D pad, while the analog stick is used for normal movement. That may take some time to get used to, but in the end, it works out well. The camera controls are on the shoulder buttons, letting you rotate the camera at will. There's another camera option that attempts to stick behind you, but it doesn't work so well. Neither of the camera controls are ideal, but that's really only because every other meaningful game in the series has been on the PS2, where the right analog stick is just fine for camera control. If you're familiar with the rest of the series, you might notice that you're getting hit from the sides and from behind more frequently than you're used to. That's the camera control. While it can occasionally be annoying, it's hard to imagine a better system, given the limitations of the PSP's controls. Getting through Ratchet & Clank: Size Matters will probably take the average player around seven or eight hours, but with more weapons to see, hidden titanium bolts to find, and side quests, like hoverboard races and space shooting, to master, there's more there for the completist to play with. On top of that, the game has a four-player multiplayer mode that can be played locally or over the Internet. There are a handful of different game types, including basic deathmatch and other, more objective-based modes, and the online section of the game has handy little perks like buddy lists, scoreboards, and so on. The shooting-based gameplay found in the multiplayer works just fine, but R&C has always been at its best when it mixes the shooting with the platforming, and as a pure shooter, it's a bit lackluster. Graphically, Size Matters just about matches the PS2 games in quality, which is to stay that it looks outstanding for a PSP game. The game cuts away to prerendered scenes for story sequences, which is occasionally jarring since the Ratchet you see in cutscenes isn't wearing any armor, while the in-game Ratchet reflects your different armor choices. But the game runs smoothly, and the creatures and environments all have a lot of character. The game also maintains its superb looks while delivering pretty large areas, and the Clank space shooter levels look really cool. You'll notice the level of detail decreasing as you get farther away from something, but that doesn't take away from the game's looks. Clank's a robot, but unlike real robots, he doesn't want to chop you up and use you for fuel. This series has always had a pretty good sense of humor, and it gets that humor across with great voice acting. Ratchet and Clank are both expertly voiced, and all of the bit players you meet along the way are just as good. The voice(s) for Luna are especially great. But the sound effects aren't quite as outstanding. While the game uses a lot of the same effects as the other games in the series, your hits with the wrench don't really make any sort of satisfying ~thump~ sound, so it's sometimes hard to know if you're even hitting your target. Likewise, most enemies with up-close melee attacks don't make much noise when they hit you, meaning your draining life meter is the most obvious indicator that you're getting hit. Overall, though, Ratchet & Clank: Size Matters is a great PSP game that faithfully duplicates the Ratchet & Clank experience in a handheld format. Anyone on the hunt for a rock-solid action game will find plenty to like in Size Matters."}