{"ref": "https://www.gamespot.com/reviews/nba-live-07-review/1900-6159175/", "date": "October 2, 2006", "game_name": "NBA Live 07", "text": "NBA Live 06 showed that EA was capable of bringing the Live experience to the PlayStation Portable, albeit with several missing features. NBA Live 07 on the PSP adds several game modes that were missing from NBA Live 06 and some new PSP-exclusive ones, as well. The new minigames are enjoyable, but the full-court experience is mostly unchanged and still disappointing. 2 ball is one of the better additions to the game this year. Live 06 was short on game options, but there's plenty to keep you busy this year. You can choose from play now, season, dynasty, playoffs, and all-star weekend, as well as a couple of minigames. The NBA all-star weekend includes the rookie challenge game, three-point shoot-out, slam-dunk contest, and of course, the all-star game. The dunk contest is easily the highlight of the weekend mode due to its depth and the large number of great-looking dunks you can perform. The superstar challenge, where you're given game scenarios and asked to reach a certain goal, is back with new tasks. Scoring 81 with Kobe, getting 12 points with Elton Brand in the last 4:25, and putting up eight points for Chauncey Billups in 3:48 are just some of the ways you can unlock bonus highlight videos. There are two new minigames this year, both of which are enjoyable for short periods of time. 2 ball pits you against a CPU-controlled player in a jump-shot contest where the first to reach 50 points is the winner. You have to shoot from inside any of the small circles placed all over the court, and the further you are from the hoop, the more points you'll get. The loose analog controls make it difficult to get your player inside these small circles, though--a big problem since you don't get points unless otherwise. Power-ups randomly appear and will not only give you bonus points, but also reverse your opponent's controls and even freeze the other player in a block of ice. Anything you can do to your opponent can be done back to you, so it's a good idea to quickly snag whatever modifiers pop up. Because it's all about your ability to quickly replicate the D-pad patterns shown onscreen, the other minigame, Handles, is very similar to the juggling minigame found in FIFA 06 on the PSP. As was the case in FIFA, you'll need to turn the PSP sideways to play. From a gameplay standpoint, there's no real reason for doing this, but it looks and feels cool. If you replicate the pattern in the allotted amount of time, the onscreen baller does some fancy dribbling moves that are loosely based on the directions you entered. As you progress, the time you have to enter the direction decreases, and the game ends when you're out of chances. It's entertaining for awhile, but since it's nearly identical to the FIFA minigame, anyone who mastered it there won't likely play it much here. Dynasty mode places you in the role of general manager for the team of your choice. After hiring an assistant coach, assistant, trainer, and scout, it's off to training camp where you set your team's training priorities. Over the course of a season, you can use your staff in a number of ways. Assistant coaches can research rumors and schedule team events, assistants work with players to improve their skills, trainers help players heal faster, and scouts can evaluate talent year-round in preparation for the draft. In addition to monitoring players' happiness and overall team chemistry, you'll need to keep an eye on their fatigue levels to make sure they don't get too worn out over the course of the season. If you're looking to improve your team via a trade, you can do so. Another way to better your squad is through the draft--a process made easier if you keep your scouts busy during the year. Your team can still perform well if you don't keep your staff occupied every day, but putting in the work will yield tangible results. Should you want to take your PlayStation 2 dynasty mode on the go, you can do so via the new PlayStation 2 link support. This lets you transfer your dynasty mode from the PlayStation 2 to the PSP and vice versa, though the two games play so differently that you might not want to risk ruining your precious stats by playing one season on two different platforms. Last year, EA wanted to highlight the difference between the great players and the average Joe by introducing the concept of superstar players, and they've expanded the concept this year. Each superstar player is designated as having one or more superstar abilities--high flyer (Vince Carter), inside scorer (Chris Bosh), outside scorer (Tracy McGrady), playmaker (Steve Nash), power (Shaq), and shooter (Ray Allen). Strong defensive players are designated as inside or outside stoppers and have a wider array of defensive moves available. Changing players' abilities can be done on the fly, but you'll rarely need to do so. The additional levels of freestyle control found on the consoles are absent here and not really missed. Get ready for a lot of dunking. Players with a knack for stepping up in big spots, like Robert Horry, are now designated as ~x-factors.~ If you use an x-factor enough during a game, he'll heat up and earn temporary superstar abilities. This works as advertised, but it's not very useful. If you're in a close game, you've got more important tasks to worry about than making sure Ben Gordon gets his touches. The basic controls are easy to learn, but the more complex moves can be difficult to perform due to some creative button mapping on EA's part. Because there's no right analog stick, freestyle dribble moves are done by pressing the square button. This works fine, but the additional level of control that the right analog stick offers is missed. Touch passes are another new feature, but they don't add much to the package since they're rarely needed. Jump shots, dunks, and layups are all done by pressing circle; the simplification of the consoles' convoluted shooting scheme is much appreciated here. Direct passing is made difficult by having to press the select button to bring up player icons. Fumbling about, trying to find the select button results in lots of inadvertent pauses in the action, since it's located so close to the start button. At least free throws don't use the analog controls that developers seem to be so fond of these days; they use the tried-and-true method of lining up one horizontal and one vertical moving target. Where NBA Live 07 disappoints the most is in the area that really matters: gameplay. Live 07 plays slightly better than last year, but it's still a long ways from being enjoyable over the longer term. Running the fast break is fun, as is finishing with one of the game's great-looking dunks or layups. However, there's little else to enjoy. Superstar freestyle moves are performed by holding the left shoulder button and pressing a face button. The moves are easy enough, and while some are more useful than others, they add a lot of style and pizzazz to the game. As they were last year, the superstar moves are still too powerful, and there's little incentive to do anything other than dunk every time you head down the court. Should you get tired of dunking and want to run a specific play, you can call one up via the D pad. CPU-controlled players will collapse into the lane to clog your path to the basket, occasionally forcing you to take a jumper, but your team isn't quite as adept at stopping players driving to the hoop. Even with the ability to get into a defensive crouch, ball handlers can easily get around the best defensive players. Both ad hoc and infrastructure wireless play are supported. Both modes let you play 2 ball or a full five-on-five game. As is typically the case with online-enabled EA games on the PSP, the initial sign-in process is cumbersome, and here, the community isn't exactly bustling. The games we played were a little choppy but still playable. Whether it's due to the slight lag or overpowered superstar abilities, playing online typically involved little more than each player running down the court and dunking with each team's best player for the duration of the game. Other than some slight tweaks here and there, the game looks nearly identical to last year. The frame rate is still slow and leaves a lot to be desired. The default camera works fine in the half-court set, but when running the fast break, you're often forced into blindly throwing the ball down court since the screen doesn't show enough of the action. For the most part, players will turn their heads in the general direction of the action, even if they have their backs to the play (which they frequently do). Facing the wrong direction does little to stop these players. Even with their back turned to the basket, they can, without turning around, fire and drain a jumper, several times a game. The arenas are faithfully replicated, but the 2D cardboard-cutout crowds look rough. There's very little ESPN content in the actual game, but if you're online, you'll be able to hear a brief Radio SportsCenter every 20 minutes. You can also get updated scores and information from the ESPN ticker that runs across the screen when you're in the online lobby. Without Eva Longoria on his mind, Tony Parker can focus on basketball again. Live 07's commentary isn't quite as robust on the PSP as it is on the consoles, and it's often a bit disjointed due to having to access the UMD, but it's still impressive. Marv Albert does the play-by-play, and player-turned-announcer Steve Kerr provides color commentary. The two have great chemistry together in real life, and this comes across in the video game in the off-the-cuff remarks and banter between the two. Ernie Johnson is joined by Greg Anthony for the all-star weekend, which means after a weak dunk you'll get to hear Anthony say off-the-wall cracks like ~I'd rather watch girls dunk on an eight-foot rim.~ NBA Live 07's soundtrack is vastly improved over last year's. The well-rounded soundtrack includes a wide variety of artists from around the world, including Sergio Mendes & The Black Eyed Peas, Gnarls Barkley, Jurassic 5 featuring Dave Matthews, Rhymefest, Lady Sovereign, and Talib Kweli. If you're not a fan of the game's tunes, you can listen to your own by simply placing MP3s into the music folder on your memory stick. While last year it may have been impressive seeing Live in portable form, the results this year are far less remarkable. Tossing in a few minigames is a step in the right direction, but the addition of a multiseason dynasty mode that most people will likely never play seems like a waste of resources, especially when the gameplay is so flawed. If you don't own Live 06 and you're craving a hoops game on the go, NBA Live 07 is worth a look, but if you do own last year's game, there's just not enough of an improvement to justify a purchase."}