{"ref": "https://www.gamespot.com/reviews/ratchet-and-clank-size-matters/1900-6188197/", "date": "March 28, 2008", "game_name": "Ratchet & Clank: Size Matters", "text": "Ratchet & Clank: Size Matters for the PlayStation 2 is a port of the same game that appeared on the PlayStation Portable early in 2007. And though that game was notable for being the first outing for the Lombax-robot duo on the handheld system, this is the fifth time the series has popped up on the PS2. Unfortunately, a woeful camera, poor presentation, and a relatively short runtime all relegate this latest Ratchet & Clank to the bottom of the series pile, which is an unfortunate way to close out the pair's adventures on the aging PS2. Nothing new here over the PSP version. When Size Matters first appeared on the PSP last year, studio High Impact Games was lauded for bringing all of the charm and action of the console series intact to the portable arena. The PS2 version is an exact copy of that game in terms of gameplay and storyline, so if you've already played the PSP version, there's no reason to pick this one up. Size Matters begins with the titular characters taking some time off on a beach planet, where they meet a young girl named Luna who's apparently a big fan of the duo. Before the introductory level is finished, Luna gets kidnapped by an almost forgotten race known as the Technomites, a bunch of microsize inventors with a grudge against the galaxy. This launches Ratchet and Clank on another planet-hopping quest that once again provides plenty of gameplay variety. In addition to platforming and shooting, you'll get to take part in skyboard racing (think hoverboards from Back to the Future II), engage in vehicular deathmatches, pilot a giant-size Clank through some on-rails space shooting, grind along rails to unlock doors, and more. Ratchet and Clank control much as they have in previous games in the series, and are armed with their usual repertoire of double jumps, helicopter-assisted glides, and wrench-bashing moves. But the weapons have always been the highlights of previous games, and Size Matters is no different. During the course of their adventure, Ratchet and Clank gain access to a wide variety of weapons, ranging from the functional to the mostly useless. Weapons such as the plasma pistol-like Lacerator and the Shock Rocket (a rocket launcher, naturally) will become standards in your arsenal, whereas others such as the Bee Mine Glove and the Suck Cannon are cute rather than worthwhile. Others, such as the Concussion Gun (Size Matters' version of a shotgun), are out-and-out duds no matter how they're powered up. And speaking of power-ups, just as in other Ratchet & Clank games, each weapon here can be upgraded through repeated use, although other modifications such as a targeting lock can be bought at special stores throughout the levels. The controls for both Ratchet and Clank are tight and responsive for the most part, and series veterans should have no problem picking up the Dual Shock and getting into the game's run-and-gun style of play straightaway. Strafing is still handled via the L2 and R2 buttons, whereas pressing the triangle button will bring up a radial menu for quick selection of weapons or gadgets. The game's light platforming elements still won't bother most experienced gamers, because most of the challenge in the game comes from the steady stream of robotic enemies being thrown in Ratchet and Clank's path. Size Matters is weakest when it strays from its strong shooting/platforming base. Skyboard racing controls quite poorly, and giant Clank's space shooting levels are uninvolving for the most part. Although the core gameplay in Size Matters is solid, it's completely undermined by a wonky camera system that refuses to give you a clear view of the action. You constantly have to micromanage the camera's view, which can be shifted via the right analog stick. The camera can also get snagged sometimes on the environment, and it's even worse in enclosed spaces. If you walk too close to a wall while strafing away from an enemy, your view rapidly shifts to face said wall, which leaves you scrambling to see what's happening and probably losing some health. It makes the game much more frustrating than it should be. The single-player action is over all too quickly, with the main campaign done and dusted in roughly seven hours. But like in previous games, there are plenty of hidden items (such as giant bolts) to collect, which will probably add a fair amount of replay value for completists. When single-player is exhausted, the game also offers a multiplayer option, although this is a rather light addition when you consider that only two players can play split-screen (either cooperatively or competitively). With only a handful of standard multiplayer modes and maps provided, this feature gets stale rather quickly. The PS2 may be on the verge of console retirement, but it's still capable of churning out pretty graphics. Nonetheless, Size Matters is not a great indicator of what the PS2 can do. Textures are uniformly bland, and character models have looked sharper in previous Ratchet & Clank games. It looks like what it is: a straight port of a PSP game, which means it fares rather poorly on a larger screen. Sound fares similarly: The music is bland and nondescript, and the weapon effects don't quite have the oomph that ridiculously overpowered weapons are supposed to have. Size Matters can also be buggy at times; we encountered several game freezes during our review testing, and puzzles would reset incorrectly upon a second or third try. The game looks frankly average on the PS2. Ratchet & Clank: Size Matters wasn't a perfect PSP game by any means, but it was received well because its main faults could be forgiven due to the system's limitations rather than the game itself. But those limitations--such as poor camera control and average presentation--are simply magnified when brought to a home console. Compared to the previous Ratchet & Clank games that have appeared during the PS2's illustrious history, Size Matters ranks at the bottom."}