{"ref": "https://www.gamespot.com/reviews/all-pro-football-2k8-review/1900-6175444/", "date": "July 20, 2007", "game_name": "All-Pro Football 2K8", "text": "ESPN NFL 2K5 is one of those games that have developed a seriously hardcore following in recent years. That's because it happens to be one of the most tightly crafted football games ever made, and also because it happens to be the last NFL-licensed game made by 2K Sports, following EA's snatching of the NFL license into the land of exclusivity. For just about three years now, fans of the 2K brand of football have been wringing their hands in anticipation of what 2K might do to bring back an alternative to Madden. The answer is finally here in the form of All-Pro Football 2K8. All-Pro is precisely the kind of football you remember from NFL 2K5--maybe a little too much like it--but with a roster of classic players from NFL yore. The premise? Build your own team out of your favorite old-timers, and compete against other teams full of heroes of the gridiron, both offline and online. It's a very cool idea for a game, especially in the way you build your team, but some niggling issues with the gameplay and presentation, as well as a stripped-down package of modes, prevents 2K8 from being a truly great return for 2K football. 2K Sports returns to the gridiron in All-Pro Football 2K8, and they've brought some old friends with them. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: All-Pro Football 2K8 Video Review First, let's look at who you're working with in All-Pro. The roster of classic players goes well over 200, and you'll see plenty of big-time names like Jerry Rice, Joe Montana, John Elway, Dan Marino, Barry Sanders, Walter Payton, Mike Ditka, and more. There's also a nice variety of players that aren't quite as immediately recognizable, but certainly deserve their all-pro status, like Lem Barney, Len Dawson, Chuck Muncie, Jessie Tuggle, and the like. However, there's also a decent chunk of players in the game that kind of leave you scratching your head about why they're in there. Mike Golic, for instance, is far more notable for his ESPN broadcasting career than his playing career; Korey Stringer is better known for his death at training camp than his role on the field; and what, exactly, did Brian Bosworth ever do besides play well for about two seasons before getting injured, retire, and go on to star in bad movies? Still, several weird choices aside, the number of honest-to-god legends vastly outweighs the goofy picks, and while one could argue endlessly about various omissions in the roster, this collection of players is plenty good for a starting entry. But what do you do with all these classic players? Essentially, from the moment you first boot up the game, your task is to build the team of your dreams. To build this team, you're provided 11 empty slots with which to fill superstars, and the remaining slots are taken up by generic players. The classic players are ranked in gold, silver, and bronze tiers. You get two gold, three silver, and six bronze players for any team you create, and they can fill whatever positions you like. Want a potent offense? Grab Jerry Rice and Walter Payton, toss in a silver-tier quarterback like Joe Theismann or Randall Cunningham, and you're in good shape. Prefer the defensive game to be the focus of a team? Pick Ronnie Lott, Dick Butkus, Lem Barney, and Ed ~Too Tall~ Jones, and you're looking pretty scary. Of course, it's all about balance. Go too far on one side of the ball or the other, and you may suffer in the end. Likewise, if you don't fill out your less sexy positions, like offensive line and kicker, you could find yourself in a difficult spot in certain situations. Difficult a balance as it can be to strike, it's a fun one to experiment with. You can create as many teams as you like, and edit any one you create over and over again until you feel like you've gotten it right. Once you get your team on the field, any fan of NFL 2K5 is going to be able to settle into a groove pretty quickly. That's because this game might as well be 2K5 with a handful of gameplay tweaks. Some of those tweaks include a new gang tackling system that actually looks and feels superior to anything found in recent Madden games, and a new right-analog-stick tackling mechanic that essentially lets you do big hits, high and low tackles, or reach tackles (the last of which rarely ever seems to work very well). There's also a new kick meter that tries to turn the right analog stick into a kicker's leg, having you pull back on it to start the play, and then push forward to kick (provided you time it and aim correctly). Nifty idea, but it doesn't work well at all. Kickoffs seem to work fine, but kicking field goals is a lot more scattershot than it should be. You know something's off when you're timing your kicks nearly perfectly and putting little angle on the ball beyond where you set the arrow pointer, and you're still missing kicks from 35 yards out. Finding the right combination of star players is half the fun. Interestingly enough, it's not the changes made to 2K8's design that really sell it--it's the stuff you remember. It probably speaks best to how fantastic a game 2K5 was that 2K8's gameplay can still be considered great fun, and still feel realistic, considering how much of it is identical to that game. The running game is still the best in the business, with moves and blocking that look and feel just about as spot-on as you could ever hope for. The passing game is no slouch either, though there's a weird bit of delay between when you press the button to throw to a receiver, and when the pass actually launches--one that might be somewhat realistic, but feels overwrought when you're just trying to get the ball out quickly. Defense is stingy and mechanically sound. Defensive backs tend to drop a few too many ~gimme~ interceptions, and defensive players still like to stand dead still in one spot when assigned to zone coverage (wide receivers tend to do the same thing on certain types of routes), but those quibbles aside, it's hard to complain much about the defensive game. So, if the game still plays so well, what prevents it from being truly great? It's a lot of things, many of which are elements that are missing. As an offline, single-player game, All-Pro is a weak effort. You get a quick game mode, and one season to play through against a series of pre-made teams, and once you win the championship (or don't), that's pretty much the end of it. There's no franchise mode, no crib, none of the amenities 2K Sports fans have become accustomed to over the years. Customization options also feel a bit lackluster. There are plenty of ways to design your team, including names, cities, uniform styles, and the like. The number of logos is a little on the paltry side, but there's enough of a variety to ensure you won't end up creating very many similar-looking squads. Player customization options are more disappointing. There aren't quite enough base options for faces, nor any way to really edit hairstyles or other distinctive features. What's also disappointing is that any player you create has to be put into the gold, silver, or bronze category. There's no way to edit the scrub guys on your team. It makes sense that you wouldn't be able to edit their attributes and performance ratings, but not even being able to edit their names or appearances is pretty weak. The gameplay is a lot of fun, but people who have been clinging to NFL 2K5 lo these last few years will find it extremely familiar--almost too familiar. At the very least, the multiplayer game isn't lacking. In fact, it's safe to say that 2K8 feels like a game specifically built for multiplayer competition. Half the fun of the game is pitting your created teams against other people's concoctions to see how they match up. You can do so in the standard ranked and player matches, as well as in tournaments and online seasons for up to 32 teams. There's still no fantasy-draft option, but given the limited number of noteworthy players in the game, that's somewhat understandable. Online performance seemed aces all around in the matches we played. Small bouts of lag popped up, but nothing that affected gameplay. Presentation is another area where All-Pro falls a bit short. Graphics are a point of contention simply because of how much the game resembles its Xbox forebears. Certainly the graphics engine has been scaled up quite a bit. You'll see plenty more detail in players' jerseys, helmets, and especially the arenas, which are massive and feature excellent-looking crowds, and animatronic mascots in some cases. But at the same time, it still looks like a scaled-up version of 2K5. The overly lankly player models, weird player faces, and sometimes stiff running movements give the game an aged feel. That's not to say all the animation looks bad, mind you. Not even close. The new gang tackles look excellent, collision animations in general look just about perfect in most cases (even when players run off the field into the bench and players on the sidelines) and there's nothing quite like having a QB launch a long bomb to someone like Jerry Rice or Andre Reed, and watching them make a spectacular leaping catch for the score. There are definitely some areas where the animation could have used an upgrade, but much of what's there works nicely. By the same token, the celebration animations feel pretty out of date, as a lot of them came straight from 2K5. Not to mention that some of them seem woefully out of place, or downright inappropriate. Barry Sanders doing a boastful dance after a TD? We don't think so. And there's something truly disquieting and, frankly, a bit tasteless about OJ Simpson doing a throat-cut animation after a big play. Compare this and 2K5 side-by-side, and you won't see a huge graphical upgrade. Broadcast presentation is another issue of note. On-field stat displays are solid and give you good info about what's going on in the game, but the camera presents an occasional issue, especially if you aren't playing with a widescreen TV. Zooming back prior to a play doesn't let you see your receivers on the far ends of the field, which sometimes makes it difficult to check up on what route they're running. On the audio front, the delightful twosome of Dan Stevens and Peter O'Keefe make their return to the commentary booth, but loads of the commentary seems to have been directly lifted from 2K5 with little editing or adjustment. Sure, they've got all the player names updated, but O'Keefe's food jokes and ~You can't coach that!~ moments are largely recycled. On top of that, the ancient editing techniques give the commentary a stilted feel that breaks up the flow. On-field dialogue is also extremely cheesy and poorly delivered, and the in-game soundtrack is rather short, so you tend to hear a lot of the same tracks again and again. At least the sounds of the game are as high quality as ever. Ultimately, All-Pro Football 2K8 delivers an enjoyable gameplay experience that fans of 2K football will find immediately engaging. At the same time, that great gameplay is so great because much of it comes directly from a three-year-old game, and many of the supplementary features that made that old game so fantastic are missing here. The issue isn't with the lack of an NFL license, but the inability to truly enjoy the game in a single-player environment for very long, not to mention the decidedly antiquated presentation. But with all that said, what matters most is that All-Pro is still an enjoyable football game, in spite of its more lackluster elements. This is a good, solid foundation that 2K can hopefully build upon for future sequels. If you temper your expectations from the extremely high ceiling set by NFL 2K5, and simply go in expecting a fun multiplayer-focused experience, you'll get just that out of All-Pro Football 2K8. Customization options also feel a bit lackluster. There are plenty of ways to design your team, including names, cities, uniform styles, and the like. The number of logos is a little on the paltry side, but there's enough of a variety to ensure you won't end up creating very many similar-looking squads. Player customization options are more disappointing. There aren't quite enough base options for faces, nor any way to really edit hairstyles or other distinctive features. What's also disappointing is that any player you create has to be put into the gold, silver, or bronze category. There's no way to edit the scrub guys on your team. It makes sense that you wouldn't be able to edit their attributes and performance ratings, but not even being able to edit their names or appearances is pretty weak. The gameplay is a lot of fun, but people who have been clinging to NFL 2K5 lo these last few years will find it extremely familiar--almost too familiar. At the very least, the multiplayer game isn't lacking. In fact, it's safe to say that 2K8 feels like a game specifically built for multiplayer competition. Half the fun of the game is pitting your created teams against other people's concoctions to see how they match up. You can do so in the standard ranked and player matches, as well as in tournaments and online seasons for up to 32 teams. There's still no fantasy-draft option, but given the limited number of noteworthy players in the game, that's somewhat understandable. Online performance seemed aces all around in the matches we played. Small bouts of lag popped up, but nothing that affected gameplay. Presentation is another area where All-Pro falls a bit short. Graphics are a point of contention simply because of how much the game resembles its Xbox forebears. Certainly the graphics engine has been scaled up quite a bit. You'll see plenty more detail in players' jerseys, helmets, and especially the arenas, which are massive and feature excellent-looking crowds, and animatronic mascots in some cases. But at the same time, it still looks like a scaled-up version of 2K5. The overly lankly player models, weird player faces, and sometimes stiff running movements give the game an aged feel. That's not to say all the animation looks bad, mind you. Not even close. The new gang tackles look excellent, collision animations in general look just about perfect in most cases (even when players run off the field into the bench and players on the sidelines) and there's nothing quite like having a QB launch a long bomb to someone like Jerry Rice or Andre Reed, and watching them make a spectacular leaping catch for the score. There are definitely some areas where the animation could have used an upgrade, but much of what's there works nicely. By the same token, the celebration animations feel pretty out of date, as a lot of them came straight from 2K5. Not to mention that some of them seem woefully out of place, or downright inappropriate. Barry Sanders doing a boastful dance after a TD? We don't think so. And there's something truly disquieting and, frankly, a bit tasteless about OJ Simpson doing a throat-cut animation after a big play. Compare this and 2K5 side-by-side, and you won't see a huge graphical upgrade. Broadcast presentation is another issue of note. On-field stat displays are solid and give you good info about what's going on in the game, but the camera presents an occasional issue, especially if you aren't playing with a widescreen TV. Zooming back prior to a play doesn't let you see your receivers on the far ends of the field, which sometimes makes it difficult to check up on what route they're running. On the audio front, the delightful twosome of Dan Stevens and Peter O'Keefe make their return to the commentary booth, but loads of the commentary seems to have been directly lifted from 2K5 with little editing or adjustment. Sure, they've got all the player names updated, but O'Keefe's food jokes and ~You can't coach that!~ moments are largely recycled. On top of that, the ancient editing techniques give the commentary a stilted feel that breaks up the flow. On-field dialogue is also extremely cheesy and poorly delivered, and the in-game soundtrack is rather short, so you tend to hear a lot of the same tracks again and again. At least the sounds of the game are as high quality as ever. Ultimately, All-Pro Football 2K8 delivers an enjoyable gameplay experience that fans of 2K football will find immediately engaging. At the same time, that great gameplay is so great because much of it comes directly from a three-year-old game, and many of the supplementary features that made that old game so fantastic are missing here. The issue isn't with the lack of an NFL license, but the inability to truly enjoy the game in a single-player environment for very long, not to mention the decidedly antiquated presentation. But with all that said, what matters most is that All-Pro is still an enjoyable football game, in spite of its more lackluster elements. This is a good, solid foundation that 2K can hopefully build upon for future sequels. If you temper your expectations from the extremely high ceiling set by NFL 2K5, and simply go in expecting a fun multiplayer-focused experience, you'll get just that out of All-Pro Football 2K8."}