{"ref": "https://www.gamespot.com/reviews/assault-heroes-2-review/1900-6190960/", "date": "May 14, 2008", "game_name": "Assault Heroes 2", "text": "Assault Heroes 2 follows the stereotypical path of the sequel to a tee. The additions read like a veritable checklist of expected upgrades--bigger levels, new vehicles, and different weapons--without implementing any drastic changes that would mess with the tried-and-true game design of the first. Not that this is necessarily a bad thing. While people sick of the seemingly endless stream of dual-stick shooters on Xbox Live Arcade still won't find anything here to change their minds, fans of the genre will be happy that developer Wanako Studios improved every aspect of the first game without sacrificing the hardcore appeal. Despite the lack of innovation, this is one of the best shooters on the service, an eminently enjoyable old-school romp. Shooting dinosaurs is always fun. Once again, the very real threat of alien forces occupying our beloved planet rears its ugly head, and it's up to you (along with a friend) to finally vanquish these vicious imperialists. The story is summed up in a mere paragraph before the start of the first level, but that's all the motivation you need to start shooting. And you'll be doing a lot of shooting. Puzzles, exploration, and anything else that could conceivably stem the flow of bullets has been thankfully left out, leaving you to focus on using unrelenting force to save Earth. The game excels despite the presence of any jaw-dropping new features because the core mechanics are almost flawless. Aside from a few levels late in the game, the controls are ultraprecise. It's not only possible to navigate the terrain while shooting your enemies with pinpoint accuracy, it's expected. Whereas so many games in this genre are heralding an unforgiving and oftentimes quite cheap difficulty level, AH2 doesn't resort to any trickery to kill you. The bullets stand out strongly against the background, and your maneuverability is never compromised. If you're hit, it's your fault. Even the on-foot missions--a painful thorn in the original game--have been drastically improved here. You can now roll away from attacks. This completely removes the unfair deaths from the original--where it was nigh impossible to avoid enemy fire--and makes the experience far less frustrating. The most notable new feature is the inclusion of four unique vehicles. While you'll still control the versatile jeep for the vast majority of the game, you can now hijack other vehicles to mix up the action. Don't expect Grand Theft Auto levels of thievery here--instead of forcibly taking the vehicle of your choosing from the enemy, you are limited to unoccupied vehicles with the keys already in the ignition. Unfortunately, though these vehicles do inject a little diversity in the action, they aren't as useful as the standard jeep. The assault chopper is fast but weak, the light walker can regenerate health but is slower than frozen tar, and the medium tank is extremely powerful...but extremely sluggish as well. And though your jeep has four different mounted guns, the extra vehicles are limited to just the standard minigun (though the tank can also use its turret). They are still fun to command in brief bursts, but it's a welcome treat returning to the lovable jeep. The only major misstep in this sequel is the fourth new vehicle: a spaceship. During certain levels, you'll have to leave your jeep on the ground while you battle enemies in space. Most of these levels are standard Assault Heroes' action that happens to take place above Earth's atmosphere. But for some inexplicable reason, the top-down view is sometimes thrown to the wayside to make way for tedious, behind-the-ship space fights. The tight controls and frustration-free fights that usually make Assault Heroes 2 so enjoyable are forgotten here. Obstacles and ships appear directly in front of you with no chance of dodging them, movement feels erratic, and blowing up enemies just isn't satisfying. This unfortunate design choice only appears in three of the 30 areas, but its taint mars an otherwise solid experience. The dreaded behind-the-ship levels leave a dark mark. The new features may be small, but they do a good job nonetheless of separating the sequel from its predecessor. In addition to the all-purpose minigun, slow-but-powerful flak cannon, and infantry-melting flame thrower, you can now freeze enemies with an ice gun. This little gun actually adds a lot to the action. Though it essentially serves the same function as the flak cannon (you can freeze heavily armored vehicles with ease), it's quite fantastic to freeze flying copters and watch them fall to the earth or make infantry-flavored popsicles and shatter them with your jeep's tires. It's disappointing that only one new weapon is included in your standard arsenal, but its functionality makes up for the lack of variety. The only other drawback in Assault Heroes 2 is a lack of options. Though you can play cooperatively either locally or across Xbox Live, you can't tinker around with any other modes. The only difference between Co-op Campaign and Co-op Zone Battle is how far you can progress. The former lets you play through the whole game, while the latter limits the experience to one section. An extra mode with a different take on the classic gameplay would have added more value to the product. Assault Heroes 2 is a great pickup for anyone craving more top-down, co-op action. It may not push the genre to previously unheard of levels and it's a bit short on variety, but Assault Heroes 2 is still a well-designed arcade experience. And if the abrupt end to the first Assault Heroes makes you apprehensive about dropping another $10, don't worry: AH2 is a long game. With 30 areas (the first only had 17), it'll take 10 hours to play through single-player, and then you'll still be ready for another round in co-op."}