{"ref": "https://www.gamespot.com/reviews/the-diofield-chronicle-review-forever-war/1900-6417963/", "date": "September 22, 2022", "game_name": "The DioField Chronicle", "text": "Essentially a protracted series of tactical battles, Diofield Chronicle's design falls into an early routine from which it is reluctant to deviate, while its fantasy world apes the war-room politicking of Game of Thrones with a focus on moving the chess pieces at the expense of credible character development. Flashes of progress are seen in its combat, and the occasional voice dares to question a realm ruled by divine authority, but both efforts are ultimately futile, crushed by an exhausting and relentless war machine.As the name suggests, Diofield itself is a holy land--God's country--where the hereditary monarchy is assured by each new ruler sporting the Mark of the Blessed, a birthmark of sorts that appears to resemble a vein of precious gems. Yet a frail king and the murder of his heir has caused a succession crisis, with factions forming around several candidates while neighboring empires eye an opportunity to expand their borders. Armies march across a map straight out of the Game of Thrones opening credits while those in command conduct sober debate about their next power play. These are serious people making serious decisions, it seems to imply. Everyone involved speaks as if through clenched-jaw, and with curiously little emotion, a vocal performance that is perhaps meant to indicate the gravity of the situation but instead tends to suggest everyone is a bit bored.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: The Diofield Chronicle Video ReviewYour perspective on events is through the eyes of Andrias Rhondarson, who is the boyhood friend and servant of the murdered heir, now grown-up and leading a band of mercenaries in the employ of the crown. Andrias makes for a dull lead, as he's disinclined to divulge his inner thoughts, while the ponderous, often humorless conversations he has with the rest of the cast do little to warm you to his plight, or anyone elses for that matter. In fairly typical JPRG style, few of the core cast look a day older than 18 yet carry themselves, whether debating strategy around the table or reflecting on the last mission, with the world-weariness of a pragmatic veteran general. It's laborious stuff and serves mostly to highlight the need for a quicker method of skipping through each scene.Between missions you explore the sparsely decorated keep that serves as company HQ, collecting new missions, shopping for weapons and consumables, and upgrading the party's abilities. Helpfully, the map shows where missions can be collected and conversations can be held, as well as whether the merchant or research station have new items available, and you can fast-travel between locations in mere seconds. As you recruit new party members, this hub area gradually becomes more populated over time, but despite the presence of side missions to unlock additional features and a new area, it fails to feel like home. Not much more than a collection of bland, often empty rooms, the HQ is essentially a glorified menu. Returning to the hub ought to be accompanied by a sense of wonder at what might have changed or developed; instead it's more of a weary resignation that you're going to have to hop between hotspots while clicking through a bunch of boring dialogue.Battles take place in real-time with the action pausing automatically when you issue a movement order or a command to use an ability. This can give proceedings a jarring stop-start feel, but it does allow time to think every step of the way and, crucially, make small adjustments--say, telling a character to step a few feet to the side to avoid an incoming attack.The combat seems interesting at first but fails to develop, seemingly content to tread the same ground from start to finishThe combat seems interesting at first but fails to develop, seemingly content to tread the same ground from start to finish. Surprises are limited to yet another wave of enemies rather than any attempt to chart new territory. Enemies boil down to two types--ranged and melee--with variations reduced to stronger versions and some very slightly different attacks. Your party members come in four classes: soldier (the defensive tank), cavalier (mobile damage), sharpshooter (ranged damage), and magicker (healing and buffs with some ranged damage). These characters require reasonably different tactics to maximize their potential. You're not just telling everyone to attack that enemy and sitting back; it's vital you tell your cavalier to flank the enemy and gain the ambush attack bonus, or to have your soldier provoke specific enemies into attacking her, or to instruct your magicker to cast Sanctuary on the ground your soldier is holding, or have your sharpshooter fire off a stun shot to interrupt an enemy preparing a special attack.But as you progress deeper, the challenge of combat doesn't escalate in interesting ways. Sure, there are a few more enemies to face at once. Sure, they have a couple more tricks up their sleeve than mere basic attacks. And sure, there's the odd boss with multiple health bars. But there aren't that many more enemies, those extra tricks aren't all that new, and those bosses just take longer to kill rather than demanding a novel approach. For much of the last half of the game, I tackled every fight in much the same way, sticking with the same core crew and only making minor tweaks when necessary. There was no need to change because the missions weren't presenting me with any new challenges. Climactic encounters were handled in identical fashion in a way that initially felt satisfying, as if I'd solved the problem of the game's combat, before boredom set in at the absence of any friction to stall my progress to the end.In the field, Andrias may be the group's leader but you can select any characters to comprise the party of four. Cleverly, you're not limited to your chosen four once a battle gets underway. In the setup phase you assign a support character to each primary party member, buffing their performance with passive stat bonuses and allowing them to activate the second character's special abilities. You can even, a limited number of times, swap out a character--primary or support--in the middle of a fight, a useful clutch move if someone's health is dangerously low or the situation calls for an ability specific to someone else.With upwards of a dozen characters vying for battle time (I recruited 14 in my playthrough, though there may be more) it's also just a smart way to ensure that everyone is involved. Of course there's still a tendency to stick with your favorites, particularly since the primary party gains more XP, but it eases the burden of grinding missions (you can replay any once completed to tick off sub-objectives and earn gold and XP) to allow under-leveled characters to catch up.The rudimentary map design exacerbates the problem. Terrain type is not a factor, despite missions taking place in cities, farmlands, snowfields, deserts and swamps. That patch of water or mud on the ground means nothing. You can fire a ranged weapon through or over any obstacle. High ground is no advantage. Everything is so flattened out that the combat arenas may as well be blank spaces. Maybe this wouldn't be such an issue if the mission objective required more interesting actions, but they almost without exception task you with killing all the enemies. Sometimes you have to activate a bridge to reach the next batch of enemies, occasionally there's an NPC to escort across the map and you have to kill all the enemies as you go, and very sparingly there's a point you have to protect while killing all the enemies.Even when the story introduces elements that could potentially offer intriguing alternative paths, the mission format doesn't change. A nascent pro-democracy movement, born of angry common folk, is quickly characterized as a band of thugs and brutally quashed by your iron fist at the behest of the king. Empire soldiers, demi-human monsters, the walking dead, a group of angry peasant farmers; they're all dealt with in the same way: Deploy the mercs and slaughter anything that moves. Too many near-identical fights make for a tedious slog, and the late-game story twists that prolong the end credits only intensify the fatigue.The Diofield Chronicle probably wants to explore ideas around how power is accumulated and how legitimacy is granted with its tales of warring lords and divine rights. But it never truly engages with them. Characters hedge around such issues, expressing tentative misgivings regarding the nobility of their mission before carrying on regardless. Similarly, in brief conversations, it gestures at the possibility of other ways to structure society, but never actually entertains them. With Andrias and his mercenary company the hammer that sees every problem as a nail, it makes for an unsatisfying narrative arc. Yet as you deploy the same tactics across what may as well be the same battlefield against pretty much the same enemies for the umpteenth time, it's an effective metaphor for the conservative and unimaginative game design."}