{"ref": "https://www.gamespot.com/reviews/madden-nfl-06-review/1900-6130999/", "date": "August 12, 2005", "game_name": "Madden NFL 06", "text": "The Madden franchise, now the unchallenged champion of NFL football simulation, is one of the best-selling in video games...and not without good reason. Over the years, the series has been honed and refined across more than a few platforms, and it almost invariably improves each year. Madden NFL 06 is now available on Verizon V Cast phones for a onetime download fee of $9.99. Featuring full rosters and commentary from John Madden himself, the fledgling mobile game evidently benefits from its long and storied console provenance. In many ways, Madden is vastly superior to its lower-end competition, which makes its few--albeit serious--shortcomings all the more surprising. Enjoy your sinecure, John Madden. As you'd expect from EA, which has exclusive rights to the NFL on console, PC, and traditional handhelds, Madden 06 features all 32 NFL teams, along with complete and up-to-date rosters. The game makes excellent use of this content, allowing players to oversee trades, perform substitutions, and track players over the course of a full season. On the field, the players are hardly recognizable, however. That's no surprise. What is strange is that they're sprite-based, while the field appears three-dimensional. On the LG VX8000 and the Audiovox 8940, these players speed about the field like hyperactive mosquitoes. All the game's animations look jumpy and accelerated, and this affects gameplay to a certain degree. On punt returns, you no sooner catch the ball than are tackled. As in a martial arts movie, the action in Madden takes place at about one and a half times the speed of life. Madden's offensive and defensive playbooks are the most extensive on mobile. No other presently released mobile game offers a defensive response to a fake punt attempt. All plays involve your full 11-man squad, and they can be modified via audibles, which is a very cool feature in a mobile game. Strangely enough, though, your artificial intelligence-controlled players will often be accused of face masking. One wonders why your linemen are so much more aggressive than the CPU's frontline muscle. The game's passing system, on the other hand, is needlessly difficult. To select a receiver, you must cycle through them in order, even though they have numbers associated with them. Your number keys are instead redundant, mirroring the movement controls of the navigation pad. Given that the action moves so fast and furious in Madden, this cumbersome control is problematic. Still, chances are most gamers will learn how to cope. We encountered a few bugs in the game on both our test units. In one memorable instance on the Audiovox 8940, the referee awarded a touchdown to the opposing team after a run for no gain left it at the 40-yard line. This TD wasn't reflected on the scoreboard, though; it was simply announced by the referee. Shortly thereafter, the same error occurred. After restarting the game, we never encountered this problem again. However, infrequent crashes occurred in both versions of the game. Given the infrequency of these problems, Madden's stability issues shouldn't put you off too much. The refs are crazy--crazy, we say! The game's sound is restricted to an opening beat and the usual brain-dead musings of John Madden, commentator and mild-mannered alter ego of Captain Obvious. If you weren't aware that ~a great pass combines a great throw with a great catch,~ John will bring you up to speed. Whatever you may think of its quality, such verbal banter is a first for mobile sports games. Although we're not exactly picketing out in front of EA for the inclusion of EA Traxx in future mobile Maddens, the omission seems strange, especially after Need For Speed Underground 2 included a dedicated Traxx player that streamed minute-long segments of eight separate tracks. Regardless, sound is one of Madden's most memorable features. Madden NFL 06 is a decent game of football with a solid statistical foundation. It breaks new ground for the franchise and promises future installments for football fans. However, this edition definitely shows EA's wireless inexperience and wasn't the stunner it should have been. In particular, the game's visuals are a disappointment. If you already have a V Cast phone, Madden 06 isn't a bad way to go. It's just not the killer app that forces an upgrade."}