{"ref": "https://www.gamespot.com/reviews/close-combat-first-to-fight-review/1900-6122896/", "date": "April 25, 2005", "game_name": "Close Combat: First to Fight", "text": "Recent years have seen a growing relationship between the United States military and the video game industry. Most of the attention has been focused on games developed in conjunction with the US Army. Games like America's Army and Full Spectrum Warrior have been created specifically to meet the needs of that branch of the military. Now the United States Marines are getting into the act, with Close Combat: First to Fight. Though it hasn't received any official blessing or endorsement from the US Marine Corps, Close Combat was developed with the help of dozens of real-life Marines fresh from recent combat duty in the Middle East. The game is a competent squad-based shooter that offers a fun cooperative mode and an artificial intelligence that is at times quite impressive and at other times completely boneheaded. Close Combat: First to Fight takes place in near-future Beirut. Close Combat's storyline revolves around unrest in the Lebanese city of Beirut. Insurgents have started a rebellion in the war-torn city, and the involvement of military forces from neighboring Arab nations has complicated matters. In response, the United States sends in a Marine expeditionary unit as part of a United Nations peacekeeping corps. You play the role of a Marine lance corporal in charge of a four-man fireteam, and you'll lead missions in and around the city of Beirut. The game's six missions are subdivided into several levels, which are further subdivided into checkpoints that should collectively take most players around 10 hours or so to complete. The objectives of each mission range from standard search-and-destroy patrols, to hostage rescue, to the elimination or capture of so-called ~high-value targets.~ These high-value targets are usually high-ranking enemy officers or generals. As the leader of a fireteam, you can command your men to do specific things, such as move to an area, cover specific flanks or doors, or lay down suppressing fire on a target. The action tends to move a lot faster in Close Combat than in similar games like Brothers in Arms, though. What's more, enemies don't gain specific bonuses while hiding behind cover. So while it is theoretically possible to do the fix-and-flank maneuver that you may have learned in other games, it is generally unnecessary and risky. You can simply peek out from behind cover, zoom in with your M16, and pick off enemies with pinpoint accuracy. The controls in the PC version of the game are a bit better than those in the Xbox version, primarily because peeking out from behind cover is easier on the PC. There are other special commands you can give your teammates when you find yourself inside of buildings. Like in SWAT 4, you can order your troops to stack up at a door and then either charge in or toss a grenade in first before charging in to clear the room. These room-takedown maneuvers are extremely effective, but for some reason, the option to execute them isn't available to you on many interior doors. As fireteam leader, you also have the ability to radio for help from Marine sniper teams, mortar crews, and Cobra gunships. If you run into a machine-gun nest or armored vehicle, for example, you don't have to try to use a frontal assault or grenades to take it out. Simply radio in for help, and you'll have fire support on the hard target in no time. The game was developed with the advice of battle-hardened Marines. The fact that the missions transition back and forth between indoor and outdoor areas is one of the best aspects of Close Combat. You can find yourself fighting in claustrophobic room-to-room combat within the bowels of an apartment complex and then suddenly find yourself out on the streets of Beirut trying to take stock of threats from multiple angles and varying elevations. Given that you or any of your teammates can die from just a couple of shots, this can present quite a challenge. Thankfully, your four-man team is generally intelligent about keeping a 360-degree watch around them. From time to time, enemies will actually flank you or sneak up behind you, but your teammates are usually alert enough to neutralize threats coming from the rear or the flanks. Your teammates are generally very accurate shots as well, and in most situations you can count on them to more than pull their weight when it comes to identifying and neutralizing enemy targets. Direct them behind obvious cover such as a burned-out car, steel drums, or a corner, and they'll even stack up behind that cover intelligently. At certain times they're so good that it can feel as though you're just along for the ride as you're driving your fireteam around to kill stuff. Your AI teammates aren't always such efficient and lethal killing machines, though. All too often they'll exhibit some completely idiotic behavior that can cause the team to get wiped out, ending the mission (you'll fail the mission if you die or if two members of your fireteam die or become incapacitated). This usually occurs in close-quarters situations where only a few feet separate your men and newly discovered enemies. If you order your men into a room through an open doorway, for example, they tend to become disoriented once they reach the center and have trouble targeting enemies they may discover inside. The computer AI also exhibits bouts of idiocy and can be taken advantage of in some situations. One example of this is how the enemy AI handles mounted weapons. Generally if you snipe a machine gunner off his weapon, a nearby enemy will take up his position. In many cases, you can use this scripted behavior to cheaply thin out enemy resistance. As you snipe the enemy over and over again off a machine gun, they'll keep on running, like lemmings, to their inevitable death. While it offers a decent single-player experience, Close Combat is probably a better game when played in its multiplayer mode. The game offers standard team deathmatch for up to eight players. This mode, as you can imagine, is fairly pedestrian, and the eight-man limitation makes Close Combat less attractive than most other PC shooters, which can support many more players. The cooperative mode, playable for up to four players, is the better multiplayer option. You can play any of the single-player levels by themselves or play through the entire campaign cooperatively if you choose. Close Combat is a fun challenge, and its relatively simple nature makes it ideal for co-op play. The graphics in the game are decent, but not particularly noteworthy. Close Combat's presentation is more utilitarian than it is flashy. As mentioned before, it's nice having both indoor and outdoor environments to fight through, although there isn't much interactivity. Character models exhibit acceptable detail, though after a few missions, the opponents you shoot start to look fairly repetitive. The animation of your teammates is good while they're creeping around, but their running animation looks awkward, particularly because they can clip through each other to reach certain places. Speaking of clipping, shadow clipping in the game is particularly problematic--you can often see shadows incorrectly poking through corners and other geometry. Enemies also clip through doors if they're about to run through them. There's no excessive gore in Close Combat, although there is a bit of blood. Bodies simply flop over or around with generic rag-doll physics after getting shot or blown up. As far as sound goes, Close Combat's gunshots and explosions are pretty decent, although the music is sparse and the voice acting isn't all that great. How much you end up enjoying Close Combat: First to Fight will hinge a lot on what your expectations are going in. If you were looking for the squad-based military shooter to end all shooters, this isn't it. While the game has enjoyable co-op play and some moments of great intensity, it feels rough around the edges, lacking the necessary refinement in both gameplay and presentation to make it easily recommendable. If you're just looking for a no-frills military shooter that you can play together with some buddies, then Close Combat: First to Fight will probably deliver what you're looking for."}