{"ref": "https://www.gamespot.com/reviews/halo-combat-evolved-review/1900-6076140/", "date": "September 29, 2003", "game_name": "Halo: Combat Evolved", "text": "When Microsoft released its Xbox game console in late 2001, easily the best launch title for the system was Halo. Originally announced way back in 1999 and slated for release on the PC and Macintosh, this first-person shooter became an Xbox exclusive after Microsoft bought the developer, Bungie. Halo for the Xbox has gone on to sell more than 3 million copies worldwide--which isn't proof of the game's superior quality, but certainly is evidence of it. Yet, the game was never officially canceled for its originally intended platforms, and at long last, it's available for the PC. For the most part, this new version of Halo is a straight port of the 2-year-old Xbox game. You'd think a high-end PC could handle such a game easily, but this port, which was done by Gearbox Software, is surprisingly taxing even on very fast PCs with tons of RAM and the latest video cards. Halo for the PC also loses the original version's much-vaunted cooperative play mode. But in spite of all that, and in spite of the very high standards for first-person shooters on the PC, Halo is still an incredible action game. It's a true classic--a game that hasn't lost any of its impact and intensity over time. The PC version of Halo is mostly identical to the original Xbox version, but it's still a truly impressive game. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Halo: Combat Evolved Video Review Halo consists of an intense, story-driven single-player campaign and a multiplayer mode. The campaign is a good 12 hours long at the normal difficulty setting, and the dynamic nature of the battles, along with the multiple, well-balanced difficulty settings, gives it good replay value. The multiplayer component only supports up to 16 players and includes a bare-bones integrated server finder. The game tends to play smoothly online if you can find a server with a low enough ping, and it features an assortment of different modes, which are variations on the standard modes of play found in your typical multiplayer shooter: They include slayer (meaning, deathmatch), team slayer, capture the flag, king of the hill, and some others, though slayer and CTF are by far the most popular choices judging from the servers that are up and running. Halo is famous for integrating powerful, fun-to-drive vehicles with the on-foot action, and this is what distinguishes its multiplayer component from that of other shooters, though some other PC shooters have also integrated vehicles more or less successfully since the original release of Halo. The PC version exclusively features a couple of multiplayer-only weapons not found in the Xbox version--the flamethrower and the fuel rod gun, sort of a plasma grenade launcher--though they're not as interesting as the game's core weapons. There are also six new multiplayer maps that were made for the PC version of the game. All in all, Halo's multiplayer component can make for some good, chaotic fun and seems to have a lot of potential for when the fan community gets hold of the editing tools that Gearbox has promised. For the time being, it's Halo's single-player component that's the main attraction. If you've played it on the Xbox, then you already know why--and you may still wish to pick up the PC version of the game just to go through this outstanding campaign with higher-resolution graphics, virtually non-existent loading times, and more-responsive controls than what can be found on the Xbox. The standard first-person shooter controls work flawlessly with this game, so you'll be able to pick it up and start playing in no time if you've played any other shooter lately. The Master Chief is very strong and can effectively take on groups of enemies alone, but he can't afford to be reckless. Longtime fans of Bungie's games know that one of the company's greatest talents is to tell a great story in its games. Halo is no exception, and it easily features one of the best stories to date in a first-person shooter, though that's not necessarily saying much. In any case, this is some great science fiction. The game picks up as the Pillar of Autumn, a human warship, is under heavy attack by the alien race called the Covenant. As a last resort, the ship's captain issues the order to awaken an experimental soldier from his cryogenic sleep. Referred to only by rank, the Master Chief is a skilled solider equipped with a very durable environment suit. He's tasked with protecting the ship's AI, Cortana, and escapes with some human marines toward a mysterious ring-shaped planetoid called Halo. Halo has its own atmosphere and ecosystem, but clearly it's no natural construction. There, the Master Chief (along with the surviving human marines) will continue the brutal fight against the Covenant and, with Cortana's help, will uncover the secrets of Halo and hopefully find a means to escape. As the Master Chief, you're highly skilled with all types of ranged weapons, which you can even use as deadly bludgeons when up close and personal with the enemy. You're also able to commandeer human and alien vehicles and hurl grenades accurately at a great distance. You have a motion tracker that detects any enemies in the vicinity, as well as recharging energy shields that allow you to survive against direct impact from energy or ballistic weapons. And your armor prevents you from being killed outright by such attacks should your shields be depleted. The Master Chief is powerful, but he's far from invulnerable. He can only carry two weapons at once (plus a stash of human frag grenades and alien plasma grenades), and he's vulnerable to concentrated fire or heavy weapons. The way the Chief's energy shields work is one of the game's innovations. The shields will recharge in a few seconds when the Chief isn't taking any fire, a life-saving feature that forces you into strategic retreats and to fight from behind cover whenever possible during the course of Halo. Having those shields not only makes for some tense firefights, but also means you won't find yourself in situations where your health is too low for you to possibly survive the next fight. It's little wonder that other shooters have started copying this play mechanic, since it works very well. You'll sometimes find yourself in the thick of pitched battles between the Covenant, friendly marines, and others, and these make for some incredible action sequences. The most impressive aspects of Halo are its friendly and enemy artificial intelligence, its physics for vehicles and explosions, and its weapon design. These elements are what contribute to the outstanding quality of the action, and though they are technically the elements of a 2-year-old game, they remain unsurpassed by just about any other shooter. Halo isn't a squad-based shooter, but in those instances when you're fighting alongside fellow marines, these troopers will naturally look to you for guidance and provide you with covering fire. Your enemies, meanwhile, offer a significant challenge. The Covenant's elites are imposing-looking, arrogant alien soldiers who have recharging energy shields of their own. They'll attempt to dodge your fire, use cover, and flush you out with explosives or flanking maneuvers if you try to stay hidden for too long. They're supported by grunts, which are weak little creatures that serve as Halo's comic relief. These cowardly foes will scatter, flailing their arms in terror, if an elite is killed in their vicinity. Yet grunts are not to be underestimated, for they can carry heavy weapons and grenades. They can also use stationary gun emplacements and will draw your fire away from their more-dangerous comrades. There are other Covenant foes, such as the jackals, which are skinny little creatures who defend themselves with energy shields, and the hunters, which are enormous and fearsome shock troopers. The Covenant aren't the only enemies you'll face in Halo, but they are the most prevalent and the most interesting to fight against. There aren't many varieties, but since they're armed with different types of weapons and are capable of effectively fighting both in close quarters and from long range, there's a great deal of variety to the types of battles in the game. That's thanks in no small part to the vehicles. The best parts of Halo take place in sprawling, wide-open areas in which you're free to fight on foot or in any of the game's four drivable vehicles that you can find. The human's warthog is a sturdy 4x4 all-terrain vehicle--you can't shoot while driving it, but a marine can use the high-powered chaingun mounted on the back, and another can ride shotgun, providing support fire with his weapon. The warthog, like all of Halo's vehicles, automatically moves in the direction in which you're looking, and this works very well to allow you to pull off some great stunts. The humans also have the rhino, their main battle tank, which can lay waste to small armies of Covenant single-handedly. Halo's vehicles are fun and easy to drive, and they're great in multiplayer. The Covenant's vehicles aren't as durable but are still very useful. The Ghost is a hoverbike armed with twin plasma guns, and the Banshee is an assault aircraft that can devastate ground forces. Each of these handles uniquely from all the others, looks great, and has its own unique advantages. They're put to use in memorable moments in Halo's campaign, and are a lot of fun in multiplayer, but what makes them particularly impressive is how seamlessly they're integrated with the action. Your perspective smoothly transitions to a third-person view when you get into the driver's seat of one of these. The arsenal of weapons available in Halo is also terrific. Rather than include a progressively more powerful lineup of guns as in most shooters, Halo's weapons are all well balanced and uniquely suitable to certain situations. Plus, the human and Covenant weapons are very distinct, thematically--the humans' ballistic weapons are well matched against the Covenant's plasma and energy-based firearms. You'll probably gravitate to a few types of weapons in particular. The standard marine assault rifle practically steals the show, as it offers a high rate of fire, looks and sounds great, and has a built-in compass and ammo readout. Better yet, it's perfectly suited for smashing an ugly Covenant's face in at close range. Indeed, the Master Chief has a unique way of using all of the game's different weapons as a bludgeon, and these powerful attacks are incredibly satisfying to use as finishing moves, especially in a tight spot when your ammo clip is running low and you need to finish the job, fast. The Master Chief is powerful, but he's far from invulnerable. He can only carry two weapons at once (plus a stash of human frag grenades and alien plasma grenades), and he's vulnerable to concentrated fire or heavy weapons. The way the Chief's energy shields work is one of the game's innovations. The shields will recharge in a few seconds when the Chief isn't taking any fire, a life-saving feature that forces you into strategic retreats and to fight from behind cover whenever possible during the course of Halo. Having those shields not only makes for some tense firefights, but also means you won't find yourself in situations where your health is too low for you to possibly survive the next fight. It's little wonder that other shooters have started copying this play mechanic, since it works very well. You'll sometimes find yourself in the thick of pitched battles between the Covenant, friendly marines, and others, and these make for some incredible action sequences. The most impressive aspects of Halo are its friendly and enemy artificial intelligence, its physics for vehicles and explosions, and its weapon design. These elements are what contribute to the outstanding quality of the action, and though they are technically the elements of a 2-year-old game, they remain unsurpassed by just about any other shooter. Halo isn't a squad-based shooter, but in those instances when you're fighting alongside fellow marines, these troopers will naturally look to you for guidance and provide you with covering fire. Your enemies, meanwhile, offer a significant challenge. The Covenant's elites are imposing-looking, arrogant alien soldiers who have recharging energy shields of their own. They'll attempt to dodge your fire, use cover, and flush you out with explosives or flanking maneuvers if you try to stay hidden for too long. They're supported by grunts, which are weak little creatures that serve as Halo's comic relief. These cowardly foes will scatter, flailing their arms in terror, if an elite is killed in their vicinity. Yet grunts are not to be underestimated, for they can carry heavy weapons and grenades. They can also use stationary gun emplacements and will draw your fire away from their more-dangerous comrades. There are other Covenant foes, such as the jackals, which are skinny little creatures who defend themselves with energy shields, and the hunters, which are enormous and fearsome shock troopers. The Covenant aren't the only enemies you'll face in Halo, but they are the most prevalent and the most interesting to fight against. There aren't many varieties, but since they're armed with different types of weapons and are capable of effectively fighting both in close quarters and from long range, there's a great deal of variety to the types of battles in the game. That's thanks in no small part to the vehicles. The best parts of Halo take place in sprawling, wide-open areas in which you're free to fight on foot or in any of the game's four drivable vehicles that you can find. The human's warthog is a sturdy 4x4 all-terrain vehicle--you can't shoot while driving it, but a marine can use the high-powered chaingun mounted on the back, and another can ride shotgun, providing support fire with his weapon. The warthog, like all of Halo's vehicles, automatically moves in the direction in which you're looking, and this works very well to allow you to pull off some great stunts. The humans also have the rhino, their main battle tank, which can lay waste to small armies of Covenant single-handedly. Halo's vehicles are fun and easy to drive, and they're great in multiplayer. The Covenant's vehicles aren't as durable but are still very useful. The Ghost is a hoverbike armed with twin plasma guns, and the Banshee is an assault aircraft that can devastate ground forces. Each of these handles uniquely from all the others, looks great, and has its own unique advantages. They're put to use in memorable moments in Halo's campaign, and are a lot of fun in multiplayer, but what makes them particularly impressive is how seamlessly they're integrated with the action. Your perspective smoothly transitions to a third-person view when you get into the driver's seat of one of these. The arsenal of weapons available in Halo is also terrific. Rather than include a progressively more powerful lineup of guns as in most shooters, Halo's weapons are all well balanced and uniquely suitable to certain situations. Plus, the human and Covenant weapons are very distinct, thematically--the humans' ballistic weapons are well matched against the Covenant's plasma and energy-based firearms. You'll probably gravitate to a few types of weapons in particular. The standard marine assault rifle practically steals the show, as it offers a high rate of fire, looks and sounds great, and has a built-in compass and ammo readout. Better yet, it's perfectly suited for smashing an ugly Covenant's face in at close range. Indeed, the Master Chief has a unique way of using all of the game's different weapons as a bludgeon, and these powerful attacks are incredibly satisfying to use as finishing moves, especially in a tight spot when your ammo clip is running low and you need to finish the job, fast. Grenades in Halo are also really great. The standard human frag grenade explodes almost on contact, causing any foes, weapons, or debris in the vicinity to go flying every which way. It just doesn't cease to be thrilling to watch a pack of Covenant get caught in an explosion. The Covenant's plasma grenades work great, too. They take a few seconds to explode, but they can also stick to a target, which will run around frantically in its final moments. Later in the game, when grenades are in heavy supply and when you're fighting mostly in close quarters, vast chain reactions of grenade explosions can lead to some very messy results. A well-placed grenade can set off a chain reaction that blows away a whole pack of enemies. Halo's single-player campaign does have one noticeable shortcoming in the actual level design. Though the wide-open areas are great, the game's numerous indoor levels aren't very interesting to look at and mostly consist of one same-looking room or corridor after another. The level design just isn't nearly as imaginative as every other aspect of the game, and it's the one aspect of Halo that really does seem dated. Nevertheless, the level design never stoops to slowing you down with tedious puzzles or jumping sequences, or overbearing dialogue or stealth elements, so the focus is always on the action. And since the enemy and friendly AI and the weapon design are so good, the layout of the levels really isn't so important, because the quality of the action is always top-notch. At any rate, Halo's single-player campaign lets you move seamlessly between outdoor and indoor environments, and the game's long-range vehicle battles and close-quarters, claustrophobic corridor crawls are all highly entertaining in their own right. Surprisingly, Halo looks really great on the PC--if you can get it to run smoothly. The creature and vehicle design is top notch--there are clear thematic design differences between the steely, utilitarian human designs and the sleek, purple-hued, almost oily-looking alien constructions. The weapon effects, explosions, and vehicles are especially impressive, and the enemy animations are very well done, too. The textures are sharpened up for the PC and are effectively bump-mapped to make them look touchable and realistic rather than flat and fake, though Halo's outdoor areas look particularly good. The character models and level architecture aren't terribly complex, however. But the only real issue with Halo's visuals is that they won't necessarily run smoothly at a high resolution, even on a high-end PC. You can tone down various aspects of the visuals to up the frame rate, but still, you're unlikely to experience a better frame rate from Halo than you would from other popular shooters from the past year or so. That's too bad, since the frame rate was one aspect of Halo that the PC version could ideally have improved on over the original version, which moved no more smoothly than 30 frames per second. Halo is one of the best shooters of all time, on any platform. On the other hand, the audio in Halo has been translated completely intact and is still first-rate. A truly superb soundtrack swells up during key moments of the single-player campaign. Chock-full of militaristic percussion, choirlike vocals, and cello strings, this is one of the best soundtracks in a shooter, and it adds a lot of drama to the action. The sound of the various weapons is also well done--each sounds distinctly different, though the Covenant's plasma weapons sound a bit underpowered. The voice acting is also excellent, from the Master Chief's soft-spoken, reassuring one-liners to the marines' variety of elated battle cries. In a nice touch, the marines even have different ethnic accents, and they have a great deal of dialogue, in general, so you'll rarely hear them repeat their lines. Covenant forces sound pretty great, too, as do some of the other characters and foes you'll face. Some aspects of Halo for the PC are disappointing, to be sure. Considering this is mostly just a straight port of the Xbox version, it's a shame that we had to wait two long years for the game to come out. It's also too bad that the Xbox version's option to play through the campaign cooperatively is nowhere to be found and that the graphics engine doesn't seem well optimized for the PC. And the multiplayer component, while entertaining, doesn't offer the sheer scale or unique modes of play offered by the most popular multiplayer PC shooters of today. But even with all that said, Halo is still a tremendously entertaining game on its own merits, and it can easily be placed in the same category as other all-time greatest shooters, like Doom and Half-Life. So if you've been holding out for the PC version of the game all these years, then don't deny yourself this experience any longer, and see what you've been missing. Grenades in Halo are also really great. The standard human frag grenade explodes almost on contact, causing any foes, weapons, or debris in the vicinity to go flying every which way. It just doesn't cease to be thrilling to watch a pack of Covenant get caught in an explosion. The Covenant's plasma grenades work great, too. They take a few seconds to explode, but they can also stick to a target, which will run around frantically in its final moments. Later in the game, when grenades are in heavy supply and when you're fighting mostly in close quarters, vast chain reactions of grenade explosions can lead to some very messy results. A well-placed grenade can set off a chain reaction that blows away a whole pack of enemies. Halo's single-player campaign does have one noticeable shortcoming in the actual level design. Though the wide-open areas are great, the game's numerous indoor levels aren't very interesting to look at and mostly consist of one same-looking room or corridor after another. The level design just isn't nearly as imaginative as every other aspect of the game, and it's the one aspect of Halo that really does seem dated. Nevertheless, the level design never stoops to slowing you down with tedious puzzles or jumping sequences, or overbearing dialogue or stealth elements, so the focus is always on the action. And since the enemy and friendly AI and the weapon design are so good, the layout of the levels really isn't so important, because the quality of the action is always top-notch. At any rate, Halo's single-player campaign lets you move seamlessly between outdoor and indoor environments, and the game's long-range vehicle battles and close-quarters, claustrophobic corridor crawls are all highly entertaining in their own right. Surprisingly, Halo looks really great on the PC--if you can get it to run smoothly. The creature and vehicle design is top notch--there are clear thematic design differences between the steely, utilitarian human designs and the sleek, purple-hued, almost oily-looking alien constructions. The weapon effects, explosions, and vehicles are especially impressive, and the enemy animations are very well done, too. The textures are sharpened up for the PC and are effectively bump-mapped to make them look touchable and realistic rather than flat and fake, though Halo's outdoor areas look particularly good. The character models and level architecture aren't terribly complex, however. But the only real issue with Halo's visuals is that they won't necessarily run smoothly at a high resolution, even on a high-end PC. You can tone down various aspects of the visuals to up the frame rate, but still, you're unlikely to experience a better frame rate from Halo than you would from other popular shooters from the past year or so. That's too bad, since the frame rate was one aspect of Halo that the PC version could ideally have improved on over the original version, which moved no more smoothly than 30 frames per second. Halo is one of the best shooters of all time, on any platform. On the other hand, the audio in Halo has been translated completely intact and is still first-rate. A truly superb soundtrack swells up during key moments of the single-player campaign. Chock-full of militaristic percussion, choirlike vocals, and cello strings, this is one of the best soundtracks in a shooter, and it adds a lot of drama to the action. The sound of the various weapons is also well done--each sounds distinctly different, though the Covenant's plasma weapons sound a bit underpowered. The voice acting is also excellent, from the Master Chief's soft-spoken, reassuring one-liners to the marines' variety of elated battle cries. In a nice touch, the marines even have different ethnic accents, and they have a great deal of dialogue, in general, so you'll rarely hear them repeat their lines. Covenant forces sound pretty great, too, as do some of the other characters and foes you'll face. Some aspects of Halo for the PC are disappointing, to be sure. Considering this is mostly just a straight port of the Xbox version, it's a shame that we had to wait two long years for the game to come out. It's also too bad that the Xbox version's option to play through the campaign cooperatively is nowhere to be found and that the graphics engine doesn't seem well optimized for the PC. And the multiplayer component, while entertaining, doesn't offer the sheer scale or unique modes of play offered by the most popular multiplayer PC shooters of today. But even with all that said, Halo is still a tremendously entertaining game on its own merits, and it can easily be placed in the same category as other all-time greatest shooters, like Doom and Half-Life. So if you've been holding out for the PC version of the game all these years, then don't deny yourself this experience any longer, and see what you've been missing."}