{"ref": "https://www.gamespot.com/reviews/ecco-the-dolphin-review/1900-6165561/", "date": "June 22, 2007", "game_name": "Ecco the Dolphin", "text": "In the first half of the 1990s, Flipper was back on television after a 30-year absence and people were flocking to theaters to watch Free Willy and its sequels. Sega did its part to capitalize on the underwater mammal craze in 1993 by publishing Ecco the Dolphin for the Sega Genesis. People expected a fun-filled frolic featuring a cute dolphin. What they got was an unforgiving action game full of tough puzzles and deadly situations. Back then the lush aesthetics and eco-friendly message went a long way toward softening the impact of the game's crueler aspects. Now that Ecco the Dolphin is available on the Wii Virtual Console for 800 Wii points ($8), it's interesting to see the toll that the passage of time has taken on the game. The poor pacing and unforgiving difficulty are more obvious now that the tropical visuals and fishy characters are no longer on the cutting edge. Much of Ecco's journey takes place in the murky depths. In the game, you play a bottlenose dolphin named Ecco that is searching for his pod mates. The search spans 25 lengthy levels and takes Ecco to various underwater locations, such as the Arctic Ocean and Atlantis. The game is a side-scroller, and by pressing a direction on the D pad, you can make Ecco swim in any direction. By pressing the associated buttons, you can make him swim faster, perform a ram, or activate his sonar. Control using the Wii Remote is fine, although the sonar button can sometimes be tough to reach since it's mapped to the button next to the D pad. Running out of food and air is the primary danger factor, as you'll find yourself constantly hunting for fish and air pockets to replenish Ecco's health and breath meters. If either indicator drops to zero, you'll have to start the level over again. The basic design of each level involves navigating mazelike passages or obstacle courses in search of whatever fish or glyphs that the other dolphins point you to. Unfortunately, getting through a level is usually an arduous endeavor. The cryptic clues the dolphins provide don't always point you in the right direction and running out of air is a common occurrence since it's easy to become disoriented while wandering the same look-alike tunnels. Levels are full of respawning enemies, which isn't necessarily unwelcome. However, Ecco doesn't turn very fast, and he will often take damage just by getting close to hazards, since the hit boxes are larger than the character graphics. In 1993, people tolerated these annoyances because the tropical graphics were disarming and controlling a dolphin was a new concept. Now that the 2D graphics are nothing special and controlling a dolphin is no longer innovative, the frustration is harder to accept. Levels are filled with predators, which can be tough to avoid since Ecco's hit box is bigger than his visible size. For better or worse, the Virtual Console port of Ecco the Dolphin is a perfect emulation of the original Sega Genesis game. The side-scrolling graphics look ancient, but the tropical shallows and dreary chasms still go a long way toward conveying the sense that you really are a dolphin stuck in foreign waters. The screen doesn't have any trouble keeping up with Ecco. You'll often find yourself ramming through groups of jellyfish, dodging sharks, or sailing through schools of tasty exotic fish, and the frame rate never stutters or slows down. The audio is understated. The few sound effects consist mainly of dolphin pings and whale cries, while the music consists of moody tunes that come across as haunting despite the limited symphonic range of the original hardware. Of course, since this port is based on the Sega Genesis version of the game, it uses the music from that version and not the more elaborate soundtrack that Spencer Nilson composed for the later Sega CD release. Time hasn't been kind to Ecco the Dolphin. The game used to be equally as charming as it was frustrating. Now, much of the charm has worn off and the frustration is more palpable. Ecco can be fun to watch, and his game has its moments, but the adventure requires the sort of tenacity that few people have."}