{"ref": "https://www.gamespot.com/reviews/shin-megami-tensei-digital-devil-saga-2-review/1900-6136043/", "date": "October 18, 2005", "game_name": "Shin Megami Tensei: Digital Devil Saga 2", "text": "The Shin Megami Tensei series' demonic tradition continues with Digital Devil Saga 2, a game that brings about a conclusion to the events chronicled in the original Digital Devil Saga. It's a delightfully dark and bizarre ride through the realms of spirituality, technology, and the human spirit that takes some neat twists along the way in both plot and gameplay. The high enemy-encounter rate and some income issues mar the experience somewhat, but this is a journey that is still well worth taking for fans of Japanese role-playing games itching to embrace their inner demons. From one nightmare world into another--the members of the Embryon just can't catch a break. Digital Devil Saga 2 picks up directly where the first game left off, and if you haven't played the original, you'll be left with a bit of narrative catch-up work to do. The young members of the Embryon tribe, whom you controlled in the first game, have left their shattered, war-torn world of the Junkyard behind them. They've ascended to what they believe is Nirvana, only the truth of Nirvana turns out to be something they didn't expect. It's a world not too different from their own, in that the demonic Karma Association forces reign supreme over a cowed human population that's been forced underground. They were forced there by the sun, which turned black and menacing and started sending what people call ~bad data~ to the lands of Nirvana, turning everyone its rays touched to stone. If that weren't enough of a weird turn of events, the old world of the Junkyard is revealed to be nothing more than a complex war simulation, a field upon which those in Nirvana tested various combat artificial intelligence data. All your characters--the solemn Serph, the emotional Argilla, the icy-cool Gale, and the rest of the crew--are simply AI constructs from that program that have somehow been brought out into the real world through a girl named Sera. This is just scratching the surface of the real truth of the identities of the members of the Embryon and their relationships with both Sera and each other. Digital Devil Saga 2 is definitely meatier storywise than the first game, bringing all the established factions together, revealing their convoluted pasts, and steering them toward the path of enlightenment. There are a number of emotionally heavy moments in the game, made all the more meaningful by how genuinely interesting and involving the characters are. You'll feel real empathy for everyone as they move toward coming to grips with the truths of their lives even as they continue to fight for survival. This kind of immersion is only helped by the attractive, distinct style of the game, which once again features Kazuma Koneko's unique and compelling artwork. From the somber and striking main characters, to all the crazy, great demons you'll encounter in the game, there's always something fascinating to feast your eyes on. The demon designs remain both incredibly fluid and terrible (in a good way) to look upon, and though you'll recognize a number of them if you've played the original game, they all still look great. The game's sound complements the world well and is once again an aural gumbo of all different styles of music, from the battle themes' addictive rock, to a variety of mystical, more ominous tunes, and even some pop thrown in for good measure. It all somehow works, tying the strange and ruined world that you wander through together with a distinctive look and sound. The demons are both beautiful and grotesque and so well constructed you'd almost believe that there really is a two-legged clawed elephant out there somewhere. You'll spend a lot of time wandering this world, and a lot of time fighting, because Digital Devil Saga 2 keeps the encounter rate high throughout the game. Three characters can fight at a time, though if you've got more waiting in the wings, you have an option in battle to swap them out for different members. A simple melee attack is always at your disposal, but your party members' real strengths come from their mantras, which are schools of demon abilities that they can learn. There are elemental abilities covering the gamut of fire, ice, electricity, and earth, as well as physical attack abilities, powers to devour your enemies, healing magic, and so forth. You learn these skills through a mantra system that's changed from the first game, presenting you with a large honeycomb grid composed of skill units. While this grid starts off fairly small, as your characters move through and learn different skills, the available number will expand. There are even some locked abilities that can be learned only if you first master all the mantras surrounding them, and any character can learn any mantra. While it's all a bit complex, there are strong reasons you want to invest the time customizing your characters. The turn-based combat in the game is, on the surface, a lot like in any other RPG, but the twist is that you're not guaranteed to be able to use a full turn. That's because all the character and enemy strengths and weaknesses tie in to your initiative. For example, if you use fire magic on a monster weak to fire, you gain an extra move in your turn; if you use ice magic against a monster that shields against it, you'll lose a turn. This all stacks too, so if you keep racking up critical strikes and spells against your foes, you can extend your period of attack by quite a bit. The reverse is also true, meaning that unless you take steps to protect your characters against getting hit in vital areas (every character has an innate weakness to an element or ability), you risk getting absolutely slammed and killed before you can so much as move. It's a good thing that battles are engaging, since you can barely turn around without running into one. The trick to it all is that you don't have foreknowledge of the abilities of your enemies, and unlike in the first game, you won't typically encounter areas with monsters that all use a specific attack. There's a mix of creatures in any given zone, so you'll need to be able to quickly adapt your tactics and your mantras to enable your party to survive. It's all really engaging and easy to have lots of fun with, but that joy is diminished somewhat by the fact that you're going to be fighting every few steps. Even small rooms and passageways risk numerous fights, and the game can be pretty punishing. There are a number of mantra stations and refresh stations scattered around to give you respite, at least, and let you pool your funds into more and better mantras for your characters to use. The other limiting factor of the game is money. You get money by defeating enemies, with a bonus for beating them in a small number of turns. Each mantra that your character wants to learn he or she will have to pay for, and the price of learning mantras quickly kicks up into the many thousands. As a result, there will be times in the game when you'll have to farm your immediate region for funds to finance the smorgasbord of skills you need to teach your party members to progress. And if you want the truly best skills, you'd better be prepared to pony up a whole lot of cash. It can be a bit frustrating to work within these confines to get your characters skilled up, but this is also due to the fact that your characters do have such an incredible freedom of customization and depth. It's easy to get wrapped up in spreading out important abilities across your party members, playing up their strengths and shielding their weaknesses. The game has a lot of content to work through at a fairly rigorous level of difficulty, and it has a number of hidden bosses and such that you can seek out should you wish to test your mettle. Once you've beaten the game (and it easily fills out the standard 30 hours or so for a typical RPG), you'll have the ability to play a new game with your learned abilities or even take on hard difficulty if you feel you're up to the challenge. For those who played the first Digital Devil Saga, you can import your saved data into this game, netting yourself some stat bonuses depending on what mantras you trained in. Some of the choices you might have made in that game can affect how certain characters in the sequel interact with you, but it's nothing that has a dramatic impact on the story or the ending. If this is what hell is like, it seems like a pretty cool place. Digital Devil Saga 2 finally realizes the promise of the saga's compelling storytelling, and while it's not without flaws, this demonic adventure still has a lot going for it. The fascinating cast and world, combined with the absolutely great atmosphere and feel, make it an interesting and able competitor in a crowded RPG market. If swords and sorcery have left you a little fantasy-weary, there are always this game's demons and deities to supply a nice change of pace. The turn-based combat in the game is, on the surface, a lot like in any other RPG, but the twist is that you're not guaranteed to be able to use a full turn. That's because all the character and enemy strengths and weaknesses tie in to your initiative. For example, if you use fire magic on a monster weak to fire, you gain an extra move in your turn; if you use ice magic against a monster that shields against it, you'll lose a turn. This all stacks too, so if you keep racking up critical strikes and spells against your foes, you can extend your period of attack by quite a bit. The reverse is also true, meaning that unless you take steps to protect your characters against getting hit in vital areas (every character has an innate weakness to an element or ability), you risk getting absolutely slammed and killed before you can so much as move. It's a good thing that battles are engaging, since you can barely turn around without running into one. The trick to it all is that you don't have foreknowledge of the abilities of your enemies, and unlike in the first game, you won't typically encounter areas with monsters that all use a specific attack. There's a mix of creatures in any given zone, so you'll need to be able to quickly adapt your tactics and your mantras to enable your party to survive. It's all really engaging and easy to have lots of fun with, but that joy is diminished somewhat by the fact that you're going to be fighting every few steps. Even small rooms and passageways risk numerous fights, and the game can be pretty punishing. There are a number of mantra stations and refresh stations scattered around to give you respite, at least, and let you pool your funds into more and better mantras for your characters to use. The other limiting factor of the game is money. You get money by defeating enemies, with a bonus for beating them in a small number of turns. Each mantra that your character wants to learn he or she will have to pay for, and the price of learning mantras quickly kicks up into the many thousands. As a result, there will be times in the game when you'll have to farm your immediate region for funds to finance the smorgasbord of skills you need to teach your party members to progress. And if you want the truly best skills, you'd better be prepared to pony up a whole lot of cash. It can be a bit frustrating to work within these confines to get your characters skilled up, but this is also due to the fact that your characters do have such an incredible freedom of customization and depth. It's easy to get wrapped up in spreading out important abilities across your party members, playing up their strengths and shielding their weaknesses. The game has a lot of content to work through at a fairly rigorous level of difficulty, and it has a number of hidden bosses and such that you can seek out should you wish to test your mettle. Once you've beaten the game (and it easily fills out the standard 30 hours or so for a typical RPG), you'll have the ability to play a new game with your learned abilities or even take on hard difficulty if you feel you're up to the challenge. For those who played the first Digital Devil Saga, you can import your saved data into this game, netting yourself some stat bonuses depending on what mantras you trained in. Some of the choices you might have made in that game can affect how certain characters in the sequel interact with you, but it's nothing that has a dramatic impact on the story or the ending. If this is what hell is like, it seems like a pretty cool place. Digital Devil Saga 2 finally realizes the promise of the saga's compelling storytelling, and while it's not without flaws, this demonic adventure still has a lot going for it. The fascinating cast and world, combined with the absolutely great atmosphere and feel, make it an interesting and able competitor in a crowded RPG market. If swords and sorcery have left you a little fantasy-weary, there are always this game's demons and deities to supply a nice change of pace."}