{"ref": "https://www.gamespot.com/reviews/diggles-review/1900-2857536/", "date": "March 22, 2002", "game_name": "Diggles", "text": "Dwarves are the blue-collar workers of mythology. In a typical fantasy setting, these short and stout creatures are always the hardiest of souls, most at home when they're digging through solid rock. So while elves are singing songs in the forests, and knights are rescuing maidens fair, dwarves are busy with picks and hammers far underground. As a result, they are often excluded from the lead role in heroic tales...and in computer games. That isn't the case in Diggles: The Myth of Fenris, a real-time strategy game from Innonics that puts dwarves front and center. This twist on the usual order of things is accompanied by some promising design ideas that blend traditional RTS base-building and resource collection with role-playing elements reminiscent of virtual life games like Creatures. But although these two disparate genres have been combined almost seamlessly, lethargic gameplay makes the whole game much less than the sum of its parts. Every action that your dwarves undertake takes so long that you'll spend more time watching and waiting than playing. You might as well be watching TV. And at times, you'll wish that you were. In some ways, you've already seen the stars of Diggles on television. Although the curiously named clan of dwarves has yet to sign a series deal with CBS, the creatures have more than a passing resemblance to the Smurfs. The designers may have cooked up a plot inspired by medieval mythology, but their lead characters owe more to Hanna-Barbera than to Norse sagas. The game's graphics are deliberately cartoonlike, and the diggles have exaggerated facial features. Big eyes and bulbous noses are everywhere. Objects in the game are similarly fashioned; most are oversized and strangely proportioned. Everything is slightly off-kilter and colorfully abstract, in the same way as a Saturday-morning cartoon. For the most part, Diggles' cartoonlike look and feel work well enough. The tone throughout the game is lighthearted and cute, but not sickeningly so. The diggles are sweet and innocent, but in a Three Stooges sort of way that includes a lot of pratfalls and dumb behavior that'll probably make you shake your head a few times. Diggles' bright 3D visuals and simple colors further establish this mood, as does the simplistic, side-scrolling platform style of play. Other aspects of Diggles aren't nearly as effective. While the light subject matter is a welcome change from that in traditional RTS games, most of the humor is awkward and poorly timed. Pauses in the middle of dialogue sequences ruin a lot of the one-liners, which at any rate aren't anything to write home about. The game's voice-acting quality is generally poor, something that makes the humor seem even more forced. In-game audio effects are almost completely missing in action. Birds chirp and the drum-centric soundtrack beats away in the background, though the diggles themselves are completely silent except when they're speaking in cutscenes. More problematic is the omission of multiplayer support. For reasons known only to Innonics, the company shipped Diggles without a multiplayer mode of any kind. There is a single-player skirmish option, however, and the campaign plot is clever. Instead of being sent up against some enemy force in a series of nondescript set-piece battles, the diggles are asked by Odin to find his lost dog. Fenris has broken his leash and fled into the underworld, and you've been promised demigod status if you can bind him with a mystical chain called the Gleipnir. To find him, you need to build bases, dig tunnels, fight enemies, solve the occasional puzzle, collect valuable items and weapons, and do a lot of exploring. This is where the game's fatal flaw rears its ugly head. Almost everything that you do takes too much time. Building a basic structure occupies a diggle for at least a minute, typically longer, as does packing up a building for transport to a new location. Digging is similarly drawn out, as is chopping down the mushrooms used for food and some construction. Even the act of traveling from one location to another is tiresome, since the diggles don't move very quickly on their stubby legs, even when double-clicked into a skipping run.More of an issue is the personality that Innonics has built into the diggles. Dwarves are known for being methodical, but these creatures are downright pokey. They get around to your orders when they feel like it, often futzing around for 30 seconds or more before rolling up their sleeves and getting to work. Even on those rare occasions when they do hop to it, they take an extra few seconds to put on headgear appropriate to the task at hand (a chef's hat while cooking, a helmet with a light on it while digging, and so on). This causes no shortage of frustration, first because you think that the game isn't responsive, then because you realize that the developers planned and implemented this as a feature. In the design documents, this probably seemed like a great way to emphasize the individuality of your diggles. But while you're actually playing the game, this trait is so frustrating that it may make you want to reach inside your monitor and crush every diggle you can grab. The diggle mating dance goes on. Slowing things down still further is the role-playing system. Each diggle is treated as an individual, with a name and typical human needs and desires. Click on a diggle and a menu will pop up showing his or her current levels of satisfaction in regard to health, nutrition, alertness, and mood. The former two categories mean that you have to keep your charges fed, while the latter require a balance between work and leisure time. All create unnecessary drags on gameplay. Making sure that your diggles have enough to eat is as simple as chopping down and roasting a few mushrooms, though as with everything else here, it does take a considerable amount of time and requires you to delay mission objectives for minutes at a stretch. Keeping them alert and happy is more tiresome. If you don't give your diggles enough time for sleep and recreational pursuits, they'll get cranky. What's worse, they won't get together in cute little couples and make the little diggles needed to enlarge your workforce as time goes by. Everything in Diggles can be automated by use of a schedule that separates work and leisure time as you see fit. Though this is a good idea in principle, it doesn't work for two reasons. First, setting a schedule and sticking to it turns you into even more of a spectator. Second, your diggles don't do a very good job of getting back to work when playtime ends. Though they are smart enough to automatically complete tasks, they drag their heels so much that you will eventually give up and issue direct orders. The only way to keep going at a reasonable enough pace to keep from falling asleep yourself is to work your diggles pretty much constantly, which of course leads to a lot of angry or dead little dwarves. The only mitigating factor regarding diggle speed is that things do improve somewhat as the game goes on. Diggles gain experience points while working at nearly every task, from chopping mushrooms to using weapons, and this eventually allows them to do things at a faster rate. It takes a long time to build skill levels up, however, and experience point caps cause points to be subtracted from one category if you go too high in another. Also, diggles live for just 24 days of game time, meaning that you constantly have to start over with a new, slow generation. They may be small, but they're no pushovers in combat. It's a shame that Diggles is rather dull and lacking in features and polish, because the game mechanics are generally well thought out. The interface is easy to learn and use. Although the game is played as a side scroller, you can use the mouse to rotate the camera slightly to either side and the mousewheel to zoom in and out. All commands are handled through the mouse buttons and a few keys. Thought balloons above each diggle's head keep you aware of what task he or she is presently working on. Mission objectives and big events such as an invention or birth are tracked in a news ticker at the top of the screen. A streamlined list of building types and resources keeps unnecessary complexity to a minimum, as does the ability to pack your structures in boxes and move them to different locations. Most of the building development and technology trees are based in the fireplace, which serves as a communal headquarters. Combat is a straightforward point-and-click system. In the end, however, everything of value here means little because of the sluggish pace. As entertaining as aspects of Diggles: The Myth of Fenris are, only those with a tolerance for tedium--or perhaps an addiction to caffeine--will play the campaign beyond the first few quests. A few tweaks, along with the addition of a multiplayer mode, and this could have been a good, if not great, real-time strategy game based in one of the most memorable settings that the genre has seen in some time. As it is, though, the game represents something of a wasted opportunity.More of an issue is the personality that Innonics has built into the diggles. Dwarves are known for being methodical, but these creatures are downright pokey. They get around to your orders when they feel like it, often futzing around for 30 seconds or more before rolling up their sleeves and getting to work. Even on those rare occasions when they do hop to it, they take an extra few seconds to put on headgear appropriate to the task at hand (a chef's hat while cooking, a helmet with a light on it while digging, and so on). This causes no shortage of frustration, first because you think that the game isn't responsive, then because you realize that the developers planned and implemented this as a feature. In the design documents, this probably seemed like a great way to emphasize the individuality of your diggles. But while you're actually playing the game, this trait is so frustrating that it may make you want to reach inside your monitor and crush every diggle you can grab. Slowing things down still further is the role-playing system. Each diggle is treated as an individual, with a name and typical human needs and desires. Click on a diggle and a menu will pop up showing his or her current levels of satisfaction in regard to health, nutrition, alertness, and mood. The former two categories mean that you have to keep your charges fed, while the latter require a balance between work and leisure time. All create unnecessary drags on gameplay. Making sure that your diggles have enough to eat is as simple as chopping down and roasting a few mushrooms, though as with everything else here, it does take a considerable amount of time and requires you to delay mission objectives for minutes at a stretch. Keeping them alert and happy is more tiresome. If you don't give your diggles enough time for sleep and recreational pursuits, they'll get cranky. What's worse, they won't get together in cute little couples and make the little diggles needed to enlarge your workforce as time goes by. Everything in Diggles can be automated by use of a schedule that separates work and leisure time as you see fit. Though this is a good idea in principle, it doesn't work for two reasons. First, setting a schedule and sticking to it turns you into even more of a spectator. Second, your diggles don't do a very good job of getting back to work when playtime ends. Though they are smart enough to automatically complete tasks, they drag their heels so much that you will eventually give up and issue direct orders. The only way to keep going at a reasonable enough pace to keep from falling asleep yourself is to work your diggles pretty much constantly, which of course leads to a lot of angry or dead little dwarves. The only mitigating factor regarding diggle speed is that things do improve somewhat as the game goes on. Diggles gain experience points while working at nearly every task, from chopping mushrooms to using weapons, and this eventually allows them to do things at a faster rate. It takes a long time to build skill levels up, however, and experience point caps cause points to be subtracted from one category if you go too high in another. Also, diggles live for just 24 days of game time, meaning that you constantly have to start over with a new, slow generation. It's a shame that Diggles is rather dull and lacking in features and polish, because the game mechanics are generally well thought out. The interface is easy to learn and use. Although the game is played as a side scroller, you can use the mouse to rotate the camera slightly to either side and the mousewheel to zoom in and out. All commands are handled through the mouse buttons and a few keys. Thought balloons above each diggle's head keep you aware of what task he or she is presently working on. Mission objectives and big events such as an invention or birth are tracked in a news ticker at the top of the screen. A streamlined list of building types and resources keeps unnecessary complexity to a minimum, as does the ability to pack your structures in boxes and move them to different locations. Most of the building development and technology trees are based in the fireplace, which serves as a communal headquarters. Combat is a straightforward point-and-click system. In the end, however, everything of value here means little because of the sluggish pace. As entertaining as aspects of Diggles: The Myth of Fenris are, only those with a tolerance for tedium--or perhaps an addiction to caffeine--will play the campaign beyond the first few quests. A few tweaks, along with the addition of a multiplayer mode, and this could have been a good, if not great, real-time strategy game based in one of the most memorable settings that the genre has seen in some time. As it is, though, the game represents something of a wasted opportunity."}