{"ref": "https://www.gamespot.com/reviews/onimusha-dawn-of-dreams-review/1900-6145465/", "date": "March 6, 2006", "game_name": "Onimusha: Dawn of Dreams", "text": "Don't call it Onimusha 4. This latest installment in Capcom's flashy samurai action adventure series delivers the same impressive presentation and fast-paced combat fans have come to expect. And it's a significantly bigger game, sucking up two discs' worth of demon killing and chatty cutscenes. About the only thing missing are celebrity likenesses--the previous game, 2004's Onimusha 3, featured Jean Reno (The Professional) and Takeshi Kaneshiro (House of Flying Daggers) in a costarring role. In exchange, Onimusha: Dawn of Dreams offers a lengthy new quest, five different playable characters, and a good amount of replay value, not to mention that distinct anime-meets-soap opera style. The history of Japan, as told through the Onimusha series, involves lots of bloodshed, treachery, demonic infestation, and feathered hair. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Onimusha: Dawn of Dreams Video Review Previous Onimusha games pitted you against the forces of a demonically possessed Oda Nobunaga, a Japanese warlord in league with evil forces called genma. This time around, not only is there a new villain in Nobunaga's successor, the squat and instantly unlikable Hideyoshi, but there's also a new hero. Dawn of Dreams is the story of Soki, a bleached-blond, blue-clad warrior single-handedly trying to save medieval Japan from yet another demonic invasion. He's a feared swordsman but an affable guy, though his blond hair and horned headband make him an odd sight for 16th-century Japan. His journey will be joined by an equally unlikely group of companions, ranging from a young ninja girl named after a legendary samurai, to a frilly collared Spaniard with arms like Frankenstein's monster. In turn, they'll run into many more villains than just Hideyoshi, and many of these bad guys just...won't...die. This is a weird, long-winded story that's at times both disjointed and awkwardly translated, but it sure is pretty. You'll see frequent, well-choreographed cutscenes using the game's 3D engine. Between missions, you'll get to nag your companions for background information, though it's all in text and tempting to simply skip. There's also plenty of chatter during the missions, along with lots of optional reading material to be found--diaries, memos, and other little notes. It's nice that the game does so much and tries so hard to tell a compelling story, but the results are hit and miss. The quality of the voice acting is above average (both English- and Japanese-language options are available), but the script is riddled with clichs, from maniacally laughing villains to multiple instances of the expression ~last hope for humanity.~ At least there's this one amazing use of profanity to look forward to near the end of the game. Other than that, though, the story just never quite takes off, despite a few decent twists and references to the previous games. It's ultimately very similar in tone and style to previous Onimusha yarns, so if you've played those games, you know what's in store. The same can be said for the gameplay itself. You'll run through numerous enemy-infested stages, almost constantly battling demons, but also taking the time to solve various puzzles. The combat is fast-paced and responsive. It's very simple at first--you just hack at foes and block their incoming attacks. But you learn more and more abilities as you go, even as your enemies keep getting bigger and tougher, and suddenly you're using practically every button on the controller. You get to use magic, special purifying attacks, transformation moves, evasive maneuvers, and all kinds of different attack combinations. Perhaps best of all, you can dish out lightning-fast, lightning-deadly critical strikes by attacking your foe just as you're about to get hit. You can also perform critical strikes after using your magic or after a carefully timed defense. The fighting gets pretty crowded, but you can fiddle with the camera angle using the right analog stick and lock onto nearby foes at the touch of a button. In some scenes the camera angle is locked in place, which can be a little disorienting, but isn't a big deal. Soki is a master swordsman, and he'll be joined by a number of similarly skilled companions, each with his or her own unique moves and abilities. The same underlying mechanics apply to all five of the game's characters, but other than that, they each have distinctly different moves and fighting styles. Furthermore, during most of the game, you'll be fighting alongside a computer-controlled companion, and you may switch to directly controlling one or the other at the touch of a button. You can give basic orders to your companion using the D pad, but by far the most useful of these is the one that makes your companion rest up. When tasked to fight, your comrades will often get beat up badly, whereas if you make them stand still, they'll automatically block almost all incoming attacks while regenerating their health. You'll find various healing items as you proceed through the game, but it's viable to just keep switching characters and recovering your health that way. Of course, that little trick will only get you so far. The two-character dynamic also often comes into play for puzzle-solving purposes, since every character but Soki has some sort of special ability that lets him or her access areas the others can't reach. The back of the box also boasts an ~unlockable co-op mode~ for two players, which, for whatever reason, is rather well hidden. When you finish the game, you unlock a mildly amusing two-player arena battle mode, not the co-op mode. The co-op mode itself is functional, but not fully fleshed out, so it's little wonder it was tucked away. At any rate, having two characters running around through most of the game instead of just one helps make things a little more complicated and a little more interesting, but you can tell the system was tacked on. Many of the cutscenes feature all five of the heroes standing together, preparing to fight, but the actual fighting never involves more than just you and a single ally against your foes. The game's lengthy quest is peppered with great-looking cinematic cutscenes, though the actual story and dialogue often leave something to be desired. There are actually quite a few puzzles in addition to all the action. That's not even counting all the puzzle boxes you'll find, which challenge you to match up rows of colored dots in as few moves as possible. These puzzles are pretty fun, and the rewards tend to be well worth the effort. There's just a ton of stuff to find throughout the game, including lots of different weapons for all the characters, various useful accessories and usable items, and more. You can upgrade all your weapons by spending the red souls you absorb from slain enemies, and since you'll eventually have five characters and literally dozens of weapons, you'll have some tough, interesting decisions to make. Onimusha: Dawn of Dreams certainly packs in the lengthiest adventure the series has ever offered. It could easily last you more than 15 hours the first time through, or longer still if you go out of your way to revisit earlier stages with different characters, stop to figure out all the puzzle boxes, try to fight your way through the ~dark realm~, read all the between-mission dialogue, and so on. However, it achieves this partly by recycling areas and enemies from the past games, and also by making you revisit places...and refight bosses. There are a lot of drawn-out boss fights in this game, some of which are fun and challenging, at least the first time you run into them. Others simply take a long time to beat, punishing impatience more than a lack of ability. Should you perish, thankfully the game never sets you back farther than the beginning of that fight. Later on, the role-playing elements also undermine the difficulty, since you'll more than likely have amassed tons of recovery items that let you slop your way through the final sequence of battles. For all their arrogant boasting, the game's main villains are relatively easy to dispatch compared with some of the fighting earlier on, during which you need to be a lot more careful. Also, just in case you start acting smug yourself, you'll unlock tougher difficulty modes by finishing the game successive times. Onimusha is still going strong, judging by this latest chapter in the series. Spectacular cutscenes, great animation, and a fast, smooth frame rate highlight the game's visuals. There are some beautiful, new environments, like this one rain-soaked village filled with zombies, which looks like it's straight out of Resident Evil 4. The characters found throughout the game are ridiculously dressed but very lifelike, especially during the cutscenes. The lip-synching is noticeably off in the English-language cutscenes, and characters don't move their mouths at all when talking outside of the cutscenes. However, these are fairly minor blemishes in a terrific-looking game. The audio is similarly excellent, though the predominant sounds of hacking and slashing are all recycled from previous installments. Throughout the game, a stirring musical score keeps pace with the action and effectively fits the theme. Besides that, fans will surely appreciate the option to choose between English- and Japanese-language tracks. There is also support for Dolby Pro-Logic II sound systems, though the graphics don't support progressive-scan displays. Onimusha: Dawn of Dreams plays it safe, presenting lots more of what fans of the series loved about the past games, while adding a new layer of complexity to the action to help keep things fresh. The game doesn't assume your familiarity with the previous installments, though a lot of the story's references might fly over your head if all this material is new to you. Even so, there's enough exciting action in this latest Onimusha to make it live up to the quality of its predecessors. The two-character dynamic also often comes into play for puzzle-solving purposes, since every character but Soki has some sort of special ability that lets him or her access areas the others can't reach. The back of the box also boasts an ~unlockable co-op mode~ for two players, which, for whatever reason, is rather well hidden. When you finish the game, you unlock a mildly amusing two-player arena battle mode, not the co-op mode. The co-op mode itself is functional, but not fully fleshed out, so it's little wonder it was tucked away. At any rate, having two characters running around through most of the game instead of just one helps make things a little more complicated and a little more interesting, but you can tell the system was tacked on. Many of the cutscenes feature all five of the heroes standing together, preparing to fight, but the actual fighting never involves more than just you and a single ally against your foes. The game's lengthy quest is peppered with great-looking cinematic cutscenes, though the actual story and dialogue often leave something to be desired. There are actually quite a few puzzles in addition to all the action. That's not even counting all the puzzle boxes you'll find, which challenge you to match up rows of colored dots in as few moves as possible. These puzzles are pretty fun, and the rewards tend to be well worth the effort. There's just a ton of stuff to find throughout the game, including lots of different weapons for all the characters, various useful accessories and usable items, and more. You can upgrade all your weapons by spending the red souls you absorb from slain enemies, and since you'll eventually have five characters and literally dozens of weapons, you'll have some tough, interesting decisions to make. Onimusha: Dawn of Dreams certainly packs in the lengthiest adventure the series has ever offered. It could easily last you more than 15 hours the first time through, or longer still if you go out of your way to revisit earlier stages with different characters, stop to figure out all the puzzle boxes, try to fight your way through the ~dark realm~, read all the between-mission dialogue, and so on. However, it achieves this partly by recycling areas and enemies from the past games, and also by making you revisit places...and refight bosses. There are a lot of drawn-out boss fights in this game, some of which are fun and challenging, at least the first time you run into them. Others simply take a long time to beat, punishing impatience more than a lack of ability. Should you perish, thankfully the game never sets you back farther than the beginning of that fight. Later on, the role-playing elements also undermine the difficulty, since you'll more than likely have amassed tons of recovery items that let you slop your way through the final sequence of battles. For all their arrogant boasting, the game's main villains are relatively easy to dispatch compared with some of the fighting earlier on, during which you need to be a lot more careful. Also, just in case you start acting smug yourself, you'll unlock tougher difficulty modes by finishing the game successive times. Onimusha is still going strong, judging by this latest chapter in the series. Spectacular cutscenes, great animation, and a fast, smooth frame rate highlight the game's visuals. There are some beautiful, new environments, like this one rain-soaked village filled with zombies, which looks like it's straight out of Resident Evil 4. The characters found throughout the game are ridiculously dressed but very lifelike, especially during the cutscenes. The lip-synching is noticeably off in the English-language cutscenes, and characters don't move their mouths at all when talking outside of the cutscenes. However, these are fairly minor blemishes in a terrific-looking game. The audio is similarly excellent, though the predominant sounds of hacking and slashing are all recycled from previous installments. Throughout the game, a stirring musical score keeps pace with the action and effectively fits the theme. Besides that, fans will surely appreciate the option to choose between English- and Japanese-language tracks. There is also support for Dolby Pro-Logic II sound systems, though the graphics don't support progressive-scan displays. Onimusha: Dawn of Dreams plays it safe, presenting lots more of what fans of the series loved about the past games, while adding a new layer of complexity to the action to help keep things fresh. The game doesn't assume your familiarity with the previous installments, though a lot of the story's references might fly over your head if all this material is new to you. Even so, there's enough exciting action in this latest Onimusha to make it live up to the quality of its predecessors."}