{"ref": "https://www.gamespot.com/reviews/mechassault-phantom-war-review/1900-6158353/", "date": "September 22, 2006", "game_name": "MechAssault: Phantom War", "text": "People had reason to worry when Majesco announced it was bringing Microsoft's MechAssault franchise to the Nintendo DS. Could an Xbox-centric franchise work on the DS without being compromised to the point of being unplayable? Fortunately, Majesco wisely handed development off to Backbone Entertainment, the developer responsible for the highly-regarded Nintendo DS version of Age of Empires. Apart from the expected audio-visual downgrades, MechAssault: Phantom War brings all of the nuts and bolts of the Xbox MechAssault games to the Nintendo DS. Combat is fast-paced and explosive, there are plenty of mechs to pick from, and the single player campaign is a slickly produced narrative complete with spoken radio dialogue and full-motion video scenes. Four-person multiplayer play even made it in, although not in the online-enabled way that most players would obviously have preferred. Still, this is MechAssault on the Nintendo DS, and it basically looks and feels like MechAssault should. Phantom War brings mech combat to the Nintendo DS. In this third-person shooter, you can control any of 18 different lumbering mechs from FASA's BattleTech universe, as well as battle armor, tanks, and gun turrets. There's a story-based campaign, spanning 24 missions, along with a multiplayer mode, which lets as many as four players slug it out in various game types on any of eight different battlefields. Controlling the different mechs and watching them lumber around the battlefield is extremely satisfying. Each mech has its own particular speed and armor characteristics, as well as weapons payload. Generally speaking, each carries an energy weapon, a projectile weapon, and a missile weapon, which can all be upgraded temporarily by picking up power-ups on the battlefield. Some models have jump jets that allow you to hover for short periods. The mechs walk sluggishly, and you won't be able to fire for a few seconds if you overheat, but these are the only restrictions placed on a process that otherwise involves aiming, locking on, and shooting. CPU opponents are slow to react, but you can't take that for granted because the campaign has a habit of keeping you outnumbered. You can use various control schemes to control the mechs. The default setup employs the directional pad for movement, the face buttons for aiming, and the shoulder triggers for jump jets and shooting. The upper screen shows the view from outside the mech, while the lower screen displays the radar and provides touch-sensitive buttons that allow players to switch weapons, activate jamming devices, and initiate the hacking ability. Using the touch-screen to activate jammers and swap weapons takes some getting used to, but the default controls are otherwise comfortable and intuitive. If the default controls aren't to your liking, you can opt for one of the three other control schemes. One simply swaps the aiming and movement controls. The other two let you aim by sliding the stylus over the touch-screen, similar to the controls in Nintendos Metroid Prime: Hunters. You have to be careful to restrict the stylus to the inner area between the touch-screen buttons, which can prove mildly annoying in the heat of battle. After a while, picking up and resituating the stylus becomes second nature, just as the case is with becoming comfortable with the touch-sensitive buttons on the lower screen. Despite the obvious downgrade in technology, Phantom War manages to capture the basic visual qualities of the Xbox MechAssault games. The fully 3D graphics displayed on the upper screen provide a clear third-person view of your mech, the surrounding environment, and whatever enemy tanks and mechs happen to be nearby. A good number of polygons and textures were put into all of the different tanks and mechs, such that their individual moving parts and paint schemes are easy to make out. Weapons have their own accompanying visual effects, such as laser bursts, ejected shell casings, and smoke trails, which lead to nicely animated explosions that range in size depending on the dimensions of the target. The ground and mountains in the surrounding environment aren't nearly as detailed, probably because the developer wanted to devote the majority of the system's resources to the mechs themselves, but, even so, there are plenty of trees, buildings, and geological features visible in each location. All along, the system manages to display everything without slowing down and maintains a sufficient draw distance such that only very distant objects ever pop in and out of view. In addition to mechs, you can control tanks, gun turrets, and battle armor in the campaign mode. The audio is just as rich in atmosphere. Although your own footsteps and weapon fire are the most prevalent sounds in the environment, each vehicle and mech contributes its own share of tank treads, plodding footsteps, and gun reports to the surrounding field of noise. Different rock-inspired music tracks add a good beat to the action without overshadowing the footsteps and gunfire that do so much to give the game its high-tech flavor. Most of all, weapon bursts and explosions are sufficiently loud. The single-player campaign also features quite a bit of spoken radio chatter, as well as a few full-motion video scenes. Anyone who has previously played either of the two Xbox MechAssault games will certainly feel right at home. While mech combat is by and large what the game is about, the single-player campaign routinely has you leaving the safety of your robot shells to access enemy computers and to hijack tanks, gun turrets, and other mechs. From the sharply produced narrative, you'll discover that your role in the story is that of a tech warrant, which is a fancy term for a MechWarrior that knows how to neurohack. As such, in addition to blowing up mechs and stepping on hapless soldiers, you'll be challenged to hack into terminals and steal vehicles whenever the need arises. These hacking opportunities take the form of basic pattern-matching minigames that are solved by dragging and dropping symbols using the touch screen. You have only a small amount of time to finish each hack, but there isn't any penalty for failure aside from having to start the hack process over again. The main wrinkle to hacking is that you have to leave your mech to do it, which makes you a ripe target clad only in battle armor. Thankfully, the game rarely leaves you mechless for long. The primary purpose of the hacking bits seems to be to give you the chance to pilot a variety of vehicles and mechs during each mission. Much like the Xbox games, this rendition of MechAssault will be most enjoyed by players who can take advantage of its multiplayer offerings. Despite everything there is to do, the single-player campaign takes only about four hours to complete. Certain missions lend themselves to replay, but the prevailing point of the campaign is to serve as a tutorial to familiarize you with the strengths of each mech and the control mechanics specific to the DS game. Also, skirmishing with friends is much more satisfying than fighting dim-witted CPU mechs. The multiplayer mode provides a good mix of game types and arenas. Game types include deathmatch, deathmatch in dense fog, team deathmatch, and two variations of king of the hill. Variables such as kill count, time limit, and number of rounds can be set, and you can restrict matches to specific classes of mechs should you feel the need to. Each of the eight arenas differs in terms of size, terrain features, and weather. They all seem to be just about the right size for matches involving two to four players. There are also plenty of trees and buildings to hide behind and destroy. To get the most out of the game, you have to take advantage of its multiplayer mode. If there are complaints to levy against the multiplayer mode, it's that not only is there no download play, there's also no means to play against people online. One of the things that made the MechAssault franchise so successful on the Xbox was that you could go online, play against strangers, and form groups dedicated to playing the game on a regular basis. The lack of online play in the DS game is pretty glaring, especially since recent games like Metroid Prime: Hunters and Star Fox Command offer the capability. As a single-player game, MechAssault: Phantom War is a solid third-person shooter that will keep mech combat fans hooked from start to finish, for as brief as that time frame happens to be. However, the game really comes into its own as a multiplayer affair, and if you can convince a couple of friends to buy it along with you, you'll all have more fun and get more out of the game. It's just too bad everybody has to be in the same room to take advantage of the game's multiplayer features."}