{"ref": "https://www.gamespot.com/reviews/call-of-duty-3-review/1900-6162413/", "date": "November 28, 2006", "game_name": "Call of Duty 3", "text": "World War II may have ended in 1945, but that hasn't stopped the axis and allies from waging war against one another on the video game front. While Xbox 360 and PlayStation 3 owners worried about Treyarch taking over the reins for Call of Duty 3, PlayStation 2 and Xbox owners already had a good idea of what to expect since the developer was behind the enjoyable Call of Duty 2: Big Red One for the PS2 and Xbox. It did not disappoint. Thanks to an intense single-player campaign, great sound, and deep online options, Call of Duty 3 plays better than its predecessor and is an all-around great first-person shooter. There's never a dull moment in Call of Duty 3. Call of Duty 3 takes place in 1944 during the Normandy Breakout. After landing successfully on the beaches of France, the allied focus was on getting the Germans out of France and liberating Paris, which was under Nazi control at the time. As was the case in the last game, you're placed in the role of several different soldiers and you'll participate in campaigns for America, Britain, Canada, and Poland. Each country's campaign has a unique storyline that is supposed to get you emotionally involved with the characters, but the stories aren't very interesting; there's a soldier with a strong distaste for the French, an overbearing sergeant, and a young radio operator who has been labeled a coward. Though the stories aren't particularly engaging, fighting for four different armies works because it gives you a sense of not only how much effort it took to wrestle control of France from the Germans, but also that it wasn't just the United States that lost men and women in World War II. The game opens with a brief training mission where you'll learn how to fire weapons and throw grenades, as well as how to move around. The controls are easy to learn, yet they allow for many different actions. You can fire your weapon with a quick pull of the right trigger or R1, but this doesn't allow for much accuracy. For precision aiming, you'll want to pull the left trigger or L1, which raises your gun to eye level and lets you use the weapon's sight. You can also perform a melee attack with your weapon if you find yourself out of ammo or simply don't have time to aim. Clicking the left analog stick brings up your binoculars--an unfortunate button-mapping choice because it's far too easy to accidentally push the stick down when you're scrambling for your life. You can toss smoke grenades to create cover and frag grenades to clear large groups of Wehrmacht. Call of Duty 3 also lets you scoop up grenades thrown by the enemy and toss them back. To prevent your grenades from being returned to sender, you can ~cook~ a grenade, which lets it get closer to detonating, before you throw it. This is an important technique to master--not only because it's useful, but also because screwing it up results in a grenade exploding in your hands. Because there's no health bar in the game, you'll need to watch the screen when you're getting hit. As you get shot, the edges of the screen turn crimson and close in around you the more you get hit. Should you fall victim to a grenade or a bullet and not die, all you have to do is seek shelter to recover your health. After your training is complete, you hop in the back of a truck and ride into battle. When you get out of the truck, or rather are blown out of the truck by an explosion, you're boosted over the cemetery wall. Here, you'll find yourself in the midst of one of the most impressive firefights in any first-person shooter to date. Everywhere you look, there's carnage. Bullets and grenades whiz through the air while bombs explode all around, leaving soldiers to scramble for whatever cover they can find--be it a bombed-out mausoleum or a grave stone. The bodies of your fallen comrades are strewn about the battlefield--a stark reminder that unless you want to join them, you need to keep moving. A later level sees you making your way across a pasture using a tank (and even the carcasses of dead cows) as cover to shield yourself from the Nazi soldiers who surround the field. Most of the rest of the game's 14 missions aren't quite as intense as these two examples, but there's rarely a dull moment to be found. Close-quarters combat is a new, albeit uninteresting addition. Call of Duty 3 isn't a run-and-gun FPS, but it's not as slow-paced as a tactical shooter, either. You'll fight alongside CPU-controlled soldiers, and you'll generally need to stay behind cover, pick off as many soldiers as you can, and then advance to the next safe location. Since you spend so much time behind cover, it would have been nice to have the ability to lean, but you can do pretty well without it. Because the game's artificial intelligence appears ~smarter~ than a typical FPS, it can be frustrating to be unable to clear a particular section because of cheap tricks like how new enemies will spawn to replace fallen soldiers in outdoor levels (they don't do this indoors). But once you come to grips with the fact that you can't kill them all, it shouldn't bother you much. You still need to be careful not to shoot fellow soldiers, but the game is forgiving and the level doesn't instantly end when you fire that first bullet into your comrade's chest. Call of Duty 3 isn't a terribly difficult game on the default setting, nor is it particularly lengthy, clocking in at 8 to 10 hours from start to finish. On the default difficulty, enemy soldiers aren't very aggressive and they'll follow the same patterns over and over, so it's easy to sit back and wait for them to show themselves. Series veterans looking for more of a challenge will want to bump up the difficulty to hard or veteran, as doing so results in a vastly different and more intense experience. Enemies are much more aggressive, they're better shots, and your health disappears much quicker. Mission objectives are varied but don't stray far from what you'd expect from the type of first-person shooter that takes place in World War II. Sometimes you'll simply need to get from point A to point B, while other times you'll need to defend an area from attack, rescue hostages, or plant explosives. You'll also have to use your binoculars to mark targets for air strikes, man stationary guns, and even ride in the back of a jeep and pick off bad guys with the jeep's machine gun. Rather than a single path to success, there are multiple ways to approach missions. Sometimes the game presents you with clear-cut options, while other times you'll have to find them on your own. Each objective is shown as a star on your radar, making them easy to find even in the heat of battle. A few new twists have been added to the gameplay, but they don't necessarily make the game better, nor do they make it worse. Rather than just hitting a button to plant a bomb and then running away, you'll need to hit a button, rotate the analog stick a few times to insert the fuse, and then hit a button to arm the bomb. There's also a new close-quarters battle mechanic that takes place when you're surprised by an enemy. These scripted events have you rapidly alternating pressing the left and right triggers (or L1 and R1) to fight off your attacker and then pressing a face button to finish them off. Some of the scenes look pretty cool, but the mechanics are boring and there are less than 10 of these situations in the entire game, so they're rather worthless. Not all of the game's action takes place with you on foot. There are a few missions that place you in the driver's seat of a jeep, and it's your job to follow the checkpoints and avoid enemy fire while escaping from an area or rescuing hostages. A couple of other scenarios have you behind the controls of a tank and you'll need to eliminate enemy tanks and armored vehicles. The driving missions aren't particularly exciting, but the controls are forgiving enough to make them sort of fun, and if nothing else, they do mix up the gameplay a bit. The tanks are unwieldy at first, but once you get the hang of them, it's a blast driving around and blowing stuff up. If you're not blowing something up, you're doing something wrong. Call of Duty 2 had an impressive multiplayer component and was quite popular online. Call of Duty 3 is poised to be just as popular. Call of Duty 3 for the old consoles doesn't match the 24 players that are able to play at one time on the Xbox 360, but both the PS2 and Xbox versions can accommodate 16 players at once, and the Xbox supports system link play, too. There are eight different multiplayer maps in the Xbox version and seven on the PlayStation 2. Six different match types are available for play, including team battles, capture the flag, headquarters, and more. If you're looking to play as something other than a basic soldier, there are seven different kits to choose from, including a medic who can revive players and a support soldier that delivers ammo. And you won't have to hoof it all the time, either. There are vehicles in a few of the levels, adding even more depth to an already deep multiplayer experience. The Xbox version ran smoothly online, though there were a few instances of lag here and there. The PlayStation 2 didn't fare quite so well. The frame rate was slow and choppy, but it was still quite playable. The biggest problem with the PS2 version is that there's no network adapter utility included, so if you have to make any changes to your network settings and don't have the original disc that came with the adapter, you're out of luck. It's worth noting that we encountered a handful of bugs in the single-player campaign. None of these prevented the game from being completed, but they did force us to restart levels from previously saved checkpoints. In a couple of instances our soldier got stuck in place when trying to walk over debris. Later in the game we were supposed to meet up with our squad, but were unable to do so because the event wouldn't trigger and we couldn't open the door. Other nuisances included guns that we needed getting stuck in walls and we got temporarily stuck a few times because a computer-controlled soldier had stopped in front of us, while another stopped right behind us. Call of Duty 3's visuals are mostly good, though you'll have a hard time appreciating them if you've seen the Xbox 360 or PlayStation 3 versions. Whether it's a farm in the French countryside or a war-torn village, each level is nicely detailed and looks good. The outdoor environments are impressive, and though you'll run into an invisible wall should you stray too far, smart level design makes them feel larger than they really are. There are plenty of lush bushes, thick grass, and large trees to use as cover, too, and there are lots of great effects to enjoy. Throwing a smoke grenade results in a thick cloud of smoke so dense and so realistic that you'll sometimes find yourself squinting in an effort to see better, and explosions from grenades, rockets, and bombs are similarly impressive. There are a couple of visual issues that mar the otherwise great graphics. The levels are full of blurry textures, and they're not helped by the game's bland color palette. Everything's brown and gray. This is particularly a problem when you're trying to discern an enemy soldier from a tree or some other fuzzy object from afar. The frame rate, while not bad on the Xbox, struggles to keep up at times on the PlayStation 2. Another area that's lacking is the animation. Both your squadmates and your enemies jump from one action to the next and often warp from one place to another. Soldiers both alive and dead will occasionally get stuck in walls and even float in midair. It's also possible to see the sparks from weapons fire through solid walls. The cutscenes look nice, but they can't be skipped, even if you've already watched them. Call of Duty 3 sounds great, even if you're listening to it through your TV's built-in speakers. But if you've got your system hooked up to a surround-sound setup, the game sounds phenomenal. You'll hear bullets coming from all directions and explosions will rattle your (and your neighbor's) walls. The chatter from both your fellow soldiers and your enemies not only adds to the atmosphere, but also provides helpful clues as to what you need to do next. Your squadmates will direct you to the next checkpoint or cover, and listening to Nazi soldiers will let you know their tactics as well as if your presence has been detected. Joel Goldsmith (Star Trek: First Contact, Stargate SG-1) has written a gorgeous orchestral soundtrack that elevates the presentation to another level. Performed by the Slovak Symphony Orchestra, the majestic score is on par with that of any major motion picture. It's a shame there's no option to just listen to the music from the game--it's that good. Call of Duty 3's action is fast-paced, and the sound effects and music are some of the best in any game this year. Treyarch did a fine job of bringing all of the great action of the PS3 and 360 versions onto the significantly less powerful Xbox and PS2. Thanks to slightly better graphics and smoother online play, the Xbox version is preferable over the PlayStation 2 version, but even with some technical issues, the game is still great on the PS2. If the Call of Duty series hasn't won you over previously, Call of Duty 3 isn't going to do much to change your mind. But for anyone else, Call of Duty 3 is a must-own. A few new twists have been added to the gameplay, but they don't necessarily make the game better, nor do they make it worse. Rather than just hitting a button to plant a bomb and then running away, you'll need to hit a button, rotate the analog stick a few times to insert the fuse, and then hit a button to arm the bomb. There's also a new close-quarters battle mechanic that takes place when you're surprised by an enemy. These scripted events have you rapidly alternating pressing the left and right triggers (or L1 and R1) to fight off your attacker and then pressing a face button to finish them off. Some of the scenes look pretty cool, but the mechanics are boring and there are less than 10 of these situations in the entire game, so they're rather worthless. Not all of the game's action takes place with you on foot. There are a few missions that place you in the driver's seat of a jeep, and it's your job to follow the checkpoints and avoid enemy fire while escaping from an area or rescuing hostages. A couple of other scenarios have you behind the controls of a tank and you'll need to eliminate enemy tanks and armored vehicles. The driving missions aren't particularly exciting, but the controls are forgiving enough to make them sort of fun, and if nothing else, they do mix up the gameplay a bit. The tanks are unwieldy at first, but once you get the hang of them, it's a blast driving around and blowing stuff up. If you're not blowing something up, you're doing something wrong. Call of Duty 2 had an impressive multiplayer component and was quite popular online. Call of Duty 3 is poised to be just as popular. Call of Duty 3 for the old consoles doesn't match the 24 players that are able to play at one time on the Xbox 360, but both the PS2 and Xbox versions can accommodate 16 players at once, and the Xbox supports system link play, too. There are eight different multiplayer maps in the Xbox version and seven on the PlayStation 2. Six different match types are available for play, including team battles, capture the flag, headquarters, and more. If you're looking to play as something other than a basic soldier, there are seven different kits to choose from, including a medic who can revive players and a support soldier that delivers ammo. And you won't have to hoof it all the time, either. There are vehicles in a few of the levels, adding even more depth to an already deep multiplayer experience. The Xbox version ran smoothly online, though there were a few instances of lag here and there. The PlayStation 2 didn't fare quite so well. The frame rate was slow and choppy, but it was still quite playable. The biggest problem with the PS2 version is that there's no network adapter utility included, so if you have to make any changes to your network settings and don't have the original disc that came with the adapter, you're out of luck. It's worth noting that we encountered a handful of bugs in the single-player campaign. None of these prevented the game from being completed, but they did force us to restart levels from previously saved checkpoints. In a couple of instances our soldier got stuck in place when trying to walk over debris. Later in the game we were supposed to meet up with our squad, but were unable to do so because the event wouldn't trigger and we couldn't open the door. Other nuisances included guns that we needed getting stuck in walls and we got temporarily stuck a few times because a computer-controlled soldier had stopped in front of us, while another stopped right behind us. Call of Duty 3's visuals are mostly good, though you'll have a hard time appreciating them if you've seen the Xbox 360 or PlayStation 3 versions. Whether it's a farm in the French countryside or a war-torn village, each level is nicely detailed and looks good. The outdoor environments are impressive, and though you'll run into an invisible wall should you stray too far, smart level design makes them feel larger than they really are. There are plenty of lush bushes, thick grass, and large trees to use as cover, too, and there are lots of great effects to enjoy. Throwing a smoke grenade results in a thick cloud of smoke so dense and so realistic that you'll sometimes find yourself squinting in an effort to see better, and explosions from grenades, rockets, and bombs are similarly impressive. There are a couple of visual issues that mar the otherwise great graphics. The levels are full of blurry textures, and they're not helped by the game's bland color palette. Everything's brown and gray. This is particularly a problem when you're trying to discern an enemy soldier from a tree or some other fuzzy object from afar. The frame rate, while not bad on the Xbox, struggles to keep up at times on the PlayStation 2. Another area that's lacking is the animation. Both your squadmates and your enemies jump from one action to the next and often warp from one place to another. Soldiers both alive and dead will occasionally get stuck in walls and even float in midair. It's also possible to see the sparks from weapons fire through solid walls. The cutscenes look nice, but they can't be skipped, even if you've already watched them. Call of Duty 3 sounds great, even if you're listening to it through your TV's built-in speakers. But if you've got your system hooked up to a surround-sound setup, the game sounds phenomenal. You'll hear bullets coming from all directions and explosions will rattle your (and your neighbor's) walls. The chatter from both your fellow soldiers and your enemies not only adds to the atmosphere, but also provides helpful clues as to what you need to do next. Your squadmates will direct you to the next checkpoint or cover, and listening to Nazi soldiers will let you know their tactics as well as if your presence has been detected. Joel Goldsmith (Star Trek: First Contact, Stargate SG-1) has written a gorgeous orchestral soundtrack that elevates the presentation to another level. Performed by the Slovak Symphony Orchestra, the majestic score is on par with that of any major motion picture. It's a shame there's no option to just listen to the music from the game--it's that good. Call of Duty 3's action is fast-paced, and the sound effects and music are some of the best in any game this year. Treyarch did a fine job of bringing all of the great action of the PS3 and 360 versions onto the significantly less powerful Xbox and PS2. Thanks to slightly better graphics and smoother online play, the Xbox version is preferable over the PlayStation 2 version, but even with some technical issues, the game is still great on the PS2. If the Call of Duty series hasn't won you over previously, Call of Duty 3 isn't going to do much to change your mind. But for anyone else, Call of Duty 3 is a must-own."}