{"ref": "https://www.gamespot.com/reviews/call-of-duty-3-review/1900-6162053/", "date": "November 19, 2006", "game_name": "Call of Duty 3", "text": "World War II may have ended in 1945, but that hasn't stopped the Axis and Allies from waging war against one another on the video game front. And now there's a new battleground: the Wii. Call of Duty 3 for the Wii has the same great single-player campaign found in other versions of the game, though it's missing multiplayer options, and not all aspects of the new control scheme work well. But the overall intensity and playability of Call of Duty 3 remain intact, making for an exciting first-person shooter experience despite these issues. There's practically never a dull moment in Call of Duty 3. Call of Duty 3 takes place in 1944 during the Normandy Breakout. After landing successfully on the beaches of France, the Allies focused on getting the Germans out of France and liberating Paris, which was under Nazi control at the time. As was the case in the last game, you're placed in the role of several different soldiers, and you'll participate in campaigns for America, Britain, Canada, and Poland. Each country's campaign has a unique storyline that is supposed to get you emotionally involved with the characters, but the stories aren't very interesting; there's a soldier with a strong distaste for the French, an overbearing sergeant, and a young radio operator who has been labeled a coward. Though the stories aren't particularly engaging, fighting for four different armies works because it gives you a sense of how much effort it took to wrest control of France from the Germans and that it wasn't just the United States that lost men and women in World War II. The game opens with a brief training mission. Here, you'll learn how to fire weapons and throw grenades, as well as how to move around. The training mission is sufficient in other versions of the game where you just have to learn how the buttons are mapped on a standard controller, but here you're learning a whole new control scheme, and the training doesn't get the job done. You'll have to learn on the fly, which initially means a lot of frustrating deaths as you fumble with the controls. Movement is controlled by the analog stick on the Wii's Nunchuk. You look around and aim by pointing the Wii Remote at the screen and moving it. Moving your reticle around the inside portion of the screen affects your aim, while moving it near the edges makes you look up and down or turn left and right. You can fire your weapon by pressing the B button, but this doesn't allow for much accuracy. For precision aiming, you'll want to press and hold A, which raises your gun to eye level and lets you use the weapon's sight. The basic mechanics work quite well and are the easiest aspect of the controls to learn, though it will be quite a while before you're a crack shot. There are a couple of alternate control schemes, but each one is limited in some way by the physical position of the buttons on the Wii Remote--specifically, any move mapped to the D pad. Any time you need to hit the D pad you've got to adjust your grip slightly, and this causes the remote to move, which in turn alters where you're looking or aiming. This makes it extremely difficult to throw smoke or frag grenades with any accuracy. An alternate control scheme lets you toss grenades by making a throwing motion with the Nunchuk. This feels neat when it works, but you still have to press the D pad to select the grenade, and sometimes the game doesn't recognize your throwing motion. You can perform a melee attack by pressing down on the remote or by moving the remote forward. Once again, this almost always screws up your onscreen view. Close-quarters combat is an uninteresting but new addition to the series. There are other surprises in store. Rather than hitting a button to plant a bomb and then running away, you'll put in the fuse by moving the remote, rotate the Nunchuk a few times to twist the fuse, and then pull back on the remote to arm the bomb. There's also a close-quarters battle mechanic that takes place when you're surprised by an enemy. Some of the scenes look pretty cool, but the mechanics are boring, and there are less than 10 of these situations in the entire game, so they're rather worthless. These scripted events have you rapidly moving the Wii Remote and the Nunchuk forward and back to fight off your attacker and then make a sweeping motion to finish him off. The game tells you to turn the controls sideways here, but that doesn't seem to work--keeping them perfectly straight works best. Not all of the game's action takes place with you on foot. There are a few missions that place you in the driver's seat of a jeep, and it's your job to follow the checkpoints and avoid enemy fire while escaping from an area or rescuing hostages. You'll need to hold the remote and Nunchuk in the 9 and 3 o'clock position to steer. Like many other aspects of the controls, this takes getting used to, and even when you get the hang of it, it doesn't add a whole lot to the game. The game starts with a bang. After your training is complete, you hop in the back of a truck and ride into battle. When you get out of the truck, or rather are blown out of the truck by an explosion, you're boosted over the cemetery wall. Here, you'll find yourself in the midst of one of the more impressive firefights in any first-person shooter. Everywhere you look, there's carnage. Bullets and grenades whiz through the air while bombs explode all around, leaving soldiers to scramble for whatever cover they can find--be it a bombed-out mausoleum or a gravestone. The bodies of your fallen comrades are strewn about the battlefield--a stark reminder that unless you want to join them, you need to keep moving. A later level sees you making your way across a pasture using a tank (and even the carcasses of dead cows) as cover to shield yourself from the Nazi soldiers who surround the field. Most of the rest of the game's 14 missions aren't quite as intense as these two examples, but there's rarely a dull moment to be found. If stuff's not blowing up, you're doing something wrong. Call of Duty 3 isn't a run-and-gun FPS, but it's not as slow-paced as a tactical shooter, either. You'll fight alongside CPU-controlled soldiers, and you'll generally need to stay behind cover, pick off as many soldiers as you can, and then advance to the next safe location. Because there's no health bar in the game, you'll need to watch the screen when you're getting hit. As you get shot, the edges of the screen turn crimson and close in around you the more you get hit. Should you fall victim to a grenade or a bullet and not die, all you have to do is seek shelter to recover your health. Because the game's artificial intelligence initially appears ~smarter~ than in a typical FPS, it can be frustrating to be unable to clear a particular section because of cheap tricks like how new enemies will spawn to replace fallen soldiers in outdoor levels (they don't do this indoors). But once you come to grips with the fact that you can't kill them all, it shouldn't bother you much. You still need to be careful not to shoot fellow soldiers, but the game is forgiving--you're not forced to restart when you fire that first bullet into your comrade's chest. Call of Duty 3 isn't a terribly difficult game on the default setting, nor is it particularly lengthy, clocking in at 8 to 10 hours from start to finish. On the default difficulty, enemy soldiers aren't very aggressive--even less so here than on the other consoles, probably to help compensate for the sometimes unwieldy controls. They'll also follow the same patterns over and over, so it's easy to sit back and wait for them to show themselves. Series veterans looking for more of a challenge will want to bump up the difficulty to hard or veteran, because doing so results in a vastly different and more intense experience. Enemies are much more aggressive, they're better shots, and your health disappears more quickly. Call of Duty 3's mission objectives are varied but don't stray far from what you'd expect from the type of first-person shooter that takes place in World War II. Sometimes you'll simply need to get from point A to point B, while other times you'll need to defend an area from attack, rescue hostages, or plant explosives. You'll also have to use your binoculars to mark targets for air strikes, man stationary guns, and even ride in the back of a jeep and pick off bad guys with the jeep's machine gun. A couple of other scenarios have you behind the controls of a tank, and you'll need to eliminate enemy tanks and armored vehicles. Rather than there being a single path to success, there are occasionally multiple ways to approach missions. Sometimes the game presents you with clear-cut options, while other times you'll have to find them on your own. Each objective is shown as a star on your radar, making them easy to find even in the heat of battle. One of the game's biggest strengths on other systems is its great multiplayer play. Since the Wii version doesn't even have split-screen multiplayer, much less online play, its omission is the game's single biggest weakness. The cutscenes look nice, but they can't be skipped, even if you've already watched them. It's worth noting that we encountered a handful of bugs in the single-player campaign. None of these prevented the game from being completed, but they did force us to restart levels from previously saved checkpoints. In several instances our soldier got stuck in the floor, and we got temporarily stuck a few times because one computer-controlled soldier had stopped in front of us while another had stopped right behind us. The most annoying glitch is that the CPU can see through, walk through, and shoot through walls and doors, which leads to many frustrating deaths. Sometimes there are glitches that work to your benefit, like when your squadmates shoot at people one floor above you through the ceiling, even though they can't see them. Once in a while they'll actually kill someone this way, and if nothing else, their fire warns you that there are bad guys waiting up ahead. Call of Duty 3's visuals are mostly good, though you'll have a hard time appreciating them if you've seen the Xbox 360 or PlayStation 3 versions. Whether it's a farm in the French countryside or a war-torn village, each level is nicely detailed and looks good. The outdoor environments are impressive, and though you'll run into an invisible wall should you stray too far, smart level design makes them feel larger than they really are. There are plenty of lush bushes, thick grass, and large trees to use as cover, too, and there are lots of great effects to enjoy. Throwing a smoke grenade results in a thick cloud of smoke so dense and so realistic that you'll sometimes find yourself squinting in an effort to see better, and explosions from grenades, rockets, and bombs are similarly impressive. There are a couple of visual issues that mar the otherwise good graphics. The levels are full of blurry textures, and they're not helped by the game's bland color palette. Everything's brown and gray. This is particularly a problem when you're trying to discern an enemy soldier from a tree or some other fuzzy object from afar. The frame rate, while not bad, struggles to keep up at times. Another area that's lacking is the animation. Both your squadmates and your enemies jump from one action to the next and often warp from one place to another. Soldiers both alive and dead will occasionally get stuck in walls and even float in midair. It's also possible to see the sparks from weapons fire through solid walls. There are plenty of different guns for every occasion. Call of Duty 3 sounds great, even if you're listening to it through your TV's built-in speakers. But if you've got your Wii hooked up to a surround-sound setup, the game sounds phenomenal in Pro-Logic II. You'll hear bullets coming from all directions, and explosions will rattle your (and your neighbor's) walls. The chatter from your fellow soldiers and your enemies not only adds to the atmosphere, but also provides helpful clues as to what you need to do next. Your squadmates will direct you to the next checkpoint or cover, and listening to Nazi soldiers will let you know their tactics as well as whether your presence has been detected. Joel Goldsmith (Star Trek: First Contact, Stargate SG-1) has written a gorgeous orchestral soundtrack that elevates the presentation to another level. Performed by the Slovak Symphony Orchestra, the majestic score is on par with that of any major motion picture. It's a shame there's no option to just listen to the music from the game--it's that good. Call of Duty 3's action is fast-paced, and the sound effects and music are some of the best in any game this year. However, a complete lack of multiplayer really hurts the game's value when compared to other versions or to other first-person shooters in general. The basic controls are good, but the Wii just isn't designed for games that require so many different inputs. It's hard to shake the feeling that the game would have played better had it been designed for the Wii from the ground up, but for those who consider themselves fans of the series and who don't mind learning a vastly different control scheme, Call of Duty 3 is worth a look. Call of Duty 3's mission objectives are varied but don't stray far from what you'd expect from the type of first-person shooter that takes place in World War II. Sometimes you'll simply need to get from point A to point B, while other times you'll need to defend an area from attack, rescue hostages, or plant explosives. You'll also have to use your binoculars to mark targets for air strikes, man stationary guns, and even ride in the back of a jeep and pick off bad guys with the jeep's machine gun. A couple of other scenarios have you behind the controls of a tank, and you'll need to eliminate enemy tanks and armored vehicles. Rather than there being a single path to success, there are occasionally multiple ways to approach missions. Sometimes the game presents you with clear-cut options, while other times you'll have to find them on your own. Each objective is shown as a star on your radar, making them easy to find even in the heat of battle. One of the game's biggest strengths on other systems is its great multiplayer play. Since the Wii version doesn't even have split-screen multiplayer, much less online play, its omission is the game's single biggest weakness. The cutscenes look nice, but they can't be skipped, even if you've already watched them. It's worth noting that we encountered a handful of bugs in the single-player campaign. None of these prevented the game from being completed, but they did force us to restart levels from previously saved checkpoints. In several instances our soldier got stuck in the floor, and we got temporarily stuck a few times because one computer-controlled soldier had stopped in front of us while another had stopped right behind us. The most annoying glitch is that the CPU can see through, walk through, and shoot through walls and doors, which leads to many frustrating deaths. Sometimes there are glitches that work to your benefit, like when your squadmates shoot at people one floor above you through the ceiling, even though they can't see them. Once in a while they'll actually kill someone this way, and if nothing else, their fire warns you that there are bad guys waiting up ahead. Call of Duty 3's visuals are mostly good, though you'll have a hard time appreciating them if you've seen the Xbox 360 or PlayStation 3 versions. Whether it's a farm in the French countryside or a war-torn village, each level is nicely detailed and looks good. The outdoor environments are impressive, and though you'll run into an invisible wall should you stray too far, smart level design makes them feel larger than they really are. There are plenty of lush bushes, thick grass, and large trees to use as cover, too, and there are lots of great effects to enjoy. Throwing a smoke grenade results in a thick cloud of smoke so dense and so realistic that you'll sometimes find yourself squinting in an effort to see better, and explosions from grenades, rockets, and bombs are similarly impressive. There are a couple of visual issues that mar the otherwise good graphics. The levels are full of blurry textures, and they're not helped by the game's bland color palette. Everything's brown and gray. This is particularly a problem when you're trying to discern an enemy soldier from a tree or some other fuzzy object from afar. The frame rate, while not bad, struggles to keep up at times. Another area that's lacking is the animation. Both your squadmates and your enemies jump from one action to the next and often warp from one place to another. Soldiers both alive and dead will occasionally get stuck in walls and even float in midair. It's also possible to see the sparks from weapons fire through solid walls. There are plenty of different guns for every occasion. Call of Duty 3 sounds great, even if you're listening to it through your TV's built-in speakers. But if you've got your Wii hooked up to a surround-sound setup, the game sounds phenomenal in Pro-Logic II. You'll hear bullets coming from all directions, and explosions will rattle your (and your neighbor's) walls. The chatter from your fellow soldiers and your enemies not only adds to the atmosphere, but also provides helpful clues as to what you need to do next. Your squadmates will direct you to the next checkpoint or cover, and listening to Nazi soldiers will let you know their tactics as well as whether your presence has been detected. Joel Goldsmith (Star Trek: First Contact, Stargate SG-1) has written a gorgeous orchestral soundtrack that elevates the presentation to another level. Performed by the Slovak Symphony Orchestra, the majestic score is on par with that of any major motion picture. It's a shame there's no option to just listen to the music from the game--it's that good. Call of Duty 3's action is fast-paced, and the sound effects and music are some of the best in any game this year. However, a complete lack of multiplayer really hurts the game's value when compared to other versions or to other first-person shooters in general. The basic controls are good, but the Wii just isn't designed for games that require so many different inputs. It's hard to shake the feeling that the game would have played better had it been designed for the Wii from the ground up, but for those who consider themselves fans of the series and who don't mind learning a vastly different control scheme, Call of Duty 3 is worth a look."}