{"ref": "https://www.gamespot.com/reviews/call-of-duty-roads-to-victory-review/1900-6167566/", "date": "March 16, 2007", "game_name": "Call of Duty 3", "text": "Medal of Honor and Brothers in Arms have already found their way to the PlayStation Portable, so it was only a matter of time before Activision's WWII-based first-person shooter series Call of Duty made the trek to Sony's handheld. First-person shooters have had a hit-or-miss track record on the PSP, but for the most part, they've been misses. Chalk another one up for the ~miss~ column with Call of Duty: Roads to Victory. It's entertaining for a few levels, but it quickly grows dull thanks to predictable, uninspired gameplay and a smattering of game-crashing bugs. Shooting down planes is the most fun part of the game. Call of Duty: Roads to Victory follows the same basic formula established by previous games in the series. Over the course of 14 levels, you'll lead American, Canadian, and British troops into battle in an effort to rid France of those oh-so-pesky Nazis. Weaving a strong narrative has never been one of the strengths of the series, but the story here is even less engaging than usual. There's a brief black-and-white newsreel clip that plays before each country's campaign and a short text intro before each level, but other than that, the story is completely nonexistent. Developers have had a tough time nailing down a solid control scheme for first-person shooters on the PSP, but progress has been made. There are four different control schemes available in Roads to Victory, but the default scheme works well. You move with the analog stick, look and aim with the face buttons, raise your weapon with the left shoulder button, and fire with the right shoulder button. Because the auto-aiming function is forgiving, it's easy to use the face buttons to aim. With your weapon down, all you have to do is look in the general vicinity of an enemy to lock on to your enemy. When this system works, it's great. But it doesn't always work. Some weapons have a very short lock-on range, and you've got to be super close to target an enemy soldier. It can also be quite difficult to lock on to moving targets, and sometimes the buttons don't seem to respond. Close-quarters encounters are made difficult thanks to the ineffectiveness of your melee attack, which is difficult to perform because it's mapped to the fire button. It's basically up to the game whether or not you're going to fire a shot or try to club the enemy with your weapon. Other actions, such as throwing grenades, crouching, and switching weapons, are mapped to the D pad. This works fairly well. Roads to Victory is quite a bit like Call of Duty 3 on the PlayStation 2. In fact, it kind of feels as if the game were made using a Call of Duty 3 map editor. This means you'll use the same weapons and take part in the same sorts of missions during the game's 14 levels. You'll take retake bunkers, plant bombs, find and deliver documents, man large machine guns in an effort to fend off waves of soldiers, and use rocket launchers to take out more than a few tanks. The only new style of mission is one where you man the guns of a plane on a bombing run and are charged with protecting the squadron of planes from enemy aircraft. The missions are fun for a while, but if you've ever played Call of Duty games before, they start to become predictable to the point of absurdity. You know that when you kill one soldier, another will spawn and take his place, and that as soon as you climb a stairwell, you need to turn and fire because there's a guy waiting to shoot you. You'll even have a good idea of where soldiers will be placed before you walk into a room. There are a few other issues that keep the combat from being fun for more than a few levels. Although the controls are pretty good, they're still not on par with those on a console or PC. To compensate for this, enemy artificial intelligence is quite poor. Sometimes you'll be just a few feet away from soldiers, but they won't have been ~activated,~ and they'll stand next to you, staring off into space. Even when you shoot them, they'll stand out in the open and take fire. The poor AI, combined with frequent respawning of soldiers, makes it feel as if you're playing some sort of WWII-themed shooting gallery at times. Enemy AI might be poor, but that doesn't mean you won't die. Getting blown away by unseen fire is commonplace thanks to enemies that shoot at you from offscreen and kill you before you're able to turn and locate them. While the levels typically take about 15 minutes to beat (if you don't die), there are no midlevel save points, and the game saves your progress only at the end of the level. This would be a mere inconvenience if it weren't for the fact that you must replay entire levels when the game crashes. We experienced several freezing-and-crashing issues, particularly later in the game. Roads to Victory's multiplayer is also a letdown. Up to six players can play deathmatch, capture the flag, king of the hill, and a few other modes via an ad hoc connection, but there's no online play to speak of, and there's no game sharing either. From a technical standpoint, Call of Duty's visuals are fine. While the level of chaos onscreen doesn't come anywhere close to that of the consoles, there are always numerous things happening onscreen, whether it's explosions, gunfire, attacking soldiers, fire, or smoke. The levels aren't particularly large, and they're completely linear, but they're nicely detailed. Artistically, the game doesn't fare quite as well. You'll see the same style of bombed-out buildings, trenches, bushes, fields, and even the same wallpaper inside homes as you've seen in other COD games. Each level is painted in a drab palette of brown and gray, which--had it not been overdone--would have been fine because after all, you're in bombed-out French cities, not Hawaii. Unfortunately, with everything so dark, it's difficult to pick out enemies, even when they're firing at you. If you've ever played Call of Duty before, you know what to do here. One of the most disappointing aspects of Roads to Victory is its audio. The weapon fire and explosions are plentiful, but the sound effects don't have much oomph to them. The voice acting isn't on the same level as in other COD games. The dialogue also sounds compressed and tinny. Even the music, which is normally one of the series' biggest strengths, is disappointing here. You'll hear the familiar theme from COD3 in the title screen, but you won't hear any music during the levels other than a few extremely short snippets here and there. Call of Duty: Roads to Victory isn't a terrible game--it's just unnecessary. While it may look like Call of Duty and for a while feel like Call of Duty, nearly all of the things that make the Call of Duty games so enjoyable are watered down or missing."}