{"ref": "https://www.gamespot.com/reviews/rtx-red-rock-review/1900-6030241/", "date": "June 18, 2003", "game_name": "RTX Red Rock", "text": "LucasArts' RTX Red Rock serves as an example of what happens when various aspects of a game are so poorly executed that they ultimately turn the entire experience of playing the game into a frustrating chore. The action elements in this third-person action game are just plain sloppy due in large part to a poor lock-on targeting system and a cumbersome inventory system. The adventure portions of the game are mostly tedious fetch quests, which can often be difficult to complete even when it's plainly obvious where the object is located on the map--though it's worth noting that in some missions, you might as well be wearing a blindfold because you'll eventually stumble upon the correct door or passageway. To make matters worse, there are a few issues with collision detection, the worst of which causes you to fall right through platforms. RTX seems promising at first... If RTX Red Rock has any redeeming quality, it's the storyline, but the plot isn't exactly the most original piece of storytelling in a video game. In fact, it seems that those responsible for the story realized this and so they wrote a few lines of dialogue to make fun of the generic nature of the story. In any case, you play as former Army Ranger Wheeler, who lost his left eye and part of his right arm during one of his previous operations. These were replaced with high-tech implants, making him one of the most elite soldiers on the RTX (radical tactics expert) roster. He gets called to Mars to check on the status of a colony that is reportedly under attack by LED (light-emitting demon) forces. As you progress through the game, you'll learn more about what has happened to the Mars colony and that the stakes are much higher than initially suspected. Unfortunately, the story just isn't involving or interesting enough to draw you back into the game or overlook its shortcomings, such as its combat system. Like in most 3D action games, combat in RTX Red Rock is based on the lock-on system, which lets you focus on a single target as both your character and the enemy attempt to maneuver around the environment. However, not only does the lock-on system have trouble actually locking onto enemies that are three feet in front of Wheeler, but you often have to maneuver yourself around before that particular feature kicks in. Of course, in some cases, by the time you've moved into a position where the lock-on actually works, you've already taken a good deal of damage, and to their credit, the enemies in the game are pretty good about taking cover when coming under fire. In addition, while you'll get some stronger weapons later on in the game, the few weapons that Wheeler is equipped with in the early stages of the game are not all that useful. With the combat being so weak, you might expect the adventure aspects of the game to take over the burden of making the game entertaining to play, but this doesn't happen in RTX Red Rock. When you begin a mission, you'll be given a briefing by Wheeler's computer assistant, Iris. She'll basically tell you which items you need to find and where to find them by uploading maps into the green version of Wheeler's ocular implant--there are different color-coded versions of this implant that let Wheeler view different spectrums. These maps are quite useful for locating specific items, and you shouldn't have any substantial problems finding them within a few minutes, but the problem is that this represents most of the adventuring in the game--being told where to go and what to find--and it gets tedious really fast. Of course, the trade-off is not being told where to go or what you're supposed to be looking for, and not surprisingly, that happens in RTX Red Rock as well. There are times when you won't have a clear indication of where to go, and since there are plenty of places to explore in Red Rock's environments, you'll only stumble upon the correct door or passageway after a lot of wandering around. The list of problems in RTX Red Rock is completed with the inventory system, which is probably one of the bulkiest inventory systems in any action adventure game to date. Basically, you have three slots for three different types of items--weapons, special items, and Wheeler's eye piece. When you get further into the game and start to get more items, you'll have to press the D-pad several times to get to the item that you want. It's annoying when there isn't a whole lot of action going on around you, and it's even worse when you're engaged in a boss fight and have to switch between using health items and your weapons, which essentially leaves you open to enemy attack. Unfortunately, the technical aspects of RTX Red Rock are about on par with the rest of the game. The environments are initially pretty impressive, and there are some cool technical effects--such as the bio spectrum scan that lets you see entire structures and items that aren't visible with normal sight. But you'll start to realize that certain locations look a little familiar and that there's not a whole lot of variety. The character model for Wheeler is decent, but it's obvious that he's lacking some detail, particularly in his face. Meanwhile, the LEDs look pretty horrible, and it's clear that they weren't supposed to be highly detailed creatures so that the game could maintain a decent frame rate, which it has difficulty doing. RTX Red Rock's frame rate constantly jumps around, but it doesn't get so bad that the game is made completely unplayable. ...but you'll quickly discover the game's numerous problems. As for sound, the music takes a backseat to pretty much everything else. It's not bad by any means, but something a little more dramatic helped make the game seem more entertaining. The voice acting for Wheeler, Iris, and other characters in the game is pretty good. But Wheeler has the most memorable performance, and his cocky attitude comes across pretty well. RTX Red Rock is one of those games that has a promising concept, but just doesn't pan out. The result is an experience that is absolutely marred by several problems working in conjunction with each other. It's just not a very fun game to play, and unless you're absolutely desperate for something to take up your time, it should probably be avoided."}