{"ref": "https://www.gamespot.com/reviews/mlb-07-the-show-review/1900-6170846/", "date": "May 16, 2007", "game_name": "MLB 07: The Show", "text": "Thanks to Sony's dubious track record when it comes to first-party sports games, its excellent MLB series hasn't always received the recognition it deserves. But after the outstanding MLB 06: The Show, people are taking notice of SCEA's yearly baseball efforts. MLB 07: The Show for the PlayStation 2 didn't mess with success, and nor does the PlayStation 3 version. It's a prettier, smoother iteration of what came out for the PS2 a couple of months ago. Though it's missing a few minigames, it has the excellent road to the show mode, which offers a whole new way to progress through a professional baseball career. MLB 07: The Show is a great value if you're looking for a hardcore simulation or just want to play a few quick games here and there. To speed things up, the only time you field in road to the show is when the ball is hit in your direction. MLB 07's game modes will be familiar to anyone who played MLB 06. You can play a quick game, call the shots in manager mode, take on a friend and track your stats in rivalry mode, hop online, embark on a career, run a franchise, and play a season. Unfortunately, there's no home-run derby or king of the diamond mode, which is a letdown since they were both simple, yet entertaining diversions if you didn't feel like playing a normal game. MLB 07's online offering is quite deep. You can create an online persona, play a single ranked or unranked game, send instant messages, play in and create leagues, upload and share your own game-setting sliders, check MLB news, and even listen to audio highlights from important games. Our online experience was mixed; when lag wasn't an issue, everything was great, but when lag became a problem--and it often did--the game was virtually unplayable. Without a doubt, MLB 07's biggest feature is the road to the show mode, which is an evolution of last year's career mode. It's great for anyone who doesn't want to play a franchise mode but still wants a game mode that offers a lot of depth. You create a ballplayer, pick a position, and find a team you think you can make. But instead of playing every pitch of every game, you play only when you're directly involved in the game. For example, if you're a right fielder, you'll play only when a ball is hit your way or when you're at bat. When your turn is over, the game simply fast-forwards to the next time you're involved. Your player improves by reaching goals that are given to you before each at bat. Pitchers will be told to do things like strike out hitters or induce double plays, while hitters will have to make contact, get a hit, or drive in a run. It's tough to succeed as a hitter, because you're given such few opportunities to succeed, and also because your performance on the field doesn't seem to have a whole lot of bearing on your value to the team. The lack of emphasis on defense is actually a good thing, because the ball is so tiny it can be difficult to see. You earn points for reaching goals, and these can be spent on training your player. If you're a pitcher, you can focus on improving your stamina, ability with specific pitch types, and more. If you're a hitter, you can improve your prowess against left- or right-handed pitchers, as well as improve your speed, strength, and the like. If you play well enough in the preseason, you'll be offered a contract, which means you get to keep playing and reaching new goals while trying to win awards and championships. And if you're not happy with your team, you can request a trade. If you don't get a contract, well, you're free to try out again next year, and the year after that, until you catch on with a team. It's very rewarding to work your way up from a nobody to a big star, and in a lot of ways it's refreshing to not have to deal with every aspect of a team--all you have to worry about is yourself. It would have been nice to play a shorter season, since you have to play most of the preseason to make sure you get a contract offer and then play the entire season after that. But other than that minor gripe, the road to the show is great. Franchise mode is largely unchanged, but that's OK because it's probably the deepest franchise mode in all of sports video games. You're given complete control of the franchise of your choosing, and it's up to you to reach the franchise's goals. If you're with a high-profile team like the Yankees, expectations are higher and your goals will be more difficult to achieve. Take over the mess that is the Tampa Bay Devil Rays, and your job requirements are a tad less lofty. Not only will you be in charge of roster moves, but you'll also need to manage the budget, improve team facilities, arrange promotions, sign television contracts, set vending prices, monitor players' and fans' moods, negotiate player contracts, draft players, and keep tabs on your organization's farm teams and scouts. This sounds complex, and at first it is, but you're able to delegate as much or as little of this responsibility to the CPU as you'd like. The mode has gotten so deep that it can be a little difficult to find information quickly, but for the most part, the menus are well organized and pertinent information is disseminated clearly. As good as franchise mode is, some things could be improved. You can, of course, play the games or simulate them in whole or in part, and it's nice to be able to jump in and out of a game as you see fit, but there's no option to play anything less than a full season, which is disappointing if you want to play all of your franchise's games but not necessarily 162 of them. It doesn't get much better than MLB 07's hitting mechanic. MLB 07's pitching mechanic has gotten some attention, but the basics are mostly unchanged and still great. To throw a pitch, you press the corresponding face button, pick your location with the analog stick, press X to start the meter, X again to set power, and then X a third time to determine accuracy. Your pitches are organized onscreen by your ability to throw them, and they each have a small meter that raises or lowers depending on how effectively you're throwing that pitch during a specific game. Throw strikes, and the meter fills, which makes it even easier to throw that pitch; throw balls, and the meter empties a bit, and it's even harder to find your spots. The effect feels a bit exaggerated, but it does a nice job of getting you to pitch realistically and not throw garbage all of the time. You'll need to throw a variety of pitches, not only because you get better with each throw, but also because your catcher will call for specific pitches and locations based on the current game scenario. Sometimes your catcher asks for some questionable pitch locations, but for the most part, if you hit your spots, you'll have success. Hitting your spots is also key because you never know exactly what will or won't be called a ball or strike, thanks to umpires that have their own specific strike zones. While this is certainly realistic, it's more frustrating than fun when you strike out looking at a pitch that was clearly a ball. This can be turned off, though, so it's not a big deal if you don't like it. Hitting is once again outstanding. You can choose to take a normal swing with a press of the X button or a mighty hack with the square button, and you can even influence where you hit the ball with the right analog stick. To improve your chances of success, you can guess the pitch type and location before the pitch, and if you're correct on the pitch type, the strike zone flashes red. If you're right about the general location, the ball's outline appears where it's going to cross the plate. However, MLB 07's hitting really shines because it finds the perfect level of difficulty. The pitches are fast enough that you've got to be quick when deciding whether or not to swing, but they're not so fast that you simply don't have time to react. If you pay attention, it's not terribly difficult to judge whether a pitch is going to be a ball or a strike. You never feel like you're just guessing, and you really feel like you can work a count because you can actually see the pitches clearly. There are quite a few home runs--probably too many--but it's not an absurd number, and you'll need to learn how to manufacture runs if you're going to win regularly. Mix up your pitches and throw strikes to make your pitches even more effective. Many baseball games have a hard time getting fielding down, but MLB 07 does a pretty good job here. It's easy to maneuver outfielders under fly balls, and it's just as intuitive to control the infielders. The only thing that's sometimes difficult is figuring out who you're controlling. Sometimes you'll be controlling the pitcher after a short bunt, even if the catcher is closer to the ball, and sometimes you're given control of an infielder who has no chance of making a play on a ball when there's another infielder who does have a chance. It's a piece of cake to control all of your base runners at once, but controlling them individually is a bit too complex, especially before a pitch. Between setting leads, telling people to steal, and then guessing pitch types and locations, there's just not enough time to get everything done. There are some motion-sensing controls, but they feel tacked on and don't add much to the experience. You can actually tilt the controller to dive while playing defense if you want, and you can tilt the Sixaxis to determine which side of the bag you are going to slide to, but neither works well. MLB 07's graphics are obviously much better on the PS3 compared to the PS2, but they're not exactly mind-blowing. The game still looks good and the player cards look sharp, but other than some great-looking fans and an improved frame rate there's not anything that screams ~next-gen.~ There's a nice variety of player body types; player likenesses are pretty good, but not outstanding; and many of the players have weird-looking eyes. There are some great player reactions, particularly when a hitter glares back at the umpire after a dubiously called third strike. Fielding animation is particularly well done, and players will gracefully execute double plays, dive for balls, or apply a tag. There are a solid number of individual player animations, be it on-deck routines, swings, or pitch deliveries. You'll occasionally get a player like Gary Sheffield, who obnoxiously waves his bat in front of the pitching meter, but most of the animations add to rather than detract from the experience. One nice thing about all of the player-specific animations is that they're not overdone. Sure, it shows tremendous attention to detail if a batter steps out after every pitch and adjusts his gloves and taps his bat on his cleats, but it makes the games take forever and doesn't add a whole lot to the overall package. There's even a fast-play mode that skips all the little stuff and lets you just play. MLB 07 keeps it simple, and it works. That doesn't mean that it couldn't use more in the way of conveying player emotion, and it might also benefit from a more TV-style presentation. The stadiums are all accurately re-created and look fantastic; there are a ton of little details to notice, right down to how the grass is cut--though don't look too close, because the grass is as flat as a pancake and players' feet never look like they're touching it. The crowds are some of the best in any sports game, which is impressive given how big they are. The stadiums look great. MLB 07's audio lives up to the same high quality as the rest of the game. San Diego Padres announcer Matt Vasgersian calls the play-by-play. His commentary is accurate and timely, and for the most part he does a fine job. Dave Campbell and Rex Hudler provide color commentary. They're OK, and thankfully Rex isn't as overbearing as he used to be, but they repeat themselves fairly often and don't always have the most insightful comments (though they occasionally offer some in-depth team- or player-specific nuggets). Even without commentary, the game would sound great. Fans holler at players from the stands, umpires emphatically call players out, organ music plays between pitches, players have walk-up music, and there's a PA announcer who introduces hitters and makes general announcements. Even though it doesn't have a flashy presentation and doesn't do much with the added power of the PS3, MLB 07: The Show is the best baseball game for the PlayStation 3. There's a seemingly endless number of ways to enjoy the game, and the road to the show is a fantastic addition to the series. Be it a wealth of online options or the deep franchise mode, there's something for every type of baseball fan here. Hitting is once again outstanding. You can choose to take a normal swing with a press of the X button or a mighty hack with the square button, and you can even influence where you hit the ball with the right analog stick. To improve your chances of success, you can guess the pitch type and location before the pitch, and if you're correct on the pitch type, the strike zone flashes red. If you're right about the general location, the ball's outline appears where it's going to cross the plate. However, MLB 07's hitting really shines because it finds the perfect level of difficulty. The pitches are fast enough that you've got to be quick when deciding whether or not to swing, but they're not so fast that you simply don't have time to react. If you pay attention, it's not terribly difficult to judge whether a pitch is going to be a ball or a strike. You never feel like you're just guessing, and you really feel like you can work a count because you can actually see the pitches clearly. There are quite a few home runs--probably too many--but it's not an absurd number, and you'll need to learn how to manufacture runs if you're going to win regularly. Mix up your pitches and throw strikes to make your pitches even more effective. Many baseball games have a hard time getting fielding down, but MLB 07 does a pretty good job here. It's easy to maneuver outfielders under fly balls, and it's just as intuitive to control the infielders. The only thing that's sometimes difficult is figuring out who you're controlling. Sometimes you'll be controlling the pitcher after a short bunt, even if the catcher is closer to the ball, and sometimes you're given control of an infielder who has no chance of making a play on a ball when there's another infielder who does have a chance. It's a piece of cake to control all of your base runners at once, but controlling them individually is a bit too complex, especially before a pitch. Between setting leads, telling people to steal, and then guessing pitch types and locations, there's just not enough time to get everything done. There are some motion-sensing controls, but they feel tacked on and don't add much to the experience. You can actually tilt the controller to dive while playing defense if you want, and you can tilt the Sixaxis to determine which side of the bag you are going to slide to, but neither works well. MLB 07's graphics are obviously much better on the PS3 compared to the PS2, but they're not exactly mind-blowing. The game still looks good and the player cards look sharp, but other than some great-looking fans and an improved frame rate there's not anything that screams ~next-gen.~ There's a nice variety of player body types; player likenesses are pretty good, but not outstanding; and many of the players have weird-looking eyes. There are some great player reactions, particularly when a hitter glares back at the umpire after a dubiously called third strike. Fielding animation is particularly well done, and players will gracefully execute double plays, dive for balls, or apply a tag. There are a solid number of individual player animations, be it on-deck routines, swings, or pitch deliveries. You'll occasionally get a player like Gary Sheffield, who obnoxiously waves his bat in front of the pitching meter, but most of the animations add to rather than detract from the experience. One nice thing about all of the player-specific animations is that they're not overdone. Sure, it shows tremendous attention to detail if a batter steps out after every pitch and adjusts his gloves and taps his bat on his cleats, but it makes the games take forever and doesn't add a whole lot to the overall package. There's even a fast-play mode that skips all the little stuff and lets you just play. MLB 07 keeps it simple, and it works. That doesn't mean that it couldn't use more in the way of conveying player emotion, and it might also benefit from a more TV-style presentation. The stadiums are all accurately re-created and look fantastic; there are a ton of little details to notice, right down to how the grass is cut--though don't look too close, because the grass is as flat as a pancake and players' feet never look like they're touching it. The crowds are some of the best in any sports game, which is impressive given how big they are. The stadiums look great. MLB 07's audio lives up to the same high quality as the rest of the game. San Diego Padres announcer Matt Vasgersian calls the play-by-play. His commentary is accurate and timely, and for the most part he does a fine job. Dave Campbell and Rex Hudler provide color commentary. They're OK, and thankfully Rex isn't as overbearing as he used to be, but they repeat themselves fairly often and don't always have the most insightful comments (though they occasionally offer some in-depth team- or player-specific nuggets). Even without commentary, the game would sound great. Fans holler at players from the stands, umpires emphatically call players out, organ music plays between pitches, players have walk-up music, and there's a PA announcer who introduces hitters and makes general announcements. Even though it doesn't have a flashy presentation and doesn't do much with the added power of the PS3, MLB 07: The Show is the best baseball game for the PlayStation 3. There's a seemingly endless number of ways to enjoy the game, and the road to the show is a fantastic addition to the series. Be it a wealth of online options or the deep franchise mode, there's something for every type of baseball fan here."}