{"ref": "https://www.gamespot.com/reviews/gradius-galaxies-review/1900-2826695/", "date": "November 21, 2001", "game_name": "Gradius Galaxies", "text": "Gradius Galaxies is a new rendition of a familiar friend. Unlike recent attempts to revive the series on the PlayStation and PlayStation 2, Gradius Galaxies is not a rehash. Each of the game's eight colorful levels and 47 sublevels is brand new, even if there is ample homage to prior Gradius releases scattered throughout in the form of enemies and background details. For the most part, Gradius Galaxies is a side-scrolling shooter at its finest--although it's not for the faint of heart or for those with dim lighting.The goal in Gradius Galaxies is to guide your ship, the Vic Viper, to victory against the onslaught of an alien horde. There are 12 different weapons to acquire, each of which has five levels of strength. Speed boosts, shields, and floating option ships round out the list of offensive enhancements. Upon starting the game, you can choose from four different ship configurations, which each offer a different strategic gain. The balanced type provides average coverage in all directions; the wide type lessens overall protection but gives a wider area of effect; the power type is strong, even though it leaves the ship vulnerable at times; and the air-to-ground type focuses a greater amount of firepower on enemies in front of and below your ship.As is common in the Gradius series, the best way to tackle Gradius Galaxies isn't to destroy everything, but to cut a path in the most efficient way possible. Power-up items are plentiful, allowing you to cycle through and toggle weapons with ease, but you need to be careful not to sacrifice coverage for strength at inopportune moments. No matter what difficulty level you select, each level will throw hundreds, even thousands of enemies at you, and they can come at your ship from the front and behind. Additionally, the majority of stages have sections that feature changing terrain or booby traps--requiring you to remain vigilant.The nicest thing about Gradius Galaxies being an original effort is that it gave developer Mobile 21 the latitude to create a visually stunning arcade-style shooter. The interplanetary backdrops provide a majestic setting for the cross-species battle, while a bevy of interactive elements prevent the scenery from remaining static for an uncomfortable amount of time. Collapsing calderas, volcanic infernos, ice formations, rampaging ships, and grinding security doors are just a few of the many obstacles to contend with while fighting the enemy. Speaking of enemies, there are more than 40, each of which has numerous appendages, shot styles, or exhaust expulsions cluttering the screen. At the end of every stage is a monstrous boss vehicle--often a large and multifaceted mingling of organics and mechanics aimed at blowing you to bits. Level bosses are large and multifaceted as well, often showcasing the GBA's lesser-known graphical capabilities, such as sprite scaling, rotation, and color cycling.In terms of audio, the game doesn't live up to its visual flair, but the separate MIDI selections for each segment, as well as a smattering of speech samples (~Destroy the core!~), provides a solid backdrop. Oddly, the sound effects are a bit too deep at times in that even the lightest bullet offers a mammoth wallop. Still, shooter fans really need only a few sound samples to tide them over during battle, and Gradius Galaxies has plenty more than that.Despite an overall measure of quality, there are a few lingering flaws. First of all, the dark scenery and tiny laser shots create somewhat of a problem on the GBA's dim, glare-filled screen. Unless you have an insane amount of ambient light, you're going to die a lot when the action intensifies. Second, like most side-scrolling shooters, Gradius is a an effort in memorization that is greatly endowed with enemy bullets, wherein you'll die hundreds of times unless you're able to exert the twitch reflexes required to tackle an expert level shooter.If you like a challenge, however, Gradius Galaxies is great. The artistic visuals and ever increasing challenge level are sure to keep you occupied for a long time, while smaller touches, such as the battery restore feature and hint mode, help offset the perception that the game is merely a linear exercise. It's Gradius done good--if you're into that sort of thing."}