{"ref": "https://www.gamespot.com/reviews/tom-clancys-ghost-recon-advanced-warfighter-review/1900-6146949/", "date": "June 25, 2007", "game_name": "Tom Clancy's Ghost Recon Advanced Warfighter", "text": "Ghost Recon Advanced Warfighter for the PlayStation 2 continues the disturbing trend of releasing games on different platforms that have the same name but offer vastly different gaming experiences. If you were wondering if Advanced Warfighter for the PS2 might offer something similar to the superb tactical shooter of the same name on the Xbox 360, you can stop wondering now. It doesn't, and it's not even close. As much of a compromise that the Xbox version of the game was to the 360 version, the PS2 version waters down the formula even more. This version of the game takes what should have been a wide-open, tactical experience in a massive metropolis and turns it into just another run-and-gun shooter that ramrods you through narrow corridors. It may share the same name as the tactical shooter on the Xbox 360... You take the role of Captain Scott Mitchell, a squad leader in the Ghosts, an elite unit of light infantrymen in the US Army. Mexican separatists have attacked a North American summit going on in Mexico City, and they have killed the Canadian Prime Minister, while both the US and Mexican presidents have gone missing. Along the course of the game's campaign, you'll need to rescue both presidents, recover the nuclear ~football~ that was also lost by the US president, and take out the leader of the uprising. The campaign will take you through different parts of Mexico City, including Camp Chapultepec, downtown, and outlying shantytowns. The heads-up display uses an overlay with digital information. This includes your health and ammo readouts, as well as a couple of picture-in-picture video windows. One of these is a window where you'll receive orders from off-site commanders and officers. But where the Xbox and Xbox 360 versions of the game showed you the view from your squadmate's helmet camera in another window, the video view here is replaced with a minimap on the PS2 version that's so far zoomed in, it becomes completely useless. The window that shows your commanders giving orders aren't even true video screens, as they just show a loop of the men flapping their mouths, like an animated GIF. These windows and the way they are implemented in the game make them a waste of screen real estate and they do little to add to the ambience. The rest of the graphics do little to impress, either. Unlike other Ghost Recon games, you play this one from a first-person perspective, so all you see is your gun model. The character models offer passable levels of detail, but the texturing looks muddy. The environments for the cityscapes and other areas are drab and nondescript, and the level design in this version of the game is extremely limited, like you're being railroaded through a linear maze of streets. It may look like you're walking down the avenues of a city, but for all the freedom you have in the game, the streets of Mexico City may as well be the corridors and hallways of an early-generation first-person shooter. For all the compromises that have been made with the complexity of level geometry and size, the game still has to subdivide single levels from the Xbox version of the game into two or more sections, increasing the amount of time you spend in loading screens. The frame rate and animation are the worst aspects of GRAW's graphics. The game stutters constantly, and when multiple enemies are visible, they jitter around the screen as if you're playing an online shooter with high network latency. This is not only annoying from a visual standpoint, but it also hinders your ability to aim and fire with any confidence. Your movement speed is extremely fast, and trying to peek around corners is awkward. You can't go prone in this game, nor can you climb over even short walls or obstacles. There's absolutely no scope drift in the game, which you'd think would make aiming and hitting enemies a trivial matter. But the frame rate issues, combined with the poor weapon feel and handling, make shooting enemies harder than it needs to be, and thus makes the entire game a wholly unsatisfying affair. The mission types are at least somewhat varied, as you'll rescue VIPs like the president, escort armor through thickly defended areas, and set up defenses at outpost areas against assaults. You'll also get the chance to call in attacks from choppers and sniper teams, though your control over these helper units is pretty limited. You only have control over one teammate in this version of the game, as opposed to a full support squad of three in the 360 version of GRAW and previous games in the Ghost Recon series. Your teammate tends to be very good at shooting and eliminating enemies, but having only one partner to control limits your tactical options and makes GRAW feel even more like a standard first-person shooter. But tiny levels and an awful frame rate are just a couple of the major issues plaguing this version of the game. GRAW's sound isn't particularly good either, as the dialogue from the 360 version is recycled for use in this game. This can cause problems, as you'll sometimes be told by a voice to head to an objective in the west, but a quick look at your map reveals that you actually have to advance north. Sloppiness like this may not be that annoying to some people, but it serves as a great example of how this version feels more like a rushed port than a game that was really designed to be played for the PlayStation 2. The best thing that can be said about the sound is that the guns still sound decent here, and the voice acting is pretty good. Multiplayer action on GRAW is available for eight players online and includes a small handful of team-based modes such as deathmatch, assault, and supremacy, which is basically like the onslaught mode from Unreal Tournament 2004 (sans the vehicles) where teams have to capture a series of nodes. These modes and maps generally work alright, but they still feel fairly standard. We've seen and played these modes before in games that did them a lot better. There are no split-screen options, nor any way to play the game cooperatively, which is especially disappointing, as the other versions of the game offer some nice cooperative modes. The treatment of online play in this version of the game is pretty barebones, as though it was thrown in as an afterthought to fill in a bullet point on the back of the box. Ghost Recon Advanced Warfighter for the PlayStation 2 makes too many compromises in the gameplay design for us to recommend it to anyone. Tiny levels that feel more like a series of corridors than a true city, excessive graphical slowdowns, and neutered multiplayer options are just a few of the reasons to avoid this game."}