{"ref": "https://www.gamespot.com/reviews/prehistorik-man-review/1900-2844410/", "date": "May 17, 2006", "game_name": "Prehistorik Man", "text": "In Titus' Prehistorik Man, you play the role of Sam, a heroic caveman. Sam's village is starving, but the elders have a plan. They'll send Sam into the ferocious jungle to retrieve a good luck charm from the dinosaur graveyard. Along the way, he'll also gather whatever food he finds so that the village can feast. Twenty-two levels, hundreds of wild animals, three large bosses, and plenty of items to collect--sounds like the formula for a platform game.Indeed, Prehistorik Man for the Game Boy Advance is a platform game, executed in the same vein as Sonic the Hedgehog or Super Mario Advance. It's a direct port of the 1995 Super NES version, and it's a fun alternative to Sega's and Nintendo's competing offerings, even if it's not as refined or user-friendly.Visually, Titus has done a wonderful job of re-creating every transparency, lighting, parallax, and alpha-blending effect from the SNES version. Bosses are large, levels are colorful, and Sam is a hilarious protagonist. Torrential rain and blowing snow are drawn vividly, while the use of in-game puzzle elements, such as block pushing and vine swinging, really enables you to stop and admire the scenery. A number of crude vehicles, such as a dinosaur-skin hang glider and a carved stone wheel, also let Sam take advantage of the GBA's graphical power.Although the game itself looks beautiful, Prehistorik Man is fairly vanilla in terms of gameplay. In the majority of stages, you'll be leaping across ledges, pummeling wild animals with your club, and gathering as much food as possible. Vanquished enemies give up bones and heart pieces, which can be used to purchase continues or increase your health. A few stages require backtracking to complete, while others possess secret caves to explore, but there's nothing so fancy as pairing with Yoshi to find the alternate entrance into the Chocolate Ghost House in Super Mario World. Compared with the majority of today's games, the level designs in Prehistorik Man just aren't terribly exciting. The game comes into its own during forced scrolling stages, such as when you're inside a burning tree trunk or latched onto a careening stone wheel, but these diversions are too infrequent to offset the ennui of food gathering. Bosses are cheap as well, even if they're large and ugly.There isn't much else to say about Prehistorik Man. The music is a well-done mix of primitive jazz and techno beats. An in-game password save--that costs 20 bones to acquire--lets you record Sam's progress. Gathering the letters to spell B-O-N-U-S gets you into a secret area, which boosts the game's longevity somewhat. However, once you defeat the final serpent boss, there isn't much practical incentive to revisit the main quest. At best, Prehistorik Man is a weekend diversion from the GBA's more substantial fare."}