{"ref": "https://www.gamespot.com/reviews/major-league-baseball-2k7-review/1900-6168158/", "date": "March 27, 2007", "game_name": "Major League Baseball 2K7", "text": "Ever since the Nintendo DS came out, baseball fans have been waiting patiently for a company to make a baseball video game for Nintendo's dual-screen portable system. Unfortunately, now that 2K Games has finally done so, the feeling you're most likely to experience as you start playing Major League Baseball 2K7 isn't one of joy or relief. Instead, your mood will probably turn to disappointment and regret as you realize that the game lacks basic features like trades and a season mode, the control mechanics and visible action deliver only a vague approximation the sport, and the crude graphics are a throwback to games people were playing on 8- and 16-bit systems more than a decade ago. MLB 2K7 on the DS isn't fun and doesn't feel much like real baseball. Immediately after you insert the cartridge and power up the system, you'll notice that there aren't many options open to you on the menu. You can play a nine-inning game alone or against a friend, start a playoff series, play in an all-star game, or go through a home run derby. That's it. There's no season mode, which is baffling since the cartridge does provide three save slots for keeping track of playoff games. You can't even adjust the rosters or create new players. When you're setting up a game, you can pick a team and its uniform, as well as juggle players from the active roster and bench, but you can't adjust the number of innings or pick a park to play in. In fact, even though all 30 MLB teams and players are represented, there's only one ballpark. Judging from the outfield stands and awning, it appears to be the old Busch Stadium that the St. Louis Cardinals moved out of after the 2005 season. It isn't just the options that they skimped on. The game's entire presentation is threadbare. Audio is limited to umpire calls and some cheesy ballpark cheer inducers that play as often in response to the away team's successes as they do for the home team's. The graphics are a joke. There's one overhead view of the field and just the single outfield backdrop. The upper screen displays the overhead view, which resembles Bases Loaded 2, a game that Jaleco published for the 8-bit Nintendo Entertainment System back in 1990. Players move matter-of-factly in the overhead view, never once jumping or diving. Meanwhile, the spectators in the stands look like circular blobs of color. When you're hitting or pitching, the lower screen shows a ~catcher's eye~ perspective that encompasses the hitter, the pitcher, and a view of the outfield behind the pitcher. This viewpoint brings the production values forward a few years, roughly equivalent to what World Series Baseball '95 for the Sega Genesis looked like. On the one hand, the player models are large and the head-on perspective offers a good view of the ball as it leaves the pitcher's hand. On the other hand, the hitting and pitching animations are jerky and the player models are the very definition of generic. Every player is the same tall guy with a cap covering his bald head. Only the skin tone and uniform colors change. Uniforms also lack anything in the way of team names, logos, or pinstriping. The New York Yankees' uniforms don't even have pinstripes! That's pathetic. It's also somewhat ironic, considering that Yankees shortstop Derek Jeter is pictured on the game's box. Incredibly, though the catcher's viewpoint is the most pleasing to the senses, the game forces you to spend a significant amount of time watching the overhead view displayed on the upper screen. That's because for some insane reason, when a player gets a hit, the catcher's viewpoint is replaced by a crude representation of a baseball diamond. To handle fielding and baserunning, you have to watch and maneuver the tiny characters in the game's Bases Loaded-style overhead view. The Nintendo DS hardware is roughly on par with the Nintendo 64 in terms of 3D horsepower, so it is capable of producing the 3D stadiums, polygonal character models, and adjustable camera angles seen in baseball games produced on the Nintendo 64. Instead, Major League Baseball 2K7 for the Nintendo DS resembles an 8-bit NES game half the time. Of course, graphics alone don't ultimately make or break a sports game. Shoddy graphics can be forgiven if a game is fun to play and captures the feel of the sport. Sadly, Major League Baseball 2K7 falls short in those criteria, too. It's not just that fielders don't reach or dive for the ball; MLB 2K7 suffers from an overwhelming number of flaws that get in the way of playing the game and make for a loose interpretation of baseball. The control layout is the same one that every baseball game has been using for the last decade or so, except that you have the option of using the touch screen to select and aim pitches and swing the bat. However, despite the familiar controls, you have no control over how hard your pitcher throws or how much power your hitter puts into a swing. You also can't press the button early to have a fielder smoothly pick up the ball and relay it to a base. Almost every baseball game in the last five years has let you preload throws! But, without question, the worst problem with MLB 2K7 is that you have to overcome some serious problems with the graphics and controls in order to accomplish anything. Picking a spot in the strike zone to swing through before a pitch is thrown is weird, but it's something you can learn to live with. Trying to hit the ball while the animation slows to a crawl and randomly stutters isn't. When you're fielding or baserunning, the game will often ignore your button commands. You'll tap or hold the button to have your outfielder gun the ball to second base or to have your runner advance on a deep hit, and they'll just stand there. The only way to ensure players do what you want is to repeatedly press the button. There is only one stadium, the uniforms don't look right, and you can't trade players. Some flaws are just plain embarrassing to see in a so-called modern baseball game. Pitchers don't cover first base when the first baseman fields the ball. The simplistic physics only result in a limited number of hit trajectories and don't produce short hops. Around the sixth inning or so, the CPU's pitcher will begin to throw wild pitches regularly. For most people, the breaking point will come after having played a couple innings, when it dawns on you that players are getting hits when they're not actually making contact with the ball. Frequently, a hitter will finish his swing animation before the ball reaches the plate, but, instead of racking up a strike, the game will transition to the fielding viewpoint and show the ball sailing into the outfield. Major League Baseball 2K7 on the DS doesn't really feel like baseball, and it isn't fun. The game was made for a portable system and is being sold at a budget price, but these limitations aren't the reasons why it turned out the way it did. Plain and simple, 2K Games and Skyworks failed to do the job right. There's no excuse for a baseball game running on the DS to play this poorly, look this bad, or miss so many of the key features other sports games have. It doesn't matter whether you consider yourself a casual fan of the sport or eat, sleep, and drink the major leagues. Either way, you won't get any enjoyment out of this pathetic excuse for a baseball game."}