{"ref": "https://www.gamespot.com/reviews/kane-and-lynch-dead-men-review/1900-6182836/", "date": "November 13, 2007", "game_name": "Kane & Lynch: Dead Men", "text": "Io Interactive is best known for its stealth-focused Hitman series, but there's nothing quiet and sneaky about its latest release, Kane & Lynch: Dead Men. This time around, the developer put together a crime-themed shooter that starts out with a couple of simple, heist-like objectives and then rapidly spins out of control until, without much warning, you're gunning down soldiers in the middle of a foreign revolution. While the journey sounds interesting at first, and has a few bright points, it's weighed down by bad storytelling, a real lack of character development, and a host of gameplay-related issues. The end result is a game that squanders much of its potential and just doesn't come together as well as it probably should have. Kane and Lynch don't get along--not in an especially interesting way either. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Kane & Lynch: Dead Men Video Review The story mode opens with you in the role of Kane, a death row inmate on his way to his execution, apparently convicted of being a very savage criminal as part of a notorious gang called The7. You're on your last ride with a quirky guy named Lynch who tells you to cover your head. After an explosion, you're both busted out and on the run. That might sound great, but it's a fate worse than death. The surviving members of The7 have busted you out to force you to recover something they think you stole from them. They consider you a traitor and will kill Kane's family if he doesn't comply. Lynch is sent along for the ride to watch over Kane and report in if anything weird happens. Circumstances change over time and the back half plays out like a revenge tale, but it's a revenge tale where you don't actually care if anyone actually gets their revenge. Every single person you play as or encounter is despicable and wholly abrasive; thus, it'll probably be tough for you to find anyone to latch onto and care about, even if you typically go for this sort of crime drama on TV or in movies. You can play through this story alone or with a friend in co-op mode, though this mode is only available locally and takes place on a vertically split screen that makes it difficult to follow the action, even on a widescreen TV. The core gameplay in Kane & Lynch is your standard third-person shooter with cover elements and a light dusting of squad tactics. You can fire from the hip, but it's somewhat more accurate to fire while aiming. Unfortunately, even when you're aiming, hitting your targets is more difficult than it should be because your automatic fire has a wide spread on it. Kane is supposedly a badass arch-criminal; he should be able to hit his targets with short, controlled bursts. You're able to get behind cover and either blindfire or pop out for aimed shots, but there's no easy way to stick to walls. You don't press a button or anything; instead you sort of get up against a wall and turn sideways. Then after jiggling the controls back and forth a bit, you'll eventually snap into place to get behind cover. It's such a pain that you'll rarely want to use it, and it seems like you're always snapping into cover behind something at the most inopportune times, making the game quite frustrating. There's no health meter, but if you go down, you don't die immediately either. You can be revived by one of your teammates with an adrenaline shot. If you get that shot too frequently, you'll overdose and die. If your teammates don't reach you in time, you'll die too. Also, if one of the guys on your crew gets dropped, you have to make sure he gets revived. If he dies, the game ends. Between your poor accuracy, the enemy's sharp accuracy, and the boneheaded AI from your squadmates, this all adds up to you keeping your squad on a very short leash. When you've got a team with you, you can order team members around individually or order the team all at once by telling it to regroup to your location, move to a specific spot, or attack specific targets. Telling team members to move to locations is the most effective move because you can keep them close and revive them when they get shot down. Sending them after targets results in your squad running around aimlessly and trying to get too close to targets. That leads to them getting dropped in the line of fire, where you probably won't be able to rescue them. So whether you're doing the shooting yourself or hanging back and letting your men do the dirty work, the game is a real disappointment, especially when you consider how well this same sort of stuff worked in the developer's previous squad-based game, Freedom Fighters. There's only one multiplayer mode in Kane & Lynch, and it's a great idea. Unfortunately, the idea doesn't translate into a great or long-lasting experience. It's called Fragile Alliance and puts up to eight players in one team of criminals. Then, it sets the team off to steal money, cocaine, and jewels from various locations seen in the single-player game. So you might start out in front of a bank, run in, collect a bunch of cash, and then escape from in a van out back. The catch is the way the money is split up among teammates. If you all work together, the money is split evenly. But at any point, a player can go rogue and gun down one of his teammates. This brands you a traitor; thus, any money you collect and escape with is yours to keep. Of course, this also means that other players who are still part of the team will try to waste you before you escape with their hard-stolen loot. So every round is a tentative affair where you always expect the worst--you're just never sure when someone's going to finally turn on you. When you die, whether it's from the AI that opposes you or another player, you respawn on the other side of the heist. Now you need to stop the heist by eliminating the other players and you earn money by collecting it before the criminals collect. It's a bummer that the multiplayer is mucked up by a few different things. First, you're still playing Kane & Lynch, so all of the inaccurate firing issues and poor cover tactics from the single-player still apply. But another problem is that you can see the names of the other players over their heads from a distance and through walls, even if they're on the other side. While you can run while crouched to make your name disappear, it's pretty weak that you can see the names of the police team members as they head your way. There's no element of surprise. Also, there are only a handful of different scenarios for this, and they play out the same way every single time. The security guards are always in the same positions in the bank and the cops are always waiting for you right outside, so it gets old fast. While it might seem like a basic heist game, Kane & Lynch does a good job of moving the action around, and you'll see a variety of different environments and situations, ranging from banks, to prison breaks, to full-scale conflicts in the middle of illicit poppy fields. It also has some good-looking player models, with Kane and Lynch both looking appropriate as over-the-hill criminals. And even though their faces don't animate much in-game, they still look good. Most of the animation isn't so hot, though, and you'll see a few ugly textures here and there too. Some of it looks a bit unfinished, like the way you see guys go through the motion of hitting you with an adrenaline shot, but their hands are actually empty. The multiplayer mode is a really cool idea that leaves you wondering who's going to turn traitor on you, but it isn't strong enough to make you forget the game's other problems. The soundtrack is probably the best part of the whole game, delivering some tense music when the game calls for it. There's a lot of voice acting in the game. The voices are appropriate for the characters, but the dialogue is hokey and filled with gratuitous cursing. The good ol' F word is certainly appropriate, given the nature of what these guys are doing, but when it's every third word out of every character's mouth, it comes across as a crutch that drags down the rest of the game a bit. Lynch frequently responds to your squad-orders by just shouting ~F*** you!~ Things like that just make the game feel purposely abrasive, and not in a ~gritty~ or ~cool~ sort of way. The game is available on the Xbox 360 and PlayStation 3 as of this writing, and the differences between the two versions are minimal. Both games have occasional frame rate issues and the control issues with finding cover and hitting targets are noticeable in both. The only real difference is that the PlayStation 3 version doesn't seem to have voice chat support. The multiplayer mode only really clicks when you can talk things out with other players and try to convince them that you're not going to turn traitor--only to turn traitor on them and then laugh about it. Without that, the whole experience feels a little dry. The Xbox 360 version also has the standard set of 1,000 achievement points, a few of which reward you for specific moments in co-op, like having the player controlling Lynch put a few cops out of their misery, rather than leaving them to writhe on the ground. Kane & Lynch: Dead Men is a premise with promise, and if you've been waiting patiently for a game to really dive into the whole ~crew-based heist tale~ concept, you might be able to look past some of the story flaws. But when you consider the nearly ridiculous number of extremely high-quality shooters available recently, there's not much room for something like Kane & Lynch, even taking into account the somewhat unique nature of its story. That said, the multiplayer is a smart idea that's worth seeing, even if playing it makes you wish that it was used in another, better game. Editor's Note: This review has been updated to include differences between the Xbox 360 and PS3 versions and a clarification on the game's multiplayer mode."}