{"ref": "https://www.gamespot.com/reviews/thimbleweed-park-review/1900-6416642/", "date": "March 30, 2017", "game_name": "Thimbleweed Park", "text": "Thimbleweed Park, a point-and-click adventure by famed ex-LucasArts duo Ron Gilbert and Gary Winnick, rides a thin line between nostalgia and reinvention, balancing its remembrances for the time-honored genre with a sliver of modern sensibilities. It's a picturesque window into the past that's more than it appears to be. But at the same time, its adherence to the genre's long-held tenets is a firm reminder why adventure games alienated even their most diehard fans in the late '90s. Despite this, Thimbleweed Park is a journey well worth taking for experienced adventure game fans eager to solve its myriad puzzles and uncover its secrets.The story begins with a murder in the small town of Thimbleweed Park, and two FBI detectives, Antonio Reyes and Angela Ray, are tasked with investigating the killing. The trail to the culprit leads them down a path of intrigue that has them unearthing dark secrets concerning the town's history and inhabitants.Thimbleweed Park's premise screams Twin Peaks, though its quirky tone and hammy dialogue drive it more towards supernatural comedy than surreal, psychological thriller. It constantly breaks the fourth wall by reminding players of its pixelated art style and its idiosyncrasies as a point-and-click adventure--there's even a character whose primary motivation is to get a job making text adventures for a company analogous to LucasArts. These stylistic and charming touches enrich the narrative, giving the storytelling an air of lighthearted self-awareness that rides through up until its cataclysmic conclusion.Further complementing the narrative is an eccentric cast of characters who, at each twist and turn, contribute a wealth of witty remarks and general ridiculousness to the proceedings. For instance, the town's sheriff attaches the phrase ~a-reno~ at the end of a random word in his sentences. The town's coroner shares this habit but affixes ~a-hoo~ to the ends of phrases instead. It's made obvious in the beginning that these two characters are in fact the same person, yet everyone in town seems to believe they're separate individuals purely based on the fact that they each use different end phrases. Gags like this are plentiful and exist in nearly everyone you meet. It's a driving force for every encounter, as you often look forward to seeing what peculiarity you're going to find next.Thimbleweed Park is less restricted than its linear contemporaries and predecessors, as it contains a fair number of puzzles and locations you can freely discover and tackle in any order you please. You start as Reyes and Ray, and can switch between them at will. But as you advance, you eventually control five characters, each with their own unique motivations and puzzles to solve. If you run into a bind with one protagonist, you're free to switch to another to try to make progress elsewhere. The high number of playable characters offers a welcome diversity to the experience that remedies the slog of figuring out what to do next.Thankfully, the puzzles accommodate a wide range of logic and observation skill levels, rarely requiring too much stretching of the imagination to solve. While some are as simple as combining an object with another in your inventory, others are far more intricate. One sequence has you trying to lure a character out of their office so you can steal an item. But in order to do so, you need to have another character use a device elsewhere to convince them to check out a ~situation~ brewing across town. Despite how infrequently puzzles break away from the usual dilemmas you'd expect to see in a game of this nature, they still maintain a decent level of challenge and complexity without becoming too obtuse.However, some are marred by design issues and contextual inconsistencies. While the game's open design is one of its strongest qualities, it sometimes impedes your ability to solve puzzles effectively--the freedom you have to solve them in different orders often results in confusion. For example, an item you receive from a character clues you in to a secret meeting somewhere in town. But the location of said meeting requires going back to a location you probably thought you were done with. The freedom you have to solve quandaries sometimes makes it tough to decipher the presented clues. And given that solutions are incredibly specific and occasionally require multiple steps, it's often difficult to figure out what to do as you accumulate more items and clues.As you get deeper into the game you also start to notice that some solutions require intimate knowledge of a character's skills. For example, one puzzle has you leaning on a character's tech background to fix a machine critical to the murder investigation. While this makes sense in the context of the puzzle-solving process, there's never a revelatory moment that links her motivations with the agents she's helping. She fixed this machine, but why? The narrative eventually frames its five protagonists as a team working under a common goal to unravel the mystery, but it never acknowledges their feelings regarding this arrangement or even how it comes to be. In turn, this lack of context almost constantly muddles the world's logic and occasionally complicates puzzle solving.In the face of its issues, Thimbleweed Park still manages to retain the charm of the era it evokes. Yes, it inevitably falls into the standard genre structure of adventuring to and fro, picking up items, and interacting with the environment to solve a bevy of problems that require highly specific solutions. And as you'd expect, the moments spent in between trying to figure out everything are just as irritating and demoralizing as you remember. It's unapologetic in how it caters to its niche audience more than anyone else. But when all of this comes to a head in the game's final moments, the experiences of your journey are forever changed. Without spoiling anything, something occurs that affects your entire perception of the game's events--and subsequent playthroughs. The revelation elevates the game beyond its retrospective nature and design.We often yearn for a piece of the past, hoping for new experiences that channel the rose-tinted memories from our formative years of gaming, but sometimes what we end up getting isn't what we expected. Thimbleweed Park is a time capsule that reminds us what we love about the point-and-click genre while still retaining many of its unremedied issues. Its amusing open world is packed with infectious personalities and clever puzzles that magnify the joy of its experiences. And its efforts to shift beyond the template of its predecessors and contemporaries make it surprisingly affecting, especially if you're a longtime devotee of point-and-click adventures. The game's reverence for the past and its eventual conclusion could very well fly over the heads of the uninitiated. But make no mistake, Thimbleweed Park recaptures the charm of the games from which it draws inspiration, presenting a worthwhile experience for those who've been playing them since the beginning."}