{"ref": "https://www.gamespot.com/reviews/warhammer-40k-darktide-review-left-to-shred/1900-6418008/", "date": "December 8, 2022", "game_name": "Warhammer 40,000: Darktide", "text": "When I spoke to several teams making games in the Left 4 Dead lineage, they each had some unique thoughts on why the game, and its resulting genre, works. But they also each echoed one similar thought: Pacing reigns supreme. Horde shooters, like Warhammer 40K Darktide, can live or die on the flow of its co-op missions. Aided by an AI director, missions must be tuned to reliably challenge, but not necessarily overwhelm the player. Impressively, Darktide gets this aspect of its grimdark missions exactly right, though the ways in which the game adds new layers don't work quite as well.Darktide is not just a Left 4 Dead-like, it's also the spiritual successor to Fatshark's previous series in the genre, Vermintide. Moving the experience out of the base Warhammer world and into the far-flung and grimdark future of Warhammer 40K comes with a major makeover both cosmetically and mechanically. The biggest new addition comes in the form of an arsenal of firearms that have no place in the hard fantasy of traditional Warhammer. But in the 40K era, things like hand cannons, assault rifles, and electricity-infused projectiles not only fit right in, but also dramatically alter the flow of combat by adding more range-based considerations.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Warhammer 40K Darktide Video ReviewThis massive shift is well-implemented, as enemies will match you blow for blow. Fighting from a distance will see them trading shots and taking cover, and if you--or they--are able to close the gap, they'll quickly swap to melee combat. When this happens, Darktide leans into the still-great crowd-control elements first seen in Vermintide, where both nuanced swordfighting and mindless hacking and slashing are usually viable techniques--though on higher difficulties, the former naturally becomes more crucial.Gunplay is a bit uneven, but I suspect it's sometimes intentional. The recoil on some low-level guns, like one I was given in the tutorial, is wildly powerful, but it feels like a deliberate penalty for having such a lackluster weapon, albeit also a weird first impression. Other guns, like a revolver I equipped as my witch-like Psyker character, was easier to manage but much less powerful, but she also boasts a ranged spell attack that is meant to disable or even decapitate singular enemies at a time, giving her more than one way to cull the herd from range.Each class comes with trade-offs like this, demanding that you buff your allies with your own strengths to cover up their weaknesses, the way the great games of this sort should emphasize. Smartly, your armor doesn't replenish unless you're near your allies, which adds a great new wrinkle to the way this sort of game punishes lone wolves.For the freshest experience for those coming over from Vermintide, the Veteran class is the best, as they're most adept with guns and thus feel the most different from the archers and axe-throwers of Fatshark's predecessor series. No class is without melee abilities, thankfully, as the blend of ranged and melee combat is key to what makes the game's combat loop work so well.Darktide doesn't shy from tropes of the genre that have worked before, such as mini-boss enemies that often fit familiar archetypes. This includes a beast that pounces on and immobilizes you, or another big brute that charges after you and slams you into the ground. There's even a Tank analogue, which is the toughest of the mini-bosses. Because of the gunslinging, some more novel mini-bosses show up, too, like one that fires explosive rounds at you and your crew of ~Rejects.~In each case, be it novel or cliche, they work because their arrivals in the fray are well-timed and adhere to the game's exemplary pacing also demonstrated in the steady stream of common enemies, which pour in by the dozens at a time. I don't think it's a bad thing that players who are well-versed in the genre will recognize some of these enemy archetypes. Mechanically, their ability to pin players or dismantle team cohesion is critical, so it feels like there are only so many directions in which to take mini-bosses when designing a game like this.Where Darktide adds its own depth is in its metagame of leveling up your created character (or characters). Not only do you give them a lengthy backstory which helps contextualize their history for you, but it also colors how the squadmates talk to each other, eliciting banter among the strange bedfellows as they slash and shoot through each horde. That's a fun detail that may not even be picked up by some players, but no one could overlook the loot system, which adds layers not typically seen in games like this.Completing missions and challenges will earn you currency and materials, and with them, you can buy new weapons, even dramatically altering your character build by switching to new weapon classes--you can only equip two weapons, after all--which works well in tandem with the skills and perks you'll unlock as you improve each character to level 30. I created a very satisfying build that allowed me to ignore ammo reserves entirely, as neither my axe nor my staff, which fired projectiles that relied on my Psyker powers, depended on ammo.This allowed me to lead from the back, as I'd clear hordes and target mini-bosses before they ever got close. Other times, and with another character, I'd go more in the guns blazing direction, with high-capacity firearms and swift swordfighting that invited a style in which I was more front-and-center with the hordes, cutting through them quickly and gunning them down in deliberate bottlenecks. When paired with creative teammates, the game's tactical elements really shine. This works well even if your group features some class overlap, but works best when one of each character class is represented, as you'll have the full range of strengths available to you, masking weaknesses nearly to the point of non-existence.But no matter the roster, the game really relies on such cohesive squads, as just jumping into a game with randomized teammates makes anything above normal difficulty a struggle. Damage taken skyrockets, so it becomes a situation where you almost have to operate like a well-oiled machine or else you won't get far. Thus, as is often the case in games like this, it can be satisfying with friends and frustrating with strangers. This issue is exacerbated by the lesser rewards you unlock on lower difficulties. Without a reliable team, you may find it best to play on normal or easy, but the currency and other rewards you'll get for completing missions on those difficulties are not generous enough, and drag the unlock and upgrade system way down. At least when I've had enough money or supplies to improve my character's inventory, the changes have been evident, doling out that reliable sense of progress and improvement that video games are built on.The free, earned in-game cosmetic pricing is more noticeably out of order. For roughly the cost of two or three weapons that are better than those with which you'll start the game, you can buy, for example, an alternate colorway for your pants. This creates a two-part issue where the prices are too steep and the rewards are not so desirable. There are other cosmetics, too, but so far they're mostly lackluster. The best stuff on offer is in the real-money shop, and in there, prices are roughly what you might be used to--full head-to-toe outfits will cost you $8-12. However, those prices are usually seen in free-to-play games, whereas Darktide is a fully-priced game that currently has too few interesting cosmetics available for free. The game has intentions of a live-service game, and in its defense, many live-service games open with too few enticing cosmetics, but the pricing for what's there compounds the issue.Speaking of cosmetics, the game's look as a whole is unappealing, though I admit your mileage may vary as this feeling stems from my personal disinterest in its source material. Warhammer 40K is an ugly world, speaking both morally and aesthetically. Fatshark manages to give levels a general sense of scale and atmosphere that I expect is faithful to the IP, but the combination of ubiquitous rusted steel on vaguely church-like venues, albeit a neat, metal music video-style juxtaposition enhanced by great original music, fails to separate any one mission from another. Thus, they all quickly blend together. Missions are selected on an overworld map within a shared social hub a la Destiny, or you can jump into quickplay according to your difficulty settings, and several times when I was thrown into a mission, it took me a surprising amount of time to realize that I'd already played a particular level before. Outside of major set pieces, none of them do well to stand out.This also affects the story, as you'll likely play it out of order given how matchmaking seems indifferent to your story progress--though you can override this by choosing specific missions with possibly longer queue times. As a result, the story feels like little more than background lore, even as the game likes to throw you into cutscenes at times. For players bringing Warhammer fandom into the experience, I bet they'll get more out of it, but for others, it's going to feel out-of-context and skippable.Darktide feels like both the natural progression of Vermintide's best parts as well as an exemplar of some growing pains in the live-service world. Things like combat, pacing, and team builds are expertly considered and crafted, but metagame elements such as chasing loot and cosmetics have some issues that are admittedly common when a team tries to create a new game with a long tail. It's both a promising Left 4 Dead-like and a flawed live service, but its issues are fixable, and the growth of Vermintide suggests that Darktide will also enjoy a long shelf life as one of the better games of its kind."}