{"ref": "https://www.gamespot.com/reviews/prince-of-persia-the-two-thrones-review/1900-6140694/", "date": "December 1, 2005", "game_name": "Prince of Persia: The Two Thrones", "text": "The Prince of Persia: Sands of Time trilogy has always been known for its tight controls and satisfying environmental puzzles set in beautiful levels. The series' control scheme has served as a model for countless other games that also feature an acrobatic protagonist like the Prince. The same great interface remains in the third game of the series, The Two Thrones. Like the other two games, you'll find yourself wall running, jumping, flipping, and vaulting your way up fiendishly designed environmental puzzles, as well as fighting vicious enemies with the improved combat system introduced in the last game, Warrior Within. The Prince has a few new tricks up his sleeve as well, but longtime fans of the series should still feel right at home. The Prince is back, and this time, he wants his kingdom. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Prince of Persia: The Two Thrones Video Review The story of the Sands of Time trilogy began with the prince's army attacking and conquering the capital of the Indian empire. In the midst of the battle, however, an evil vizier caused the release of the sands of time, wreaking havoc over the city and the surrounding countryside. The prince and an Indian princess named Farah battled together to defeat the vizier, bottle up the sands, and restore the world to a normal state. The story continued in Warrior Within, where an embittered Prince set sail for the Island of Time, seeking sanctuary from an unstoppable time creature called the Dahaka who pursued him endlessly because of his part in unleashing the sands of time. There, the Prince battled not only the Dahaka but also Kaileena, the Empress of Time. Fans of the first game felt the series lost a lot of its soul in Warrior Within, as the suddenly cynical Prince was much more arrogant and less likable. The Two Thrones begins with the Prince returning to Babylon from the Island of Time with the mortal Kaileena as his new lover (this part of the plot may be confusing to those who didn't see the alternate ending of Warrior Within). As they pull in to the harbor at Babylon, the duo finds the city under siege. Their ship is wrecked by the invaders, and Kaileena is captured by the enemies. You quickly find that the vizier is back and responsible for the uprising. He murders Kaileena and unleashes the sands of time upon Babylon, and the Prince must battle to regain his kingdom and avenge Kaileena's death. But it's not just sand creatures and other bad guys from the vizier's army that the Prince must fight. With the sands of time infecting his soul, the Prince must also battle the whims of his darker, more arrogant side. Throughout the game's long, 12- to 15-hour campaign, the Prince will morph back and forth between his normal self and the Dark Prince. He'll also have internal dialogues between his split personalities, with the original actor from Sands of Time voicing the normal prince, and a new voice actor representing the sneering, more sarcastic Dark Prince. Here, the game almost becomes self-referential in addressing the popular criticism levied against the arrogant Prince from Warrior Within. The internal strife in the schizophrenic Prince's mind forms a compelling part of the storyline in The Two Thrones, especially because both the writing and voice acting are pretty good. Playing as the Dark Prince requires a different style. Turning into the Dark Prince isn't just window dressing, though. In gameplay sequences in which the Prince is his evil self, you'll find that you're much more powerful in combat, thanks to a new weapon called the daggertail. The daggertail is a chainlike weapon that can be swung around to attack multiple enemies, or lashed out like a whip. It also comes in handy for swinging across bars or lamp fixtures, kind of like in Bionic Commando. Unfortunately, this added power comes at a price. Much like playing as the sand wraith in Warrior Within, the Dark Prince loses health constantly, and it must be replenished periodically by recovering sand from defeated enemies or from breaking jars or furniture in the environment. Unlike the sand wraith, though, the Dark Prince doesn't get unlimited use of sand powers. The sequences in which you play as the Dark Prince let you be much more aggressive in combat, as health is never really a concern (you basically get recharged fully with each downed enemy), but the puzzle-solving and acrobatic sequences can be stressful because you have a time limit to get from point A to point B. Fighting as the regular Prince is very similar to in the previous two games in the series. You can pick up dropped weapons for use in your offhand, which lets you do more powerful weapon combos against enemies. Or you can vault off walls and poles, and even use the enemies themselves to augment your attacks. The fights are as violent as ever--you can behead or even cut enemies in half with the more powerful moves. What's different about the combat in The Two Thrones is the introduction of a stealth-kill mechanic, or ~speed kills,~ as they're called in the game. To execute a speed kill, you'll need to sneak up behind (or drop in from above) an unaware enemy. Tapping one button starts the speed-kill animation. Periodically, the animation will freeze, and you'll have a split second to tap a button to execute a strike. There are a number of different animations, and depending on the enemy it can require you to strike once or up to five times. Mistime any of your strikes and the speed kill will fail, meaning you'll have to fight the enemy the regular way. If you can catch two enemies close together, you can also use double speed kills. Overall, the new stealth-kill mechanic is pretty fun and satisfying to do and watch. The animations are extremely violent; you'll shank your foes every which way in their necks, guts, backs, and chests. The mechanic of doing a speed kill also offers just the right amount of challenge--it's not so easy that they're always automatic, but they're not too hard, either. Most importantly, though, speed killing your enemies means much less time spent in combat, which was never really Prince of Persia's strong suit as a game. We found ourselves rewinding out of failed speed kills to try them again, because they're not only fun to watch, but they help keep the game moving along. There are also a few boss fights in The Two Thrones, and each of them offers a unique challenge. Many of them will require you to combine speed-kill mechanics with climbing and jumping skills. It's not Prince of Persia without jumping and climbing. Speaking of climbing and jumping, this wouldn't really be a Prince of Persia game if there weren't tons of environmental puzzles to solve. As in previous games in the series, you'll be doing a lot of wall running, jumping, climbing, mantling, and trap dodging to find switches that open up doors, or simply to get to broken holes in the wall that will get you to the next room. A number of areas will require you to turn levers and hit switches to operate machinery that changes the position of platforms and other level geometry. Most of these are pretty straightforward, but once in a while you'll run into a puzzle that requires some thought. The game does a pretty good job of introducing complicated rooms with camera flybys and other visual cues, so you'll always know where to go and what you're supposed to be doing. Aside from combat and climbing, there are a couple of chariot race sequences in the game, but these tend to be somewhat frustrating because one small mistake means you're dead. If you're unlucky enough to reach a chariot sequence with few or no sand charges in your dagger, prepare yourself for a lot of trial and error to get through the sequence. Another small thing that's disappointing about the gameplay is that the sand powers take somewhat of a backseat in combat, especially toward the end of the game. Though you'll unlock some sand powers that can be used in combat, speed kills are all you really need in this game. You'll probably end up wanting to save your sand for rewinding time anyway, in case you make a mistake on a jump or on a speed kill. Rewinding time to make up for mistakes in combat or puzzle-solving has been a staple of the series since Sands of Time, and it's still the time power you'll probably use the most by far in The Two Thrones. If you're a fan of the first two games, The Two Thrones won't disappoint. The Two Thrones still uses what appears to be a very similar engine as was used in the previous games in the series. While it has aged, the game still looks fantastic, especially the large and wondrous-looking levels you explore. Whether you're jumping across rooftops in the city of Babylon, plying its underground caves, or exploring the palace grounds, there's always something pretty to look at. The character models have good texturing, but you can still tell that they're relatively low-poly for this day and age, especially the model used for an old friend that you'll encounter during the campaign. The deficiencies in the graphics engine are largely masked by lots of light bloom, which creates a soft-focus visual effect that contributes to the game's fairy tale atmosphere. Graphically there isn't really much difference between the three console versions of The Two Thrones. Though you might expect the Xbox version to look the sharpest, the light bloom effect turns out to be an equalizer in this regard. But no matter what version of the game you play, The Two Thrones looks fantastic, though the PS2 version can suffer the occasional bout of slowdown. The Xbox version does have the fastest load times of the three, so if you think you may yourself dying and reloading a lot, you will probably want to pick up that version of the game. The music in the game is a marked improvement from the last game, eschewing the annoying hard rock for more traditional Middle Eastern themes and instruments that you'd expect in a game called Prince of Persia. The voice acting in the game is also very good, although the actress voicing Kaileena (who also narrates the game) might be a little too soft-spoken to hear clearly at times. The Two Thrones marks a fitting end to a fantastic trilogy. The plot ties up all the loose ends and should prove satisfying for fans of the series. Though some new gameplay mechanics have been introduced, such as the speed kill and the new tricks of the Dark Prince, The Two Thrones is still basically very similar to the other two games--if you didn't like those for some reason, this game's not likely to pull you in. But for those of us who love solving the environmental puzzles and seeing the beautiful environments that the series is known for, The Two Thrones delivers in spades. What's different about the combat in The Two Thrones is the introduction of a stealth-kill mechanic, or ~speed kills,~ as they're called in the game. To execute a speed kill, you'll need to sneak up behind (or drop in from above) an unaware enemy. Tapping one button starts the speed-kill animation. Periodically, the animation will freeze, and you'll have a split second to tap a button to execute a strike. There are a number of different animations, and depending on the enemy it can require you to strike once or up to five times. Mistime any of your strikes and the speed kill will fail, meaning you'll have to fight the enemy the regular way. If you can catch two enemies close together, you can also use double speed kills. Overall, the new stealth-kill mechanic is pretty fun and satisfying to do and watch. The animations are extremely violent; you'll shank your foes every which way in their necks, guts, backs, and chests. The mechanic of doing a speed kill also offers just the right amount of challenge--it's not so easy that they're always automatic, but they're not too hard, either. Most importantly, though, speed killing your enemies means much less time spent in combat, which was never really Prince of Persia's strong suit as a game. We found ourselves rewinding out of failed speed kills to try them again, because they're not only fun to watch, but they help keep the game moving along. There are also a few boss fights in The Two Thrones, and each of them offers a unique challenge. Many of them will require you to combine speed-kill mechanics with climbing and jumping skills. It's not Prince of Persia without jumping and climbing. Speaking of climbing and jumping, this wouldn't really be a Prince of Persia game if there weren't tons of environmental puzzles to solve. As in previous games in the series, you'll be doing a lot of wall running, jumping, climbing, mantling, and trap dodging to find switches that open up doors, or simply to get to broken holes in the wall that will get you to the next room. A number of areas will require you to turn levers and hit switches to operate machinery that changes the position of platforms and other level geometry. Most of these are pretty straightforward, but once in a while you'll run into a puzzle that requires some thought. The game does a pretty good job of introducing complicated rooms with camera flybys and other visual cues, so you'll always know where to go and what you're supposed to be doing. Aside from combat and climbing, there are a couple of chariot race sequences in the game, but these tend to be somewhat frustrating because one small mistake means you're dead. If you're unlucky enough to reach a chariot sequence with few or no sand charges in your dagger, prepare yourself for a lot of trial and error to get through the sequence. Another small thing that's disappointing about the gameplay is that the sand powers take somewhat of a backseat in combat, especially toward the end of the game. Though you'll unlock some sand powers that can be used in combat, speed kills are all you really need in this game. You'll probably end up wanting to save your sand for rewinding time anyway, in case you make a mistake on a jump or on a speed kill. Rewinding time to make up for mistakes in combat or puzzle-solving has been a staple of the series since Sands of Time, and it's still the time power you'll probably use the most by far in The Two Thrones. If you're a fan of the first two games, The Two Thrones won't disappoint. The Two Thrones still uses what appears to be a very similar engine as was used in the previous games in the series. While it has aged, the game still looks fantastic, especially the large and wondrous-looking levels you explore. Whether you're jumping across rooftops in the city of Babylon, plying its underground caves, or exploring the palace grounds, there's always something pretty to look at. The character models have good texturing, but you can still tell that they're relatively low-poly for this day and age, especially the model used for an old friend that you'll encounter during the campaign. The deficiencies in the graphics engine are largely masked by lots of light bloom, which creates a soft-focus visual effect that contributes to the game's fairy tale atmosphere. Graphically there isn't really much difference between the three console versions of The Two Thrones. Though you might expect the Xbox version to look the sharpest, the light bloom effect turns out to be an equalizer in this regard. But no matter what version of the game you play, The Two Thrones looks fantastic, though the PS2 version can suffer the occasional bout of slowdown. The Xbox version does have the fastest load times of the three, so if you think you may yourself dying and reloading a lot, you will probably want to pick up that version of the game. The music in the game is a marked improvement from the last game, eschewing the annoying hard rock for more traditional Middle Eastern themes and instruments that you'd expect in a game called Prince of Persia. The voice acting in the game is also very good, although the actress voicing Kaileena (who also narrates the game) might be a little too soft-spoken to hear clearly at times. The Two Thrones marks a fitting end to a fantastic trilogy. The plot ties up all the loose ends and should prove satisfying for fans of the series. Though some new gameplay mechanics have been introduced, such as the speed kill and the new tricks of the Dark Prince, The Two Thrones is still basically very similar to the other two games--if you didn't like those for some reason, this game's not likely to pull you in. But for those of us who love solving the environmental puzzles and seeing the beautiful environments that the series is known for, The Two Thrones delivers in spades."}