{"ref": "https://www.gamespot.com/reviews/rlh-review/1900-2884896/", "date": "October 10, 2002", "game_name": "RLH: Run Like Hell", "text": "Run Like Hell, or as it is now known, RLH, is finally here, after months and months of delays. This sci-fi action adventure game was first announced before the PlayStation 2 had even hit store shelves in the US, and it had seemingly slipped under the radar until now. Gamers who may have been excited about the game so long ago may have even forgotten about it, and sadly, the end result is a game that--despite its lengthy development cycle--still feels rushed and incomplete. The game follows the story of Nichols Conner, a military man living on the Forseti space station with his fiance, Dr. Samantha Reilly. After a routine exploration mission with a colleague, Conner returns to the station, only to find that something has gone horribly wrong, as nearly all the inhabitants of the station, including the love of his life, are either missing or dead. Conner quickly discovers that an alien race has turned the once bustling station into a blood-and-guts-stained mess, and with the help of a hulking alien named Dag, he sets out to get to the bottom of things. Given the source material, it's clear that RLH borrows heavily from such Hollywood blockbusters such as Alien and The Thing. The space station is dimly lit and dreary, and at times it feels just about as dead as many of the people who once lived there. The invading alien forces also look very similar to the monsters in the previously mentioned movies. The game does a great job of maintaining this atmosphere throughout its course, but it really falls flat in the actual execution. Those familiar with this type of story-driven action adventure will quickly get a handle on RLH, although they'll find that the controls are rather clunky. The camera is the worst offender. You can rotate your view using the lower shoulder buttons on the Dual Shock 2, but strangely, pressing the right button moves the camera to the left and pressing the left button moves the camera to the right. While there are multiple control configurations to choose from, reconfiguring these buttons manually is not possible, so the camera controls are something you'll stumble over until you get the hang of it. To add to this, the camera has numerous problems when you're in cramped areas or backed against a wall. In these situations, the game will rapidly switch angles uncontrollably at the most inopportune times, such as in the heat of battle. Luckily, combat is aided by a lock-on system, so even if your target is offscreen, you'll still end up hitting the mark. While the combat system aids you quite a bit, the game tends to throw volleys of enemies at you at a time, with most of them appearing out of thin air, one after another. Thus, with each enemy encounter, your mission is basically brought to a screeching halt until the room is cleared. Escape generally isn't an option, since the aliens pitted against you will follow you until they die. Furthermore, the game provides you with an unlimited supply of ammunition, which takes just about any strategy out of the combat. To succeed, all you'll need to do is find a spot away from a spawn point, target your foes, and blast away. Aside from combat, the game relies on three other concepts to keep the game moving: lengthy and frequent cutscenes, simplistic minigames, and fetch quests that require you to scour every last inch of the level you currently occupy. The cutscenes wouldn't be so bad if they didn't seem like they were thrown into the game at the last minute. Some characters are lip-synched decently, while others speak out of a closed mouth, or worse still, the mouth of a marionette, opening and closing without any regard for the speech being delivered. This alone gives the game an unfinished feel. The spoken dialogue in the game is also overly dramatic and heavy-handed, much like what you'd find in a low-budget film. Minigames pop up every couple of levels, and they're simplistic at best. Most require either precise timing or button mashing, and they just break up the flow of the game even further. Once you get past all the other aspects of the game, you're ultimately left running from room to room, trying to find an important item, flip a series of switches, or collect notes with clues to a series of button combinations to open a locked door. Visually, RLH looks like a first-generation PlayStation 2 game. The character models aren't that detailed, and they're composed using blurry textures and drab colors. As previously stated, the space station is dark and generally lacking in any sort of detail that would bring it to life. When compared with other games currently being released on the PS2, RLH is clearly far, far behind the pack. The game also sounds about as good at it looks. The sounds of doors opening and shutting and the screams of the alien hordes are recycled over and over, and the game's score consists of brooding ambient sounds that aren't memorable in any way. One major shock comes by way of the licensed music that plays during each and every boss fight. There are a number of elements in RLH that break up the continuity of the story and the gameplay, and the music during these fights is the final nail in the coffin. Simply put, RLH is a game that is simplistic and linear and doesn't offer any compelling reason to play at all. The presence of product placement throughout the game is stranger still. Several times in each level, you'll encounter a vending machine selling the energy drink Bawls, and the backpacks worn by the residents of the station can also be purchased at retailers in your local mall. The one saving grace is the vending machines that are always situated next to the coolers dispense ~Pip Boy~ protein bars, which is a reference to Interplay's excellent Fallout games. While the argument against advertising in games has been hotly contested recently, it's certainly safe to say that actually experiencing it in this game delivers a strange, foreign feeling. Ultimately, RLH is a game that might have had promise when it was first announced, but didn't progress much from where it started. In a genre that is well represented by games like The Thing, Silent Hill 2, and even older titles like Extermination, this game is very difficult to recommend, even to a die-hard fan of similar games. In the end, RLH might have been better off fading away instead of clawing its way to store shelves."}