{"ref": "https://www.gamespot.com/reviews/city-crisis-review/1900-2790724/", "date": "July 18, 2001", "game_name": "City Crisis", "text": "Take-Two Interactive's latest PS2 offering, City Crisis, gets the unique distinction of being both oddly familiar and groundbreaking at the same time. At first look, this search-and-rescue game brings to mind the arcade classic Choplifter. Many gamers will find themselves right at home with the airlift-rescue aspect of this game, but on the other side of the coin, those same players will also look at the game and see a genre that is rarely touched upon. While the game isn't especially amazing to look at or play, City Crisis scores points for originality.City Crisis is also a game that doesn't hesitate to put you right in the heat of the action. The bulk of the game is spent piloting a helicopter over a large city, doing whatever it takes to ensure the safety of the people down below, whether it be fighting huge fires, rescuing those in danger, or pursuing criminals on the loose. While there are three short training missions to practice your flying, rescue, and fire-fighting skills, for the most part, as soon as you orient yourself with the mechanics of the game, you are thrown headfirst into an almost nonstop thrill ride. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: City Crisis Video ReviewAs previously stated, City Crisis has several different types of missions: Rescue and fire fighting--where you must quickly find a burning building, extinguish the ever growing fires, and rescue anyone in sight and bring them back to safety--and a chase mode, where you must follow the path of errant criminals down on the streets below with a high-powered searchlight so that the police can apprehend them. If you can play through all of the missions with a great score, you will eventually unlock two additional levels, Disaster and Final Rescue. To make matters a little more interesting, there are also several different helicopters to pilot, with varying levels of speed, navigation ability, and passenger capacity.With regard to the game's control scheme, City Crisis can take a little getting used to. Both of the PS2's analog sticks are used to pilot the craft: The left stick moves your craft forward, backward, and left and right, while the right stick manages your height and turning. Perhaps the most important button in the game is the O button, which raises and lowers the rope that brings victims to safety. The shoulder buttons also come into play: L1 gives your helicopter a boost, and L2 lets you hover in place, which is required when you are rescuing victims. For those who might find button juggling too much to handle, there is an option available that lets you hover automatically. The R1 button controls high-powered water missiles, which are helpful to put out large fires in a short amount of time, and R2 serves as a standard stream of water. During the fire-fighting missions, your water is always in short supply, but missiles can be replenished by successful rescues, and your water supply also slowly refills. While the control scheme is not that complicated on paper, in practice, you'll find that it is somewhat cumbersome and hard to navigate your helicopter through the many high-rise buildings you'll encounter during your missions.One significant gripe with the game is how difficult it is to judge your height and distance from buildings. In some of the more fast-paced chase missions, you will often find yourself running directly into the side of skyscrapers, damaging your helicopter. This frustrating situation could have been alleviated with the option of a different view or even a more dynamic camera. As it is, you'll be stuck with the same view throughout the whole game.Visually, City Crisis is not that impressive for a PlayStation 2 game. In fact, the many bland and blocky textures in this game look more akin to something you would find on a PSOne. To its credit, this game does maintain a solid frame rate throughout, without any slowdown present during the most intense moments in the game. However, it's almost a shame to see a game that doesn't stretch the very limits of the PS2's graphical power--or at least try to look significantly better than the last generation of PlayStation games. As a whole, City Crisis is a decent game and is challenging enough for even the most experienced players to have some trouble unlocking the final levels. Most will find the frenetic pace of the various missions enough to keep them satisfied. While it doesn't take full advantage of the PS2's power, City Crisis does manage to be in a class all its own, which these days, is something to take notice of."}