{"ref": "https://www.gamespot.com/reviews/assassins-creed-brotherhood-review/1900-6306198/", "date": "March 28, 2011", "game_name": "Assassin's Creed: Brotherhood", "text": "There are a number of key differences between Assassin's Creed II and its follow-up, Assassin's Creed: Brotherhood, but if there's one that some PC enthusiasts will appreciate the most, it's that Ubisoft's stringent copy-protection scheme has been jettisoned. This is cause for celebration in itself, though it's the captivating beauty and joyous exploration that make Brotherhood another standout in this ever-evolving franchise. The Assassin's Creed games have gone to great lengths to depict their environments and circumstances with painstaking historical authenticity, and Brotherhood is no exception. Its stunning re-creation of Rome will have you occasionally gasping at its beauty--the sun so bright, you can almost feel it warming your skin. A disappointing story, some audiovisual glitches, and a few other missteps might occasionally yank you from your reverie. But if you worried that a direct sequel released so soon after Assassin's Creed II would feel rushed or incomplete, then rest your mind: Brotherhood is a big, high-quality sequel deserving of both your time and money. Brotherhood doesn't quite have the same emotional impact as its fantastic predecessor, however. Once again, you don the robes of master assassin Ezio Auditore. After a battle at the family's villa in Monteriggioni, Ezio's nemesis, Cesare Borgia, steals the all-important artifact known as the Apple of Eden. With the help of Caterina and other old friends, Ezio heads to Rome to retrieve the Apple and rid the city of Borgia influence. There's a bit of drama when an associate is accused of betrayal, but for the most part, Brotherhood's plot is the most straightforward in the series, and because Ezio exhibits little personal growth, there's a hint of staleness to his escapades. You don't play just as Ezio, however: you once again take on the role of Desmond, the modern-day bartender-turned-lab-rat who relives Ezio's memories inside a machine called an animus. He has a greater role to play in Brotherhood than in the previous two games combined, and his endgame actions lead to an astounding finale that rivals Assassin's Creed II's for pure shock value. The plot may not be intricate, but a cast of excellent characters makes it easy to stay invested. One of them is Salai, Leonardo da Vinci's assistant and a mischievous rascal who enjoys flirting with Ezio as much as he does playing dice. You meet him in a set of missions called The Da Vinci Disappearance, which were released as premium downloadable content for the Xbox 360 and PlayStation 3 versions of the game. Salai's impish grin and cascading curls make him an excellent addition; however, most of Brotherhood's leading players are returning ones. You once again spend time with Caterina Sforza, Nicolo Machiavelli, and Ezio's sister Claudia, though the game's most memorable presence is that of a new character: Lucrezia Borgia, Cesare's sister--and lover. Lucrezia's sharp tongue is matched by her severe, almost vampiric appearance, and she isn't afraid to test the boundaries of human decency in the pursuit of power. Wonderful voice acting brings all of these characters to life. When Claudia stands up to her overbearing brother, you hear the strength in her voice and appreciate how much she has grown. Salai's overt lustfulness might make you squirm, but a charming voice-over gives him too much clever twinkle for you to ever lose patience. The best jumping sequences are those that let you get into a smooth rhythm. While Brotherhood's story falls short of series standards, its sense of place and time is as impeccable as fans could possibly hope for. You spend the majority of the time in Rome, and while you may miss exploring multiple cities, the city is nevertheless huge and gorgeous, brimming with so much visual variety and exquisite detail that Brotherhood feels as consequential as its forebears. You might roam into a cathedral to discover a palatial view punctuated by red tapestries and golden candelabras. Citizens wandering the streets munch on apples, carry lanterns in the evening, and flirt with each other behind pillars. The music enhances the atmosphere with operatic soprano warbles and French horn melodies. The production values are unfortunately undercut by occasional bugs. Combat might go eerily silent, or the music might not kick in when you scan the city from atop a perch. Button prompts may not appear when they're supposed to, and on some machines, menu text may not display. The way citizens might suddenly pop into view can be distracting--as can occasional frame rate hitches during cutscenes. There is also a series of missions framed as flashbacks in which Ezio is to appear in different clothing. However, if you don the special armor set included with this version, he might not be shown in the proper clothes in these missions. These are minor but noticeable blemishes in a game that otherwise looks and sounds superb. Within this grand world is a ton of stuff to do. The staples of the series--rooftop platforming, blending with crowds, silent assassinations, rhythmic swordplay--have all returned, and most have been enhanced or adjusted in some way. It's as joyous as ever to bound across roofs and climb to the tops of towers. Lifts that rapidly fling you to a rooftop are a great new addition and provide a second of high-speed thrills, though the movement mechanics are generally the same as before--it's the architecture and level design that have been altered for the better. As in Assassin's Creed II, you may search for glyphs hidden on walls and on rooftops, and they are perceptible only when you activate eagle vision. Finding one allows you to solve a puzzle, which in turn unlocks a small hint of a larger mystery. While most of these glyphs took only a modicum of effort to find before, many are now hidden on sizable landmarks with tons of nooks and crannies to explore. Expect to put in more effort if you hope to uncover more of the conspiracy that drives the series. Luckily, it isn't wasted effort: ledges and outcroppings are carefully and intelligently placed, which makes it a pleasure to climb these structures, whether you opt for a keyboard and mouse, or prefer to plug in a controller. I'm on a boat! Many towers you climb don't allow you to simply ascend with little care; they require more conscientious navigation. In fact, numerous towers not only require climbing, but must be burned to the ground as well. The Borgias have spread their influence around Rome, and to undermine their rule, you destroy their edifices. Before you can do that, you must assassinate a commander in the vicinity. Often, your target will flee if you directly engage the guards that surround him, so you will want to approach carefully. In many cases, this gives you a chance to put a new weapon, the crossbow, to good use. Not only is it handy for picking off one of these key figures, but it's also useful should a number of enemies charge you on horseback. In any case, once you have offed the key officer, you may climb to the top of the nearby tower and torch it. Afterward, you automatically take a leap of faith into a hay bale or wagon of leaves conveniently placed beneath, while melodramatic organ chords signal the importance of your endeavor. Eliminating Borgia influence is important because you then gain access to local vendors, though this access isn't immediate. The economy, an interesting but messy feature in last year's installment, has been fleshed out in smart ways. As before, you must spend money to make money, but Brotherhood's catalog contains a lot of big-ticket items. If you want access to blacksmiths, doctors, tailors, and so on, you first must purchase and renovate their shops. Not only does renovating an empty storefront give you access to supplies, but it also begins to generate income. As you bring in money, you eventually purchase landmarks, which cost a tidy sum. In addition, the PC version includes an online investment feature. By holding the space bar on the map screen, you can see where other players are investing their money. Investing in a popular business increases the amount of cash you earn from it, and you earn specialty items when you reach certain investment milestones. You also find such items (prayer beads, diamonds, jars of leeches) when looting corpses and treasure chests, and when tackling escaping pickpockets. These items can be offered to designated vendors in return for high-quality weapons, tougher armor, and the like. There's little talk of Templars in Brotherhood's campaign, though there are some Templar hideouts to explore. There is also a new group of enemies to contend with: the followers of Romulus. Most of your contact with these beastly, fur-clad zealots is in their lairs, which take the place of Assassin's Creed II's tombs. Lairs are improvements over the tombs, however, in part because time limits are no longer so central to completing them. There is also a lot more design variety to them. In one, fires erupt beneath you, and you must leap from pillar to pillar to avoid falling into the flames. In another, you leap across great heights and use your crossbow in creative ways to cause an enormous chandelier to crash into a column. One fascinating lair is an expansive abandoned residence, which is a nice visual change of pace from the darker, more structured tomb architecture. Many of the standard missions should be familiar to series fans: tail your target by slinking from one group of citizens to the next (it's nice that they engage in conversation with each other when you do this now, rather than remain silent); fend off a series of attackers; or navigate to specific locations so you may eavesdrop on important conversations. But even within these assignments, there is a great deal of diversity. In one case, you must infiltrate a Passion play and determine the appropriate target before he can poison your contact. In another, you slink among a group of drunken revelers. The missions surrounding da Vinci's inventions are perhaps the most memorable, however. They recall the flying machine mission and carriage escapes in Assassin's Creed II, but this time, you get even more impressive toys to play with and more thrilling scripted sequences. Some tasks don't quite rise to the same level. Assassin's Creed's loose movement mechanics are wonderfully suited to its free-form climbing and so-called social stealth, but are less ideal for tasks that require precision. This can lead to frustration in missions that automatically fail if you are spotted or that require you to give chase and tackle your target. Fortunately, these are infrequent exceptions; on the whole, Brotherhood's mission structure is inspired. Ezio takes a moment to brood before exiting the lair. Assassin's Creed: Brotherhood's most noteworthy new feature isn't introduced until you're several hours in. In a callback to the original Assassin's Creed, distressed citizens might be under attack by Borgia's loyal soldiers. Rescuing one makes him or her loyal to your cause. From here, you control this underling's fate, sending him on various missions around the region, and even calling for his assistance in battle. These missions are handled via menus when you visit a pigeon coop. You select a contract and choose a recruit or recruits to assign, and they hopefully succeed. By completing missions, the recruits level up, and you can then improve their armor or weaponry. Eventually, they become full-fledged assassins and even celebrate their newfound status in a ceremony. Provided you haven't sent the whole cache of recruits on missions, you can call upon a few in battle, at which point they either rain down arrows from an unseen vantage point, leap out of haystacks, or charge in on horseback and engage their targets. This aspect of Brotherhood is another way of giving you something to do in a game already full of content. At the very least, it's fun to call upon your brothers and sisters and watch them do their dirty work on your behalf. Ultimately, however, this aspect feels unnecessary and contrived. This is due in part to the combat's lack of challenge. Swordplay has been tweaked for the better, but a move that lets you string together one-slash kills keeps it from ever being so challenging that you need to call on your fellow assassins to gain a strategic advantage. More importantly, there's never any payoff for spending time improving your subordinates. The very existence of an ever-growing group of murder machines hints at an overall purpose--a grand final battle or some sort of reward for putting together the most powerful brotherhood possible. But no such reward exists, which makes the entire process feel like busywork. Granted, it's entertaining busywork, and it implies that Ezio is the full leader of a growing order. However, the feature lacks direction; it's as if you spent hours leveling up in a role-playing game, only for it to end without a climactic standoff. Enjoy conspiracies? Then look for all the hidden glyphs. Assassin's Creed: Brotherhood also introduces an unusual multiplayer component that doesn't deliver constant thrills, but is a satisfying alternative to the multitude of shooters on the market. There are several match types, which include the Assassinate and Escort modes released to consoles in the Da Vinci Disappearance pack. Most of Brotherhood's modes are variations on the same theme: you hunt an assigned target (alone, or in a team) while simultaneously trying to avoid the player assigned to assassinate you. This isn't as easy as it sounds. You get a general indication of your target's location, and you know what your target looks like. But then again, many of the non-player characters look exactly the same; if you're smart, you'll move slowly and stay close to your look-alikes to throw your hunter off your trail while keeping your eyes open for the telltale signs of another player. To further complicate matters, you can level up and earn special powers, such as temporarily disguising yourself, or using eagle vision to spot your victim. Experiencing Ezio's rise from streetwise youth to devious assassin was one of Assassin's Creed II's finest pleasures. In Brotherhood, he gets plenty of chances to flash his disarming smirk, but his character arc isn't nearly as fascinating as it might have been. Nevertheless, this excellent period adventure has a magical allure that draws you in with its sheer beauty. Additionally, few games make it such a pleasure to simply move from place to place, whether you are galloping on horseback, soaring through the sky from rooftop to rooftop, or diving into a bale of hay from hundreds of feet above. Like Ezio himself, Assassin's Creed: Brotherhood doesn't exhibit the growth you might have expected, but its charms are almost impossible to resist. Eliminating Borgia influence is important because you then gain access to local vendors, though this access isn't immediate. The economy, an interesting but messy feature in last year's installment, has been fleshed out in smart ways. As before, you must spend money to make money, but Brotherhood's catalog contains a lot of big-ticket items. If you want access to blacksmiths, doctors, tailors, and so on, you first must purchase and renovate their shops. Not only does renovating an empty storefront give you access to supplies, but it also begins to generate income. As you bring in money, you eventually purchase landmarks, which cost a tidy sum. In addition, the PC version includes an online investment feature. By holding the space bar on the map screen, you can see where other players are investing their money. Investing in a popular business increases the amount of cash you earn from it, and you earn specialty items when you reach certain investment milestones. You also find such items (prayer beads, diamonds, jars of leeches) when looting corpses and treasure chests, and when tackling escaping pickpockets. These items can be offered to designated vendors in return for high-quality weapons, tougher armor, and the like. There's little talk of Templars in Brotherhood's campaign, though there are some Templar hideouts to explore. There is also a new group of enemies to contend with: the followers of Romulus. Most of your contact with these beastly, fur-clad zealots is in their lairs, which take the place of Assassin's Creed II's tombs. Lairs are improvements over the tombs, however, in part because time limits are no longer so central to completing them. There is also a lot more design variety to them. In one, fires erupt beneath you, and you must leap from pillar to pillar to avoid falling into the flames. In another, you leap across great heights and use your crossbow in creative ways to cause an enormous chandelier to crash into a column. One fascinating lair is an expansive abandoned residence, which is a nice visual change of pace from the darker, more structured tomb architecture. Many of the standard missions should be familiar to series fans: tail your target by slinking from one group of citizens to the next (it's nice that they engage in conversation with each other when you do this now, rather than remain silent); fend off a series of attackers; or navigate to specific locations so you may eavesdrop on important conversations. But even within these assignments, there is a great deal of diversity. In one case, you must infiltrate a Passion play and determine the appropriate target before he can poison your contact. In another, you slink among a group of drunken revelers. The missions surrounding da Vinci's inventions are perhaps the most memorable, however. They recall the flying machine mission and carriage escapes in Assassin's Creed II, but this time, you get even more impressive toys to play with and more thrilling scripted sequences. Some tasks don't quite rise to the same level. Assassin's Creed's loose movement mechanics are wonderfully suited to its free-form climbing and so-called social stealth, but are less ideal for tasks that require precision. This can lead to frustration in missions that automatically fail if you are spotted or that require you to give chase and tackle your target. Fortunately, these are infrequent exceptions; on the whole, Brotherhood's mission structure is inspired. Ezio takes a moment to brood before exiting the lair. Assassin's Creed: Brotherhood's most noteworthy new feature isn't introduced until you're several hours in. In a callback to the original Assassin's Creed, distressed citizens might be under attack by Borgia's loyal soldiers. Rescuing one makes him or her loyal to your cause. From here, you control this underling's fate, sending him on various missions around the region, and even calling for his assistance in battle. These missions are handled via menus when you visit a pigeon coop. You select a contract and choose a recruit or recruits to assign, and they hopefully succeed. By completing missions, the recruits level up, and you can then improve their armor or weaponry. Eventually, they become full-fledged assassins and even celebrate their newfound status in a ceremony. Provided you haven't sent the whole cache of recruits on missions, you can call upon a few in battle, at which point they either rain down arrows from an unseen vantage point, leap out of haystacks, or charge in on horseback and engage their targets. This aspect of Brotherhood is another way of giving you something to do in a game already full of content. At the very least, it's fun to call upon your brothers and sisters and watch them do their dirty work on your behalf. Ultimately, however, this aspect feels unnecessary and contrived. This is due in part to the combat's lack of challenge. Swordplay has been tweaked for the better, but a move that lets you string together one-slash kills keeps it from ever being so challenging that you need to call on your fellow assassins to gain a strategic advantage. More importantly, there's never any payoff for spending time improving your subordinates. The very existence of an ever-growing group of murder machines hints at an overall purpose--a grand final battle or some sort of reward for putting together the most powerful brotherhood possible. But no such reward exists, which makes the entire process feel like busywork. Granted, it's entertaining busywork, and it implies that Ezio is the full leader of a growing order. However, the feature lacks direction; it's as if you spent hours leveling up in a role-playing game, only for it to end without a climactic standoff. Enjoy conspiracies? Then look for all the hidden glyphs. Assassin's Creed: Brotherhood also introduces an unusual multiplayer component that doesn't deliver constant thrills, but is a satisfying alternative to the multitude of shooters on the market. There are several match types, which include the Assassinate and Escort modes released to consoles in the Da Vinci Disappearance pack. Most of Brotherhood's modes are variations on the same theme: you hunt an assigned target (alone, or in a team) while simultaneously trying to avoid the player assigned to assassinate you. This isn't as easy as it sounds. You get a general indication of your target's location, and you know what your target looks like. But then again, many of the non-player characters look exactly the same; if you're smart, you'll move slowly and stay close to your look-alikes to throw your hunter off your trail while keeping your eyes open for the telltale signs of another player. To further complicate matters, you can level up and earn special powers, such as temporarily disguising yourself, or using eagle vision to spot your victim. Experiencing Ezio's rise from streetwise youth to devious assassin was one of Assassin's Creed II's finest pleasures. In Brotherhood, he gets plenty of chances to flash his disarming smirk, but his character arc isn't nearly as fascinating as it might have been. Nevertheless, this excellent period adventure has a magical allure that draws you in with its sheer beauty. Additionally, few games make it such a pleasure to simply move from place to place, whether you are galloping on horseback, soaring through the sky from rooftop to rooftop, or diving into a bale of hay from hundreds of feet above. Like Ezio himself, Assassin's Creed: Brotherhood doesn't exhibit the growth you might have expected, but its charms are almost impossible to resist."}