{"ref": "https://www.gamespot.com/reviews/madden-nfl-06-review/1900-6131574/", "date": "August 19, 2005", "game_name": "Madden NFL 06", "text": "Last year's debut of the Madden series on Nintendo DS resulted in a solid, but unremarkable effort--it offered a fine game of football but wasn't without its problems. One year later, EA Sports is the sole purveyor of all things NFL and the second football game for Nintendo's dual-screened handheld is here. The result is a game that has eliminated most of the ugly bugs from last year's entry, but it still doesn't manage to rise much above the quality of its predecessor. Kicking gets a touch-screen makeover with Madden NFL 06. In an attempt to keep the DS's touch screen relevant for sports, the developers at EA Tiburon have added more functionality to the lower screen than that found in last year's game. This is most apparent in the new kicking controls, which make full use of your ability to quickly draw a straight line on the lower screen (the quicker and straighter you trace the line, the more powerful and true your kick will be). Draw too slowly or manage to skew your line left or right, and your kick will suffer accordingly. There's also an important gauge that you can adjust before the kick to set the vertical angle of it. If you set it too low then your field goal attempt will be ripe for the blocking, as happened to us on one occasion. The touch-screen kick meter is an interesting take on kicking (it's akin to the swing mechanic in the first DS Tiger Woods PGA Tour game), and it brings an extra bit of challenge to long-field goal attempts; however, it also feels a bit forced. Anyone who has played a Madden game understands how the kicking game works, and altering it only for DS users seems like it would be a change just for the sake of saying that the touch screen has been utilized. You're able to access a lot of different information with a single tap of the DS's screen this time around. The lower screen has a number of different icons that line each side--one icon lets you see game stats, another lets you review a breakdown of yardage per down. On the right-hand side of the screen, you touch the H button to call a hot route, the A button to execute an audible, and the T icon to call a time-out. Of course, these are all functions you can accomplish with the simple press of a button (without a touch screen and stylus) as well. Finally there's the touch-screen passing, which you can enable in the gameplay-settings menu. You can tell your quarterback where to throw the ball simply by tapping the screen in the appropriate area. In the end, the touch-screen features of Madden have their ups and downs. Some players may like having all of the game-specific information just a tap away, while some will prefer the touch-screen passing mechanic, and some will get aahem kick out of the new kicking controls. These controls, which seemed novel in last year's game, seem a bit superfluous this time around, especially considering you can perform nearly every one of them without the stylus and touch screen. The dual screens give you two different views of the action on the field. The two-screen setup in Madden NFL 06 looks a lot like last year's game. The upper screen is for on-the-field action and the lower screen provides a top-down X's and O's look at the field. We like the two different perspectives, especially for the passing game. The upper-screen camera angle is just a bit too low to the virtual ground for finding eligible receivers downfield. With a quick peek to the lower screen, however, you can easily spot receivers who've put some distance between themselves and their coverage. The odd camera angle of the upper-screen view of the field, which shifts downward once the ball is snapped, can make for some strange pursuit angles, and you'll likely miss a few sack attempts until you get used to it. Once you get used to the game's presentation quirks, you'll find the same rock-solid football gameplay that lifted last year's game from the murk of mediocrity. The illuminated passing cone that made its debut in the console and PC versions of Madden 06 is nowhere to be found on the DS game and, as such, the passing game is nearly exactly like last year's. Players can sink into performance-reducing slumps or go on a tear and literally pick you apart. (How else can one explain a three-touchdown passing performance by Trent Dilfer?) The ground game, on the other hand, seems more effective this time around, both when running up the middle and when darting to the outside. Big holes can open up through your offensive line when running between the tackles, and thanks to the game's mostly solid frame rate, you'll be able to take advantage of these running lanes to pick up some big yardage. If there's one big gameplay complaint, it's the relative difficulty we had bringing down mobile quarterbacks. Sure, Michael Vick can dodge some sack attempts, but no way is he going to be able to brush off a head-on diving tackle from a defensive lineman like he can in this game. Setting your depth chart, trading players, negotiating contracts...just part of the fun of the franchise mode, which makes its debut on the DS. The biggest addition to Madden 06 for the DS is a franchise mode, albeit one that is not that far removed from a simple season mode. You have player contracts to deal with (along with pesky, demanding player agents), you can negotiate trades with other teams or sign free agents, and you can keep track of news from around the league on a weekly basis--all of which you can play over multiple seasons. It's bare bones and functional (there are no fancy owners' expectations or the ability to set concession prices) and it has much of the functionality you need in a franchise mode on a handheld system. We would have liked to have seen some more user-friendly explanations of team needs during the signing periods, but those familiar with offseason activities in football franchise modes will likely feel right at home. The rosters in Madden 06 for the DS have some problems: Kellen Winslow Jr. is still starting for the Browns, and Craig Krenzel is still a backup for the Bears (and, for that matter, Rex Grossman is still healthy), among other errors. Most of these inconsistencies can be fixed with a few simple roster adjustments in either season or franchise mode, and it should be noted that both modes support the inclusion of original teams that can be created using the create-a-team feature. It's not a terribly in-depth tool--you choose your team name, city of origin, logo, uniform design, and color palette and off you go--but it's nice to have it in there. Other gameplay modes in Madden 06 include custom league and tournament modes, a two-minute drill feature, and practice and situation modes. In situation mode, you can choose to create your own unique game-time situations using a number of different criteria, such as time remaining, down and distance, and home and away scores, or you can choose to play through a series of classic NFL matchups from the past. A minicamp feature will have you running, passing, kicking, and tackling your way through a number of practice-field minigames (which, just like regular head-to-head matchups, can also be played wirelessly against one of your DS-owning friends). There is also a create-a-play feature that lets you formulate a play nearly from scratch by choosing your starting set, the type and direction of your quarterback drop, individual blocking assignments for linemen, and the routes your receivers run. It would have been more fun to create crazy routes for receivers by drawing them directly onto the DS touch screen, but the current setup of scrolling through more than 60 different route options works fine as well. In terms of graphics, Madden 06 on the DS doesn't look remarkably different from last year's game. Player models are still chunky and pixelated--about the only distinguishing characteristic you can make out is the player number on jerseys. Moreover, the passing animations can be clunky--a ball may be swatted away from a receiver's hands by a covering defensive back that seemingly didn't even lift his blocky little hands. Still, there are a few new tackle animations that add some punch to the physical side of the game, and the frame rate seems solid throughout. You can't tell in this screen, but Madden just repeated himself. Again. Al Michaels and John Madden make limited audio appearances in Madden 06. There may be more commentary in this year's game than there was in last year's, but it's rarely any more insightful. John Madden will be repeating his color commentary inside of two possessions, and Al Michaels warns the offensive team to ~hurry up~ each and every time the play clock dwindles down to 10 seconds. Crowd noise is prevalent this year, but it also seems to cut out periodically for no obvious reason. A slimmed-down selection of EA Trax-approved tunes makes it into the game, and just like the rest of Madden's audio, sounds fine through the DS's speakers. Just as in the rest of the gaming world, Madden NFL 06 is the only choice for DS owners with a football hankering. If you've been eagerly awaiting a franchise mode for the DS Madden series, you'll be pleased to note it's here in 06, along with another structurally sound game of football and some DS-only features that should hold marginal interest for most players. If, on the other hand, you're looking for something remarkably different from last year's game, you likely won't find it here."}