{"ref": "https://www.gamespot.com/reviews/rollercoaster-tycoon-2-wacky-worlds-review/1900-6029156/", "date": "May 29, 2003", "game_name": "RollerCoaster Tycoon 2", "text": "If nothing else, the latest expansion pack for RollerCoaster Tycoon 2, Wacky Worlds, remains true to designer Chris Sawyer's amusement-park simulator sequel. In fact, the expansion is exactly like that disappointing sequel, since it too gives fans of the series almost nothing new. Instead, the expansion sticks to the formula apparently carved in stone when the first RollerCoaster Tycoon became a surprise hit in 1999--Wacky Worlds offers the same old gameplay and the same old rides. The expansion's scenarios, and the ideas behind them, seem tired and overused, and the expansion itself is overpriced. Wacky Worlds lets you turn the majestic Great Wall of China into a tacky tourist trap. The few enhancements that Wacky Worlds does make are mostly cosmetic. The series' fans have put together a long list of requests for features such as a proper map editor and a sandbox mode, and these requests have largely been ignored in favor of including 17 park-building scenarios in every corner of the globe. The developers' idea of ~wacky~ apparently involves letting you build parks in and around various national landmarks. For instance, scenarios set in Africa let you construct coasters alongside Victoria Falls and around an abandoned diamond mine. In Asia, the Chinese have decided to desecrate their cultural heritage by hiring you to put up a theme park around the Great Wall. The Japanese have run out of room for attractions, so they're expanding into the sea. These scenarios sound a lot more interesting than they actually are. Although the idea of traveling the world while building regional theme parks near cultural monuments is interesting, it ends up being more of a gimmick than anything else. Essentially, the level designers seem to have approached each scenario with only a single guideline: ~Wouldn't it be cool if we could let players build roller coasters near things like the Great Wall of China?~ Unfortunately, that's about as far as they seem to have gotten, since Wacky Worlds doesn't really offer any new features or gameplay options aside from having world-famous landmarks in the backdrop of each map. Like in the original game, your goals are restrictive. You need to attract a certain number of guests, increase your park's rating, make big bucks in a short period of time, increase the value of your park, and so on. Although these objectives are related to the different regions--land is restricted in one South American setting because of environmental regulations protecting the rainforest, you have to repay European Union loans in the scenarios set in the Old World, you can't modify land around the Great Wall, and so forth--you're still trying to meet the same demands you were dealing with in the original RollerCoaster Tycoon almost four years ago. And unfortunately, you're limited in how you can go about doing so. While Wacky Worlds features about 50 additional rides and lots of new scenery, almost everything has been grouped into theme packs that are available only in the region for which they were intended, so if you had hoped to do something truly ~wacky,~ such as building Chinese restaurants in a European theme park, or dropping some North American cowboy statues next to your rides in Australia, forget it. What better way to commemorate the launch of Sputnik than with a roller coaster? And even if swapping around restaurants, attractions, and other fixtures from other countries were possible, it still wouldn't be anything new, since all the expansion's new rides are nothing more than renovated versions of those in the original game. The Chinese junk, for instance, is a remodeled pirate ship. The Sputnik Commemoration is just a roller coaster with cars that look like the fabled Russian satellite. And so on. This face-lift may seem interesting for a few hours or so, though experienced RollerCoaster Tycoon players will quickly realize that there's nothing new under the surface. Finally, Wacky Worlds is extremely overpriced. The current suggested retail price of $29.99 for a skimpy add-on almost seems like highway robbery, especially when you consider that RollerCoaster Tycoon 2 itself is selling for about the same price at the moment. Some of the revamped rides and scenery items will no doubt be useful tools in the hands of serious fans who are interested in building their own scenarios, but if all you want to do is build new roller coasters and concession stands, you probably won't get your money's worth."}