{"ref": "https://www.gamespot.com/reviews/the-bigs-2-review/1900-6213318/", "date": "July 13, 2009", "game_name": "The Bigs 2", "text": "In real life, performance-enhancing drugs have tainted the national pastime, giving ballplayers an artificial means to get more power and bigger heads. But what if there were a way to make baseball players throw flaming fastballs or leap 20 feet in the air to steal a potential home run without the stigma of cheating or any grotesque side effects? In The Bigs 2, you can smack a ball far enough to make Mark McGwire jealous, zoom around the field like a gazelle with a glove, and use your superpowers to drag the lifeless Nationals to the World Series, the most unrealistic feat of all. But all of these extraordinary abilities are augmented by the tense pitching and exhilarating hitting that make the real sport so exciting. It's a shame these newfangled abilities can't cover up for amateurish baserunning and blundering fielding, but these small issues are dwarfed by The Bigs' larger-than-life persona and thrilling mechanics. The over-the-top moves give The Bigs 2 its most exciting moments, but it is the strategic pitching that makes this game so engrossing. Each pitcher has four different pitches in his repertoire (culled from a pool of all the standard pitches, including a knee-buckling curveball and a fluttering knuckleball). You aim using an onscreen cursor, hold down the appropriate face button to build up the power, and then unleash a doozy. If you get near the top of the power gauge, not only can you throw a harder pitch, but you can hide where the ball will end up. If you mess up the gauge, you tip off where your throw will land, giving the batter a huge advantage. Although you don't tire in the traditional sense, you do lose the ability to throw certain pitches during the course of the game. Every hit you give up lowers the effectiveness of the last thrown pitch type, and if you give up enough hits or a costly grand slam, you lose that throw entirely, making it much easier for a batter to figure out what you're going to throw next. There is also an exciting risk/reward dynamic that makes pitching tense and satisfying. Every batter has a red zone in his swing window that indicates his wheelhouse. If he smacks a ball left hanging in this area, he can easily score a hit or even knock a ball clear over the fence. But as a pitcher, you need to test batters by throwing it in their comfort zone. If you sling one straight through to the catcher, you fill up your turbo meter, which lets you throw flaming, nearly unhittable fastballs. Tempt your luck too often and a batter will be wise to your tricks, so figuring out when to try for the money pitch and when to nibble around the corners is an important part of the strategy, something that gets nerve-racking when a close game winds down to the final few outs. The hitting mechanics are a lot less deep, giving you the option to swing for contact or power without any other bells or whistles, but it's still a lot of fun. Catching up to a speeding fastball or figuring out the trajectory of a 12-to-6 curveball is a rush, and lofting the game-winning run over the outstretched glove of a diving shortstop never ceases to thrill. Once you get a grip on the basic mechanics, it's time to let loose with your superpowers. When you're in the field, you can deftly snag a line drive zooming past your head or leap high above the turf to snatch a ball zooming over the fences, and these extraordinary plays are triggered by quick-time events. Having to methodically enter a button combination in the middle of a baseball game does take away a bit from the fast-paced action, but these events happen seldom enough that they don't dampen the excitement of the sport. When you pull off a legendary play, such as an awe-inspiring catch or a clutch strikeout, you earn points. When your point meter is filled, you can cash it in for big powerups for your batter or pitcher. As a batter, you can use Big Blast, which causes the next ball you make contact with to fly out of the park. As a pitcher, you can use Big Heat, which lets you use turbo pitches for an entire at bat. These big play powers are not only exciting, but add another dose of strategy into the mix. It takes a few innings to fill up the bar, so using your superpower at an inopportune time can wind up costing you the game. If only the baserunners were endowed with incredible abilities. These fools need to be babysat the entire game or they'll end up doing something incredibly stupid. Watch in horror as your lead-off batter stops in the middle of a basepath, neither advancing toward third nor finding sanctuary at second. It can be maddening to see the complete ineptitude of your fellow players, but you can always take control of them yourself, so it's not a huge concern. The same problem crops up with fielders, though. They can jump higher than any man should be able to, but they have a lot of trouble tracking down balls. They will frequently stand still to watch a home run fly over their heads, instead of trying to catch it before it does damage, and it's not always possible to switch to them in time to make a difference. These problems don't destroy the fun of The Bigs 2, but they crop up often enough that they become an annoyance. If only you could see the batter's bitter tears after this home run-stealing grab. Legends Challenge is the main mode in The Bigs 2. You create your character, choose your team, and try to become a legend. The majority of your time is spent playing baseball games (shocking!), but there are a few minigames and other goals to give some diversity. These challenges take various forms, such as Distance Hitting, where you try to blast balls out of the park, and Running, where you sprint through an obstacle course, and by completing these, you build up your attributes. There are also statistics to strive for in games, such as stealing a set number of bases or driving home a certain number of runs, and these do a good job of keeping games fresh. Unfortunately, there isn't a real season mode in The Bigs 2. Legends Challenge lets you guide a team through the regular season and to the World Series, but the focus is on your individual progress as a player. If you want to build a team from scratch and focus on the statistics behind the game, you're out of luck. The lack of a multiplayer mode hurts the longtime enjoyment of The Bigs 2, but Legends mode takes a while to play through. The visuals in The Bigs 2 look good at first, but they have some weird quirks as well. The player models are large and detailed, and the stadiums do a good job of bringing the real landmarks to life, even letting you destroy pieces of them with well-placed home run blasts. But the animations of the players, especially when they are in the field, look freakish. The commentary adds to the excitement of the games. San Francisco's Damon Bruce provides the verbal barrage, and though he does repeat himself from often, he has a number of funny comments: ~You can't stop him; you can only hope to cliche him!~ The reason The Bigs 2 is so much fun is that it encompasses all the over-the-top action that makes arcade baseball games so exciting but keeps the core baseball mechanics intact. The pitching is particularly intense, forcing you to match wits with your opponent, and scoring a huge hit makes batting just as thrilling. There are a few AI quirks that crop up far too often, and no multiplayer to strike out friends, but the on-field experience is so much fun that it's easy to ignore these problems and keep slugging away. The Season mode doesn't have the most in-depth statistics, but it does provide another option for baseball fans who love trades and numbers. The gameplay is still the star of the show, though, and The Bigs 2 knocks it out of the park."}