{"ref": "https://www.gamespot.com/reviews/fate-review/1900-6127845/", "date": "June 20, 2005", "game_name": "FATE", "text": "Though Diablo-style hack-and-slash role-playing games have proliferated on video game consoles these past few years, for whatever reason, they've been scarcer on the PC. That being the case, if you've been hankering for a good old-fashioned monster-and-treasure-filled dungeon crawl lately, you should check out Fate. It's a fully 3D action RPG that's like a combination of Diablo and its sequel, but with better graphics. It's got a storybook, family-friendly look and feel to it, and it's shamelessly derivative of Blizzard's definitive action RPG series. But these qualities--along with its budget price--turn out to be a big part of the draw. Fate is a Diablo knockoff with a heart of gold...or something. Look, just try it. It's good. Diablo is probably one of the most influential games of the past 10 years, and its influence on Fate isn't subtle. In fact, of all the games that have used Diablo as a template, Fate is one of the most blatant in its attempts to directly reassemble Diablo's unique combination of qualities. Fate sports similar gameplay, a similar structure, a similar interface, and any number of other parts that could easily be traced back to Blizzard's series. Even some very specific details, like some of the sound effects, seem like they came straight from Diablo. The main difference between the two is that Fate has no multiplayer mode. But it's not just a straight rip-off, as Fate features a number of clever innovations within the scope of this style of gaming. We'll get to those in a second. In Fate, you play as a boy or a girl who ventures into the town of Grove, along with his or her pet dog or cat. Grove is a quaint, little down that happens to sit right next to an ominous dungeon gate. The dungeon, sure enough, consists of dozens of increasingly challenging, randomly generated mazelike floors, each teeming with monsters and littered with treasure. The structure of the game is simple: You go into the dungeon and fight your way deeper and deeper into it, earning experience and loot as you go. Your motivation to press on will often come from townspeople challenging you to accomplish certain quests, which typically involve whacking a boss monster in part of the dungeon that's just one or two floors deeper than wherever you left off. Sometimes you'll teleport back to town (by means of town portal spells--what else?) to buy and sell stuff and to deliver the good news of your missions accomplished. However, Fate mostly takes place in the dungeon. Though dungeon-crawling invariably requires some wandering around, it's the combat that's typically the interesting part. Combat in Fate, much like in Diablo, is pretty straightforward, but it looks great, has a solid feel to it, and is therefore quite satisfying. You see an enemy, and you click on it to attack using either ranged or melee weapons. If your character has damage-dealing spells equipped, you can also blast your foes that way. Enemies come in all shapes and sizes, and they may have different resistances or special abilities of their own. So you shouldn't expect to rely on just one set of tactics to get the job done. Still, combat is basically a slugfest, so be sure to pack plenty of health potions, or mana potions if you're a caster. Expect to square off against virtually every fantasy monster mainstay you can think of, from slimes to vampires to orcs. In turn, many of them will drop useful (or at least valuable) magic items when defeated. So not only can it be fun to look forward to whatever dangers are in store next, but also it's exciting to find that perfect new weapon or armor piece to round out your abilities. Between that and the quest system, Fate does a fine job of always tempting you with some other carrot on a stick. A canine or feline companion will keep you company as you delve deeper into the multistory dungeon. As for the differences between Fate and Diablo, for one thing, Fate doesn't let you choose between different character classes. Instead, you're free to develop your character however you see fit, by bolstering his or her armed combat or magic skills or by whatever combination you like. This system is perhaps a little intimidating for what's otherwise a breezy game, since right off the bat, there are so many places where you could be spending the small number of skill points you gain per level. And as tempting as it may be to spread your skill points across all the different skills that sound interesting, you're probably better off specializing in a small number of compatible abilities--for example, swordfighting and critical strike or spellcasting and attack magic. If you spread your points too far and wide, you'll probably just end up feeling like you're stuck with a weak character. Still, this open-ended system ultimately works well, and the experience of playing a fighter-type character is indeed quite different from playing as a caster. For what it's worth, magic-oriented characters are probably the most interesting, since you can have up to a dozen different spells mapped to your function keys. So you can be summoning creatures to aid you while raining fire and lighting down on your foes. Meanwhile, a fighter character is limited to whaling on his opponents with a weapon. Then there's your pet, which serves as your faithful companion throughout the adventure. It's possible to buy or catch fish (via a simple little minigame) that can transform your little doggy or kitty into something more powerful, but either way, your pet will travel by your side, helping you to attack foes and sometimes drawing their fire. Perhaps more importantly, your pet has its own inventory, so it effectively serves as a pack mule. At the touch of a button, you can even make it automatically run back to town to sell everything in its stash, saving you the trip. Again, you'll still need to go back to town to resupply, or at least to cash in your quests and get new ones, but this pet trick turns out to be a smart way to alleviate one of the more cumbersome aspects of games like this. Some of Fate's monsters are surprisingly big and mean-looking. Fate pretty much goes on and on like this, with you and your foes growing more and more powerful. There are an unlimited number of randomly generated items in the game, in addition to the ability to customize equipment by augmenting it with magically imbued gems. Some of the magic items can have what seems like an absurd number of different, sometimes contradictory, enchantments on them, which betrays the random nature of the game design but also admittedly helps keep things interesting. Additionally, you have a fame level that's independent of your experience level. Fame is gained from completing quests and slaying boss monsters. Gaining fame levels gives you more skill points, and the best equipment also has fame levels as part of the prerequisites. It's another arc to follow, but it's not that big of a deal. The game features four levels of difficulty, the open-ended character building system, and what feels like quite a lot of different monsters, items, and spells. As a result, it can easily keep you busy for a while. Still, the random nature of Fate eventually begins to yield diminishing returns (especially once you get to higher levels and the leveling up slows down a lot), the monsters and levels start to look the same, and the combat gets a lot tougher. And the loading times between dungeon floors don't get any shorter. When you run out of health in Fate, you're given several choices, such as getting bumped back up three dungeon levels or restarting from the point you fell, but at a significant cost to your fame and experience. This death system is interesting, but it can feel surprisingly punitive in a game that's otherwise so easy on the senses. Fate sure does look pretty, though, with its nicely lit and colorful, fully 3D caverns and catacombs. Some of the monsters are surprisingly big, which makes it satisfying to see their bodies pile up after a big skirmish. The game not only looks great but also runs smoothly, even on relatively modest systems. A few nice touches are in there to help make the graphics as functional as they are attractive, too. For example, if a wall is ever obscuring you or a monster, you'll still see a colored icon so you won't get blindsided. The highlight of the game's audio is its soft-spoken narrator, who has a few different phrases for moments like when you gain an experience level or when you run out of health. The rest of the audio is good, though the Renaissance Faire-style town music can start to get a little grating, as can some of the sound effects. We heartily recommend choosing the dog instead of the cat as your pet, since the cat's incessant meowing will likely cause you to send your furry companion back to town more often than necessary. There hasn't been a better way to scratch that hack-and-slash itch on the PC in a while. Fate is available for download from its official Web site, which includes a free trial version. Overall, this is a high-quality game that delivers well on a concept that isn't ambitious but is well known for being fun and addictive. You may be surprised to learn that Fate was made by just a small number of individuals, since many much larger projects don't come together nearly this well. However, this is a game that clearly benefited from having a singular focus, and in turn, you'll likely appreciate what it has to offer if you give it a shot. Then there's your pet, which serves as your faithful companion throughout the adventure. It's possible to buy or catch fish (via a simple little minigame) that can transform your little doggy or kitty into something more powerful, but either way, your pet will travel by your side, helping you to attack foes and sometimes drawing their fire. Perhaps more importantly, your pet has its own inventory, so it effectively serves as a pack mule. At the touch of a button, you can even make it automatically run back to town to sell everything in its stash, saving you the trip. Again, you'll still need to go back to town to resupply, or at least to cash in your quests and get new ones, but this pet trick turns out to be a smart way to alleviate one of the more cumbersome aspects of games like this. Some of Fate's monsters are surprisingly big and mean-looking. Fate pretty much goes on and on like this, with you and your foes growing more and more powerful. There are an unlimited number of randomly generated items in the game, in addition to the ability to customize equipment by augmenting it with magically imbued gems. Some of the magic items can have what seems like an absurd number of different, sometimes contradictory, enchantments on them, which betrays the random nature of the game design but also admittedly helps keep things interesting. Additionally, you have a fame level that's independent of your experience level. Fame is gained from completing quests and slaying boss monsters. Gaining fame levels gives you more skill points, and the best equipment also has fame levels as part of the prerequisites. It's another arc to follow, but it's not that big of a deal. The game features four levels of difficulty, the open-ended character building system, and what feels like quite a lot of different monsters, items, and spells. As a result, it can easily keep you busy for a while. Still, the random nature of Fate eventually begins to yield diminishing returns (especially once you get to higher levels and the leveling up slows down a lot), the monsters and levels start to look the same, and the combat gets a lot tougher. And the loading times between dungeon floors don't get any shorter. When you run out of health in Fate, you're given several choices, such as getting bumped back up three dungeon levels or restarting from the point you fell, but at a significant cost to your fame and experience. This death system is interesting, but it can feel surprisingly punitive in a game that's otherwise so easy on the senses. Fate sure does look pretty, though, with its nicely lit and colorful, fully 3D caverns and catacombs. Some of the monsters are surprisingly big, which makes it satisfying to see their bodies pile up after a big skirmish. The game not only looks great but also runs smoothly, even on relatively modest systems. A few nice touches are in there to help make the graphics as functional as they are attractive, too. For example, if a wall is ever obscuring you or a monster, you'll still see a colored icon so you won't get blindsided. The highlight of the game's audio is its soft-spoken narrator, who has a few different phrases for moments like when you gain an experience level or when you run out of health. The rest of the audio is good, though the Renaissance Faire-style town music can start to get a little grating, as can some of the sound effects. We heartily recommend choosing the dog instead of the cat as your pet, since the cat's incessant meowing will likely cause you to send your furry companion back to town more often than necessary. There hasn't been a better way to scratch that hack-and-slash itch on the PC in a while. Fate is available for download from its official Web site, which includes a free trial version. Overall, this is a high-quality game that delivers well on a concept that isn't ambitious but is well known for being fun and addictive. You may be surprised to learn that Fate was made by just a small number of individuals, since many much larger projects don't come together nearly this well. However, this is a game that clearly benefited from having a singular focus, and in turn, you'll likely appreciate what it has to offer if you give it a shot."}