{"ref": "https://www.gamespot.com/reviews/star-wars-racer-revenge-review/1900-2849136/", "date": "May 17, 2006", "game_name": "Star Wars: Racer Revenge", "text": "Star Wars: Episode I Racer was generally considered to be a solid game when it was released back in 1999. Developed internally at LucasArts, the game managed to capture the excitement of pod racing from the Episode I movie and brought it home for gamers to enjoy. Now, roughly three years later, LucasArts is back with a sequel that was developed by Rainbow Studios, the team behind ATV Offroad Fury and Splashdown. Racer Revenge puts more emphasis on aggressive racing than its predecessor did, and generally, it plays great--while it lasts. Though there are a number of hidden characters you can unlock, Racer Revenge is ultimately a short-lived experience that will keep you entertained, but only for the first few times you blast through its courses.One of the first things you'll notice about Racer Revenge is the absence of a movie tie-in. Lacking the Episode I or even Episode II branding, Racer Revenge is its own game and takes place free of the constraints of the films' story. Racer Revenge takes place eight years after the events of the first game and more or less centers on the return of Anakin Skywalker and Sebulba to the pod racing circuit. This time, Sebulba is even more determined to destroy Anakin, after having been defeated the first time around.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Star Wars: Racer Revenge Video ReviewThe core of the game is the tournament mode, which contains a total of 13 tracks spread across five worlds. You'll start off in one of the obligatory Tatooine tracks before heading off to more exotic worlds, such as Mon Calamari, Sullust, and Gamorr. The tracks are all very well laid out and have a number of different routes through each of them. You'll likely need to race on a track a number of times before you manage to try each of these routes. Some of the alternate routes are shortcuts, and others are merely another way to get to the finish line. Even these will come in handy quite often, though, as there are frequent traffic jams, which can be both time-consuming and deadly if you're caught in the middle. Jumping to an alternate route and skipping by the competition can be a lifesaver.The game sports 18 different racers to choose from, many of which aren't initially selectable characters, and they will have to be unlocked by completing the tournament mode. There are also another five hidden characters, which are awarded to you for each subsequent completion of the tournament mode. Essentially, you'll have to complete the game five times over to unlock all the extra characters, but rest assured, the reward is well worth the effort. After the first completion of the tournament mode, you'll also unlock an art gallery in the main menu, which will reveal a few of the secret characters to you. As you complete the game again and again, extra galleries will be added along with the hidden characters.Racer Revenge rewards you for racing aggressively. If you spend most of your time trying to defend yourself, chances are that you won't last long. The combat has been beefed up quite a bit since the first installment, as most of the time you'll be trying to take other racers out just to keep ahead of the pack. It's true that you can get through the races pretty quickly if you forgo all the duels, but you probably won't have as much fun. The combat is simple yet entertaining--there are no actual weapons available, but you do have some very large engines strapped to your pod, and they can inflict a hefty amount of damage upon other racers if used correctly. There isn't a set amount of damage that you'll deal in a collision either. The damage that you dish out will depend on the speed and angle of your attack. Smacking up against someone while on a straightaway won't do as much damage as coming from the inside and T-boning someone against the wall, for instance. Something else to consider is that you won't take any secondary damage from attacking an opponent. You'll take damage only if you run into a wall or other background object or are struck by another racer. That alone should be enough to spur players into combat.In addition to the tournament mode, there is a multiplayer head-to-head mode and a single race option. The single race lets you select any of the tracks you've played in the tournament mode, as well as increase or decrease the number of laps in each set. Multiplayer is pretty basic, as it's essentially a two-player version of the single race mode. It's better than nothing.The control in Racer Revenge is definitely its strong point. There are a number of different variations to play around with, as well as an advanced mode that completely changes the way the craft handles. In the basic mode, the left analog stick is used to steer the craft, the X button accelerates, and R1 acts as the tight-turn modifier. R2 is used for turbo, and square is used for braking. The tight-turn function is a little different from what you might expect and is key to steering your pod with finesse. What it does is allow the engines to turn somewhat independently of the pod. A well-timed turbo boost will whip the pod around behind the engines and let you make drastic turns of up to 90 degrees. In the advanced mode, the steering function is spread across both of the analog sticks, with each controlling the thrust of the corresponding engine. This is quite hard to get used to, but once you get the swing of it, the extra control that it affords can be very satisfying. Each pod can be beefed up in a number of different categories between each race in the tournament. Everyone's favorite intergalactic used parts salesman, Watto, will sell you power-ups and, interestingly enough, offer you bribes in each race. For each opponent you take out, he'll give you some extra money to spend in his shop. If you take out one opponent, he'll give you 30 percent of the winning purse; if you take out two, he'll give you 40 percent, and so on. If you want to have your pod completely maxed out in every category by the time you beat the game, you had better plan on annihilating a large number of opponents along the way. That's further incentive to not avoid confrontation on the tracks. Racer Revenge looks good. The game doesn't really try to make exceptionally large tracks or environments and instead focuses on delivering a tight racing experience within its own margins. The game moves along at a consistently, fairly fast frame rate and is apparently immune to slowdown during the races. Ironically, the only time you'll encounter a drop in frame rate is during the track preview prior to each race. This is when the camera sweeps along the length of the track and is complemented by the game's announcer, who essentially acts like a tour guide, pointing out various highlights. The camera floats at a wider angle in this instance and reveals the few visual shortcomings. Expect to see a fair amount of stuttering and a whole lot of pop-up during these previews. However, these flaws can easily be ignored when you examine each of the pods and their corresponding pilots. The amount of attention paid to each of the pilots is quite surprising. They look great, and they are animated very well. It's a shame that the only time you really get to see them is during the character select screen and again after you beat the game. Watto is the only character you'll get to see on a regular basis--and he's also one of the most impressive. Racer Revenge may be visually impressive, but its sound leaves something to be desired. The music corresponds somewhat to the action--it will turn on or off according to the action onscreen. That creates a bit of a problem. If you ever find yourself out ahead of everybody, the only sound that will accompany you is the whine or pounding of your engines. The sound effects and voices are pretty good overall, though the announcer is downright obnoxious. He can chime in with the occasional joke--like ~That was uglier than a naked Jawa!~--but for the most part, he'll be repeating lines over and over again. It's a good thing that you can turn his volume all the way off. Though Racer Revenge is a lot of fun and plays great, it's simply too short. You can conceivably beat the tournament mode within two hours if you're a seasoned zero-G racing fan or within three hours if you're not. If you factor in the fact that you'll need to beat the game another five times to unlock everything, this will help matters, but it'll still be five times through the same tracks. Even with the alternate routes, racing around the same tracks can get repetitive. If Racer Revenge offered a more robust multiplayer mode, or a few extra modes in general, it could have had a lot more lasting value. As it is, Racer Revenge is good-looking game that's a whole lot of fun while it lasts, which unfortunately isn't very long at all.The control in Racer Revenge is definitely its strong point. There are a number of different variations to play around with, as well as an advanced mode that completely changes the way the craft handles. In the basic mode, the left analog stick is used to steer the craft, the X button accelerates, and R1 acts as the tight-turn modifier. R2 is used for turbo, and square is used for braking. The tight-turn function is a little different from what you might expect and is key to steering your pod with finesse. What it does is allow the engines to turn somewhat independently of the pod. A well-timed turbo boost will whip the pod around behind the engines and let you make drastic turns of up to 90 degrees. In the advanced mode, the steering function is spread across both of the analog sticks, with each controlling the thrust of the corresponding engine. This is quite hard to get used to, but once you get the swing of it, the extra control that it affords can be very satisfying.Each pod can be beefed up in a number of different categories between each race in the tournament. Everyone's favorite intergalactic used parts salesman, Watto, will sell you power-ups and, interestingly enough, offer you bribes in each race. For each opponent you take out, he'll give you some extra money to spend in his shop. If you take out one opponent, he'll give you 30 percent of the winning purse; if you take out two, he'll give you 40 percent, and so on. If you want to have your pod completely maxed out in every category by the time you beat the game, you had better plan on annihilating a large number of opponents along the way. That's further incentive to not avoid confrontation on the tracks.Racer Revenge looks good. The game doesn't really try to make exceptionally large tracks or environments and instead focuses on delivering a tight racing experience within its own margins. The game moves along at a consistently, fairly fast frame rate and is apparently immune to slowdown during the races. Ironically, the only time you'll encounter a drop in frame rate is during the track preview prior to each race. This is when the camera sweeps along the length of the track and is complemented by the game's announcer, who essentially acts like a tour guide, pointing out various highlights. The camera floats at a wider angle in this instance and reveals the few visual shortcomings. Expect to see a fair amount of stuttering and a whole lot of pop-up during these previews. However, these flaws can easily be ignored when you examine each of the pods and their corresponding pilots. The amount of attention paid to each of the pilots is quite surprising. They look great, and they are animated very well. It's a shame that the only time you really get to see them is during the character select screen and again after you beat the game. Watto is the only character you'll get to see on a regular basis--and he's also one of the most impressive.Racer Revenge may be visually impressive, but its sound leaves something to be desired. The music corresponds somewhat to the action--it will turn on or off according to the action onscreen. That creates a bit of a problem. If you ever find yourself out ahead of everybody, the only sound that will accompany you is the whine or pounding of your engines. The sound effects and voices are pretty good overall, though the announcer is downright obnoxious. He can chime in with the occasional joke--like ~That was uglier than a naked Jawa!~--but for the most part, he'll be repeating lines over and over again. It's a good thing that you can turn his volume all the way off.Though Racer Revenge is a lot of fun and plays great, it's simply too short. You can conceivably beat the tournament mode within two hours if you're a seasoned zero-G racing fan or within three hours if you're not. If you factor in the fact that you'll need to beat the game another five times to unlock everything, this will help matters, but it'll still be five times through the same tracks. Even with the alternate routes, racing around the same tracks can get repetitive. If Racer Revenge offered a more robust multiplayer mode, or a few extra modes in general, it could have had a lot more lasting value. As it is, Racer Revenge is good-looking game that's a whole lot of fun while it lasts, which unfortunately isn't very long at all."}