{"ref": "https://www.gamespot.com/reviews/art-style-cubello-review/1900-6203547/", "date": "January 22, 2009", "game_name": "Art Style: CUBELLO", "text": "A giant assembly of colorful but menacing cubes is tumbling toward you. What do you do? If you're playing Art Style: Cubello, the answer is simple: create four-cube clusters and watch the monstrous tapestry of polygons melt away before your eyes. The resulting gameplay is addictive and imaginative, and though this WiiWare package doesn't offer many ways to play, it's a good value for $6 (600 Nintendo points). Cross your fingers and hope the slot machine spins up a match. In Cubello, like with many puzzle games before it, your goal is to clear the playing field of colored blocks by matching those of similar hues. Yet though most puzzle games take place on a two-dimensional plane, Cubello uses all three dimensions by placing a large cluster of bright cubes at the center of your screen. This structure (called, appropriately, a cubello) slowly rotates as it moves closer and closer toward you. To push it backward and remove cubes, you fire an arsenal of your own cubes at it by pointing the Wii Remote at the surface of any cube and pressing A. When you create a group of four or more cubes, they fall away and the cubello moves back a bit. Should the mass of cubes come too close, it's game over. As you whittle down the knot of cubes to a more manageable size, the effortless, intuitive control scheme and constant spin of the cubist cluster can lull you into a comfortable trance. However, Cubello still provides a challenge, particularly at its upper levels, thanks to a number of gameplay twists that keep you from getting too secure. First, you don't get an unrestricted series of cubes to fire, but rather you have a limited ~magazine.~ Removing cubes from the cubello adds ammo to your magazine, and this constraint can make things tough as you whittle the structure down to a few cubes. In addition, a slot machine spins in the top right corner; if slot symbols align, a random color is chosen and you get a few seconds to fire off an unlimited number of cubes of that particular color. This cubello is more compact than most--and it spins a lot faster, too. These elements add a good bit of chance to each puzzle, on top of the already random succession of block colors in your magazine. This can be frustrating, considering that you may never spin up a match when you most need one, or could simply run out of blocks when the puzzle is almost complete. Yet it makes for a fresh experience even when you revisit the same levels, which is a real boon because there are only two single-player modes and no multiplayer options. Cubello's greater frustration is the awful, annoying digitized voice that announces combos and other events. It will drive you to turn down the volume. As with the other Art Style games available for download via WiiWare, the visual production is minimalist, but the cubello is complex and crisply rendered, and the colors are vibrant and easy to distinguish. Cubello is an entertaining and occasionally annoying little game that continues to satisfy on repeated visits. It's not a radical shift for the genre, but it's a unique and pleasant distraction that wriggles into the brain's pleasure centers. It's the right amount of fun at the right price."}