{"ref": "https://www.gamespot.com/reviews/call-of-cthulhu-dark-corners-of-the-earth-review/1900-6148890/", "date": "May 3, 2006", "game_name": "Call of Cthulhu: Dark Corners of the Earth", "text": "Even the Old Ones themselves would have probably lost patience waiting for Call of Cthulhu: Dark Corners of the Earth to finally show up. First unveiled more than six years ago, this horror-themed action adventure based on the work of influential American horror writer H.P. Lovecraft is clearly ambitious, mixing first-person action, sneaking, and adventure elements with a creepy story filled with various surprises. The good news is that all the delays have resulted in a one-of-a-kind game that fans of horror and action adventure gaming (and of H.P. Lovecraft) absolutely should check out. However, the presentation looks somewhat dated at times, and some other aspects are also pretty rough, just like the Xbox original released six months earlier. But if you can tolerate a few technical deficiencies and are up for a significant challenge, then you can look forward to Call of Cthulhu mightily impressing you and freaking you out equally in turn. Hold on to your mind in this tense and memorable adventure. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Call of Cthulhu: Dark Corners of the Earth Video Review This is essentially the same game as the Xbox version, with the key differences being that the PC version supports higher resolutions and its mouse-and-keyboard controls are slightly more responsive. It also retails for a lower price. You play as Jack Walters, a private investigator with a history of mental instability. But he's fine now, honest. Jack is trying to get his life and his career back on track, but he just can't seem to remember a six-year period from his past. Soon after the opening of the game, a missing-persons case takes Jack's attention away from his own predicament. He finds himself in the quiet port of Innsmouth, a little-known shantytown with a rather standoffish populace. It's a dismal place on first impression, filled with rundown buildings and thuggish residents who gurgle veiled threats in response to Jack's inquiries. Before long, Jack begins to uncover a sinister secret lurking just beneath the surface. He asks one too many questions and soon finds himself fighting for his life against unspeakable horrors. The game does a great job of gradually magnifying the sense of danger and the scope of the mess that Jack has gotten himself into, and it also does pretty well at evoking the early-20th-century period in which the story takes place. You don't need to be familiar with Lovecraft's stories or the Cthulhu mythos in order to enjoy this game. In fact, the experience will be all the better if you go into it without any real sense of what you're in store for. H.P. Lovecraft is best known for horror stories that attempt to describe the indescribable--horrifying things that can make a man go mad just from looking at them. Call of Cthulhu: Dark Corners of the Earth captures the essence of Lovecraft's work by presenting the entire game through Jack's own eyes, and by incorporating various elements that simulate how fleeting Jack's sanity can be when faced with terrible sights and realizations. It doesn't help the poor guy's case that he tends to have out-of-body experiences from time to time, which let him briefly see the world through the eyes of some rather strange beings. The game also intersperses some choice quotations from Lovecraft, as well as some well-written journal entries and other light reading that helps set the stage for what's happening. Ironically, if any aspect of the presentation doesn't really fit, it's Jack himself. It's his voice in particular, since he sounds like a matter-of-fact private detective...only, his rather calm demeanor isn't consistent with how he's supposedly being driven half mad by what's happening around him. The voice performance itself is fine, but it's too bad Jack sounds so brave. Call of Cthulhu: Dark Corners of the Earth looks like it's a first-person shooter, but it combines action and adventure elements in equal parts (fans of the Thief, Deus Ex, and System Shock series will be in store for a similar kind of game). In fact, for a large portion of the game, Jack is unarmed, and he'll need to make progress using his detective work rather than his brawn. The game is probably at its best when no shooting is involved, since the shooting portions aren't that great. Your enemies will sometimes use cover when attacking you, but they don't behave very believably in battle, and their bodies quickly vanish when killed. It's a long time before you get into any pure action in Call of Cthulhu, and when it happens, it's at once thrilling and a little disappointing--thrilling because there's been so much buildup and tension leading up to the fighting, and disappointing because the foes you're facing aren't as cunning as you'd hope. Fortunately, the game rarely attempts to create challenge just by thrusting you into first-person shooter sequences, and the shooter portions are at least decent. The period weapons you'll get to use, such as Tommy guns and revolvers, feel like they pack a mean punch. There's something fishy about the surly residents of Innsmouth... The stealth portions are pretty good, too, especially because the game never flat-out forces you to be stealthy--it's just a means to an end, useful for avoiding combat (such as when you're unarmed) or getting the drop on your enemies. But if you're spotted, you can always fight...or run. Later in the game, you'll get to perform some highly gratifying stealth kills by plunging a knife into the backs of unaware opponents, who totally deserve it, by the way. All throughout, though, you'll be able to avoid confrontation by sticking to the shadows and keeping a low profile. You may also peek (and shoot) around corners in your efforts to stay safely out of sight. Others have tried, but Call of Cthulhu is one of the first games to date to succeed at presenting a completely clutter-free first-person viewpoint. There are no health bars or ammo counts or anything to get in the way of your suspension of disbelief, yet the game still provides sufficient visual and audio feedback to keep you informed while playing. While there will probably be times when you'll wish the game were a bit more transparent about telling you when your health is low or when you're in danger of being detected by enemies, Call of Cthulhu's invisible interface definitely is to the game's credit. There isn't even an aiming reticle for any of the guns--you just aim down the sights to line up your targets. And you know you've taken damage when you see spurts of blood along the edges of the screen, and subsequently start to hear Jack gasping in pain and losing color vision. You can even have your limbs broken--you'll cringe listening to Jack trying to walk with a busted leg. Fortunately, he's got first aid kits to bring him back into shape. First aid takes a few seconds to apply, so you can't use your kits in the middle of a fight, but you can use them in a safe spot to cure fractures, bullet wounds, and so on. No, that's not realistic, but it's a good-enough system that's in keeping with the spirit of the game--Jack can't survive much damage in the first place. Call of Cthulhu also features heavy adventure elements, in the form of exploration and puzzle-solving. A couple of puzzles involve pattern recognition while others simply require you to use the right inventory objects in the right places. The puzzles aren't very difficult, but when combined with the game's rather large and complex environments, they can make it tough to figure out how to proceed. You don't have a map in Call of Cthulhu, and there's no mission-objectives screen or anything like that, so it's possible that you might get confused and disoriented at times--yet even this is roughly in keeping with the feel the game is trying to evoke, unless you become too frustrated or completely stuck. Fortunately, the plot and premise is compelling enough that it's worth suffering through the occasional tight spot. It's all the more exciting and satisfying when you finally get past those parts and set foot in new territory. There's some shooting to be done, but you'll also need to do some good detective work and some good old-fashioned running away. The game also deserves praise for creating some truly harrowing chase sequences. For whatever reason, horror games tend to be heavily focused on combat, but the scariest things are the ones that force you to flee. While Call of Cthulhu's escape scenes are scripted to play out a particular way each time, they absolutely make you feel desperate to survive. To slow down your foes, you're able to bolt doors, which buys you precious seconds as you continue your escape. The music swells to a crescendo and your enemies' screams are deafening as you scramble to find a way out. These escapes are definitely some of the moments that stick out the most vividly in hindsight. Call of Cthulhu has a lot of great moments in it, actually. You view the action through Jack's eyes practically the whole way through, so all the game's noninteractive cutscenes are still done from a first-person viewpoint, where you see Jack manipulating various objects and so on. Some of these interactions are amazingly lifelike in a subtle way, like how Jack gingerly manipulates the combination lock on a safe, for instance. So it's a bit of a shame that these bits tend to switch to a grainy letterboxed view, which informs you that you no longer have control for the moment and takes you out of the experience. And for all the great attention to detail, it makes you notice things you might take for granted in other games, like how Jack doesn't put away his gun when he climbs a ladder, or how you can't see your feet when you look down. Nevertheless, Call of Cthulhu is much more convincing than many other first-person games in how it makes you feel as though you're really there in the environments. When you reach some of the later stages, you'll truly get the impression that you're exploring places that no normal person was ever meant to find. You'll also feel sorry for Jack, who goes through an awful lot, all the way up through the game's disturbing, fittingly Lovecraftian ending. As he begins to see the truth behind the Esoteric Order of Dagon--the religious cult that seems to have Innsmouth under its complete control--his sanity will be threatened. Specifically, your vision will start to blur if not swim, and you'll start hearing Jack muttering to himself or his teeth chattering. These purposely distracting effects are well done and help make some of the game's bigger confrontations all the more bewildering. The sanity effects are temporary and tend to dissipate quickly if you find one of the game's save points, which take the form of unusual white glyphs painted on certain walls. These glyphs look ominous, but in a testament to how effectively creepy Call of Cthulhu can be, you'll catch yourself breathing a sigh of relief whenever you spot one of these safe havens. You might still be frustrated by the limited save system, which is a holdover from the Xbox version. Not only can you not save your progress except at these certain points, but you also have a limited number of save slots to work with. However, the limited save system is probably for the best, since being about to quicksave your way through a game like this would sap a lot of its tension. What the game lacks in high-fidelity graphics it makes up for with surprising variety. Character animations are sometimes a little choppy, textures are noticeably blurry, and weapon models look plain, so you might catch Call of Cthulhu looking like a second-rate shooter from time to time. Much more often, though, you'll find a lot of great little touches in the environments, which are surprisingly expansive in spite of how much there is to see and do in them. Unfortunately, Call of Cthulhu lacks support for wide-screen resolutions, which would be perfect for viewing a cinematic game such as this. But the game manages to look great anyway, thanks to excellent art direction that results in some highly atmospheric locales. You could easily imagine that had it been released a few years ago when it was originally supposed to, it would have looked amazing. Luckily, the visual style still succeeds at drawing you into the experience, even despite some graphical holdovers from the Xbox, like the ugly, low-res inventory system. What Call of Cthulhu lacks in fancy effects, it makes up for with style and originality. The noticeable repetition in Jack's and his enemies' dialogue is the main knock against the often-outstanding sound. As mentioned, Jack's narration isn't a perfect fit for the circumstances, but most of the speech throughout the game is delivered convincingly, and Jack's enemies sound especially good. Gunfire is piercingly loud, and various ambient effects help thicken the atmosphere. There's also some great music throughout Call of Cthulhu, which tends to cue up nicely with whatever's happening onscreen. Jack Walters' journey to the dark corners of the Earth should take you at least a good, densely packed 10 to 12 hours, but it could easily take more, depending on how long the tougher bits stump you. You then unlock a tougher difficulty mode (there's still another one to unlock after that), which heightens the challenge by making ammo scarcer and enemy encounters harder to survive. The game also ranks you based on how quickly you reached the end, how often you saved your progress, and other factors, in case you want to pay another visit to Innsmouth and its outskirts. So there's some value in revisiting the adventure--but your first time playing through Call of Cthulhu: Dark Corners of the Earth is liable to leave a lasting impression no matter what. Call of Cthulhu also features heavy adventure elements, in the form of exploration and puzzle-solving. A couple of puzzles involve pattern recognition while others simply require you to use the right inventory objects in the right places. The puzzles aren't very difficult, but when combined with the game's rather large and complex environments, they can make it tough to figure out how to proceed. You don't have a map in Call of Cthulhu, and there's no mission-objectives screen or anything like that, so it's possible that you might get confused and disoriented at times--yet even this is roughly in keeping with the feel the game is trying to evoke, unless you become too frustrated or completely stuck. Fortunately, the plot and premise is compelling enough that it's worth suffering through the occasional tight spot. It's all the more exciting and satisfying when you finally get past those parts and set foot in new territory. There's some shooting to be done, but you'll also need to do some good detective work and some good old-fashioned running away. The game also deserves praise for creating some truly harrowing chase sequences. For whatever reason, horror games tend to be heavily focused on combat, but the scariest things are the ones that force you to flee. While Call of Cthulhu's escape scenes are scripted to play out a particular way each time, they absolutely make you feel desperate to survive. To slow down your foes, you're able to bolt doors, which buys you precious seconds as you continue your escape. The music swells to a crescendo and your enemies' screams are deafening as you scramble to find a way out. These escapes are definitely some of the moments that stick out the most vividly in hindsight. Call of Cthulhu has a lot of great moments in it, actually. You view the action through Jack's eyes practically the whole way through, so all the game's noninteractive cutscenes are still done from a first-person viewpoint, where you see Jack manipulating various objects and so on. Some of these interactions are amazingly lifelike in a subtle way, like how Jack gingerly manipulates the combination lock on a safe, for instance. So it's a bit of a shame that these bits tend to switch to a grainy letterboxed view, which informs you that you no longer have control for the moment and takes you out of the experience. And for all the great attention to detail, it makes you notice things you might take for granted in other games, like how Jack doesn't put away his gun when he climbs a ladder, or how you can't see your feet when you look down. Nevertheless, Call of Cthulhu is much more convincing than many other first-person games in how it makes you feel as though you're really there in the environments. When you reach some of the later stages, you'll truly get the impression that you're exploring places that no normal person was ever meant to find. You'll also feel sorry for Jack, who goes through an awful lot, all the way up through the game's disturbing, fittingly Lovecraftian ending. As he begins to see the truth behind the Esoteric Order of Dagon--the religious cult that seems to have Innsmouth under its complete control--his sanity will be threatened. Specifically, your vision will start to blur if not swim, and you'll start hearing Jack muttering to himself or his teeth chattering. These purposely distracting effects are well done and help make some of the game's bigger confrontations all the more bewildering. The sanity effects are temporary and tend to dissipate quickly if you find one of the game's save points, which take the form of unusual white glyphs painted on certain walls. These glyphs look ominous, but in a testament to how effectively creepy Call of Cthulhu can be, you'll catch yourself breathing a sigh of relief whenever you spot one of these safe havens. You might still be frustrated by the limited save system, which is a holdover from the Xbox version. Not only can you not save your progress except at these certain points, but you also have a limited number of save slots to work with. However, the limited save system is probably for the best, since being about to quicksave your way through a game like this would sap a lot of its tension. What the game lacks in high-fidelity graphics it makes up for with surprising variety. Character animations are sometimes a little choppy, textures are noticeably blurry, and weapon models look plain, so you might catch Call of Cthulhu looking like a second-rate shooter from time to time. Much more often, though, you'll find a lot of great little touches in the environments, which are surprisingly expansive in spite of how much there is to see and do in them. Unfortunately, Call of Cthulhu lacks support for wide-screen resolutions, which would be perfect for viewing a cinematic game such as this. But the game manages to look great anyway, thanks to excellent art direction that results in some highly atmospheric locales. You could easily imagine that had it been released a few years ago when it was originally supposed to, it would have looked amazing. Luckily, the visual style still succeeds at drawing you into the experience, even despite some graphical holdovers from the Xbox, like the ugly, low-res inventory system. What Call of Cthulhu lacks in fancy effects, it makes up for with style and originality. The noticeable repetition in Jack's and his enemies' dialogue is the main knock against the often-outstanding sound. As mentioned, Jack's narration isn't a perfect fit for the circumstances, but most of the speech throughout the game is delivered convincingly, and Jack's enemies sound especially good. Gunfire is piercingly loud, and various ambient effects help thicken the atmosphere. There's also some great music throughout Call of Cthulhu, which tends to cue up nicely with whatever's happening onscreen. Jack Walters' journey to the dark corners of the Earth should take you at least a good, densely packed 10 to 12 hours, but it could easily take more, depending on how long the tougher bits stump you. You then unlock a tougher difficulty mode (there's still another one to unlock after that), which heightens the challenge by making ammo scarcer and enemy encounters harder to survive. The game also ranks you based on how quickly you reached the end, how often you saved your progress, and other factors, in case you want to pay another visit to Innsmouth and its outskirts. So there's some value in revisiting the adventure--but your first time playing through Call of Cthulhu: Dark Corners of the Earth is liable to leave a lasting impression no matter what."}