{"ref": "https://www.gamespot.com/reviews/dance-dance-revolution-review/1900-2699724/", "date": "May 17, 2006", "game_name": "Dance Dance Revolution", "text": "The Dance Dance Revolution series has enjoyed a great deal of success in Japan for years now, both at home and in the arcades, with half a dozen different versions of the game and a handful of spin-offs and rip-offs. In 2000, Dance Dance Revolution USA hit US arcades, showing us what we've been missing out on. Now, Konami has brought this distinctive arcade title to the PlayStation.Unlike PaRappa the Rapper or Bust-A-Groove, Dance Dance Revolution is a dancing game in the true sense of the term. Using a large dance mat, you dance by stepping on four directional buttons in time with onscreen cues. Four columns of directional arrows that scroll to the top of the screen represent the cues. Once a moving arrow reaches the stationary row of arrows at the top of the screen, you step on the corresponding arrow on the pad. The number of points you score is affected by how good your timing is and how long you can go without missing a step. If you miss too many steps, your game ends. The learning curve can be fairly long, and for those who need the extra hand-holding, a training mode is included. There is also the diet mode, which was originally introduced in the Japanese release, Dance Dance Revolution 3rd Mix. This mode lets you know how many calories you're burning while playing the game. It's a weird addition, and its accuracy is highly questionable. And while you can theoretically play Dance Dance Revolution without a dance pad, you'd be cheating yourself out of most of the fun. As with Samba de Amigo, the special controller is an absolute necessity here.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Dance Dance Revolution Video ReviewOf course, all of this dancing would be pointless if there weren't some good music to dance to, and Dance Dance Revolution has this area more than covered. It represents a sort of greatest hits collection of past DDR games, with some of the catchier songs from the game's history all rolled into a single package. The bulk of the game's music is ultrafluffy techno-pop, though it touches on a number of different varieties of dance music, including Latin, house, and reggae. There are a few recognizable tracks, such as a techno cover of ~Smoke on the Water~, as well as ~El Ritmo Tropical,~ which also appeared in Samba de Amigo, but the soundtrack will likely be an entirely new experience for most players. The soundtrack contains 27 different songs right off the bat, so it pretty much guarantees that you'll be tired from dancing before you're tired of the music.Dance Dance Revolution is no graphical dynamo, but this is no incredible loss. Your concentration will likely be so focused on forthcoming arrows that you won't be paying much attention to the polygonal dancers and psychedelic images floating through the background--though this makes for decent eye candy for spectators. Import-savvy PlayStation owners who already have Japanese versions of Dance Dance Revolution may want to pass on the US release of DDR, since it doesn't break any new ground for the series. However, for the rest of us, Dance Dance Revolution is a great introduction to a truly unique series with incredibly addictive gameplay and a soundtrack that will have you humming for days."}