{"ref": "https://www.gamespot.com/reviews/warjetz-review/1900-2787367/", "date": "May 17, 2006", "game_name": "WarJetz", "text": "It's Wednesday night and time to tune into the World Destruction League! Tonight's main event is WarJetz, 3DO's aerial dog-fighting extravaganza for the PlayStation 2. Blessed with a user-friendly combat system, the game offers nine different airplanes, 33 arenas, and five modes' worth of cannon-busting mayhem for one or two players. If you can see beyond a bevy of graphical shortcomings, WarJetz is perfect for those looking for ~pick up and play~ airborne combat.En route to the WDL championship, your goal in WarJetz is to destroy the appointed number of targets, collect scads of ~bux,~ and pay careful attention to your armor level. Although each of the game's nine planes has a relatively thick skin, your bankroll is the only thing that can bring you back into action when you're shot down. Competing against nine rival gangs, you'll face and pilot a number of vicious aircraft, such as A-10 Tank Killers, Dragonfly helicopters, experimental rocket jets, and even supernatural UFOs. For two players, the game offers ace, flag grab, cash frenzy, and bomb fest competition options, while soloists can opt to partake of the game's 33-mission single-player campaign.WarJetz's simple play mechanics go a long way toward its overall enjoyment. 3DO deserves credit for creating a dog-fighting system that is simultaneously intuitive and diverse. The left analog banks and pitches the aircraft, while the right analog triggers barrel rolls, loops, and 180-degree turns. Each aircraft also offers two methods of targeting--strafing and bombing--as well as two unique weapons, usually taking the form of a weak but speedy cannon and a powerful, albeit lethargic missile. Power-ups, such as shields, health, afterburners, and shot upgrades, also litter the landscape for your benefit. It's simple and fun--exactly what you'd want from this kind of game.What you don't want from an arcade-style combat shooter, especially on the PlayStation 2, are subpar visuals, which is exactly what you get from WarJetz. The game is guilty of any number of graphical no-nos, including muddy textures, 2D explosions, blocky structures, disappearing polygons, and frequent slowdown. Airplane models aren't exactly Pearl Harbor in quality, but the presence of smoke trails and muzzles flashes at least suggest a semblance of realism. Set in postapocalyptic locales such as New York, Antarctica, and Australia, the prevailing bright spot in this altogether muddled canvas are the game's 33 different arenas, each of which is large, heavily populated, and full of structural cannon fodder. Graphical issues notwithstanding, WarJetz is a fun two-player battle game with a decent single-player campaign. DVD-spooled mission updates, a peppy soundtrack, and hilarious play-by-play commentary also add a bit of polish to an otherwise tarnished experience. Much like Army Men: Air Attack 2, 3DO's other PS2 air combat game, WarJetz is a passable product that had the potential to be a lot better."}