{"ref": "https://www.gamespot.com/reviews/speedball-2-brutal-deluxe-review/1900-6181408/", "date": "October 19, 2007", "game_name": "Speedball 2: Brutal Deluxe", "text": "In the years since it was first released in 1991, Speedball 2: Brutal Deluxe has appeared on several platforms with varying degrees of success. The latest system to get the Brutal Deluxe treatment is the Xbox 360, on which an enhanced version of the original Commodore Amiga game has recently been made available for download via the Xbox Live Arcade service. This latest version of Speedball 2: Brutal Deluxe adds some features that are new to the franchise, but the good news is that it's almost completely faithful to the original game once your team steps out into the Speedball arena. For those of you who aren't familiar with what is arguably the Bitmap Brothers' premier franchise, speedball is a futuristic sport in which two teams of nine players attempt to score goals against each other by any means necessary. Imagine a hugely violent sport that borrows elements from Rollerball and ice hockey, then imagine that sport being played inside a metallic arena that could be mistaken for a giant pinball table, and you'll have at least some idea of what speedball is about. No goalkeeper in the league is a match for an electrically charged speedball. Putting the ball into your opponent's goal is one of several ways that you can score points in the speedball arena. A small number of points are awarded for hitting targets on the floor and on the walls, and injuring an opposing player will net you as many points as scoring a goal proper. Score-multiplier targets at either end of the halfway line can double the point value of everything that you hit subsequently, and in keeping with the sport's violent nature, it's even possible to charge the ball with electricity so that it knocks down any opposing players who get in its way. Furthermore, a number of temporary power-ups will randomly appear on the arena floor throughout the course of each three-minute match, and although the effects last for only a few seconds, they still have the potential to turn the tide of a match. There are power-ups that freeze opposing players or automatically place the ball in the hands of one of your attacking players, for example, as well as one that locks a door across your goal and another that, in multiplayer games, will reverse the other player's controls. Spinning coins will also appear in the arena, and the money that you get for collecting these can be spent on upgrading players or purchasing new ones between matches. Speedball 2: Brutal Deluxe is played at a frantic pace, but if you're a newcomer to the sport the game does a good job of easing you in. You can read up on the rules of the sport, you can practice in an arena with no opposition, and when starting out in the knockout, cup, or league modes you'll invariably find that the players on both teams are relatively slow but get a lot quicker and more skilled as you progress. There are 32 teams in the Xbox 360 version of Speedball 2: Brutal Deluxe (that's twice as many as in the original game), so winning all of the aforementioned single-player modes is no small task. If your skills aren't up to the task in the arena, you can attempt to win the league trophy as a non-playing manager in the new league manager mode. Unfortunately, the only decisions you need to make as a speedball manager are where to spend your money and which players to put in which positions. You have no input whatsoever where substitutions (only permitted after injuries), tactics, or playing style are concerned, and the only action you take while watching a match being played out is to hold down a fast-forward button. If you fancy yourself as something of a speedball sensation then the only way to really put your skills to the test is against another player, either on the same console or online. Speedball 2: Brutal Deluxe's online options include both friendly and ranked matches in which you can use either default teams or squads that you've assembled in the league mode. The problem, at least at the time of writing, is that there are very few people playing online right now, and so you might spend more time sitting in empty lobby screens than you will running around the arena. Furthermore, playing against anyone with a poor ping rating often means playing with lag, which is more than a little detrimental to the usually fast-paced experience. The game's numerous online leaderboards should be a great way to show off your achievements in both solo and multiplayer modes of play, but with so few people playing they really only serve as a reminder that even in its heyday the Speedball series was never really a big success outside of Europe. The enhanced visuals really would've benefited from some enhanced animation. Gameplay aside, Speedball 2 was a success in 1991 because it boasted great visuals and some impressive audio. Occasionally hearing a vendor working the crowd with cries of ~Ice cream! Ice cream!~ during slow-motion replays of goals was a delight back in the day, but now that the sample is played after every single goal it doesn't take long for the novelty to wear thin. Surprisingly, the original game's visuals hold up a little better than the audio, though that's thanks in no small part to the fact that the ~enhanced~ HD visuals actually manage to look worse. Speedball 2: Brutal Deluxe's ~enhanced~ (no, we can't bring ourselves to write that without quotes) visuals mode replaces 1991's 2D sprites with 3D models, renders the arena in 3D to accommodate multiple camera options, and kits out the teams in a number of different uniforms that are far more colorful and detailed than those in the original game. The animation, though, is strictly 1991, and so the new visuals--regardless of the fact that they're not very pleasing in any case--become quite jarring. The Xbox Live Arcade version of Speedball 2: Brutal Deluxe, then, does a solid job of re-creating 1991's game, but falls short almost every time it attempts to improve upon or enhance it. Attaining some of the new game's varied achievements is tough enough to provide a lasting challenge even for speedball veterans, but don't expect great things from the online play. If you're new to Speedball 2, there are certainly worse XBLA games that you could spend your points on, but remember when the original was made, and don't expect to win many matches until you've learned your way around the arena."}