{"ref": "https://www.gamespot.com/reviews/order-up-review/1900-6195192/", "date": "July 30, 2008", "game_name": "Order Up!", "text": "Recently, a handful of full retail games have been devoted to emulating the challenges of food preparation, and Order Up is the latest of these games to embrace the Wii's motion-sensitive controls. As a short-order cook in Order Up, you to use the Wii Remote not only to slice, grate, and cook food, but to prepare up to four dishes simultaneously and plate them all in a timely fashion. The challenge of accurately prepping each ingredient while coordinating multiple dishes is highly engaging, and you'll find yourself hungry for more after completing this delicious, but not quite filling, game. The meal ticket will show you how well you've prepared each ingredient. Seen here: Not great.. You begin the game as many chefs begin their careers--by jumping out of a plane, landing in a dumpster, then strolling into the local fast food joint to take a job as a short-order cook. Yes, Order Up is a bit goofy, but it works to great effect. The rotund, bean-shaped customers and cartoony locations are amusing caricatures, and the food looks quite good, if not exactly mouthwatering. Starting out at Burger Face under the tutelage of a pimply teenager who aspires to fast food management, you learn how to prepare that most American of dishes: a burger and fries. Your preparation of each ingredient will be judged as poor, OK, good, or perfect depending on how well you perform the action required. Slicing tomatoes requires you to time your cuts precisely, while prepping lettuce requires that you rip four leaves off as quickly as you can. Dicing, carving, grating, and mashing each demands its own motions, and each (with the exception of tricky tortilla folding and vexing lettuce grabbing) is easy to master and pleasingly responsive. Cooking items is less a matter of mastering motion controls and more a challenge of timing. As each ingredient cooks, you'll see a colorful cooking meter pop up that tells you the food's temperature on a scale of frozen to flaming. The indicator arrow will slowly progress from one end to the other, and snatching the food off the heat when the arrow is in the green zone will earn you a perfect rating. Using the fryer is that simple, but the stove top and grill have another indicator icon that moves faster than the arrow. To keep these vittles from burning, you'll have to stir, toss, and flip accordingly. Fail to do so, and you'll have to bust out the extinguisher and put out grease fires--one of a handful of inoffensively frivolous minigames. The stove and grill can accommodate two items each; so, along with the cutting board, fryer, oven, and food processor, you could conceivably be preparing eight ingredients at once, though this will rarely happen. On top of that, you can hire up to two sous chefs, who will prepare one ingredient at a time in their own space with varying degrees of precision depending on their unique proficiencies. All this would be for naught without customers to order the food, and you have a steady stream of folks coming in as you progress through your day. A day generally consists of four to six tables made up of one to four orders each. Handling one or two orders at a time is pretty easy, but when you start preparing three or four meals at a time, the game becomes a frantic juggling act. You won't ever really fail, barring total neglect, but it is tricky to deliver all your dishes in good or perfect order within a tight time window. Dishes left too long will cool, and the customer won't be happy. Your reward for a meal well cooked is bigger tips that you can use to upgrade your restaurant, hire new help, buy new recipes, or purchase spices. Spices are used to make special dishes that will earn you more coin, and are also handy for catering to your customers' preferences. For example, you'll get a big tip for overcooking all the food for the gruff, Clint Eastwood look-alike, or adding a particularly aromatic spice to a dish for the farmer who got his nose kicked in by a burro. Things can get hectic when you've got multiple burners a-blazin'. As you earn stars for your restaurant by earning money, buying recipes, and impressing the food critic, you'll get the opportunity to purchase another restaurant. You'll work your way up from diner grub to Mexican fare to Italian food to haute cuisine, earning new recipes, new spices, and new assistants. Once you get accustomed to preparing perfect dishes every time, you'll find yourself trashing good food in your quest for the satisfaction of perfection. That drive will take you to the Fortified Chef Competition, an amusing, though not so challenging, parody of the Iron Chef series. Unfortunately, your journey is only about six hours long. Playing through the game again on hard difficulty is a good way to satisfy your craving for more, since the cooking meters are removed and you are forced to rely on more subtle visual cues, as well as your own sense of timing. Still, a few more restaurants would have filled this game out nicely. Order Up is most engaging when you get into the rhythm of striving to cook perfect dishes, earning big money, spending it to improve your operation, and trying to cook more perfect dishes. It's simple enough that it's accessible to all, and its charming visual style and sense of humor make it an attractive package. Unfortunately, it feels a bit light on content, even at a less than full retail price point, and it would have benefitted nicely from a two-player mode in the vein of the final cook-off. Nonetheless, it's an entertaining, well-balanced game that provides a good deal of fun while it lasts."}