{"ref": "https://www.gamespot.com/reviews/street-fighter-alpha-3-review/1900-2901996/", "date": "December 18, 2002", "game_name": "Street Fighter Alpha 3", "text": "Not so long ago, the thought of a nearly perfect version of Street Fighter Alpha 3 for a portable gaming system was unthinkable. We've always wanted portable fighting games, but for the most part, we've never really expected them to stack up to their full-blown counterparts. Yet the Game Boy Advance has seen the release of several surprisingly uncompromised fighting games, and the new Street Fighter Alpha 3 is probably the best of them. The third and apparently final installment in Capcom's popular fighting game series marked the return of the entire cast of the legendary Street Fighter II, and it featured a number of other new and old characters to make for a huge roster of more than 30 fighters. Numerous gameplay modes and several other twists gave Street Fighter Alpha 3 incredible longevity, and in fact, Capcom has hardly even attempted to surpass Street Fighter Alpha 3 since its release more than four years ago. Now the entire game can be held in the palm of your hand and played on the go. While Street Fighter Alpha 3 for the Game Boy Advance does cut a few corners here and there, it takes a discerning fan to notice any real difference between this version and the arcade original--and that's pretty amazing. The GBA version of Street Fighter 3 features all the characters, moves, and strategies of the original. The graphics have been scaled down slightly, so the characters aren't quite as detailed as you might recall, but they're still as colorful as ever, and they move fluidly. Many of the game's backgrounds have been brought over intact, complete with parallax scrolling effects and lots of little details. At least one stage has a color scheme that makes it very difficult to see your yellow life meter at the top of the screen, but that's not a big deal. More importantly, the original game's relatively smooth animation is intact, and so are the flashy special effects for the various moves and finishers. This is therefore a great-looking GBA game by any standards, and it's all the more impressive if you're familiar with the original. The audio is quite good, too. Street Fighter Alpha 3's music was never anything special, and it suffers in translation here somewhat, turning out tinny and oversynthesized like a lot of GBA soundtracks do, though it isn't bad. On the other hand, what speech there is in the game sounds excellent, so expect to hear all the game's characters utter their signature lines as clearly as ever. Some of the voice samples did get cut from this translation, particularly some of the ones used during characters' win poses. That's a bit unfortunate, but if you're hard-core enough to take notice, then you can no doubt reproduce those particular sound bytes using your imagination. The gameplay is true to form, though it's limited by the four-button design of the Game Boy Advance. Since Street Fighter Alpha 3 technically uses a six-button control scheme, the GBA port by default handles medium punches and kicks by forcing you to press both punch buttons or both kick buttons at the same time. This works reasonably well, though you'll still wish you had six buttons to work with. Conveniently, the game provides an optional system that allows you to use simplified controller motions for executing super moves. At any rate, the directional pad still allows for precision control, and you'll either get used to the abbreviated six-button system or make do with four standard punches and kicks instead of six. Of note, the GBA port of Street Fighter Alpha 3 retains the original's three separate fighting style options, adding an extra layer of depth to what would be an impressive variety of fighters anyway. The standard arcade mode provides a flexible challenge that should last for a good, long time as you play through as all the different fighters and attempt to unlock some of the other hidden modes and characters. A two-player versus mode is available but requires both players to have a copy of the game, while other modes such as time attack and survival can provide a nice alternative to the standard best-of-three-round match. Yet the most enjoyable alternate mode is dramatic battle, in which you're partnered up with a computer-controlled partner (or another player) and get to double-team on a series of opponents. The game doesn't miss a beat with three large, fluidly animated characters duking it out simultaneously, and this mode is quite enjoyable. There's also a practice mode that lets you come to grips with the controls and practice your moves. Street Fighter Alpha 3 has been a very popular fighting game over the years, and with good reason. It has plenty of likable characters, good controls, and a lot of depth and variety. This new Game Boy Advance port is as faithful a rendition of the original as can reasonably be expected, so it's not just one of the better fighting games from the last five years--it's also a terrific game to have on the go."}