{"ref": "https://www.gamespot.com/reviews/showdown-legends-of-wrestling-review/1900-6101135/", "date": "June 8, 2008", "game_name": "Showdown: Legends of Wrestling", "text": "In the years since its debut, Acclaim's Legends of Wrestling series hasn't exactly had a storied history. As Acclaim's first wrestling title since the ending of the company's ECW wrestling license, the first Legends of Wrestling was a conceptually neat game that was plagued with major gameplay problems. The sequel that followed it managed to correct some flaws, though, on the whole, the game was still highly problematic. For the third installment of the series--titled Showdown: Legends of Wrestling--Acclaim has shifted development duties to its Austin-based studio, and the result is a game that brings more to the table in terms of wrestlers, gameplay mechanics, and features. Unfortunately, the game still suffers from a number of pacing and polish issues that prevent Showdown from being anything more than a marginal improvement, at best. Showdown: Legends of Wrestling tries to be the definitive wrestling game for Hulkamaniacs, Warriors, Diamond Cutters, and Andre the Giant posse members everywhere... If nothing else, Showdown: Legends of Wrestling does feature one of the best rosters you're ever going to find in a wrestling game, especially if you're at all an enthusiast of classic grapplers. From Hulk Hogan to Sting, from Dusty Rhodes to Jake ~The Snake~ Roberts, from Bruno Sammartino to ~Macho Man~ Randy Savage, the game's roster of 70-some-odd characters is quite something to behold. Each wrestler looks and moves pretty much identically to his real-life counterpart. The Ultimate Warrior runs around and shakes the ropes during one of his taunts, the Hulkster does all of his famous hulking up moves, and even minute details, such as the way Randy Savage delivers his deadly elbow drop, look wholly accurate and true-to-life. The signature movements and various styles of maneuvers for each wrestler help Showdown create what often looks like highly realistic action. Unfortunately, the gameplay itself doesn't quite hold up its end of the bargain in this regard. The four main buttons on the controller actualize different types of moves for each wrestler. These buttons include strike, grapple, block, and ~ready move.~ Ready moves are basically quick grapple moves that can be performed without actually having to press the grapple button beforehand. While these are effective, they're easy to counter. The countering system is timing-based, and by pressing the block button at the right time, you can block an attack. The control scheme is basically what you'd expect from a modern-day wrestling game, but where it begins to falter is in terms of its timing. The older Legends of Wrestling games suffered from some sluggish controls, and Showdown, while mildly quicker, still feels pretty slow and off-kilter. Pressing a strike button will sometimes require a one-second pause before the actual strike is performed. The same goes for grapple moves. Ready moves seem like they don't have quite the level of lag between button press and execution, but they can still be a bit unwieldy. What this essentially leads to is a lot of mistimed moves and clunky action that just doesn't feel quite right. Unfortunately, the game's sloppy control mechanics and occasionally broken artificial intelligence negate much of Showdown's appeal Momentum shifts during a match are handled by a momentum meter that sits beneath your wrestler's health meter. This meter fills up when you perform successful attacks and taunts against your opponent, and it's depleted when you're getting your ass handed to you. For the most part, this meter works well, because when it is up, it becomes easier for you to reverse attacks, and it helps build you toward performing your wrestler's signature finisher. The only quirk about it is that the moves that help build your meter don't always make sense. You tend to get the most bang for your buck when you simply hammer on the strike button. Big-time slams and suplexes actually only fill your bar about half as much as a simple punch or stomp. This essentially makes it possible for you or your opponent to simply punch your meter all the way up if you're in a stunned state for long enough. Another problem with the action is that your opponent's artificial intelligence is generally a bit on the lackluster side. During basic single matches--played without any sorts of gimmicks--your opponent will generally stay on the proper course. When you get into situations like a tag team match or, say, a cage match, things tend to break down a bit. AI-controlled players are fine at calling in their tag partners for help (almost a little too good at it), but when they're being pinned or are in an otherwise dire situation, partners suddenly tend to become stone statues, seemingly unable or unwilling to move for help. The same goes for your own partner in the reverse situation. Cage matches and ladder matches are also somewhat problematic. For example, when in a cage match, you can either climb up the side of the cage or go out the door. However, you will quite literally never make it out either way unless your opponent's health has been completely depleted and you've managed to stun him for the full extent of the game's stun meter. Apparently, your opponent is always well aware of this, because he will never, ever try to escape until you're completely worn down, and even then he'll be a little spotty about trying to get out. As it is, the game is pretty easy, even on the hardest difficulty level, so it's very, very hard to lose a gimmick match against the computer. In terms of play modes, Showdown features the basic quick play and match play modes, along with brand-new story and classic match modes. The story mode, titled ~showdown challenge,~ isn't especially deep. Basically, you select your grappler and work your way through the three most recent eras of wrestling--the 1970s, 1980s, and 1990s. Each era features five matches, with a title match at the end. Once all the eras are cleared, you fight Hulk Hogan, and beating him earns you the coveted ~Legends of Wrestling~ title. Unfortunately, that's about all there is to it. None of the titles are actually tangible outside of the story mode, and the few scant bits of story thrown in between matches are barely noticeable. All told, it will also only take you a couple of hours of play time to blast through the whole story mode. Fifteen classic matches are featured in Showdown, ranging from the battle of the Hart brothers to the legendary bout between Hulk Hogan and Andre the Giant. The classic match mode is a bit more interesting in that it allows you to take part in one of 15 different classic matchups so that you can effectively change history. Let's say you want to help Randy Savage actually defeat the Ultimate Warrior in their incredible Wrestlemania VII, career-ending match. Upon selecting the match, you'll be implanted into the contest at a key moment. From there, it's up to you to take the victory. These classic matches are certainly nice, conceptually, but really, they're only interesting once or twice. Furthermore, they're over so quickly that they don't stand up as anything more than a brief distraction from the rest of the game. The last component to Showdown is a create-a-wrestler mode. The create-a-wrestler here isn't anything particularly special, but it's ample enough to create a decent representation of some of the classic wrestlers not featured in the game, as well as one of your own design. Basic facial, body, and attire details can be edited, in addition to every one of your wrestler's moves (either bunched together into specific move sets or individually). Particularly notable pieces of gear include Scott Hall's signature tights and the ever-popular Doink the Clown makeup. (Unfortunately, the body-type editor won't allow for anything short enough to make for a passable Dink the Clown). Overall, it certainly isn't the best create-a-wrestler ever made, but it's also far from the worst. Graphically, Showdown: Legends of Wrestling is aesthetically a vast improvement over its predecessors, though some pretty blatant technical issues negate these improvements somewhat. The wrestler models have clearly seen the most amount of attention. No longer do they look like hammy, cartoonish caricatures of old. Sure, each wrestler still has a larger-than-life look to him, but in terms of overall design, each wrestler manages to capture his real-life, proper look and personality excellently. In terms of wrestling arenas, Acclaim has gone out and licensed several major real-life arenas that are known particularly well for hosting wrestling events, such as the Cow Palace in San Francisco and Madison Square Garden in New York. These arenas look quite good, both in terms of accuracy and stage design (though the crowd graphics throughout the game aren't pleasant to look at). However, where the game falls off is in terms of animation. Basic move animations look good and seem appropriately brutal, where necessary. Unfortunately, oftentimes glitches will pop up that frequently break the action. Examples include initiating a move and suddenly having both your character and your opponent teleport halfway across the ring, with about half of the animation just skipped over. Sometimes you'll be brawling near the ring ropes, and suddenly one wrestler will be outside the ring while you're still engaged in an animation that should have you attached to the other wrestler. We've even encountered a couple of instances of both wrestlers performing completely different move animations at the same time--like one wrestler performing a double-underhook suplex while the other was being pile-drived. The game is also rife with clipping issues--and not just the usual wrestling-game-clipping problems either. Sometimes the ring ropes will just clip right through your wrestler rather than bouncing off of him. No one of these issues is frequent enough to pop up every time you play, but they all happen enough to be a real nuisance. Between the Xbox and PS2 versions of Legends of Wrestling, the two look practically identical. The Xbox version is a little brighter-looking and partakes in slightly more liberal usage of a motion-blurring effect during entrances and such, but otherwise, they're visually quite comparable. Though the wrestler models are much improved in this year's game, Showdown suffers from a number of serious animation glitches that break up the game's action. Audio is another category where Showdown doesn't especially excel. In-game commentary is provided by the classic WCW trio of Tony Schiovane, Bobby ~The Brain~ Heenan, and Larry Zbysko. As with most wrestling game commentary, the actual topicality of their commentary is very general, so as to avoid too many gaffes. You'll get some repetitive history on the grapplers in the ring and occasional bouts of play-by-play, but all of it is so utterly uninteresting and halfheartedly delivered that it just doesn't matter. Aside from a few exceptions, wrestler entrances consist of mostly generic interpretations of classic theme songs, none of which are all that great. In the ring, the game does sound good, though. The slams to the mat, the sounds of fists hitting flesh, and the other noises akin to a professional wrestling match are nicely done and add to the authenticity of the whole experience. All told, however, the game just doesn't have much more than sound effects going for it audibly. In the end, Showdown: Legends of Wrestling is a game that simply cannot shake off the problems of its predecessors. Everything positive that has been added to the game doesn't do anything to counteract the mechanical artificial intelligence and visual problems that plague much of it. Still, despite all of these problems, this is definitely the most cohesive game that the Legends of Wrestling series has ever managed to produce, and if you had any affection for the previous games, or even just the concept, the game is worth renting just to play a few classic bouts with some of wrestling's greatest names. Outside of a rental, however, Showdown just doesn't have enough going for it to compete with the big boys of the wrestling game genre. In terms of play modes, Showdown features the basic quick play and match play modes, along with brand-new story and classic match modes. The story mode, titled ~showdown challenge,~ isn't especially deep. Basically, you select your grappler and work your way through the three most recent eras of wrestling--the 1970s, 1980s, and 1990s. Each era features five matches, with a title match at the end. Once all the eras are cleared, you fight Hulk Hogan, and beating him earns you the coveted ~Legends of Wrestling~ title. Unfortunately, that's about all there is to it. None of the titles are actually tangible outside of the story mode, and the few scant bits of story thrown in between matches are barely noticeable. All told, it will also only take you a couple of hours of play time to blast through the whole story mode. Fifteen classic matches are featured in Showdown, ranging from the battle of the Hart brothers to the legendary bout between Hulk Hogan and Andre the Giant. The classic match mode is a bit more interesting in that it allows you to take part in one of 15 different classic matchups so that you can effectively change history. Let's say you want to help Randy Savage actually defeat the Ultimate Warrior in their incredible Wrestlemania VII, career-ending match. Upon selecting the match, you'll be implanted into the contest at a key moment. From there, it's up to you to take the victory. These classic matches are certainly nice, conceptually, but really, they're only interesting once or twice. Furthermore, they're over so quickly that they don't stand up as anything more than a brief distraction from the rest of the game. The last component to Showdown is a create-a-wrestler mode. The create-a-wrestler here isn't anything particularly special, but it's ample enough to create a decent representation of some of the classic wrestlers not featured in the game, as well as one of your own design. Basic facial, body, and attire details can be edited, in addition to every one of your wrestler's moves (either bunched together into specific move sets or individually). Particularly notable pieces of gear include Scott Hall's signature tights and the ever-popular Doink the Clown makeup. (Unfortunately, the body-type editor won't allow for anything short enough to make for a passable Dink the Clown). Overall, it certainly isn't the best create-a-wrestler ever made, but it's also far from the worst. Graphically, Showdown: Legends of Wrestling is aesthetically a vast improvement over its predecessors, though some pretty blatant technical issues negate these improvements somewhat. The wrestler models have clearly seen the most amount of attention. No longer do they look like hammy, cartoonish caricatures of old. Sure, each wrestler still has a larger-than-life look to him, but in terms of overall design, each wrestler manages to capture his real-life, proper look and personality excellently. In terms of wrestling arenas, Acclaim has gone out and licensed several major real-life arenas that are known particularly well for hosting wrestling events, such as the Cow Palace in San Francisco and Madison Square Garden in New York. These arenas look quite good, both in terms of accuracy and stage design (though the crowd graphics throughout the game aren't pleasant to look at). However, where the game falls off is in terms of animation. Basic move animations look good and seem appropriately brutal, where necessary. Unfortunately, oftentimes glitches will pop up that frequently break the action. Examples include initiating a move and suddenly having both your character and your opponent teleport halfway across the ring, with about half of the animation just skipped over. Sometimes you'll be brawling near the ring ropes, and suddenly one wrestler will be outside the ring while you're still engaged in an animation that should have you attached to the other wrestler. We've even encountered a couple of instances of both wrestlers performing completely different move animations at the same time--like one wrestler performing a double-underhook suplex while the other was being pile-drived. The game is also rife with clipping issues--and not just the usual wrestling-game-clipping problems either. Sometimes the ring ropes will just clip right through your wrestler rather than bouncing off of him. No one of these issues is frequent enough to pop up every time you play, but they all happen enough to be a real nuisance. Between the Xbox and PS2 versions of Legends of Wrestling, the two look practically identical. The Xbox version is a little brighter-looking and partakes in slightly more liberal usage of a motion-blurring effect during entrances and such, but otherwise, they're visually quite comparable. Though the wrestler models are much improved in this year's game, Showdown suffers from a number of serious animation glitches that break up the game's action. Audio is another category where Showdown doesn't especially excel. In-game commentary is provided by the classic WCW trio of Tony Schiovane, Bobby ~The Brain~ Heenan, and Larry Zbysko. As with most wrestling game commentary, the actual topicality of their commentary is very general, so as to avoid too many gaffes. You'll get some repetitive history on the grapplers in the ring and occasional bouts of play-by-play, but all of it is so utterly uninteresting and halfheartedly delivered that it just doesn't matter. Aside from a few exceptions, wrestler entrances consist of mostly generic interpretations of classic theme songs, none of which are all that great. In the ring, the game does sound good, though. The slams to the mat, the sounds of fists hitting flesh, and the other noises akin to a professional wrestling match are nicely done and add to the authenticity of the whole experience. All told, however, the game just doesn't have much more than sound effects going for it audibly. In the end, Showdown: Legends of Wrestling is a game that simply cannot shake off the problems of its predecessors. Everything positive that has been added to the game doesn't do anything to counteract the mechanical artificial intelligence and visual problems that plague much of it. Still, despite all of these problems, this is definitely the most cohesive game that the Legends of Wrestling series has ever managed to produce, and if you had any affection for the previous games, or even just the concept, the game is worth renting just to play a few classic bouts with some of wrestling's greatest names. Outside of a rental, however, Showdown just doesn't have enough going for it to compete with the big boys of the wrestling game genre."}