{"ref": "https://www.gamespot.com/reviews/eyetoy-operation-spy-review/1900-6140411/", "date": "May 17, 2006", "game_name": "EyeToy: Operation Spy", "text": "EyeToy: Operation Spy is a full game based on the SpyToy mode from EyeToy Play 2. In it, you can assume the role of a secret agent in a series of minigame spy missions or set up a home security system to safeguard your room from, presumably, obnoxious younger siblings. Operation Spy has a few elements that might appeal to the younger, James Bond-enthused crowd, but there's not enough actual gameplay to make it...well, a game. The one or two cool features, like the face-recognition function, are entertaining for all of a couple of minutes, while the mission mode recycles the same few minigames over and over again. You're probably better off getting all of your spy action from SpyToy in EyeToy Play 2, since it works much better as a mode than a stand-alone game. The minigames are cool, but there aren't enough of them, and they aren't long enough. The entertainment industry's portrayal of spies has always been undeniably romantic. In Operation Spy, you get to mimic all of the better aspects of a spy's life according to what you've seen on TV, such as decoding encrypted puzzles, skydiving to remote locations, and using face-recognition software, without all the pesky life-threatening baggage that would presumably come with it. But that's not all. The game also serves as a security program, which you can set up to protect your precious belongings from people who might infiltrate your room. It has some cool stuff, but it doesn't exactly make for a deep gameplay experience. Using the EyeToy USB interactive camera for the PS2, you first enroll as an agent at the elusive Strategic Intelligence Agency (SIA). As an agent, you'll take pictures of your face and set a secret password so that you, and no one else, can access your profile. Every time the game starts, the system will detect an intruder and demand that you place your face into the detection box. Generally, you'll be recognized, but if you have any noticeable alterations (like the difference between having your hair down and up, if applicable) or lighting changes, then it probably won't recognize you. It will prompt you to enter your agent password, which will then allow you to access the game as normal. Each mission in the mission mode is made up of a few different minigames, strung together by debriefing screens, where you receive directives from the two SIA advisors. The premise is that you must explore the world and thwart the activities of various criminals. In one minigame, you use your arms to rotate a spinning Cryptogon and then to stop it when the correct symbol is facing the front. You must do this a number of times before decoding the full message, and you're working against the clock and time penalties if you stop on the wrong symbol. Another minigame consists of skydiving, and you raise and lower your arms to gain or reduce speed, as well as change direction. You must get through a series of waypoints and land on the correct rooftop to succeed. In yet another, you must select the correct hair, eyes, nose, mouth, and neck from a number of options to properly match a thief's dossier photo. All of these minigames are neat the first couple of times through, and you'll even unlock new ones in the later missions, but they're fairly simple, and there aren't enough of them to merit as many missions as the game has. You can catch thieves red-handed! The other major aspect of the game is the security system, which you can set up in a number of different ways to trap intruders that pass in front of the EyeToy. You can place targets on the screen that, when triggered, will set off alarms and take incriminating photographs. All of this, combined with the picture encoding tool, digital effects, and other nifty little features are sure fun to play around with, but they don't contribute to the game in a substantial way. In fact, these tools mostly just work on behalf of the graphics, which are pretty cool, especially whenever you're doing something in night-vision or infrared mode. There's not a lot to them, and you will run into the occasional EyeToy recognition problem if the lighting you're dealing with isn't perfect. The sound effects too are just about adequate, but there's not much that a game like this can do with sound effects, so they don't really work for or against the game that much. The problem with EyeToy: Operation Spy is that while it is somewhat entertaining, there's just not enough to it. If you have an EyeToy already and a wannabe Sydney Bristow or 007 in your family, you might find the game's few features enjoyable for a very short period of time. Otherwise, you're better off with EyeToy Play 2, a game with some substance that features enough of the cool spy stuff in just one of its many modes."}