{"ref": "https://www.gamespot.com/reviews/ninja-gaiden-sigma-2-review/1900-6230770/", "date": "September 30, 2009", "game_name": "Ninja Gaiden II", "text": "Chopping up fiends in the Ninja Gaiden series is inherently satisfying; chopping up fiends with a friend is even better. That's the idea behind Ninja Gaiden Sigma 2, the enhanced release of the original Xbox 360 action game on the PlayStation 3. Mind you, not every addition in this new version is an important one. Was anyone truly begging for the ability to jiggle the female leads' enormous breasts using the Sixaxis motion functionality? (Or at least, anyone in his right mind?) But pointless new mechanics aside, Sigma 2 adds three new excellent single-player levels to the campaign featuring three different heroines, each of which is terrific fun to control. Even better, you can join another player online in a substantial number of cooperative arenas, where you'll find double the flash and double the entertainment. This version of Ninja Gaiden II is notably better, and it offers enough extra content that even those who have already played and enjoyed the initial release should consider adding it to their game libraries. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Ninja Gaiden Sigma 2 Video Review If you aren't familiar with Ninja Gaiden II, you can check out GameSpot's review of the Xbox 360 game here. Most of that game's delights and idiosyncrasies hold true in Sigma 2--incredibly satisfying finishing moves, difficult (and rewarding) boss fights, and a camera that might send you into occasional fits. If you played that game, don't expect to find every frustration and foible addressed. The camera oddities are on full display during a level featuring returning heroine Rachel (the buxom beauty from Ninja Gaiden Sigma), and while the visuals have been improved, many environments still look sterile, as if a sanitation crew has buffed everything clean and removed all superfluous objects. Yet while certain fundamentals have gone untouched, others have received clear attention. The liberal sprinkling of cherry blossoms and greater color saturation in the more idyllic locales make these areas look more vibrant, and the new cutscenes are great and mesh well with the existing ones. Some players may also find the diminished gore and less gruesome de-limbing to be noteworthy changes, though the action is so loud and lively that the limited bloodletting has little if any effect on the satisfaction of battle. Overall, this version clearly looks better, though it isn't devoid of quirks, such as occasional but noticeable screen tearing. The other additions are far more pronounced. The aforementioned Rachel is joined by two other heroines, and each member of the trio has an entire level dedicated to her. These levels aren't noteworthy on their own; all three occur in Ninja Gaiden's typically disinfected environments, throw hordes of meanies at you, and conclude with surprisingly easy battles against big, blustery bosses. Yet while the levels are otherwise standard for the series, the characters are a total blast to play. Ayane, a character familiar to both Ninja Gaiden and Dead or Alive fans, is fast and agile. You'll use her dual blades to slice up giant winged demons while the butterfly bow on the back of her outfit flutters about. Momiji, protector of the Hyabusa children, isn't quite as agile as Ayane, but using her naginata to impale Black Spider members is pure pleasure. And then there's Rachel, whose figure is so impossibly curvaceous that it is a wonder she can stand upright, let alone wield her heavy hammer with such aplomb. She attacks more slowly than the other two women--more slowly than Ryu, the game's main protagonist, in fact--but while her moves are more deliberate, they pack a hearty punch. These three short levels occur within the main campaign and provide an excellent change of pace, because these characters play so differently from Ryu. And you can revisit each of the game's 17 levels in Chapter Challenge mode, which will score you based on your performance and hold your tail-kicking prowess up for all to see via online leaderboards. These three lovely ladies aren't the only characters offering gifts: Ryu's levels have been tweaked as well. You'll encounter new fiends and new bosses, such as the first level's twice-encountered monstrosity. They're mostly great additions, though even in the context of the usually tough Ninja Gaiden challenge, a fight against a famous looming landmark is more unfair than you'd want it to be. On the other hand, Ninja Gaiden II's lesser bosses have been jettisoned or improved (remember that cheap explosion at the end of the armadillo fight? Gone!), and there are fewer enemies onscreen at any given time, though the enemies themselves seem better at dodging and countering. A few other additions enhance playability: improved aiming makes the bow easier to use, and if you're unsure where to go, you can hold R1 to get pointed in the right direction. Additionally, Ninja Gaiden II's frustrating projectile barrages have been minimized, which is a noteworthy change. If you've played the Xbox 360 version, you'll probably find Sigma 2 to be easier on Warrior difficulty as a result of these changes, though you shouldn't assume it has suddenly become a cakewalk. The game is still quite a challenge, but the original's frustrations have been tweaked, while certain mechanics have been improved, and the action feels almost always fair--yet still tricky--as a result. (Nevertheless, veterans longing for a tough-as-nails challenge will wish to start at a higher difficulty.) Other changes include the removal of incendiary and windmill shurikens, the addition of an enormous sword called Enma's Fang and a lovely ranged powerhouse that's best to experience for yourself, and recalibrated enemy encounters, among many other subtle differences, additions, and subtractions. Pretty flowers, spurting goo, and a friend to admire them with. It's a shame that the heroines don't get more face time in the campaign, but fortunately, you can use them to show off your prowess in Ninja Gaiden Sigma 2's team missions. There are more than two dozen such missions, but you don't tackle them on your own: you are joined either by an AI companion or by another player online. And what a blast it is to carve up fiends and activate team ninpo attacks with a friend. Demons swarm forest glades and murky waters while you and your cohort jump, zip, and flail about the screen, slashing everything that moves and attempting to bring a little order to the chaos. The addition of another player makes team missions move at a different rhythm than you may be used to, but the team battles are breathless fun, particularly when a swarm of fiends is followed up by a boss fight. It's easy to hook up with someone online, though the stability of your experience may depend on the Internet connections for you and your partner. Some online missions we played were silky smooth, while others were a bit jittery; no online games we played were unbearably laggy, however. Ninja Gaiden II was great, but it wasn't on the level of Ninja Gaiden--and in the same way, Ninja Gaiden Sigma 2 doesn't quite reach the heights of Ninja Gaiden Sigma. But thanks to its heady new co-op missions, it comes awfully close. Forget any worries you had about diminished blood and embrace the fury that the game's comely trio brings to the table. Taking control of one of them while slashing up fiends with a friend is a total riot, as is guiding them through their single-player levels. Ninja Gaiden Sigma 2 may not have addressed every shortcoming of its Xbox 360 predecessor, but it does a great job of making up for them with raw, unparalleled swordplay."}