{"ref": "https://www.gamespot.com/reviews/the-incredibles-review/1900-6112325/", "date": "November 3, 2004", "game_name": "Disney/Pixar The Incredibles", "text": "For all the critical acclaim Pixar's many computer-animated films have received over the years, there has yet to be a great game based on any of them. Rather, nearly every game to bear the license of a Pixar film has been a fairly run-of-the-mill and problematic affair, capturing little if any of the charm and whimsy that makes the studio's characters and stories so captivating. The Incredibles is the studio's latest film effort, and even though the film itself has not yet reached theaters, the game version of the movie has. Unfortunately, the game doesn't buck the trend of mediocrity, offering a fairly unremarkable experience that puts you through the motions of the film's plot without capturing any of its essence. For a game called The Incredibles, this game sure lacks incredibility. The story of The Incredibles revolves around a family of superheroes--retired superheroes, actually. Mr. Incredible and Elastigirl, the patriarch and matriarch of the family, are formerly renowned superheroes who hooked up while on the job. However, after a series of lawsuits by the very people rescued by superheroes turns the world against the superhero profession, the couple opts to retire and settle into a typical family life. They have a couple of children, named Violet and Dashiell, both of whom have their own superhuman powers, and try to live normally--that is, until a new villain forces them to don their costumes once more and fight for justice and good. The game follows the plot of the film pretty strictly, although it does take occasional liberties with the story to try to make it flow better as a game. However, the way the game selectively uses scenes ripped direct from the film is a little jarring, in that the story bits provided aren't very revealing or paced very well, and ultimately the game requires you to see the film first to truly make sense of the game's interpretation of the story. The gameplay in The Incredibles should be pretty familiar to fans of action games. The game's different playable characters are assigned their own levels, and the gameplay in those levels is tailored to the specific powers of the hero in question. Mr. Incredible has remarkable strength, and his levels therefore play out much like a typical beat-'em-up, pitting you against waves of bad guys. Elastigirl's levels play much more to her unique stretching powers, with puzzles that revolve around her ability to reach far distances and slightly less in the way of heavy combat. Violet can turn invisible for limited amounts of time, so her levels naturally play more to a stealthy brand of play. Dashiell is basically The Flash incarnate, so his levels revolve around his incredible speed, playing out with a very twitch-oriented style of gameplay that challenges you to dodge objects and beat the clock while racing from one point to another. A few of these levels also include little distractions, like turret- or rail-shooting missions. While all this certainly makes for a variety-filled game, the variety alone is unfortunately not enough to make The Incredibles fun to play. The main problem with The Incredibles is that each section of the game becomes very repetitive very quickly. Mr. Incredible's and Elastigirl's levels, for instance, aren't all that much fun, simply because the enemy artificial intelligence just isn't good enough to put up a meaningful fight. The game tries to counterbalance this somewhat by turning up the number of enemies it throws at you, but even then it's still pretty easy to mow them all down in a quick and repetitive fashion. The same goes for the puzzles the game puts in your path. While a few of them are difficult, they aren't so because they're actually challenging puzzles, but rather because they're frustratingly designed. They often involve multiple tiers of action that must be performed in a specific time frame, and it's rare that you'll succeed on the first try. Violet's missions are probably the worst the game has to offer, as her invisibility power lasts for a very short time, and it's extremely difficult to gauge when a guard will or won't notice you. The Dashiell missions fare a bit better, in that they're less monotonous than anything else in the game, and the few rail- and turret-shooting sections are pretty good, as are some of the boss fights. But, frankly, the game as a whole just doesn't provide a notable enough gameplay experience to make it worthwhile. The Incredibles does a good job of capturing the visual style of the film, though. The characters all look just like their movie counterparts and animate well, and the environments have a nice look that toes the line between cartoonish and realistic. Though the graphics don't really stand out in any way, the game performs solidly from a technical standpoint, save for in the PS2 version, where the action is hindered slightly by slowdown. The game's camera can be problematic, in that it will sometimes get hitched on environmental objects and often seems to adjust too slowly when you're trying to move it to a better angle, but it certainly isn't the worst free-moving camera you'll ever see in a game of this type. If the game had made better use of the film's story and characters, The Incredibles would have been easier to recommend. Though Samuel L. Jackson is the only actor to actually come out and reprise his role in the game (albeit mostly for tutorial purposes), the vocal talents of Craig T. Nelson, Holly Hunter, and the rest of the cast are used in the scenes that are taken directly from the movie. The replacement voice acting for the few in-game quips that the characters utter is mostly decent, though the game has a bad habit of overusing the lines. The soundtrack seems to have been lifted right out of the movie, and it's very good stuff. It captures the mood of the action nicely, and is actually pretty catchy at times. Perhaps the most serious problem with The Incredibles is that the game simply doesn't give you much bang for your buck. The whole game can be beaten in roughly seven hours, and the few extras included in the package, like trailers, movie footage, and so on, just aren't all that captivating, especially when you consider that the game you have to play through to get to them isn't much fun. The Xbox version of the game does offer a downloadable level via Xbox Live, but even that is a pretty thin offering. This game may prove to be a decent rental for younger fans of the film, but apart from that, it just doesn't quite cut it."}