{"ref": "https://www.gamespot.com/reviews/mechwarrior-4-mercenaries/1900-2897849/", "date": "November 18, 2002", "game_name": "MechWarrior 4: Mercenaries", "text": "The MechWarrior franchise has now been around so long that it's running out of names. Aside from the numerical designation, MechWarrior 4: Mercenaries shares its name with a product released as part of the MechWarrior 2 line. Both covered essentially the same ground, but unlike the 1996 game, MechWarrior 4: Mercenaries version works beautifully right out of the box. It's as polished as the rest of the Microsoft-published games in this franchise, and while it doesn't have the same impact that the original MechWarrior 4 had two years ago, it's still a very good game. Mercenaries is essentially a stand-alone update to 2000's MechWarrior 4: Vengeance. It's fully compatible with the Inner Sphere and Clan Mech Pak expansions, so you don't lose any functionality by upgrading. Some of the weapons have been rebalanced, but for the most part, it's the familiar MechWarrior 4 gameplay. In the single-player campaign, you play as a mercenary leader. You jump around the galaxy, visiting various worlds and completing missions, which eventually opens up new worlds with new missions. There are maintenance costs to be paid in each cycle, so initially you'll have to stay on a single world to avoid paying fees due to time spent in hyperspace. You'll eventually get the chance to lead two full lances of mechs (but only when the game specifically lets you, not simply when you can afford it) and keep track of your standing with House Steiner and House Davion. The uneven cutscenes in Vengeance have been replaced by decent, if campy, voice-overs, although the voice work gets tiresome if you have to repeat the missions too often. While the campaign might appear to be dynamically generated, it's really a scripted (albeit branching) campaign in which your choices early on affect the ones that become available later. It's not really possible to fail, since if you don't complete a mission you just restart, so you don't have to worry about destroyed mechs or mounting cycle costs. The missions have a good mix of recon, assault, and stealth objectives, and the game has three endings based on your mission choices, so you can't just play on indefinitely, taking assignments and building up your mech arsenal. A nice addition is the Solaris gameworld, where you can go and fight gladiator-style battles for cash prizes in different weight classes. You start in the light mech class and progress to assault, and there are factory, coliseum, and jungle maps to choose from, each with its own ladder. The only disappointment is that the encounters are scripted at each level, so if you fail to place in any round, your subsequent fights will have the same mechs and placement.While the mech lab interface is sufficient for building and modifying individual mechs, it gets a little tedious when managing multiple lances, especially with the need to go into the free market and buy chassis and weapons on a regular basis. In the game, you can be sponsored by one of four mercenary companies (Kell Hounds, Wolf's Dragoon, Gray Death Legion, or Northwind Highlanders), each of which will provide access to different weapons on the free market (although you'll eventually be able to buy anything you can afford). The graphics engine is no longer spectacular, but it's still decent. Mercenaries also makes improvements to MechWarrior 4's multiplayer component, including an improved (and chat-enabled) server browser window that now shows the respawn, ammo, and heat settings for each game and thus serves as a warning about potentially immature opposition. The attrition game types have been consolidated into battle and team battle, and Mercenaries has plenty of new maps. The initially impressive MechWarrior 4 graphics engine now looks merely acceptable, and while Cyberlore has made some graphical updates, there are some areas in Mercenaries (especially the terrain) in which the engine clearly shows its age. Still, the game looks good enough to maintain the atmosphere of the MechWarrior universe, and the fact that there isn't a brand-new engine means that system requirements shouldn't be a problem. You can lead up to two lances in combat, but control is limited. Mercenaries is the perfect stand-alone sequel: improved enough for hard-core players, yet accessible enough for novices. The MechWarrior series' basic premise--blowing up giant robots with futuristic weaponry--is still loads of fun. Mercenaries' single-player campaign is engaging, but MechWarrior is really all about multiplayer. With such a popular franchise, you won't have much trouble finding a game to join, and even practicing against the AI while you hone your skills is enjoyable. Thanks to MechWarrior 4: Mercenaries, the MechWarrior series doesn't seem like it will wear out its welcome anytime soon.While the mech lab interface is sufficient for building and modifying individual mechs, it gets a little tedious when managing multiple lances, especially with the need to go into the free market and buy chassis and weapons on a regular basis. In the game, you can be sponsored by one of four mercenary companies (Kell Hounds, Wolf's Dragoon, Gray Death Legion, or Northwind Highlanders), each of which will provide access to different weapons on the free market (although you'll eventually be able to buy anything you can afford). Mercenaries also makes improvements to MechWarrior 4's multiplayer component, including an improved (and chat-enabled) server browser window that now shows the respawn, ammo, and heat settings for each game and thus serves as a warning about potentially immature opposition. The attrition game types have been consolidated into battle and team battle, and Mercenaries has plenty of new maps. The initially impressive MechWarrior 4 graphics engine now looks merely acceptable, and while Cyberlore has made some graphical updates, there are some areas in Mercenaries (especially the terrain) in which the engine clearly shows its age. Still, the game looks good enough to maintain the atmosphere of the MechWarrior universe, and the fact that there isn't a brand-new engine means that system requirements shouldn't be a problem. Mercenaries is the perfect stand-alone sequel: improved enough for hard-core players, yet accessible enough for novices. The MechWarrior series' basic premise--blowing up giant robots with futuristic weaponry--is still loads of fun. Mercenaries' single-player campaign is engaging, but MechWarrior is really all about multiplayer. With such a popular franchise, you won't have much trouble finding a game to join, and even practicing against the AI while you hone your skills is enjoyable. Thanks to MechWarrior 4: Mercenaries, the MechWarrior series doesn't seem like it will wear out its welcome anytime soon."}