{"ref": "https://www.gamespot.com/reviews/saints-row-2-review/1900-6199344/", "date": "October 14, 2008", "game_name": "Saints Row 2", "text": "When the original Saints Row came out two years ago, it served to placate fans until Grand Theft Auto made its next-generation debut. Saints Row's deviant destruction didn't push the boundaries of what to expect from a free-roaming urban assault game, but it did provide an enjoyable outlet for consequence-free chaos while never taking itself too seriously. Since then, Grand Theft Auto IV has injected a dose of maturity into its typical sandbox fare, removing many of its outlandish behaviors to create a more grounded portrayal of the gangster lifestyle. Saints Row 2 is not concerned with growing up. It is a morality-free alternative to GTAIV, an unremorseful descent into mindless mayhem. The lack of any major advancement in gameplay or storytelling may elicit a few flashes of deja vu, but the unrepentant joy of terrorizing this humble metropolis makes this a viable palate-cleanser for anyone willing to embrace the role of amoral dirtbag. Racing in a bulldozer is always a great idea. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Saints Row 2 Video Review The story begins in a jail hospital, where you've been in a coma ever since a gigantic explosion at the end of the first Saints Row nearly ended your criminal actions permanently. After easily escaping from this lightly guarded compound, you set off to recruit more people to your gang and retake the city of Stilwater. The overarching story is derivative and not easily relatable, but there are some interesting episodes contained within. The Brotherhood missions in particular are quite dark, documenting a tale of vengeance that is sickly satisfying. After putting nuclear waste in their leader's tattoo ink, you find yourself in a constant battle of one-upmanship. Deaths are taken lightly, propelling you to even more outrageous behavior, but it fits within the context of this over-the-top gameworld. The story never reaches beyond the barbaric needs of its protagonist, but the missions do contain a few worthwhile cinematic payoffs. While you may not be able to affect the outcome of your story, you can design your conqueror in whatever image you desire. The character creation tool is quite extensive. You can drastically change the weight and age of your character, pick from four different races, mold facial features in whatever manner you desire, and even choose if you want a male or female protagonist. With only six different voices to choose from, it can be difficult to accurately match one to whatever look you happen upon, but it's a small price to pay for the wealth of creative options. You can visit a plastic surgeon at any time to tweak your features, but the process is so in-depth, it's easier just to choose a look at the beginning and stay with it. The missions are predominantly of the drive-and-shoot variety that has become commonplace in the genre. Though there are three different gangs opposing you, as well as various law enforcement agencies, the only difference between them are the colors they wear and the scumbags who lead them. The majority of missions boil down to raiding a building and killing everyone who moves. While these excursions are usually entertaining, taking place in a variety of locations against increasingly ridiculous odds, the repetition of the actions is undeniable. Some objectives do provide an opportunity to do something a little different, though. For instance, when asked to rob a bank, you find out your prize is not a vault of money, but an even more valuable hostage. This leads to a strong detour in both the story and gameplay, and serves to keep things fresh. And since most missions have a midway checkpoint, you'll rarely have to start at the very beginning if you make a mistake. Ninja with guns. Finally. Fortunately, the tight controls keep the missions thrilling, even when they exhibit the same objectives. Combat feels especially gratifying in Saints Row 2. Targeting people is quick and precise, so it's easy to hit someone in the body part of your choosing or whip around to nail an attacker who sneaked up behind you. Without a lock-on ability, the firefights are fast and frantic, relying on your quick fingers to mow down the opposition. The lack of any sort of cover mechanic is disappointing, but its absence places the emphasis on aggression. Though your melee attacks are fairly limited, you do have one extremely handy move in your repertoire. You can grab enemies and use them as a human shield if fights are getting too hectic and just toss them away when you're done. The exaggerated physics here are hilarious, letting you hurl people 20 feet in the air, watching their rag-doll bodies wildly overreact to every collision. Another reason the missions are fun throughout is the unrestrained freedom in how you can complete them. Enemies can be killed at any time, using any weapon in your arsenal. For instance, the bosses in the game are all just normal human beings. You can choose to pepper them with your pistol if you choose, slowly witling down their life bar as you carefully dodge their attacks. Or you can just ignore typical video game logic and kill them with a few glorious shots from your rocket launcher. This freedom extends to every element in the game, letting you mow down enemies in whatever manner you see fit. Saints Row 2 fully embraces its sandbox moniker, letting you carve your own path of destruction without any arbitrary strings tying you down. Aside from the main missions, there are a bevy of side quests to take part in. These are much more original than the standard missions, so it's easy to get distracted by these for a while and forget about the story. These activities are where Saints Row 2 completely ignores reality and just lets you have some ridiculous fun. Trail Blazer is probably the most chaotic. Here, you'll ride an ATV wearing a flaming, fireproof suit. You get a time bonus for lighting cars and people on fire, so you just set out to cause as much destruction as possible. There's little challenge here (who would oppose a man wearing a flame-drenched suit?), but lighting the world on fire is utterly satisfying. There are a few other tasks that arent as fun, but overall, the minigames in Saints Row 2 are excellent and imaginative additions that go a long way toward extending your gameplay. Those zombies are dying for brains. The best diversion is the terrifying zombie uprising. You can access this on the big-screen TV in any of your cribs, and it provides some of the most exciting moments in Saints Row 2. As opposed to an emulation of a 2D arcade game from years past, this is a 3D adventure to save your soul from bloodsucking zombies. It takes place in the dilapidated hotel that serves as your headquarters, and you have to mow down wave after wave of these undead creatures. With a limited number of guns and melee weapons that break after a few hits, you'll have to constantly run around to evade the threat of these relentless demons. The slow-moving zombies may not seem too scary at first, but as more fill the screen, this becomes an intense and oftentimes exhilarating experience. Being surrounded by a group of zombies as you try to push them away to resurrect your fallen pals is an awesome divergence from the typical inner city mayhem. If killing zombies alone sounds too frightening, you can play through Saints Row 2 with a friend. The co-op is extremely well implemented here. You can hop in or out at any time ,and there aren't even any chains tethering you to each other. The entire city is open to your crime-wave whims. You can partake in missions and minigames together, or, if you're not feeling very cooperative, one person can tackle missions while the other drives aimlessly around town buying gas stations. There is a little bit of lag and some problems with cars and pedestrians popping in directly in front of you, but the experience of teaming up with a friend makes these slight hiccups easy to ignore. Just make sure you have an understanding with your cooperative pal; one person's violent actions will set cops loose on both players, so it's easy to ruin your buddy's fun if you set the police on him while he's peacefully trying to spray-paint walls. Regardless of your friend's penchant for attracting unwanted attention, it's preferable to the atrocious friendly AI you have to put up with. These morons get stuck on doors and benches, can't figure out how to get in your car, and lag far behind you in firefights. Teaming up with a friend makes the already great campaign even better. Competitive multiplayer isn't quite as engaging as the cooperative portions, but it does provide some excitement in brief bursts. The main mode here is Strong Arm, a team-based affair that pits people in a variety of events. You'll randomly be assigned to many of the activities found in the campaign mode and you have a few minutes to best the other team before you move on to another event. The racing and capture-the-flag variants are fairly standard, but there are unique events that add some life to these matches. Insurance Fraud is quite chaotic. Here, each team tries to get into the most horrific car accident. The best way to play defense is to simply shoot them dead, so it's a matter of quickly getting hit by cars before you're unceremoniously dispatched by your competitors. Strong Arm also utilizes the spray paint mechanic in a novel way. If you successful tag a wall while everyone else is worried about killing each other, you grant bonuses to your team such as more health or causing smoke to pour out of your enemies, making them easier to see. The only other mode is deathmatch, which is just too hectic to offer long-term appeal. Planes probably shouldn't be quite so vertical. The visuals in Saints Row are far from cutting-edge, but at least the experience is smooth both online and off. The frame rate is steady throughout, even in the most frantic firefights. There are also no load times when you enter buildings or drive to a new area, which keeps the game moving at a brisk pace. The physics are as over-the-top as the activities you'll compete in. Characters fly around as if they're on the moon, and they flop about like a fish out of water long after you've killed them. Unfortunately, the radio stations that provide the background music throughout your quest are quite limited. With only a handful of stations, you'll be hearing the same songs over and over again. To make matters worse, there aren't any talk stations, so a part of the comedic appeal is lost. At least the dying screams of your countless victims rings true. Saints Row 2 may not offer a sizable leap in the sandbox genre, but that doesn't diminish its fun. From beginning to end, this is one of the most fun urban chaos games out there. The controls are so tight and the combat so satisfying, you'll frequently find yourself getting distracted from the campaign as you cause terror all over the city. With great cooperative integration, tons of unique activities, and a super cool zombie mode, Saints Row 2 will keep you happily creating havoc for a long time. Aside from the main missions, there are a bevy of side quests to take part in. These are much more original than the standard missions, so it's easy to get distracted by these for a while and forget about the story. These activities are where Saints Row 2 completely ignores reality and just lets you have some ridiculous fun. Trail Blazer is probably the most chaotic. Here, you'll ride an ATV wearing a flaming, fireproof suit. You get a time bonus for lighting cars and people on fire, so you just set out to cause as much destruction as possible. There's little challenge here (who would oppose a man wearing a flame-drenched suit?), but lighting the world on fire is utterly satisfying. There are a few other tasks that arent as fun, but overall, the minigames in Saints Row 2 are excellent and imaginative additions that go a long way toward extending your gameplay. Those zombies are dying for brains. The best diversion is the terrifying zombie uprising. You can access this on the big-screen TV in any of your cribs, and it provides some of the most exciting moments in Saints Row 2. As opposed to an emulation of a 2D arcade game from years past, this is a 3D adventure to save your soul from bloodsucking zombies. It takes place in the dilapidated hotel that serves as your headquarters, and you have to mow down wave after wave of these undead creatures. With a limited number of guns and melee weapons that break after a few hits, you'll have to constantly run around to evade the threat of these relentless demons. The slow-moving zombies may not seem too scary at first, but as more fill the screen, this becomes an intense and oftentimes exhilarating experience. Being surrounded by a group of zombies as you try to push them away to resurrect your fallen pals is an awesome divergence from the typical inner city mayhem. If killing zombies alone sounds too frightening, you can play through Saints Row 2 with a friend. The co-op is extremely well implemented here. You can hop in or out at any time ,and there aren't even any chains tethering you to each other. The entire city is open to your crime-wave whims. You can partake in missions and minigames together, or, if you're not feeling very cooperative, one person can tackle missions while the other drives aimlessly around town buying gas stations. There is a little bit of lag and some problems with cars and pedestrians popping in directly in front of you, but the experience of teaming up with a friend makes these slight hiccups easy to ignore. Just make sure you have an understanding with your cooperative pal; one person's violent actions will set cops loose on both players, so it's easy to ruin your buddy's fun if you set the police on him while he's peacefully trying to spray-paint walls. Regardless of your friend's penchant for attracting unwanted attention, it's preferable to the atrocious friendly AI you have to put up with. These morons get stuck on doors and benches, can't figure out how to get in your car, and lag far behind you in firefights. Teaming up with a friend makes the already great campaign even better. Competitive multiplayer isn't quite as engaging as the cooperative portions, but it does provide some excitement in brief bursts. The main mode here is Strong Arm, a team-based affair that pits people in a variety of events. You'll randomly be assigned to many of the activities found in the campaign mode and you have a few minutes to best the other team before you move on to another event. The racing and capture-the-flag variants are fairly standard, but there are unique events that add some life to these matches. Insurance Fraud is quite chaotic. Here, each team tries to get into the most horrific car accident. The best way to play defense is to simply shoot them dead, so it's a matter of quickly getting hit by cars before you're unceremoniously dispatched by your competitors. Strong Arm also utilizes the spray paint mechanic in a novel way. If you successful tag a wall while everyone else is worried about killing each other, you grant bonuses to your team such as more health or causing smoke to pour out of your enemies, making them easier to see. The only other mode is deathmatch, which is just too hectic to offer long-term appeal. Planes probably shouldn't be quite so vertical. The visuals in Saints Row are far from cutting-edge, but at least the experience is smooth both online and off. The frame rate is steady throughout, even in the most frantic firefights. There are also no load times when you enter buildings or drive to a new area, which keeps the game moving at a brisk pace. The physics are as over-the-top as the activities you'll compete in. Characters fly around as if they're on the moon, and they flop about like a fish out of water long after you've killed them. Unfortunately, the radio stations that provide the background music throughout your quest are quite limited. With only a handful of stations, you'll be hearing the same songs over and over again. To make matters worse, there aren't any talk stations, so a part of the comedic appeal is lost. At least the dying screams of your countless victims rings true. Saints Row 2 may not offer a sizable leap in the sandbox genre, but that doesn't diminish its fun. From beginning to end, this is one of the most fun urban chaos games out there. The controls are so tight and the combat so satisfying, you'll frequently find yourself getting distracted from the campaign as you cause terror all over the city. With great cooperative integration, tons of unique activities, and a super cool zombie mode, Saints Row 2 will keep you happily creating havoc for a long time."}