{"ref": "https://www.gamespot.com/reviews/lumines-plus-review/1900-6168467/", "date": "April 2, 2007", "game_name": "Lumines Plus", "text": "The original Lumines was one of the best puzzle games of 2005. Since then it has been repackaged for Xbox Live, received a sequel on the PlayStation Portable, and now has been repackaged yet again for the PlayStation 2. It's still a good puzzle game and will be very enjoyable for anyone who never played the original, but there's absolutely no reason to pick it up if you've played any of the other Lumines games. This is so much like the original game that the credits for Lumines appear before the credits for Lumines Plus. Lumines Plus plays exactly like the original Lumines. A block composed of four smaller, colored blocks falls from the top of the screen. As it falls you move it left or right and can spin it around. Your job is to make the blocks disappear. To do so you must create a two-by-two area of the same color. When a block of same-colored pieces is made, it's wiped off the screen by a vertical bar called the timeline that moves across the screen from left to right in time with the music. By adding blocks of the same color to the group of blocks that are about to be erased, you can create chains, and doing so will quickly raise your score. There are also blocks with a circular flashing center that will erase any like-colored block that is touching or chained to it. As you move from level to level, the background art, music, and style of puzzle piece (the three are collectively referred to as ~skins~) will change. When the pieces reach the top of the screen the game is over. The gameplay is as intense as ever, but the games can take well over an hour to finish if you're any good. That's a long time to spend organizing colored blocks. Newcomers will almost certainly be frustrated by the lack of a competent instruction manual, and there's no tutorial, either. There aren't a whole lot of different ways to enjoy Lumines Plus. You can play a timed game, or take on a friend or the CPU in a race to see who can erase the most blocks the fastest. This versus mode is fun in short spurts against friends, but the CPU gets tough to beat after just a couple of levels. The only other mode is puzzle mode. Here you're given a short amount of time to re-create a basic shape that's shown to you before the round starts. You'll have to line up blocks and pieces as fast as you can to make objects such as animals, basic shapes, and letters of the alphabet. Like the versus mode, puzzle mode gets challenging quickly, but it's more fun than frustrating. Shinin', shinin', shinin', shinin'... Lumines was an impressive-looking game on the PSP, but it's considerably less so two years later on a more powerful system. The game's still plenty colorful though, and there are some neat designs to enjoy if you can find the time between dropping blocks. Most of the skins from the original game are here, but there are a few new ones, too--none of which are anything to get excited about. The game's sound effects and soundtrack are still a highlight, even if the new tunes aren't particularly noteworthy. A few tracks from the original game are missing here, but you'll still hear songs from Japanese artists like Tetsuya Mizuguchi, Mondo Grosso, and others. Even if these names don't ring a bell, you'll find yourself tapping your toes to some of the catchier songs. If you enjoy puzzle games and you've never played a Lumines game before, Lumines Plus is a solid value at $20. However, if you are familiar with the series, the paltry amount of new content isn't enough to make the game feel even remotely fresh."}