{"ref": "https://www.gamespot.com/reviews/oddworld-munchs-oddysee-review/1900-6076742/", "date": "October 13, 2003", "game_name": "Oddworld: Munch's Oddysee", "text": "Just like the previous Oddworld games for the PlayStation and Xbox, Oddworld: Munch's Oddysee for the Game Boy Advance is an adventure game that emphasizes problem-solving over the more traditional punch-and-jump play mechanics that are typical of the genre. Each level is a large puzzle that needs to be solved. Players can switch between Abe and Munch, the two main characters, at any time. Both have unique abilities that allow them to access certain areas that are off-limits to the other character. Through trial and error, your job is to figure out the specific combination of levers, transporters, and moving platforms that will lead you to the exit. Although this isn't one of the GBA's better-looking games, the real failure here is that the humor and charm that made the mazelike levels in the console Oddworld games so bearable is missing. It only takes three or four hours to play through Munch's Oddysee, but, due to the uneventful pacing, it feels more like forty. Abe can enlist a posse to help rough up Glukkons. The story revolves around the social status of three separate races of aliens: the Glukkons, Mudokons, and Gabbits. The Glukkons are in charge and generally want to devour the planet's resources to become filthy rich. The Mudokons, on the other hand, are a race of mud-creatures who live in harmony with the land. To do their heavy work, the Glukkons employ Mudokons as slaves on their farms and in their mines. Abe is a Mudokon and former slave. He escaped to freedom in the PlayStation game, Oddworld: Abe's Exodus. The last of the alien races are the Gabbits, an aquatic species of which Munch is the only surviving member. The Glukkons hunted the Gabbits to extinction to harvest their eggs for food. Abe and Munch met in the Xbox version of Munch's Oddysee, and they're the characters you'll use to stop the Glukkons in this game. For the most part, the dual character dynamic works in the game's favor. Abe can run fast, carry objects, and enlist the help of other Mudokons to fight enemies and to help activate switches that require multiple levers to be pulled simultaneously. His chant ability also allows him to take control of enemy Glukkons and to regrow spooce fruit that's already been picked. Like Abe, Munch can enlist the help of friendly creatures, called Fuzzles, to help him attack enemies and unlock switches. He can also take control of moving platforms and pilot remote-controlled robots. Munch's best trait, however, is that he can swim. Abe is a mud-creature, so he can't survive very long in water. Munch's amphibian heritage allows him to go into sewers and tunnels that Abe just can't. Because of this key difference, you'll switch between both characters fairly often throughout each level. Even though the characters and their abilities are interesting, the levels themselves are dull and tedious, both in terms of design and aesthetics. Abe has to lead other Mudokons and must climb ladders to activate switches on land, but there isn't much to interact with in the meantime. Levels are primarily flat, with a few hills here and there. It's not often that you'll find a set of platforms that you need to jump across, and skirmishes with the Glukkons are rare. Munch's areas are a little livelier, mainly because you have to go back and forth between watery sewers and dry underground tunnels quite a bit. Unfortunately, his ability to control platforms and service robots doesn't come into play often enough. That's too bad because it's one of the game's nicer aspects. It doesn't help matters any that the graphics are so plain. Each level only has one or two types of terrain--usually dirt and grass or cement and metal--and often the only visible landmarks are the transports, doors, and switches you'll encounter on your way to the exit. The characters themselves show no artistry whatsoever. Abe is gray and brown, Munch is gray, and most other aliens are gray, yellow, or red. At least the character animation is smooth. Abe moves around like a chimpanzee would if it were forced to walk upright, and his lanky arm gestures are goofy to watch. Munch can control service robots. A few more of these situations, and a little more humor, and this game could've been a contender. If dull, wide-open levels were the game's only shortcoming, Munch's Oddysee would be the perfect game to give to younger players who are just getting into gaming. Unfortunately, there are other issues at work that make it hard to recommend the game to the under-10 set. Moving your way through all 12 of the game's levels requires the kind of attention span usually reserved for the clergy and mental health practitioners. The near total absence of character development and humor really puts the spotlight on how boring it is to walk from one room to the next, constantly searching for switches and spooce fruits. Abe has a half-dozen speech snippets that he rattles off whenever you enlist the help of other Mudokons. You'll hear phrases like, ~Go get him~ and ~Hey, help me out here.~ In the PlayStation and Xbox Oddworld games, by contrast, Abe and Munch frequently have conversations with all sorts of creatures and toss out wisecracking one-liners whenever they encounter a new item or obstacle. In the GBA game, the only real payoff comes every three or four levels, in the form of a brief cinematic sequence composed of still images and some badly written dialogue. At times, the controls don't respond as well as they should, which makes the game more frustrating than it has to be. You can try three or four times to pick up an object from various spots, only to successfully grab it in the same spot you were in the first time. Because of this, it's not uncommon to accidentally toss a Mudokon into a river while you're mashing the buttons out of frustration. The jump button also conks out from time to time, which is bothersome when you're trying to leap across bottomless pits. Regardless of the poor graphics and problematic controls, Oddworld: Munch's Oddysee for the Game Boy Advance could have been a great game for fans of the series if it had anywhere near the same amount of charm or cleverness as the console Oddworld games. Unfortunately, it doesn't. There are moments where it seems like the game is making strides in the right direction--such as whenever you get to blast Glukkons to smithereens with giant robots--but these isolated situations always give way to more and more aimless wandering and lever-pulling."}