{"ref": "https://www.gamespot.com/reviews/warhammer-online-age-of-reckoning-review/1900-6198529/", "date": "October 3, 2008", "game_name": "Warhammer Online: Age of Reckoning", "text": "War, appropriately, is the focus in Warhammer Online: Age of Reckoning. Few persistent world, online role-playing game have focused so much on player-versus-player combat or done it this well. Fireballs fly, swords clash, and pet lions pounce as the opposing forces of Order and Destruction pound on each other for server dominance. From open warfare to stand-alone scenarios, there are a number of ways to establish battle superiority, and Warhammer Online consistently offers in-game rewards for your combat prowess, making this game the one-stop shop for all your elf-bashing needs. There are other innovations too, though they take a supporting role: public quests that allow passersby to jump in and join the fray, for example, as well as the excellent Tome of Knowledge, an in-game encyclopedia overflowing with all the information you would ever want. The intense PVP scenarios will keep you on your toes. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Warhammer Online: Age of Reckoning Video Review These original features make Warhammer Online a great game, though this direct focus on PVP combat noticeably detracts from its other facets. Most notably, questing and solo play are unfulfilling compared to other MMOGs; the writing is decent, but in general, the by-the-numbers quests lack flavor and sophistication. The most noticeable issue at play, however, directly relates to player population: During peak hours, you may wait an hour in a server queue, only to discover that the world still feels really empty, even with all these areas for players to congregate and battle. It's the ultimate contradiction: By giving players so many ways and places to hammer each others' skulls, the population has been spread thin. Warhammer Online feels like it was designed for a population much larger than the game actually holds. A good guild, as well as some preparation and organization, will combat this issue to a degree. Perhaps this drawback will change as the population at large gains levels, but for now, the splintering of players makes exploration and questing both feel even more lackluster than they already are. But you came for war, and whether you want to get in the thick of the action or support your groupmates, you'll find that the Warhammer universe is a natural host for your bloodthirst. First, you choose a faction: Order or Destruction (guess which is good and which is evil). From there, choose an army (Dark Elves, Empire, and so on) and a career. Both sides offer the usual suspects, such as healers and tanks, but there are some nice additions for each class. Engineers can summon a turret to aid them from a distance; Disciples of Khaine siphon health from enemies to heal allies; and sorcerers are capable of dealing heavy damage--at the risk of killing themselves. Physical customization isn't particularly deep, but various tattoos and other options help distinguish you from the hordes, even if the simple options and visual similarities of various armor sets can sometimes make all players of a particular profession look eerily alike. Warhammer Online makes a superb first impression. From the moment you begin, a starting quest encourages you to participate in one of the game's keystone PVP scenarios. You can join a queue for a level-appropriate scenario from almost anywhere, and once enough players have signed up, you're whisked away to the battlefield. Most of these matches are variants on Capture the Flag, Deathmatch, King of the Hill, and so on--but with enough twists to make them feel clever. For example, in the Stonetroll Crossing scenario, teams attempt to capture an item called a troll pacifier from the tall plateau at the center of the map and deliver it to three locations to appease the cranky trolls. In others, you may capture control points or take and hold a central platform--usual stuff to be sure, but with small twists that make each one feel unique. Regardless of which maps you play, most scenarios are chaotic in a good way. You'll always be on the go, from chasing a flag on the move to charging for the opposing healer, and the flurry of colorful spell effects and the din of clanging metal enhance the excitement. Stand-alone scenarios are just one PVP option. The more impactful alternative is to take battlefield objectives and fight through enemy keeps, which in turn earns victory points for your faction; once you have enough points, the opposing faction's main city is vulnerable to attack. Open objectives make for a chaotic good time, whether you and your warband are chasing down a roaming group of marauders or getting behind a turret to bombard foes as they creep closer to the warcamp. You and your buddies can also participate in keep captures, which are essentially multitiered minidungeons in which you fight enemy players and defending mobs on your way to the keep boss. Keep battles are a ton of fun; teams can build siege weapons at specified points outside of the keep, and the resulting encounters are frenzied and intense, especially if a battering ram is involved. Public quests are possibly Warhammer Online's most original offering, and it's one that lets you join impromptu teams as they complete various objectives. Should you encounter one of these open, multipart quests, your heads-up display automatically informs you what stage the ongoing quest is currently at and what needs to be done. Then, you can simply jump into the fray, killing monsters and other non-player enemies. At the end of the quest, a golden treasure chest appears and a dice roll of sorts determines who wins the available loot. The more you contribute, the greater your chance of rolling a higher number. You won't want to join public quests just for the possibility of interesting loot, though: Battles are fun and hectic with enough participants, and many of them end with challenging end-bosses. Public quests are a great idea and fun to participate in. No matter where you choose to kill enemy players and monsters, there is a constant stream of rewards heaped on you. Killing other players earns you renown points, which you use to purchase certain gear and gain renown skills. PVP earns you basic experience as well, but you'll keep securing renown even after you reach the level cap of 40. Completing public quests earns you influence in a particular geographical region, which you can cash in for various items. Even guilds get perks, earning levels that then unlock various enhancements for its members. Warhammer Online's most skillful and subtle reward system, however, comes by way of its all-encompassing encyclopedia, the Tome of Knowledge. The Tome consolidates every piece of in-game information you could possibly hope to access: bestiary, quest details, lore overviews, and a lot more. As you enter new areas, encounter new NPCs or monsters, and accumulate kills, new Tome entries are unlocked and announcements flash on the screen. The most satisfying unlockables are the myriad of titles you can earn and apply to yourself, from elite declarations (~The Fearless~) to the humorous (~Ow, My Eye~). Using the Tome is a great way to learn the lore and explore the ins and outs of the universe. If you'd rather learn by exploring and participating in the player-versus-environment aspect of Warhammer Online, you'll find it solid but far less enthralling than its fantastic PVP play. The world proper, from Black Crag to Barak Varr, is easy on the eyes but doesn't harbor any surprises. There are some beautiful vistas, from the creepy, sinister Inevitable City to the docked steamer at Mount Bloodhorn. The best regions feel violently off-kilter and very much in the Warhammer mold (or at least, as close as they can get given the game's T rating). Other areas, such as Avelorn, look fairly sterile and undeveloped, which in turn make certain places feel like a utilitarian vehicle for the delivery of PVP content. Questing and exploration are on the generic side. And, of course, you can perform quests for NPCs, though you won't find many standouts among the standards. Some are funny to read (a goblin saves his own hide by asking you to find alternate food for an orc), and they're detailed with surprising length in the Tome of Knowledge. But for the most part, questing feels generic, an apparent casualty of the enormous focus on player warfare. The way quests tie into other aspects of the game is pretty nifty, though: A good many of them send you into the middle of open battlefields and public quests, which in turn draws you into the anarchy at hand. You might be focused on finding a quest item, but the only way to get it is to stop and fight with your fellows. This relationship between quests and PVP encourages you to put aside your petty fetch quest for a moment to join the larger skirmish--which is just as well, considering the battle in progress will be more enjoyable than whatever deed you were performing. Unfortunately, the quest part of the equation ultimately suffers in this intriguing web, particularly when small but perceptible issues are entangled in it. Many of the regions are densely populated with monsters that respawn quickly after defeat--a great feature if there is a bunch of people participating in the accompanying public quest but an irritation for certain classes when soloing or even in a small group. And excessive exploration can result in reaching your 20-quest limit too quickly, while choosing quests in favor of player combat might cause you to deplete the local supply of quests and still not reach a level appropriate for the next area. At least, the death penalty lessens the annoyance a bit: You'll respawn at a local camp and a healer will remove any lingering effect for a little bit of coin. You can also group up and make your way through various instanced dungeons, which are immune by nature from some of these inconsistencies. If you want to mix things up, you can check out the crafting system: Just don't expect much. While you can choose both a standard craft and a gathering profession, the game does a terrible job of introducing the options and how your choices impact each other. For example, talisman makers are better off if they choose salvaging as their gathering skill, but the lack of a real tutorial means it's easy to make a misguided decision. And at the time of this review, loot drops are full of seeds and short on salvageable items, heavily skewing the game in favor of cultivators. The actual act of crafting an item is painless, however, though the overall system doesn't seem fully fleshed out. The Inevitable City is impressively ominous. Warhammer Online's visuals have a stylized, exaggerated vibe that resonates well, even if it invites inevitable comparisons to other MMOGs. But it's a good look, and the game is obviously intended to run on a large range of computers. The relatively low-polygon count is offset by a broad color palette and subtle textures. The architecture and character models are also exaggerated in just the right ways. And the graphic engine delivers when it counts: The game ran well without meaningful frame rate drops or crashes on a variety of systems. From a technical perspective, you can see where corners were cut: Animations are really choppy when viewed from anywhere but up close, and in the main faction cities, model textures flicker in and out. These and other minor glitches aren't apt to stand in the way of your enjoyment though, and Warhammer Online's visuals are generally delightful. The sound design is good, but none of its aspects rise to the head of the class. The soundtrack suits the fantasy setting, but it doesn't really enhance the experience in any way. In fact, all of Warhammer Online's audio, from spell effects to quest confirmations, sounds fine but unremarkable. This isn't the most well-rounded massively multiplayer online game, but Warhammer Online grabs the tuskgor by the horns, delivering the finest PVP content seen in a traditional persistent world RPG. Questers and explorers may not find what they're looking for, and certain gameplay systems don't mesh as well as they should. Nevertheless, there's more than enough exciting PVP content here to keep newcomers and veterans alike immersed in the perpetually violent tug of war between the forces of Order and Destruction. Or as the Orcs say: Waaagh! Using the Tome is a great way to learn the lore and explore the ins and outs of the universe. If you'd rather learn by exploring and participating in the player-versus-environment aspect of Warhammer Online, you'll find it solid but far less enthralling than its fantastic PVP play. The world proper, from Black Crag to Barak Varr, is easy on the eyes but doesn't harbor any surprises. There are some beautiful vistas, from the creepy, sinister Inevitable City to the docked steamer at Mount Bloodhorn. The best regions feel violently off-kilter and very much in the Warhammer mold (or at least, as close as they can get given the game's T rating). Other areas, such as Avelorn, look fairly sterile and undeveloped, which in turn make certain places feel like a utilitarian vehicle for the delivery of PVP content. Questing and exploration are on the generic side. And, of course, you can perform quests for NPCs, though you won't find many standouts among the standards. Some are funny to read (a goblin saves his own hide by asking you to find alternate food for an orc), and they're detailed with surprising length in the Tome of Knowledge. But for the most part, questing feels generic, an apparent casualty of the enormous focus on player warfare. The way quests tie into other aspects of the game is pretty nifty, though: A good many of them send you into the middle of open battlefields and public quests, which in turn draws you into the anarchy at hand. You might be focused on finding a quest item, but the only way to get it is to stop and fight with your fellows. This relationship between quests and PVP encourages you to put aside your petty fetch quest for a moment to join the larger skirmish--which is just as well, considering the battle in progress will be more enjoyable than whatever deed you were performing. Unfortunately, the quest part of the equation ultimately suffers in this intriguing web, particularly when small but perceptible issues are entangled in it. Many of the regions are densely populated with monsters that respawn quickly after defeat--a great feature if there is a bunch of people participating in the accompanying public quest but an irritation for certain classes when soloing or even in a small group. And excessive exploration can result in reaching your 20-quest limit too quickly, while choosing quests in favor of player combat might cause you to deplete the local supply of quests and still not reach a level appropriate for the next area. At least, the death penalty lessens the annoyance a bit: You'll respawn at a local camp and a healer will remove any lingering effect for a little bit of coin. You can also group up and make your way through various instanced dungeons, which are immune by nature from some of these inconsistencies. If you want to mix things up, you can check out the crafting system: Just don't expect much. While you can choose both a standard craft and a gathering profession, the game does a terrible job of introducing the options and how your choices impact each other. For example, talisman makers are better off if they choose salvaging as their gathering skill, but the lack of a real tutorial means it's easy to make a misguided decision. And at the time of this review, loot drops are full of seeds and short on salvageable items, heavily skewing the game in favor of cultivators. The actual act of crafting an item is painless, however, though the overall system doesn't seem fully fleshed out. The Inevitable City is impressively ominous. Warhammer Online's visuals have a stylized, exaggerated vibe that resonates well, even if it invites inevitable comparisons to other MMOGs. But it's a good look, and the game is obviously intended to run on a large range of computers. The relatively low-polygon count is offset by a broad color palette and subtle textures. The architecture and character models are also exaggerated in just the right ways. And the graphic engine delivers when it counts: The game ran well without meaningful frame rate drops or crashes on a variety of systems. From a technical perspective, you can see where corners were cut: Animations are really choppy when viewed from anywhere but up close, and in the main faction cities, model textures flicker in and out. These and other minor glitches aren't apt to stand in the way of your enjoyment though, and Warhammer Online's visuals are generally delightful. The sound design is good, but none of its aspects rise to the head of the class. The soundtrack suits the fantasy setting, but it doesn't really enhance the experience in any way. In fact, all of Warhammer Online's audio, from spell effects to quest confirmations, sounds fine but unremarkable. This isn't the most well-rounded massively multiplayer online game, but Warhammer Online grabs the tuskgor by the horns, delivering the finest PVP content seen in a traditional persistent world RPG. Questers and explorers may not find what they're looking for, and certain gameplay systems don't mesh as well as they should. Nevertheless, there's more than enough exciting PVP content here to keep newcomers and veterans alike immersed in the perpetually violent tug of war between the forces of Order and Destruction. Or as the Orcs say: Waaagh!"}