{"ref": "https://www.gamespot.com/reviews/warhammer-40000-dawn-of-war-winter-assault-review/1900-6134130/", "date": "October 10, 2006", "game_name": "Warhammer 40,000: Dawn of War - Winter Assault", "text": "Sometimes recommending a game is easy--as with Winter Assault, the new expansion pack for last year's excellent real-time strategy game Warhammer 40,000: Dawn of War. That game brought to life the universe created by Games Workshop's popular sci-fi tabletop game with beautiful graphics and fast-paced gameplay that was focused on three things: offense, offense, and more offense. Winter Assault adds a new playable faction, new units to existing factions, a new single-player game, and some tweaks and additions that should make most Dawn of War fans very happy, and might win a few converts, too. Winter Assault adds a new playable faction, new units, and even more highly competitive multiplayer. Dawn of War bucked the trend of traditional real-time strategy games, which usually require you to chop wood and mine gold for a few minutes before you can build up a base, then churn out an army of military units. Instead, you chose one of the game's four playable sides (the fanatical space marines, the demonic forces of chaos, the swift-footed eldar, or the swarming armies of the orks) and forged ahead on the map, capturing strategic points for resources to build out a base, often getting into skirmishes early. In contrast, the expansion's new playable faction, the imperial guard, focuses on defense--that is, hanging back around a base, gradually researching higher technologies, and eventually bringing out the big guns. The imperial guard consists of regular human soldiers that serve Warhammer 40,000's enigmatic emperor, along with the space marines--they actually appeared in several missions in the original game. Their focus in the early game is to churn out large squads of infantry with relatively poor morale (which can cause them to be routed if outgunned), hole up in some cover, and fire continuously on any enemies that blunder into range. The guard also possesses several powerful vehicles it can call upon in the later game, the ability to garrison troops in certain vehicles and buildings, plus the ability to move infantry troops directly from building to building using a ~network of tunnels.~ Unfortunately, Winter Assault still suffers from the minor artificial intelligence and pathfinding problems in Dawn of War, especially for large groups of units--like the infantry-heavy imperial guard. You'll occasionally find that half of your troops don't follow your move or attack orders, especially near impassable obstacles, and especially when you command large groups at once, which you almost certainly will for the imperials. Serious fans of Dawn of War, and of the colorful Warhammer 40,000 universe in general, might not find the new faction to be nearly as exciting as the elite troops of the space marines or the loutish orks and their ramshackle technology. However, the new faction seems to be pretty balanced; it adds a new, novice-friendly way to play the game (even if it isn't quite as exciting for experts), as well as a playable faction of actual humans that casual fans might relate to more than, for instance, the motley-colored eldar, who wear form-fitting power armor and speak nothing but arcane babble. The imperial guard isn't the most interesting faction that could've been added, but it does add a new style of play. Presumably because Dawn of War's campaign focused mainly on the space marines, Winter Assault's single-player game focuses on the other four factions, in a series of objective-based missions much like those of the original game. The two-part campaign lets you play as the side of ~order~ (the imperial guard and the eldar) and the side of ~disorder~ (the orks and chaos) through five missions each. The campaign missions are pretty substantial (and in some cases, much more exacting than those of the original game). Finishing both halves of the campaign should take most real-time strategy fans between 10 and 15 hours, so you get a decent-size game to play through--and each half of the campaign branches at the very end. Without giving away the story, we'll just mention that in both campaigns, the two factions you play as don't always get along and end up opposing each other; you then get the choice to play through the final mission as one of the two factions. While this is an interesting way to set up a campaign, the rest of the missions require you to switch between factions (either the imperials and the eldar, or the orks and chaos) repeatedly, which makes the experience seem disjointed. The campaign probably would've been more compelling if it had let you play as a single faction the entire way through. Perhaps less important, throughout the campaign, you'll also occasionally find that the game relies a bit too heavily on scripted events to suspend your belief. For instance, in one mission, you're required to hunt down an evasive ork general at all costs as he keeps popping in and out of different sewer pipes after taking fire; if you ignore that objective and leave him alone, he'll just stand there and let you explore the rest of the map at your leisure. Still, the campaign is pretty solid and generally offers more of a challenge than that of the original game. Multiplayer games of Winter Assault offer more variety than Dawn of War did. Winter Assault also adds several tweaks and fixes to the game's overall balance for single-player and multiplayer. Winter Assault's additions, including a highly complementary unit to each existing faction to help round it out, along with cheaper, faster-to-build units and buildings, seem to make Dawn of War's already fast-paced multiplayer even faster. This is a good thing for players who like to play aggressively but are tired of executing the same old ~rush~ tactic of churning out a small army of the cheapest, weakest soldiers and ambushing opponents early. Since the higher-level technologies are cheaper and faster to build, it's much more feasible to scramble up the ~technology tree~ of different buildings and improvements to get to the most powerful units faster--so players who go for that same old rush with cheap, weak soldiers may be in for a nasty surprise against opponents who respond with much stronger counterunits much more quickly. Overall, the net effect seems to be adding more variety to multiplayer, since it's more common to see high-level units and buildings alongside the low-level ones--and variety is definitely a good thing in a game about strategies using the combined strengths of different units. And fortunately, Winter Assault also has a very solid presentation. The game's soundtrack resembles the kind of blustery-but-forgettable symphonic score as the first game, as well as plenty of enthusiastic (and in some cases, overly enthusiastic) voice acting. Several characters, particularly some of the key characters in the campaign (like the gibbering Crull of the forces of chaos) come off as a little too overwrought; but fortunately, it's not too out of place in a universe where vicious aliens do battle with insane fanatics. Otherwise, the game's weapon sounds and other special effects remain as appropriate and hard-hitting as those in Dawn of War. The expansion looks great, too. While several of the units in the imperial guard seem mundane, even drab compared to the fantastic rosters of the game's other sci-fi factions, they're highly detailed and have plenty of elaborate animations, particularly for the imperials' armored vehicles, which rock back and forth whenever they fire shells. The expansion also adds a few minor graphical frills like falling snow in certain maps, and corpses that remain on the battlefield (rather than eventually disappearing from sight), though the real star of the show is still the massive battles that can take place between highly detailed units that swap bursts of plasma-rifle fire and flamethrower rounds. If you're already a Dawn of War fan, Winter Assault should have plenty to offer you. Winter Assault isn't exactly a perfect expansion pack, but for the many fans that the original game rightfully garnered, that's not important. Aside from offering a decent campaign, the new units and faction give even more depth to Dawn of War's highly competitive multiplayer modes, which should be reason enough for fans to play the expansion. Even those who passed up Dawn of War the first time around might want to sit up and take note, since the expansion's new faction is much more user-friendly to beginners, even if it isn't as distinctive as the other factions. All things considered, Winter Assault is a great expansion pack for a great strategy game. Perhaps less important, throughout the campaign, you'll also occasionally find that the game relies a bit too heavily on scripted events to suspend your belief. For instance, in one mission, you're required to hunt down an evasive ork general at all costs as he keeps popping in and out of different sewer pipes after taking fire; if you ignore that objective and leave him alone, he'll just stand there and let you explore the rest of the map at your leisure. Still, the campaign is pretty solid and generally offers more of a challenge than that of the original game. Multiplayer games of Winter Assault offer more variety than Dawn of War did. Winter Assault also adds several tweaks and fixes to the game's overall balance for single-player and multiplayer. Winter Assault's additions, including a highly complementary unit to each existing faction to help round it out, along with cheaper, faster-to-build units and buildings, seem to make Dawn of War's already fast-paced multiplayer even faster. This is a good thing for players who like to play aggressively but are tired of executing the same old ~rush~ tactic of churning out a small army of the cheapest, weakest soldiers and ambushing opponents early. Since the higher-level technologies are cheaper and faster to build, it's much more feasible to scramble up the ~technology tree~ of different buildings and improvements to get to the most powerful units faster--so players who go for that same old rush with cheap, weak soldiers may be in for a nasty surprise against opponents who respond with much stronger counterunits much more quickly. Overall, the net effect seems to be adding more variety to multiplayer, since it's more common to see high-level units and buildings alongside the low-level ones--and variety is definitely a good thing in a game about strategies using the combined strengths of different units. And fortunately, Winter Assault also has a very solid presentation. The game's soundtrack resembles the kind of blustery-but-forgettable symphonic score as the first game, as well as plenty of enthusiastic (and in some cases, overly enthusiastic) voice acting. Several characters, particularly some of the key characters in the campaign (like the gibbering Crull of the forces of chaos) come off as a little too overwrought; but fortunately, it's not too out of place in a universe where vicious aliens do battle with insane fanatics. Otherwise, the game's weapon sounds and other special effects remain as appropriate and hard-hitting as those in Dawn of War. The expansion looks great, too. While several of the units in the imperial guard seem mundane, even drab compared to the fantastic rosters of the game's other sci-fi factions, they're highly detailed and have plenty of elaborate animations, particularly for the imperials' armored vehicles, which rock back and forth whenever they fire shells. The expansion also adds a few minor graphical frills like falling snow in certain maps, and corpses that remain on the battlefield (rather than eventually disappearing from sight), though the real star of the show is still the massive battles that can take place between highly detailed units that swap bursts of plasma-rifle fire and flamethrower rounds. If you're already a Dawn of War fan, Winter Assault should have plenty to offer you. Winter Assault isn't exactly a perfect expansion pack, but for the many fans that the original game rightfully garnered, that's not important. Aside from offering a decent campaign, the new units and faction give even more depth to Dawn of War's highly competitive multiplayer modes, which should be reason enough for fans to play the expansion. Even those who passed up Dawn of War the first time around might want to sit up and take note, since the expansion's new faction is much more user-friendly to beginners, even if it isn't as distinctive as the other factions. All things considered, Winter Assault is a great expansion pack for a great strategy game."}