{"ref": "https://www.gamespot.com/reviews/tony-hawks-american-wasteland-review/1900-6139979/", "date": "November 16, 2005", "game_name": "Tony Hawk's American Wasteland", "text": "Don't let the recent name changes or Tony Hawk's debut on a new video game system fool you. Tony Hawk's American Wasteland is the seventh Tony Hawk game developed by Neversoft in as many years. Over the years the series has had installments that made dramatic changes to the formula, but the more recent installments have focused less on gameplay or structural changes and more on including a story. American Wasteland is the game that finally makes good on the story thing by offering a plot that's far more interesting than it has been in the previous two versions. It also attempts to put all its levels together into one big take on Los Angeles that's free from loading times. That part doesn't work out quite as well as the back of the box would have you believe, but the real issue with American Wasteland is with its gameplay. You'll find the requisite handful of new tricks, but most of the story mode feels like a brief tutorial, and the classic mode isn't deep or long enough to hold the attention of series veterans. It's got more of the same fluid skating gameplay you've come to expect from the series, but the game is over almost immediately. The Xbox 360 version of THAW runs in a higher resolution, but that really makes the game's graphical flaws stand out. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tony Hawk's American Wasteland Video Review The Xbox 360 version of Tony Hawk's American Wasteland is roughly identical to the versions that were recently released on the Xbox, PlayStation 2, and GameCube. The main difference is a graphical one, since this version of the game supports HDTV-quality resolution like every other Xbox 360 game. But the character models, textures, and animation still look very similar to what's on display in previous versions. Those previous versions looked great on their respective platforms, but when you blow that stuff up to higher HD resolutions, it all starts to look really, really bad--especially when you're watching cutscenes in story mode. Up close, the characters look awful, and the way the inside of their mouths are rendered, combined with the odd mouth-movement animations, makes these scenes look terrible. On top of that, American Wasteland is weirdly dark when running in HD, though it isn't quite as noticeable on regular TVs. There's an in-game brightness control that you can use to attempt to fix the problem, but this only succeeded in making the entire thing look washed out. There are also some nasty graphical glitches, causing some decals to flicker in and out of existence. Some of this stuff isn't as noticeable when running the game in standard resolutions, but at that point, you'd probably be better off saving $10 by going with the Xbox or PlayStation 2 version anyway. You won't get the higher resolutions that you'll get in the 360 version, but it won't be as glitchy, either. The PlayStation 2 controller has long been the best way to control the action in the Tony Hawk games, though versions on other platforms have gotten by. It really helps having four shoulder buttons to work with when trying to pull off all those tricks. But now, there's a new controller on the block with four shoulder buttons. The Xbox 360 controller is just fine for controlling this one, though using the right analog trigger to revert takes a bit getting used to. So, in essence, this is the first non-PS2 version to control just as well as its PS2 counterpart. The main mode is a story that puts you in the role of a nameless skater from the Midwest who has given up on living in the middle of nowhere. Tired of being hassled by The Man, you run away to Los Angeles with dreams of skating in the area where skating all began. Things are going fine until just after you step off the bus, when you are jumped by some toughs who make off with your gear. A raspy-voiced girl named Mindy takes pity on you and sets you off in the direction of an adventure, which sends you all around the city of Los Angeles, where you'll thrash, skate, and destroy as you find a crew of squatting vandals to call your friends, a skatepark to call your own, and...an alien costume. When you first start, you'll be a pretty weak skater. Most of the moves you've come to expect from the series, like manuals and reverts, won't even be available to you until you learn them. You'll learn most of the basics pretty quickly, but it will take a little while before you learn to use special tricks, flatland tricks, and focus. The closer you get to the character models, the worse they look. You'll also learn the new tricks, like the bert slide, which is the ground-based, surfinglike maneuver brought back to the skating hive-mind by Dogtown and Z-Boys. You can also get off your board and swing it at pedestrians (which isn't terribly useful), and you can learn some freestyle running techniques for wall-climbing, flips, and so on. You can also find and ride BMX bikes (which you'll encounter during a couple of goals), but they are mostly there for you to earn money, which you'll need at various points in the story. The BMX bike controls are vastly different from the skating controls, and they're surprisingly well-thought-out. You'll hold a button to pedal, steer with the left analog stick, and perform tricks with the right. Also, some tricks are left up to you to put together. A flair, for example, is a backflip and a 180-degree turn combined. Bike games have traditionally just mapped that to a button and a direction, just like any other trick. Here you'll have to do a backflip and a 180 at the same time to get credit for a flair. The BMX stuff is minor, overall, but it's an interesting diversion. Few of these new tricks really matter, because most of your goals in story mode simply ask you to quickly grind or natas-spin on an object, or wall-plant or sticker-slap something while watching the fun. Most of the goals are based around the skate ranch, an area found just outside of Beverly Hills that's mostly a large empty dirt lot with a halfpipe in it. One of the major thrusts of the story is your crew's desire to trick out the ranch, so you'll always have goals that involve you busting out a piece of the city so that it can be added to the ranch. There are a lot of different pieces to be added, but since most of them are required goals that get the story moving again, you won't have to go out of your way to get them. You'll have a few things to do in the skate ranch itself, but it's mostly just there for show and for free skating. The main problem with the goals is that they're ridiculously straightforward and leave nothing to the imagination. If you need to grind some support cables to loosen a sign on top of a theater, you are set down directly in front of those support cables. After you grind them, you're asked to pull off a wall-plant on the sign itself. Again, it drops you into the exact position to pull it off. The game really seems bent on holding your hand every step of the way. While forcing you to go out of your way to line yourself up might not be the most fun thing in the world, the way THAW is set up makes the entire story mode feel like a tutorial. If you've kept up with the Tony Hawk series over the years, you'll nail most of the goals on your first or second try. But the simplistic nature of the goals will probably turn off new players, as well. While it has a ~sick~ difficulty mode that's meant to make things more challenging, it still lines you up just right, and it still forces you through all the early move-learning tutorial stuff. It's decidedly un-sick. Classic mode resurrects some of the levels from earlier games. The saving grace of the story mode is that the story it tells is actually pretty good. It follows the standard ~ragtag group of misfits' struggles to save the place they call home from evil real estate moguls~ plot that drove such classic films as Breakin' 2: Electric Boogaloo. But along the way, the characters become a little endearing, and most importantly, the game doesn't beat you over the head by shoehorning the pro skaters in whenever possible. When you finally do start encountering the pros, you do it in a way that feels natural, which is great. That said, the plot has some holes, and the last mission hits you unexpectedly, exacerbating the game's short feel. If you were any good at playing previous Tony Hawk games, then you'll probably be done with this one in four or five hours. A big part of the story mode is that it tries to present the entire city to you as one large environment to skate in, without load times. That's true in theory, but it's not nearly as pure as it may sound. The city's levels are all separated by tight hallways you have to skate through to change areas. So you're technically still in control, but these hallways are lame and pointless, and they really might as well just be load screens. New areas start to load when you enter the connecting area, which occasionally causes some stutters and skips in the frame rate. If you want, you can catch a bus from area to area, which saves you the hassle of having to skate from one end of LA to the other. Since you can walk around the bus while the interior of it shakes onscreen, this technically isn't a load time, right? Each area is pretty large and feels at least somewhat different from the other ones. In terms of raw outdoor LA skating, you'll get Hollywood, Santa Monica, downtown, Beverly Hills, and East LA. But you'll also skate in an indoor skatepark, tear up an oil rig, and eventually get access to a casino, though this casino is taken from the PSP version of THUG2, so it's not exactly a new level. The casino is the last area you'll see in story mode, which is pretty disappointing if you played THUG2 on the PSP and already saw this level. The level design is full of huge skate lines that let you extend combos into strings of tricks that take you all over the level. It's at a point where if you're good at keeping your grind and manual balance meters under control, you can do tricks and combos forever. The million-point combo that felt so skillful four years ago is now the order of the day, since some spots feel like you can hop off anything and land on another object that you can do tricks on almost automatically. The flip side to THAW's story mode is classic mode, which once again takes things back to the two-minute run timer, skate letters, and secret tapes that marked the first three entries in the series. It also pulls in classic levels from other Tony Hawk games. The series has been reusing the old levels as special unlockables for the last few years now, so most of the truly amazing levels from the Tony Hawk series have already appeared in a nostalgic context. That leaves behind some good (but not all that great) levels from Hawks of the past, including more levels from the PSP THUG2 that was released earlier this year. The goals have been rearranged a bit, so they won't be exactly how you remember them from the previous games, but that doesn't make them especially difficult, either. Again, if you're down with it, you'll probably be completing at least five of each level's 10 goals on your first run-through. However, if you want to get every single goal in the mode, it'll take more time. But vets should have at least gotten to the last level on the list--a pretty cool postapocalyptic ruined-city level--in an hour or two. There's more to see and unlock, but if you're just trying to unlock the basics so you can get online to host a game (where you're limited to hosting levels you've seen in single-player), you can do all that pretty quickly. If you're any good at Tony Hawk, you'll find this game an absolute breeze. The online action in THAW is very similar to last year's Tony Hawk. It lets up to eight players play score-based challenges, capture the flag, goal attack, graffiti, combo mambo, and so on. The modes are generally pretty cool. Even just the plain old high-score competition is worthwhile, because you can throw down really heavy combos. Stuff like graffiti and capture the flag forces you to change the way you play a bit. And the firefight mode, which lets you shoot fireballs out of your skateboard, effectively turning the game into a makeshift shooter, is also pretty crazy. All in all, the online is worth playing, though new players might have a hard time getting used to the particulars or nailing high-scoring combos, since the single-player doesn't really train you for that sort of activity. The main problem with the goals is that they're ridiculously straightforward and leave nothing to the imagination. If you need to grind some support cables to loosen a sign on top of a theater, you are set down directly in front of those support cables. After you grind them, you're asked to pull off a wall-plant on the sign itself. Again, it drops you into the exact position to pull it off. The game really seems bent on holding your hand every step of the way. While forcing you to go out of your way to line yourself up might not be the most fun thing in the world, the way THAW is set up makes the entire story mode feel like a tutorial. If you've kept up with the Tony Hawk series over the years, you'll nail most of the goals on your first or second try. But the simplistic nature of the goals will probably turn off new players, as well. While it has a ~sick~ difficulty mode that's meant to make things more challenging, it still lines you up just right, and it still forces you through all the early move-learning tutorial stuff. It's decidedly un-sick. Classic mode resurrects some of the levels from earlier games. The saving grace of the story mode is that the story it tells is actually pretty good. It follows the standard ~ragtag group of misfits' struggles to save the place they call home from evil real estate moguls~ plot that drove such classic films as Breakin' 2: Electric Boogaloo. But along the way, the characters become a little endearing, and most importantly, the game doesn't beat you over the head by shoehorning the pro skaters in whenever possible. When you finally do start encountering the pros, you do it in a way that feels natural, which is great. That said, the plot has some holes, and the last mission hits you unexpectedly, exacerbating the game's short feel. If you were any good at playing previous Tony Hawk games, then you'll probably be done with this one in four or five hours. A big part of the story mode is that it tries to present the entire city to you as one large environment to skate in, without load times. That's true in theory, but it's not nearly as pure as it may sound. The city's levels are all separated by tight hallways you have to skate through to change areas. So you're technically still in control, but these hallways are lame and pointless, and they really might as well just be load screens. New areas start to load when you enter the connecting area, which occasionally causes some stutters and skips in the frame rate. If you want, you can catch a bus from area to area, which saves you the hassle of having to skate from one end of LA to the other. Since you can walk around the bus while the interior of it shakes onscreen, this technically isn't a load time, right? Each area is pretty large and feels at least somewhat different from the other ones. In terms of raw outdoor LA skating, you'll get Hollywood, Santa Monica, downtown, Beverly Hills, and East LA. But you'll also skate in an indoor skatepark, tear up an oil rig, and eventually get access to a casino, though this casino is taken from the PSP version of THUG2, so it's not exactly a new level. The casino is the last area you'll see in story mode, which is pretty disappointing if you played THUG2 on the PSP and already saw this level. The level design is full of huge skate lines that let you extend combos into strings of tricks that take you all over the level. It's at a point where if you're good at keeping your grind and manual balance meters under control, you can do tricks and combos forever. The million-point combo that felt so skillful four years ago is now the order of the day, since some spots feel like you can hop off anything and land on another object that you can do tricks on almost automatically. The flip side to THAW's story mode is classic mode, which once again takes things back to the two-minute run timer, skate letters, and secret tapes that marked the first three entries in the series. It also pulls in classic levels from other Tony Hawk games. The series has been reusing the old levels as special unlockables for the last few years now, so most of the truly amazing levels from the Tony Hawk series have already appeared in a nostalgic context. That leaves behind some good (but not all that great) levels from Hawks of the past, including more levels from the PSP THUG2 that was released earlier this year. The goals have been rearranged a bit, so they won't be exactly how you remember them from the previous games, but that doesn't make them especially difficult, either. Again, if you're down with it, you'll probably be completing at least five of each level's 10 goals on your first run-through. However, if you want to get every single goal in the mode, it'll take more time. But vets should have at least gotten to the last level on the list--a pretty cool postapocalyptic ruined-city level--in an hour or two. There's more to see and unlock, but if you're just trying to unlock the basics so you can get online to host a game (where you're limited to hosting levels you've seen in single-player), you can do all that pretty quickly. If you're any good at Tony Hawk, you'll find this game an absolute breeze. The online action in THAW is very similar to last year's Tony Hawk. It lets up to eight players play score-based challenges, capture the flag, goal attack, graffiti, combo mambo, and so on. The modes are generally pretty cool. Even just the plain old high-score competition is worthwhile, because you can throw down really heavy combos. Stuff like graffiti and capture the flag forces you to change the way you play a bit. And the firefight mode, which lets you shoot fireballs out of your skateboard, effectively turning the game into a makeshift shooter, is also pretty crazy. All in all, the online is worth playing, though new players might have a hard time getting used to the particulars or nailing high-scoring combos, since the single-player doesn't really train you for that sort of activity. The modes in this year's online game are pretty much the same online options we've been seeing for quite some time now. Of course, all this is brand-spanking-new to Xbox and Xbox 360 owners, who are finally getting their first taste of online support this year. In addition to Xbox Live support, there's split-screen multiplayer, but this isn't much fun at all. Also, your skater from story mode can't be used online or in any of the other non-story modes. Considering you're sort of building this skater up over time, it would have been nice if he eventually turned into some superskater to give players that do well in the story some extra incentive. To sum up the online mode, if you've enjoyed competing online in the past, the collection of new levels should be more than enough to keep you entertained this year. If you're new to the series, you'll be matched up by rank, allowing you to compete with players of a similar skill level. The game's character models look pretty bad up close. You'll unlock secret skaters when you finish the modes on different difficulties. This year's unlockable for beating the story on normal is pretty random (like it has been in recent years), and it represents an interesting addition. We won't reveal who it is, but let's just say that he would have been a lot funnier with some voice samples, and perhaps some sort of special manual move that brought out a large pimp chalice. OK, perhaps we've said too much... You'll also have the same sort of ~create~ modes that you've seen in past versions, letting you create skaters, skateparks, tricks, deck graphics, graffiti tags, and so on. Graphically, Tony Hawk's American Wasteland on the 360 doesn't look much better than its Xbox counterpart. Sure, you can run it in a higher resolution thanks to the 360's 720p and 1080i support, but all this does is make the character models look really awful. It runs at a smooth frame rate and doesn't have any jagged edges to it, but it still looks like a game that was initially developed for the PlayStation 2 and then hastily converted for a higher-powered system. If you're familiar with how some console-to-PC ports come out looking like crisper PS2 games, you should already have a pretty good idea of how this one looks. The textures are a weird mix--some of them are clearly higher-quality textures that look sharp, clean, and colorful. But you'll still come across some really dirty-looking ground and wall textures from time to time, too. When you compare this to other games on the Xbox 360, it looks downright mediocre. Much of the sound in American Wasteland has been pulled from the previous versions, which is to be expected, since the developer got the sounds of skating down quite well years ago. Still, you'll hear some new sound effects here and there if you're listening closely, and for the most part, it sounds nice. The soundtrack is once again varied across several genres, and it includes Frank Black's ~Los Angeles,~ which, really, is all you need. There are also a lot of new punk bands covering a lot of old punk songs. If you're emotionally attached to a lot of old punk rock, you'll probably hate it on principle, but the covers are still decent. As with most every Xbox 360 game, you can opt for a custom soundtrack, if you like. As far as the speech goes, there's a lot of it, and most of it's nicely done. The pro skaters, who were occasionally rough in previous years, aren't present very much, but their performances are generally more believable overall. And the rest of the cast members do a fine job with their lines of dialogue, which are well written and fit in the context of the story--except for the part where other skaters keep calling you a ~noob,~ which really seems out of place. The game's story goals usually line you right up with the item you need to interact with. You'll notice, though, that the subtitles rarely match the spoken dialogue. You'll probably also notice that the subtitles are displayed even though they default to ~off~ in the menu, which is pretty sloppy. There are a few other minor bugs, much like this one, that pop up in rare circumstances. These bugs are never bad enough to cripple the game, but they do give off the feeling that a few corners were cut during development. While the gameplay in Tony Hawk's American Wasteland is still sharp, the weak graphical display found in the Xbox 360 version really takes the whole experience down a few notches. But even beyond the graphics, this seventh installment just seems to lack that special spark that made the series so much fun in the first place. The Tony Hawk series has always worked, because even if you stripped away all the goals, pro skaters, and extra fluff packed into each annual installment, the simple act of finding lines and skating freestyle across the levels was great fun. Even with a handful of new tricks, simply skating around and grinding out huge lines only goes so far, especially when the levels are set up to make doing so incredibly easy. It's enough to make you think that maybe the series needs a year off to give it time to incorporate some dramatic new ideas that could revitalize the once-great franchise. The modes in this year's online game are pretty much the same online options we've been seeing for quite some time now. Of course, all this is brand-spanking-new to Xbox and Xbox 360 owners, who are finally getting their first taste of online support this year. In addition to Xbox Live support, there's split-screen multiplayer, but this isn't much fun at all. Also, your skater from story mode can't be used online or in any of the other non-story modes. Considering you're sort of building this skater up over time, it would have been nice if he eventually turned into some superskater to give players that do well in the story some extra incentive. To sum up the online mode, if you've enjoyed competing online in the past, the collection of new levels should be more than enough to keep you entertained this year. If you're new to the series, you'll be matched up by rank, allowing you to compete with players of a similar skill level. The game's character models look pretty bad up close. You'll unlock secret skaters when you finish the modes on different difficulties. This year's unlockable for beating the story on normal is pretty random (like it has been in recent years), and it represents an interesting addition. We won't reveal who it is, but let's just say that he would have been a lot funnier with some voice samples, and perhaps some sort of special manual move that brought out a large pimp chalice. OK, perhaps we've said too much... You'll also have the same sort of ~create~ modes that you've seen in past versions, letting you create skaters, skateparks, tricks, deck graphics, graffiti tags, and so on. Graphically, Tony Hawk's American Wasteland on the 360 doesn't look much better than its Xbox counterpart. Sure, you can run it in a higher resolution thanks to the 360's 720p and 1080i support, but all this does is make the character models look really awful. It runs at a smooth frame rate and doesn't have any jagged edges to it, but it still looks like a game that was initially developed for the PlayStation 2 and then hastily converted for a higher-powered system. If you're familiar with how some console-to-PC ports come out looking like crisper PS2 games, you should already have a pretty good idea of how this one looks. The textures are a weird mix--some of them are clearly higher-quality textures that look sharp, clean, and colorful. But you'll still come across some really dirty-looking ground and wall textures from time to time, too. When you compare this to other games on the Xbox 360, it looks downright mediocre. Much of the sound in American Wasteland has been pulled from the previous versions, which is to be expected, since the developer got the sounds of skating down quite well years ago. Still, you'll hear some new sound effects here and there if you're listening closely, and for the most part, it sounds nice. The soundtrack is once again varied across several genres, and it includes Frank Black's ~Los Angeles,~ which, really, is all you need. There are also a lot of new punk bands covering a lot of old punk songs. If you're emotionally attached to a lot of old punk rock, you'll probably hate it on principle, but the covers are still decent. As with most every Xbox 360 game, you can opt for a custom soundtrack, if you like. As far as the speech goes, there's a lot of it, and most of it's nicely done. The pro skaters, who were occasionally rough in previous years, aren't present very much, but their performances are generally more believable overall. And the rest of the cast members do a fine job with their lines of dialogue, which are well written and fit in the context of the story--except for the part where other skaters keep calling you a ~noob,~ which really seems out of place. The game's story goals usually line you right up with the item you need to interact with. You'll notice, though, that the subtitles rarely match the spoken dialogue. You'll probably also notice that the subtitles are displayed even though they default to ~off~ in the menu, which is pretty sloppy. There are a few other minor bugs, much like this one, that pop up in rare circumstances. These bugs are never bad enough to cripple the game, but they do give off the feeling that a few corners were cut during development. While the gameplay in Tony Hawk's American Wasteland is still sharp, the weak graphical display found in the Xbox 360 version really takes the whole experience down a few notches. But even beyond the graphics, this seventh installment just seems to lack that special spark that made the series so much fun in the first place. The Tony Hawk series has always worked, because even if you stripped away all the goals, pro skaters, and extra fluff packed into each annual installment, the simple act of finding lines and skating freestyle across the levels was great fun. Even with a handful of new tricks, simply skating around and grinding out huge lines only goes so far, especially when the levels are set up to make doing so incredibly easy. It's enough to make you think that maybe the series needs a year off to give it time to incorporate some dramatic new ideas that could revitalize the once-great franchise."}