{"ref": "https://www.gamespot.com/reviews/lethal-skies-elite-pilot-team-sw/1900-2868967/", "date": "May 17, 2006", "game_name": "Lethal Skies Elite Pilot: Team SW", "text": "Sammy's Lethal Skies Elite Pilot: Team SW has survived localization and emerges as an altogether impressive combat flight sim. The game was originally released in Japan sometime ago under the name Sidewinder F, though today it doesn't seem dated in the least. In fact, many aspects of its production stand firmly above its competition--games such as Ace Combat 04 and Top Gun--and its gameplay is both complex and fast-paced enough to compete with those high-profile games. Its offbeat premise also gives an interesting context to the missions--the developers took the opportunity to create some truly wicked scenarios. At first glance, Lethal Skies may seem like it's grounded relatively firmly in modern reality, but rest assured that it's anything but. The game's story presents a world torn asunder by global warming. The ice caps in Siberia have melted, and this has inundated much of the civilized world. New York City is all but submerged, with the Statue of Liberty wading waist-deep in the Atlantic--and Los Angeles consists of miles upon miles of floating hexagonal platforms upon which the city's been rebuilt. As you might imagine, a crazy political climate has set in. At the forefront of it all is a group called the World Reorganization Front (WORF), whose methods are heavy-handed and whose intentions are questionable, naturally. Opposing it is the International Alliance, which you can consider the good guys. It has a bunch of military might at its disposal, of which Team SW is among the greatest. You, as a member of this elite squadron, must take on WORF operatives on land, sea, and air to prevent its worldwide domination. Twenty missions comprise the Lethal Skies experience, though two of these are hidden missions that aren't integral to the way the game plays out. A variety of training modes round it out, and these include an array of basic exercises, a free flight mode, and even a dogfight simulator that lets you pit yourself against a team of enemy aircraft and determine the setting for the skirmish and the loadout for your jet. Weird premise aside, the missions themselves are fairly in tune with what you might expect from this sort of game--you'll go on a handful of escort missions mixed in with a whole lot of strikes and interceptions, all of them taking place in different locales. You'll start out flying over the submerged New York, though you'll soon enough find yourself in Southern Alaska, in the middle of the Pacific, and South America, among other places. The minute-to-minute gameplay is pretty intense. You have access to 13 aircraft, most of which are taken from real life, though there are a couple that the developers invented. You can arm them all as you see fit, but you have to take into account their capacities and hard-point arrangements. The battles in the game aren't quite as densely populated as what you'd see in Ace Combat 04, but due to the nature of the enemies you'll fight, as well as the environments in which you'll be fighting, they don't feel any less fantastical than in that game. The game's damage model is a bit more detailed than what you'd see in other flight combat games too. There are four systems that can be damaged individually, and these include your wings, engines, weapons systems, and fuel tank. Damage to a given system will result in a performance hit--if your weapon systems are damaged, it'll take you longer to lock on to targets, while if your fuel tank is mauled, you'll consume fuel at a much higher rate. Fuel plays a vital role in some missions, since logically, you can stay in the air only as long as fuel is in ready supply. Some scenarios will call for you to refuel, though, which will certainly bring back some harsh memories if you've been playing these sorts of games since the 8-bit days. Needless to say, midair refueling is pretty difficult, although mastering it is the only way to get through certain of the game's more challenging missions. Likewise with landings--some missions will call for you to touch down after completing your objectives, and it can get quite frustrating to have to replay an especially difficult scenario due only to botching a landing. Thankfully, some aspects of flight are automated for you, which is a big help. Chaff and flares, for instance, are automatically deployed whenever you need them, which basically guarantees that you'll use them quite frequently. The wingmen who join you on your sorties are similarly hands-off. You simply give them general orders prior to takeoff, and they enact them with surprising efficiency. Lethal Skies, in all respects, is a great-looking game. The planes are all exquisitely detailed, full of moving parts, and realistically reflect light and cast shadows. You can also admire them from a variety of views. Various special effects help make the experience more visually spectacular, including motion blurs, heat waves, and fogging--the standard stuff for this type of game, but no less impressive in this particular case. There's even an adjustable motion blur setting in the game's options menu, which, at its highest setting, makes the game look rather artistic but a bit less playable. It makes the end-of-mission replays look quite cool, though. The game's soundtrack consists largely of heavy rock guitars, with some spastic jungle beats thrown over the playbacks to mix things up. The sound effects themselves consist mostly of muffled wingman chatter and various types of explosions. The latter are nice and crisp, while the former are laughable half the time. Your mission control officer invites the entire squadron out for a drink after touchdown at the end of every mission, like clockwork. Despite that, Lethal Skies manages to be a whole lot of fun. Some of the missions it puts you on are wonderfully absurd--one has you flying around a volcano, and you'll take on enormous four-propeller flying battleships quite frequently. While its overall production isn't quite up to the level of Ace Combat 04, it's technically up to par, and its gameplay is distinctive and entertaining. So if you're into this type of game, then you really should check it out."}