{"ref": "https://www.gamespot.com/reviews/woody-woodpecker-racing-review/1900-2675438/", "date": "January 17, 2001", "game_name": "Woody Woodpecker Racing", "text": "For precisely two years, one month, and 29 days, the Game Boy Color had zero kart-racing games. None. In fact, other than Infogrames' Wacky Racers, no game even bothered to broach the genre - until now. In a genre of one game, Konami's Woody Woodpecker Racing is the system's finest kart racer. Featuring ten racers, four gameplay modes, 16 tracks, eight power-ups, a battery backup, and two-player link-cable match-ups, this game is also going to hold the top spot for a long time to come. The hallmark of a great kart game is twofold: diverse options and deep, underlying gameplay. Woody Woodpecker Racing fulfills on both counts. There are four game modes: extreme, grand prix, sprint, and time attack. The extreme and grand-prix selections are similar. In extreme, you're competing against five other races in elimination matches where the ultimate goal is first place, while in grand prix, your task is simply to acquire the most points by the end of competition. Both modes, be it extreme or grand prix, feature the same four areas, each with three progressively difficult cup contests, which in turn offer three races apiece. If you're doing the math, that's nine races per area, for a total of 36 races. As you win each cup, your grade points increase, which lets you upgrade your vehicle's engine, turbo, or tires, as well as a fourth character-specific special part, which you'll unlock during competition. The sprint and time-attack options aren't nearly as bloodthirsty as the extreme and grand-prix modes, but each lets you race for points or bragging rights. Initially, there are six characters to choose from, the four members of the Woodpecker family, Wally Walrus, and Smedley, but if you perform well in each of the game's four gameplay modes, you can unlock four additional racers: Chilly Willy, Ms. Meanie, Buzz Buzzard, and Dapper Denver Dooley. Once you've exhausted all single-player options, the game also supports head-to-head matches via the Game Boy Color's link port. As far as on-track gameplay is concerned, Woody Woodpecker Racing is altogether fun, varied, and challenging. Each race pits you against five other opponents, a few of which have cars that are better equipped than your own. To even the odds, every track has a number of zipper and power-up pads to speed you along and further your cause. Oil slicks, bombs, rockets, homing missiles, turbo boosts, bunny hops, roadblocks, and invincibility options are available to both you and your opponents. This is where the game gets interesting. Finding the best route through the turns, hills, and traps of each course is your main strategy, but along with this comes the responsibility of battling your opponents for the right to hold first place. Thus, powersliding, leaping over obstacles, and assaulting the competition go hand in hand with victory. The overall flow of the game is a bit on the slow side, but menacing AI, plentiful power-ups, and loose handling more than give Woody Woodpecker Racing the excitement needed to satisfy hungry kart fans. Woody Woodpecker Racing looks as nice as it plays. Konami didn't undertake this one halfheartedly . The game is presented from a three-quarters isometric viewpoint that serves to open things up, and this better portrays the license's wacky personality. Backgrounds are colorful, but not overdone, with sandy jumps, water traps, and trackside buildings providing just the right amount of geographical interference. As stated previously, there are ten characters to choose from, the physical representation of which is twofold. First, thanks to their oversized, superdeformed noggins, racers are clearly identifiable while seated in their cars. Woody's scarf, Chilly Willy's fuzzy hat, and Ms. Meany's huge nose are just a few of the major details you'll find, in addition to the blinking eyes and flailing hands you'll encounter whenever a speed boost, jump, or crash occurs. Secondly, an animated portrait at the bottom of the screen represents the driver you've chosen. If you're performing well during the race, it will wink and smile. However, if you're lagging behind, it will grimace and frown. The game could better tax the Game Boy Color's graphical capabilities, but Konami has struck a fitting balance between personality and visibility nonetheless. There are different musical selections for each track, most of which are as upbeat and whimsical as what you'd find in a typical Woody Woodpecker cartoon. Various power-ups, such as the invincibility, turbo boost, and roadblock items, also affect the music somewhat, speeding it up or slowing it down as appropriate. Sound effects aren't plentiful, but a decent mix of collision, crash, and weapon effects help break the monotony of a constantly revving engine. Frankly, you'll probably never even notice the game's music or sound effects anyway, because you'll be too busy fending off Buzz Buzzard. Amazing. It took roughly three years for a company to bring kart-style racing to the Game Boy Color, and it isn't Nintendo but Konami who has done it. If you're looking for clever courses, brutal power-ups, and plenty of replay, look no further than Woody Woodpecker Racing."}