{"ref": "https://www.gamespot.com/reviews/tom-clancys-splinter-cell-double-agent-review/1900-6162623/", "date": "June 25, 2007", "game_name": "Tom Clancy's Splinter Cell: Double Agent", "text": "Gruff, tireless Agent Sam Fisher and his top-secret missions in all the Splinter Cell games have helped to popularize a style of play that blends a lot of sneaking around with quick, short doses of extreme force. Unfortunately for Nintendo fans, these games routinely lost most of their good qualities in translation to the GameCube--and, in spite of having a chance at a fresh start, Double Agent for the Wii does little to buck the bad trend. This version of Splinter Cell Double Agent features an unusual control scheme that's certainly different. But the graphics are disappointing, looking nowhere near as good as the Xbox version, though at least a little better than the PlayStation 2 version. Double Agent for the Wii is also missing those versions' competitive multiplayer mode. But it does include the same content apart from that, which happens to be different from the versions of Double Agent for the Xbox 360 and PC. At any rate, the Wii version isn't the best, or even the second- or third-best, version of the game available, and its control scheme is quite complicated in spite of the pick-up-and-play pretenses of the Wii Remote. However, there's a certain novelty and added level of challenge to the controls that may appeal to Splinter Cell fans. Double Agent for the Wii doesn't look so hot, but its weird new control scheme has a few nice touches to it. Other than the technical differences and missing features, Double Agent for the Wii is the same game as Double Agent on the PlayStation 2. You play as Sam Fisher as he tries to infiltrate a terrorist organization to find out what makes it tick, which is the same as on the Xbox 360 and PC. But the missions in the other versions of the game are completely different from the missions in the Xbox 360 and PC games. The story is told differently and somewhat better, but none of the gameplay changes in the Xbox 360 or PC versions are in here. This game holds over a lot of the good-looking animations from its predecessors, but there's not much nice to say about the graphics beyond that similarity. Noticeable seams mar the low-resolution textures in the environments, many characters don't move their lips when they speak, and even Sam Fisher himself doesn't look quite right. At least this version of Double Agent still sounds great, despite a lot of recycled sound effects from older games. Michael Ironside again provides Fisher his distinctive voice, plus many more lines of dialogue than in Double Agent's Xbox 360 and PC counterpart. The game has also got a musical score that epitomizes this type of spy thriller. The Splinter Cell series has grown increasingly complicated to play over the years, what with all of the different moves and gadgets available to Agent Fisher at any given time. Double Agent for the Wii takes all of this and tries to cram it into the Wii Remote and Nunchuk attachment, resulting in a control scheme that's a hybrid of console-style gamepad controls and the mouse-and-keyboard controls featured in the PC version of the game. The Wii Remote is used for rotating the camera perspective in any direction around Sam Fisher, which is done by pointing the onscreen cursor toward the edges of the screen. You can also interact with the environment and fire your gun using the A and B buttons, while the D pad is used for your different vision modes, readying your weapon, and digging through your inventory. Meanwhile, the analog stick on the Nunchuk makes you move in different directions, and a quick flick of the attachment makes you jump or pull yourself up onto a ledge. Provided you already have a feel for how Splinter Cell games work, getting used to this new control scheme doesn't take too long, though you'll also quickly spot some of its weaknesses. For one, when rotating the camera perspective, there's a fine line between pointing at the edges of the screen and pointing off the screen entirely. Natural attempts to make the view rotate faster by pointing further off to the side will simply cause your view to stop rotating altogether, which can be frustrating, especially if you get caught in a firefight. For another, aiming and shooting in this version of Double Agent is significantly tougher than in other versions of the game. Agent Fisher has always needed to stand perfectly still to be able to aim accurately, but now that aiming is controlled using the Wii Remote, you'll need a very steady hand to get him to stop moving and steady his own aim. So you'll wind up having to spend more time carefully lining up your shots using these controls than you would using a dual-analog gamepad or a mouse. This makes this version somewhat harder than its counterparts on other platforms, but not in a good way, since it shouldn't be so difficult for a seasoned soldier like Fisher to just point and shoot at somebody. The controls here are a case of ~different~ not necessarily being ~better,~ and perhaps that's only to be expected considering the gameplay of the Splinter Cell series was not originally created with the Wii in mind. Numerous two-player cooperative missions are available to give this game more lasting value. If you've played past versions of Splinter Cell, you'll find that this one is basically very similar once you get past the controls. Despite a new look to the onscreen interface and the ability to work with computer-controlled allies in a few sequences, the underlying gameplay in the solo campaign is nearly identical to that of last year's Splinter Cell Chaos Theory. This means you'll be spending most of your time skulking through shadows, sneaking up on foes and putting them in a vice grip, or using either lethal or nonlethal close-combat attacks to take them out of commission. As previously mentioned, Fisher must stand perfectly still for his aim to be true, preventing this from being a run-and-gun style of game. However, it can still be satisfying to squeeze off single, silenced shots to down unsuspecting enemies from afar. Fisher will also do plenty of climbing and crawling through this game's complex, multistory environments. And while you get to decide whether to sneak past foes, knock them out, or do them in--and also whether to take on various optional objectives--ultimately, the solo missions are linear in nature. So Double Agent's mission design really is quite similar to that of the last Splinter Cell game. It also recycles the same animations and sound effects, creating a similar overall presentation. The game does have a different feel than its predecessors, though. Occasionally, you'll be forced to make a moral choice of some sort, such as early on when you've got a chance to kill a man that one of your terrorist ~friends~ wants dead. This comes down to a button press, and the consequences aren't usually significant, but it can still be fun to play through sequences multiple times to see how the mission objectives finally pan out. There are also three different difficulty settings to choose from, and even at the normal setting, the level of challenge is significant. You can save your progress at any time, which you'll want to do because you'll need to sneak past dozens of accurate, deadly foes in any given mission. Enemy behavior isn't terribly complex, but enemies use cover well and their bullets hurt a lot. Sometimes enemy resistance is so dense that Double Agent feels more like trial and error, but usually you have a variety of options for dealing with enemies or navigating the levels. So when the going gets tough, you'll sooner just rethink your strategy than get frustrated. Expect to put in a good 10 hours or so before you reach Double Agent's conclusion, which will be affected by some of the key choices you make. If you've had your fill of the solo missions, Splinter Cell Double Agent offers a complete set of two-player cooperative missions. The co-op missions hearken back to the compelling but underdeveloped co-op gameplay that was introduced in Chaos Theory; on the Xbox 360 and PC, the co-op missions are just a multiplayer variant against computer-controlled opponents. This means you'll undertake story-driven missions from the perspective of other agents in the employ of Third Echelon, which is the same organization that pays Fisher's bills. These missions tend to be loosely related to the solo campaign and add an interesting layer to the story. Since it's harder than ever to shoot the bad guys, this version of Splinter Cell Double Agent puts a premium on taking a stealthy approach. Additionally, you and your partner will get to use a variety of double-team moves, such as using one another as a human ladder. Some cool new co-op moves are also in here, such as the ability to cooperatively interrogate foes for when a little intimidation is not enough. The co-op missions still feel rough around the edges, because it's possible for both players to instantly fail if just one player makes a wrong step off a ledge, for instance. But this mode can still be fun, and it's also worth noting that there are nearly four times more co-op missions here than were bundled with Chaos Theory. Only the Xbox version features cooperative play online, which is another reason the Xbox version is definitely the one to get (at least of the old console versions) if you have the choice. One issue with the Wii version is that you're limited to just one save slot for both the solo campaign and the co-op missions, so if you save during co-op play, it overwrites your single-player save, which can be annoying. But at least you can save at any time. Splinter Cell Double Agent for the Wii doesn't get enough mileage out of the novelty of its controls. The idea of a simpler, more intuitive Splinter Cell game that takes advantage of the point-and-shoot nature of the Wii Remote sounds very tempting, but that's not what you get here. You do get a very challenging spy game suitable for cooperative play, but if you're looking for a complicated challenge, then the Wii probably isn't your only game system, which means you could be playing a better version of this game instead. Earlier this year, publisher Ubisoft confirmed that the next installment in the Splinter Cell series is being developed exclusively for the Xbox 360 and PC, which means Splinter Cell Double Agent for the Wii is probably the first and last time we'll get to see Agent Fisher on Nintendo's new console. Considering his shaky track record with Nintendo during the past several years, maybe that's for the best."}