{"ref": "https://www.gamespot.com/reviews/rogue-warrior-review/1900-6241882/", "date": "December 2, 2009", "game_name": "Rogue Warrior", "text": "In Rogue Warrior, lead character Dick ~Demo Dick~ Marcinko (based on the real-life ex-Navy SEAL, and voiced by actor Mickey Rourke) doesn't just drop an F-bomb--he drops an entire nuclear warhead of repulsive language that would make even the most world-wise among us reach for a set of earplugs. As depicted in developer Rebellion's newest first-person shooter, Marcinko is a shallow, potty-mouthed antihero without a single redeeming quality. Unfortunately, the appalling dialogue seems to have inspired Rogue Warrior's gameplay, which is characterized by useless stealth mechanics, inconsistent hit detection, incredibly linear level design, and abysmal AI. Yet the boring, one-dimensional gameplay and terrible dialogue aren't the game's most insulting blemishes; that prize belongs to Rogue Warrior's total lack of value. You can finish it in just over two hours, and the stripped multiplayer consists only of deathmatch and team deathmatch, yet publisher Bethesda Softworks is asking full price. Don't be a sucker: Steer clear of this garbage. $%@% my %@*!$, my big hairy %@*!$, wrap them !*%$@ your %*^*#. You'll at least sniff one sweet smell amid the stench--that of Rogue Warrior's momentarily satisfying close-quarters kills. If you get close enough to your enemy (not exactly difficult considering the putrid AI), you can plunge your knife into his back, snap his neck, or smash his head into the wall. The thrill dissipates quickly, however. Every level is linear, and opportunities to sneak up behind your Communist foes are laid out in a predictable manner. There may be three or four enemies milling about at a time, all placed in such a way as to make it a cinch to sneak up behind them and play grim reaper. These easy stealth opportunities are further simplified by the morons you assassinate, who appear to have no peripheral vision and won't notice you creeping up on them from the most obvious angles. They also appear to be near-deaf; they won't react to the cries of their nearby comrades as you dump them over a railing, and they won't notice the sound of your footsteps, even if you're sprinting at full speed. Perhaps the shallow stealth mechanics would be easier to stomach if the shooting were fun, but Rogue Warrior is easy, boring, and predictable. Every firefight occurs in much the same way: You wander down a corridor, encounter three or four enemies, and shoot them. Sometimes your foes barge through a door, drive up in a truck and jump out, or break through a skylight and slide down grapple lines, but this always happens right in front of you, and opponents are generally happy to remain in your line of fire. With few exceptions, AI enemies won't attempt to flank you, won't react to getting shot once they are behind cover, and won't run from the grenades you toss--and they'll throw their own grenades at each other and shoot the exploding barrels that stand right next to their teammates. In your adversaries' defense, however, the levels don't give them many opportunities to flank. While there are some medium-sized warehouses and other somewhat open environments, the path to your next objective is always a straight line. There are no alternate routes and no hidden rooms to explore, and the only door that will open is the one you are meant to charge through. Rogue Warrior only has one direction (forward), one speed (slow), and one intelligence level (stupid). Rogue Warrior tries to mix things up with a few other elements, such as lights you can shoot out to darken rooms, night-vision goggles, and a basic cover system, but these elements seem out of place and make the game feel like a poor man's Rainbow Six. Once Dick is behind cover, you view him from a third-person perspective; you can peek above or to the sides to shoot targets or even fire blindly if you so desire. But while the cover system works well enough, it's ultimately unnecessary in light of the game's slow, straightforward pace. And enemies are too easy to kill to make shooting out a light or using night vision worthwhile. Yet Rogue Warrior doesn't even get the straight-up action right. The hit detection is all but broken. You might kill a Russian soldier with a few shots to the knee, but others may survive what seem to be six or seven obvious headshots. Bad animations further diminish the quality of the gunplay, because there's little sense of impact when your bullets hit their mark. Your Communist foes sometimes stagger and then regain their composure when under fire, but sometimes you can unleash a barrage on them without getting any kind of physical reaction. Drop this %$%^#$%%$#@* you *%^$*#@ amateurs. While your Korean and Russian rivals don't seem particularly troubled by being filled with lead, Dick himself is never afraid to express his dissatisfaction. The mix-and-match obscenities he spouts while under fire would almost be funny if they weren't so obviously meant to be taken seriously. Sadly, you hear a lot more about Dick's genitalia and aversion to Commies than you do about the story, which occurs during the height of the Cold War and follows North Korea's sale of nukes to the USSR. You'll fight in hedge mazes during a heavy snowfall, in a hydroelectric dam, and at a shipping dockyard, and some nice lighting gives some of these locales a touch of atmosphere. Otherwise, plain textures, jittery animations, and heavy aliasing make Rogue Warrior look bland and dated. So what's there to do once your two hours are up and the credits roll? Well, you could check out Rogue Warrior's stripped suite of multiplayer options, which let up to eight players shoot each other up in deathmatch or team deathmatch. But that's it. There are no other modes, no persistent rewards (unless you count the all-but-empty online leaderboards), no classes, no customizable loadouts--and no fun. There's nothing to draw you back in, making Rogue Warrior a waste of time and money. If for any reason you still feel compelled to check it out, consider this: Dick's atrocious lines were mixed into a rap that plays during the end credits. It's a summary of everything that makes Rogue Warrior so excruciating to play, condensed into a three-minute song."}