{"ref": "https://www.gamespot.com/reviews/top-gun-combat-zones-review/1900-2821315/", "date": "May 17, 2006", "game_name": "Top Gun: Combat Zones", "text": "Despite the Paramount license, Top Gun: Combat Zones from Titus Software bears little resemblance to the 1986 blockbuster film Top Gun. Although Maverick apparently owns the default Top Gun: Combat Zones high scores, don't expect to hear ~I feel the need...the need for speed!~ or ~You've Lost That Loving Feeling~ during gameplay. Like the movie's flight sequences, Top Gun: Combat Zones is pure air-to-air and air-to-ground action. But it's a shame that more wasn't done with the movie's license. Top Gun: Combat Zones delivers occasionally nail-biting target practice gameplay but lacks the storyline and character details that make Namco's Ace Combat 04: Shattered Skies a much more engrossing game.Top Gun: Combat Zones' linear mission structure unfolds as a series of loosely connected skirmishes that have more in common with the randomness of an instant action mode than the movie's storyline--or any other storyline for that matter. A faceless commander presents each mission briefing along with the nondescript mission topography. Apart from minor carryover, like similar objectives used across consecutive missions, there's no sign of an underlying story to patch each mission together. A scoring table serves as the only bridge connecting missions, and unlocking new aircraft and instant action gameplay modes becomes your sole goal (unless you're gunning for Maverick's high score record). More than 30 missions are offered through three different eras and four locations, including Southeast Asia, the Persian Gulf, the Arctic, and the United States--though a hefty chunk of the playable missions are mandatory academy--otherwise known as training--missions. Objectives generally fall into one of four categories: blow up air units, blow up ground units, blow up sea units, or blow up air, ground, and sea units. The number and type of equipped weapons--including air-to-air missiles, air-to-ground missiles, dumb fire rockets, and bombs--are predetermined before each mission. Success in most missions relies heavily on weapon management. Waste too many air-to-ground missiles on stationary targets that are easily eliminated with your infinitely stocked autocannon, and the mission's difficulty increases substantially.You begin the game with a single available aircraft, the F-14 Tomcat. The game's remaining playable craft remain stashed away in symbolic crates waiting to be cracked open once you reach the next era or accomplish a particular goal. The F-18 Hornet and F-22 Raptor are unlocked at the start of the second and third era respectively, and five additional bonus craft--the F-4 Phantom, JSF, YF-23, Osprey, and Harrier-- remain locked until you've completed the game or reached certain scoring goals. Other than differences in terrain height, color, and time of day, there's very little to differentiate one mission from the next, and the lack of a cohesive storyline hinders any urge to press relentlessly through the game. Each mission offers dozens of air or ground targets to destroy, and some missions add friendly craft to escort or protect. Sorties take place within a confined area, and neglecting to remain in that area ends the mission in failure. In fact, some objectives are placed near a mission's outer boundaries. Misjudge the turn or approach the objective from the wrong angle, and you may maneuver precariously close to the mission's edge or cross the line entirely prematurely, ending the mission.Top Gun: Combat Zones doesn't feature an in-game save and instead updates an autosave upon completion of each mission. Missions are also timed, which poses further problems or frustrations depending on your level of patience. Though limiting mission time is not unexpected in an arcade combat shooter, the often long, drawn-out battles against air and ground units seem more suited for a game unrestricted by time. Hostile ground targets, such as gunboats and antiair emplacements, are capable of inflicting serious damage in just a couple of seconds. You can't simply fly straight in against these targets and hope to survive. You must vary flight maneuvers when assaulting certain objects--the tactical requirements are commendable, but the need for tedious strafing runs means the mission timer always looms large. Instead of a tactical combat shooter, Top Gun: Combat Zones often becomes a race to beat the clock.Scoring goals further emphasizes arcade action over simulation. Scoring rewards are presented for hitting the enemy before the enemy hits you (referred to as ~First Blood~), avoiding damage, and cannon accuracy. There's even a combo system--register consecutive hits with your plane's autocannon to achieve multihit combos--as well as rewards for dangerous flying maneuvers, like low level combat against ground targets. Without story or simulation elements, missions closely resemble target practice. The lack of an ingenious, or even somewhat skilled, artificial intelligence amplifies the issue. For instance, enemy helicopters simply hover over areas they're designated to protect and wait patiently to be shot down like wooden carnival ducks. Top Gun: Combat Zones' environments offer greater detail than its one-dimensional inhabitants. The variation in terrain, including industrial, forest, desert, coastline, mountainous, and snow landscapes, as well as time of day keep the visuals interesting. The warm hues of a sunset, rolling hills, misty clouds, and the ever-present lens flare are all rendered adequately. The playable aircraft and other enemy units are also well constructed, but the game's explosions are particularly unimpressive and resemble toy plane models detonated by firecrackers. Also, the game's music eschews the nostalgic tunes of the movie's soundtrack for uninspired rock that should prompt a speedy trip to the volume options. Top Gun: Combat Zones is strictly arcade action without the bells and whistles of a story-based air combat simulation. A quick-start instant action mode, with the ability to adjust mission location, game type, and threat level, offers limited replayability, and despite changes in terrain color and difficulty level, instant action presents little variation. Couple limited instant action options with no competitive or cooperative multiplayer modes, and Top Gun: Combat Zones lacks the value and longevity of better games in its field."}