{"ref": "https://www.gamespot.com/reviews/wizardry-8-review/1900-2829103/", "date": "November 30, 2001", "game_name": "Wizardry 8", "text": "Sirtech's latest and probably last role-playing game, Wizardry 8, has been in some form of development for more than four years. During that time, the developer not only lost its regular US publisher, but also went through numerous development changes and finally saw the light of day by means of a direct-distribution deal with retailer Electronics Boutique. If you consider all the difficulties that Sirtech has had bringing the game to market, you'll probably agree that creating a game of Wizardry 8's size, technical stability, and overall quality is truly a remarkable achievement. But you don't need a history lesson on the game's difficult development to appreciate Wizardry 8, because it's a solid, deep, and enjoyable RPG in its own right. The thing you'll notice first about Wizardry 8 is its appearance. Surprisingly enough, it actually looks quite good. Wizardry 8 is the first game with 3D polygonal graphics that Sirtech has ever developed, but you wouldn't know that by looking at the game. Take a quick glance, and you might be put off by the game's character portraits, which have the same sort of quirky, low-resolution look as the portraits in Sirtech's Jagged Alliance strategy games. But aside from the character portraits and much of the game's interface, all of Wizardry 8's graphics are 3D, and they all look quite good. For instance, the game's monsters and onscreen characters are represented by large, healthy-looking 3D models. These models may not be exceptionally detailed, but they're designed well, animated well, and certainly more than adequate. The same can be said for Wizardry 8's environments; though some parts of the game, particularly outdoor zones, tend to look rather blocky, they're all textured simply but cleanly and all do an excellent job of looking like distinct areas, including stony dungeons, treetop cities, and open roads. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Wizardry 8 Video Review Wizardry 8 also sounds good. Both the game's music and sound effects are generally subdued but certainly appropriate. While you explore the game's world, you'll hear ambient music and sound that are decent enough, and when your stalwart band of adventurers fights a group of enemies, you'll hear the swinging of weapons and the casting of magic spells, as well as a lot of commentary from your own party members. Wizardry 8's voice acting is consistently good and often quite funny. Both the characters in your party and the nonplayer characters you'll meet are portrayed by the same actors who provided the voice work for Sirtech's Jagged Alliance strategy series. So you can create a party of mild-mannered characters who speak in typical high-fantasy prose, or, if you prefer, you can create a group that speaks with spirited Italian, French, or British accents. In any case, you'll find that the game's voice acting will grow on you and that it adds a great deal of personality to the game. When you actually start playing the game, you'll find that Wizardry 8 builds upon the previous games in the series, but you won't need to have played any of them to get a good idea of how the game works. As with the other games in the series, you'll begin with a party of up to six characters you create yourself (or import from Wizardry VII) and explore the game's different areas with a first-person view. And just like Wizardry VII, Wizardry 8 lets you create a party of characters from a variety of playable races, including humans, elves, dwarves, and more fanciful races, such as faeries and lizardmen. You can choose from 15 different character classes--including the series' more-advanced prestige classes, such as the lord, samurai, and bishop--from the get-go. It's safe to say that you'll probably want to experiment with several of the game's interesting character professions, and like the other games in the series, Wizardry 8 will let you change your characters' classes, so you won't necessarily be stuck with the same characters throughout the entire game. You'll have plenty of time to change your characters' classes--and do lots of other interesting things--in Wizardry 8. The game's base install size of 1.2GB hard drive space (1.8GB for a full install) is a pretty good indication that the game is long--at least 70 hours, if not more. Over the course of the game, your adventurers will fight lots of different enemies, gain experience levels, acquire powerful new weapons and armor, and meet interesting characters to recruit into their party. You'll also find numerous optional subquests and secrets that you can discover independent of the game's main story. Wizardry 8's setting and story are also interesting enough; the game's story actually follows the events of Wizardry VII: Crusaders of the Dark Savant, a game that featured both traditional high-fantasy sorcery and advanced futuristic technology. You'll see many examples of this sort of technology--such as spaceships, hologram images, and androids--and though it may initially seem strange, even objectionable if you're a high-fantasy purist, it's consistent throughout the game and largely inoffensive. Technology is especially prevalent on the planet of Dominus--on which your party is marooned--because it's been invaded by the mysterious and technologically advanced villain of Wizardry VII, the Dark Savant. It seems that the Savant has seized an ancient treasure and is seeking to reunite it with another similarly powerful artifact to become all-powerful, and it's up to your party to find that artifact first. Wizardry 8's story isn't especially deep, but it's more than enough to keep you exploring and hacking and slashing your way through the game. You'll do a lot of hacking and slashing through fights with monsters and enemy characters in Wizardry 8. Though the game features a combat system reminiscent of classic first-person RPGs, it works surprisingly well. You can set your party's battle formations (by default, the first half of your party will be in the front lines, and the other half will be in the back row) and do battle with monsters that appear in groups. Though you'll find it's slow going at first, Wizardry 8 actually has a good variety of monsters with different abilities. Many of them will use simple but effective strategies, like surrounding your party to get at the rear ranks or blocking off your party from the front to defend their own archers or wizards. Wizardry 8 features a turn-based combat system (as well as an optional but less-useful continuous combat option) that's based intuitively on character speed and initiative. Since the game uses a first-person perspective at all times (you can't actually see your party members), fights may not seem all that impressive at first, since you'll simply be staring at the polygonal monsters you're engaged with and watching them move about, attack, and flinch when damaged. In fights against big groups of monsters, combat can drag on longer than it should, since monsters will often spend inordinate amounts of time repositioning themselves, sometimes behind an obstacle or corner, which will remove them from the fight so that you'll have to chase them down later. But Wizardry 8's combat becomes much more interesting once your party becomes powerful enough to deal damaging melee attacks and devastating magic spells that affect entire groups of monsters. In fact, developing your characters by increasing their skills and experience levels is one of the most enjoyable things about Wizardry 8, if not the most enjoyable. Each of the game's character classes becomes noticeably more powerful as they gain experience levels; fighters will gain additional attacks; monks, ninjas, rangers, and samurai will perform lethal critical hits; and mages can rain fireballs and nuclear strikes on their enemies' heads. Wizardry 8 also features a skill system that resembles that of online RPGs such as EverQuest and Asheron's Call; you can increase your character's skill by either spending skill points (which you gain each level) or by using that skill repeatedly. And each time a character gains a level, it'll gain more statistics points, such as strength, intelligence, and dexterity; and once a character reaches extremely high statistics, it'll gain access to even more powerful high-level skills, like power-casting magic spells or armor-piercing power-strike melee attacks. All these things basically mean that each time you win a fight, you'll often see members of your party increase in skills, often in multiple skills. Wizardry 8 gives you lots of visual indicators that your characters are growing stronger with each fight. As with previous games in the series, it can be extremely satisfying to watch your humble party of beginners grow into a group of highly skilled powerhouses. Though Wizardry 8 allows you some freedom to explore the game's world and meet its inhabitants, the most compelling reason to replay the game after you've completed it is to create a new party of different characters and develop their high-level abilities and skills. 2001 hasn't been a very strong year for PC role-playing games, and it's more than a little ironic that the best single-player RPG this year is also probably the last game that Sirtech will ever produce. The original Wizardry game was one of the first great RPGs ever to appear on a computer, and both Sirtech and the Wizardry series have been around for about 20 years. However, if Wizardry 8 truly is the last game in the series proper, its engaging and addictive gameplay and surprisingly good graphics and sound make it a worthy finale to the Wizardry series, as well as an excellent RPG in and of itself."}