{"ref": "https://www.gamespot.com/reviews/shadow-of-destiny-review/1900-2694612/", "date": "May 17, 2006", "game_name": "Shadow of Destiny", "text": "Death comes to us all--especially in video games. It's one of those things gamers have come to expect. The gameplay of most titles has acclimated players to a painless cycle of dying and restoring. The consequences of ~dying~ are little more than continuing from where you left off or reloading the last save state. Konami's innovative time travel adventure, Shadow of Destiny, handles things differently. The protagonist, Eike Kusch, has only a single life. And someone--or something--is trying to take it from him. The game begins with Eike leaving a small European caf and walking down the street. An unknown assailant stabs him in the back without warning and vanishes, leaving Eike to twitch and die in the street. Though this is hardly a pleasant way to start the game, Eike is fortunate enough to have supernatural intervention on his side. A mysterious being known as the Homunculus returns him to life for reasons unknown. Eike is given a helpful time-traveling device called a digipad and sent back to the moments just before his death. Armed with this help, he must outwit the many deaths in store for him. The game is divided into 10 chapters--eight full chapters, plus a prologue and an epilogue. Each chapter usually begins with Eike meeting his demise and being restored by the Homunculus--as long as Eike perishes in the present day, the Homunculus can give him another chance. The chapter starts anew--but this time, Eike knows how he will die. Equipped with this knowledge, he travels through time, speaking to people and gathering items to try to outwit his death before ~the fated hour.~ Time passes simultaneously in the past and present; if you spend six minutes exploring the medieval era before returning to your own time, you'll come back six minutes after you first left. This adds a constant sense of urgency to each of the chapters. Once Eike survives past ~the fated hour,~ the next chapter begins, and a new death must be avoided. Shadow of Destiny is a pure adventure game that relies on the strength of its dialogue- and inventory-based puzzles. The title contains very little ~action~ per se; Eike lacks any sort of life bar and has no means of attack. Solving the mysteries will take quick thinking and judicious use of the digipad. During the prologue, for example, Eike is stabbed in an empty town square. He can use the digipad to travel an hour back in time and spread rumors of a performer in the square at the time of his death, and when he returns to the present, the promised performer will be there, a protective crowd will have gathered, and the assassin will be thwarted--for now. As the Homunculus tells you, however, it's not enough to simply sidestep your death right before it occurs--avoiding one method of death will just leave Eike open to another potential end. Eike must uncover the fundamental cause behind his many deaths and the reason fate has it in for him on this particular day. The digipad responds to contextual triggers and opens up new time periods to explore. Solving the mystery means unraveling a tale that involves the 1580s, the early 1900s, 1980, and the present day. In a unique twist, Shadow of Destiny is a murder mystery where the detective is also the victim. Fortunately, Konami does not squander this original narrative conceit and has crafted a tale worthy of the title's epic scope. Gamers may be mildly disappointed in the story after a single play through the game, but it's likely they've only seen a small percentage of the overall story. There are five unique endings based on possible paths and decisions made during the game, so Shadow of Destiny must be played though multiple times. Each ending and path contains important plot revelations, and gamers who take the time to explore the title's many possibilities will be rewarded with an understanding of a complex conspiracy that spans four seemingly unrelated time periods. The game's short length (eight to 10 hours the first time through; about four or five on subsequent plays), the ability to bypass any previously viewed cutscene, and the option to replay the game from the saved data of a previously finished game all suggest the developers intended every gamer to play through multiple times.Playing through the game several times isn't boring, however, as replaying a time-travel game again differs from replaying a purely linear adventure. After all, the second time through, Eike will be armed with knowledge about his adventure and the ways he might die that will give him a distinct advantage. The savvy player can use this foreknowledge to prepare for certain deaths in advance and avoid others entirely. By doing so, new aspects of the plot and overall storyline are revealed--which can be leveraged to Eike's advantage the third time through, and so forth. Konami's designers have planned for almost every temporal contingency. By reexperiencing the day's events time and time again, Eike gradually changes from being a mere spectator buffeted by unknown forces to an active participant who takes control of his fate--and the fate of those around him. Graphically, Shadow of Memories isn't bad--though the quality of the components can vary wildly. The low-resolution graphics are initially jarring, but the resolution is offset partially by the extremely detailed environments. Rooms in houses are packed with unique furniture and artifacts. Moreover, Konami's programmers have made sure actions performed in the past affect the look of the present. Removing a seal from a building, for example, will lead to its modern-day absence. The town of Lebensbaum is somewhat ordinary, but it's brought to life by an excellent variety of color, weather, and day and night effects for the different time periods. The 1580s are bathed in rich earth tones, for example, while 1902 is rendered in stark shades of grey. The character models are excellent, especially the facial animations and lip-synching of dialogue. Eike's running animation, however, is stiff and jerky, and the camera angles used in interior sequences are atrocious. The overall effect presented by the game is of a decently stylized (if low-resolution) title with its share of both inspired and uneven moments. The sound fares much better. The voice acting is from the B-movie school that gamers have come to accept as the norm. Fortunately, none of the actors are bad enough to distract from the game too terribly, and several deliver their lines consistently well. The music fits each chapter and scene, setting the tone and accentuating the events in the storyline. At times, Shadow of Destiny can seem clunky and unwieldy, especially when compared with graphical powerhouses like The Bouncer and Zone of the Enders. But while it may not tax the PS2's Emotion Engine, the game has plenty of emotion all the same. The original structure and narrative make Shadow of Destiny well worth playing, despite its minor flaws. Gamers willing to invest the time required to unravel the title's mysteries will discover one of the PS2's most enjoyable games and one of the most original adventure games to grace a console.Playing through the game several times isn't boring, however, as replaying a time-travel game again differs from replaying a purely linear adventure. After all, the second time through, Eike will be armed with knowledge about his adventure and the ways he might die that will give him a distinct advantage. The savvy player can use this foreknowledge to prepare for certain deaths in advance and avoid others entirely. By doing so, new aspects of the plot and overall storyline are revealed--which can be leveraged to Eike's advantage the third time through, and so forth. Konami's designers have planned for almost every temporal contingency. By reexperiencing the day's events time and time again, Eike gradually changes from being a mere spectator buffeted by unknown forces to an active participant who takes control of his fate--and the fate of those around him. Graphically, Shadow of Memories isn't bad--though the quality of the components can vary wildly. The low-resolution graphics are initially jarring, but the resolution is offset partially by the extremely detailed environments. Rooms in houses are packed with unique furniture and artifacts. Moreover, Konami's programmers have made sure actions performed in the past affect the look of the present. Removing a seal from a building, for example, will lead to its modern-day absence. The town of Lebensbaum is somewhat ordinary, but it's brought to life by an excellent variety of color, weather, and day and night effects for the different time periods. The 1580s are bathed in rich earth tones, for example, while 1902 is rendered in stark shades of grey. The character models are excellent, especially the facial animations and lip-synching of dialogue. Eike's running animation, however, is stiff and jerky, and the camera angles used in interior sequences are atrocious. The overall effect presented by the game is of a decently stylized (if low-resolution) title with its share of both inspired and uneven moments. The sound fares much better. The voice acting is from the B-movie school that gamers have come to accept as the norm. Fortunately, none of the actors are bad enough to distract from the game too terribly, and several deliver their lines consistently well. The music fits each chapter and scene, setting the tone and accentuating the events in the storyline. At times, Shadow of Destiny can seem clunky and unwieldy, especially when compared with graphical powerhouses like The Bouncer and Zone of the Enders. But while it may not tax the PS2's Emotion Engine, the game has plenty of emotion all the same. The original structure and narrative make Shadow of Destiny well worth playing, despite its minor flaws. Gamers willing to invest the time required to unravel the title's mysteries will discover one of the PS2's most enjoyable games and one of the most original adventure games to grace a console."}