{"ref": "https://www.gamespot.com/reviews/vancouver-2010-the-official-video-game-of-the-olym/1900-6246426/", "date": "January 14, 2010", "game_name": "Vancouver 2010 - The Official Video Game of the Olympic Winter Games", "text": "The Winter Olympics are known for their collection of sports that only raise their head out of the snow once every four years. From the intense sweeping action of curling to the celestial tango of figure skating, families crowd around their glowing televisions to watch superniche athletes compete in these quadrennial events. In Vancouver 2010--the video game adaptation of this year's winter games--many of these uncommon sports have been removed, stripping away much of the novelty of the real Olympics. Curling and figure skating have been unceremoniously left out of the game--and don't get your hopes up for fast-paced international hockey either. The 14 included events are most notable for their lack of variety. There are seven ways in which you can race down a snow-covered mountain (skiing and snowboarding) and three ways to hurl yourself down a frozen chute (bobsledding, luge, and skeleton). This means you are left with only a few unique activities to take part in, which removes any sort of long-term appeal Vancouver 2010 might have offered. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Vancouver 2010 - The Official Video Game of the Olympic Winter Games Video Review At least most of the included events are well done, even if they do veer on the shallow side. The last Olympic video game, Beijing 2008, was plagued by an overload of events that forced players to frantically tap buttons--an activity that is the polar opposite of fun. That mindless control method is used only sparingly in Vancouver 2010, resulting in a much more enjoyable experience. The controls change little between skiing and snowboarding down a mountain, but they are responsive, so it can be fun to fly down an icy hill a few times. The problem is that there are only a few different courses (which change depending on the event), so you're forced to wind your way down the same path every time you replay the event. You only have to go down the hill a few times to memorize the layout, and after you know the exact route to take, there is little incentive to improve your time or play again. The bobsledding events are even more repetitive. Two-man bobsled, skeleton, and luge are all represented here, but they all control in almost exactly the same way and all take place on the same frozen water slide. It is certainly fun to careen down that slippery track the first few times--making sure you don't slam into the walls that hover dangerously close to your sled while zooming up as high on the banked curves as possible without flipping over--but once you've done it a couple times, there isn't any reason to go back. And that is the biggest problem with Vancouver 2010. Skiing, snowboarding, and bobsledding events all control well and are pretty fun at first, but there are only a few different courses to go through, which severely limits the replay value. With a whopping 10 out of the included 14 events essentially boiled down into two unique activities, the entire package ends up being skimpy and forgettable. The other four included events do inject a dose of variety, but they lack the fun of the racing activities. Ski Jump and Aerials, for instance, require players to tap a specific button at the right moment, but it takes only two or three practice runs before you master this technique. The 500-meter speed skating event forces players to frantically mash a button to maintain top speed, and though it requires a bit of skill to take corners at top speed, it's too tiring and repetitive to entertain for long. The 1,500-meter variety introduces a rhythm game mechanic for most of the race, but is too simple to make repeat runs entertaining. And that is the entirety of the included events. There is no score-based snowboarding competition, biathlon, or even the crazy mixed doubles luge. Even considering the reduced price of this game ($50), there is a dearth of content. The Olympic mode continues the theme of a stripped winter sports experience by offering a very bare-bones take on the spectacle. You compete in a series of one-off events--without any commentary or special visual touches to make the events mirror the television broadcasts--and are then thrust on a podium afterward to receive your medal. There are only 24 countries to choose from (compared to the more than 80 that will compete in the real games), and you can't even customize the appearance of your competitors. Furthermore, the events themselves are lacking in presentation, diminishing the thrill of striving for a gold medal. Weirdly enough, many events blast rock music while you're trying to focus, which clashes severely with the otherwise serene, wintry atmosphere. There is little incentive to play these events more than one time in Olympic mode, which is awfully strange. One would think that the Olympic mode would be a key aspect of an Olympic game, but it feels like an afterthought in Vancouver 2010. La Couve takes its latest victim. Thankfully, there is one mode in which to take solace in Vancouver 2010. Challenges let you take part in a variety of objective-based events that are the most interesting aspect of this game. Most of your goals involve tearing through an event as if you were a real life competitor, keeping your speed above a certain average in downhill skiing or taking corners perfectly in the luge, which forces you to master the intricacies of the courses and controls. However, there are a few objectives that seem flat-out game-y, sucking you out of the otherwise simulation atmosphere offered in the rest of the game. For instance, during one downhill skiing event, you must slam into snowmen to earn time bonuses, and in a snowboarding event, your controls are inexplicably reversed. Nevertheless, every one of these 30 challenges are fun, and it's rewarding trying to shave off a second or land a particularly difficult jump. It's a shame the rest of the game doesn't have the same care found in the Challenge mode because there is good deal of entertainment in these winter events. Because of the lack of variety among the events, the multiplayer mode has only a little bit more appeal than the standard single-player competitions. You can play online or off, with up to four players, and it is fun striving for the best time against your buddies. But like every other element of Vancouver 2010, the fun doesn't last long. With only a few unique events and even fewer courses to choose from, everything becomes stale soon after you start playing. Only the difficult Challenge mode is really interesting, but with only 30 challenges to take part in that too is only fun for so long. Although Vancouver 2010 is vastly improved from Beijing 2008, it is ultimately lacking in many key areas. It's still more fun to watch the real lugers do their thing than take part in this shallow digital representation."}