{"ref": "https://www.gamespot.com/reviews/aliens-fireteam-elite-suicide-squad/1900-6417719/", "date": "August 23, 2021", "game_name": "Aliens: Fireteam Elite", "text": "In the first real skirmish in Aliens: Fireteam Elite, you encounter more of the series' iconic Xenomorphs than in all of the films combined. This third-person shooter trades the slow tension of escaping one extraterrestrial predator for the chaos of trying to survive waves of hundreds at a time, instilling a different type of dread that the franchise has rarely balanced successfully. While not without its issues, Aliens: Fireteam Elite is a strong step towards realizing the potential in that approach, with a surprisingly deep progression system, consistently entertaining firefights, and engrossing presentation that keeps the action gripping throughout.Akin to squad-based shooters such as Left 4 Dead, Aliens: Fireteam Elite plays out over a series of acts which are part of larger chapters, and each one features new enemies and set pieces for your team of three colonial marines to tackle headfirst. The story leans heavily into iconography and tropes from classic Alien films, but its narrative is also influenced by modern entries such as Prometheus, directly referencing events from the divisive project. It doesn't add much to the overall lore of the series in its trajectory, nor does it potentially set up anything meaningful, but it is a nice touch for each chapter to feel like it has a significant place within the universe.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Aliens: Fireteam Elite Video ReviewThe third-person action is the foundation on which everything is built, though, and it's a strong one at that. Aliens: Fireteam Elite pulls generously from the pool of weapons available to Colonial Marines, with the recognizable pulse rifle just being the tip of the iceberg in terms of enjoyable weaponry you'll be able to wield. There are notable inclusions in every tier of weapon type, with powerful flamethrowers and enemy-seeking smart guns being desirable heavy weapons and a burst-shot hand cannon or sawn-off shotgun being notable in the sidearm category.Each weapon can be customized with three attachments, too, letting you enhance their effectiveness against stronger enemies while also imbuing them with unique abilities. One of my favorites would restore ammo straight into my magazine on successful precision kills, not only giving me some relief from the often-strict ammunition limits, but also letting me go on absolute rampages when my aim was on point. Attachments also contribute to your overall combat rating--a numerical value used to determine your offensive ability like those used in games such as Destiny--incentivizing you to routinely consult the merchant in the game's hub world and seek out hidden caches in each act to unlock more.Aliens: Fireteam Elite features five classes for you to choose from (four initially, with the final one unlocking once you've finished the game once), each of whom has their own active and passive abilities as well as loadout options. The standard Gunner class, for example, has access to one rifle slot and one CQC slot, letting you take a pulse rifle and shotgun into battle. The Tactician, on the other hand, can only use a smaller sidearm and CQC weapon, but has access to a deployable turret and shock grenade that is extremely effective at crowd control.You customize each class further using a perk system, with numerous modifiers unlocked as you level up its respective class. Unlike other conventional systems like this, Fireteam Elite seems to take inspiration from the inventory system from Resident Evil 4. You have a grid with a limited number of spaces where you can place new modifiers and perks, each of which has a distinct shape and size. Some modifiers need to be placed on particular sides of the grid in order to affect one of your active abilities, leading to further complexity when attempting to maximize the space you have effectively. It's a little strange at first, and compounded by the absence of a tutorial that breaks down some of the system's nuances. But once you've unlocked a reasonable amount of space, it is a crucial component of your overall progression, unlocking abilities and combinations that will be vital to success on higher difficulties.The sheer number of perks available helps this too, letting you completely redefine how a particular class works in between runs. This becomes crucial with higher difficulties, where your class benefits from a perk loadout that suits the types of enemies you're going to face. For example, Xenomorphs are weakest against fire, which makes the Tactician's turret more effective when equipped with its short-range flamethrower variation. On the other hand, the slower-firing but higher calibre rounds of its other variation make it more effective against slower-moving synthetics, forcing you to think carefully about your loadout choices on every run. Each of the classes can be altered in similar ways, redefining their active abilities with appropriate pros and cons to give them more depth than their standard archetypes suggest initially. This makes spending time with each individual class rewarding as you start tinkering them to be both fun to play and effective as part of your team.The ways in which your chosen weapons, selected classes, and equipped attachments affect gameplay is directly influenced by which enemies you're matched up with, and Aliens: Fireteam Elite has a deep pool of aliens and androids that it pulls from. Some are immediately familiar in terms of the archetypes they populate--the Prowler hides on ceilings and pins you down, while the Burster explodes into a puddle of acid blood when killed--but there are numerous others that all introduce new combat wrinkles to consider. The Drone (the same type of Xenomorph from both the original film and Alien: Isolation) emerges from vents and crawl spaces to do some quick damage before disappearing again, making it a consistent threat unless you manage to kill it before it retreats and gets ready for another surprise attack. Heavily-armored synthetics will force you to engage with cover mechanics and chest-high walls in a way that fast-rushing Xenomorphs don't, challenging you to break from your established muscle memory. Aliens: Fireteam Elite uses enemy sizes and skill sets to constantly keep you adapting to their respective threats, never letting you get comfortable by ensuring you can be attacked from the ceilings, small crawl spaces, or directly ahead in equal measure.Also available for purchase are consumables that can be used once during any run, which include sentries with limited ammunition, an assortment of elemental mines, and useful recon drones that buff damage inflicted on enemies they mark. Perhaps one of the most useful consumables are challenge cards, which can be activated before a run to change up how it plays out. These can make things easier, like giving you double the health or more ammunition, but the most interesting ones are those that change the ruleset and increase the probability of failure in return for drastic money and experience boosts. Some memorable ones included a card that constantly introduced a Drone into the mix, meaning my team was always hunted by a strong and deadly foe at the worst possible times. Another turned all regular enemies into exploding variants, while another reduced regular damage by a third but tripled weak point damage. Each of these changes the way you approach a particular act and shakes up the gameplay in fun and tangible ways, making otherwise routine motions through a level feel fresh again.This is particularly welcome in the face of the objectives in each level boiling down to the same structure, which does become stale rather quickly. Each stage is a linear path from one big ambush section to the next, peppering the route with some exciting engagements against pockets of enemies. But the indicators of your progression through a stage never really change; once you reach an area with an ammo box and some spare health packs you know you're about to dig in deep and defend your position for a bit, with each level usually containing two or three of these sections throughout. This further dilutes the Horde mode that is only unlocked once you've finished the story campaign, given that it's just a distillation of the same objective you've already been repeating to get there. There are sparse exceptions to this rule, especially the final climatic escape, which dials up the Alien horror as far as it goes in-game, but if you aren't playing around with challenge cards or plunging into harder difficulties, the level design of each stage doesn't do enough to keep things that exciting.While it may lack in mission design, each act does deliver in terms of its outstanding visual presentation. Each takes place in a new area, which slowly evolves over time as you make your way through it. The game is steeped in familiar iconography and eye-catching details, from the grossly wet hallways of a Xenomorph hive to the dirty but opulent control rooms of an Engineer station. Lighting does a great job of highlighting the attention to authenticity in these areas, while also creating numerous pockets of darkness for threats to hide in, making tracking incoming Xenomorphs suitably tense. Weapons also stand out in terms of how they brighten up each scene with their deadly ordinance, with the searing flames of the flamethrower being a particularly good example of this. The blinding heat of the devastating weapon is a sight to behold, accompanied by the satisfying screeches of the enemies burning to a crisp in its wake. It's all so faithful to some of the franchise's most memorable film setpieces, grounding the action within the franchise even if its pace couldn't be further from it.Playing alone sadly does a disservice to the entire experience, while also diminishing many of the strategic and dynamic elements of Fireteam Elite. With other players, you're consistently making calls and pinging dangerous enemies, while also composing your team carefully for the challenge ahead. Alone, you're just playing with two AI bots, who are competent at best when it comes to aiding you. They're generally good at reviving you should you go down or drawing some attention from the hordes of Xenomorphs, but they don't have the ability to intelligently synergize with your chosen class's abilities when it matters, which makes higher difficulties almost impossible. Aliens: Fireteam Elite acknowledges this when choosing anything above its regularly difficult, recommending player-controlled teammates over the bots, which severely limits replayability if you're wanting to go at it solo.Despite what its reduced price might suggest, there's a lot here to keep you entertained for numerous hours, especially once you've managed your first run through all four acts and start tackling them again with higher difficulty settings in the pursuit of consistently better gear. There's so much satisfaction in customizing and managing a handful of classes with enough depth to transform them into the Colonial Marine you need at a given time, along with a plethora of great weapons to make the moment-to-moment action engaging from the first time you pull the trigger. What it lacks in dread it makes up for in pure white-knuckle action, making Aliens: Fireteam Elite a great place to engage with this iconic sci-fi franchise again."}