{"ref": "https://www.gamespot.com/reviews/lichdom-battlemage-review/1900-6415873/", "date": "September 16, 2014", "game_name": "Lichdom: Battlemage", "text": "The song you hear calling from the center of Lichdom: Battlemage is one of ice and fire. A chorus chants from within, urging you to chill your personal demons with the ray of frost you blast from your fingertips, and to burn them with showers of brimstone. Elemental powers arent the only ones you command in this magic-driven action game, but they are the two that define the initial hours of Lichdoms overlong campaign, which hobbles to a close long after it milks the joy out of its excellent but single-minded combat.Lets return, however, to those initial hours. Lichdom: Battlemage is built around the most satisfying spellcasting this side of Kingdoms of Amalur, and its this one system that drives the adventure from beginning to end. There is no mana bar obstructing your access to deadly magic. The only cooldowns you need consider are the intrinsic casting times of the spells themselves, not additional timers that dole out casting permission at specified intervals. Wizards and skeletons spawn into the level from nowhere, and you fling icicles at them or soften them up with a hive of buzzing parasites that floats above your head.Casting these spells from Lichdoms first-perspective feels oh so good, and they come in three types of magical flavors, called sigils. Each sigil allows for three casting techniques: a focused attack, an area-of-effect attack, and a parry--termed a nova--that typically offers its own kind of offensive enhancement. A focused spell might take the form of a continuous ray of elemental energy or a ball of filth, though I was most taken by homing missiles, which I could fire off in quick succession or charge up for a more thorough display of destruction. To turn an archer into a pile of ash is simple enough with such a missile: hold a mouse button, then release that flaming projectile and watch your target skeleton dissolve into the wind when it hits.Forgive my focus on fire and ice. Its easiest to describe these types of magic in light of the more complex sigils, such as kinesis and delirium, which allow you to control the battlefield in various ways, turning enemies against each other or halting them in their tracks. I grew fond of a slaughterous trio comprised of necromancy, corruption, and ice. Necromancy does what it says on the tin, turning fiends into friends when the grim reaper comes to visit, while corruption allows you to spread an epidemic of tumorous growths and ravenous parasites. These sigils often work in tandem with each other, turning a sequence of properly-timed blitzes into a colorful spectacle of frozen sorcerers shattering into a trillion pieces. This may be magic, but I am more than a mere magician: I am a demigod.More specifically, I am a Dragon, capital-D, and a significant figure in Lichdoms baffling story, which stars you--a battlemage of the gender you choose--and a scout of complementary gender whose role would best be described as ~exposition faucet.~ He or she flits in and out of your travels to share the details of a story thats never properly established, making every line of Lichdoms dialogue a mess of white noise. ~Heres a story about something cool youll never witness for yourself,~ says the scout, in essence, and you move on to making your own story. The beautiful environments thankfully have stories of their own to share; twisted tree trunks and tarnished temples rise from a fetid swamp, and you see massive sea vessels encased in ice, as if they were frozen in time before their captains were aware of such an unlikely danger. CryEngine 3, the same graphics technology that humbled many a PC in 2013 in Crysis 3, has returned to remind you that your machine really needs a new graphics card. To be fair, however, the game looks great even with medium-ranged setting activated, though the games liberal use of motion blur will have you rushing to tweak its visual options to diminish the discomfort.As tempting as it is to compare Lichdom: Battlemage to Skyrim, what with the early snowy environments and all that magic, this is no role-playing game--at least, not in the traditional sense. Lichdom does, however, grant you plenty of agency over how you exercise your magical talents. Your spells are not assigned to you as if they are medicines prescribed by a doctor (burn two brutes to a crisp with this bog-standard fireball and call me in the morning). Instead, you drive your own destiny by designing your spells using the various materials that occasionally rush to your body after a kill as if drawn to your magnetic personality.Elemental powers arent the only ones you command in this magic-driven action game, but they are the two that define the initial hours of Lichdoms overlong campaign, which hobbles to a close long after it milks the joy out of its excellent but single-minded combat.I couldnt possibly begin to detail Lichdoms convoluted spell creation, which isnt ungraspable, but requires that you make sense of various terms--mastery, control, critical effect multiplier, apocalyptical chance--and interpret the results of each step of the crafting process. At first, its difficult to tell why spells behave as they do, especially when there are countless statistical minutiae differentiating one spell from the next. (~These two spells are the same except one offers a slightly larger attack radius and the other does slightly more damage. Is it worth spending time on a decision that wont likely matter much on the field of battle?~) Its both empowering and somewhat tedious to have so much control over so many magical attributes, but whether or not you fall in love with this system, youll spend plenty of time attending to it: more powerful demons shall arrive, and you will have to create higher-level spells to destroy them.After several hours of winding your way through Lichdoms linear levels, it becomes clear that developer Xaviant relied on this combat system to the detriment of other basic aspects of game design. One by one, combat scenarios appear, each one exactly like the last. Enemies spawn into being out of nowhere--and should you die and have to relive the battle, they always materialize in the same locations with no concern for your position relative to their spawn points. You wave your hands about, spreading disease and death, until every demon has fallen--or until you are wholly annihilated. You then interact with a floating sphere that generates a purple hologram depicting two or three characters talking about apparently vital story events you never get to witness for yourself. And then you repeat this scenario, with only boss fights and the occasional appearance of your opposite-gendered exposition vessel to disrupt the flow. Necromancy, ice bolt, ice bolt, fiery aura--once more, with feeling.To be fair, the flow is also disrupted by frequent deaths, an annoyance thats sure to hound you when you enter new areas with spells that no longer adequately protect you, but without the components that would allow you to create stronger magic. Some battles are teeth-gnashingly, hair-pullingly grueling, particularly those with enemies that enjoy freezing you in place, and Lichdom almost takes a perverse delight in how far apart its checkpoints occur. And so you take part in a tedious video game version of Groundhog Day in which you perform the same amazing supernatural feats so often, and in the same repetitive scenarios, that those feats become as boring as collecting Gandalf the Greys dry cleaning.That isnt to say that I dont appreciate the inherent diversity of Lichdoms spellcrafting; a ray of focused flame behaves differently than the necromantic conversion of dead demons, after all. But the game's general approach takes the burden off the design and transfers the impetus of creating variety to me--and without innate structural variety, Lichdom stretches its one excellent idea to the point of tearing. The games inordinate length only reinforces the monotony. I hesitate to suggest a game should be shorter than it already is, but Lichdom itself makes an excellent argument for brevity. Xaviant miscalculated the formula. (Great spellcasting) - (mana bar) + (meaningless story) + (unvaried battles) is not, in fact, equal to 15 or 16 hours of consistent enjoyment and $39.99 of your money.While Lichdom makes a strong case for a shorter game, it also makes the case for another Lichdom game. If there is any game this year deserving of a sequel, its this one. With a steely backbone of meaningful world-building, sensible storytelling, and proper pacing, a Lichdom 2 could have an unassailable place to hang its best asset. The game at hand is concerned only with the magic. A few hours in, I was convinced that it might be enough. The love affair didn't last, but Ill always have those golden memories."}