{"ref": "https://www.gamespot.com/reviews/star-x-review/1900-2862243/", "date": "May 17, 2006", "game_name": "Star X", "text": "Star X for the Game Boy Advance bears more than a passing resemblance to the original Starfox for the SNES. The game pushes a lot of polygons for a GBA game, and the results are pretty astonishing. Comparisons aside, this 3D space shooter is more than just a technical marvel--it is a thoroughly enjoyable experience, albeit with a few shortcomings.The game follows the story of a pilot sent to escort a group of ambassadors on a goodwill mission to meet a group of a recently discovered alien race. You quickly realize that the aliens have no intention of playing nice--they have come for one reason alone, and that is to turn your entire race into slaves. After a lengthy in-game cutscene, you are thrown headfirst into the action--on a mission to make your way back home to inform your planet about the impending threat.Set over the course of 22 missions, ranging from straightforward shoot-'em-up action to free-roaming search-and-destroy objectives, Star X offers just enough variety to keep from getting stale over the course of the game. One major drawback is the lack of a battery-save feature. Given that there are nearly two-dozen missions, it would have been nice to be able to pick up right where you left off. In its place is an antiquated password system, complete with a font that makes certain characters nearly indistinguishable from others.From a graphical standpoint, the flat-shaded polygons of Star X are a reminder of the days when 3D was first beginning to be a possibility on home consoles. While the visuals may look somewhat archaic by today's standards, when you take into account that this game is found on a portable console, the results are stunning. The visuals may seem simple, but the game looks quite impressive considering what you're playing it on. In addition to this, the game moves along at a decently smooth frame rate, making the experience all the more enjoyable. The sound in the game, on the other hand, is not nearly as impressive as the visuals. Explosions and gunfire are repetitive and tinny, as is the music. Ultimately, though, this is one game that you'll remember for being impressive on a technical level--but not as a complete package.Another area that could have used more polish is the controls in Star X. The layout of the buttons is simple enough and easy to get a handle on, but something just doesn't seem to work right. For instance, getting the hang of the enemy lock-on feature is tricky, to the point where just manually shooting down targets is easier and more effective. Piloting your ship is also a bit of a chore, since the control seems to be a little on the loose side. Gripes aside, after playing through the first couple of missions, you'll be able to get a decent feel for the control scheme.To sum things up, Star X is a sight to be seen on the Game Boy Advance. While the game definitely borrows heavily from its ancestors, it manages to stand out it its own right. While this goes for both good and bad, in the end, this game would be a solid addition to any owner of Nintendo's portable wonder."}