{"ref": "https://www.gamespot.com/reviews/super-puzzle-fighter-ii-turbo-hd-remix-review/1900-6177928/", "date": "August 30, 2007", "game_name": "Super Puzzle Fighter II Turbo", "text": "Capcom's Super Puzzle Fighter II Turbo is a classic puzzle game that combines the incredibly addictive gem-busting gameplay of games like Puyo Puyo or Baku Baku with superdeformed versions of characters from Capcom's fighting universe. This competitive puzzle game has always seemed like it would be a great fit for online play, but the only Internet-capable version to date is a Dreamcast release that never made it to North America. Now it's finally online, ready for both the Xbox 360 and PlayStation 3, and it has also received a partial graphical overhaul. If you've ever been a fan of Puzzle Fighter, or any other competitive puzzle game, you should add this one to your collection. One minute you're doing fine, the next you're buried in blocks. Such is life in Puzzle Fighter. Conceptually, Puzzle Fighter is pretty simple. There are gems of four different colors, and they fall into your pit in groups of two. You can rotate the gems around and drop them as you see fit, which usually involves grouping the colors together to make larger, connected groups of gems. The four gem colors also have corresponding colored crash gems. When you connect a crash gem to a quantity of like-colored blocks, they all blast apart and are removed from your pit. The remaining blocks fall as necessary, and the game continues. Busting up larger groups of gems, or even better yet, creating combos of multiple crashes, builds up a collection of junk gems that get dropped onto your opponent's screen. The junk gems count down with every drop and eventually turn back into regular-colored gems, which in turn might just set off a huge chain reaction on your opponent's side, sending a mess of blocks your way, and so on. Play continues until one player loses by having a full pit. The back-and-forth nature of Puzzle Fighter is what makes it so over-the-top and exciting, and you never really know what's going to happen. All games are played competitively, whether you're playing against the machine or against a human opponent. You can play two-player matches locally or over the Internet. Most of the time the game works just fine online, though matches are occasionally sluggish and jumpy to the point of being unplayable. You can also play unranked matches with up to four players in them, in which the losing player rotates out and the next player swaps in, much like the quarter-match mode found in Street Fighter II Turbo on the 360. While the arcade game had only one real mode to play, Capcom came up with two more gameplay modes for the Dreamcast version. One is practically identical to the original mode, and the other has you rotating existing blocks in your pit, rather than waiting for new blocks to drop. There's also a new mode called ~X'.~ That's ~X dash~ for those of you not fluent in Capcom's naming conventions, but regardless, it's a slightly rebalanced version of the original game that makes all the players competitive. Before each match, you pick a Capcom character, such as Ryu, Ken, Dan, Akuma, Sakura, and so on. Each one drops junk blocks in different patterns, and this rebalanced mode adjusts that aspect of the game a bit to level the playing field. You probably won't notice the difference; the distinction seems a little too subtle for all but the most diehard Puzzle Fighter players out there. You wouldn't think that character selection would matter too much in a puzzle game, but it can make a significant difference here. The graphics and menus in the game have been redone, and the end result is much better-looking blocks and backgrounds, all of which are nice and sharp. However, the characters haven't been reworked. Compared to the nicely-redone backgrounds, the figures look blurry and sloppy as they stand in the middle of the screen and animate in ways that correspond to how you're playing. It's unfortunate that they weren't given the same ~HD Remix~ treatment that the rest of the game received. The sound effects and character chatter are the same, and the shrill Japanese shouting that comes from some characters might drive you insane, although it could be right up your alley. It's a shame the characters didn't get a little graphical-update love, but it's hard to argue with Puzzle Fighter's gameplay. It plays well both online and off, and has enough options to keep you interested for a good chunk of time. The price seems a little steep on either platform, but especially on the Xbox Live Arcade where most other arcade classics go for $5 instead of $10, but even at twice the price, it's still a reasonable value."}