{"ref": "https://www.gamespot.com/reviews/no-more-heroes-2-desperate-struggle-review/1900-6247681/", "date": "January 27, 2010", "game_name": "No More Heroes 2: Desperate Struggle", "text": "In the bizarre metropolis of Santa Destroy, duels to the death are broadcast on television, and an entire economy has sprung up around the business of taking lives. No More Heroes 2 is a satirical, irreverent, and bloody tale of revenge set in a world gone mad. Like its predecessor, No More Heroes, Desperate Struggle deals with one man's rise to the top of an assassin leaderboard and focuses on his insane battles with a kooky cast of villains. However, it does so in a much more streamlined manner--the Grand Theft Auto-like open world and the ranked battle entrance fees have been removed, eliminating almost all of the tedium that plagued No More Heroes. With a raucously fun and brutal beat-'em-up combat system, a collection of enjoyable retro minigames, and a thoroughly entertaining story, No More Heroes 2 is a worthy follow-up to one of the most entertaining bloodbaths to be found on the Nintendo Wii. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: No More Heroes 2: Desperate Struggle Video Review Travis Touchdown is the Crownless King. Three years ago, the anime nerd and professional-wrestling aficionado purchased a beam katana on the Internet, fought his way up to the top of the United Assassin Association's rankings ladder, and simply walked away. He has become a legend in the underworld, and partly because of his story, the murder-for-hire business has exploded and gone mainstream. When his best pal is murdered in retaliation for Travis' killing spree, he returns to the UAA in order to seek vengeance on the man responsible, who coincidentally happens to be its number-one-ranked killer. Helping him out along the way are old friends, such as the beautiful UAA agent Sylvia, the deadly swordswoman Shinobu, and his twin brother and on-again, off-again rival Henry. Much like its predecessor, No More Heroes 2 consists chiefly of magnificently violent and over-the-top bloody combat. If the idea of wielding a sword in a Wii game conjures uncomfortable thoughts of nonstop controller waggling, rest assured that this is not the case. Travis swings his totally-not-a-lightsaber at a press of the A button, and after you've sufficiently weakened an enemy, you can split him in twain--causing a morbidly amusing cloud of blood and dollar bills to rain down--by swinging your controller in the direction indicated onscreen. Alternatively, Travis can execute one of 13 different wrestling moves learned over the course of the game to finish off a stunned enemy in a slightly higher-concept and less-bloody manner. Darth Maul she may not be, but don't be fooled by her cuteness. No matter how you choose to destroy your foes, each execution causes a roulette wheel at the bottom of the screen to spin, and if three slots line up, Travis activates one of his darkside powers. By shouting aloud ridiculous attack names such as ~strawberry on the shortcake~ or ~cranberry chocolate sundae,~ he can perform superpowered feats such as slowing down time for his enemies or temporarily transforming into a tiger. But even if you aren't lucky enough to hit it big with a jackpot, you can manually activate a new hyperspeed attack mode whenever you top off your ecstasy gauge, which fills as you dish out pain and empties as you receive it. Other changes include the ability to shake your remote when running for a slow-but-powerful slash, and the surprisingly effective option of using a Classic Controller to play through the entire game without motion controls. By far the highlight of No More Heroes 2 are its eccentric duels with rival assassins. To earn the right to battle them, Travis must carve his way through their domains and their armies of hapless goons. After you make a game-saving restroom stop, the assassins reveal themselves in bizarre, spectacular ways, and the heat is on. Whether you're fighting the hip-hop dancing leader of a religious cult or an adorable but deadly coed with a double-sided beam sword flute, the battles are fun, challenging, and unique. Perhaps most intriguing about the assassins are the elegant locales that serve as their arenas: a dilapidated haunted house, a grassy plain between the realms of life and death, and an eclipsing, setting sun all serve as backdrops of battle and inject extra personality into the duels. This is important, because the assassins--while wild and crazy--often lack personalities and, with few exceptions, are poorly or not at all fleshed out. Though the story is centered on Travis' quest for vengeance, a bit more characterization of his archenemies would have been appreciated. Finally, it's worth pointing out that though there are now 50 rankings in the UAA, group fights and other circumstances out of your control reduce the number of bosses you encounter to 15. No More Heroes 2 features a much more streamlined method of navigating Santa Destroy than the original game--you simply pick where you want to go on the map and you're there. Ranked matches also no longer require entrance fees, which means that if you want to go directly from one fight into the next to keep the action going, you can. Working side jobs is still a necessity, though, if you want to stay abreast of Dr. Naomi's latest weapons technology, update Travis' punk couture, or work out to increase your max health and damage output. This time around, you earn cash through simple and delightful 2D retro games by performing tasks such as exterminating bugs, delivering pizzas, and collecting trash in space. These fully featured but nonetheless brief minigames are a great way to relax in between murder sprees, but if you prefer an aside that's a bit more ~hands on,~ you can always hunt down the goons directly responsible for Travis' best friend's death. As intriguing as this may sound, the revenge missions are ultimately disappointing--they're simply timed deathmatches, and the hit men fight and act no differently than the average thug, which is a huge missed opportunity for more nutty villainy. Desperate Struggle utilizes a highly stylized, cel-shaded look that delivers some of the most striking graphics that the Nintendo Wii has to offer. Even in the midst of a bloody massacre, the action unfolds smoothly and without stutter. The game's greatest weakness, however, lies in its camera system. Though you can lock on to enemies and it's easy to reset the camera, it all too often doesn't know where to look, and things aren't much better in the handful of nonstandard sequences during which you're given direct control over it. On the positive side, Desperate Struggle includes an all-star voice cast, from the lovable and gleefully self-aware Travis to the sexy French siren Sylvia to the Irish badass Henry and beyond. Accompanying the great vocal performances is a wicked, eclectic soundtrack full of catchy punk and rock songs, fantastic retro themes, and brilliant parodies of cliche anime music. The quest to make Travis look even more ridiculous continues. Despite a couple of key shortcomings, such as a poor camera system and a general lack of rival assassin characterization, No More Heroes 2: Desperate Struggle is an overall improvement upon its predecessor. This greatly streamlined game throws out the tedium of the original, and a host of smart changes to the side jobs make even plumbing fun and rewarding. While an average play-through will last you 10 to 12 hours, you can easily put in more time by searching for all of the hidden collectibles, by earning enough cash to complete Travis' wardrobe set, and by replaying boss battles for low clear times in the unlockable Deathmatch mode. Whether you're yearning for a fun and violent Wii action game or simply want to live out a secret Star Wars fantasy of duel-wielding laser swords, No More Heroes 2 is the game for you. By far the highlight of No More Heroes 2 are its eccentric duels with rival assassins. To earn the right to battle them, Travis must carve his way through their domains and their armies of hapless goons. After you make a game-saving restroom stop, the assassins reveal themselves in bizarre, spectacular ways, and the heat is on. Whether you're fighting the hip-hop dancing leader of a religious cult or an adorable but deadly coed with a double-sided beam sword flute, the battles are fun, challenging, and unique. Perhaps most intriguing about the assassins are the elegant locales that serve as their arenas: a dilapidated haunted house, a grassy plain between the realms of life and death, and an eclipsing, setting sun all serve as backdrops of battle and inject extra personality into the duels. This is important, because the assassins--while wild and crazy--often lack personalities and, with few exceptions, are poorly or not at all fleshed out. Though the story is centered on Travis' quest for vengeance, a bit more characterization of his archenemies would have been appreciated. Finally, it's worth pointing out that though there are now 50 rankings in the UAA, group fights and other circumstances out of your control reduce the number of bosses you encounter to 15. No More Heroes 2 features a much more streamlined method of navigating Santa Destroy than the original game--you simply pick where you want to go on the map and you're there. Ranked matches also no longer require entrance fees, which means that if you want to go directly from one fight into the next to keep the action going, you can. Working side jobs is still a necessity, though, if you want to stay abreast of Dr. Naomi's latest weapons technology, update Travis' punk couture, or work out to increase your max health and damage output. This time around, you earn cash through simple and delightful 2D retro games by performing tasks such as exterminating bugs, delivering pizzas, and collecting trash in space. These fully featured but nonetheless brief minigames are a great way to relax in between murder sprees, but if you prefer an aside that's a bit more ~hands on,~ you can always hunt down the goons directly responsible for Travis' best friend's death. As intriguing as this may sound, the revenge missions are ultimately disappointing--they're simply timed deathmatches, and the hit men fight and act no differently than the average thug, which is a huge missed opportunity for more nutty villainy. Desperate Struggle utilizes a highly stylized, cel-shaded look that delivers some of the most striking graphics that the Nintendo Wii has to offer. Even in the midst of a bloody massacre, the action unfolds smoothly and without stutter. The game's greatest weakness, however, lies in its camera system. Though you can lock on to enemies and it's easy to reset the camera, it all too often doesn't know where to look, and things aren't much better in the handful of nonstandard sequences during which you're given direct control over it. On the positive side, Desperate Struggle includes an all-star voice cast, from the lovable and gleefully self-aware Travis to the sexy French siren Sylvia to the Irish badass Henry and beyond. Accompanying the great vocal performances is a wicked, eclectic soundtrack full of catchy punk and rock songs, fantastic retro themes, and brilliant parodies of cliche anime music. The quest to make Travis look even more ridiculous continues. Despite a couple of key shortcomings, such as a poor camera system and a general lack of rival assassin characterization, No More Heroes 2: Desperate Struggle is an overall improvement upon its predecessor. This greatly streamlined game throws out the tedium of the original, and a host of smart changes to the side jobs make even plumbing fun and rewarding. While an average play-through will last you 10 to 12 hours, you can easily put in more time by searching for all of the hidden collectibles, by earning enough cash to complete Travis' wardrobe set, and by replaying boss battles for low clear times in the unlockable Deathmatch mode. Whether you're yearning for a fun and violent Wii action game or simply want to live out a secret Star Wars fantasy of duel-wielding laser swords, No More Heroes 2 is the game for you."}