{"ref": "https://www.gamespot.com/reviews/honeycomb-beat-review/1900-6168308/", "date": "March 29, 2007", "game_name": "Honeycomb Beat", "text": "Before Q Entertainment came out with the one-two release of Lumines and Meteos, it had been years since a puzzle game garnered much critical or commercial attention. These two puzzle games arguably traded on slick presentation as much as they did on inventive and addictive puzzle concepts, and with success comes imitators. Hudson's Honeycomb Beat does its damnedest to emulate the look and feel of Q Entertainment's finest. In this regard, it's fairly successful, if patently derivative. The gameplay concept isn't a bad one, and it benefits from having two unique modes with distinctly different focal points. What hurts the experience, though, is a lack of evolution. The game gets harder the longer you play it, that's for sure, but it's missing the hook that makes you really need to play it for long. Honeycomb Beat is to Lumines what 2 Days in the Valley was to Pulp Fiction. From the name, you might infer that Honeycomb Beat is some kind of rhythm-puzzle mash-up, but in truth, rhythm, or time at all, has little impact on the fundamental concept behind the game. You're presented with a two-tone grid of hexagons. Using the stylus, you can tap (or ~beat~) any hexagon, and it'll flip over, changing from one color to another--from ~off~ to ~on,~ if you will. The rub is that in doing so, it changes the color of any of the other hexagons that it's in direct contact with, which means that, depending on their starting position, turning one hexagon on might turn its six surrounding hexagons off. That's really all there is to it. While the two primary modes of play work with this concept to produce disparate results, both focus on grappling with the six-sided logic. In the puzzle mode, you're presented with a uniquely shaped grid, usually with a few very specific hexagons in the on position, and your challenge is to turn on the entire grid. There's no time limit, but you've got a limited number of beats per puzzle. It's a soft limit, though, and you'll still get partial credit for solving a puzzle even if you go over by a few beats. There are around 200 unique puzzles to be solved, though the first 30 or 40 puzzles don't put up much of a fight, with simple grid designs that require one or two beats to solve. After that, the difficulty isn't always consistent, but the puzzles get pretty diabolical, with serpentine grid designs that can require eight or more beats to solve. Additional kinks arise in the form of special icons that affect the way hexagons they're placed on behave. Arrow icons will cause a straight line of hexagons to flip, rather than the usual concentric circle. Other icons will prevent hexagons from flipping until they've been hit with a number of beats or cause the hexagons surrounding it to flip without flipping that hexagon itself. While a number of the puzzles can be vexing, it's not hard to tear through a surprising majority of them in an afternoon's time. Perpendicular to the puzzle mode is the evolution mode, which takes the basic concept and adds a Tetris-style sense of urgency to it. Instead of giving you a fixed grid with a limited number of beats and an infinite amount of time, you're presented with a seemingly endless grid that slowly but surely creeps up from the bottom of the screen. Flipping every hexagon in a horizontal row will cause it to disappear, and the goal is to eliminate rows faster than they can be pushed onto the screen, because when the grid reaches the top of the screen, it's over. Since being economic with your beats isn't as much a concern as speedily eliminating rows, the evolution mode requires a much different strategy and is inherently faster paced. That said, once you figure out a few basic strategies for eliminating the top few rows of the grid, it's not difficult to blast your way through the 10 basic difficulty levels. There's a shoehorned brain-training angle to the evolution mode that judges your performance at the end of each level, presumably based on your ability to clear a number of rows with a single beat. The way it goads you to step up your game by equating you to a jellyfish or a mitochondria from simplistic play is amusing, but the game itself never really demands a particularly advanced gameplay style. Honeycomb Beat isn't a bad puzzle game at all--it's just kind of harmless. While the playfield itself isn't much to look at, Honeycomb Beat does a pretty good job of sprucing up the presentation with acid-tinged kaleidoscopic visualization effects filling the top screen, random background images behind the playfield on the lower screen, and a dozen or so different electronic music tracks. Your choices for the visualizations, backgrounds, and music are pretty limited at first, though success in either the puzzle or evolution mode opens things up pretty quickly. None of the individual pieces are particularly mind-blowing or original, but they come together nicely. While a lack of imagination could be faulted for Honeycomb Beat coming up short, the real problem is that there's not enough follow-through on the gameplay. The puzzle and evolution concepts are actually pretty great, but the game doesn't explore them enough, and the whole thing runs out of steam before too long."}