{"ref": "https://www.gamespot.com/reviews/crouching-tiger-hidden-dragon-review/1900-6085793/", "date": "December 17, 2003", "game_name": "Crouching Tiger, Hidden Dragon", "text": "Crouching Tiger, Hidden Dragon is a side-scrolling beat-'em-up based on the movie that swept through theaters in the summer of 2000. While the game does a good job of telling the story of the film through the still photographs and text dialogue that appear between certain levels, it doesn't deliver much in the way of hands-on thrills except for a few instances where you can leap across rooftops and jump back and forth between walls. Besides a few nice jump sequences, most of the game revolves around slashing enemies with the Green Destiny. Players assume the role of Jen Yu, the young thief from the film. Each of the game's 25 levels is set up like a scene from the movie. The opening stage has Jen jumping from rooftop to rooftop, using the pilfered Green Destiny sword to fight off the guards that are trying to prevent her escape from Sir Te's compound. As the game goes on, you'll play through levels that require you to fight through dozens of armed enemies, levels that make you navigate doorways and secret rooms, levels that shift the focus away from combat toward climbing or platform-jumping, and other levels that feature activities inspired by the movie--such as running on water and horseback riding. Even though it's clear that the developers put some effort into creating levels that would remind players of situations from the movie, they didn't do enough to incorporate Jen's moves into the environment. Jen plays like Ryu Hayabusa from the old NES Ninja Gaiden games. She has a few basic attacks that can be performed on the ground or in the air. After you jump, you have the option of performing another jump in midair or pushing off of walls in order to climb. Finally, a chi meter at the top of the screen allows you to perform one of eight different movie-themed special attacks. The meter fills gradually with the energy you gain by defeating enemies. Despite what sounds like a healthy variety of moves, there are only one or two instances per level where you need to make use of Jen's double jump or wall climb maneuvers. As a beat-'em-up, it's easy to appreciate how one enemy after another can be slaughtered just by repeatedly pressing the B button and throwing in a few jump kicks. But there are better beat-'em-ups on the GBA, especially when you consider that Crouching Tiger, Hidden Dragon only takes an hour to complete. The story is told using images taken directly from the movie. With the exception of a few clever levels and the snazzy photographs that appear between levels, everything else about Crouching Tiger, Hidden Dragon comes across as flimsy. The graphics are hit or miss. Some stages take advantage of the GBA's ability to display thousands of colors and multiple scrolling backgrounds--and some don't. One level will have bamboo trees in the foreground and semitransparent fog in the background, while the next will be made up of a few gray buildings set in front of a darker gray background. The character graphics for Jen and the other fighters are colorful and smoothly animated, but they're also tiny and not altogether interesting. Even the audio is inconsistent. The music is great and sounds almost like an orchestra at times, but the sound effects are tinny and repeat frequently. Unless you absolutely want to own a video game based on Crouching Tiger, Hidden Dragon, there's really no worthwhile reason to add this one to your collection."}