{"ref": "https://www.gamespot.com/reviews/golf-tee-it-up-review/1900-6194883/", "date": "July 23, 2008", "game_name": "Golf: Tee It Up!", "text": "Golf: Tee It Up doesn't offer nearly as many gameplay options as other golf games, so if you're a veteran of games like EA's Tiger Woods series you'll probably lose interest after the first few holes. If you're a newcomer to the genre looking for a lighter, more casual, and more affordable experience, on the other hand, then Activision's latest Xbox Live Arcade will be a good fit. There's no single-player campaign in Golf: Tee It Up, and there are only two courses to play on. They might not keep you busy for long, but the two on offer, Caribbean and Parkland, feature interesting layouts that blend real-world course design with the typical arcade-golf bends and turns. You'll chip balls around cliffs, on an island, across lakes, and more. You can play against the computer in a tournament or just hit a few random holes. With a good mix of par threes, fours, and even a few sixes, Golf: Tee It Up offers plenty of challenge for the 800 Microsoft points ($10) that you pay. As in most arcade golf games, expect to tee off from some crazy locations. Golf: Tee It Up employs a classic three-click swing mechanic. At each hole you're given four seconds of focus time, which can be used to slow or steer the ball in the air, show you a ghost putt to help you line up your hit on the green, or execute a power shot. Power shots give you a bit of extra power and length, which are useful for digging out of the sand traps or rough patches. You can also adjust the point of contact with the ball to add a bit of backspin. The core mechanics are easy to learn, and once you get the timing down, they work well. Overall, Golf: Tee It Up is a pleasant little game, but there are a few kinks that might frustrate some players. Those with any golfing experience will notice the skewed club recommendations, which always seem to be a bit higher than what you'll want. Furthermore, the ball physics are far from realistic. Balls seem to bounce and roll at random, regardless of terrain. Sometimes a ball will go bouncing into the rough, and other times it will thud to the ground as if it were made of lead; applying backspin doesn't seem to help as much as it should, either. You can play local or multiplayer matches with up to three other people. Online matches run smoothly. With everyone swinging at the same time, moving through 18 holes doesn't take long. There are a few options that let you switch up the experience, such as playing the front or back nine, choosing a random number of holes, or setting the scoring system to match, stroke, or points. The beautiful courses fit the theme and are filled with charm. It's no Tiger Woods, but Golf: Tee It Up looks great for an Xbox Live Arcade game. As is customary with arcade golf games, the graphics have an exaggerated, cartoony look. The character models resemble those in the Hot Shots games, and they feature a limited number of customization options, complete with ~wacky~ clothing such as monster feet and rabbit ears. The courses look great, with tropical trees, crystal waters, frolicking bunnies, and vast mountains. Grass and trees sway in the wind while ambient sounds of birds and oceans play in the background. The music is bright and cheerful, and it fits the vibrant visuals. Golf: Tee It Up is an enjoyable and accessible golf game that won't last you long if you're playing solo but which offers more than enough fun online to justify its green fee."}