{"ref": "https://www.gamespot.com/reviews/shrek-2-review/1900-6099779/", "date": "June 2, 2004", "game_name": "Shrek 2", "text": "Although it has a ton of experience in the console publishing world, Activision is a neophyte when it comes to mobile gaming. Shrek 2, the company's first outing for the mobile platform, consists of a board game seeded with minigames that let players re-create various scenes from the film--albeit in a rather one-dimensional fashion. Even if it's obviously been designed with younger fans of DreamWorks' big green ogre in mind, Shrek 2 doesn't offer much actual gameplay for the download. It may have variety on its side, but none of the minigames in Shrek 2 are really worth playing. After the player selection screen (you can play with up to three of your friends by passing the phone around, or just race against the computer), Shrek 2 greets you with a serpentine board filled with squares for your Shrek-eared token to cross, as well as the occasional larger circle that denotes a minigame. Each player rolls a virtual six-sided dice on their turn, advances the requisite number of squares, and learns their fate: Depending on the space, you may lose your turn, advance or regress a random number of spaces, or be given an opportunity to answer trivia from the two Shrek films for extra points. All of this is kind of a novelty, given that the board game is pretty colorful and couched in the Shrek vernacular. This freshness doesn't last for long, however. The six activities are very rudimentary, and they won't hold adult gamers' attention for more than a minute or two. For instance, the first minigame has you making Donkey jump off of Shrek's carriage to garner red apples. You are penalized for hitting a beehive or eating a green apple, but if you just sit there you won't run into either item. Other minigames involve catching falling potions in a basket, fighting off Puss In Boots, and beating the King in a food fight, all of which are quite plain and derivative to the point of tedium. The food fight game is a case in point--different targets leisurely pop up in one of three places, allowing you what feels like seconds to aim your tomato correctly. Although the graphics are clean and very true to the film, there's no way to adjust the difficulty level, so gameplay wears thin almost immediately. You will also want to turn off the music within a few minutes of play. The initially catchy opening tune drones incessantly on, and there's only one other looped song for the minigames. The Shrek movies are filled with comic fart noises and other sound effects, but they're nowhere to be found in this game. The gameplay wears thin quickly, and the music drones on in an annoying fashion. In the final analysis, Shrek 2 may be Activision's first real foray into mobile gaming, but that doesn't stop the game from playing more like a quickie advertisement for the film than a stand-alone mobile title. It's theoretically possible to run a four-way competition, but none of the minigames are compelling enough to incite any trash talking, let alone sustained interest; plus, whoever reaches Fiona's Castle (the end of the board) first gets a cool thousand points, which will put the match automatically out of reach. This game might be worth a download if you're a huge Shrek fan or under the age of 10. Otherwise, save the money and see the movie twice."}