{"ref": "https://www.gamespot.com/reviews/tsugunai-atonement-review/1900-2838817/", "date": "May 17, 2006", "game_name": "Tsugunai: Atonement", "text": "Tsugunai: Atonement is the latest PlayStation 2 RPG from Atlus, and it offers players an experience not quite like any they've had before. The game's story initially focuses on the journey of a solitary hero whose spirit has been separated from his body while battling evil. While his body is still technically alive, his soul has been forced to wander in a seemingly endless quest to find a way home. Much like the TV show Quantum Leap, the hero must take possession of the bodies of a wide assortment of townsfolk with sadness in their hearts and, in their forms, right any wrongs that may be keeping them from happiness. Much-needed direction is provided by the game's gnomish mentor, who--playing the part of holographic Al in Quantum Leap--teaches the protagonist how to take advantage of his new form's capabilities and shows him what must be done to once again join spirit and body. While not an incredibly novel concept, Tsugunai: Atonement does offer RPG players a new sort of tale to dive into. The novel storytelling method goes hand in hand with many of the techniques that are employed in Tsugunai: Atonement. Your main character and the characters he inhabits all have formidable combat capabilities, but the tactics that form the majority of Tsugunai's gameplay come to the fore on the defensive side of things. When attacked, each character has four possible retorts, a standard block, a strage counter, which charges the special meter, a back step, and a counterattack, which is the most difficult. The window of opportunity to accomplish each of these defensive moves is based on timing a button press within a certain frame of the final attack animation. The standard block is relatively lenient, while countering moves takes extreme precision. Charging the strage meter will let you back-step to avoid flames and area effect attacks while also powering special attacks and critical hits. Characters aren't limited to only melee combat, however, as they can also control magic, which in turn is powered by amulets and runes. Each amulet you find is attuned to a particular spirit or demon and has a cutout center where rune stones can be affixed or removed. Runes come in a variety of shapes, such as triangles, parallelograms, and squares, which ideally are placed in a manner that completely fills the available space in an amulet. Each rune lets a character cast a spell, like an offensive flare of plasma or a healing cure, but when an amulet is completely filled, a creature can be summoned to aid the hero. Acquiring rune stones is simple enough, as they're often dropped by enemies, found in chests, or can be bought in a store, and exploring the magic system can be quite a bit of fun.All things considered, however, for every step forward Tsugunai: Atonement takes, it falls two steps back. The aforementioned combat system is infuriatingly difficult at times, as faltering during the defensive maneuvers can deal a ludicrous amount of damage to your character. Since the only critical and special hits that your character can deal out are also charged with proper defensive techniques, the battles become extremely tedious. Due to the snail's pace at which they play out, what can last upward of 15 minutes in Tsugunai: Atonement would be a three-minute ordeal in another RPG. Also, since you always control only a single character, there's little deviation of strategy from fight to fight, although the use of summoned monsters makes up for this somewhat. If you like healing before battles, you should also get used to purchasing many restorative items, as there is no Inn or other single efficient way to fully restore characters. Tsugunai: Atonement is an extremely challenging game, however, and those players who are particularly fond of the timing-based combat will no doubt enjoy playing through the game.Although there is quite a bit being offered for die-hard RPG fans, prospective players should be warned that Tsugunai: Atonement is by no means an attractive-looking game. The character design and 3D environments are generally uninspired, and, for the most part, it appears that a single unattractive cardboardlike texture was used to render just about everything in the game. Many of the character models look incredibly similar to one another, and the entire look of the game is generally boring and unremarkable. Spell effects and strage moves are subdued affairs, and even the more potent boss monsters look pale in comparison with what can be found in other RPGs. Worst of all, accompanied with every transition from screen to screen is an unbearably long load time, which makes many of the ventures that might otherwise be enjoyable simply annoying. Compensating greatly for the otherwise bland visual experience is an excellent soundtrack from Yatsunori Mitsuda, who worked on Chrono Trigger, Chrono Cross, Xenogears, and recently Shadow Hearts. While many of the tunes sound like typical RPG fare, some of the tracks are particularly inspired and may actually encourage you to stick around the same area, if only to hear a song all the way through. For most players, acquiring the soundtrack would be a much better idea than buying the game.Many of the interesting concepts in Tsugunai: Atonement lose their appeal shortly after the umpteenth quest to help some tortured soul in town. Many of the tasks feel very much like fetch quests, while others are simple hack-and-slash affairs that force you to power-level your character until it can face an infuriatingly difficult end-of-mission boss battle. Tsugunai: Atonement can be recommended to only RPG fans who feel the desire to greatly challenge themselves and complete every game produced. The more selective enthusiast will be much better off spending his gaming dollar elsewhere."}