{"ref": "https://www.gamespot.com/reviews/2006-fifa-world-cup-review/1900-6152105/", "date": "June 1, 2006", "game_name": "FIFA World Cup: Germany 2006", "text": "Football fans wrapped up in World Cup fever should steer clear of EA's 2006 FIFA World Cup on the Game Boy Advance. It may well offer you the chance to take your favourite team through the qualifying stages and into the World Cup finals, but the game's poor animation and simple tactics make it a completely lackluster experience. 2006 FIFA World Cup for the GBA may have a slick menu presentation... As an officially licensed FIFA product, all team and player data is correct and up to date, which goes a long way in re-creating the atmosphere of the tournament. The limitations of the GBA mean that some concessions have been made, though, such as a lack of the official World Cup venues seen on the other platforms. However, EA's famously polished presentation goes some way to alleviate this--hearing a Black Eyed Peas song blaring out of your GBA makes a strong impression, and compares favourably to other games on the console. There are three single-player modes in this version of 2006 FIFA World Cup. Kick off is a single match where you can turn wind effects on or off, change the pitch type, and adjust the length of each half. You can also set up a number of scenarios if you become bored of the basic game, such as giving yourself a 10-goal head start--or, if you're feeling generous, giving it to your opposition instead. It's even possible to cut straight to the end of the game if you wish, and it's likely that this option will be particularly popular with people wanting to re-create scenarios that arise from the real World Cup. Even though matches don't feature commentary, the crowd reacts to what's happening on the pitch and all menus have musical accompaniments. But the main thrust of the game is the World Cup mode, and you can either play out the main tournament or take a team through the qualifying stages to the World Cup itself. This mode is a nice option for fans of teams that didn't make it through to the finals, who can instead play out the tournament as if their team had actually qualified. If you don't like your group you can swap with another team, or you can ask the game to draw seeded groups so that the best teams are all separated. Your progress will be saved during the World Cup stages, so you can return to a tournament at any time; and if you don't fancy playing a particular match, you can ask the game to simulate it. However, simulating a game rarely brings accurate results (we're not convinced that an Australia 4, Brazil 0 score line is all that likely in the real tournament), and your team seems to have a much higher chance of losing a game than if you were playing it yourself. It would have been more helpful be able to watch a game being played from the manager's perspective, and then dip in and take control if things aren't going well. The game also has two challenge modes. One is a simple penalty shootout, and the other is a global challenge. The latter lets you choose a team and play out a number of different scenarios, such as playing the last half of a game already 2-0 up, with the aim not to concede more than two goals. Playing through challenges and using teams from different continents in the World Cup will unlock posters in the 'rewards' section of the option menu. On the multiplayer side, you can use a link-up cable between two GBA consoles, both of which require a copy of the game. Unfortunately, though, actually playing 2006 FIFA World Cup isn't a particularly rewarding experience. The animation of the players could be forgiven for being rudimentary on the GBA, but they move so erratically, the result is similar to bad 'stop-motion' animation. The poor player likenesses also means that you won't be able to recognise individuals on the pitch, and you certainly won't be able to spot Beckham or Ronaldo from the way they move. Players feature a strange grey-brown skin tone to cover all nationalities and are differentiated only by either light or dark hair. The feeling of inaccuracy stretches to other basic football movements, too, something which isn't helped by the limited number of buttons on the GBA. Players tend to crowd around the ball, meaning that there's little point in making short, intricate passes, as you're usually punished with an interception. Conversely, if you go it alone and take one man down the pitch to score, you're usually rewarded with huge score lines. When defending, you can hold both shoulder buttons to bring two players to the ball, but tackling is very imprecise. Pressing A is a soft tackle that rarely gets the ball (instead sending it off the pitch), whereas pressing the left shoulder button and A usually results in a foul. ...But everything on the pitch is completely lackluster. In-game, there are quite a few options to tweak. The game can be played from only one of three side-on perspectives, but replays can be controlled in three dimensions, with full zoom functionality, and match highlights are shown at the end of each game. You can also dip out of the game and access basic team management and statistics. Player substitutions are included, and it's possible to choose from up to 18 different formations, plus change between five different levels of attack and defence. In the kick off single-match mode you can also toggle elements such as injuries, bookings, and wind conditions. There are no real-life stadia in the game, but you can change from 'normal' ground to 'hard', 'wet', 'soggy', or 'icy' conditions. That said, the chances of an ice patch in Germany in June are pretty remote. Although 2006 FIFA World Cup is a game full of options, control is lacking just where it's needed the most--on the pitch. Scoring is simply a case of running up the pitch, shimmying past the goalkeeper, and scoring goal after goal without much effort. Although World Cup junkies might be able to look past the basic flaws that this game has, most people will find their memories of the tournament tarnished by this below-par cash-in."}