{"ref": "https://www.gamespot.com/reviews/age-of-pirates-caribbean-tales-review/1900-6159850/", "date": "June 25, 2007", "game_name": "Age of Pirates: Caribbean Tales", "text": "The life of a pirate must have been pretty rough, and being rough is one thing Age of Pirates: Caribbean Tales certainly nails down pat. This convoluted, buggy game greatly overextends itself, presenting an open-ended role-playing experience that combines ship-to-ship combat and on-foot exploration throughout the Caribbean islands during the golden age of piracy. This game might as well be a sequel to the developers' previous piracy games, including 2003's Pirates of the Caribbean and 2000's Sea Dogs, so it's a shame that the broader, more ambitious scope of this latest take on the formula just leads to more problems. If you liked Sid Meier's Pirates!, then keep playing it instead of this. Much like Akella's previous games, in Age of Pirates you play as a freebooter looking for fame and fortune on the high seas. You can choose to play as either a male or female character, and you start off with a modest ship and crew, and may then proceed to go wherever you like in the Caribbean. Whether you either take on missions for the various European nations that have set up camp on the isles or plunder their merchant vessels is pretty much up to you. By completing various quests and sinking or successfully boarding enemy ships, you'll gain levels of experience that let you customize your sea captain's abilities. You also need to be mindful of your ship's crew--their health, morale, and salaries--and may employ officers to help you navigate and fight. There's a lot to think about and to do in Age of Pirates. If only it all worked as well as could reasonably be expected. The game gets off to a worrisome start by presenting you with a screen dense with different gameplay options, such as nation progress rate, encounter frequency, sailing settings, and simplified sea artificial intelligence. There's also an overall difficulty option, but it's hard not to presume that a game presenting this fine a level of customization right off the bat is a game that isn't trying very hard to deliver a well-balanced experience. Indeed, Age of Pirates often feels aimless, and the simple text-based quests you'll be given are hardly incentive enough to hold interest. The character-leveling system is probably the most compelling reason to keep playing, but the longer you play, the more the game seems to unravel. Open-ended games ought to reward experimentation and exploration, but this one is almost as likely to crash on you as you keep doing things your way. The pacing and quality of presentation in Age of Pirates are also all over the place. You can tell most of the effort went into creating nice-looking ships, water, and weather effects, because the close-up sailing sequences look very pretty. Most of the rest of the game just looks bad, though, and the clunky interface is unclear and hard to get used to. Bombastic music flares up when your ship gets into a fight, making these deliberate battles feel rushed. While you can initially adjust settings to affect the ship-to-ship combat, these battles wind up being long, slow slogs regardless of your choices. This may be relatively realistic, but you're left with little to do but turn and switch ammo types while your ships wage war. To help speed things along, there's a good chance you'll want to try to move in and board your enemy's vessel, especially since that's the easiest way to get yourself a bigger, better ship (why buy one when you can take one?). Boarding attempts culminate in a choppy, ridiculous action sequence in which you'll hack at the enemy crew and its captain. These battles haven't changed much since Akella's previous pirate games, and by now they come across as completely substandard. It's too bad so much of this game feels half-baked, since there are many different details you might otherwise want to sink your teeth into in Age of Pirates. Ships may be upgraded with different types of hulls, sails, and cannons, which all carry certain advantages and disadvantages that force you to make interesting trade-offs (such as between durability and maneuverability). Improving your captain's tactics rating lets you command larger squadrons of vessels, if you prefer strength in numbers. And if you're feeling bold, you can attempt to attack and capture a colony by battling its defensive fortresses, mopping up guards on foot, and even ransoming off the former governor. As you play, your character's overall reputation and his or her standing with the different Caribbean factions will change. Leveling up also lets you choose from a variety of special abilities that let you bolster your captain's abilities as a sailor, a fighter, a leader, a negotiator, and more. Age of Pirates would be better off in Davy Jones' Locker than on your hard drive. The back of the box also asserts that there's a multiplayer mode for up to 16 players, including four modes: deathmatch, team deathmatch, defend the convoy, and capture the fort. However, we could find literally no one playing any of these modes online, and there's barely so much as a mention of the multiplayer modes in the game's 60-page manual. Assuming these modes are fully functional, they still probably wouldn't be much fun, considering the ship-to-ship combat in the game is especially dull when you strip out all the role-playing and boarding elements. Age of Pirates is comparable to Sid Meier's Pirates! from 2004, yet while that game distilled down the concept of being a high-seas swashbuckler to its essentials, this newer one drowns in the details. The game just feels rushed and dated, and it comes across as if the developers bit off a lot more than they could chew. It's understandable that in the wake of Pirates!, a similar game would try to differentiate itself by providing many more gameplay features. But to say that the quality of the execution of this game leaves a lot to be desired would be putting it nicely."}