{"ref": "https://www.gamespot.com/reviews/c-12-final-resistance-review/1900-2876564/", "date": "May 17, 2006", "game_name": "C-12: Final Resistance", "text": "C-12: Final Resistance is a Syphon Filter clone from Sony that, presumably, is being positioned as one of the last new and worthwhile titles for the aging PlayStation. With the PSOne losing relevance by the day, only a true triple-A game could make forward-thinking gamers dust off their old system, and unfortunately, C-12 isn't quite at that level of quality. It's a strictly average action game that may interest the few players who haven't graduated to a newer system, but serious gamers will pass it over for something a little more modern. C-12 takes place in a postapocalyptic future in which marauding aliens have invaded and overrun the planet. The aliens have added insult to injury by not only taking over everything in sight but also claiming our fallen soldiers as their own, perverting them through cybernetic modification into walking death machines. Your character, Riley Vaughan, has accepted a cybernetic implant of his own and will attempt to battle the aliens single-handedly as a last-ditch attempt at regaining freedom for humanity. Gamers familiar with the Syphon Filter series will adapt to the gameplay in C-12 right off the bat, because it's nearly the same game. You control Vaughan from a third-person perspective through a variety of missions that take place in a shattered cityscape. Radio contact from your superiors will keep you up to date and provide you with new directions and mission objectives. You have access to the standard array of mission aides, including an area map, communication log, and list of objectives. Mission goals include such notables as liberating captured allies, hunting for keycards, and pressing switches--pretty standard action game fare, for the most part. Of course, like Syphon Filter, most of C-12's meat lies in its combat. You begin the game with a simple energy blade, which means you'll start off engaging in melee combat with the cyborgs. Soon you'll gain a machine gun equipped with a grenade launcher, and later on a variety of heavy weaponry will become available, including a rocket launcher and laser and ion cannons. Like Syphon Filter, C-12 features a target lock-on system that facilitates combat in a 3D space. Holding R1 will (theoretically) establish a lock on the appropriate enemy so that your shots will be directed toward it. Unfortunately, in practice this system doesn't work all that well. Very often you'll find yourself locked onto an enemy other than the one that's bearing down on you directly, making you waste precious time cycling through targets. What's worse, your lock isn't very consistent when you're moving, making it hard to hit enemies on the fly. All of this is mired further by stiff and awkward controls and a camera that's often at a rather unwieldy angle, and the end result is a potentially cool but often laborious gameplay experience. C-12 is visually pretty impressive for a PSOne game. The environments are suitably gritty and futuristic, and the game has an overall consistent look. The first-person view also has a nice effect and a nifty target ID system. Unfortunately, most any game for the original PlayStation is going to look horribly dated by any other standards these days. On the other hand, anybody who's still playing PlayStation games probably doesn't make graphics a top priority, so your mileage may vary. At least Sony has kept the PSOne's age in mind by pricing C-12 substantially lower than the average PS2 game, but that shouldn't be enough reason for owners of a newer system to break out the old PlayStation. However, if you're stuck whiling away the hours with the venerable old workhorse, you could do worse than C-12. Then again, you could also do better."}