{"ref": "https://www.gamespot.com/reviews/one-piece-unlimited-adventure-review/1900-6186502/", "date": "February 21, 2008", "game_name": "One Piece: Unlimited Adventure", "text": "One Piece: Unlimited Adventure tackles two challenges, and it does so reasonably well. First and foremost, it offers a good amount of fan service by way of its flashback-oriented storytelling. Second, it's a somewhat-entertaining action-oriented adventure in it own right, with a light but amusing combat system and some fun boss battles. It's also quite long, though that's partially due to a lot of dull backtracking. This is a good game, to be sure, but a bit of monotony moves in early on, only to take up permanent residence as the adventure continues. ~Nose to nose~ takes on a new meaning whenever Usopp is involved. The story doesn't tread new ground, although that ends up working to the game's benefit. Luffy and his pirate pals find a mysterious crystal (amusingly, this generic mysteriousness is the source of several humorous bits of dialogue from the ever-positive Luffy) just prior to crash-landing on an unfamiliar island. As it turns out, that same crystal is the key to freedom, as well as some apparently precious treasure. More importantly, the crystal causes the gang to relive memories, which are represented by frequent clips from the television series. As a tip of the hat to rabid fans, this is a rather effective narrative device, but if you're an American One Piece enthusiast, be warned: Many of these clips are from episodes yet to air in the United States. In other words, expect spoilers galore. In the lengthy story mode, you can play as any one of eight Straw Hats at any given time, and switch among them at will by pressing the minus button on the remote. Should a character fall in combat, never fear: You can replace him or her with someone else, which means that all eight need to bite the dust before it's game over. From a combat perspective, all of them bring something different to the table, from Usopp's slingshot to Zoro's flurry of swords. As you play as a particular character, you unlock new moves and level up existing ones. It's likely that you will settle on two or three of them early on to do the bulk of your business, given that several characters feel underpowered at first. However, you'd be wise not to neglect them, not just because leveling them up evens out the playing field, but because losing your best characters during boss fights and getting stuck with underdeveloped ones is an easy ticket to a reload. Nevertheless, part of the game's uneasy dichotomy is the RPG-esque grinding that results from this setup. The combat itself is pretty simple but good fun, and consists of a comfortable blend of button mashing and remote waggling. There is also a contextual combo system in which you must duplicate a series of moves listed on the right side of the screen to unleash a powerful attack. However, you'll end up spending a lot of time slicing up endlessly respawning enemies in the same environments over and over, just to keep all eight characters ready for the next boss battle--of which there are many. The tedium that results from the grind itself is pretty mild because the combat is so enjoyable. Unfortunately, it's compounded by the actual adventuring. To progress, you use your ever-mysterious crystal to activate globes scattered across the island to gain access to new areas. Your crystal is a hungry sucker, though, and requires you to feed it various objects before it'll introduce you to the next horizon. In turn, you need to craft various tools to assist you. For example, if the crystal is hungry for insects, you'll need to create a net to catch them--and before you can do that, you need to collect ingredients to make the net. That's not an inherently bad mechanic, and there's a certain feeling of accomplishment when you finally manage to gather everything you need to move on. However, you can craft items and save your game only at camp, which results in an excessive amount of backtracking. You might end up needing items from a completely different area than the one you're in, or you may have stored them at camp to free up your limited inventory space. Either way, you'll spend a lot of time running around areas you've already visited over and over again, and fighting off the same sailors, when all you want to do is find a spiderweb. Defeating bosses and other enemies also unlocks them for the other two modes the game offers. Although survival mode--in which you mow down enemies against the clock--is barely worth noting, versus mode is actually pretty interesting. In this mode, you and a buddy spend a limited number of points on a group of fighters, which means that you can take in a whole bunch of underpowered marines or a few powerful bosses, and then take one another on. Nami isn't the most powerful character at first, but she's more helpful as she levels up. One Piece: Unlimited Adventure is visually unimpressive, though it manages to capture the freewheeling spirit of the popular anime quite well. Character models are nicely done, and some of their attacks result in a flurry of colorful particles and other effects. But as a rule, everything looks pixelated and washed out, and environments are often unimaginative, with a few notable exceptions, such as a beach with a hulking dinosaur skeleton. There are some obvious dips in the frame rate as well, though the game is easy enough that it never affects gameplay to any great extent. Thankfully, the show's cast does a terrific job in bringing the Straw Hats to audible life, and though none of the music or sound effects stand out as particularly exceptional, none of these elements are particularly bothersome either. There's certainly a lot of game here. The adventure could take you 40 or more hours to complete, so if you're a fan of Luffy and company, you'll get your fair share of time to spend with them. Sure, there's a ton of repetition here, but the game's aesthetic is so charming and easygoing that it's hard to fault the gameplay for following suit. Most likely, you'll be able to overlook the game's faults and enjoy One Piece: Unlimited Adventure for what it is: a cute and fun way to join your favorite pirates on their latest escapade."}