{"ref": "https://www.gamespot.com/reviews/victorious-boxers-revolution-review/1900-6181295/", "date": "October 18, 2007", "game_name": "Victorious Boxers: Revolution", "text": "Almost immediately after the Wii's unique control scheme was first shown, people began imagining what a boxing game would be like on the system. Thanks to Wii Sports Boxing, they didn't have to wait long to find out. But the game was shallow and felt more like a tech demo than a fully fleshed-out boxing experience. Enter Victorious Boxers: Revolution, a sequel to 2001's Victorious Boxers on the PlayStation 2. With 25 fighters and a story mode, there's certainly a full game here. Unfortunately, the actual boxing isn't that great, no matter which control scheme you choose. Hey! That guy's not wearing the wrist strap! Victorious Boxers is based on Fighting Spirit, an anime series known in Japan as Hajime no Ippo, so it's not surprising that it has a story mode that follows characters from the show. You play as Ippo Makunouchi, an awkward student who routinely gets bullied at school. Long story short, he's befriended by someone from a boxing gym, learns to fight, and decides that he will one day become the featherweight champion of the world. The story is told before and after fights via anime-style cutscenes. You'll make friends, enemies, friends who are enemies, and enemies who are friends on the road to the top. The story can be difficult to follow because many of the fighters look the same, don't move their mouths when they talk, and come and go from the storyline in the blink of an eye. Even if you do get into the story, you'll likely be frustrated that it plows ahead on a predetermined path regardless of what happens in the ring. You can win a fight in 60 seconds, during which time you only get hit a handful of times, yet you find yourself in the hospital when the story resumes. Worse yet, you can be winning a fight but the story dictates that you're supposed to lose. So even though you're declared the winner in the post-fight stats screen, the game says you lost. If you don't want to play the story mode, you can spar against unlocked opponents or even take on a friend in a split-screen, head-to-head mode. Although the story itself isn't reason enough to play, a boxing game doesn't need a story if the actual boxing is good. Unfortunately, that's not the case here. There are several control schemes to choose from. The primary option has you hold the Nunchuk in your left hand and the Wii Remote in your right. Punching straight with either controller will make your fighter throw a jab. Throwing a hook or an uppercut will result in your fighter doing the same onscreen. When you fill your meter in the corner of the screen, you can hold a button down and then throw a punch, which results in your fighter throwing a special punch. The punching mechanic works reasonably well on its own, but it falters when combined with movement and defense, both of which are done by either tilting the controllers or holding down buttons while tilting the controllers. Unless you have the controllers in a perfectly neutral position, your fighter will constantly duck, bob, and weave. The end result is that you feel as if you have very little control over your boxer's movements, so you just swing wildly and hope for a knockout. It feels as if the developer recognized this because on the easy and normal settings all you have to do to win--at least for most of the story mode--is punch. Even when you do have more control over your movements, such as when you use the classic or GameCube controllers, it's tough to use any real strategy because it's hard to tell when you're hitting your opponent and when you're getting hit. A third control scheme that has you trace lines on the screen to throw punches is even more unwieldy--the Wii just doesn't seem to be able recognize movements accurately enough to make this option playable. This guy's nothing. Your biggest opponent will be the controls. Like the controls, Victorious Boxers' visual style is unique but not necessarily good. It's not the developer's fault that the art style is rather ugly, considering that it's based on the anime series, but it won't be long before you've had your fill of funky-nosed, dark-haired characters that are mostly indistinguishable from one another. The cutscenes aren't in widescreen (the game doesn't even support 480p) and what's worse, they're letterboxed, so they must be viewed in a small box in the center of the screen like an early CD-based game. At least the in-ring action looks decent; everything is crisp, colorful, and cartoonlike. It's tough to say why the visuals work so well when you're fighting and not when in the story mode--they just do. One thing that doesn't work, whether you're watching the story or boxing, is the voice acting. It's downright awful. Think of actors whose first language may or may not be English, and who may or may not have seen the script before the record button was pushed, and you'll get the picture. If you enjoy the anime, then you'll probably appreciate the game's adherence to the show's story and characters, but it's most likely too quirky for the average person looking for some straightforward boxing on the Wii. Victorious Boxers isn't awful, but it's hampered by a lousy control scheme. Sure, you can play it with a standard controller to make the action a little smoother, but even then it's just an average experience."}