{"ref": "https://www.gamespot.com/reviews/crash-n-burn-review/1900-6113891/", "date": "November 23, 2004", "game_name": "Crash 'N' Burn", "text": "Crash 'N' Burn has as straightforward an approach as you're likely to find in any game this year. It goes like this: Racing is good, crashing is better, and burning... Well, burning is just sweet. While the game has some fun packed into it, there isn't enough to really distinguish it from other titles in the genre. The crashing has already begun, and the burning is just around the corner. Let's get the inevitable comparisons to Burnout 3: Takedown, the game Crash 'N' Burn will most likely be compared to, out of the way early. As in BO3, the premise of Crash 'N' Burn is to win races that are run mainly through city-street circuits. Like BO3, the game's arcade controls and easy handling combine to make for an immediate pick-up-and-play experience, complete with simple steering, gas, brake, and turbo control options. Finally, as the game's title suggests, racing in Crash 'N' Burn means you can expect to crash (and burn) a lot, which is another feature found in BO3. Where Burnout 3 focuses on the sheer visceral thrill (and, in many cases, the sublime beauty) of destroying cars, Crash 'N' Burn's approach focuses more on the consequences of these steel-bending automobile mashups. A race begins with 16 cars on the circuit, including your own. This same number of cars will be on the track when the race ends, whether each one is actually running or not. Throughout the contest, you'll be trading paint with your competitors, who are all intent on beating you to the finish line by any means necessary. Any car that breaks down or explodes is left on the track as either a flaming mass of metal or a simple obstacle to be avoided. Your job is to not only win the race, but also keep your car ~alive~ in doing so. Each bash, bump, and scrape your car suffers, and each fiery stretch of tarmac you speed through, deals damage to your car. If your car suffers too much damage, you'll find yourself out of a race before it even ends. By the final lap of a race in Crash 'N' Burn, you'll be dodging not only the carcasses of abandoned cars that litter the course, but also any surviving members of your opposition as well. Kamikaze mode brings new meaning to the phrase 'head-to-head racing.' The game's tracks are typically both short and pretty simplistic, and they are located in a number of fictional re-creations of real-world locales, such as Miami, Las Vegas, and San Francisco. As the flaming wrecks pile up, and as the oil slicks are laid out, the added complexity introduced by these ever-changing course conditions initially makes for some compelling gaming. Some courses also feature live intersections that you must cross twice per lap, adding additional layers of danger to a race. Even on a simple track, such as the Las Vegas oval, no two races ever end exactly the same way. In addition, Crash 'N' Burn features some interesting race variations, including kamikaze race, where half the cars head in one direction on the track while the other half head in the opposite direction. The first lap ends up looking more like the result of a crash-up derby rather than a street race, so it's definitely worth a laugh or two. Other race modes include last man standing, bomb tag, and running man. As you progress in the game, however, you'll find the complexity introduced by these persistent wrecks lends itself more to a feeling of frustration rather than real challenge. Some of the later unlockable tracks, such as Detroit, feature some extremely narrow stretches of road. In a kamikaze race, it's exactly these thin sections of a track where the majority of cars meet, oftentimes resulting in 16-car collisions...and no room to avoid participating in the pileup. Instead, you are reduced to bulldozing the car in front of you, while watching sparks and fenders fly, in hopes that you can quickly sort yourself out of the auto melee. The game's insipid artificial intelligence-controlled cars seem basically unable to avoid crashing, so you'll often find yourself as one of only five or fewer cars to even finish a race. About the only way to consistently find success in the game is to hope you find a lane early in the race and then get out in front of the pack. Suffer a traffic-snarling crash, even during the first or second lap, and you may find yourself too far back to ever hope to win. Instead, it's easier to simply restart the race and hope for a better start off the line. With each race you win, you earn cash that can be used to upgrade the cars in your garage. There are four car types available: compact, pickup, muscle, and sports. Compact and pickup vehicles are available immediately, while muscle and sports vehicles must be unlocked later in the game. Upgrades range from improvements like turbo and performance enhancements to more-cosmetic tweaks, like new spoilers, wings, hoods, or rims, to name just a few. Upgrade points can be applied to one of three performance areas: engine, gearbox, or tires. These upgrades keep your car competitive throughout the game, but they don't really have much impact on how your car handles or anything like that. Graphically the cars look nice, if rather simplistic. Each car model has a generic toylike appearance, as if it came off the Hot Wheels assembly line. Vivid paint schemes and some decent reflection effects on the hood and fenders of vehicles give the game a vibrant color palette. While most of the tracks feature urban environments, some of the later tracks take place in more-remote locales, such as a redwood forest and even the Grand Canyon. These courses are the best-looking of the bunch because they feature more-varied color palettes and more-interesting backgrounds than the tracks found in the cities. Those who pick up the Xbox version of the game will find a brighter color palette than that found on the PS2 version. Other than this noticeable difference, the games are practically identical on both consoles. Busy intersections can wreak havoc on your race results. With the game's focus on massive wrecks and roaring flames, the game's crash and fire effects should look amazing, right? Well, yes and no. From a visceral point of view, the wrecks are fun to watch, because cars flip multiple times per collision and then land upside down, only to be slammed by the cars that are behind them. The fire effects are passable and are most effective when you find yourself driving through entire walls of flame on courses, unsure as to just what lies on the other sides of the walls of flame. When two or more cars scrape, random pieces of metal fly off from all participants in seemingly every direction. However, the sparks that result from these battles are pretty unconvincing. In addition, the game suffers from some pretty serious slowdown. It takes noticeable frame rate hits when too many cars are piled up on the screen and during particularly fire-intensive sections of track. Finally, the game lacks that sense of breakneck speed that is intimated on its cover. Even with a car that is highly tuned for top speed, you'll feel as if you're only traveling a notch or two above the speed limit. The sound in Crash 'N' Burn is passable, if unspectacular. About the only successful use of it revolves around the thundering effects that present themselves when cars collide or explode. The game's announcer, who seems to be giddily reveling over the fiery on-track mayhem with comments such as ~That's the worst wreck I've ever seen~ or ~Somebody call 911,~ is perhaps a tad too morbid. Crash 'N' Burn's other audio is ineffective and often seems as if it were rushed through production; including engines which sound muffled and practically identical regardless of car class, and an awful soundtrack, which makes a feeble attempt at rocking. The car models have an attractive, bright color palette to them. Those who tire of the game's silly AI might enjoy the game's online play. You can race against up to 15 other opponents in online races that feature solid performance (beyond the standard frame hits described above) and decent varieties of customization options. Slots that aren't taken up by human competitors are automatically filled by AI-controlled drivers, ensuring an always-full online field. Perhaps the best part of the online play involves being able to show off your highly customized rides (and subsequently destroying the tuned-up cars of your friends and foes). Crash 'N' Burn is a passable racing game. It doesn't aspire to be much, but there's definitely some fun to be had here. It's easy to get into and provides a great deal of challenge the further you get into it. At the same time, Crash 'N' Burn cannot escape comparisons to a superior title in Burnout 3: Takedown, which arrived several months ago. In a way, this is a shame, because the game does a lot of things right in its unique take on the crash-'em-up subgenre of racing games. Unfortunately, some of Crash 'N' Burn's central ideas--the persistent wrecks being the most obvious example--introduce complexity that, in the end, will leave you more frustrated than thrilled. With each race you win, you earn cash that can be used to upgrade the cars in your garage. There are four car types available: compact, pickup, muscle, and sports. Compact and pickup vehicles are available immediately, while muscle and sports vehicles must be unlocked later in the game. Upgrades range from improvements like turbo and performance enhancements to more-cosmetic tweaks, like new spoilers, wings, hoods, or rims, to name just a few. Upgrade points can be applied to one of three performance areas: engine, gearbox, or tires. These upgrades keep your car competitive throughout the game, but they don't really have much impact on how your car handles or anything like that. Graphically the cars look nice, if rather simplistic. Each car model has a generic toylike appearance, as if it came off the Hot Wheels assembly line. Vivid paint schemes and some decent reflection effects on the hood and fenders of vehicles give the game a vibrant color palette. While most of the tracks feature urban environments, some of the later tracks take place in more-remote locales, such as a redwood forest and even the Grand Canyon. These courses are the best-looking of the bunch because they feature more-varied color palettes and more-interesting backgrounds than the tracks found in the cities. Those who pick up the Xbox version of the game will find a brighter color palette than that found on the PS2 version. Other than this noticeable difference, the games are practically identical on both consoles. Busy intersections can wreak havoc on your race results. With the game's focus on massive wrecks and roaring flames, the game's crash and fire effects should look amazing, right? Well, yes and no. From a visceral point of view, the wrecks are fun to watch, because cars flip multiple times per collision and then land upside down, only to be slammed by the cars that are behind them. The fire effects are passable and are most effective when you find yourself driving through entire walls of flame on courses, unsure as to just what lies on the other sides of the walls of flame. When two or more cars scrape, random pieces of metal fly off from all participants in seemingly every direction. However, the sparks that result from these battles are pretty unconvincing. In addition, the game suffers from some pretty serious slowdown. It takes noticeable frame rate hits when too many cars are piled up on the screen and during particularly fire-intensive sections of track. Finally, the game lacks that sense of breakneck speed that is intimated on its cover. Even with a car that is highly tuned for top speed, you'll feel as if you're only traveling a notch or two above the speed limit. The sound in Crash 'N' Burn is passable, if unspectacular. About the only successful use of it revolves around the thundering effects that present themselves when cars collide or explode. The game's announcer, who seems to be giddily reveling over the fiery on-track mayhem with comments such as ~That's the worst wreck I've ever seen~ or ~Somebody call 911,~ is perhaps a tad too morbid. Crash 'N' Burn's other audio is ineffective and often seems as if it were rushed through production; including engines which sound muffled and practically identical regardless of car class, and an awful soundtrack, which makes a feeble attempt at rocking. The car models have an attractive, bright color palette to them. Those who tire of the game's silly AI might enjoy the game's online play. You can race against up to 15 other opponents in online races that feature solid performance (beyond the standard frame hits described above) and decent varieties of customization options. Slots that aren't taken up by human competitors are automatically filled by AI-controlled drivers, ensuring an always-full online field. Perhaps the best part of the online play involves being able to show off your highly customized rides (and subsequently destroying the tuned-up cars of your friends and foes). Crash 'N' Burn is a passable racing game. It doesn't aspire to be much, but there's definitely some fun to be had here. It's easy to get into and provides a great deal of challenge the further you get into it. At the same time, Crash 'N' Burn cannot escape comparisons to a superior title in Burnout 3: Takedown, which arrived several months ago. In a way, this is a shame, because the game does a lot of things right in its unique take on the crash-'em-up subgenre of racing games. Unfortunately, some of Crash 'N' Burn's central ideas--the persistent wrecks being the most obvious example--introduce complexity that, in the end, will leave you more frustrated than thrilled."}