{"ref": "https://www.gamespot.com/reviews/2006-fifa-world-cup-review/1900-6152465/", "date": "June 7, 2006", "game_name": "FIFA World Cup: Germany 2006", "text": "2006 FIFA World Cup offers the chance to take one of 127 national teams through to the finals of the biggest football tournament on earth. Like all versions of EA's officially licenced game, it offers an authentic experience with superb presentation, and the Nintendo DS touch screen is used to good effect for adjusting tactics and controlling action replays. This makes the DS version a nice accompaniment to the tournament, but the lightweight gameplay won't keep players interested once the trophy has been lifted in Germany. As you'd expect from a World Cup game, you can play through the tournament as any of the qualifying nations with the aim of winning the final and lifting the cup. Thankfully, the tournament can be heavily customised by mixing up the group stages. You can randomise the group selection, seed groups to spread out the top teams, or simply swap with another team to play a different set of opponents. EA hasn't alienated supporters of nonqualifying nations either, as you can play through the qualifying stages as one of 127 teams. Your progress is saved to the cartridge as you progress, and you can even choose to simulate games if you'd prefer not to play them. The touch screen shows player position and lets you alter tactics on the fly... 2006 FIFA World Cup is reasonably fun to play, as long as you don't expect a handheld port of the home-console versions. You can link passes together with ease, and there's been an effort to offer depth with through balls, chipped passes, and stamina levels. However, scoring goals is still far easier when using a lone player running through the opposition as opposed to a more realistic team build up, and as a result, it can be incredibly easy to win games. While the game is generally polished in the graphics stakes, with cloud shadows and animated crowd details, the players themselves move awkwardly and never seem particularly connected to the ball. Even worse, the game slows down when there's too much going on, which means that whenever the camera is around the halfway line, it's noticeably more sluggish than when you're one-on-one with the goalkeeper. Although winning the World Cup with your favourite team is the main draw of the game, there are quite a few other modes to hold your interest. The single-player game lets you hone your skills against individual teams while controlling various factors such as pitch conditions and wind. You can also use this mode to reenact scenarios from real life, such as losing 5-0 at halftime, to see if you could change history. You can even set the number of red cards, yellow cards, and injuries your team has. Elsewhere in the main menu, the Global Challenge mode offers more longevity than the main World Cup, as it presents a scenario for each country and asks you to play through 127 different matches. These usually involve joining a match that's already underway and meeting certain conditions by the time the final whistle is blown, such as conceding no more than two goals, or simply ensuring that you win the game. As well as single-player modes, you can also play wirelessly with another DS owner. Unlike FIFA 2006, though, which was released seven months prior to this title, you cannot play a four-player game or use the game-sharing mode between two DS consoles. 2006 FIFA World Cup supports a maximum of two players, both of whom need a copy of the game. The touch-screen interface has been particularly well implemented for the DS, and being able to change tactics without pausing the game is a great feature. The bottom screen shows an overview of the pitch, letting you move players back or forth as a team by touching the relevant icon. You can also quickly choose to move into various positions, such as a counterattack or a zonal defence. While looking at two screens and coordinating these changes requires some level of multi-tasking, it's something that is unique to the DS version of the game. The touch screen is also used to control replays, letting you zoom in and out and change the camera view. Unfortunately, these can't be saved to the cartridge, which means that your finest moments on the pitch are only transitory. 2006 FIFA World Cup is a well-rounded package, with a number of bonus features and skill challenges. Instead of being mere practice sessions, skill challenges are well-designed minigames that help you improve your basic football skills, such as corner kicks and free kicks, as well as keeping possession. The game increases the difficulty of each test by adding more players, meaning your corner crosses will have to be more accurate and your strikers better positioned to score. There's also a trivia mode with questions about World Cup history, which has been separated into two sections based on difficulty. Succeeding in these modes will unlock World Cup posters, which are hardly an incentive, but these modes are enjoyable enough on their own. ...while you can also use it to control the camera during replays. EA's flashy presentation does a fantastic job of replicating the carnival atmosphere of the real competition. The menus are splattered with official logos, and after you choose your favourite team at the beginning of the game, menu screens will boast your flag and famous landmarks in the background. The menus also feature rhythmic dance and R&B music from artists such as the Black Eyed Peas, which while not particularly high quality, definitely adds to the razzmatazz of the package. Other audio can be weak, however, as the Clive Tyldesley commentary sounds tinny through the DS speakers, and the noise players make running with the ball sounds like someone hitting a balloon. 2006 FIFA World Cup is a nice package that accurately replicates the excitement of the World Cup. The presentation cannot be faulted, and EA has tried to include plenty of features to make sure that there's still something to do once you've lifted the trophy. Even though the touch-screen tactical interface is a nice touch, the game lacks longevity thanks to its complete lack of depth. Offering little to no depth and still falling victim to run-and-shoot tactics, the game quickly becomes repetitive. Without much competition on the DS, 2006 FIFA World Cup will satisfy football fans' thirst for the tournament, but it won't be a lingering memory once it's over."}