{"ref": "https://www.gamespot.com/reviews/3d-ultra-minigolf-adventures-review/1900-6169380/", "date": "April 19, 2007", "game_name": "3D Ultra MiniGolf Adventures", "text": "The original 3D Ultra Minigolf was a forgettable PC game from Sierra released in 1997, so it's curious that 10 years later, the follow-up game is being released. The sequel, 3D Ultra Minigolf Adventures is a bit of fun when played with friends, but the single-player experience is lackluster thanks to slow pacing and erratic physics. The available camera angles make it difficult to read the greens. There are a few different modes of play in Ultra Minigolf. You can enter a single-player tournament or play a multiplayer game both locally as well as online. You can even create and then play custom courses. Once you pick the game mode, you then pick from four generic characters: two male and two female. There are only a couple of outfits to choose from, but there are quite a few different ball designs available, so if you want to golf with an 8-ball-style ball, you can. There are 36 holes spanning three courses, and as you might expect, they're all in ~wacky~ locations. There's a carnival, an Old West ghost town, and a course in space. Despite the exotic settings, the actual courses are, for the most part, rather dull. Sure, there are all sorts of hazards--such as obnoxious scorpions that will push your ball around, hills, loops, and obstacles on each hole--but somehow, they're still straightforward, requiring very little creative shot making. It's odd that the developer was unable to make the game's 36 holes interesting because you can make some creative and fun holes with the game's course-editor feature, which is a breeze to use and probably the game's best feature. In a backward way, you'll come to appreciate the straightforward nature of the game because it doesn't provide you with the necessary tools to consistently make ultradifficult shots. You can choose from three different putting setups: single-tap, multi-tap, and use of the right analog stick. It's easy to get the power level you want with any of the three methods, but the problem is that the power level you think you want often isn't what you really want. The physics are so erratic that you never know how far the ball will actually go or how it will react when it hits something. Sometimes the ball will hit the side wall and bounce as you'd expect, but at other times, it hits the wall and flies over the edge out of bounds. It's quite difficult to judge the slope of the greens, so you'll often find yourself leaving the ball short or crushing it too far. There's also very little camera control. The default view is just behind your golfer, and you can zoom out for an overhead look at the hole, but you can't rotate the camera, so it's very difficult to judge shots on holes with twists and turns. The result of all these problems is a game that's quite frustrating. You'll be cruising along just fine until you have a meltdown on one hole, costing yourself any chance of victory in the process. In the single-player mode, the pace of play is quite slow. The tournaments are all 36 holes, which is too long for a simple arcade-style putting game. You also can't speed up the ball after you've hit it, which is particularly painful when the wonky physics decide that your ball needs to roll another 10 feet as slowly as possible. Thankfully, the multiplayer aspect is more fun. Because you're playing against other human opponents who are subject to the same gameplay issues as you, having a few bad holes generally doesn't kill the competition. It's also quite a bit of fun to blast your opponent's ball out of the way, even if you've got to go out of the way to do so. There are power-ups in both the single-player and multiplayer modes, but you'll likely find yourself avoiding them for a number of reasons: The icons for the good power-ups look a lot like the bad ones, many of them are ineffective, and they're quite often out of the way, so you're just wasting a shot trying to get them. The game's 200 achievement points are easy to get, but you will have to search around for a handful of hidden medals to earn them all. At least the achievement points are easy! 3D Ultra Minigolf has some nice graphics for a Live Arcade game. In fact, if it weren't for some low-quality textures and ugly water, you'd be hard pressed to believe the entire game was just a 43MB downloadable game. The courses are colorful and surprisingly detailed, with a nice amount of animation going on in the backgrounds too. The four available characters aren't going to win any awards for creativity, but they're large and have a bit of personality thanks to a few different animations that they perform after good and bad shots. The audio is bare bones, but other than the carnival course's grating theme, it isn't bad. While the real sport of golf translates well to video games, miniature golf generally does not, so 3D Ultra Minigolf was facing an uphill battle from the outset. It's not a flat-out bad game, but it's not particularly exciting, and its cause isn't helped by the bevy of gameplay issues. Even with these problems, it may be worth 800 points ($10) if your primary interest lies in playing with other people and you really enjoy putting, but unless you fall into that very specific group, you'll want to stay away."}