{"ref": "https://www.gamespot.com/reviews/grand-ages-rome-review/1900-6207446/", "date": "April 6, 2009", "game_name": "Grand Ages: Rome", "text": "You would need to have the smarts of a Cicero to keep track of all the Roman city-building games released in the last few years. Haemimont Games certainly isn't making this task any easier with Grand Ages: Rome. This generic city-builder set during the waning days of the Roman Republic looks and plays almost exactly like its ancestors; good luck telling the difference between the game and kissing cousins such as Caesar IV, CivCity: Rome, and, more to the point, Haemimont's own Glory of the Roman Empire and Imperium Romanum. Although there isn't anything outrageously wrong with this rehash of an old formula, it would be hard to think of a game that needed to be released this year less than this one. The glories of Rome are becoming a little tarnished. You can build only so many forums and raise so many legions before you get bored. Actually, Grand Ages: Rome has pretty much already been released twice. Predecessors Glory of the Roman Empire and Imperium Romanum, which arrived in stores in late 2006 and early 2008, respectively, are so similar to this game that it would be a challenge for even their developers to tell the trio apart. Grand Ages: Rome is really just a slightly reworked and patched-up Imperium Romanum with a new moniker, new box, new multiplayer, and a full retail price tag. The primary mode of play is still a solo campaign in which you manage the development of various cities across the Roman Republic in the decades immediately after the abdication of the dictator Sulla. This is a fascinating period of Roman history, given that it saw the rise of Julius Caesar and a nasty civil war that led to the creation of the Empire, but the era is much less interesting in city-building form these days because it has been beaten into the ground by game after game. So the new boss is the same as the old boss, with a few notable changes. Most conspicuously, this is a much more stable game than Imperium Romanum, which crashed continually on release last year. Everything certainly looks a great deal better now, in large part due to an attractive new interface that employs a radial dial to handle building commands and a greater use of color to make building types more distinctive. But there remain some lingering problems. The radial dial automatically closes after you make a single selection, which is annoying when you're trying to crank out a line of apartment buildings to create a neighborhood in the early stages of developing a city. Visuals also lose most of their fine details as soon as you pan back far enough to see your city from a playable camera height, so it's hard to really care much about the improved graphics. And online multiplayer has been added to the old feature set, including support for five different game types that let you build cities both competitively and cooperatively. The only problem is that adding multiplayer modes to a city-building game is a lot like answering a question that nobody asked. City builders have traditionally been for solo play only, so the audience interested in online play is likely pretty small. At any rate, it's almost impossible to find anyone in the online lobbies looking for a match. Aside from these marginal enhancements, Grand Ages: Rome is a carbon copy of a decade-old recipe in which you play city planner in the first century B.C. To build a successful city, you serve the basic needs of the low-end plebeians, which lays the groundwork to develop a strata of middle-class equites, and then sets the stage for the hoity-toity patricians. Each step up the social ladder has its own particular demands. Whereas the plebs are happy with basic water, bread, and sausages, the equites need tavern entertainment and the patricians insist on olive oil and linen clothing. However, it's fairly easy to meet these desires. As with Haemimont's earlier Roman city-builders, economics runs on rails, so you don't have to micromanage supplies. All resources are automatically gathered at their sources as soon as you build the appropriate buildings. For instance, to operate a pig farm, all you need to do is erect hog heaven itself and a nearby insulae apartment building for its pleb employees. To run a temple to Vesta, all that is required is the temple in question and an adjacent block of equite flats. Once the buildings are in place, you are guaranteed supplies until either a necessary resource runs out or something burns down (which happens so often that even the fire-fighting prefecture buildings frequently go up in flames). As with most city-building games, combat is a shallow waste of time in which you hurl one color of undulating blobs against another. Needless to say, if you have ever played a city-building game before, you won't need to bother with the tutorial here. There aren't any twists or turns, and the game's entire roster of buildings is actually available in the very first mission. You can mess around with trading, and there is a military angle to many missions, but these features are thinly developed. Trading is about as involved as loading a shopping cart, and combat is a dumbed-down exercise in mashing together columns of troops. The only variation to the familiar city-building formula is a role-playing angle wherein you guide an actual Roman family through historical situations that took place after Sulla retired in 79 B.C. Campaigns begin with you choosing to lead one of the five most infamous dynasties of the late Republican era, namely the Julii, Flavii, Aemilii, Lucii, and Valerii. Each comes with bonuses that play off of historical themes such as the Julii's popularity with the mob and the Aemilii's military expertise. You can even buff your family between missions by using talent points to buy special skills that help with everything from establishing trade routes to cutting the cost of recruiting soldiers, and your leftover denarii will let you purchase estates that will supply you with extra wood and stone. But these historical touches and RPG-lite mechanics add little to how the game plays, aside from opening things up a bit by following a post-Sulla timeline and giving you multiple mission choices. These additions ultimately add just a flimsy wrapper to the formulaic gameplay, regardless of whether you're using the Valerii research benefits while putting down the slave revolt of Spartacus, or even getting involved in the civil war between the Triumvirs for control of Rome. It's hard to get revved up about taking on Julius Caesar himself when all you're doing is building the same old pig farms and stone mines. After spending a few dozen hours with Grand Ages: Rome, it's hard to come up with many reasons why this game needs to exist. It is very similar to a game released just a year ago, and it adds very little to an overdone genre. Chances are good that fans of this sort of game already have sitting on their hard drives at least a couple of perfectly good ways to build Rome in a day."}