{"ref": "https://www.gamespot.com/reviews/super-monkey-ball-review/1900-6077081/", "date": "October 22, 2003", "game_name": "Super Monkey Ball", "text": "Super Monkey Ball started life as an arcade game that had a banana for a joystick. This Marble Madness-like arcade game found a wider audience in the US with its release on the GameCube, and a sequel soon followed. After that, Sega took its ball-rolling monkey simulator to the Game Boy Advance, which took the level of control down a notch or two, but it still did an admirable job of moving such an analog-friendly game onto a system without an analog joystick. Now that handheld version of the game has been placed onto Nokia's N-Gage with its multiplayer features stripped out and a slightly less-colorful appearance. Super Monkey Ball would have been a much better game if it had included multiplayer support in its minigames. Monkeys actually have very little to do with Super Monkey Ball. In the game, the monkeys are confined to balls, and you move a monkey-filled ball around by tilting the playfield in different directions. The N-Gage's two raised buttons are used to affect the angle of tilt you place on the playfield, giving you a touch of speed control over the proceedings. The object is to roll your monkey ball from the start of a level to the finish line, collecting bananas along the way. The courses are large, winding platforms suspended in midair, and as you proceed through the game's different levels and difficulty settings, the level design becomes more and more devious. A soft touch and a good sense of the level layout are key to doing well once the game gets tough. That brings up one of the game's problems. It's occasionally difficult to get a good idea of the size and layout of some of the game's levels due to the N-Gage's narrow screen, which cuts off much of the peripheral territory that was easier to see in the Game Boy Advance version. The game is broken up into different difficulty settings, each of which has its own set of courses. In addition to the main game, you can also unlock three minigames using points earned during the main game. However, the minigames were designed for multiplayer play. Considering that most of the other N-Gage launch games have contained support for multiplayer matches over the system's built-in Bluetooth support, it seems like a real oversight that Monkey Ball's monkey race, monkey fight, and monkey target games are only playable against computer-controlled opponents, which really isn't much fun at all. Graphically, the N-Gage does a good job of re-creating the 3D world of Super Monkey Ball, though it does it at a significantly reduced frame rate. It's smooth most of the time, but the game occasionally takes some noticeable dives, going so far as to completely stop for a split second when you pick up certain items. Beyond that and the reduced perspective offered by the N-Gage's vertically oriented screen, the game also doesn't look quite as colorful as its Game Boy Advance counterpart. Graphically, the N-Gage does a good job of re-creating the 3D world of Super Monkey Ball, though it does it at a significantly reduced frame rate. Repetition is the main point of the game's audio, which features most of the same great music from the other versions of the game, though it loops too often and really grates on your nerves over time. The sound effects are fine, but the repeated shrieks from your monkeys as you pick up bananas can be another source of frustration. Super Monkey Ball would have been a much better game if it had included multiplayer support in its minigames. Perhaps support for the N-Gage Arena service in the game's monkey race mode would have also been a nice touch. But without these features, Super Monkey Ball falls a little flat. The basic game is still worth playing if you're an N-Gage owner, but its no-frills feature list is a disappointment."}