{"ref": "https://www.gamespot.com/reviews/happy-tree-friends-false-alarm-review/1900-6193197/", "date": "June 30, 2008", "game_name": "Happy Tree Friends: False Alarm", "text": "Happy Tree Friends False Alarm is a side-scrolling puzzle game available on Xbox Live Arcade that requires players to safely guide a group of the overly cute Happy Tree Friends past levels filled with various environmental dangers. Although the Flash cartoon series found plenty of fans thanks to the imaginatively over-the-top violence it perpetrated on its characters, this game won't win many plaudits thanks to its unimaginative level design, poor AI, and clunky controls. Even diehard fans of the cartoon series may find this one tough to like, because instead of reveling in the insane amounts of violence and dismemberment that the titular woodland creatures go through in an average Flash episode, False Alarm tasks you with making sure that the friends avoid as much harm as possible as they traverse through 30 danger-filled levels. The basic gameplay structure is lifted straight from Lemmings; Happy Tree Friends characters Flippy, Flaky, Mole, Russell, and Nutty will blithely wander through a level, and it's up to you to make sure that they don't fall victim to the many traps and hazards along the way. At your disposal are four abilities: nitro will blow apart certain obstacles; fire will melt ice and make the friends run; ice will cover holes as well as freeze a friend in place; and the action ability is used to turn levers, press buttons, and more. Each of these abilities is mapped to one of the Xbox 360's four face buttons, and the left and right triggers are used to move along a level. It's more fun letting the little critters die than helping them reach the end of the level. Problems beset False Alarm from the get-go, given that the controls--particularly when you need to move the screen left or right to identify upcoming obstacles--are quite sluggish. Using the four abilities can also be quite frustrating because they sometimes don't respond unless your cursor is practically placed pixel perfect over the object that you're trying to affect (for example, some of the ice shards in the later levels). The friends themselves can exhibit some poor AI, and will often get stuck behind some pieces of the environment for no apparent reason (forcing you to restart a level). The game is also rather short, and you'll probably be able to blitz through the available 30 levels in an hour or two. Part of the reason it goes so quickly is that False Alarm's levels are blisteringly easy for the most part. Their unimaginative design means that you'll never have to think too hard about how a particular puzzle is solved. False Alarm does reward you with gold, silver, or bronze medals depending on how quickly you complete a level, but there's little other incentive to come back for more. False Alarm's graphics mimic the simple, clean, and colorful look of the animated series. The characters themselves are quite basic, but they do sport some appropriately gory injuries should you be careless enough to let them wander too close to hazards (exposed brains through cracked skulls are a highlight). The game's music also mimics the show's cheery theme tune, which is to say that it's upbeat and thoroughly annoying in equal measures. And as an added bonus, the game features a new Happy Tree Friends episode featuring candy addict Nutty ditching the sweet stuff and becoming hooked on video games instead. Underneath all of its bad points, there is a sliver of fun to be had with Happy Tree Friends False Alarm, particularly if you forgo the whole point of the game and just let the grinning friends meet their bloody end on the various obstacles that you'll come across. Unfortunately, with the game costing 800 Microsoft points, that sliver of fun isn't enough to earn this game a recommendation."}