{"ref": "https://www.gamespot.com/reviews/smashing-drive-review/1900-6114416/", "date": "December 3, 2004", "game_name": "Smashing Drive", "text": "As an arcade game, Smashing Drive was something of a laughing stock. Apart from the fact that it was a restrictive knockoff of Sega's Crazy Taxi, albeit with weapons, the ancient polygon graphics looked like they were rendered on whatever home video game console was popular in 1996--which wasn't so flattering for an arcade game that was produced in 2000. Conversions for the GameCube and Xbox followed, and while they were perfect duplicates of the arcade game, they were both soundly denounced by consumers and critics alike for the same reasons that the arcade game was. Ironically, the GBA conversion of Smashing Drive, recently published by DSI Games, also manages to duplicate the look and feel of the arcade game, but, for a variety of reasons, it doesn't seem like such a bad game by comparison. The simple ~drive fast and collect power-ups~ design suits a handheld that most people will likely play in short bursts, and the polygonal graphics that looked so ugly on the GameCube and Xbox look OK in light of what the GBA is capable of. It's you against the timer, and hundreds of oncoming cars. Developer Raylight Studios employed its Blue Roses graphics engine--the same engine used to produce the technically impressive Drome Racers in 2003--to reproduce the 3D courses and cars from the Smashing Drive arcade game. The GBA game doesn't push anywhere near the same number of polygons as the GameCube and Xbox versions did, but the loss of detail isn't terribly significant considering how simple the game looked in the first place. The combination of flat-shaded and textured polygons lends everything a futuristic look, and the system manages to keep things moving without too many hiccups. Certain graphically intense areas, such as the construction site and airport, had structures or details removed, but every shortcut and situation that was in the arcade game made it into the GBA game. If anything, the action moves a little too fast at times, but bumping and smashing into things isn't really discouraged. Nothing about the music or sound effects is particularly noteworthy, as you've no doubt heard the sounds of crunching metal and honking horns before. And while the vocal lyrics within the game's music clips are unique, they're not exactly spicy or memorable. When you play Smashing Drive, you get the feeling that the developers were trying to recollect back to a time when arcade-style racing games were simple and straightforward. The arcade mode consists of three cities, split into three courses and four additional bonus courses. The overriding goal is to take your taxi to the finish line before a preset timer expires. The best way to achieve that goal is to squash the accelerator, grab as many turbo power-ups as possible, and take as many shortcuts as you can find. Every course has at least three shortcuts here and there, some of which are rather amusing--such as one that launches you up the side of a skyscraper in pursuit of a giant gorilla. There are also plenty of ramps and midair tunnels that will send your taxi flying. Bumping into cars and crashing through trees and barricades will slow your taxi down, but not too much. Other power-up items can attach a plow to your taxi, give it a sonic cannon, or transform it into a glider. Any of these items pretty much allows you to drive through incoming traffic as if it weren't even there. Silly shortcuts abound, like this one that takes you up the side of a building after a giant ape. The game uses a character-based password system to keep track of progress instead of an automatic battery or flash-memory solution, and that lack of a battery-save is likely why Smashing Drive costs $10 less than most GBA games do. That's for the best, considering that it should only take players about an hour or so to learn where all the shortcuts are and to breeze through all 13 courses in the arcade mode. The cartridge also includes a survival mode and a head-to-head link mode. Smashing Drive for the GBA isn't a great racing game, and it certainly won't eat up weeks of your time, but it is fine for what it is: a simple, graphically impressive racer that can be played in short bursts."}