{"ref": "https://www.gamespot.com/reviews/halo-3-odst-review/1900-6228780/", "date": "September 21, 2009", "game_name": "Halo 3: ODST", "text": "You wake up all alone in a hostile city. Pockets of enemies are hiding in the nearly pitch-black environment and your allies are nowhere to be found. In the opening moments of Halo 3: ODST, you are vulnerable and aimless--two elements that have never been explored in a Halo game before. These quiet, moody scenes flow into the spirited, high-energy battles the franchise is known for, but this feeling of desolation never fully dissolves. ODST is an awesome entry in the franchise because it not only showcases the elements that have made previous games in the series so explosively fun, but it also introduces a handful of new ideas that add a unique spin on the classic formula. The most exhilarating of the new features is the Firefight mode, a cooperative battle against a never-ending swarm of covenant soldiers that is as intense and rewarding as anything that has appeared in the series. Whether you love the solitude of the single-player campaign, the camaraderie of cooperative encounters, or the blood lust of multiplayer competition, Halo 3: ODST is a fantastic package. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Halo 3: ODST Video Review ODST takes place before Halo 3, but you do not get to play as Master Chief this time. Rather, you take on the role of an orbital drop shock trooper dubbed ~The Rookie,~ and your job is to extract important data located far below the ruined city of New Mombasa before the Covenant gets its hands on the prize. As you can imagine, things do not go as planned, and you wake up from a horrible crash landing six hours after your allies hit ground. The city is bathed in darkness, with burned-out cars littering the streets and sharpshooting enemies hiding in deadly gangs waiting to ambush anyone who wanders near them. The story itself is nothing special, but the manner in which it is told is quite engaging. As you wander around this hostile environment, you will find pieces of equipment that your fellow soldiers left behind. When you pick up these items, you are transported to the past and get to play through the events that took place while you were knocked out. Your time spent as The Rookie is far different from what you might expect in a Halo game. It is slow-paced and largely silent. Your only companion as you methodically wind your way through these streets is a symphonic musical score that adds to the atmosphere and builds upon the loneliness of your situation. Your goal in these sections is to locate glowing beacons that will whisk you to the next chapter, but these areas are more than just a hub to take you from level to level. Even though these sections take place on Earth, the areas are as hostile and sterile as an alien planet, and exploring them has their own rewards. There are audio logs scattered all over the place, and piecing together events from the perspective of an innocent bystander during the invasion adds emotional depth to the situation. There are still enemies waiting to pounce, and you'll have to don your night-vision goggles so you aren't caught unaware. This view is rather jarring at first and casts the city in high-contrast light that is off-putting. This required overdependance on night-vision goggles dampens the moody ambience a bit, but these sessions are still an overwhelming success because of the strong feelings they evoke and the sharp contrast they provide to the main combat. The majority of the game plays out in the memories of your allies, and these levels strongly resemble the classic Halo action. The whole campaign can also be played with up to three friends. The explosive weaponry and industrious vehicles make their return from Halo games of the past, and they are doled out in tantalizing increments so that you always have a new toy to play with just before you tire of the last. Your abilities have been scaled back, which makes the action feels closer to Halo: Combat Evolved. You dont run as fast or jump as high, you cannot dual-wield weapons, and you can get hurt when you fall from too high. The health system has gone through the most impactful change. When you are attacked, your shield starts to dissipate, and when that is completely gone, your health begins to fade. Your shield can be recharged just by standing outside of combat for a few moments, but restoring your health requires medical packs. Because you can die much more easily in ODST than in Halo 3, you will have to approach combat in a more tactical way by skirting around the outside of the fray instead of rushing in guns blazing. Having to be constantly mindful of your own vulnerability in a Halo game is a welcome change of pace, and is a key element in some of the most thrilling situations in the game. The silenced submachine gun is one of the new weapons, though being quiet is rarely necessary. The early levels of ODST take place along the city streets of New Mombasa, and the buildings towering overhead give deadly hiding places for your many attackers. Every so often, a squad of enemies will ambush you, and you will have to fend off every last one of those Covenant assassins to progress through the level. These situations are intense and satisfying, placing enemies in optimal positions to make your life miserable. Snipers perching on balconies, sharpshooters dotting sky bridges, and kamikaze grunts flooding out of doors will constantly torment you. Trying to find cover when you're completely surrounded is a challenge in itself, so you'll need to make quick decisions and hope your aim is true. From the city streets, you make your way to wide-open plains, and this affords you a chance to test out the excellent vehicles once more. There are only a few levels that let you go on a joyride for a prolonged period of time, and the rarity of these occasions, coupled with the many ambushes and blockades you encounter, make these some of the best sections in the game. During one early stage, you hop on board a Ghost and tear through the Covenant alongside the ocean. This is an exhilarating sequence and gives you plenty of room to turbo down straightaways, crashing into anyone stupid enough to stand in your way, and there's just enough challenge sprinkled in to keep you on your toes. The most intense of the vehicle sequences occurs a little later in the game onboard a fleet of Banshees. The maneuverability of these agile flyers is on full display here, forcing you to wind around obstacles and strafe deadly attackers if you want to survive. What makes this section extra special is that it takes place at night, and your limited visibility adds a bit of fear to the excitement. The biggest downside in this campaign is the repetition of scenery in a few levels that creates an unwelcoming feeling of monotony. One of the last levels is especially guilty of this, laying out an endless line of similar-looking corridors and making the visuals far too repetitive. The fast-paced combat saves these sections from becoming boring, but they offer a sharp contrast to the excellence offered in the rest of the adventure. There is also one annoying visor quirk that you cannot escape. Whenever you are shot, your screen turns red and stays in this ugly hue until you fully recharge your shield. It doesn't matter if you are mortally wounded or just suffering from a flesh wound; the screen distorts your view, obscuring your vision for far too long. This is paired with an unnecessary beeping noise that will bore into your brain before long. Like the sometimes-repetitive level design, this certainly doesn't kill the thrilling action, but it's far from a pleasing effect. The campaign is shorter than those in previous games, but there is still plenty to do when you finish your quest. Firefight is the biggest addition to ODST, and it is a fantastic experience for anyone who enjoys shooting grunts and brutes. The rules are simple: You and up to three friends shoot down wave after wave of enemy attackers until your shared pool of lives has been exhausted. Each round presents more formidable foes than the last, so while you start out picking on hapless grunts, you quickly move on to heavily shielded jackals, screaming brutes, and hammer-wielding chieftains. Dynamic gameplay settings represented by skulls add to the difficulty and either hamper your own abilities, give your enemies new powers or, most likely, offer a combination of the two. For instance, during some rounds, your enemies will toss an endless stream of grenades your way; while in another round, you may have to land a melee attack to replenish your shields. The 10 Firefight levels force you to change your tactics, keeping the experience fresh and exciting. The lights have been knocked out in a large section of one level, so you must not only fight the enemies who are mercilessly trying to kill you, but you also have to be on guard from assaults in the darkness. Another level takes place on narrow pathways, and your enemies fly in from above, giving you no place to hide. A massive outdoor level stretches far off in the distance; here, a nondescript shanty provides the only reprieve from the open air, and your only other source of cover comes from some rock dotting the landscape. You can grab a warthog and gun down your foes in style, and if you can steal a Chopper from an incompetent brute, you can give yourself even more firepower. Every level forces players to work together. Because the ammunition is limited and your precious lives are shared, you have to defend each other at all costs, which makes for an intoxicating experience that continually sucks you back in to top your previous best score. The competitive multiplayer hasn't been forgotten, though it can't match the heights offered by the other elements of the game. The biggest strength and weakness of this mode is that it has been transported wholesale from Halo 3. If you would like to read how this works, please refer to our review of Halo 3. The only difference between this mode in ODST and Halo 3 has to do with the number of maps you can access. Halo 3 shipped with 11 maps and added 10 more with downloadable content. Those 21 are all included with ODST, along with three new ones, one of which is a remake of Halo 2's Midship. The multiplayer is as exciting as ever, but for those who have tired of the action, there aren't any new gameplay features to tempt you. For those who hunger for more, the new maps are well constructed, and the various play types--along with forge, film sharing, and all the other elements--are just as amazing as ever. The vehicle sequences are awesome even with the overused red effect. Halo is starting to show its age visually, but it can still wow at times because of the excellent artistic design. In open-air environments, ODST continually brings your focus to the background with stunning effects taking place far off in the distance. In one sequence, you can see a building crumble to dust as you tear down a road. In another, you are greeted by a haunting blood-red sky when you step outside. These impressive moments won't let you forget the awkward character animation during cutscenes, though, and the inconsistent lip syncing will make you pine for the days when your hero's face was hidden. The music, however, is without fault. This is the best score in a Halo game so far and perfectly complements the mood with a variety of well-constructed beats. The eerie musical score during the city levels is the most impressive, but it is often the absence of music that creates the biggest impact. The ambient noises outside of fights slowly build a nervous energy, and the music explodes when bullets start flying, which adds to the intensity. Halo 3: ODST is an excellent package. The delicate construction of the story adds a new wrinkle to the typical Halo plot, and the action-packed campaign levels are full of intense battles and surprising encounters. Firefight mode is a standout addition, crafting highly addictive cooperative battles for players to experience. It's disappointing that the competitive multiplayer hasn't received any updates or innovations from its Halo 3 incarnation, but it's as fun as it ever was, and well worth sinking more hours into if you haven't yet seen the many downloadable maps. ODST is a superb addition to the franchise and a must-play for anyone who craves top-notch action. The biggest downside in this campaign is the repetition of scenery in a few levels that creates an unwelcoming feeling of monotony. One of the last levels is especially guilty of this, laying out an endless line of similar-looking corridors and making the visuals far too repetitive. The fast-paced combat saves these sections from becoming boring, but they offer a sharp contrast to the excellence offered in the rest of the adventure. There is also one annoying visor quirk that you cannot escape. Whenever you are shot, your screen turns red and stays in this ugly hue until you fully recharge your shield. It doesn't matter if you are mortally wounded or just suffering from a flesh wound; the screen distorts your view, obscuring your vision for far too long. This is paired with an unnecessary beeping noise that will bore into your brain before long. Like the sometimes-repetitive level design, this certainly doesn't kill the thrilling action, but it's far from a pleasing effect. The campaign is shorter than those in previous games, but there is still plenty to do when you finish your quest. Firefight is the biggest addition to ODST, and it is a fantastic experience for anyone who enjoys shooting grunts and brutes. The rules are simple: You and up to three friends shoot down wave after wave of enemy attackers until your shared pool of lives has been exhausted. Each round presents more formidable foes than the last, so while you start out picking on hapless grunts, you quickly move on to heavily shielded jackals, screaming brutes, and hammer-wielding chieftains. Dynamic gameplay settings represented by skulls add to the difficulty and either hamper your own abilities, give your enemies new powers or, most likely, offer a combination of the two. For instance, during some rounds, your enemies will toss an endless stream of grenades your way; while in another round, you may have to land a melee attack to replenish your shields. The 10 Firefight levels force you to change your tactics, keeping the experience fresh and exciting. The lights have been knocked out in a large section of one level, so you must not only fight the enemies who are mercilessly trying to kill you, but you also have to be on guard from assaults in the darkness. Another level takes place on narrow pathways, and your enemies fly in from above, giving you no place to hide. A massive outdoor level stretches far off in the distance; here, a nondescript shanty provides the only reprieve from the open air, and your only other source of cover comes from some rock dotting the landscape. You can grab a warthog and gun down your foes in style, and if you can steal a Chopper from an incompetent brute, you can give yourself even more firepower. Every level forces players to work together. Because the ammunition is limited and your precious lives are shared, you have to defend each other at all costs, which makes for an intoxicating experience that continually sucks you back in to top your previous best score. The competitive multiplayer hasn't been forgotten, though it can't match the heights offered by the other elements of the game. The biggest strength and weakness of this mode is that it has been transported wholesale from Halo 3. If you would like to read how this works, please refer to our review of Halo 3. The only difference between this mode in ODST and Halo 3 has to do with the number of maps you can access. Halo 3 shipped with 11 maps and added 10 more with downloadable content. Those 21 are all included with ODST, along with three new ones, one of which is a remake of Halo 2's Midship. The multiplayer is as exciting as ever, but for those who have tired of the action, there aren't any new gameplay features to tempt you. For those who hunger for more, the new maps are well constructed, and the various play types--along with forge, film sharing, and all the other elements--are just as amazing as ever. The vehicle sequences are awesome even with the overused red effect. Halo is starting to show its age visually, but it can still wow at times because of the excellent artistic design. In open-air environments, ODST continually brings your focus to the background with stunning effects taking place far off in the distance. In one sequence, you can see a building crumble to dust as you tear down a road. In another, you are greeted by a haunting blood-red sky when you step outside. These impressive moments won't let you forget the awkward character animation during cutscenes, though, and the inconsistent lip syncing will make you pine for the days when your hero's face was hidden. The music, however, is without fault. This is the best score in a Halo game so far and perfectly complements the mood with a variety of well-constructed beats. The eerie musical score during the city levels is the most impressive, but it is often the absence of music that creates the biggest impact. The ambient noises outside of fights slowly build a nervous energy, and the music explodes when bullets start flying, which adds to the intensity. Halo 3: ODST is an excellent package. The delicate construction of the story adds a new wrinkle to the typical Halo plot, and the action-packed campaign levels are full of intense battles and surprising encounters. Firefight mode is a standout addition, crafting highly addictive cooperative battles for players to experience. It's disappointing that the competitive multiplayer hasn't received any updates or innovations from its Halo 3 incarnation, but it's as fun as it ever was, and well worth sinking more hours into if you haven't yet seen the many downloadable maps. ODST is a superb addition to the franchise and a must-play for anyone who craves top-notch action."}