{"ref": "https://www.gamespot.com/reviews/hitman-codename-47-review/1900-2658770/", "date": "November 28, 2000", "game_name": "Hitman: Codename 47", "text": "Hitman: Codename 47 is a game in which you strangle a man as he urinates in a storm grate. And that's only the beginning of the dark, adult subject matter. The game puts you in control of a trained killer who uses stealth and firepower to murder various thugs and criminals. Even if you like the basic premise and action of the game, a number of very serious flaws quickly sap its entertainment value. The frame story, such as it is, owes a large debt to the movie La Femme Nikita, or its Americanized version, Point of No Return. Your alter ego, the bald and nameless hit man, begins the game restrained to a bed in padded room. You're then greeted by a disembodied, Russian-sounding voice that orders you through a training course tutorial. Here, with melodramatic camp, he'll instruct you on how to use a garrote to strangle a dummy, drone on about the origins and technical specs of the AK-47, and largely annoy you. Oddly, your character never once stops to ask where he is, why he has a bar code on the back of his head, or who this talkative Russian is who's ordering him about. The main hint about the hit man's origins is a vague, uninformed, and potentially insulting introduction in the manual that compares science and religion and hints at Frankenstein-like attempts to outdo nature. The predictable truth about the hit man's origins is eventually revealed as you progress through the game. As you immediately learn in the tutorial mission, controlling the hit man can be a real chore. Your crosshair changes based on the weapon type you're holding, and it also changes when you move it over an object you can manipulate. When you right-click on the object, a pop-up menu lists your available options. So, with a dead body, for instance, you can drag it away from the scene to prevent suspicion, or you can don its clothes for a disguise. This system is clever in theory but annoying in practice, since you'll often click on an object and nothing will happen. But then you'll move the crosshair slightly, and then it suddenly works. Another control problem is actually in the lack of control on certain occasions. Instead of manually climbing or jumping at particular times, the hit man will automatically carry out those actions when at a junction that allows it, though you can only guess which those are. At other occasions, you'll inexplicably be able to climb ladders manually. What's even more surprising, given that the game emphasizes stealth, is that you can't go prone to hide or snipe. You'll also get frustrated at the frequency with which the hit man gets snagged on doors, chairs, and other objects. What really impedes control is the use of a third-person view. You can switch between two external camera views, but both are jerky and awkward. In the default view, movement and exploration inside buildings can be very frustrating as ceilings and walls sometimes partially block your view. A third-person view such as this doesn't work well in a game that requires situational awareness, stealth, and accurate aiming. The only time you get a first-person view is when sniping or using binoculars. Once done with the tutorial, you begin the main missions, in which you carry out hits for ~The Agency.~ Succeed, and you'll earn more money with which to buy new weapons and gear, though it's unclear why this agency that dictates your fate can't afford to just give you the weapons you need. You'll typically earn more than enough money to buy whatever you need regardless, which makes it a moot point. Then again, without the money there's no initial motivation to actually follow your orders. You don't know whom you're working for, why, or what would happen if you didn't obey - though you eventually do find out. The game is divided into chapters of multiple, related missions. These take place in exotic locales across the globe: You'll instigate a war between Chinese Triad gangs in Hong Kong; take out a drug lord deep in the rainforests of Columbia; stop a terrorist who plans to detonate a bomb at a world-peace conference in Budapest; and prevent a Russian gunrunner from selling nuclear weapons secrets in Rotterdam. Unfortunately, the gameplay is more frustrating than fun. In addition to the awkward controls and the camera's tendency of getting in the way, scripted cutscenes will begin at seemingly random moments, more often than not at the worst junctures, such as in the middle of a firefight. Your heads-up display constantly updates you with messages about enemies' status, so you'll know when one of them has discovered the body of a friend and is now alerted to something suspicious. How you can know the status of multiple enemies who are out of view is also never justified. For a game that lavishes so much attention on weapons in the training mission, this lack of realism is surprising. A sniper rifle can kill with one shot, but it can take five or six hits from a pistol or submachine gun to knock someone down. The hit man can also lug around two submachine guns, with one in his hand and one hidden in his suit coat, along with multiple pistols, ammo, and other assorted gear. He's more of a one-man army than he is a sly assassin. Although, in some missions, you'll definitely need all the firepower, as you'll have to take on a score or more of guards. You'll get the sense that the game can't decide whether it's a shooter or a more tactical ~sneaker,~ reminiscent of Thief: The Dark Project.One element of the missions that can have both a positive and a negative impact on your experience with the game is your frequent lack of information. In your briefing, you're given a very basic mission goal or two, a vague map, and a photo of your intended victim. But after that, it's up to you to figure out the best way to accomplish the job. This can be challenging at times and can makes Hitman seem like an adventure game as much as a shooter. The often-extreme lack of planning information can also make missions exceptionally hard, even on the easiest difficulty setting. More detailed intelligence and pre-mission planning, as in the Rainbow Six games, would have made the missions much more manageable. If you can get past the poor controls and nuisances of the mission structures, the stealth and combat sequences can be fun. The tension of trying to evade hordes of guards who react quickly and intelligently to threats can be really exciting. Their ability to navigate the levels and work in concert is superb. To avoid them, you'll have to lurk through alleys and across rooftops. You'll sneak up behind unsuspecting enemies and strangle them to steal their clothes for a disguise. Then you'll coolly infiltrate enemy strongholds. Just when you start having fun, the controls or a mission's vagueness will cost you your life. Normally, that would be no great tragedy in a game, but in Hitman you can't save your game during a mission. In a PC shooter that requires lots of stealth and experimentation, this design flaw is inexplicable. It doesn't add tension - it adds extreme frustration. Fortunately, some missions at least give you the option of restarting at the same place in the action when you die, in arcadelike fashion. Unfortunately, by the time you get killed, the mission is usually so bungled that you may as well start over from scratch. Although the gameplay can be frustrating, the graphics are a different matter entirely. Scenes, characters, and weapons are well detailed and memorable, and they are often beautifully rendered. Textures like carved wall moldings, peeling paint on clapboards, or exotic statuary and vases are vivid and crisp. The graphics are also richly and vibrantly colored, taking full advantage of the exotic locales. In the Hong Kong setting, the game makes full use of the bold, vivid hues of traditional Chinese decoration. Level architecture is at times exceptionally imaginative and immersive. Visual effects are equally stylish, particularly weapons fire. Smoke will waft in the breeze when you fire a gun, and rounds will ricochet off hard surfaces with a flash. Some other really nice effects are the first-person binocular and sniper scope views. With the latter, you'll actually see light glare off the bottom of the lens, and the view will bob slightly with your hit man's breathing. The animations are also convincing, and the way bystanders and guards suspiciously eye you by turning their heads as you pass is almost creepy in its realism. Still, there are a few flaws with the graphics, like overly dark areas and some odd draw-in texture shimmering in outdoor areas. The sound is almost as good as the graphics. The dark and brooding ambient score suits the grim mood of the game well. Weapons sounds are loud and vivid. Shell casings clink as they hit the ground, and rounds plink off metal. Doors, elevators, and other environmental sounds are also clear and realistic. However, guards and henchmen have a very limited repertoire of things to say, and their accents are often suspect too. While the missions of Hitman can be involving, there's ultimately little replay value in the game. Missions seem to be hard-scripted, in terms of both the events and their timing. There's often only one proper solution for each mission, and only a few minor variations are available each time. Hitman lacks the extensive open-endedness of a game such as Deus Ex, which is too bad in light of the generally excellent artificial intelligence of civilian and enemy characters in the game. After you've played through a mission in Hitman once or twice, there's little incentive to return to it. There aren't any multiplayer modes available either, though with its emphasis on stealth and disguise, the game wouldn't be particularly well suited to it anyway, unless it were in the form of cooperative missions. It's unfortunate that flaws like these, in addition to the awkward camera positioning, clunky controls, and excessive guesswork in the missions detract so much from the game. Still, some aspects of the game can be entertaining, particularly the lush graphics. Some of the design concepts of Hitman: Codename 47 have potential, but the game ultimately fails in the execution.One element of the missions that can have both a positive and a negative impact on your experience with the game is your frequent lack of information. In your briefing, you're given a very basic mission goal or two, a vague map, and a photo of your intended victim. But after that, it's up to you to figure out the best way to accomplish the job. This can be challenging at times and can makes Hitman seem like an adventure game as much as a shooter. The often-extreme lack of planning information can also make missions exceptionally hard, even on the easiest difficulty setting. More detailed intelligence and pre-mission planning, as in the Rainbow Six games, would have made the missions much more manageable. If you can get past the poor controls and nuisances of the mission structures, the stealth and combat sequences can be fun. The tension of trying to evade hordes of guards who react quickly and intelligently to threats can be really exciting. Their ability to navigate the levels and work in concert is superb. To avoid them, you'll have to lurk through alleys and across rooftops. You'll sneak up behind unsuspecting enemies and strangle them to steal their clothes for a disguise. Then you'll coolly infiltrate enemy strongholds. Just when you start having fun, the controls or a mission's vagueness will cost you your life. Normally, that would be no great tragedy in a game, but in Hitman you can't save your game during a mission. In a PC shooter that requires lots of stealth and experimentation, this design flaw is inexplicable. It doesn't add tension - it adds extreme frustration. Fortunately, some missions at least give you the option of restarting at the same place in the action when you die, in arcadelike fashion. Unfortunately, by the time you get killed, the mission is usually so bungled that you may as well start over from scratch. Although the gameplay can be frustrating, the graphics are a different matter entirely. Scenes, characters, and weapons are well detailed and memorable, and they are often beautifully rendered. Textures like carved wall moldings, peeling paint on clapboards, or exotic statuary and vases are vivid and crisp. The graphics are also richly and vibrantly colored, taking full advantage of the exotic locales. In the Hong Kong setting, the game makes full use of the bold, vivid hues of traditional Chinese decoration. Level architecture is at times exceptionally imaginative and immersive. Visual effects are equally stylish, particularly weapons fire. Smoke will waft in the breeze when you fire a gun, and rounds will ricochet off hard surfaces with a flash. Some other really nice effects are the first-person binocular and sniper scope views. With the latter, you'll actually see light glare off the bottom of the lens, and the view will bob slightly with your hit man's breathing. The animations are also convincing, and the way bystanders and guards suspiciously eye you by turning their heads as you pass is almost creepy in its realism. Still, there are a few flaws with the graphics, like overly dark areas and some odd draw-in texture shimmering in outdoor areas. The sound is almost as good as the graphics. The dark and brooding ambient score suits the grim mood of the game well. Weapons sounds are loud and vivid. Shell casings clink as they hit the ground, and rounds plink off metal. Doors, elevators, and other environmental sounds are also clear and realistic. However, guards and henchmen have a very limited repertoire of things to say, and their accents are often suspect too. While the missions of Hitman can be involving, there's ultimately little replay value in the game. Missions seem to be hard-scripted, in terms of both the events and their timing. There's often only one proper solution for each mission, and only a few minor variations are available each time. Hitman lacks the extensive open-endedness of a game such as Deus Ex, which is too bad in light of the generally excellent artificial intelligence of civilian and enemy characters in the game. After you've played through a mission in Hitman once or twice, there's little incentive to return to it. There aren't any multiplayer modes available either, though with its emphasis on stealth and disguise, the game wouldn't be particularly well suited to it anyway, unless it were in the form of cooperative missions. It's unfortunate that flaws like these, in addition to the awkward camera positioning, clunky controls, and excessive guesswork in the missions detract so much from the game. Still, some aspects of the game can be entertaining, particularly the lush graphics. Some of the design concepts of Hitman: Codename 47 have potential, but the game ultimately fails in the execution."}