{"ref": "https://www.gamespot.com/reviews/r-type-iii-the-third-lightning-review/1900-6092826/", "date": "April 2, 2004", "game_name": "R-Type III: The Third Lightning", "text": "You'd think that since R-Type III was originally a Super NES game that a developer would have no trouble converting it to the Game Boy Advance. After all, companies like Nintendo and Capcom sure haven't had any problems bringing games like Super Mario World, Final Fight, or Breath of Fire to the GBA--and usually with more features than the games had in the first place. The GBA version of R-Type III looks like its Super NES counterpart and generally plays the same, but its audio has been butchered, and the only things that have been added are a password save feature and a bunch of bugs that shouldn't have made their way into a retail product. In addition to the machine guns and lasers provided by the force device, you can also acquire helper pods that fire missiles and homing shots. What sets R-Type III apart from other side-scrolling shooters, such as Darius or Gradius, is that its levels are challenging even when there aren't any enemy ships around. Within each stage, there are various tunnels, mazes, and traps to get through. Some of these are simple--just follow the tunnel to the end and try not to crash into the ceiling or the floor. Others are a bit more complicated--either the entire background is rotating or you need to navigate through a maze laced with pulverizers and acid sprays. Enemy ships don't deluge the screen or swarm you with bullets. That doesn't mean they won't throw a few bullets your way; it just means that their firepower is reasonable and that they're mainly there to distract you so you'll forget about some other obstacle up ahead. There are spots where you need to be able to squeeze the ship through a tight opening or maneuver around enemies with barely a pixel or two of space to spare. The collision detection in the Super NES version of R-Type III was precise enough that you could make these close calls without much worry. The same isn't true of the GBA version. Bullets and structures that look like they should skirt right past your ship cause it to explode, even when there is visible space between the ship and the other object. This really becomes apparent in the second half of stage four, where you need to navigate the entire level while flying backward. The rear end of the ship has what seems like 10 pixels of vulnerable space behind it, which means that trapdoors and gunfire that aren't even visible on the screen yet can destroy your ship. Above all else, this is the flaw that absolutely renders the GBA port of R-Type III unplayable. Another interesting aspect of R-Type III is its force system. At the beginning of the game, you get to choose the type of support vessel that attaches to your ship whenever you pick up weapons. This support vessel is called a force device. Each force device has different uses for the three weapons available in the game. The force also functions as a shield, since it can absorb the majority of tiny bullets and debris that it runs into. The best thing about the force is that you have some control over how it's used. You can attach it to the front or rear of your ship or launch it up ahead or behind you to attack the enemy directly. Unfortunately, here too, the GBA version has problems. When you tap the L button to reattach the force to your ship, it crawls back at a snail's pace. In the original Super NES game, the force would return at the same speed at which it left--fast. Also, the force now seems to have the ability to pass right through solid walls. While this makes the game easier in a few areas, since you can take cover behind an object while the force does all the work, it usually makes the game more frustrating, since the force will often position itself in a corner of the screen where there aren't any enemies. Send the force device out to attack a boss' weak point directly. The collision and control problems aren't the only imperfections evident with this port. At first glance, the graphics appear to be identical to those found in the Super NES version. The viewable screen area was cropped in order to fit the game into the GBA's display dimensions but not so much that gun turrets or enemies are obscured by the score overlay at the bottom of the screen. All of the scaling and rotation effects have been left in, and the backgrounds look just as colorful now as they did back in the day. The bosses were big to begin with, but they seem even bigger on the GBA, thanks to the reduced screen height. Those of you who have played R-Type III on the Super NES will notice that developer Raylight Studios cut back on a few things. The launch sequence for the R-90 fighter at the beginning of the game has been removed, and there are fewer enemies here and there in every stage. These graphical edits are unfortunate, but they're insignificant compared to the butchery that was inflicted on the game's audio. The sound effects have been reduced to blips and beeps, while the music has been run through what can only be described as the MIDI sequencer from hell. R-Type III used to have a nice, futuristic rock music soundtrack. Now, the majority of instruments have been replaced by high-pitched squeals, and the drums in the background literally hiss like snakes. Not sweet garter snakes, but cobras, and they're not pleased at how this port turned out. For whatever reason--technical limitations most likely--Raylight Studios also axed the game's two-player mode. On the title screen where the ~2 Players~ option used to be is a new password-based resume option. At the end of each level, you're given a password that allows you to continue the game from that point. This isn't as convenient as an automatic, battery-backed save feature, but it's better than nothing at all. At least the passwords are only five characters long. It's depressing to think that Raylight Studios took the time to implement a save feature but didn't take the time to iron out the few bugs that totally suck the joy out of what is considered one of the best shoot-'em-ups ever released for the Super NES. R-Type III is a great game, on the Super NES, and if you haven't played it yet, you should do so--on the Super NES. The GBA version of R-Type III is a pathetic, wretched imitation of that great game."}