{"ref": "https://www.gamespot.com/reviews/bomberman-act-zero-review/1900-6157029/", "date": "September 1, 2006", "game_name": "Bomberman: Act Zero", "text": "Bomberman has been around for more than 20 years, and although the series is most definitely a classic video game franchise, it's been heading steadily downhill over the past decade. There have been a dozen or more games on platforms from the Nintendo 64 to the N-Gage, and the vast majority of them have been disappointing. But in what could be a stroke of pure marketing genius on the part of Hudson, a new game for the Xbox 360, called Bomberman: Act Zero, has been released, and it somehow makes all of the mediocre Bomberman games of the past 10 years seem fantastic by comparison. In fact, the only purpose Bomberman: Act Zero serves, and the only distinction it achieves, is to take the series to absolute rock bottom so there's nowhere left to go but up from here. What the heck happened to Bomberman?!? The first misstep of Bomberman: Act Zero is apparent even before you start playing the game. Act Zero eschews the charming, iconic style of the classic Bomberman games in favor of a grim, futuristic motif. Instead of the cute bubble-headed Bombermen, you get a couple of nondescript human characters outfitted with some cheap-looking armor (available in eight different colors). And instead of the bright, colorful, and creative stages of previous Bomberman games, you get a dark, dingy room to do battle in. Act Zero attempts to justify the new look with a new story. It turns out that there's an underground prison where humans are kept as test subjects. You are one of those humans, and you have to become Bomberman so you can fight your way through 99 repetitive, joyless levels to escape. There are three ways to play Bomberman: Act Zero. You can play on Xbox Live against up to seven other players in world battle mode, or you can play through as many of the 99 levels as possible with only one life and no continues in the single battle mode. There's no way to save your game and pick it up later in single-player mode, so if you want to beat the game, you have to play through all 99 levels in one go, which is difficult not so much because of the way the game challenges your gaming skills, but because of the way it challenges your patience. In Bomberman: Act Zero you are dropped into a rectangular room that's full of both breakable and unbreakable blocks. You run around in this area dropping bombs, destroying blocks, and collecting power-ups, with the ultimate goal being to blow up your opponent. There isn't too much strategy involved in the game. You just have to try to corner your opponent so he has nowhere to run from your bomb or surround him with bombs so he gets caught in the cross fire. That's easier said than done when you're battling several opponents at once, and if you aren't careful, it's easy to get blown up by one of your own bombs as well. That's the basic idea of Bomberman, and it's been that way forever. In Act Zero, however, Hudson decided to change up the rules for some reason. The new gameplay variation in Act Zero is called FPB, which stands for ~first-person bomber.~ Don't let the name fool you; it isn't actually a first-person Bomberman game. Instead, you get a behind-the-back view of your character as you run around the 3D level dropping bombs. Not only does this view make it much harder to see what's going on, but it's also frustrating because the nature of the game requires you to constantly and quickly change directions. Since the camera doesn't keep up with your movements, you have to constantly adjust your view with the right analog stick. The perspective isn't the only thing that's different in FPB mode. In this mode you have a health bar, which means that you can walk right into a bomb blast without dying. That's a major departure from the one-bomb-one-kill rule of classic Bomberman. The result is a completely watered-down version of the tense, frantic gameplay the series is known for. There is an option to play the game in standard mode, which is more akin to the classic Bomberman style of game. In this mode you have a top-down view of the entire map, which makes it much easier to see what's going on and doesn't require you to mess around with the camera all the time. In standard mode there's also no life bar. Instead, you die as soon as you get blasted. You can get special items that let you survive a blast, but for the most part the standard rules make the game a lot more interesting. First-person bomber mode is just as useless and unenjoyable as it sounds. In both the standard and FPB modes, you can collect a variety of power-ups to increase your offensive and defensive capabilities. You can get speed boosts, items to increase the range and number of your bombs, and special items that allow you to walk through breakable bricks. There are fewer than a dozen items in all, though, which makes the game feel simplistic and sparse even compared to the 16-bit games that were released more than 10 years ago. The multiplayer game in Act Zero is disappointing as well. For one thing, there isn't even an option for offline multiplayer. There are certain types of games that are just more fun when played with a room full of friends, and Bomberman is definitely one of those games. If you remember the days of playing four-player Super Bomberman 2 on the Super Nintendo Entertainment System, the lack of multiplayer in this game will seem like a massive oversight. At least there is online multiplayer available for up to eight players. You can battle it out in either ranked or unranked matches, and there is a world leaderboard so you can see how you compare to all the other unfortunate people who were duped into purchasing this game. You can choose to play either standard or FPB mode online, although, not surprisingly, standard mode is by far the favored choice of players online. Unless you convince plenty of other people to purchase this game, though, you'll have a difficult time finding a game with a full eight players. At most you might find three other players to battle with. Even if you do find a battle, the fun won't last long. Just as the rest of Act Zero, the multiplayer battles feel completely thin on content. There are a few items to collect, but just about every battle ends up feeling exactly the same because the game is so shallow. As if all that weren't bad enough, Bomberman: Act Zero looks and sounds bad as well. The graphics look like an early generation Xbox game. If you play in high definition, you'll see some shiny and bumpy textures, but the character models and environments still look ugly. The explosion effects come in two different colors, but they don't look impressive in any way. And just when you thought the game couldnt get any lower, you'll see ridiculous and completely unnecessary bouncing breasts on the female character model. The fact that the developer took the time to program something as asinine as breast physics but couldn't be bothered to fix the game is indicative of the quality of the overall effort in Act Zero. There are Xbox Live Arcade games that look better than this. The sound is no better than the visuals in Act Zero. There's a single, robotic female voice that tells you when you've passed a level or when you pick up an item, and there's one weak explosion noise, but beyond that there's very little to listen to in the game. There is a generic rock track that loops in the background, but it's so forgettable that you could mute the game for the same effect. Bomberman: Act Zero is nothing short of a complete rip-off, especially at full price. With only a couple of modes, no offline multiplayer, no save system, and a weak and repetitive single-player game, it has less to offer than many free demos on Xbox Live Marketplace. You can earn some achievement points by breaking a certain number of blocks, or by surviving a certain number of rounds, but it's not worth playing this game just to get the points. If Act Zero were released as an Xbox Live Arcade game for a fraction of the price, it might almost be passable. As it is, it's simply a waste of your time and money."}