{"ref": "https://www.gamespot.com/reviews/mysims-racing-review/1900-6212508/", "date": "June 24, 2009", "game_name": "MySims Racing", "text": "With each game they star in, the cheerful little square people of the MySims world take another step away from their simulation roots. Being cute, mischievous mascotlike figures, it was only a matter of time before they ended up in karts armed with silly weapons. Their first foray into racing isn't going to knock Mario off his kart-racing throne, but MySims Racing is a solid kart racer with a few nice tricks that breathe life into a stale genre. MySims Racing offers three modes for your driving pleasure--Quick Race, Story, and Multiplayer--but Story mode is the star of this vehicle. Your created character is on a quest to bring the excitement of racing back to the MySims world and foil the efforts of the evil Morcubus. The narrative is disjointed and is brought up infrequently, but it's lighthearted and adds some welcome variety to the standard kart-racing formula. Drifting earns you boost, but the cars handle so well that you rarely need to do so. Story mode is set up with a large overworld in the style of older kart-racing games, such as Diddy Kong Racing and Crash Team Racing. Unlike in those old kart-racing games, the world in MySims Racing acts as more than just a hub to cruise around between races. In addition to having a house and garage to visit for customization options, you'll find tons of MySims characters hanging around hoping to stop you for a favor. These favors usually involve picking up items littered around the map, driving a character to a different location, or cruising around a stunt course. The overworld is a great idea, and seeing other drivers zipping around and sims standing about creates the illusion of a real racing town, but the charm soon fades as the tedium of all those favors sets in. They are a nice distraction from normal races at first, but they get old quickly, because most of them offer little to no challenge. Unfortunately, completing at least some of these favors is required if you want to upgrade your vehicle. After you've dropped characters off at their destinations, they'll pay you in the MySims currency of crystals. Since there are a variety of crystals, you may have to do several favors to get the correct combination of crystals for a new part, which can be a real pain. The other modes, Quick Race and Multiplayer, let you jump into a race on any of the tracks against the computer or up to three other people. You can participate in single-card, multicard, and online races with up to three friends. The online options are serviceable but are nothing special. There are no battle modes here--just straight racing. However, it's nice that you can increase the difficulty of the computer-controlled racers if you don't have enough friends to fill out an online race. The actual racing doesn't break any new ground. There are weapon pickups sprinkled on each track for you to use during races, and you can drift, boost, and hop. It's familiar territory, but it plays well. The weapons are all generally tame, and you've seen them all before as homing missiles or red turtle shells, but they are well balanced. There's a spaceship that will transport you to first place, though it doesn't appear often enough to make the races unfair. You have to rely more on your racing skills to win in this game. And skillful driving is rewarded: first place earns you new blueprints for better parts. The customization options aren't as deep in the DS version as they are in the Wii game, but they still offer more than most racing games. You can buy items to change the weight, speed, acceleration, and other stats on your vehicle, as well as purchase a number of silly objects to make your car and driver look completely unnatural. Paying for the parts requires crystals, which requires doing favors, so you'll have to decide for yourself if that new spoiler is worth taking a few sims across town. The tracks are colorful and fun to drive through (as is the overworld), and they feature a number of shortcuts and exciting set pieces, like a volcano that leads to an underwater tunnel and a beach that takes you through a giant cruise ship. Not many of the tracks are challenging when it comes to sharp turns, but a few have some tricky ledges that will send you plummeting to your death if you're not careful. In the Wii version, staying in first place is easy as long as your car is upgraded, but the trickier levels and more aggressive AI in the DS version offer more-challenging races. Sweet ride. How many people did you have to taxi across town to buy it? If you've played Mario Kart on the DS, the controls should feel natural. You steer your vehicle with the D pad; operate the gas, the brakes, and boost with the face buttons; and hop and use weapons with the shoulder buttons. The car handling is tight, making the awkward overtwisting drift move unnecessary in many races, which is strange since drifting earns you boost. It takes a while to get used to drifting when there isn't a need for it except to earn a bit of boost for later. Overall, though, the controls are responsive and work great. The MySims franchise has slowly built up a cohesive style, with squared edges, vibrant colors, and cartoony characters, which are all present in MySims Racing. You won't experience any slowdown, and the draw distance is great for a 3D DS racer. You'll see mountains and trees far off in the distance and lots of little details in the small towns and other environments you speed through. The racing has a decent sense of speed, and it really kicks up when boosting. The music and sound effects will be familiar to anyone who has played a MySims game before; successfully completing events and collecting items result in the same chimes and rings from previous games. In a nice touch, the sounds of your tires change depending on the terrain, like the slap of wood when you go across a bridge or a soft grind when you race through the sand. The music is upbeat, and the sims frequently shout and jeer at each other in the gibberish sim language. The tedium of the favors (which feel more like chores) in town drags down the pace of what is otherwise a generally solid kart racer. If you've grown tired of driving as the sibling plumbers, or if you're just looking for a kart racer with a little more story and customization, this one is worth taking for a spin."}