{"ref": "https://www.gamespot.com/reviews/ct-special-forces-2-review/1900-6103667/", "date": "May 17, 2006", "game_name": "CT Special Forces 2: Back in the Trenches", "text": "The original CT Special Forces was a solid, character-based shoot-'em-up that obviously borrowed a great deal from SNK's classic Metal Slug series. Weapons such as the pistol, machine gun, and frag grenade worked in CT Special Forces in much the same manner that they did in Metal Slug. Furthermore, the characters and vehicles in both games shared the same exaggerated cartoon-style look. The main thing that made CT Special Forces unique was its level designs, which were set up with running, jumping, and climbing in mind. Conversely, Metal Slug has always been more of a ~shoot anything that moves~ kind of game. But, while it was solidly put together, CT Special Forces was pretty short at around 12 levels, and it really didn't provide the kind of variety--in terms of weapons and enemies--that players look for in today's action games. Luckily, sequels are an indelible aspect of our society. As a result, CT Special Forces 2 makes good in every aspect that the first game didn't. The similarities to Metal Slug are striking but so are the differences. Generally speaking, the follow-up looks, sounds, and plays like the original game--except that there are now more levels, more enemies, and more weapons. In addition, the helicopter stages have been expanded to include shot upgrades and mission objectives. Much like Metroid or Contra, the idea behind CT Special Forces 2 is that you're one person taking on an entire army of terrorists. As you run along and explore any of the game's 21 different side-scrolling levels, armed enemies pop from out of nowhere to take shots at you. The controls let you run, crouch, jump, and shoot in six different directions, and you'll need to use them to kill the enemies that get in your way so that you can reach the end of the various game levels. The levels are often mazelike, which means that in addition to gunning down terrorists, you'll also have to climb ladders, crawl through tunnels, and jump across ledges to successfully make it to the finish line. Enemy intelligence is decent, so your adversaries will crouch or pull back to establish better firing positions. The new levels also offer more places to go and more conduits for reaching them, such as ladders, ramps, tunnels, and hidey-holes. Also, a new roll move has been implemented that lets players squeeze into cramped areas. The resemblances to Metal Slug are more apparent this time around, not just graphically but in terms of weapons and vehicles as well. The previous game limited players to two or three weapons at a time. Here, within a few levels, you'll have access to the full stock of weapons, which includes a pistol, a shotgun, a machine gun, a flamethrower, a rocket launcher, and a grenade launcher. When you push the attack button while standing next to an enemy, your character will lash out with his knife instead of with his gun. If you've ever played one of SNK's Metal Slug games before, the weapons and knife setup should sound familiar to you. The real kicker is that CT Special Forces 2 also includes tank combat (a feature Metal Slug has had from day one), which the first game did not include. The enemy often shows up in armed jeeps, trucks, or tanks. In various spots in CT Special Forces 2, you can hop into abandoned tanks and use them just like the enemy does. Despite all of these similarities to Metal Slug, it's important to remember that CT Special Forces 2 plays much differently from SNK's game. Firstly, the levels emphasize exploration. Secondly, the enemies do their parts to both duck your bullets and find better shooting positions. Another unique aspect of CT Special Forces 2 is that every stage includes some sort of minigame task. In one, you have to open your character's parachute when a pair of indicators line up; in another, you need to stay put on the back of a truck for a few minutes while enemies shoot at you from jeeps and helicopters. In yet another, the view shifts to that of one from behind the crosshairs of a rifle, and you're supposed to shoot all of the terrorists in the distance before you run out of health. The top-view helicopter stages that were so sweet in the first game are back in the sequel as well. They're still fairly straightforward. You basically fire rockets and bombs at enemy helicopters and tanks while your helicopter slowly moves up the screen. But, for the sequel, the developers implemented shot upgrades and mission goals that greatly extend the amount of things you can do during these stages. If you come across an abandoned tank, you can jump into it. When the first game came out, everyone was quick to compare it to SNK's Metal Slug--and for good reason. CT Special Forces didn't outright take its backgrounds and character sprites from Metal Slug, but its characters, weapons, and backgrounds were drawn using the same colorful comic book style. From the fiery explosions and goofy enemy deaths, to the way shell casings dropped to the ground, the upstart GBA game managed to almost duplicate the look and feel of SNK's revered arcade favorite. The same comparisons hold true for the sequel, though the graphics have nonetheless improved significantly. There's much more to look at in the background, and the number of interactive spots, such as ladders, bunkers, and gun turrets, is much greater in the sequel. Along with the wider selection of enemies, more animation has been put into the characters. The CPU-controlled terrorists patrol their areas and transition into attack stances seamlessly, and when you gun one of them down, he dies in one from a handful of different choreographed deaths. At the same time, the increased selection of weapons and vehicles is augmented by an even greater variety of accompanying graphical effects, such as muzzle flashes, shell casings, shrapnel bursts, smoke, and dust. The only area that hasn't noticeably improved in the sequel is the audio. The music is still vaguely militaristic, which suits the action just fine. However, the real highlights are the many different sound and voice effects that go along with shooting and being shot at. Ultimately, CT Special Forces 2 is both a very good side-scrolling shoot-'em-up and a spectacular follow-up to the original game, but, like so many other similar games on the GBA, it doesn't really bring anything new to the genre, and it doesn't squeeze the most out of the hardware's visual or audio capabilities. With this in mind, if you enjoy games like Metal Slug, Contra, or Mega Man Zero, you'll probably be very happy with CT Special Forces 2."}