{"ref": "https://www.gamespot.com/reviews/youre-in-the-movies-review/1900-6201555/", "date": "November 21, 2008", "game_name": "You're in the Movies", "text": "You're in the Movies' camera-based gameplay promises lots of laughs, but delivers too many groans. The premise is to get in front of the camera for a series of minigames. As you swat-the-fly, chop-the-block, pull-the-rope, and run-in-place, the camera records your actions to be inserted into a movie at the end of the collection of games. Seeing yourself in a short movie is initially amusing, but the novelty wears off long before the credits roll. Running games are frequent and exhausting if done correctly. You can participate in 30 movies either by yourself or with up to four players. Within the collection are many genres: horror, sci-fi, action, disaster, and classic. The categories are pretty straightforward, but the movies are lame rip-offs of real Hollywood blockbusters. The filming of each movie is divided into four rounds to allow you to catch your breath, redefine your motivation, or just get ready for your close-up. Each player gets a turn at a one-versus-one competitive game or an individual challenge. Following each of the challenges in a round is the director's call to complete a couple pickup shots. This involves positioning yourself into an onscreen outline and looking scared, appearing to look down a well, or pantomiming wingless flight. The pacing isn't always bad, but when capturing footage for four roles, the experience can really drag. The minigames arent much fun; this is a problem in a minigame collection. Whether you're confined to a hamster wheel, being chased by a pack of monkeys, or competing in a footrace, the running-in-place games are no fun and come up far too often. The recognition of the user cutout is so sloppy that many pointing games (such as choosing which of six tiles bears the same inscription as the keystone) are almost completely unplayable in anything but the most controlled environment. Sometimes not even a plain background or a true green screen can be adequate enough to ensure your image is successfully captured. Everyday home environments are even less likely to translate to success. The problems with the final movies are not just how campy the writing is or how overtly the source material concepts have been ripped off, but also how poorly the actions you make fit within the roles of the movie. This is even more noticeable if you don't have four players. The game fills in any empty roles with footage of professional talent that was clearly captured with the movie performance in mind. You will see your broken images within elaborate settings, unevenly aligned with moving props, and frequently out of relative scale and image clarity compared to the other performers. Even worse, if you and the other players are competing for in-game score and a chance at winning the movie-ending awards ceremony, the best tactics for success are those least likely to fit within the movie. Running in place is tiresome compared to simply wagging your hand in front of the camera; it also happens to be a lot more effective at getting a high score. If you don't get a perfect score in one game, chances are good you will play it again many times down the line. The final movies are sometimes amusing, but quickly wear thin. Once you've grown weary of the dull writing, monotonous games, and annoying voice acting, you can make your own movies using the director's tools. You can piece together segments culled from the movies and then save them to share or drop them into the available movies to play. Using the headset, you can record dialogue, give instructions, or provide do-it-yourself sound effects. It is a nice touch, without the ability to play online, sharing the experience with friends is limited. Despite the pack-in camera, the problems of You're in the Movies drag this would-be game down, making the $60 price tag much too high to justify. There are better party games on the Xbox 360, and less expensive ways to get a Vision Camera."}