{"ref": "https://www.gamespot.com/reviews/inuyasha-secret-of-the-divine-jewel/1900-6167479/", "date": "March 15, 2007", "game_name": "Inuyasha: Secret of the Divine Jewel", "text": "It doesn't matter whether you follow the Inuyasha animated series or are merely looking for a role-playing game to play on your Nintendo DS--either way, you're liable to be disappointed by Inuyasha: Secret of the Divine Jewel. The game is a simplistic dungeon crawler that draws hardly any inspiration from the show it's based on. Nothing is fleshed out, the turn-based combat lacks excitement, and the whole quest would barely last a few hours if not for the excessive encounter rate that makes it impossible to walk more than a couple of steps before participating in yet another mindless battle. Secret of the Divine Jewel is a generic role-playing game with the Inuyasha characters tacked on. Previous knowledge of the animated series isn't required to play the game or to understand its story. The game recaps the basic plot of the TV series through comments in the dialogue, and all of the major characters are introduced in such a way that you'll quickly pick up on their overall roles. In the game, a new character named Janis has transferred to Kagome's school in modern-day Tokyo. Janis and Kagome strike up a friendship, and a series of coincidences leads to Janis discovering the magical well behind Kagome's house. Janis climbs into the well and follows Kagome back to feudal Japan, where she accidentally absorbs one of the pieces of the Shikomi jewel that Inuyasha and Kagome have been searching for into her body. Consequently, Janis discovers that she's the reincarnation of a powerful god. As a result of these events, Janis vows to seek out a specific demon that holds the secrets of her past, while the half-human, half-demon Inuyasha volunteers his group to accompany Janis on her journey in the hope that they'll eventually be able to retrieve the Shikomi shard that's been absorbed into her body. It isn't the most intelligent story ever concocted, but it does sufficiently explain why you'll spend the rest of the game hauling a party of six characters across feudal Japan and constantly engaging in turn-based battles with various demonic creatures. The game itself is a primitive Final Fantasy wannabe that mainly involves slogging through one random battle after another as you walk between villages and struggle to find your way out of mazelike dungeons. Exploration is kept to a minimum. Characters always tell you where to go next, and most dungeons require you to locate only a single key item in order to unlock the exit. Character development is also rather limited. You have access to all of their magic abilities from the beginning, so the outcome of grinding levels is merely that their strength, defense, and health statistics gradually improve. You can't change their weapons or clothing. In fact, the only pieces of equipment you can change are the orbs and amulets the characters carry, which you can't do until midway through the story mode. Nearly all of the interactions you have with the game occur during the turn-based battles that are initiated on a random basis as you move across the map. Characters have a good selection of close-up, ranged, and group attacks, and you can command multiple characters to attack a single enemy or to defend one of your own heroes. Battles tend to be boring and one-sided, however. Common enemies use the same attacks and don't dish out much damage. You also usually get to attack with three or four of your party members before a single member of the enemy group has a chance to reciprocate. Often, you'll be pulled into a battle only to end up back at the map screen 20 seconds later because you eliminated the enemy group before any of its members had an opportunity to do anything. Those boring battles are made all the more plentiful (and painful) thanks to the game's high encounter rate. In typical role-playing games that feature random battles, you're pulled into a fight perhaps every 20 steps or so. In Inuyasha, a battle is initiated every four steps on average. Occasionally, you'll come out of one battle and end up in another immediately after taking just a single step. That's excessive. It's difficult to learn the layout of an area when the screen transitions from the map to the battlefield every few seconds, and it's no fun to be forced to fight fodder enemies long after you've built up the necessary stats to trounce the next boss. If the encounter rate in Inuyasha were like that of other role-playing games, you could get through the story in roughly five hours. Instead, the encounter rate is so jacked up that it takes more like 20 hours to finish the game. Sadly, most of that time is spent eradicating cookie-cutter enemies that never get a chance to fight back. On top of everything else, the overall presentation is lackluster. Allusions to the animated series are limited mainly to the characters' attacks, which are all directly lifted from the TV show, along with a few bits of throwaway dialogue that reference past situations the characters have experienced. The gameplay barely draws any inspiration from the show. Movement, combat, and items are handled the same way as in every other generic role-playing game. The only noteworthy exceptions are that Inuyasha becomes human and you can't use his magic when the moon-phase clock shows a new moon. Furthermore, the graphics and audio suggest that the game may have been a Game Boy Advance game that was revamped for the Nintendo DS late in its development cycle. The 2D backgrounds and tiny character sprites are colorful, but there's not much in the way of animation or visual effects. On the map screen, the characters walk like robots, and the only life you'll notice in the environment are cloud shadows and the occasional stream. In the battle viewpoint, most attacks consist of two or three frames of animation, tops. Magic use is accompanied by a brief video sequence shown on the top screen. Those snippets are snazzy, but they're nothing the GBA couldn't handle. Thanks to the high encounter rate, you'll sometimes be sucked into another boring battle immediately after taking a single step on the map. Incredibly, the developer didn't bother to record any character speech from the show. Audio consists of a few low-fidelity clash and explosion noises, as well as about a dozen superbly orchestrated pieces of music. Movement and menu selections can be handled with the stylus or the buttons, so there's really no reason that this game couldn't have been released on the Game Boy Advance, apart from the fact that the Nintendo DS is the more popular system these days. Fans and nonfans alike should steer clear of Inuyasha: Secret of the Divine Jewel for the Nintendo DS. The only thing the game has going for it is the Inuyasha license. Otherwise, it's just a crummy Final Fantasy knockoff with weak visuals and audio that requires only 20 hours to play through because of its ridiculously high encounter rate."}