{"ref": "https://www.gamespot.com/reviews/pirates-of-the-caribbean-at-worlds-end-review/1900-6171600/", "date": "May 25, 2007", "game_name": "Disney Pirates of the Caribbean: At World's End", "text": "It's almost hard to believe in this day and age of movie and game tie-ins, but other than a couple of handheld games, the last Pirates of the Caribbean movie didn't have a companion game on consoles. Disney Interactive Studios is making up for lost time with Pirates of the Caribbean: At World's End, which features plotlines from both the second and third Pirates movies. While the game does a solid job of capturing the look and humor of the movies, it fails to emulate the films' action sequences very well. The combat is extremely simple, and you'll grow tired of mashing on the attack button well before you reach the end of the game. Fighting is so easy you can do it with your eyes closed. The first half of the game follows the events of Dead Man's Chest, specifically Captain Jack Sparrow's attempt to recover the heart of Davy Jones to avoid becoming a member of his crew, and it culminates with Jack's encounter with the Kraken. The second portion of the game sees Sparrow and his not-so-merry band of misfits joining together to take on Lord Beckett and retrieve the heart of Davy Jones once and for all. Even if you've seen the second film, the story is quite difficult to follow since it's told by way of short, disjointed cutscenes. You'll recognize several scenarios and locations from the movies, but there are many things you'll do that aren't in the movies. Most of your time in At World's End is spent as Jack Sparrow, though you'll also get to play as Elizabeth, Will, and a few other characters along the way. You'll sword fight your way from Tortuga to Singapore, which may sound exciting, but it's really not. You have both light and heavy attacks, as well as a close attack, and you can perform combos by stringing the attacks together. You have the same attacks on the Wii, but they're performed by waving the Wii Remote up and down or left and right. Note to developers: The Wii Remote doesn't make a good sword--it's imprecise, tiring, and, well, kind of dumb. Enemies literally appear out of thin air and put up little resistance as you pound the attack buttons or wave your arms like a madman. You earn new combos as you progress, but they don't look much (if any) different than the other combos; they're no more effective, and because the game does a poor job of registering movement, they're nearly impossible to pull off on the Wii. There's also a block button, but it's of little use because generally most of your damage will come from enemies who attack you from behind when you're dealing with a foe in front of you. If you turn and confront the person stabbing you in the back, you'll end up getting plunked by the guy you were originally dealing with. There are a handful of weapons, such as guns, grenades, and knives, which are scattered throughout for you to use. Unfortunately, they're not very useful. The grenades work OK, but guns and knives are particularly difficult to aim. If you mix up your attacks, you can raise your notoriety. The game makes a big deal about notoriety, but it's utterly pointless. A basic level is set up with a cutscene, and then you're given your objective. From there, you'll run around, fighting seemingly endless hordes of enemies who appear from out of the ground or just simply appear. You'll be trapped in an area by an invisible wall until you defeat the enemies. Once you beat them, you'll travel a short distance and then start the whole process over again. Sometimes there are brief scenarios where you must quickly press the button or direction that appears onscreen. They're not much fun, and you're too focused on the corner of the screen waiting for an icon to appear to actually watch the cool action sequence that's taking place, but at least it's something different than swinging your sword. These are much harder on the PC because you'll see a sword icon and have to remember not only what action it represents, but also what button you've mapped that action to. The levels are strictly linear, though it's easy to get lost because the game often does a poor job of explaining your objectives. There are also occasions where the icon for context-sensitive areas doesn't appear, even if you're standing where you should be. An arrow will sometimes appear below your character to help point you in the right direction, but it almost seems random as to when it appears. You have no control over the camera, which means you'll often get turned around--it cuts from one angle to the next with no warning (this makes the stealth sections extra frustrating). None of your objectives are particularly interesting, a fact made worse by the copious amount of backtracking you'll be doing. You'll occasionally get to play some minigames such as Pirate Dice and Poker. These are a strictly optional, but it's a nice way to break up some of the monotony of combat. The PSP version even supports ad hoc play and game sharing, as well as boasting Hearts as a third minigame. On the PlayStation 2, PC, and Wii, competitive multiplayer lets you take on swarms of enemies in timed challenges, and you can even duel against a friend. Their inclusion is a nice gesture, but the results are underwhelming. Of the PC, PSP, PS2, and Wii versions, At World's End looks best on the PC, though that's not saying a whole lot. The frame rate is generally steady on all versions, and there are some nice-looking attack animations, but there's very little else to get excited about. None of the versions have very good texture work, though the PSP's are about what you'd expect from the system and the PC's are at a higher resolution. The story is told via cutscenes that use the in-game engine, and while the characters do resemble their movie counterparts, they look quite poor--especially on the PSP, where their mouths don't move. The Wii version supports widescreen (as do all the other versions) and progressive scan, but it fails to impress in any way and looks exactly the same as the PlayStation 2 version. Character resemblances are there, but the models are junk. The game's audio is solid, albeit unspectacular. You won't be hearing Johnny Depp, Keira Knightley, or Orlando Bloom, but the soundalikes do an admirable job of filling their shoes. It's just too bad there isn't more dialogue to flesh out the story. The game uses the movies' soundtracks to punctuate the action, fading in and out depending on the situation. It's not the best score you've ever heard, but it fits the game well. The sound effects are good, but there's not enough variety to them. Granted, there's only so much that can be done with clanging swords, but there could have been more variety to the catchphrases that your foes yell when they attack. When it's all said and done, At World's End is a very by-the-book approach to a movie-based game. It has, and lets you play as, all the characters you'd want to play; it doesn't deviate from the movies' plots too much; and it takes you to many of the locations you see in the films. While those are good things, the game really would have benefited by taking some risks. The biggest problem is that you're playing as a cool character in an exotic location, but you're not doing anything interesting, just running around picking up items and hitting the attack button endlessly. Even if you're a huge fan of the Pirates trilogy, you'll probably want to pass on At World's End, especially the Wii version due to its terrible control scheme."}