{"ref": "https://www.gamespot.com/reviews/pirates-of-the-caribbean-at-worlds-end-review/1900-6171803/", "date": "May 31, 2007", "game_name": "Disney Pirates of the Caribbean: At World's End", "text": "Pirates of the Caribbean: At World's End for the Nintendo DS is an action adventure game patterned after the film of the same name. The game lets you control three of the main protagonists as you jump and stab your way through 30-some levels that loosely follow the progression of the movie. Fans of the movie franchise will appreciate how the 3D graphics bring places like The Black Pearl and Davy Jones' Locker to life, and also how the game's designers have taken care to concoct a balanced mix of sword fighting, swashbuckling acrobatics, and stylus-based minigames. Furthermore, anyone that was disappointed by the DS version of Dead Man's Chest should be pleased to learn that At World's End looks nicer and is more involved than that earlier game was. You'll control Elizabeth, Will, and Captain Jack as you swashbuckle through 30-some levels based on the movie. You'll have your choice of Elizabeth Swann and Will Turner during the first dozen levels, but a trip to Davy Jones' Locker eventually makes Captain Jack Sparrow available for the remainder. The game's story is generally faithful to the film's, although some events have been shuffled and some new plot points were created to cram more traveling and dueling into the overall journey. While the graphics are rendered in 3D, the action is 2D. The camera usually follows your character's movements from left to right like a typical 2D side-scroller, but the camera perspective will occasionally switch to a behind-the-back view when you climb ladders or walk deeper into the background. Getting through each level involves a fair amount of acrobatics in the form of jumping between platforms, climbing ladders, sidling across overhangs, and swinging between ropes. You'll also frequently make use of helpful items, such as a bamboo pole, torch, and grappling hook. Breaking open crates and barrels will give you coins, health refills, and different special weapons that you can unleash on enemies. As you make your way through a level, you'll encounter pirates and other armed foes that you can do battle with. By pushing the buttons, you can make your character block, jump, and chain together attacks using a sword. Before an enemy lunges in with an attack, an icon will appear indicating that you can perform a stylish counterstrike by tapping the X button. Solitary foes can be dealt with by repeatedly mashing the attack button, but fights against two or three opponents require a strategic mix of blocks and counterstrikes. You'll ~die~ if you run out of health or fall into the water. On the whole, the game isn't all that challenging. There are some tricky jump sequences and hectic battles here and there, but checkpoints are plentiful and you can continue as often as you need to. People complained that the previous game, which was based on Pirates of the Caribbean: Dead Man's Chest, was a linear romp that didn't offer many weapons or chances to explore. At World's End responds to those complaints by offering a wider variety of weapons and attacks as well as letting you wander off onto side paths that lead to items that you can collect to eventually extend your health bar or unlock bonus levels. This game also makes better use of the system's touch-sensitive screen. You change weapons by dragging them around on the touch screen and some tasks, such as picking treasure chests and repairing door locks, involve completing minigames that require quickly drawing lines or rotating gears with the stylus. Every couple of levels or so, you'll participate in a duel with a major villain, during which you perform different attacks by drawing lines and shapes on the touch screen. When it comes time to deal the finishing blow, you have to draw a simple pattern that's shown to you for only a split second. If you flub up, you'll need to dish out a couple more regular attacks before the finisher prompt appears again. A pirate ship serves as the hub between levels. On board, you can talk to various crew members to learn new attacks and to switch characters. There's also a Liar's Dice game below deck that's played entirely using the stylus and touch screen. The nice thing about duels and the minigames is that they're brief and generally don't get in the way of the game's button-based acrobatics or group sword battles. You won't be impressed by the audio, which mostly consists of looped movie music and a few frequently repeated spoken phrases, but the graphics are clean, and the overall presentation matches the movie's atmosphere. The characters resemble their movie counterparts, they move fluidly, and the backgrounds are full of plants, signs, and other details that evoke the movie's locations. Levels are split into small, manageable sections, no doubt to help the system display the 3D environments, characters, and flowing waterways without grinding the action to a halt. Texture quality varies, but the 3D environments are reasonably intricate and generally look good. The previous game was plagued by muddy textures, disappearing polygons, and other graphical glitches. This game doesn't suffer from any of those flaws. Levels contained within the same area tend to recycle the same enemies and set pieces, though, so you may experience the occasional fit of burnout from that. These pirates can't swim. Fall into the water, and you'll restart from the checkpoint. In terms of length, it'll probably take you about eight hours to complete the game, with another hour or two on top of that if you intend to find all of the hidden map pieces and unlock all of the characters in the two multiplayer games. The multiplayer games, unfortunately, are nothing special. You can play Liar's Dice with as many as four DSs sharing a single copy of the game. Or, if you know someone else that has the game, you can participate in duels using any of more than a dozen characters. Fans of the movie will likely be pleased with Pirates of the Caribbean: At World's End for the Nintendo DS. Despite a few reasonable dalliances, the presentation and story progression remain faithful to what was depicted in the film. Meanwhile, the game itself delivers a balanced mix of acrobatics, combat, and exploration that fits with what you'd want to be able to do as Captain Jack in a video game."}