{"ref": "https://www.gamespot.com/reviews/devil-kings-review/1900-6135475/", "date": "October 11, 2005", "game_name": "Devil Kings", "text": "Devil Kings is a flashy, fast-paced button masher in the vein of the inviolable Dynasty Warriors series. Actually, it pretty much is Dynasty Warriors, if Dynasty Warriors decided to abandon its ancient Chinese roots and go all crazy fantasy-action on everybody. Although the game borrows liberally from its contemporaries, Devil Kings manages to have fun with the formula by removing any sense of pretension or seriousness, leaving a game that's not only accessible, but also a lot of fun to play. Devil Kings puts a fresh spin on the tried-and-true Dynasty Warriors formula. The story is an entirely fictional account of a great struggle between several insanely overpowered warriors in a setting that somewhat resembles feudal Japan. Each warrior has a unique--if rather gimmicky--personality and fighting style. You don't get much background info when you start up the game, and the limited amount of depth the story has is revealed entirely through the goofy interactions between characters in the frequently rendered cutscenes. These cutscenes have a sort of Tekken 5-style of ridiculous humor going for them, and it's a great showcase of these badass warriors' foibles and follies between battles. Granted, these scenes don't do much for the story, but they're fun nonetheless. Oddly, the serious storytelling is done through several lengthy and well-done anime-style sequences. It's a bit strange to switch between rendered and animated cutscenes, but it's still entertaining to watch events as they unfold between battles. When you begin the game you can choose to play as one of six characters, each with unique weapons and special moves. By completing conquest mode with each character, you'll unlock six more playable characters. Each character has the basic health, attack, and defense stats, which improve as you play with that character. Every character has a darkness, fire, ice, or lighting elemental attribute as well. These elements are manifested in the form of special attacks and special weapon enhancements. The character designs showcase an interesting mix of styles. There's the wicked Devil King, who wields both a sword and a shotgun; Lady Butterfly, whose elegance and beauty belie deadly skill with a pair of revolvers and a chaingun; and the strange little girl named Puff, who lives in the frigid northern regions, wields a massive hammer, and speaks with a Dixie accent. You could say the characters are bizarre, but each one is interesting and varied enough to make it worth your time to play through each of the campaigns. Most of the gameplay in Devil Kings takes place in conquest mode. In this mode you are basically given a territory as your home base, and from there you must conquer all of the other territories on the map. There are 15 territories in all, and some characters start out with more than one. You can choose where you want to go next while you're on the map screen, as long as it's adjacent to a territory you own. You'll then engage in a battle at the contested stage, and if you win you'll take over that territory. Sometimes you can battle for multiple territories in a single mission, so in that case there aren't actually 14 separate missions in each campaign. You can play the game as one of six different characters, with six more to unlock when you beat the game. Once you have chosen your battle, you are taken to a prep screen where you can equip your character with items and assign abilities. Each character has two slots for special abilities, in addition to one super-ability. These special abilities have to be learned, so you won't have them early on in the game. You can equip three items to your character: armor, weapon, and an accessory. The weapons and armor affect your attack and defense stats, respectively. The accessories have a wide variety of effects, from hit-point bonuses to experience boosts. All of these items are earned in battle by picking up special treasure chests, which you usually get by defeating officers on the battlefield. There are tons of items to collect in the game, and those items carry over even after you've completed conquest mode. It only takes an hour or so to complete conquest mode, but it's nice to be able to go back and play through it again at a higher difficulty setting with all the items and experience you collected your first time through. The battles in Devil Kings are pretty simple, but they're also quick and satisfying enough to be fun. In most of the stages you start out at one point on the map, and you have to fight your way to another point on the opposite end of the map, where you'll fight a boss character. Some missions mix things up a bit. For example, you fight a boss, defeat him, and then he runs away. So you have to hop on a horse and chase him down, which isn't too easy with an army of angry soldiers standing in your way. For the most part though, all the missions simply require you to kill as many bad guys as possible and save enough energy to survive the boss fight at the end. Each character has a unique weapon and plenty of really slick-looking moves. You have plenty of moves at your disposal while in battle. There are two basic attacks available, which can be strung together to form some lengthy and fluid combos. Pressing the square button performs a basic attack, while pressing the triangle button performs a stun attack, which primes the enemy and fills up your Fury Drive gauge. Once the Fury Drive gauge is full, you can hit the circle button to unleash a superattack. These attacks usually hit all enemies in the surrounding area, so they're a great way to get out of trouble when enemies are swarming you. You can also use boost attacks by hitting the R1 button and either the square or triangle button. These are special attacks that you learn as you gain experience with a character, and the attacks have to be assigned at the preparation screen. In addition to the special moves and basic attacks, you can also perform aerial attacks, which are unique for each character. For instance, the shuriken-wielding Venus can jump into the air and summon a hawk to carry her for a short distance as she attacks enemies on the ground. All of the moves are easy to pull off, and the characters look slick and stylish performing them. Since the moves are so easy to pull off, most of the time you'll just be alternating between mashing the triangle button to fill up your Fury Drive gauge, and mashing the square button to finish guys off. The screen is often completely filled with enemies as they swarm around you, which really adds to the sense of chaos on the battlefield. There's a lot of variety to the enemies as well. You'll see the standard archers, footmen, and cavalry, but there are also huge fat guys that pull boulders from the ground and hurl them at you, and suicide runners who carry massive bombs on their backs and run at you. There are even giants who stand in place and swing massive logs that crush everything in their way. The fact that you're always facing different types of enemies helps keep the game more interesting than simply slashing your way through crowds of faceless soldiers. Devil Kings looks fairly average for a game of its type. The stages are quite large and they are convincingly arranged with gates, buildings, lakes, rivers, and trees. Some levels also take you indoors for a few fights, and while the interiors aren't particularly ornate or detailed, the transition is handled well. You probably won't spend much time enjoying your surroundings though, since the action never lets up for too long. Despite all that crazy action, the frame rate holds up quite well throughout the game. The character animations are also smooth, though obviously more so with the main characters than with the enemy units. The only problems with the visuals in Devil Kings are the heavy fog and the frustrating camera. The draw distance in the game is pretty short, and often whole groups of enemies will pop in and out of view as you move on the battlefield. This is somewhat excusable, since you'll mainly be focused on what's happening in your immediate vicinity. Unfortunately, it's sometimes difficult to focus on what is happening in your immediate vicinity because the camera tends to be uncooperative from time to time. You can hit the L2 button to snap the camera behind your character's back, but the action is so fast and hectic that the quick angle change can feel rather jarring. You can also move the camera with the right stick, but that isn't very feasible when you are in the midst of a fight. For the most part, you don't necessarily need to see what is around you since you can just mash buttons and hit everything nearby. But it can be frustrating to fight a boss you can't see because of the camera angle. The graphics aren't too spectacular, but at least the frame rate is nice and steady. The sound in the game is also about average. The soundtrack is made up of fast-moving, electronic tunes that fit in the background well, but never have much of a presence. All the battle sounds are about what you would expect. The weapons clash, clang, and boom in the right spots, but they aren't at all forceful. The character voices are campy, and while some sound just fine, others are rather annoying. It doesn't help that you'll often hear the same few phrases repeated over and over in battle. Devil Kings is a solid button-mashing action game that isn't afraid to have a little fun at the expense of its characters. The gameplay is nothing new, but it's simple and satisfying enough that you'll want to stick with it for awhile to unlock the extra characters and collect all the items in the game. If you're a fan of Dynasty Warriors but are looking for something outside the realm of ancient China, you'll definitely have a blast with Devil Kings. The battles in Devil Kings are pretty simple, but they're also quick and satisfying enough to be fun. In most of the stages you start out at one point on the map, and you have to fight your way to another point on the opposite end of the map, where you'll fight a boss character. Some missions mix things up a bit. For example, you fight a boss, defeat him, and then he runs away. So you have to hop on a horse and chase him down, which isn't too easy with an army of angry soldiers standing in your way. For the most part though, all the missions simply require you to kill as many bad guys as possible and save enough energy to survive the boss fight at the end. Each character has a unique weapon and plenty of really slick-looking moves. You have plenty of moves at your disposal while in battle. There are two basic attacks available, which can be strung together to form some lengthy and fluid combos. Pressing the square button performs a basic attack, while pressing the triangle button performs a stun attack, which primes the enemy and fills up your Fury Drive gauge. Once the Fury Drive gauge is full, you can hit the circle button to unleash a superattack. These attacks usually hit all enemies in the surrounding area, so they're a great way to get out of trouble when enemies are swarming you. You can also use boost attacks by hitting the R1 button and either the square or triangle button. These are special attacks that you learn as you gain experience with a character, and the attacks have to be assigned at the preparation screen. In addition to the special moves and basic attacks, you can also perform aerial attacks, which are unique for each character. For instance, the shuriken-wielding Venus can jump into the air and summon a hawk to carry her for a short distance as she attacks enemies on the ground. All of the moves are easy to pull off, and the characters look slick and stylish performing them. Since the moves are so easy to pull off, most of the time you'll just be alternating between mashing the triangle button to fill up your Fury Drive gauge, and mashing the square button to finish guys off. The screen is often completely filled with enemies as they swarm around you, which really adds to the sense of chaos on the battlefield. There's a lot of variety to the enemies as well. You'll see the standard archers, footmen, and cavalry, but there are also huge fat guys that pull boulders from the ground and hurl them at you, and suicide runners who carry massive bombs on their backs and run at you. There are even giants who stand in place and swing massive logs that crush everything in their way. The fact that you're always facing different types of enemies helps keep the game more interesting than simply slashing your way through crowds of faceless soldiers. Devil Kings looks fairly average for a game of its type. The stages are quite large and they are convincingly arranged with gates, buildings, lakes, rivers, and trees. Some levels also take you indoors for a few fights, and while the interiors aren't particularly ornate or detailed, the transition is handled well. You probably won't spend much time enjoying your surroundings though, since the action never lets up for too long. Despite all that crazy action, the frame rate holds up quite well throughout the game. The character animations are also smooth, though obviously more so with the main characters than with the enemy units. The only problems with the visuals in Devil Kings are the heavy fog and the frustrating camera. The draw distance in the game is pretty short, and often whole groups of enemies will pop in and out of view as you move on the battlefield. This is somewhat excusable, since you'll mainly be focused on what's happening in your immediate vicinity. Unfortunately, it's sometimes difficult to focus on what is happening in your immediate vicinity because the camera tends to be uncooperative from time to time. You can hit the L2 button to snap the camera behind your character's back, but the action is so fast and hectic that the quick angle change can feel rather jarring. You can also move the camera with the right stick, but that isn't very feasible when you are in the midst of a fight. For the most part, you don't necessarily need to see what is around you since you can just mash buttons and hit everything nearby. But it can be frustrating to fight a boss you can't see because of the camera angle. The graphics aren't too spectacular, but at least the frame rate is nice and steady. The sound in the game is also about average. The soundtrack is made up of fast-moving, electronic tunes that fit in the background well, but never have much of a presence. All the battle sounds are about what you would expect. The weapons clash, clang, and boom in the right spots, but they aren't at all forceful. The character voices are campy, and while some sound just fine, others are rather annoying. It doesn't help that you'll often hear the same few phrases repeated over and over in battle. Devil Kings is a solid button-mashing action game that isn't afraid to have a little fun at the expense of its characters. The gameplay is nothing new, but it's simple and satisfying enough that you'll want to stick with it for awhile to unlock the extra characters and collect all the items in the game. If you're a fan of Dynasty Warriors but are looking for something outside the realm of ancient China, you'll definitely have a blast with Devil Kings."}