{"ref": "https://www.gamespot.com/reviews/legend-of-kay-review/1900-6133888/", "date": "May 17, 2006", "game_name": "Legend of Kay", "text": "Legend of Kay is a martial arts platformer starring Kay, a feisty young cat who has to save the world for all the peace-loving animals in the forest. The game sticks very close to the tried-and-true Zelda formula, with plenty of combat, platforming, puzzles, and minigames. And while it may have a couple of technical issues and lacks the scope and detail of a Zelda game, Kay's heart is in the right place, and it pulls off a great action adventure game for people of all ages. This game plays a lot like the Legend of Zeldaif Link were a ninja cat. The story in Legend of Kay takes place on the mythical island of Yenching, where four animal tribes--rabbits, frogs, cats, and pandas--live in harmony. Despite the fact that they come from different species, these animals are able to coexist because their spirits are nourished by the waters of life that flow from the fountains in each of their villages. These waters are enriched by a magical song stone that is in each fountain. In addition to drinking magical water, the four clans thrive because they live by The Way, a disciplined and peaceful doctrine that keeps everything on Yenching in balance. Over the years, the clans have become lazy and have strayed from The Way. This, unfortunately, leaves them vulnerable to attack from some of the other animal tribes on the island. The gorillas and rats join forces and seize the villages in an attempt to conquer the island. This is great news for Kay, a young orphan cat who is eager to put his martial arts skills to use by fighting the invaders. Kay eventually has to defeat the rats and gorillas in order to restore peace to the island and bring everyone back to The Way. What's the best way to restore peace to the land? With some crazy ninja combat and platforming action, of course! The cute, furry characters in Legend of Kay belie a fairly deep and complex fighting system. Kay is proficient with a sword, a hammer, and a set of claws, so there are plenty of ways to cause some major damage. Each type of weapon has its strengths and weaknesses, in addition to its own set of special moves and combo attacks. For example, the claws are swift and they can inflict heavy damage on unarmed enemies, while the hammer is slow but it can pound right through even the toughest armor. You can hit the square button to perform a basic attack, which you can string together to form combos. You can also perform an aerial attack, as well as a special attack, which is done by crouching down, jumping up, and then attacking in the air. It doesn't end there though, as you can also roll up to an enemy and hit with a powerful lunging attack. Taking a page from the Wind Waker, the game lets you roll around behind an enemy by pressing the triangle and circle buttons simultaneously. Once behind an enemy you can score an easy attack, or hit L1 to perform a throw move. If you need to take care of a big group of enemies, you can hold the square button to charge up your magic attack, which hits all enemies in your area with a powerful shock blast. It may sound complicated, but combat is frantic, challenging, and quite satisfying. There's an interesting mechanic in Legend of Kay that factors into both the combat and platforming parts of the game. When you have a combo, you can hit the triangle and press in the direction of another target, and you'll teleport to that target so you can strike it and keep the combo going. Often, targets are way up in the air, but that isn't a problem for Kay. This teleportation maneuver can be used to move between several enemies at once, but it's also used to traverse gaps and solve puzzles. Throughout the world, there are floating pagodas called zhongs that you can target and smash to earn combos. You'll often see a string of a half-dozen zhongs, so you have to hit one, warp to the next one, hit it, warp to the next one, and so on. It's tricky at first, but once you get the timing down it's a lot of fun to zip around. Later in the game, some of the zhongs can only be destroyed with a certain weapon, so as you are warping and attacking all over the place, you'll also have to switch weapons before you fall to the ground. It gets especially difficult when you can't see your next target. But there are handy arrows at the edges of the screen that show you which direction to go. Combat is fast and fun, but unfortunately the frame rate isn't able to keep up. The rest of the platforming is pretty standard in Legend of Kay. In addition to a double-jump, Kay can also swing on ropes, wall-jump, and swim. There are tons of platform-jumping challenges in the game, and some of the rooms you'll find in the various dungeons are as huge and complicated as anything Link ever had to face. The only problem with all the jumping is that the camera is often uncooperative. You can use the right analog stick to adjust it as you see fit, but if you're up against a wall your viewing options are limited. And when you're running and jumping off crumbling platforms while avoiding enemies, you don't have time to fiddle with the camera. While in dungeons, you'll have to solve some basic puzzles to go with all the fighting of enemies and jumping between platforms. The puzzles are fairly simple and involve pushing blocks and hitting switches. None of the puzzles will take more than a minute or two to figure out, but at least they keep you thinking. There are also several racing games in Legend of Kay. These races pop up throughout the game and you have to finish them in order to progress. You'll ride boars, wolves, dragons, and boats through lengthy, twisting courses. It doesn't make a lot of sense in the context of the adventure, but the races are fun and, if nothing else, they provide a slight diversion from the rest of the game. There are all kinds of dungeon puzzles and platform-jumping sections to keep you busy when you aren't hacking and slashing. As you jump around and slice bad guys to bits, you'll collect various treasures and keys to aid you in your journey. You can get items to help you in battle, such as berserk potions, bombs, or bottles of hornets. You can also find upgrades for each different type of weapon, as well as various types of armor. There are also colored crystals throughout the game that you can collect to earn points. If you collect several of the same colored crystals in a row, you'll get a score multiplier. So to get a high score, you have to be careful which color crystals you pick up and in which order. High scores will unlock bonuses like pictures, videos, music, models, and more. Legend of Kay looks great, with colorful stages, detailed characters, and a visual crispness that's pleasing to the eye. The stages and the characters are varied enough to stay interesting. The special effects for magic and attacks aren't too overblown, but things like flaming swords and magic lightning do add a bit of extra flare to the combat. There's a lot of detail to be found in the world too, from the flies buzzing around a boar's head to the grass that gently sways in the breeze. The character animations are likewise detailed. For example, Kay's tail will quickly bob up and down when he runs, but will lazily sway back and forth when he's standing still. And although he has mostly human characteristics (he walks upright and has furry hands and feet instead of paws), the game does a good job of reminding you that he's still a cat, like when he crouches and lays his ears back against his head like he's about to pounce. The only visual problem with Legend of Kay is the completely broken frame rate. When you're fighting a lot of enemies, the game slows to a crawl almost every time. It really is a shame, because everything about this game seems to exude care and effort on the part of the developer, and then it is spoiled by something as simple as an unsteady frame rate. The English voice acting in Legend of Kay is some of the worst you'll ever hear. The sound in Legend of Kay is equally fantastic and disappointing at the same time. The music is excellent, with fully orchestrated tracks that have a distinctly Asian feel. The voice acting is where the sound falls apart here. You can listen to the dialogue in French, Spanish, or English, but the best option is to just turn off the voices altogether and rely on the subtitles. Part of the problem is that the dialogue is terrible. When talking to rats, you'll hear the term ~cheesebreath~ used over and over, but it isn't even funny the first time. Kay's voice is so terrible that it completely takes you out of whatever scene or sequence you're involved in. Do yourself a favor and turn off the voice acting before you even start playing the game, because once you hear it you won't be able to take the characters seriously for the rest of the game. Legend of Kay is a great action adventure game overall, and it's fairly lengthy, too. You can easily spend 12 hours playing through it, or even longer if you're out to find all the secrets. If you can get past the horrible voice acting and unfortunate frame rate issues, you'll be won over by the solid gameplay and undeniable charm of Legend of Kay. While in dungeons, you'll have to solve some basic puzzles to go with all the fighting of enemies and jumping between platforms. The puzzles are fairly simple and involve pushing blocks and hitting switches. None of the puzzles will take more than a minute or two to figure out, but at least they keep you thinking. There are also several racing games in Legend of Kay. These races pop up throughout the game and you have to finish them in order to progress. You'll ride boars, wolves, dragons, and boats through lengthy, twisting courses. It doesn't make a lot of sense in the context of the adventure, but the races are fun and, if nothing else, they provide a slight diversion from the rest of the game. There are all kinds of dungeon puzzles and platform-jumping sections to keep you busy when you aren't hacking and slashing. As you jump around and slice bad guys to bits, you'll collect various treasures and keys to aid you in your journey. You can get items to help you in battle, such as berserk potions, bombs, or bottles of hornets. You can also find upgrades for each different type of weapon, as well as various types of armor. There are also colored crystals throughout the game that you can collect to earn points. If you collect several of the same colored crystals in a row, you'll get a score multiplier. So to get a high score, you have to be careful which color crystals you pick up and in which order. High scores will unlock bonuses like pictures, videos, music, models, and more. Legend of Kay looks great, with colorful stages, detailed characters, and a visual crispness that's pleasing to the eye. The stages and the characters are varied enough to stay interesting. The special effects for magic and attacks aren't too overblown, but things like flaming swords and magic lightning do add a bit of extra flare to the combat. There's a lot of detail to be found in the world too, from the flies buzzing around a boar's head to the grass that gently sways in the breeze. The character animations are likewise detailed. For example, Kay's tail will quickly bob up and down when he runs, but will lazily sway back and forth when he's standing still. And although he has mostly human characteristics (he walks upright and has furry hands and feet instead of paws), the game does a good job of reminding you that he's still a cat, like when he crouches and lays his ears back against his head like he's about to pounce. The only visual problem with Legend of Kay is the completely broken frame rate. When you're fighting a lot of enemies, the game slows to a crawl almost every time. It really is a shame, because everything about this game seems to exude care and effort on the part of the developer, and then it is spoiled by something as simple as an unsteady frame rate. The English voice acting in Legend of Kay is some of the worst you'll ever hear. The sound in Legend of Kay is equally fantastic and disappointing at the same time. The music is excellent, with fully orchestrated tracks that have a distinctly Asian feel. The voice acting is where the sound falls apart here. You can listen to the dialogue in French, Spanish, or English, but the best option is to just turn off the voices altogether and rely on the subtitles. Part of the problem is that the dialogue is terrible. When talking to rats, you'll hear the term ~cheesebreath~ used over and over, but it isn't even funny the first time. Kay's voice is so terrible that it completely takes you out of whatever scene or sequence you're involved in. Do yourself a favor and turn off the voice acting before you even start playing the game, because once you hear it you won't be able to take the characters seriously for the rest of the game. Legend of Kay is a great action adventure game overall, and it's fairly lengthy, too. You can easily spend 12 hours playing through it, or even longer if you're out to find all the secrets. If you can get past the horrible voice acting and unfortunate frame rate issues, you'll be won over by the solid gameplay and undeniable charm of Legend of Kay."}