{"ref": "https://www.gamespot.com/reviews/akibas-trip-undead-and-undressed-review/1900-6415846/", "date": "September 10, 2014", "game_name": "Akiba's Trip: Undead & Undressed", "text": "The fact that a game called Akiba's Trip: Undead & Undressed isnt completely tasteless might be its greatest accomplishment. This is a beat 'em up in which the ultimate goal is to strip all enemies of their clothing--a premise that proves a difficult hurdle to leap. The camera draws attention to the skimpy underwear and bouncy breasts of your bloodthirsty foes as you methodically expose their bodies, but--believe it or not--it goes beyond simple eye candy. The goofy story does its best to justify the sheer volume of bare skin, and the equal spread of male and female characters means you'll see just as many lacy undergarments as you do tighty whities. Unfortunately, Akiba's Trip just isn't any fun to play, and that makes the incessant panty shots and uninspired humor even more difficult to stomach.Bear with me as I explain the convoluted narrative. You enter Akihabara, Tokyo's electronics district, during an outbreak of vampiric foes called Synthisters. These powerful enemies were once human, but now roam the streets hoping to suck the life energy from the city's unsuspecting residents. Your customizable protagonist, along with a medley of colorful freedom fighters, commit themselves to cleaning up their home the only way they know how--by stripping the opposition down to their undergarments. Like actual vampires, Synthisters are sensitive to the sunlight, so revealing their skin causes them to burn and return to human form.The yarn unravels to expose seedy corporate involvement and a series of unlikely villains, but it isn't enough to mask the disquieting nature of Akiba's Trip. You spend the bulk of your time ripping off as much clothing as possible to expose nearly naked anime bodies to the world, which is intended to be the real draw here. Stripping bosses will often lead to more detailed views of their often unrealistic, hand-drawn figures, so if it's scantily-clad anime bodies you're looking for, you'll find them here in spades. The unremitting innuendos within the dialogue only weaken the already thin narrative justifications for the partial nudity, and while the focus on bare skin isn't the only attraction, I still felt uncomfortable with what was being asked of me.You can party up with both male and female freedom fighters when patrolling the streets, but most of your time will be spent impressing your buxom allies. How you choose to respond during conversations determines whose affection you garner, and there's even a set cast member who can provide updates on which woman in your life has become the most smitten with you. It's a mostly shallow mechanic that leads to extraneous exchanges during otherwise heated scenarios. Talk of how you're going to save your city or discover the source of the Synthister menace is often followed by awkward complimentary phrases aimed at your busty childhood friend.Even if you manage to overcome the fact that Akiba's Trip: Undead & Undressed is about stripping enemies down to their skivvies, you won't be rewarded with much more than a mindless brawler.The carnal themes and prosaic dialogue would be a bit more palpable if the game played well, but repetitive combat and a painfully inconsistent framerate muddy the action. In battle, you're often surrounded by five or more enemies at once, swinging a weapon at each foe's head, body, and legs in order to score a knockout. A combination of high, mid, and low attacks damage the different pieces of clothing to their breaking point, making it easier to strip them right off of someone's body.You can combo these strips together if multiple articles of clothing are weak enough to remove, but this strategy isn't enough to spice up an otherwise tedious process. Breaking down the pants, shirts, and hats of a swarm of foes as you protect the durability of your own wardrobe is a chore, and your ability to restore your clothes to full strength during battle by holding down a single button removes any semblance of tension. The systems aren't broken, and less populated arenas tend to produce smoother, more enjoyable action, but I had less and less fun with the mechanics as additional enemies flooded the screen.The combat's lone saving grace comes in the form of upgradeable weapons, each of which has its own set of unique combinations. Heavier objects like arcade monitors deal serious damage, but your character lumbers with each swing. Boxing gloves, on the other hand, allow for more nimble striking--though you'll often focus on a single enemy at a time instead of the full group. It's enjoyable to find, buy, and upgrade different objects with varying attributes, and the same can be said for your clothing. Whether you prefer to go into battle sporting a three-piece suit or nothing more than a tattered pair of brown slacks, youve got options. There's little to do outside of the nonsensical story and lackluster battles. The main quests often take you from the home base to a different segment of Akihabara that's been invaded by Synthisters, while the side missions drag you through dull fetch quests and additional combat scenarios to earn extra spending money. There's a New Game Plus feature that opens up fresh character customization options, but I had more than my fill of Akiba's Trip well before the storys resolution.Even if you manage to overcome the fact that Akiba's Trip: Undead & Undressed is about stripping enemies down to their skivvies, you won't be rewarded with much more than a mindless brawler. The monotonous combat only grows more tiresome as you progress, and it's almost too easy to predict the twists and turns of the formulaic plot. Akiba's Trip has a bizarre concept that might turn a few heads, but once you strip away the promiscuity, there's little left to keep your attention."}