{"ref": "https://www.gamespot.com/reviews/mlb-11-the-show-review/1900-6306225/", "date": "March 28, 2011", "game_name": "MLB 11: The Show", "text": "How badly do you want a roster update? That's the big question you need to ask yourself when contemplating a purchase of MLB 11: The Show for the PSP. The latest edition of Sony's baseball simulation adds little to its two most recent predecessors aside from some minor tweaks to gameplay and new Major League rosters for the 2011 season. While this is still the best baseball game out there for a handheld, if you have either last year's game or the 2009 model, you can skip this year and check back next spring. AI pitchers are believably imperfect in this year's game. With that said, there's no denying how good MLB 11: The Show is on the diamond. This PSP game includes a lot of the best features of its PlayStation 3 big brother, which has been the best arcade baseball sim for a number of years. Most of the key modes of play are included. The role-playing-like Road to the Show leads the way, letting you create a wannabe slugger or ace and guide him to major league stardom. You can also take control of a team in season play, manage a club from the dugout, play one-off exhibition matches, and crank dingers in the home-run derby. All of the MLB rosters have been given an overhaul to reflect offseason signings, so Carl Crawford is now with the Red Sox, Adam Dunn is with the White Sox, Jayson Werth is with the Nationals, and so on. Online support was strangely pulled from the PSP version of the game after 2009, but you can still play ad hoc games against friends locally. There is also no option for full franchise play controlling a club over multiple seasons, nor are there any training modes to help you with pitching, batting, or fielding. Despite lacking a number of common features, this is a game with a great deal of depth. Road to the Show is much the same as it was in past years, so plate appearances remain all-or-nothing deals. Fail in your goal, and either you come away with zero training points to be put toward skill improvements or you actually get docked. This system is neither as fair nor as authentic as the PS3 game, which handed out points even for failures. On that platform, for example, batters got rewarded for such things as working the count, hammering the ball deep, or doing just about anything else to keep the opposing hurler on his toes. This system should have been ported over to the PSP. On the diamond, MLB is as strong as ever. Gameplay basics are similar to those in the past couple of games. Just about every pitch, swing, and fielding attempt plays out exactly as it does in real baseball. The pitcher-batter duel has been tweaked a bit to add even more realism. AI pitchers have more chinks in their armor. Their control isn't as perfect as it has been in past years, leaving you free to take more pitches and work counts. You absolutely have to take your time in the batter's box, because if you flail at everything and anything, the pitcher recognizes this and starts throwing balls all over the place. Pitching isn't quite so lifelike, due to AI batters that all seem to have the eye of Ted Williams. It can be hard to get them to chase anything out of the zone. Strikeouts are more commonplace than before, but you still have to go right across the plate with meatballs far too often to avoid walks. That giant glove isn't the only park feature that's able to catch the ball. Controls remain the same. You use a meter to pitch, the face buttons to bat and field, and the nub to move around. Things generally work as expected, although the pitching meter is a bit off. It moves too slowly when you have nobody on base and too fast with runners on board. It's also a little hard to see the sweet spot that you need to nail to properly get the ball over the plate. The default camera is set back a bit too far, which can cause some issues when you're fielding fly balls. Misjudging flies and letting routine pop-outs go to the wall are too common because the tiny size of your fielders skews your perspective on balls in the air. Little has changed with the look of the game in recent years: the player models remain mostly recognizable, the stadium architecture befits the real summer shrines (even if they are awfully jaggy in spots), and the animations are dead-on when depicting players taking cuts, diving for grounders, and so forth. One infrequent but significant stadium quirk involves line shots getting caught up in the wall, leaving AI outfielders unable to get to the ball. This invariably results in in-the-park round-trippers, but at least it's a rare occurrence. Audio quality and quantity are spectacular. Most of the soundtrack from the PS3 edition of the game has been ported over, including the biggest songs, like MGMT's ~Congratulations.~ And the play-by-play and color commentary from Matt Vasgersian, Dave Campbell, and Rex Hudler remains informative, with a lot of varied observations about the on-field action. Virtually all of their lines have been held over from past years, though, and the fact that Hudler is still kicking around here after being replaced in the PS3 version of the game by Eric Karros tells you all you need to know about how much the broadcast booth has been updated. Player animation is impressive for the most part. If you haven't bought a handheld version of The Show for a couple of years, then by all means dive into the best portable baseball game out there. Taken completely on its own, MLB 11: The Show plays an outstanding game of baseball and comes highly recommended. But if you already have either last year's game or its predecessor, think for a few moments how badly you want an updated roster set and an upgraded pitcher-batter duel, because that's about all the new stuff you're getting here for your $30."}