{"ref": "https://www.gamespot.com/reviews/dead-or-alive-4-review/1900-6141693/", "date": "January 1, 2006", "game_name": "Dead or Alive 4", "text": "Fashionably late to the Xbox 360 launch, Dead or Alive 4 is an impressive feat of a fighting game that boasts some excellent, fast-paced action in addition to terrific good looks. Best of all, you can play it online over Xbox Live, virtually guaranteeing you'll find tough, unpredictable competition at any hour. Back when the old Xbox first debuted in 2001, Tecmo's Dead or Alive 3 served as one of the system's showcases, at least as far as its graphical horsepower was concerned. However, 2004's Dead or Alive Ultimate took a much bigger step forward, mainly because it introduced the ability to compete against other players online. Dead or Alive 4 is similar to that game (right on down to the near-identical menu system), but it adds several new characters, new moves and abilities for returning characters, and a beautiful new coat of paint to all the proceedings. It doesn't defy the conventions you've come to expect from playing other fighting games, but it's about as slick, fully featured, and exciting as fighting games get. DOA4's lightning-fast fighting action is better than ever on the Xbox 360, so get online and start getting beat up. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Dead or Alive 4 Video Review DOA4 doesn't reinvent the wheel. It's nearly identical to Dead or Alive Ultimate in terms of its feature set, and the gameplay itself also arguably hasn't changed much, depending on how you look at it. On first impression, this is good old Dead or Alive, all right. The fighting is really easy to get into like always, and if you're a veteran of the series, you can still rely on many of the same moves and strategies that have served you well in past. Yet the more you play, the more you'll pick up on the combined impact of all the numerous new and changed moves for returning fighters, unique layouts of the different arenas, and tweaks to the fighting engine. Essentially, this game has a smoother, more tactical, even faster, and simply better feel than its predecessors. More importantly, the gameplay is some of the most highly refined and dynamic that you'll find in any fighting game these days. And because of the substantial selection of playable characters and good assortment of interactive arenas, there's a lot of variety where it's needed. At the heart of every match type in Dead or Alive 4 is a contest between two fighters trying to knock each other out using various punches, kicks, throws, and reversals. There are tag-team matches where you may control a pair of fighters by quickly switching between them during the bout, but even these boil down to a one-on-one fight. As you'd probably hope from an intense martial arts competition, aggressive tactics are the order of the day--overly defensive or hesitant players tend to get slaughtered. But those who punch and kick with reckless abandon are also easy targets, since reversals and well-timed counterblows can be used to crush careless opponents. A healthy roster of nearly two dozen unique fighters is available (a handful of them are hidden at first), and though their moves and fighting styles are all different, the same basic controls apply to everyone. These controls are deceptively simple, but by using simple directional motions on the D pad together with three action buttons--one for punching, one for kicking, and one for guarding and reversals--it's possible to perform many dozens of different moves as all the various characters. In practice, the typical DOA4 match has a good flow and rhythm to it, as well as a blazingly fast, silky-smooth look. There's a heavy emphasis on swift, painful-looking strikes and combos. All fighters are readily capable of stunning their opponents or knocking them clean off their feet, the perfect setup for a devastating string of follow-up attacks. As the showdown unfolds, occasional reversals and throws make for spectacular, often decisive twists. At the default settings, a typical best-of-three-rounds match can be over in less than a couple of minutes, but there tends to be an awful lot of action crammed into that short space of time. The expanded roster of fighters is definitely one of the main attractions. All the old favorites are back, like ninja gals Kasumi and Ayane, Ninja Gaiden's more-famous-than-ever Ryu Hayabusa, shapely pro wrestler Tina, and Bruce Lee clone Jann Lee. And they've got plenty of new tricks up their sleeves. Dead or Alive 3's Brad Wong, a master of drunken fist kung fu (and a lush), and Christie, a scantily clad assassin, return after a hiatus and pack some of the more interesting-looking moves of the bunch. The new fighters include Kokoro, a demure karate expert specializing in open palm attacks much like those of Virtua Fighter's Akira; Eliot, a teenage boy who looks like a girl but whose praying mantis-style martial arts are unmistakably effective; and La Mariposa, a masked luchadora packing powerful kicks and stylish grappling moves. It would have been nice if DOA4's roster included a couple more fighters who...well, actually looked like fighters, rather than the outlandishly dressed, dollfaced young ladies that dominate the lineup. Nevertheless, chances are you'll find at least a few characters who appeal to you, even if the game's anime-inspired character design and its fantastically proportioned female cast won't win over everybody. Insert pun here regarding the game's big, well-rounded cast of characters. In stark contrast to all the other fighters is Spartan-458, a not-so-hidden character who's basically Halo's Master Chief but with a woman's voice and no guns, and who debatably deserves her own paragraph just because she's got something to do with Halo. She's a neat bonus for Halo fans, who've never seen the Master Chief's signature armor looking quite this rugged or realistic. She's even got her own nicely detailed arena to fight in, modeled after the opening level of Halo 2 and complete with plenty of vehicles you can't drive but can knock unsuspecting victims into. Too bad this statuesque lady is relatively underdeveloped as a fighter, since she just doesn't have as many moves to work with as most characters. One of her grabs, which involves shoving a sticky plasma grenade into the foe's gut, looks amazing. But most of her other attacks are lifted from the game's bigger characters, and she doesn't move or take hits differently than the other fighters despite all that armor. Still, the more fighters, the merrier, as long as there's a balanced lineup in the end. DOA4 seems to accomplish that balance surprisingly well. Though the quicker characters are easier to learn, everybody seems highly viable in the right hands. To put it another way, when playing online through the course of several hundred matches against random live opponents, we were pleased to routinely encounter just about every fighter in the roster, rather than the same several characters over and over. See? We didn't give the whole paragraph to Spartan-458. Incredibly enough, the arenas in DOA4 stand out nearly as much as the characters. The series pioneered the concept of interactive multilevel environments back in 1999's Dead or Alive 2, and has kept building meaningfully on this exciting concept ever since. In DOA4, not only can you kick your opponent through glass windows, down flights of stairs, and off of rooftops as you could in past Dead or Alive games, but now you can launch your foe head over heels across railings, or better yet, straight into traffic. One of the best-looking stages resembles the Vegas strip at night after a rainfall, and it's all the better because cars will come swerving down the road that you're fighting on every now and then, sometimes plowing into the combatants and blasting them up high into the air. Another inventive stage can best be described as Jurassic Park, since it's jam-packed with various dinosaurs, some of which aren't so friendly. There's a great level set in a marketplace, where you can smash the opponent into or through all kinds of different kiosks and fruit stands, and another really pretty stage up high in some Japanese temple. Some tightly-enclosed stages are also available, including ones where getting shoved into the walls causes extra damage, making bouts fly by faster than usual. At times, the extra damage caused by environmental effects can seem excessive, but the variety is great to have overall. DOA4's arenas sure beat the traditionally flat, lifeless backdrops that typify most fighting games. Don't get too caught up gawking at the pretty scenery or you'll get your face smashed into it. A good way to get your bearings with the game is to dive right into the story mode, where you pick a fighter and quickly clobber your way through eight rounds against different computer-controlled foes. The ~story~ part of story mode unfortunately is a misnomer, since the story for each character typically amounts to a couple of brief, meaningless exchanges with other fighters followed by a tough last battle and an ending cutscene of some sort--basically the same format Dead or Alive has used for years. For what it's worth, some of the endings are pretty amusing, and successive plays through the story mode is not only how you access most of the hidden characters, it's also the quickest way to unlock all the different costumes for each fighter (some have just a few, others have closer to 10). All told, story mode is fun and offers some good incentives, but it's a missed opportunity to further flesh out these characters' personalities and interrelationships. Not that you'd probably expect much of anything like that from a fighting game. Most of the other modes are pretty standard, too, but they're executed very well. Survival mode is one of the best, because the game keeps throwing fighters at you so quickly. The moment you defeat one, the next jumps right into the arena and presses the attack, so you're constantly fighting against a never-ending wave of random foes. The game offers some unlockable achievements based on how many fighters you're able to beat in a row, so you might well find yourself coming back to survival mode the most often among the single-player modes. Time attack mode is also worth playing for similar reasons, and team battle mode is there if you want to try playing with and against different combinations of characters. There's also a versus mode for quickly setting up custom matches against a friend or the computer, and a sparring mode for practicing as all the various fighters. Sparring mode does a good job of teaching you everyone's moves, though it could have done more to introduce you to some of the complexities of DOA4's gameplay. While anyone can pull off plenty of fancy-looking strings of attacks by mashing the punch and kick buttons, with experience you pick up on a lot of nuances, like the right times to use the four types of reversals, how to recover from critical hits and getting knocked down, the damage potential of the two types of counterblows, various arena-specific tactics, and much more. Dead or Alive may not have always enjoyed the good reputation of longer-running 3D fighting series like Virtua Fighter and Tekken, but today it's at least as sophisticated. You'll notice when playing against the computer in DOA4 that the enemy artificial intelligence puts up a very good fight, even at the default difficulty setting. It'll perform some slick combos on you when you leave yourself open, and it'll use throws and reversals effectively but not robotically. It'll exploit your poor tactics if you rely on the same moves over and over, too. If anything, the default difficulty will probably seem a little on the hard side for most players, and for whatever reason, there aren't any easier settings to fall back on. But since you can retry a match whenever you lose (except in survival mode), victory is really only a matter of time. Besides, you might just learn a good trick or two from playing against the computer, especially at the tougher two difficulty settings. Challenging artificial intelligence and a good number of offline modes give DOA4 some real lasting value even when playing solo. Online is where the real action is. As in Dead or Alive Ultimate, DOA4 offers a variety of different online play variants, all centered around the concept of a virtual arcade. In the ancient days, when lots of people played fighting games in actual video arcades, there were fewer arcade machines than people, so you needed to wait your turn. All the anxious waiting around, as well as the thought of spending more quarters than you wanted to, gave you more incentive to win when your turn came up, which helped inspire fierce competition. DOA4 evokes this same feeling with its virtual arcade concept by letting up to 16 players compete in a single lobby. That's way too many people to wait around for in most cases, but if you set up or find a match with a limit of around three to five players, it's a great balance where players can catch a breather in between fights but never have to twiddle their thumbs for long. The default ~winner stays~ gameplay variant is best suited for the virtual arcade format, but some of the other variants are also worth checking out, like kumite, where the host of the session keeps taking on successive challengers, win or lose. We rarely experienced significant lag when playing online, even against overseas opponents, though the game did occasionally lock up or hang up for long periods of time in between fights, especially when we tried to access the Xbox guide. We confirmed that other players had also run into this, but the problem cropped up maybe once in 50 matches, so it didn't really hurt our experience. It's still a little discouraging, and hopefully it'll be patched. As in Dead or Alive Ultimate, there tends to be noticeable lag when you're watching a match rather than participating in it, but as soon as your turn is up, you can expect comparably responsive gameplay to what you get playing offline. Even when there is some lag during a match, it still doesn't seem to prevent your moves from registering or anything too drastic. It's well worth shrugging off these types of issues to get to play this game online. Incredibly enough, the arenas in DOA4 stand out nearly as much as the characters. The series pioneered the concept of interactive multilevel environments back in 1999's Dead or Alive 2, and has kept building meaningfully on this exciting concept ever since. In DOA4, not only can you kick your opponent through glass windows, down flights of stairs, and off of rooftops as you could in past Dead or Alive games, but now you can launch your foe head over heels across railings, or better yet, straight into traffic. One of the best-looking stages resembles the Vegas strip at night after a rainfall, and it's all the better because cars will come swerving down the road that you're fighting on every now and then, sometimes plowing into the combatants and blasting them up high into the air. Another inventive stage can best be described as Jurassic Park, since it's jam-packed with various dinosaurs, some of which aren't so friendly. There's a great level set in a marketplace, where you can smash the opponent into or through all kinds of different kiosks and fruit stands, and another really pretty stage up high in some Japanese temple. Some tightly-enclosed stages are also available, including ones where getting shoved into the walls causes extra damage, making bouts fly by faster than usual. At times, the extra damage caused by environmental effects can seem excessive, but the variety is great to have overall. DOA4's arenas sure beat the traditionally flat, lifeless backdrops that typify most fighting games. Don't get too caught up gawking at the pretty scenery or you'll get your face smashed into it. A good way to get your bearings with the game is to dive right into the story mode, where you pick a fighter and quickly clobber your way through eight rounds against different computer-controlled foes. The ~story~ part of story mode unfortunately is a misnomer, since the story for each character typically amounts to a couple of brief, meaningless exchanges with other fighters followed by a tough last battle and an ending cutscene of some sort--basically the same format Dead or Alive has used for years. For what it's worth, some of the endings are pretty amusing, and successive plays through the story mode is not only how you access most of the hidden characters, it's also the quickest way to unlock all the different costumes for each fighter (some have just a few, others have closer to 10). All told, story mode is fun and offers some good incentives, but it's a missed opportunity to further flesh out these characters' personalities and interrelationships. Not that you'd probably expect much of anything like that from a fighting game. Most of the other modes are pretty standard, too, but they're executed very well. Survival mode is one of the best, because the game keeps throwing fighters at you so quickly. The moment you defeat one, the next jumps right into the arena and presses the attack, so you're constantly fighting against a never-ending wave of random foes. The game offers some unlockable achievements based on how many fighters you're able to beat in a row, so you might well find yourself coming back to survival mode the most often among the single-player modes. Time attack mode is also worth playing for similar reasons, and team battle mode is there if you want to try playing with and against different combinations of characters. There's also a versus mode for quickly setting up custom matches against a friend or the computer, and a sparring mode for practicing as all the various fighters. Sparring mode does a good job of teaching you everyone's moves, though it could have done more to introduce you to some of the complexities of DOA4's gameplay. While anyone can pull off plenty of fancy-looking strings of attacks by mashing the punch and kick buttons, with experience you pick up on a lot of nuances, like the right times to use the four types of reversals, how to recover from critical hits and getting knocked down, the damage potential of the two types of counterblows, various arena-specific tactics, and much more. Dead or Alive may not have always enjoyed the good reputation of longer-running 3D fighting series like Virtua Fighter and Tekken, but today it's at least as sophisticated. You'll notice when playing against the computer in DOA4 that the enemy artificial intelligence puts up a very good fight, even at the default difficulty setting. It'll perform some slick combos on you when you leave yourself open, and it'll use throws and reversals effectively but not robotically. It'll exploit your poor tactics if you rely on the same moves over and over, too. If anything, the default difficulty will probably seem a little on the hard side for most players, and for whatever reason, there aren't any easier settings to fall back on. But since you can retry a match whenever you lose (except in survival mode), victory is really only a matter of time. Besides, you might just learn a good trick or two from playing against the computer, especially at the tougher two difficulty settings. Challenging artificial intelligence and a good number of offline modes give DOA4 some real lasting value even when playing solo. Online is where the real action is. As in Dead or Alive Ultimate, DOA4 offers a variety of different online play variants, all centered around the concept of a virtual arcade. In the ancient days, when lots of people played fighting games in actual video arcades, there were fewer arcade machines than people, so you needed to wait your turn. All the anxious waiting around, as well as the thought of spending more quarters than you wanted to, gave you more incentive to win when your turn came up, which helped inspire fierce competition. DOA4 evokes this same feeling with its virtual arcade concept by letting up to 16 players compete in a single lobby. That's way too many people to wait around for in most cases, but if you set up or find a match with a limit of around three to five players, it's a great balance where players can catch a breather in between fights but never have to twiddle their thumbs for long. The default ~winner stays~ gameplay variant is best suited for the virtual arcade format, but some of the other variants are also worth checking out, like kumite, where the host of the session keeps taking on successive challengers, win or lose. We rarely experienced significant lag when playing online, even against overseas opponents, though the game did occasionally lock up or hang up for long periods of time in between fights, especially when we tried to access the Xbox guide. We confirmed that other players had also run into this, but the problem cropped up maybe once in 50 matches, so it didn't really hurt our experience. It's still a little discouraging, and hopefully it'll be patched. As in Dead or Alive Ultimate, there tends to be noticeable lag when you're watching a match rather than participating in it, but as soon as your turn is up, you can expect comparably responsive gameplay to what you get playing offline. Even when there is some lag during a match, it still doesn't seem to prevent your moves from registering or anything too drastic. It's well worth shrugging off these types of issues to get to play this game online. Before you can host an online match in DOA4, you need to get yourself a lobby. Your first one's free, but to get others, you'll need to spend currency you earn from beating other players. The game offers a bunch of different-themed lobbies as well as numerous quirky avatars that'll represent you when you're in a lobby. Some of this material is actually pretty funny, provided you think ghosts and chickens dancing around in a space station with a big-screen TV showing DOA4 matches is funny. But regardless of what sort of good intentions went into this concept, it's not particularly well implemented. Specifically, you can hang out in the lobby only if you're content to be a spectator rather than a participant in online combat--you leave the lobby environment as soon as you elect to join a match, not just when it's your turn to fight. So unless you're really into watching other people play fighting games as opposed to playing them yourself, DOA4's lobby system won't do much for you, even though you'll probably get a few laughs out of it. On the other hand, the unlockable achievements in DOA4 are generally well thought out, enticing you to explore and keep coming back to key aspects of the game. A few achievements relate to achieving win streaks and high rankings online, making them attainable only by very skilled players, so you'll know not to mess with people who've earned these. Overall, this is one of the better sets of achievements so far in an Xbox 360 game. The new online lobby system is mildly disappointing, but getting to play live opponents around the world is by far one of the best things about DOA4. DOA4 is also one of the best-looking Xbox 360 games yet. Vividly detailed characters and environments, smooth and believable animations (including many new ones), and crisp textures all add up to a stunning visual presentation. A few specific rough edges do stick out, so let's get those out of the way. The flowing long hair some characters have can sometimes flow in weird ways, in thick ribbons rather than strands. Some unsightly clipping issues also crop up with some characters' alternate outfits and during some grappling moves. But such flaws are as easily forgivable as they're unfortunate, since the game looks so impressive overall. Granted, DOA4 does look a lot like previous Dead or Alive games. Although DOA4 looks its best in high definition, where every little visual detail seems to clearly stand out, the character graphics look a lot like those of Dead or Alive Ultimate even in HD. Everyone's got a complexion as smooth as the game's frame rate, which makes the characters look less like real people and more like dolls or action figures (you know, depending on gender). Still, these are some great-looking characters, and some of the subtle details, like how Jann Lee's veins pop out when he's flexing or how La Mariposa's glittery outfit literally sparkles, show tremendous attention to detail. Too bad the characters don't have as many outfits as they did in Dead or Alive Ultimate, and that some of the alternate outfits are just color swaps; but all the variety in character appearances is remarkable anyway. The environments probably look even better than the characters, too. You wouldn't know just from looking at them that most of these arenas are from a fighting game. In fact, they're so filled with life that you'll almost wish you could just walk around and explore them rather than be limited to smashing your opponents into and through parts of them. Also, even though there's so much going on visually, loading times are nearly nonexistent in DOA4, and briefly come up mostly just when there's a change of scenery rather than a change of characters. Razor-sharp, ultrasmooth visuals highlight every aspect of the experience, especially if you're set up to play in HD. Great audio highlights the presentation, though it too is very similar to previous games in the series. All of the fighters, with the exception of Spartan-458, speak Japanese with English subtitles. It seems as though they should have spoken in their native languages since they hail from all around the world, but the Japanese voice actors fit their parts well. The game's enthusiastic female announcer also does a good job, but in a nice touch, you can replace her with just about any of the game's fighters after you unlock their ~system voice~ in the sparring mode. More importantly, the effects for punches, kicks, snaps, and slams are all spot-on in DOA4, sounding plenty painful especially when some sort of wall or railing is involved in the exchange. The game also makes surprisingly good use of surround sound, which doesn't have much impact on gameplay but makes a lot of the arenas seem that much more real, what with believable ambient effects happening all around. To top it all off, there's a fittingly upbeat soundtrack to go with the action, featuring memorable themes for some of the characters. And yes, for better or worse, Dead or Alive fans may look forward to more use of Aerosmith in the game's introductory cutscene. It's simple: If you like fighting games, DOA4 is for you. Between its great selection of powerful fighters, its terrific action, and its addictive online mode, there's an awful lot to sink your teeth into, learn, and master in this latest and greatest installment in the series. That the whole thing looks so good certainly doesn't hurt, either. Any subsequent fighting games for the Xbox 360 now have a very tough contender to beat. Before you can host an online match in DOA4, you need to get yourself a lobby. Your first one's free, but to get others, you'll need to spend currency you earn from beating other players. The game offers a bunch of different-themed lobbies as well as numerous quirky avatars that'll represent you when you're in a lobby. Some of this material is actually pretty funny, provided you think ghosts and chickens dancing around in a space station with a big-screen TV showing DOA4 matches is funny. But regardless of what sort of good intentions went into this concept, it's not particularly well implemented. Specifically, you can hang out in the lobby only if you're content to be a spectator rather than a participant in online combat--you leave the lobby environment as soon as you elect to join a match, not just when it's your turn to fight. So unless you're really into watching other people play fighting games as opposed to playing them yourself, DOA4's lobby system won't do much for you, even though you'll probably get a few laughs out of it. On the other hand, the unlockable achievements in DOA4 are generally well thought out, enticing you to explore and keep coming back to key aspects of the game. A few achievements relate to achieving win streaks and high rankings online, making them attainable only by very skilled players, so you'll know not to mess with people who've earned these. Overall, this is one of the better sets of achievements so far in an Xbox 360 game. The new online lobby system is mildly disappointing, but getting to play live opponents around the world is by far one of the best things about DOA4. DOA4 is also one of the best-looking Xbox 360 games yet. Vividly detailed characters and environments, smooth and believable animations (including many new ones), and crisp textures all add up to a stunning visual presentation. A few specific rough edges do stick out, so let's get those out of the way. The flowing long hair some characters have can sometimes flow in weird ways, in thick ribbons rather than strands. Some unsightly clipping issues also crop up with some characters' alternate outfits and during some grappling moves. But such flaws are as easily forgivable as they're unfortunate, since the game looks so impressive overall. Granted, DOA4 does look a lot like previous Dead or Alive games. Although DOA4 looks its best in high definition, where every little visual detail seems to clearly stand out, the character graphics look a lot like those of Dead or Alive Ultimate even in HD. Everyone's got a complexion as smooth as the game's frame rate, which makes the characters look less like real people and more like dolls or action figures (you know, depending on gender). Still, these are some great-looking characters, and some of the subtle details, like how Jann Lee's veins pop out when he's flexing or how La Mariposa's glittery outfit literally sparkles, show tremendous attention to detail. Too bad the characters don't have as many outfits as they did in Dead or Alive Ultimate, and that some of the alternate outfits are just color swaps; but all the variety in character appearances is remarkable anyway. The environments probably look even better than the characters, too. You wouldn't know just from looking at them that most of these arenas are from a fighting game. In fact, they're so filled with life that you'll almost wish you could just walk around and explore them rather than be limited to smashing your opponents into and through parts of them. Also, even though there's so much going on visually, loading times are nearly nonexistent in DOA4, and briefly come up mostly just when there's a change of scenery rather than a change of characters. Razor-sharp, ultrasmooth visuals highlight every aspect of the experience, especially if you're set up to play in HD. Great audio highlights the presentation, though it too is very similar to previous games in the series. All of the fighters, with the exception of Spartan-458, speak Japanese with English subtitles. It seems as though they should have spoken in their native languages since they hail from all around the world, but the Japanese voice actors fit their parts well. The game's enthusiastic female announcer also does a good job, but in a nice touch, you can replace her with just about any of the game's fighters after you unlock their ~system voice~ in the sparring mode. More importantly, the effects for punches, kicks, snaps, and slams are all spot-on in DOA4, sounding plenty painful especially when some sort of wall or railing is involved in the exchange. The game also makes surprisingly good use of surround sound, which doesn't have much impact on gameplay but makes a lot of the arenas seem that much more real, what with believable ambient effects happening all around. To top it all off, there's a fittingly upbeat soundtrack to go with the action, featuring memorable themes for some of the characters. And yes, for better or worse, Dead or Alive fans may look forward to more use of Aerosmith in the game's introductory cutscene. It's simple: If you like fighting games, DOA4 is for you. Between its great selection of powerful fighters, its terrific action, and its addictive online mode, there's an awful lot to sink your teeth into, learn, and master in this latest and greatest installment in the series. That the whole thing looks so good certainly doesn't hurt, either. Any subsequent fighting games for the Xbox 360 now have a very tough contender to beat."}