{"ref": "https://www.gamespot.com/reviews/ridge-racer-7-review/1900-6162024/", "date": "November 18, 2006", "game_name": "Ridge Racer 7", "text": "Last year's Ridge Racer 6 marked the first time that a game in the main Ridge Racer series appeared on a non-Sony platform. With Ridge Racer 7, the series is back on PlayStation and available at launch for the PS3. It brings the same arcade-style, drift-crazy gameplay to Sony's new console, and fans of the series should probably enjoy it. However, there's one small catch: Most of the tracks in Ridge Racer 7 were also in Ridge Racer 6. So while the new car customization options and slipstream speed boosts are features that only fans of the series will immediately appreciate, all of the recycled tracks may make those same fans feel like they've already played some of this game before. The enhancements to the gameplay are still enough of a draw, and to the Sony-faithful Ridge Racer players who passed on the previous installment, Ridge Racer 7 will especially have a lot to offer. The undisputed video game drift king is back for some more insane sliding. For the uninitiated, Ridge Racer 7 will seem like a totally foreign world. While the arcade-style racing genre has absolutely exploded over the last decade, Ridge Racer 7 still focuses on the same thing it has since it first began in actual arcades: ridiculous on-rails drift mechanics that whip you around corners almost automatically. Nearly losing control of your car around every sharp turn is the only way to win in Ridge Racer, and the way you drive is unlike anything else on the market. At this point, it's something of a secret handshake between the player and the game console. Either you already know what Ridge Racer is, how to play it, and why it's fun, or you don't. It's difficult to imagine someone making Ridge Racer 7 his or her first Ridge Racer game and quickly getting into it, just because the way you drift is so arcane. The idea is that as you go into a sharp corner, you let off the gas and then immediately hit it again. This causes you to spin out and start sliding around the corner automatically. Your goal at this point is to make sure your car is pointing in the right direction when you come out of the turn, where you'll regain traction and keep going. When we say automatically, we mean it. You can slide through multiple hairpin curves without even thinking about the nature of the turns themselves. As long as you're prepared to correct the car's direction, you're A-OK. The game's cars offer multiple types of drifting. Mild sticks to the road pretty well and doesn't get too crazy around curves, but it's also the slowest type of car. Dynamic is on the opposite end of the spectrum, so when you drift, the car's direction will dramatically whip around, making it easier to get into a drift but harder to get out of one. Since it's the fastest drift type, it's the expert's choice. Standard strikes a happy medium between the two and should be the best choice for beginning and intermediate players. Don't mistake all this talk about automatic cornering to mean that there's nothing to Ridge Racer 7. On the contrary, keeping your car moving at high speeds is an exercise in precision timing and takes a bit of strategy. As you drift at high speeds, you'll charge up a nitrous boost meter, which has three different levels. When it fills, you can bust out a quick speed boost, or you can save it up for a double or triple nitrous boost, if you want something with a little more kick. When boosting, you can't drift to charge up your meter under normal conditions. But if you get into a drift just as your nitrous expires, that extra speed fills up your nitrous meter much faster, something the game calls ~ultimate charge.~ So you want to strategically time your nitrous usage to take advantage of that whenever possible. Also, Ridge Racer 7 adds slipstreaming to the action. It's a dramatic addition because it's extremely effective. When you get right behind another racer, even if you're pretty far away, you accelerate faster and can move at a higher top speed. The closer you get, the more of a speed boost you'll receive. This completely changes the way you play compared to previous Ridge Racer games, because now you want to stay behind your opponents for as long as you can and then swing out and attempt to slingshot around them. It's a smart addition. Slipstreaming is absolutely key in Ridge Racer 7, and you'll need to employ it effectively to catch up to the competition. Ridge Racer's car design has always been really cool. There are no licensed cars in here, but the game treats its cars as if they come from a series of fictional manufacturers, with great names like Kamata, Assoluto, Gnade, and Danver. On top of that, each one of these makers has different makes, so you can get the Danver Bayonet, the Sinseong Jujak, or the Age Prophetie, just to name a few. The car designs get wild, with lots of smooth curves that give all of the vehicles the look of futuristic concept cars. In fact, the game doesn't even call them cars. It's very careful to call them ~machines,~ which is crazy. You can customize your cars by going into the ~machine connector,~ where you can purchase body parts from a separate set of manufacturers, including Dig Dug. Bet you didn't know that Dig Dug made sweet body kits in his spare time. You can also purchase engine, tire and suspension, and nitrous upgrades and change the paint on your car. While the engine upgrades increase your top speed and the nitrous upgrades change the way your nitrous meter works, the tire and suspension upgrades don't seem to have a very dramatic effect on the way your car handles. To upgrade your car with aftermarket parts, you'll first have to establish a relationship with the parts maker. Races that establish those relationships open up as you play through the main mode, called Ridge State Grand Prix. In this mode, you'll enter into races one series at a time and go up against seven other cars in a points battle. Winning these events will open up races that will unlock the ability to buy new parts and cars. The more you use a specific manufacturer's cars or parts, the more points you earn with them. These points give you discounts on that company's gear at set intervals. While there are tons of different events to enter, there are only 21 tracks. That number doubles because the game lets you race them both ways, but be prepared to spend a lot of time racing on the same tracks. You'll get very familiar with these tracks as you play, and if you played Ridge Racer 6, chances are you'll already be familiar with almost all of them, since there are only a handful of all-new tracks in the game. The repetition, both within the game itself and when taking the previous game into account, is Ridge Racer 7's biggest problem. The online racing in RR7 lets up to 14 players race at once. In addition to the grand prix mode, you can enter time attack mode and race the tracks by yourself. Your best times will be posted to an online leaderboard, though annoyingly, your scores don't post right away and, according to the game, may take up to an hour to appear on the leaderboards. That sort of delayed feedback takes some of the punch out of the leaderboards' effectiveness. There's also an arcade mode, which lets you pick a car and a track and go nuts. You can play multiplayer via split-screen, but it's not very smooth and not very exciting, either. Heck, you can even play an arcade-perfect emulation of Xevious, if you like, because it pops up during the initial load-and-install process. The game has online support for up to 14 players in a race, and this is where it gets a good dose of longevity. You can simply get together and race, or you can get into a team battle, where the racers split into two teams and earn points for their team depending on where they finish. Pair battle is a team mode where you split up into teams of two cars. The goal is to drive in unison with your teammate, because if you do side-by-side drifts around a turn, you earn nitrous more quickly. The team shares one nitrous boost meter, as well. You can also take on time attack mode as a duo. It's a really neat set of modes, but without any way to communicate with your teammate during the race, it's hard to stick together and drive appropriately. Your only communication with other racers is limited to a preset list of phrases in the lobby before and after each race. The phrases are varied, but not enough to let you communicate meaningfully. Ridge Racer 7 has support for all the HD modes that the PS3 can handle, up to 1080p. At 720p and better, the game looks extremely sharp, and though you'll see some noticeable jagged edges on some surfaces, the great sense of speed, matched with the sharpness of the graphics, makes this game look great. Since many of the tracks appeared on the Xbox 360, it's worth comparing how the two different games look. Ridge Racer 7 looks sharper and cleaner than Ridge Racer 6 did, but in most cases you'll have to stare at both versions to notice any real difference beyond just the increased resolution. Like previous Ridge Racer games, something about Ridge Racer 7 looks extremely mechanical. Watching other cars drift is especially weird, because they sort of pivot effortlessly and start moving in a different direction. Overall, it looks good, but it also often looks extremely unnatural. If you played Ridge Racer 6, you'll recognize most of the game's tracks. The sound in Ridge Racer 7 is somewhat understated. Engine noises are sort of low, as are the sounds of nitrous bursts. Squealing tires during drifts, however, are plenty loud. The game's announcer is a lady who sounds like she stepped right out of a bad classic-rock radio station and into the Ridge Racer recording session. She'd probably sound more at home introducing a double shot from Poison followed by that Y&T twofer that the guys down at the local tire shop just requested than she does talking about nitrous drifts and winning races. She's pretty underwhelming. The music is the same sort of upbeat, lively techno that the series has been using all along. There are a lot of tracks, but the one that sums it up best is called ~Bad House Music.~ It's aptly named. Ridge Racer 7 is a great entry in the long-running series, which is good news, especially given that it's the first racing game available for the PS3. The gameplay changes made here are probably the most dramatic that the series has seen since Ridge Racer Type 4, though the repetition of tracks may be a bummer for some series fans who've probably played a mess of Ridge Racer 6. But if you're a fan of the series and you haven't played it lately, you'll be in for a real treat. And even those without much of any exposure to Ridge Racer may be drawn in by this game's sleek style. To upgrade your car with aftermarket parts, you'll first have to establish a relationship with the parts maker. Races that establish those relationships open up as you play through the main mode, called Ridge State Grand Prix. In this mode, you'll enter into races one series at a time and go up against seven other cars in a points battle. Winning these events will open up races that will unlock the ability to buy new parts and cars. The more you use a specific manufacturer's cars or parts, the more points you earn with them. These points give you discounts on that company's gear at set intervals. While there are tons of different events to enter, there are only 21 tracks. That number doubles because the game lets you race them both ways, but be prepared to spend a lot of time racing on the same tracks. You'll get very familiar with these tracks as you play, and if you played Ridge Racer 6, chances are you'll already be familiar with almost all of them, since there are only a handful of all-new tracks in the game. The repetition, both within the game itself and when taking the previous game into account, is Ridge Racer 7's biggest problem. The online racing in RR7 lets up to 14 players race at once. In addition to the grand prix mode, you can enter time attack mode and race the tracks by yourself. Your best times will be posted to an online leaderboard, though annoyingly, your scores don't post right away and, according to the game, may take up to an hour to appear on the leaderboards. That sort of delayed feedback takes some of the punch out of the leaderboards' effectiveness. There's also an arcade mode, which lets you pick a car and a track and go nuts. You can play multiplayer via split-screen, but it's not very smooth and not very exciting, either. Heck, you can even play an arcade-perfect emulation of Xevious, if you like, because it pops up during the initial load-and-install process. The game has online support for up to 14 players in a race, and this is where it gets a good dose of longevity. You can simply get together and race, or you can get into a team battle, where the racers split into two teams and earn points for their team depending on where they finish. Pair battle is a team mode where you split up into teams of two cars. The goal is to drive in unison with your teammate, because if you do side-by-side drifts around a turn, you earn nitrous more quickly. The team shares one nitrous boost meter, as well. You can also take on time attack mode as a duo. It's a really neat set of modes, but without any way to communicate with your teammate during the race, it's hard to stick together and drive appropriately. Your only communication with other racers is limited to a preset list of phrases in the lobby before and after each race. The phrases are varied, but not enough to let you communicate meaningfully. Ridge Racer 7 has support for all the HD modes that the PS3 can handle, up to 1080p. At 720p and better, the game looks extremely sharp, and though you'll see some noticeable jagged edges on some surfaces, the great sense of speed, matched with the sharpness of the graphics, makes this game look great. Since many of the tracks appeared on the Xbox 360, it's worth comparing how the two different games look. Ridge Racer 7 looks sharper and cleaner than Ridge Racer 6 did, but in most cases you'll have to stare at both versions to notice any real difference beyond just the increased resolution. Like previous Ridge Racer games, something about Ridge Racer 7 looks extremely mechanical. Watching other cars drift is especially weird, because they sort of pivot effortlessly and start moving in a different direction. Overall, it looks good, but it also often looks extremely unnatural. If you played Ridge Racer 6, you'll recognize most of the game's tracks. The sound in Ridge Racer 7 is somewhat understated. Engine noises are sort of low, as are the sounds of nitrous bursts. Squealing tires during drifts, however, are plenty loud. The game's announcer is a lady who sounds like she stepped right out of a bad classic-rock radio station and into the Ridge Racer recording session. She'd probably sound more at home introducing a double shot from Poison followed by that Y&T twofer that the guys down at the local tire shop just requested than she does talking about nitrous drifts and winning races. She's pretty underwhelming. The music is the same sort of upbeat, lively techno that the series has been using all along. There are a lot of tracks, but the one that sums it up best is called ~Bad House Music.~ It's aptly named. Ridge Racer 7 is a great entry in the long-running series, which is good news, especially given that it's the first racing game available for the PS3. The gameplay changes made here are probably the most dramatic that the series has seen since Ridge Racer Type 4, though the repetition of tracks may be a bummer for some series fans who've probably played a mess of Ridge Racer 6. But if you're a fan of the series and you haven't played it lately, you'll be in for a real treat. And even those without much of any exposure to Ridge Racer may be drawn in by this game's sleek style."}