{"ref": "https://www.gamespot.com/reviews/nba-jam-2002-review/1900-2850397/", "date": "May 17, 2006", "game_name": "NBA Jam 2002", "text": "NBA Jam 2002 for the Game Boy Advance is Acclaim's seventh attempt to give the NBA Jam series a respectable showing on a handheld system. Due to a variety of questionable design choices, as well as a few omissions, it's certainly not going to appease jaded enthusiasts who're still searching for a perfect portable rendition of their favorite extreme basketball game. However, NBA Jam 2002 does manage to offer a satisfying dose of two-on-two, no-rules, full-court roundball, complete with large, well-animated players and irreverent announcer comments.The game draws its roster from the 29 official NBA teams, and it features all the corresponding colors, logos, and court designs. In all, there are 140 different players, including such notables as Michael Jordan, Shaquille O'Neal, and Allen Iverson. The game offers six gameplay modes, including season, playoffs, quick game, jam, horse, and practice. The practice and horse modes aren't substantial, but they're adequate for training yourself in the use of the game's combo-based shot mechanics. For the majority of players, the season and jam modes will yield the most playtime. The season setting lets you take a team all the way through a 28-game fantasy season, while the jam mode transforms the quick game option into an energetic exhibition match that's chock-full of wacky power-ups and hot spots. An options menu lets you continue your season via a password save system and tweak settings for computer opponent difficulty, player swapping, and quarter length. Once you hit the court, you'll quickly find that NBA Jam 2002 doesn't play much like real basketball--not that the series ever has. Taking a shot is still as easy as pressing the A button, but you're more likely to hit a bucket if you key in one of the game's many signature moves, the majority of which are Mortal Kombat-style combinations of directional-pad taps and button presses. Unfortunately, it is no longer possible to pass to a teammate while attempting to shoot--an adjustment that all but eliminates the possibility of snazzy teammate assists, such as alley-oops and lay-up dunks. However, you can still shove opponents in order to steal the ball, and the swapping of injured players for fresh ones remains a key aspect.In addition to the above adjustments, NBA Jam 2002 incorporates a number of other changes to the NBA Jam formula. These include turbo meters that refill more gradually; the ability to swap control of players at will using the R button; the addition of onscreen indicators that aid in snatching up loose balls; computer artificial intelligence that isn't constantly cheating; and an adjustment to the on-fire state (which kicks in after three straight buckets) that restricts it to only enhancing shot accuracy and not player speed. However, the greatest change of all concerns the utter lack of a two-player link mode--an omission that's all the more stinging since NBA Jam 2001 for the Game Boy Color included this most basic and appreciated of features.Surprisingly, the jam mode, which introduces super dunk hot spots and power-up items during actual gameplay, isn't an option during the regular season. Whether you love or hate the idea of arcade-style power-ups littering the court, the ability to use these to abuse your players' turbo, accuracy, super dunk, and other abilities is too unique an option to restrict to a simple exhibition mode. If you cruise through a full season and playoffs, you can at least unlock the NBA all-star and rookie teams, as well as the beach and blacktop bonus courts.Regardless of its questionable gameplay features, NBA Jam 2002's graphical presentation is quite impressive. The courts, while cookie-cutter repaints, do the NBA theme great justice with packed stands, flapping nets, and a working scoreboard. The player models are excellently drawn and animate fluidly, whether dribbling, driving the lane, or performing outrageous slam dunks. Although the character photos shown between quarters are all you have to discern one player from another, the size differences between players, as well as the sprite-scaling that occurs as the they move closer to your point of focus, lends an overall sense of three-dimensional realism. The only issues that mar the game's otherwise stellar visuals are that the ball is somewhat small and undefined and that the shot physics aren't always as believable as they ought to be.NBA Jam 2002 also deserves praise for its clear though modest array of announcer speech snippets. There isn't a ton of speech, but the frequent exclamations of ~ka-boom,~ ~nicely received,~ and ~he's going all the way~ certainly break up the gameplay more appropriately than the chintzy music of previous attempts. In all, there are roughly 20 different comments, which, along with a few sneaker chirps and buzzers, make up NBA Jam 2002's audio.Some players will no doubt abhor what Acclaim has done to the NBA Jam franchise, while others will laud the design changes present in the 2002 edition. Regardless of what you decide, Acclaim and Digital Creations still have a little more work to do before they can claim superiority in the arcade-style basketball genre. The lack of a link-cable option, the limiting of power-ups to the jam mode, and an absence of mid-shot passing are the three problems that ultimately keep NBA Jam 2002 from attaining all-star status. But all things considered, it's still a decent handheld rendition of two-on-two basketball."}