{"ref": "https://www.gamespot.com/reviews/emperor-battle-for-dune-review/1900-2774894/", "date": "May 17, 2006", "game_name": "Emperor: Battle for Dune", "text": "Emperor: Battle for Dune is the latest in Westwood Studios' long line of real-time strategy games and the spiritual successor to its early '90s game Dune II, which single-handedly defined the genre. Like Dune II, Emperor is based upon the famous science fiction universe found in the Dune novels by Frank Herbert and in the 1984 movie by David Lynch. As in its predecessor, Emperor lets you assume command over the military forces of any of three distinct factions that are fighting to gain ownership of the desert planet Arrakis and its invaluable resources. The game emphasizes fast, intense skirmishes over complicated tactical decision-making, and it features an impressive 3D graphics engine that really helps bring the fiction of the game to life. Emperor also gives you a lot of options and a lot of replay value, between its three single-player campaigns, its skirmish mode, and its robust multiplayer features. Emperor may be Westwood's first fully 3D real-time strategy game, but fundamentally, it plays much like its predecessors. That is, you view the action from above the battlefield and typically must establish a base of operations and then start producing a variety of units with which to destroy all of the enemy's forces and defend against any retaliation in the process. To fund your military efforts, you'll need to earn money--specifically, by harvesting and processing the invaluable chemical known as the spice Melange. An in-game tutorial quickly explains all this. Actually, unlike in most conventional real-time strategy games, the resource-gathering process in Emperor is fully automated. You can even upgrade refineries to support up to two additional harvesting units so that a single refinery can do the work of three. Flying carryall vehicles automatically ferry harvesters to and from spice fields, and should one of your harvesters or carryalls fall under attack and be destroyed, you'll get a limited number of replacements for free. This system works well--it's a relief to not have to micromanage your economy and to be able to concentrate on fielding a strong military instead. Of course, though your harvesters will do their jobs autonomously, they'll still depend on you to protect them. As in most real-time strategy games, each mission in Emperor begins with the battlefield being almost completely shrouded save for the area around your starting units. Like in the Command & Conquer series, once you move units through the shroud, the shroud disappears for the duration of the battle. In skirmish mode and multiplayer mode, Emperor does let you toggle a true fog-of-war option (similar to other RTS games) that requires you to maintain line of sight, which will certainly affect your strategy in battle. Either way, reconnaissance in Emperor is simple: Each of the three playable factions has access to a cheap, defenseless scout unit that can clear the map quickly and easily. Therefore, as with the resource gathering, scouting in Emperor is made as simple as possible so as to let you concentrate on combat. The variety of units found in Emperor isn't exhaustive, but it's diverse and entertaining. Aside from a few universal types of units such as harvesters and scouts, each of the three playable factions has completely different military forces. The units of the honorable House Atreides are direct and imposing, and most effective at long range. The wicked House Harkonnen's units are extremely deadly but require good tactics for best results, as most of its units can be readily countered by troops they're not specifically designed to destroy. The forces of the mercenary House Ordos are physically weaker but also perhaps the most versatile. They're fast and equipped with regenerating energy shields that protect them from initial damage--yet Ordos units suffer noticeably if their shields are breached. Though the units across all three sides are different, the three sides' structures are analogous. So, depending on which House you're controlling, you'll have to use a different strategy in battle, but setting up base infrastructure and gaining access to more-powerful technologies will be the same straightforward process regardless. Emperor actually features five ancillary factions in addition to the primary three, and you can select any two of these as allies prior to multiplayer matches or skirmish battles. You may also gain the favor of a couple of them during any of the game's three campaigns. In practice, an alliance with one of these gives you access to an exclusive production facility, which in turn lets you produce two additional units. Some of these are quite powerful and collectively lend even more diversity to the battles in the game. The extra factions include the Fremen, native nomadic warriors of Arrakis; the Sardaukar, fanatical soldiers who fight in the name of their emperor; House Ix, a sect devoted to advanced technology; House Tleilaxu, renegade masters of genetic manipulation; and the Spacing Guild, who monopolize space travel in the known universe. A lot of the units in Emperor are cleverly designed, aesthetically appealing, and memorable. In spite of this, you'll likely find that your strategy in battle focuses heavily on certain units and all but neglects certain others, either because they seem too overpriced or too underpowered. Part of the reason is because your tactical options in Emperor are fairly limited, most notably in that you can't easily assemble your units into formations. Groups of units also have trouble maneuvering around each other in close proximity. They often won't be able to get around one another, and when attacking, they'll move toward their target in a disorganized mass--you'll invariably lose your front line to defensive fire just because there's no good way to send in your forces. Aside from the lack of formations, Emperor doesn't have many options for determining unit behavior. Units such as the Harkonnen buzzsaw, which are clearly designed to overrun enemy infantry, are fundamentally less useful because they won't overrun infantry on their own. The various units in Emperor do a fine job of shooting at enemy passersby, but when a situation calls for anything subtler, you'll always have to take direct control yourself. Finally, some of the smaller infantry units in Emperor can be very difficult to distinguish from each other, let alone pick from out of a crowd. At least the game's 3D camera control is simple and intuitive; you have limited ability to zoom in with the mousewheel, and you can also rotate your view as necessary.In addition to these few issues with the control and balance of the game, the nonlinear campaigns in Emperor also lack polish. The three different campaigns are open-ended in that you usually get a choice of which region of Arrakis you wish to attack next. Depending on some of your choices, different events may transpire. For instance, you might help the Sardaukar early on and gain their trust through the remainder of the campaign. However, by and large, the nonlinear campaigns are pretty shallow. Some missions are noticeably scripted, but toward the middle and the end of the campaign, you can tell that the game is trying to pass off randomly generated skirmishes as true campaign missions. The mission briefings will be vague, and the results of your victory seem inconsequential. The computer likely won't provide much of a challenge either, as its predictable attacks often can be readily anticipated and thwarted even at the hardest of the game's three difficulty settings. In turn, the lavishly produced full-motion video sequences that reveal the plot of the game from each House's perspective will seem to fall away toward the end of Emperor's campaigns. Early on, you'll probably enjoy these video sequences, starring recognizable actors such as Star Trek's Michael Dorn as the Atreides duke, and weird character actor Vincent Schiavelli as the Harkonnen advisor. The acting performances in Emperor are more self-consciously forced than in the David Lynch film, but they share a similarly over-the-top sensibility. As the campaigns go on, and you realize the video sequences are becoming less frequent, you'll start to miss them and you'll realize that there's not much point in letting the campaigns drag, since certain victory objectives will be clearly in sight. Besides, you'll find that the promising-looking strategic layer in between campaign missions--a turn-based, color-coded world map reminiscent of Risk--is mostly just for show. Full-motion video cutscenes are used to tell the story. As far as the show's concerned, Emperor: Battle for Dune looks outstanding. The battle for Arrakis is impressively recreated in stunning 3D, inspired by the baroque visual design of the Lynch film. The various units often have a retro sci-fi look about them and feature moving parts, headlights, and other fine details. The environments are filled with colorful rock outcroppings, long shadows, remains of previous battles, and even some natural phenomena, such as gigantic sandstorms--and gigantic sand worms, which will occasionally rise up to devour legions of units, regardless of whom they belong to. Besides the setting of Arrakis, Emperor also recreates the three homeworlds of the game's main factions. Their inclusion adds a great touch of variety and will certainly make the game even more appealing to fans of the Dune universe. The audio in Emperor is also excellent for the most part. The three primary factions have their own unique themes, which are reminiscent of either the great musical score found in the original Dune II or the great musical score found in the 1984 feature film. Also, each unit in Emperor has its own unique set of quips that it'll speak in response to your orders, and though they can get repetitive, most are nonetheless very well done and really help make each unit seem more alive. Emperor: Battle for Dune does have a few technical issues, most of which are related to the fact that the game demands a powerful system for optimal performance. Loading times before missions can be quite lengthy on midrange or even higher-end machines; and with all graphical options enabled, the game will bog down noticeably when a lot of action is afoot, even on very fast computers. Fortunately, the game looks quite good even with the graphical detail at a minimum, and you can individually tweak different graphical options and also adjust the overall speed of the gameplay to best suit your system. Emperor draws much more from its source material than Dune II did. Like Westwood's other recent real-time strategy games, Emperor includes the free, fully integrated Westwood Online player-matching service, which promises to easily let you find plenty of willing competition. Online play is quite smooth, and the brisk pacing of the combat makes multiplayer matches a lot of fun. The quick-match option is especially convenient: It automatically finds you an online opponent of roughly similar experience and throws the two of you into a match, with both of your bases already established. Emperor supports online skirmishes with up to four human players and network matches with up to eight players, and while the game doesn't ship with a scenario-editing utility, it does include a rather large variety of different maps--and it even gives you the unusual option to play through the three campaigns cooperatively online. All together, Emperor: Battle for Dune is a well designed and visually impressive real-time strategy game that promises many hours of fast-paced battles in both its single-player and multiplayer modes. It'll be especially appealing to fans of the source material that inspired the game, including the film, the novels, and Westwood's own Dune II. Fans of any of these will find that Emperor actually takes its science fiction premise much further than the original Dune II did, even if it lacks that game's innovation. That is, players expecting a brand-new revision of real-time strategy conventions won't find it in Emperor. Despite the game's many interesting attempts to streamline and simplify a lot of the genre's more cumbersome conventions, it ultimately still plays a lot like other real-time strategy games by Westwood Studios and other developers. Then again, its similarity to its predecessors is essential to the success of Emperor: Battle for Dune: In borrowing conventions from earlier games, Westwood managed to make its latest project interesting enough and enjoyable enough to be worthwhile for virtually anyone who's ever liked another game of its type.In addition to these few issues with the control and balance of the game, the nonlinear campaigns in Emperor also lack polish. The three different campaigns are open-ended in that you usually get a choice of which region of Arrakis you wish to attack next. Depending on some of your choices, different events may transpire. For instance, you might help the Sardaukar early on and gain their trust through the remainder of the campaign. However, by and large, the nonlinear campaigns are pretty shallow. Some missions are noticeably scripted, but toward the middle and the end of the campaign, you can tell that the game is trying to pass off randomly generated skirmishes as true campaign missions. The mission briefings will be vague, and the results of your victory seem inconsequential. The computer likely won't provide much of a challenge either, as its predictable attacks often can be readily anticipated and thwarted even at the hardest of the game's three difficulty settings. In turn, the lavishly produced full-motion video sequences that reveal the plot of the game from each House's perspective will seem to fall away toward the end of Emperor's campaigns. Early on, you'll probably enjoy these video sequences, starring recognizable actors such as Star Trek's Michael Dorn as the Atreides duke, and weird character actor Vincent Schiavelli as the Harkonnen advisor. The acting performances in Emperor are more self-consciously forced than in the David Lynch film, but they share a similarly over-the-top sensibility. As the campaigns go on, and you realize the video sequences are becoming less frequent, you'll start to miss them and you'll realize that there's not much point in letting the campaigns drag, since certain victory objectives will be clearly in sight. Besides, you'll find that the promising-looking strategic layer in between campaign missions--a turn-based, color-coded world map reminiscent of Risk--is mostly just for show. As far as the show's concerned, Emperor: Battle for Dune looks outstanding. The battle for Arrakis is impressively recreated in stunning 3D, inspired by the baroque visual design of the Lynch film. The various units often have a retro sci-fi look about them and feature moving parts, headlights, and other fine details. The environments are filled with colorful rock outcroppings, long shadows, remains of previous battles, and even some natural phenomena, such as gigantic sandstorms--and gigantic sand worms, which will occasionally rise up to devour legions of units, regardless of whom they belong to. Besides the setting of Arrakis, Emperor also recreates the three homeworlds of the game's main factions. Their inclusion adds a great touch of variety and will certainly make the game even more appealing to fans of the Dune universe. The audio in Emperor is also excellent for the most part. The three primary factions have their own unique themes, which are reminiscent of either the great musical score found in the original Dune II or the great musical score found in the 1984 feature film. Also, each unit in Emperor has its own unique set of quips that it'll speak in response to your orders, and though they can get repetitive, most are nonetheless very well done and really help make each unit seem more alive. Emperor: Battle for Dune does have a few technical issues, most of which are related to the fact that the game demands a powerful system for optimal performance. Loading times before missions can be quite lengthy on midrange or even higher-end machines; and with all graphical options enabled, the game will bog down noticeably when a lot of action is afoot, even on very fast computers. Fortunately, the game looks quite good even with the graphical detail at a minimum, and you can individually tweak different graphical options and also adjust the overall speed of the gameplay to best suit your system. Like Westwood's other recent real-time strategy games, Emperor includes the free, fully integrated Westwood Online player-matching service, which promises to easily let you find plenty of willing competition. Online play is quite smooth, and the brisk pacing of the combat makes multiplayer matches a lot of fun. The quick-match option is especially convenient: It automatically finds you an online opponent of roughly similar experience and throws the two of you into a match, with both of your bases already established. Emperor supports online skirmishes with up to four human players and network matches with up to eight players, and while the game doesn't ship with a scenario-editing utility, it does include a rather large variety of different maps--and it even gives you the unusual option to play through the three campaigns cooperatively online. All together, Emperor: Battle for Dune is a well designed and visually impressive real-time strategy game that promises many hours of fast-paced battles in both its single-player and multiplayer modes. It'll be especially appealing to fans of the source material that inspired the game, including the film, the novels, and Westwood's own Dune II. Fans of any of these will find that Emperor actually takes its science fiction premise much further than the original Dune II did, even if it lacks that game's innovation. That is, players expecting a brand-new revision of real-time strategy conventions won't find it in Emperor. Despite the game's many interesting attempts to streamline and simplify a lot of the genre's more cumbersome conventions, it ultimately still plays a lot like other real-time strategy games by Westwood Studios and other developers. Then again, its similarity to its predecessors is essential to the success of Emperor: Battle for Dune: In borrowing conventions from earlier games, Westwood managed to make its latest project interesting enough and enjoyable enough to be worthwhile for virtually anyone who's ever liked another game of its type."}