{"ref": "https://www.gamespot.com/reviews/def-jam-icon-review/1900-6167022/", "date": "March 7, 2007", "game_name": "Def Jam: Icon", "text": "Hip-hop has always been a competitive form of music. Going back to the '70s and '80s, with such crews as Cold Crush or Grandmaster Flash and the Furious Five, a big part of rapping has always been about telling the world how great you are, especially if it comes at the expense of a rival emcee. EA and hip-hop record label Def Jam teamed up a few years back to make hip-hop-themed fighting games, which made sense at the time. But the first two games took the nuts and bolts of a wrestling game, put it on the street instead of in the ring, and threw in a whole bunch of rappers. Unless you count Macho Man Randy Savage's 2003 rap album as a success, rap and wrestling just don't mix, even though the previous Def Jam games somehow managed to be pretty cool in spite of that. But EA also seems to have come to this conclusion because as the third game in the Def Jam series, Def Jam: Icon, trades in the wrestling for a unique fighting style, coming up with an even more ridiculous and fun story mode. All around, it's a good, if somewhat simple, time. The roster is mostly focused on rappers who are making an impact today, though a few older guys might have been interesting. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Def Jam: Icon Video Review The game's roster of licensed rappers is deep and varied, representing the coasts and everywhere in between. The game includes Big Boi, Bun B, E-40, The Game, Ghostface Killah, Jim Jones, Lil Jon, Ludacris, Method Man, Mike Jones, Paul Wall, Redman, Sean Paul, Sticky Fingaz, T.I., and Young Jeezy, among others. A few nonrappers make appearances as characters in the story mode, including actor Anthony Anderson, who's great as the seemingly evil record exec, Troy Dollar. Def Jam/Warner Music Group exec Kevin Liles also plays a character in the story, and there's a pretty good cameo from another hip-hop mogul as well. While there's plenty of people in the game, you'll probably come up with more than a few omissions if you think about it for very long. For example, such acts as LL Cool J and Run-DMC are still synonymous with the label's origins, but you won't find them here. These days, the label is better known for its president and CEO, Jay-Z, who's also missing in action. On top of that, there have been plenty of often-controversial wars in hip-hop over the years, and it's unfortunate that you can't re-create some of those rivalries here. Seeing Jay-Z and Nas, The Game and 50 Cent, or even Dr. Dre and Dee Barnes beat the heck out of each other at a gas station would have been worth the price of admission on its own. The game has a passable create-a-character mode that works just like every other EA game these days, which includes all the weird sliders you can use to make your characters have awful-looking foreheads and jaw shapes. The atmosphere and over-the-top story mode is the best part about Def Jam: Icon. Called ~build a label,~ this mode opens with your created character as a nobody. You defend Carver, a hotshot record exec and are quickly welcomed into the fold for, you know, keeping it real. From there, you rise up to become an A&R man, which in game terms means that you beat people up so that other people will sign to your label. You interact with characters via e-mail, which is often read aloud by the involved characters. As you sign artists, you'll use your income to set release budgets for their songs, which is an investment that can earn you even more money. Along the way, you'll get stuck with plenty of bills, including Mike Jones' phone bill, The Game's paternity tests, and Ghostface Killah dropping off of his tour so that he can go make ~a video game with gorillas and ninjas and s***.~ You can opt out of making these payments, but that's no way to keep your artists happy. As you rake in more money and purchase fly-looking clothes, you'll start to attract women, who also suck money out of you to stay happy. There are also plenty of twists and turns. For example, as the money coming in increases, things get very serious, very quickly; complete with dirty cops who love to plant evidence, rival record execs who want to steal your artists, and scandalous women. Things escalate so much that it becomes completely comical, almost like a so-bad-it's-good hood movie. All that's missing is Master P and a truckload of stolen cell phones. But even though it's all sort of silly, it still manages to feel authentic. If anything, the ~white cop keeping you down~ tale wraps up a little too abruptly. Each level has spots that you don't want to be standing in for too long. It's got a rock-solid premise and a surprisingly compelling story. Unfortunately, the part where you have to actually fight is where Def Jam: Icon kind of breaks down. Overall, the switch from wrestling to fighting is an improvement, and Def Jam: Icon is unlike any traditional fighting game. The game was developed by the same team that handled Fight Night Round 3, and it shows. The fighting is methodical, to the point of feeling sluggish in spots. It's very focused on fooling your opponent by mixing up your high and low attacks, which can be stopped by blocks or counters, which can be stopped by grabs and throws, which can be stopped by those same high and low attacks. So there's balance to the basics of the fighting system, which are roughly the same regardless of which character you choose, even though differences in fighting styles mean that some characters are somewhat better at one aspect of combat than others. There's a second layer to the game that's a bit more stylish. The right analog stick is used for grabs and for your strongest strikes. As in Fight Night, making circular or tapping motions on the stick will unleash harder attacks, and you can go high or low with these too. What's more, if you taunt before unleashing those attacks, your attack will land even harder, often knocking down your opponent in the process. Keeping your opponent down is key because you want to make sure your song is playing. Yes, the music in Def Jam: Icon also plays a role in the fighting. Before each fight, you select which song you want to have as ~your~ song. At any point during the fight, you can hold down the left trigger, then rotate the two analog sticks to switch songs. Your character reacts to this motion by making turntable motions in thin air. If you're fighting while your song is playing, you'll get a damage bonus, so it's handy. You can counter song-switch attempts by hitting the left trigger while the other player is spinning, which makes you stomp the ground, knocking your foe down. The other turntable move rewinds the current song back to the beginning and causes the entire background to explode. OK, perhaps that requires a bit more explanation. Every stage pulsates in time with the music, and everything in the level sort of explodes on its own. This usually occurs after every four bars of music, though some songs explode more or less frequently. Each level has a number of dangerous spots that you don't want to be standing in when this happens. A constantly burning-out car swings out to the side, hitting anyone standing in the way. In the club, pole dancers whip around the pole, kicking anyone that's too close. Speakers shoot out bass waves that send people flying. A helicopter whips around in the air and nails unsuspecting rappers with its tail. Camera equipment swings around, lights fall out of the rafters of a club, gas pumps explode...it's crazy. Because you can do a turntable move to force an explosion, a big part of the game is knocking or throwing your opponent into a danger zone, then scratching the song back to make everything pop, which deals a good amount of damage and sends your enemy flying across the level. About the only part of this game that doesn't feel authentic is the general lack of guns, but they'll show up too. The Xbox 360 version of the game lets you import your own music, but imported songs don't seem to work quite as well as the songs on the soundtrack. It feels like the game is trying to detect the beats of your music and time the explosions accordingly, but it doesn't do a very good job of it. Also, to do it, you'll have to rip music to your Xbox 360's hard drive and put it in a playlist named ~Def Jam Icon.~ This isn't all that convenient. Also, the ~my soundtrack~ mode is the only place you can do this, so you can't bring your music into the rest of the modes unless you override the entire soundtrack from the guide menu, which prevents the pulsating backgrounds from working properly. The PS3 version lacks this feature, but because it wasn't implemented all that well on the 360, you aren't missing that much, which is unfortunate because it's a really neat idea. All in all, the fighting system is unlike anything you'd expect to see in a fighting game. Even though it feels balanced and, on paper, looks sort of complicated, it ends up feeling a bit too simple in the end. Every single move is a guessing game, and you rarely get a free second hit or any kind of real combo opportunity. All that guessing can get a bit tedious. Additionally, the computer-controlled fighters are quick to grab you the second you block and seem almost inhuman when it comes to blocking your attacks. But they've got a weakness that's just shy of being a full-fledged exploit. If you back away a few steps, you can usually taunt your way up to them and tap down on the right analog stick twice, which unleashes a straight, low attack. The CPU player usually won't block this attack, and the taunts ensure that you'll knock your opponents down if you make the hit, giving you time to back off and set up for another one. In a lot of cases, you can ride this tactic for the entire fight, but it isn't 100 percent effective, especially on the harder difficulty setting. The solution to dealing with the spotty AI is, as always, playing with another person. Def Jam: Icon has a local versus mode, as well as online multiplayer. The online works as you'd expect, with ranked and unranked games. The game has a series of text-based taunts that are sent to your opponent, depending on what happens. For example, if a player disconnects on you, there's a specific quitter taunt. You can customize these taunts, though the game blocks you from using profanity in your taunts. Considering how uncensored and full of cursing the rest of the game is, that's sort of lame. And sure enough, the message that pops up when you try to swear says, ~We know it's lame.~ Great. Good to know that everyone is on board with its lameness. The online game isn't quite as responsive as the offline is, which can make blocking a flurry of attacks a bit problematic, but since the other player is also saddled with the same lag issues, it doesn't seem to give one player an advantage. Most of the game's cursing comes from the music itself. There's a lot of fantastic, uncensored music on the Def Jam: Icon soundtrack, including songs from almost every one of the rappers in the game. There are also a few other classics, such as ~Ante Up~ by M.O.P. and ~Hate Me Now~ by Nas. But there's one really weird case of censoring in E-40's ~Tell Me When To Go.~ The word ~Hebrews~ is chopped out of the line ~imagine all the Hebrews goin' dumb/dancing on top of chariots and turning tight ones.~ Perhaps this is not the preferred nomenclature these days, but it's hardly worth cutting out in this context, particularly when you take into account the sheer number of times that the infamous ~n word~ turns up, which creates a very creepy double standard. The rest of the audio is really great, with plenty of flavor-filled quotes from the rappers themselves during fights and taunts. The game really manages to capture the larger-than-life stage personas of the rappers. Hearing E-40 scream ~bitch~ in his own special way in a video game might be reason enough to buy it. It definitely earns its M rating for lyrics alone, with all of the cursing, misogyny, and needless glorification of marijuana you'd expect to hear. That helicopter likes to swing around and hit you in the back of the head. The graphics back up the audio quite well. The rappers look a lot like their real-life counterparts, and they get beat up nicely as the fights progress. The game's slow pace leaves plenty of room for good, smooth animation, though some of the transitions that hook the animations together still look a little off at times. Also, the animation for different characters is dependent on their fighting style. So everyone that fights in the ~ghetto blaster~ fighting style moves the same, and so on. That means you'll get a little tired of the movement fast. Characters even share taunt animations. The backgrounds also look really awesome, and the colors of the level change slightly depending on which song is playing. The effect of the backgrounds moving and pulsing in time with the music is very cool, which overall makes it a great-looking game. The pace and style of the combat in Def Jam: Icon clearly shows that it came from the guys and girls who worked on Fight Night Round 3. Yes, this is technically a 3D fighting game, but you wouldn't call it competition for the Virtua Fighters and the Tekkens of the world. The lack of a real combo system and its heavy emphasis on move/countermove gameplay make the game more suited for players who like fighting, but can't be bothered to learn any special moves. But that's not to say it has no depth at all. On that note, it's likely to appeal to players who liked Fight Night Round 3 as well. But there's much more to Def Jam: Icon than its gameplay. The way it handles the rappers and the way its story mode plays out make it a must for hip-hop fans...unless you're still waiting for some sort of Lupe Fiasco/Common backpacking simulator. Every stage pulsates in time with the music, and everything in the level sort of explodes on its own. This usually occurs after every four bars of music, though some songs explode more or less frequently. Each level has a number of dangerous spots that you don't want to be standing in when this happens. A constantly burning-out car swings out to the side, hitting anyone standing in the way. In the club, pole dancers whip around the pole, kicking anyone that's too close. Speakers shoot out bass waves that send people flying. A helicopter whips around in the air and nails unsuspecting rappers with its tail. Camera equipment swings around, lights fall out of the rafters of a club, gas pumps explode...it's crazy. Because you can do a turntable move to force an explosion, a big part of the game is knocking or throwing your opponent into a danger zone, then scratching the song back to make everything pop, which deals a good amount of damage and sends your enemy flying across the level. About the only part of this game that doesn't feel authentic is the general lack of guns, but they'll show up too. The Xbox 360 version of the game lets you import your own music, but imported songs don't seem to work quite as well as the songs on the soundtrack. It feels like the game is trying to detect the beats of your music and time the explosions accordingly, but it doesn't do a very good job of it. Also, to do it, you'll have to rip music to your Xbox 360's hard drive and put it in a playlist named ~Def Jam Icon.~ This isn't all that convenient. Also, the ~my soundtrack~ mode is the only place you can do this, so you can't bring your music into the rest of the modes unless you override the entire soundtrack from the guide menu, which prevents the pulsating backgrounds from working properly. The PS3 version lacks this feature, but because it wasn't implemented all that well on the 360, you aren't missing that much, which is unfortunate because it's a really neat idea. All in all, the fighting system is unlike anything you'd expect to see in a fighting game. Even though it feels balanced and, on paper, looks sort of complicated, it ends up feeling a bit too simple in the end. Every single move is a guessing game, and you rarely get a free second hit or any kind of real combo opportunity. All that guessing can get a bit tedious. Additionally, the computer-controlled fighters are quick to grab you the second you block and seem almost inhuman when it comes to blocking your attacks. But they've got a weakness that's just shy of being a full-fledged exploit. If you back away a few steps, you can usually taunt your way up to them and tap down on the right analog stick twice, which unleashes a straight, low attack. The CPU player usually won't block this attack, and the taunts ensure that you'll knock your opponents down if you make the hit, giving you time to back off and set up for another one. In a lot of cases, you can ride this tactic for the entire fight, but it isn't 100 percent effective, especially on the harder difficulty setting. The solution to dealing with the spotty AI is, as always, playing with another person. Def Jam: Icon has a local versus mode, as well as online multiplayer. The online works as you'd expect, with ranked and unranked games. The game has a series of text-based taunts that are sent to your opponent, depending on what happens. For example, if a player disconnects on you, there's a specific quitter taunt. You can customize these taunts, though the game blocks you from using profanity in your taunts. Considering how uncensored and full of cursing the rest of the game is, that's sort of lame. And sure enough, the message that pops up when you try to swear says, ~We know it's lame.~ Great. Good to know that everyone is on board with its lameness. The online game isn't quite as responsive as the offline is, which can make blocking a flurry of attacks a bit problematic, but since the other player is also saddled with the same lag issues, it doesn't seem to give one player an advantage. Most of the game's cursing comes from the music itself. There's a lot of fantastic, uncensored music on the Def Jam: Icon soundtrack, including songs from almost every one of the rappers in the game. There are also a few other classics, such as ~Ante Up~ by M.O.P. and ~Hate Me Now~ by Nas. But there's one really weird case of censoring in E-40's ~Tell Me When To Go.~ The word ~Hebrews~ is chopped out of the line ~imagine all the Hebrews goin' dumb/dancing on top of chariots and turning tight ones.~ Perhaps this is not the preferred nomenclature these days, but it's hardly worth cutting out in this context, particularly when you take into account the sheer number of times that the infamous ~n word~ turns up, which creates a very creepy double standard. The rest of the audio is really great, with plenty of flavor-filled quotes from the rappers themselves during fights and taunts. The game really manages to capture the larger-than-life stage personas of the rappers. Hearing E-40 scream ~bitch~ in his own special way in a video game might be reason enough to buy it. It definitely earns its M rating for lyrics alone, with all of the cursing, misogyny, and needless glorification of marijuana you'd expect to hear. That helicopter likes to swing around and hit you in the back of the head. The graphics back up the audio quite well. The rappers look a lot like their real-life counterparts, and they get beat up nicely as the fights progress. The game's slow pace leaves plenty of room for good, smooth animation, though some of the transitions that hook the animations together still look a little off at times. Also, the animation for different characters is dependent on their fighting style. So everyone that fights in the ~ghetto blaster~ fighting style moves the same, and so on. That means you'll get a little tired of the movement fast. Characters even share taunt animations. The backgrounds also look really awesome, and the colors of the level change slightly depending on which song is playing. The effect of the backgrounds moving and pulsing in time with the music is very cool, which overall makes it a great-looking game. The pace and style of the combat in Def Jam: Icon clearly shows that it came from the guys and girls who worked on Fight Night Round 3. Yes, this is technically a 3D fighting game, but you wouldn't call it competition for the Virtua Fighters and the Tekkens of the world. The lack of a real combo system and its heavy emphasis on move/countermove gameplay make the game more suited for players who like fighting, but can't be bothered to learn any special moves. But that's not to say it has no depth at all. On that note, it's likely to appeal to players who liked Fight Night Round 3 as well. But there's much more to Def Jam: Icon than its gameplay. The way it handles the rappers and the way its story mode plays out make it a must for hip-hop fans...unless you're still waiting for some sort of Lupe Fiasco/Common backpacking simulator."}