{"ref": "https://www.gamespot.com/reviews/alien-hominid-hd-review/1900-6166632/", "date": "March 1, 2007", "game_name": "Alien Hominid", "text": "Commercial-grade digital distribution was made for games like Alien Hominid, which was just ahead of its time. While it started life as a simple little Flash game online, the full game was originally released on the PlayStation 2 and GameCube back in 2004, with a European Xbox release hitting in 2005. The 2D side-scrolling shooter was endlessly charming and notoriously difficult, but it never really broke out of its fairly tiny niche. Now it's back for another go on the Xbox 360 as a $10 purchase. It's a perfect fit for Microsoft's downloadable game service, and it's still an outstanding shooter. Little. Cutesy. Deadly. Alien Hominid HD is a side-scrolling shooter that falls in the same folder as such games as Metal Slug, Contra, and Gunstar Heroes. You play as a cute little alien that crash-lands on Earth, sending hordes of earthling authority figures into a frenzy. The FBI steals your crashed ship and hauls it away. You're going to want that ship back, so you give chase, cutting down hundreds of agents as you go. In later levels, you will be up against the evil communists of the KGB and other foes, both human and robot in origin. Your primary weapon against the hordes of enemies you'll face is a blaster that fires small, deadly shots. Against harder targets, you can hold down the fire button to charge up a more powerful, larger shot. You'll also collect weapon power-ups that give you more damaging lasers, fire, ice, spread, a close-range shotgun blast, and so on. You can also toss grenades, and when you're up close, you can pull out a knife and cut men in half, much like in Metal Slug. But the funniest attack is your ability to jump up and grab on to the heads of your foes and eat them. Not only is this satisfying, but it also can act as a warning to other nearby agents, who occasionally freeze in fear at the sight of one of their own getting eaten alive. The variety in your arsenal is very cool, and most of your moves come in handy in specific situations. If you get hit, you're dead. This gives the game a classic arcade feel, and it also makes it a pretty punishing game on the normal and hard difficulty settings. Easy mode gives you more lives and more ~continues,~ so you should probably start with this mode. Once you've completed the game on easy, move up to normal, and so on. Along the way, you'll encounter bosses both big and small, and some of these can be especially tough. Although every boss fight does follow a pattern, once you've figured out how to play against that pattern, the game gets significantly easier. But until then, you should expect to burn through plenty of lives during some of these larger fights. There are 16 levels in the game that span three different worlds, giving you a good variety of environments to see and enemies to face. In addition to the main game, which can be played by two players if that second player is sitting right next to you, there are several minigames, some of which have actual online support. These are roughly the same as the single-player game, such as the Urban Challenge, where you just have to stay alive in an endless version of one of the game's levels. But the other minigames get far out there, such as Super Soviet Missile Mastar, which is an Atari 2600-like game where you steer a nuclear missile up, dodging helicopters, jets, and birds, and then attempt to crash the missile into a rough drawing of the US. For whatever reason, Missile Mastar doesn't have any sound in the Xbox 360 version of the game, yet it did have crude but appropriately 4-bit sound effects on other platforms. Some of the other minigames are missing music, as well. The two online minigames are both great in their own ways. All You Can Eat stars Fat Kid, the chubby child that occasionally shows up in the single-player game. In a fit of Track & Field-like button pounding, you have to hammer on the X and A buttons to eat a bowl of food faster than up to three other players. It's completely dumb and totally ridiculous, and it's really funny that it has full online support, including ranked matches and leaderboards. Unfortunately, it's tough to find other players online, since the game isn't unlocked right from the start. The other online mode is the much more substantial PDA games mode. Here, up to four players play a cool-looking stick-figure platformer, where you must jump on the heads of all the enemies in each level to open the exit to the next stage. Online, all players must reach the exit to move ahead. This is also the mode that will be expanded upon with downloadable content in the future. Everything in Alien Hominid has a very nice hand-drawn style, and the art is definitely a huge feature in the game. In fact, the game's artist, Dan Paladin, gets a feature credit during the game's introductory credits. Everything in the game has a very cohesive look, and it's all surprisingly well animated. It's similar to a comic strip in spots, but it's never bland, Each building in the background is distinct, some of which also have funny business names on them, such as Steakery Cakery, Hairy Mommy Daycare, or Smiley Smiles in Piles. While the game might not be some huge technical feat of polygon-pushing power, it's an amazing-looking 2D game that is stuffed so full of character that it's bursting at its 50MB limit. Like other Xbox Live Arcade games, Alien Hominid HD has 200 achievement points for you to earn. The achievements in this game are smart and force you to do a few different things. You'll get points for unlocking every single hat, you'll get points for eating a set number of enemy troops with a large yeti, and you'll earn points for completing the game on each difficulty. There's a good balance between easy points and a few more difficult ones, which is nice. If you get tired of shooting enemies, try eating their heads for a while. With a great, tough main game and plenty of additional modes, you get a lot for your $10. Unfortunately, you may also be ~lucky~ enough to get saddled with a bug. The game currently has an issue that isn't affecting every player, but for some, the game doesn't save properly when you quit. This means that your progress in the single-player game, the number of minigames you have unlocked, and the hats you've discovered may get wiped out every time you quit. This is the sort of game that you want to finish in one sitting, but that doesn't make this bug any less annoying. Hopefully it'll get fixed with a patch that also adds the missing music to the minigames in the process. Even with the possibility of getting the save-wiping bug, Alien Hominid HD is a fantastic game. It's a perfect example of a game that can (and should) flourish under the auspices of a widely used digital-distribution system. And on top of all that, it's available for $10, or 800 points. That's a great value for your dollar, and this is a game you should most definitely check out."}