{"ref": "https://www.gamespot.com/reviews/trauma-center-new-blood-review/1900-6183698/", "date": "December 5, 2007", "game_name": "Trauma Center: New Blood", "text": "A trauma center is a major league hospital, equipped with around-the-clock surgical staff, state-of-the-art equipment, and as much pain and carnage as a Texas Chain Saw family reunion. Normally you'd want to spend as much time in one as you'd want to spend covered in rats, so you wouldn't think the concept would make for a nice, leisurely video game. Yet Atlus has already turned it into three, and its latest, Trauma Center: New Blood, is the best of the bunch. Just like the other operations in the series, New Blood is a surgery simulation that has you slicing into patients, excising their tumors, removing bullets, draining blood, and sowing them back up again, all with healthy doses of antibiotics and, most importantly, fun. But despite its presence on the family-friendly Wii, this is not an easy game. This is your brain surgeon. This is your brain surgeon on drugs. Any questions? But before we get to the shattered arms, impaled hearts, and shot dogs, you should know that the game is about the surgical exploits of Valerie Blaylock and Markus Vaughn. The curtains rise in ~Alaska--the frigid northern extremity of America.~ That is literally the first line in the entire game. Makes you wonder what they would've said if it began in Florida (~the long, hot leg of America~?) or Texas (~the giant bottom~?). After that, there are only a few plot points worth paying attention to. In one, a rich patient complains that his appendectomy isn't costing enough, while across the hospital, a poor child without insurance needs the same operation but can't pay for it. So you bill the rich kid for two appendectomies, because, as Markus says, ~Rich or poor, we're all the same under the knife.~ And you thought your HMO was crazy. At least Markus can back up his god complex with supernatural powers--he and Valerie wield the medical equivalent of bullet time, known as the ~Healing Touch.~ It's all part of a wacky spiritual hoodoo both doctors buy into that has them saying things like, ~As the stars have taught me...I am one with life...I am one with now...~ The rest of the dialogue and plot details that unfold between surgeries are as dull as local anesthetic. Sure, there's a game show that's a cross between Iron Chef and, well, surgery, plus a talking surgery dog, but these are things you can enjoy all while quickly tapping the A button on the remote to skip ahead. In fact, seeing the dog chime in between conversations is actually more entertaining if you don't stop to read what's actually being said. Besides, the gameplay is so good you'll want to skip straight to it. While the Wii is chock-full of minigame collections trying to cash in on the system's expiring novelty, the Trauma Center series has developed an elegant, complex control scheme that believably and thoroughly adapts the system's capabilities to surgery. After hours and hours of play, you'll excise tumors with deft speed and precision. You'll quickly pluck bullets, drain the blood, use forceps to pinch the wound shut, and suture it like it's second nature before moving on to the next life-threatening injury. This splinter is going to require more than a pocket knife and some Jack Daniels. The only downside to all of this is that some of the surgeries are extremely long and sensitive. If you make a mistake five minutes in, for instance, your patient dies and you are told that, unable to overcome the shame, Markus and Valerie leave the surgery world forever. Quitters. This is exacerbated by two factors: (1) The game doesn't always tell you things you need to know, and (2) Mistakes that shouldn't remotely affect the health of the patient will make them die, such as trying to pick up a pacemaker with a blood drainer. Those issues aside, it's fun and rewarding to figure out things for yourself. For instance, an operation on a burn victim is horribly frustrating at first, but becomes rewarding once you figure out how to grow skin grafts, place them in the right spots, drain the blood, and boost the patient's vitals in the right order. Aside from fixing normal injuries and ailments, you'll also do battle with the Stigma virus--an evolving and malignant malady that really lets the game designers get creative with their procedures. For instance, the first Stigma you encounter is like a razor strapped to a micromachine that races around and lacerates your patient's organs. Later versions hide in the flesh, float around and fart tumors, or grow tentacles that must be pinched and severed. About seven hours in, even on the easiest difficulty level, the game becomes obscenely difficult. You'll battle multiple, consecutive stigmas, treat a shotgun-blasted dog, and face more blood and carnage than you can shake a scalpel at. With the right priorities, you can pass these challenges, or you can pull in a friend for some cooperative slicing and dicing. That's right, two players can operate on the same patient, each with a full suite of tools at their disposal. The early missions provide good opportunities to acquaint novice partners with the controls and concepts, and the later missions are difficult even for two skilled surgeons, especially when facing two different kinds of stigma at the same time. New Blood's cooperative play is fun, easy on beginners, and definitely extends its life span. One surgeon attaches the modules, while the other brandishes a scalpel. When rendering wounds and body parts, New Blood doesn't go for brutal realism, but rather clarity and simplicity. For instance, the vessels you need to work on during the appendectomy are color-coded for your convenience, not your sense of anatomical correctness. Such an approach might've sterilized the game's injuries, if New Blood didn't go so over the top with some of them. In one operation, your patient's rib cage has shattered, and all the shards have embedded themselves in a major internal organ, which now looks like a frightened puffer fish, or a fully loaded voodoo doll. It's super nasty, even without realistic flesh textures or blood shooting across the screen and sticking to the camera. Besides, they have to leave something for the sequel. New Blood sounds fine, though the solid voice acting is wasted on the boring dialogue. The music is entirely forgettable and the surgery sound effects are passable, though the only one that will really stick in your memory occurs when you ~accidentally~ push one of the aforementioned bone shards deeper into the organ, rather than pulling it free. Trauma Center: New Blood is a successful operation. Even though the dialogue is insipid and some of the procedures are frustrating, this game combines signature surgical gameplay with a double dose of challenge and great cooperative play for a trip to the hospital you won't require painkillers to enjoy."}