{"ref": "https://www.gamespot.com/reviews/godfall-review/1900-6417612/", "date": "November 18, 2020", "game_name": "Godfall", "text": "Godfall makes a good first impression. Even if you're playing on a moderately powerful PC, as I did, it's clear from the opening moments that developer Counterplay Games has endeavored to show off advancements in visual fidelity, no doubt in light of new hardware such as the PlayStation 5. From the way sparks fly to the myriad particles that coat every inch of its action and the reflectiveness of its gaudy gold and marble halls, Godfall wants you to know that next gen is here. Beyond the visual spectacle, however, lies a game that's immediately familiar and over-reliant on an amalgamation of loot-driven games from the past eight years or so.Godfall's mixture of loot progression and third-person melee combat has been described by Counterplay Games as a new type of genre: the looter-slasher. The name holds up insofar as you loot and slash things, but there's nothing about Godfall that feels intrinsically new. Diablo, Monster Hunter, and Warframe make up a portion of its overt inspirations, but it manages to avoid feeling completely derivative by pulling from so many different influences at once. There's nothing inherently wrong with this approach, especially since it mixes in a few of its own ideas as well. The issues Godfall faces occur outside of combat, where its structure and gameplay loop are decidedly uninspired.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Godfall Video ReviewThe whole game takes place across three distinct realms: Earth, Water, and Air. Upon entering each biome, you're given a brief tour of the area before being tasked with finding some kind of door that's locked by a specific number of MacGuffins. From here, you have to return to previously visited locations and defeat a number of mid-bosses--some of which are unique, but most of which are repeats of fights you've already had. Once you've slain each of these enemies and acquired the requisite amount of MacGuffins, you can open the door and fight that realm's boss. Then you simply ascend an elevator and repeat the whole process again in the next realm.As you can imagine, this rigid framework quickly devolves into tedium and wears out its welcome long before the final credits roll around nine hours in. To make matters worse, Godfall's endgame revolves around yet more fights against the same bosses you've already clashed steel with before. There are some new wrinkles to this endgame content, including ways to earn new loot, a reward system that grants temporary buffs, and the prospect of failing and having to start over, but the core conceit of repeating battles to unlock loot to repeat more battles is not an enticing one when that's all there is to it.Part of this tedium is due to routine level and quest design that does little more than shuffle you from one battle to the next. Your objective rarely deviates from the basic task of killing everything in sight, aside from a select few outliers where you might have to destroy an object as well. You have no interaction with the world around you, and there's no nuance to indicate a sense of history in each locale. Enemies simply mill about waiting to die--their entire purpose served by being vanquished at your hands--and the environments, for as good as they look, end up feeling like hollow set dressing. The threadbare story provides little context either, offering just enough of a reason for all the bloodshed. The end goal is to kill your brother before he can become a god and bring about the apocalypse. At one point it looks as though the narrative might add some depth by musing on the potential for power to corrupt those who have no need for it, but this is dropped just as soon as it arrives in favor of a predictable sequel tease.Godfall is a game built on monotony that would fall apart completely if the combat weren't there to prop it up. Your melee repertoire consists of light and heavy attacks, a snappy dodge, and a shield that can both block and parry incoming attacks. There's the usual assortment of gear rarities, with common, uncommon, rare, and legendary loot to find, while your weapon arsenal features everything from giant greatswords to nimble dual blades. Each weapon type is diversified by the range, speed, and cadence of its moveset, but they all share the same four-button combo and an array of abilities that can be unlocked via a modest skill tree. Whichever weapon type you opt for will come down to personal preference, particularly since Godfall's combat is meaty and satisfying no matter which one you choose, with a palpable sense of skull-crushing weight behind each and every blow.It can also be surprisingly measured due to the fact you can't interrupt attack animations if you need to block or dodge. This works well on paper, forcing you to learn enemy patterns and be deliberate in your actions, but it belies Godfall's emphasis on aggression. Being patient works against bosses and in one-on-one encounters, but you spend the vast majority of the game fighting mobs where speed is of the essence. You need to quickly cut through ranged enemies or healers before dealing with anyone else, and this approach is antithetical to the way defending works. There's even a Rampage mechanic that rewards you for staying on the front foot with a 20% damage increase. However, these mechanics are undermined by the fact that dying in Godfall is so inconsequential that it's actually advantageous a lot of the time. Falling in battle simply respawns you back where you died, with all of the enemies right where you left them, whether that means they're dead or damaged. Doing so also replenishes all of your healing items, so there's little reason to avoid letting your health bar reach zero unless you want to keep hold of any of the energy you've built up. This changes during boss fights, but even these are generously checkpointed each time you deplete a chunk of the boss' health.Fortunately, there is some meaningful depth beyond the combat's familiar basics. Every weapon type has two unique variants of special attacks called Southern and Northern Techniques. You can execute these by spending energy that's gradually accumulated during the heat of battle. Performing a Northern Technique with the longsword, for example, will launch you into a rapid flurry of strikes that cuts through any foes around you, while the polearm's Southern Technique sends you into a leaping ground slam that functions similarly to an AOE attack. Aside from being flashy displays of power, these techniques are also a vital part of Godfall's Soulshatter mechanic. By using light attacks and Northern Techniques, you can apply Soulshatter buildup to an enemy's health bar before switching to heavy attacks and Southern Techniques to bank all of that volatile energy and dish it out in the form of destructive Soulshatter damage.There are a number of other abilities you can unlock throughout the game as well, such as a Weak Point skill that lets you aim the cursor at highlighted enemy weak spots to deal extra damage. This adds an element of finesse to those moments when you're simply wailing on a group of enemies, forcing you to course-correct and hone in on a specific point. There are also Polarity Attacks that encourage you to swap between both of your equipped weapons in the midst of battle by rewarding you with a shockwave attack and extra damage for a brief period. It's these physical abilities that really stand out during the chaos of Godfall's combat. Some loot has a chance to apply different status effects like bleeding, or add fire and electric damage on top of your physical attacks, but none of this is particularly noticeable. You know when you've killed an enemy using Soulshatter damage because they explode in a bright dust cloud, but status effects just get lost in the noise.Godfall is a game built on monotony that would fall apart completely if the combat weren't there to prop it up.As a result, Godfall's loot is defined by basic number crunching--where gear is equipped according to the highest digits and little else. Your preference for a particular weapon type will factor into this, but finding a legendary warhammer is only exciting because your damage numbers grow in size. A legendary weapon doesn't function any differently to a common one; they both still have the same combo and rhythm to their attacks. There's still an inherent endorphin rush that comes from seeing that golden orb burst forth from a defeated enemy, but this mostly feels like muscle memory that's accrued from playing other loot-heavy games. Seeing numbers grow is always a good thing, but it does nothing to change or evolve the flow of combat.Valorplates are similarly disappointing. These armor sets come with slightly different stats and various Archon abilities--which are essentially ultimates--but the stats and passive buffs they apply are still barely perceptible, and there are only three Archon abilities split amongst its 12 Valorplates. They're varied from a visual perspective, offering different styles on Godfall's cosmic knights aesthetic, and this does allow you to look different from one another when playing in co-op. The game is naturally better with friends--even if there's little synergy shared between your attacks and abilities--but you will need friends if you want to play cooperatively, since there is no matchmaking.Even if you can play with others, Godfall's meaty combat eventually begins to wear thin after the umpteenth version of the same fight. This is a shallow game bolstered by decent combat that struggles to bear the weight of an entire game. Uninteresting loot mixed with a monotonous and grindy structure is not a good combination, and for as satisfying and fun as it can often be to hack your way through one battle after another, there's not enough here to sustain that enjoyment for more than a few hours."}