{"ref": "https://www.gamespot.com/reviews/blade-and-soul-review/1900-6416349/", "date": "February 2, 2016", "game_name": "Blade & Soul", "text": "I'm a big fan of monk-style character classes. I've kicked demons in Diablo III, clobbered hydras in Final Fantasy XIV, and unleashed swarms of punches while swigging brews in World of Warcraft. But it wasn't until Blade & Soul that I encountered the essence of kung fu--at least as far as a keyboard can capture. At its best, Blade & Soul delivers that rare brand of combat that makes me consider learning these moves for real. And that's why I'm so sad that the rest of the game never reaches the same heights.Blade & Soul's problems partly spring from its timing. It's only ~new~ in the West; East Asian players have enjoyed it since it came out in South Korea way back in 2012, when it and other Korean MMORPGs like TERA started to grab headlines for action combat. Blade & Soul is a time capsule of sorts that contains few of the quality-of-life changes introduced to the genre over the past few years, and the usual bugbears strut across the stage here: the wide tunnels for leveling that hint at an open world but don't really deliver it, the torrent of mindless kill-and-fetch quests, and the hyper-sexualized depictions of women and young girls that leave many Westerners either shuddering with shame or giggling at the proportions.Still, it does achieve a certain grandeur in parts, whether it's in the intricate weapons or the fantastic landscapes stuffed with cloud-swept pagodas and blossoming woods. Considering its age, it's no surprise some of these landscapes suffer from poor textures and muddy details, but Blade & Soul generally presents them with a degree of style.The story starts off on a respectable (if predictable) note, when the Hongmoon School gets wiped out, leading to a 45-level-long quest for revenge. The opening quests and cutscenes benefit from a welcome dose of cinematic suspense and camaraderie, but the tale quickly loses momentum in the drudgy march from one hub for kill-and-fetch quests to the next. By Level 15, I'd largely stopped caring about what the people I encountered had to say at all. I just wanted to punch stuff.And boy, does Blade & Soul oblige. Few MMOs pull off combat better, and each of the seven classes can unleash combos that require watching what players and NPCs are doing in an effort to counter them. It's far more Street Fighter than World of Warcraft, even to an extent unmatched by TERA. Whether I was slamming diminutive Lyn warriors in the face with my oversized axe or rooting Kung Fu Masters as a spell-slinging Force Master, it was always enjoyable.All this comes together to complement a uniquely rewarding PvP experience, which reaches its zenith in the arena mode once players have unlocked their full range of skills at the level cap. Blade & Soul allows lower-level players to try to rough up level-capped folks in the arenas through normalization--a setting that evens out competitors' stats--but that's rarely wise since the absence of complete skills and their boosts from talent trees presents a monstrous disadvantage. Yet it's not impossible. Skill reigns supreme in Blade & Soul (as does a decent ping), and a smart newbie can still technically take down a veteran. A single arena match provides enough evidence of why Blade & Soul enjoys such a healthy esports life in Asia.Many NPC enemies use skills that players will use in the arenas, which should make for decent PVP training. The problem? They fight at a snail's pace, and it's possible to simply clobber your way through most encounters if you don't mind chugging a healing potion every once in a while.As it is, both the single-player and group dungeons amount to little more than short jaunts to forgettable thugs. Even the crafting lacks imagination, as it requires little more than placing an order and waiting for a bit. It also tends to lack the lively conversations (and bickering) of a good MMO's chat channel, though it's not through any fault of the players.As of the time of writing, it's almost impossible to carry on a conversation in many of the game-wide chat channels as they're crammed with gold spammers hawking their illicit wares. It was initially possible to get past the worst of it by leveling a bit, but now the spammer hordes choke up the lines even several hours in. Presuming you can get in. Several days in, the login queues remain obscene, sometimes even with the premium plan that sorts you into a shorter line.Yet one of the saving graces of Blade & Soul is that you don't have to pay a cent if you don't want to. Most of the time, there's no need. The cash shop mainly deals in cosmetic outfits that run the gamut from racy to grim, and many of these aren't even as impressive as the ones you can get with minimal effort from playing. Everything else mainly aims to make life a little simpler, such as experience-granting food or inventory expansions. As with the best cash shop models, making a purchase sometimes feels like making a donation.For all its drawbacks, I nevertheless enjoyed Blade & Soul. But when you're not at the level cap, it's a fleeting enjoyment best suited to short bursts. It tries to leverage combat to shoulder the weight of its other, more cumbersome parts, and in the process, even the combat stumbles after long hours of repetition. Despite the strong foundation, I was struggling to stay interested in Blade & Soul at the end of my journey. It does wonders with the blade, yes. But where's the soul?"}