{"ref": "https://www.gamespot.com/reviews/street-fighter-iv-review/1900-6213576/", "date": "July 17, 2009", "game_name": "Street Fighter IV", "text": "It's obvious that each iteration of the long-running Street Fighter series has been carefully tuned and tweaked to the finest degree, and nowhere is this more apparent than in Street Fighter IV. The lessons learned in the franchise's 20-plus years have been used to prune back the core fighting experience to create something truly special.Street Fighter IV is a resounding success not only because it's one of the most technically complex 2D fighters ever made, but also because it's also wrapped inside a layer of absolute accessibility. Never has the old ~A minute to learn, a lifetime to master~ adage been truer than it is here. Three new shader effects give the game a fresh new look, though they're only minor improvements on the already-gorgeous graphics. The Street Fighter fundamentals have remained consistent over the years; your job is to knock out the other guy or gal. All 12 of the classic world warriors--Ryu, Ken, Chun-Li, Blanka, E. Honda, Zangief, Guile, Dhalsim, Balrog, Vega, Sagat, and M. Bison--are back and playable from the outset, and they're joined by six brand-new and diverse characters. Abel, a mixed martial arts grapple-style character; Crimson Viper a female fighter with sweeping, airborne fire attacks; Rufus, a rotund fighter whose body makes him a bit of a sight gag despite his deceptive speed; and El Fuerte, a pro wrestler whose rushes and air throws make him a slippery foe. Ryu and Ken's sensei, Gouken, also makes his playable-character debut in Street Fighter IV. Naturally, he didn't teach the boys everything he knows, so when they meet again he has a few tricks up his sleeves, including a horizontal and vertical fireball EX move. The game's new end boss, Seth, fills the last spot and joins the list once you've unlocked everyone else. Character balance is spot-on across the roster, and as a result, you should never feel that you can't compete simply because you've chosen one character over another. You'll need to finish the game multiple times and in special ways to unlock the complete character list. Doing so will make fan favourites Cammy, Sakura, Akuma, Fei Long, Rose, Gen, and Dan playable. Like previous games in the series, Street Fighter IV lets you perform powerful super combos, but it has removed air blocking and parrying completely. Developers Capcom and Dimps have added a completely new gameplay system: focus attacks, a new multipurpose offensive and defensive ability that can be charged to one of three levels by pressing and holding the medium punch and kick buttons simultaneously. There's no onscreen bar to show how charged your attack is, so you'll need to rely on the progressively darkening ink splashes surrounding your character model. Each character features a unique focus animation, so you shouldn't have any trouble working it out after a few rounds with each. Focus attacks make you vulnerable to damage because you need to be standing still to charge them (though you can dash forward or backward to cancel them), but the trade-off is that you'll absorb the first hit without the penalty of an animation reset, allowing for an instant counterattack if you land it. They can also act as armour-breaking moves, shutting down more-powerful attacks. Successfully landing a fully charged focus attack will deal damage and crumple your opponent to the ground, giving you the chance to follow up with an unblockable hit as he or she falls. The new mechanic also lets you use part of your EX power-meter charge to exit animations early and chain bigger combos together. They take a little getting used to and some serious thumb dexterity, but once they're mastered, you can perform moves such as dragon-punch stalls directly into super moves or use them to juggle players in midair with multiple hits. Your revenge meter builds as you take damage, whereas the EX meter fills as you dish it out. EX power rolls over to the next round, but revenge must be built from scratch each time. This becomes a crucial risk-versus-reward mechanic. Do you take hits to build revenge and power up an ultra attack, or do you deal damage to burn your EX on improved moves, cancels, or save it for a super finisher? The flexibility of this system means that you're free to play according to your strengths and style. But just like reversals, EX power-ups, and ultra combo attacks, focus attacks serve to mix up the experience only for veteran players; such is the game's balance that they have never been required to win a match, and they act more as an additional weapon in the arsenal of a skilled player. They're waiting for you when you want to take a step up and learn how they work, but well-timed basic punches and kicks are just as effective. Championship mode pits you against similar skill-level online fighters in a pseudo tournament setting. The single-player mode is robust and has a lot to offer across several components. Arcade mode pits you against a set number of fighters from your unlocked-character roster and culminates in a showdown with Seth. Along the way to your goal, you'll always encounter a rival fight. These are regular fights accompanied by an in-engine exchange with your opponent. They're a welcome mix-up but often add nothing to the character's storyline because some fighters clearly don't even know why they hate one another. Each character's adventure is bookended by an anime-style cinematic movie that explains his or her motivations for attending the tournament. They're quite short and keep story to an absolute minimum, but they get the message across and do a reasonable-enough job of filling in the gaps. Given the amount of additional content shoehorned into this game, we were slightly disappointed to find that no bonus levels have been included, especially since we had high hopes of reliving our car and barrel smashing from Street Fighter II. Regardless of whether you're down with busting out a tatsumaki senpukyaku at will or think it's some kind of egg-noodle dish, there's a difficulty mode here for you. Eight levels ranging from very easy to hardest are available, so you're sure to find one appropriate for your skill level. That said, even at the gentler difficulties, Street Fighter IV is no cakewalk because your opponents will occasionally mix things up with surprise super and ultra combos. First-timers will have no trouble picking up, playing, and learning as they go. Playing on the medium or above difficulty will also enable score tracking, letting you submit and compare to other players on the game's online leaderboards. Street Fighter IV's training mode will challenge even experienced brawlers to improve. Given that SFIV straddles the line between classic SFII and SFIII gameplay, there's bound to be some confusion about which of your old mainstay combos work and the timing that you'll need to pull them off. The training mode is an excellent resource and is one of the biggest jewels in the SFIV crown. Once you've chosen your character and your sparring partner, you'll be able to pose them in various positions, toggle CPU control (and adjust its intensity), or give player two control of the action. There's even the ability to switch to your opponent's character, record up to 10 seconds of custom moves, and loop their replay. It's a great way to practice your evasion, attack timing, and counters without requiring another player or needing to search for online games. There are plenty of switches to fiddle with here, including changing your target's block mode, stun frequency, ultra and super power-bar start, and regeneration levels. Live attack data can be enabled to show how much damage your moves are dealing, whereas input display can show you which way you're pushing the sticks and mashing the buttons. You gonna pay for eating Rufus' danish! Training mode aside, one of the single best features of Street Fighter IV is the Challenge mode, which is made up of several sub-modes. Old faithfuls such as Time Attack and Survival mode make an appearance and see you completing fight after fight to best your rival before the timer runs out or you empty your vitality bar. The new addition to Challenge mode is Trial mode, a multitiered training tool that will teach you not only how to perform moves, but also how to string them together to best deal damage. Although the Training mode gives you the full arsenal and space to try it out, in Trial mode you'll need to perform a specific manoeuvre or combo to continue. The five normal difficulty levels cover basic character-specific moves such as dragon punches, charge moves, and throws, but they get significantly tougher as you progress to cover specials, cancelling attacks with focus, and stringing multipart combinations together. If you can get through these and feel up to the challenge, there are an extra five levels of bone-crushing general-purpose moves designed to help you improve your competitive play. Street Fighter IV supports both online and offline multiplayer modes, though cross-platform play with consoles is not available. In offline play, you'll be able to go head-to-head with a second player using your unlocked characters. Online is handled through the Games For Windows LIVE service and registers and runs without a hitch. For matches you'll be given the choice between friendly player matches, ranked games, or Championship mode. Winning ranked matches awards you battle points, which are used to both show off your prowess and help with the matchmaking process. Patched in after the Xbox 360 and PlayStation 3 versions of Street Fighter IV shipped (and also available on those platforms), Championship mode adds online play with a tournament-style knockout system. The ranking system means you'll only fight against players of roughly the same skill level as you accrue points and progress through a mock round system on the way to a final showdown. If you're after the true arcade experience, you can toggle online competitive challenge mode on and off to work with single-player. Just as you would expect in an arcade, if you're battling the CPU and someone issues a challenge, your game will pause and you'll automatically accept the invitation. Once the game has finished and you leave the multiplayer lobby, you'll restart your offline game where you were. You can set it to Player, Ranked or Championship matches as per your preference. We played online against opponents with both strong and weak connections, and even at slightly less than full connection strength, you'll receive an offline-like, seamless fighting experience. Poorer connections are more akin to a slide show, although we did manage to find games with supposedly poor connections that played quite well. Street Fighter IV's visual presentation is outstanding. The art style appears a lot more adult this time around, swapping the bright Saturday-morning kids' cartoon looks of previous games for large, menacing characters with bulging muscles and environments with more muted colour palettes. The game's pseudo-cel-shaded character-art style uses thick black borders and splattered ink to great effect, while fast, fluid animation sees your favourite fighters dance across the screen with grace. Long hair flows and trails, facial expressions contort and grimace as you deal blows, and eyes bulge as opponents see an ultra attack successfully executed. We observed a few minor character-model clipping errors during play, such as legs passing through each other and the odd missed sweep when we were sure that we should have landed a hit, but these are small quibbles because they appeared few and far between. Battle environments are a mix of old and new, reinventing favourites such as Guile's airbase tarmac (complete with destructible plane wings), Blanka's jungle walkways, and Chun-Li's marketplace alleyway. New environments include a secret science laboratory, a highway underpass, a classic martial-arts dojo, and the rim of an active volcano. Dhalsim's flames aren't nearly as frightening when you're fighting alongside a lava flow. The PC version of SFIV manages to ratchet up the already-gorgeous visuals a couple of notches over its console counterparts by offering resolutions up to 1920x1200, as well as selectable shader and antialiasing options to suit your PC's capabilities. Three new ~extra touch~ visuals--ink, watercolour, and posterization--add visual effects to your character and the environment. This includes the ability to add thicker borders, though it's purely cosmetic and doesn't alter gameplay. These settings aside, the visuals are almost indistinguishable from those on the Xbox 360 and the PlayStation 3, and the frame rate is solid even during the most frenetic battles. Audio is a particular high point in SFIV, and though the J-pop soundtrack and cheesy intro theme will be driven into your head within minutes, it's also worth mentioning the subtle environmental effects that go otherwise unheard in the heat of battle. The cheers of crowds, the rattle of old trains, and the barking of dogs in alleys all help create a genuine sense of immersion. Purists are even given the option to choose between Japanese and English voice-overs during cutscenes and as characters enter the ring. Unsurprisingly, the PC game includes support for Microsoft's Xbox 360 controllers and handles identically to its console brethren. The analog sticks are easy to use for performing ultra moves, though the Microsoft controller's D pad leaves plenty to be desired. Keyboard play or a mixture of keyboard and pad are supported, and while serviceable in a pinch, it's certainly not our preference for serious play. Button layouts for pad and keyboard can both be mapped to your tastes. Your best bet, of course, is to invest in a good arcade stick or one of the controllers designed specifically for this game. While not available in all territories, bundles with gamepads and a copy of the game are available from many retailers. Street Fighter IV will welcome you with open arms, whether you're a lapsed fan concerned that you've been out of the loop for too long or you're dipping your toes for the first time. Amazing presentation, intricate and enjoyable fighting gameplay, and long-term appeal with online play make this a must-have. Street Fighter IV is undoubtedly one of the finest examples of the fighting genre in this generation. Street Fighter IV's training mode will challenge even experienced brawlers to improve. Given that SFIV straddles the line between classic SFII and SFIII gameplay, there's bound to be some confusion about which of your old mainstay combos work and the timing that you'll need to pull them off. The training mode is an excellent resource and is one of the biggest jewels in the SFIV crown. Once you've chosen your character and your sparring partner, you'll be able to pose them in various positions, toggle CPU control (and adjust its intensity), or give player two control of the action. There's even the ability to switch to your opponent's character, record up to 10 seconds of custom moves, and loop their replay. It's a great way to practice your evasion, attack timing, and counters without requiring another player or needing to search for online games. There are plenty of switches to fiddle with here, including changing your target's block mode, stun frequency, ultra and super power-bar start, and regeneration levels. Live attack data can be enabled to show how much damage your moves are dealing, whereas input display can show you which way you're pushing the sticks and mashing the buttons. You gonna pay for eating Rufus' danish! Training mode aside, one of the single best features of Street Fighter IV is the Challenge mode, which is made up of several sub-modes. Old faithfuls such as Time Attack and Survival mode make an appearance and see you completing fight after fight to best your rival before the timer runs out or you empty your vitality bar. The new addition to Challenge mode is Trial mode, a multitiered training tool that will teach you not only how to perform moves, but also how to string them together to best deal damage. Although the Training mode gives you the full arsenal and space to try it out, in Trial mode you'll need to perform a specific manoeuvre or combo to continue. The five normal difficulty levels cover basic character-specific moves such as dragon punches, charge moves, and throws, but they get significantly tougher as you progress to cover specials, cancelling attacks with focus, and stringing multipart combinations together. If you can get through these and feel up to the challenge, there are an extra five levels of bone-crushing general-purpose moves designed to help you improve your competitive play. Street Fighter IV supports both online and offline multiplayer modes, though cross-platform play with consoles is not available. In offline play, you'll be able to go head-to-head with a second player using your unlocked characters. Online is handled through the Games For Windows LIVE service and registers and runs without a hitch. For matches you'll be given the choice between friendly player matches, ranked games, or Championship mode. Winning ranked matches awards you battle points, which are used to both show off your prowess and help with the matchmaking process. Patched in after the Xbox 360 and PlayStation 3 versions of Street Fighter IV shipped (and also available on those platforms), Championship mode adds online play with a tournament-style knockout system. The ranking system means you'll only fight against players of roughly the same skill level as you accrue points and progress through a mock round system on the way to a final showdown. If you're after the true arcade experience, you can toggle online competitive challenge mode on and off to work with single-player. Just as you would expect in an arcade, if you're battling the CPU and someone issues a challenge, your game will pause and you'll automatically accept the invitation. Once the game has finished and you leave the multiplayer lobby, you'll restart your offline game where you were. You can set it to Player, Ranked or Championship matches as per your preference. We played online against opponents with both strong and weak connections, and even at slightly less than full connection strength, you'll receive an offline-like, seamless fighting experience. Poorer connections are more akin to a slide show, although we did manage to find games with supposedly poor connections that played quite well. Street Fighter IV's visual presentation is outstanding. The art style appears a lot more adult this time around, swapping the bright Saturday-morning kids' cartoon looks of previous games for large, menacing characters with bulging muscles and environments with more muted colour palettes. The game's pseudo-cel-shaded character-art style uses thick black borders and splattered ink to great effect, while fast, fluid animation sees your favourite fighters dance across the screen with grace. Long hair flows and trails, facial expressions contort and grimace as you deal blows, and eyes bulge as opponents see an ultra attack successfully executed. We observed a few minor character-model clipping errors during play, such as legs passing through each other and the odd missed sweep when we were sure that we should have landed a hit, but these are small quibbles because they appeared few and far between. Battle environments are a mix of old and new, reinventing favourites such as Guile's airbase tarmac (complete with destructible plane wings), Blanka's jungle walkways, and Chun-Li's marketplace alleyway. New environments include a secret science laboratory, a highway underpass, a classic martial-arts dojo, and the rim of an active volcano. Dhalsim's flames aren't nearly as frightening when you're fighting alongside a lava flow. The PC version of SFIV manages to ratchet up the already-gorgeous visuals a couple of notches over its console counterparts by offering resolutions up to 1920x1200, as well as selectable shader and antialiasing options to suit your PC's capabilities. Three new ~extra touch~ visuals--ink, watercolour, and posterization--add visual effects to your character and the environment. This includes the ability to add thicker borders, though it's purely cosmetic and doesn't alter gameplay. These settings aside, the visuals are almost indistinguishable from those on the Xbox 360 and the PlayStation 3, and the frame rate is solid even during the most frenetic battles. Audio is a particular high point in SFIV, and though the J-pop soundtrack and cheesy intro theme will be driven into your head within minutes, it's also worth mentioning the subtle environmental effects that go otherwise unheard in the heat of battle. The cheers of crowds, the rattle of old trains, and the barking of dogs in alleys all help create a genuine sense of immersion. Purists are even given the option to choose between Japanese and English voice-overs during cutscenes and as characters enter the ring. Unsurprisingly, the PC game includes support for Microsoft's Xbox 360 controllers and handles identically to its console brethren. The analog sticks are easy to use for performing ultra moves, though the Microsoft controller's D pad leaves plenty to be desired. Keyboard play or a mixture of keyboard and pad are supported, and while serviceable in a pinch, it's certainly not our preference for serious play. Button layouts for pad and keyboard can both be mapped to your tastes. Your best bet, of course, is to invest in a good arcade stick or one of the controllers designed specifically for this game. While not available in all territories, bundles with gamepads and a copy of the game are available from many retailers. Street Fighter IV will welcome you with open arms, whether you're a lapsed fan concerned that you've been out of the loop for too long or you're dipping your toes for the first time. Amazing presentation, intricate and enjoyable fighting gameplay, and long-term appeal with online play make this a must-have. Street Fighter IV is undoubtedly one of the finest examples of the fighting genre in this generation."}