{"ref": "https://www.gamespot.com/reviews/hellboy-science-of-evil-review/1900-6195403/", "date": "August 29, 2008", "game_name": "Hellboy: The Science of Evil", "text": "There is a moment in Hellboy: Science of Evil when you have to face off against a hideous gorilla/octopus hybrid. It roars with anger as its slimy tentacles writhe like sloppy worms. At this point, your adrenaline should gush as you raise your stone-encrusted fist to do battle with this horrific abomination. In practice, you'll slurp up a rogue strand of drool as you halfheartedly pound your well-worn square button for the umpteenth time. In a game where even swinging half-formed frog men around by their prehensile tongues can elicit a hearty yawn, it's not surprising that facing off against a monster that should reside exclusively in nightmares feels downright boring. The only thing Hellboy does really well is make you appreciate how far the beat-'em-up genre has evolved since games that play like this were commonplace. Hellboy and Abe Sapien look desperate to leave this game. Hellboy has a beef with a witch who refers to herself in the third-person. You'll spend the first half of your quest trying to shut her up for good before you suddenly decide your real enemy is a horde of cyborg gorillas. The story is a convoluted mess of inadequate motivations and long soliloquies given by every skeleton you meet along the way. Instead of simple explanations that keep you abreast of why your missions are taking seemingly random turns, you are given such contemporary one-liners as ~We're not in Kansas anymore, Toto.~ Despite the cursory effort given to constructing this nonsensical tale, the cutscenes are all too frequent and far from concise; plus, you can't even skip them. Ron Perlman lends his voice talents, but while it's fitting how often he mutters ~That was easy,~ his usual smarmy punch is nowhere to be found. The main draw in a game involving an endless stream of enemies should be an entertaining combat system. There is no such draw here. You'll spend the majority of your time rapidly slamming the square button to punch with the occasional gunshot thrown in for diversity. This game is so easy you don't even have defensive maneuvers in your repertoire. Why would you need to block when your foes barely even attack? Enemies will meander up to you then simply stand still, waiting for you to turn around and smack them in the face. It's not uncommon to find yourself surrounded by a gang of ugly ghoulies only to walk away with your life bar still at the optimal level. You can pick up unwieldy swords and spears to give your aching fists a rest, but these serve as only graphically different versions of the same tired battle mechanic. Later enemies have bloated health bars, which force you to use discarded weapons to dispose of them in a timely manner. This serves to only frustrate because even the heartiest sword will shatter after three blows. Though these enemies take longer to kill, they never pose a serious threat to your own life. The only time you'll find yourself challenged is when obstinate puzzles and directionless level design lead you down the path of frustration. In one level, you are told to light torches to continue on your way. After using flaming spears to pass the first few sections like this, you come to a point where that tactic inexplicably doesn't work anymore. Instead, you have to reach your hand into an already lit torch and extract flammable bullets--a technique never explained prior to that moment. In another level, late in the game, you have to find tiny switches hidden along walls. Again, this maneuver was never exhibited before, which leads to a frantic search trying to figure out how to progress. The game is full of moments where it appears to be broken, at least until you realize that you just need to stumble upon some random solution. Despite his impressive size, the werewolf is a big pushover. Science of Evil is as likely to win awards for its technical prowess as Hellboy is for being a dapper duke. It makes sense that the game keeps a relatively steady frame rate because it never tries to do anything that will actually push the hardware. Character models lack detail and diversity--you'll see only two or three different types per level--while textures are muddy. Fortunately, the game runs without any noticeable hiccups even when a second player jumps in locally or online. Though cooperative play often makes a game more fun than slogging through alone, an extra player here merely makes this already easy adventure even less challenging. There is no reason to waste your time with Hellboy: Science of Evil. Even fans of the comic won't find much to dig here. The story is handled so inexpertly, it will only anger those who have invested hours reading the paper exploits of Hellboy. Weak combat and ugly visuals should deter those just looking for a solid beat-'em-up. With expectations for licensed products already so low, it's a testament to how poorly designed this game is that it can't even live up to the mediocre games around it."}