{"ref": "https://www.gamespot.com/reviews/geometry-wars-3-dimensions-review/1900-6415977/", "date": "November 26, 2014", "game_name": "Geometry Wars 3: Dimensions", "text": "It is 2:00 a.m., my right thumb is sore and my brain is fried, yet I cannot sleep--not just yet. I am staring at two numbers in the millions, one of which is higher than the other. The higher number belongs to a colleague at another publication. By day, we are friends and peers; by night, we participate in a grueling display of one-upsmanship and vain preening, working to best each others' Geometry Wars 3: Dimensions scores. And I cannot abide by this discrepancy. Clearly, I must prove my superiority.Geometry Wars 3 is about that endless quest to best friends and strangers. As you work your way through the single-player progression or toy around with the returning modes from Geometry Wars: Retro Evolved 2 and its predecessor, your focus may be on the onscreen fireworks display, but it's the promise of rising up the leaderboards that compels you. You use the left stick on your controller to move your minimalist vessel across the playing grid; you use the right to shoot a constant stream of projectiles in whatever direction you push. Green diamonds, yellow arrows, purple pinwheels, and all sorts of other geometric structures swarm you from every side, each shape following a particular pattern through space. Your brain and your thumbs are fully engaged with the process of mowing them down to the point that mind and muscle become one. You react to events before you understand them, yet there is a miniscule segment of your gray matter always devoted to the score you hope to reach.Score-chasing is rarely so elegant. Numerical goals are always visible on screen, and should a level end before you meet your challenge, it's quick and easy to restart the stage and try again. Yet while the promise of gloating over your friends is primary to Geometry Wars 3's appeal, that appeal would be diminished were the action itself not so refined. This dual-stick shooter controls like a dream, responding to your nudges and wiggles with exceptional grace. All the while, the soundtrack recalls Jan Hammer and Daft Punk, forcing you ever onward while giving even the early seconds of each level a sense of nervous urgency.You could have described the awesome Geometry Wars 2 with similar praise, and that game's best modes are represented once again, all under the guise of ~Classic Mode.~ Evolved is a time-honored tradition among shooter-lovers and loses little of its chaotic seductiveness. It's Pacifism that remains the most interesting of the returning styles, however, in that it removes shooting from the Euclidean equation entirely and has you traveling through neon gates that explode when you travel through them, and in the process, take down the alarming number of the pulsing cyan prisms pursuing you. The mode may be called Pacifism, but you aren't likely to feel very peaceful while you play. Success here means taking dangerous chances, allowing dozens of shapes to encircle you in the hopes of annihilating great numbers of them at once. Or, perhaps, zooming through the cloud of blue detritus that those shapes leave behind when destroyed, and cursing the busy visuals that obscure the perils that lurk behind the proliferating particles.Adventure Mode is at the forefront, however, and it is the mode that most deviates from the Geometry Wars formula. For one, it provides structural progression, granting you currency that you then spend on drones (and drone upgrades). Drones accompany you as you flit about the arena, perhaps adding to your firepower, perhaps sniping foes from a distance, perhaps collecting the green geoms that vanquished shapes leave behind. Then there are supers, special abilities that join your arena-clearing bomb, and have you dropping mines, spewing out homing missiles, or placing a highly powerful automatic turret. Adventure Mode's other deviation is in the levels themselves, which are no longer just flat arenas, but wrap into three-dimensional constructs. Some arenas take the form of globes; others are shaped like peanuts or cylinders. Sometimes, additional idiosyncrasies are mixed in, such as walls that gradually close in on you, or bosses that belch aggressive geometry and chase you around the playing field.Both diversions change Geometry Wars in fundamental ways. Where the unlock system is concerned, not all players are on level ground when playing a stage. You won't have the same abilities the first time you play a stage as you might when you return to it to shoot for a higher score. This adjustment inspires you to return once you've earned powerful drones--but it also strikes at the heart of the series. One of Geometry Wars 2's greatest assets was its purity: it was by skill, and skill alone, that you triumphed. There's less joy in rising to the top of the leaderboards when most of the players lurking under you conquered the level with lesser equipment. I glowed when I saw my name at the top of Adventure Mode's very first stage, but I didn't really earn my place at the head of the table. Classic Mode grants you a more accurate picture of your abilities, and though those leaderboards might crush your soul, it's a great pleasure to claw your way to the top--a pleasure Adventure Mode doesn't duplicate in spite of its own natural addictiveness.The soundtrack recalls Jan Hammer and Daft Punk, forcing you ever onward while giving even the early seconds of each level a sense of nervous urgency.The wraparound levels are home to some creative challenges. In many cases, the arrangement and order of the shapes that spawn into the arena are fixed, thus establishing specific gameplay rhythms. A stage might have you continuously zipping around a volumetric curve, carefully navigating a cube that flips around as you approach its edges, or avoiding oscillating platforms that destroy you with a single touch. Discovering how to exploit these rhythms is one of Geometry Wars 3's great challenges, for it's in that rhythm that is hidden that elusive high score. This is an uncommon brand of trial and error in the series, Waves mode notwithstanding, for you are rewarded just as much for your ability to recognize and memorize patterns as you are for your quick reactions to the game's variables.Geometry Wars 3 is absorbing regardless, though I can't in good faith claim that its additions make this sequel surpass its predecessor. Concerns of equal footing among players aside, some quirks also poke at the elements that made Geometry Wars 2 a case study in arcade austerity. In King Mode, for example, the circles that signal a safe space have been stretched into three-dimensional domes, complete with unnecessary rotating details, whose boundaries aren't as clear as they should be. Elsewhere, the returning red-and-blue diamonds that prove so often deadly in late-game fireworks no longer announce their presence via sound effects, leading to deaths that don't feel particularly fair, in part because the entirety of the stage doesn't appear on screen, and thus the shape's sudden appearance leaves no time to react. In the past, the series' visual clutter came from the vibrant particles that painted the screen. Now, it's the 3D visualizations, tilting surfaces, and warping effects that prove distracting, and often more so. You can crank up the distractions (and the tension) in four-player cooperative play, which leads you through a mini-adventure of its own, as well as a bit of squabbling as you face the fun (and challenging) mode-ending boss. (Sadly, there is no cooperative Classic Mode.) Your dreams of online cooperation still go unrealized, but you can still take the enjoyment online in the form of two different competitive modes, which pit two teams of up to four players against each other in a high-score showdown. These modes are sadly underpopulated to the extent that you might not find a match, which is a shame, considering how unusual and energetic they are. In Stock Mode, for instance, you must gather ammo drops to beat a crystalline boss, which means you and your opponents remain in constant motion, battling not only to survive and collect, but also to reduce each others' collective ammo pools. There is consolation here, however: online battles are a blast even when you're competing in lonely teams of one player each.But it's the leaderboard competition that remains at the heart of the series, in spite of Geometry Wars 3's tweaking and twisting of the blueprint. Geometry Wars: Retro Evolved 2 remains an almost-perfect example of its genre; Geometry Wars 3, in its reliance on unlockables, feels less confident in its foundation, adding embellishment where none was needed. My thumb, however, stands testament to the game's greatness, throbbing in pain as I enter the seventh consecutive hour of geometric action. Tomorrow, I will look at my swollen digit and promise myself to lay off the Geometry Wars 3: Dimensions. But such are the game's absorbing attributes that I will break that promise before the day passes."}