{"ref": "https://www.gamespot.com/reviews/supreme-commander-forged-alliance-review/1900-6182394/", "date": "November 6, 2007", "game_name": "Supreme Commander: Forged Alliance", "text": "It's hard to come up with a real-time strategy game that's as large and ambitious as Supreme Commander, which came out at the beginning of this year. The spiritual successor to 1997's famed Total Annihilation, Supreme Commander is a sci-fi strategy game that occurs on a scale far larger than regular RTS games. With battlefields that are as large as 40-by-40 square kilometers (or even 81-by-81 in skirmish and multiplayer), the game offers a lot of flexibility and room. When you flash forward to the end of the year, we get Supreme Commander: Forged Alliance. What's impressive is the amount of stuff that developer Gas Powered Games has managed to squeeze into the standalone expansion in relatively little time. The zoomed-out strategic view gives you a nice idea of how big the battles in Forged Alliance can get. Forged Alliance delivers six massive new single-player missions, as well as a slew of welcome improvements and enhancements. These include a new user interface, a graphical upgrade, and a fourth playable faction. The game continues the story of the 1,000-year old Infinite War, where three warring factions of humanity have slugged it out against one another. There are the regular humans in the United Earth Federation, the cybernetic humans in the Cybran Nation, and the alien-influenced humans in the Aeon Illuminate. The end of Supreme Commander showed the ~end~ of the Infinite War. Depending on which faction you played as, you seized control of the Black Sun superweapon, fired it, and won the war for your side. But if you stayed and watched the end of the credits, Supreme Commander hinted at something else. A rift opened, unleashing an alien horde known as the Seraphim. Forged Alliance picks up a couple of years later, with the surviving human factions trying to fend off extinction. You can play as any of the human factions in the six-mission campaign, and your choice will affect the dialogue that you hear, as well as some of the secondary missions, but the core objectives remain the same in all cases. If the three single-player campaigns in Supreme Commander have a weakness, it's that each one ramps up slowly. The first mission gives you access to the most basic of units and buildings, then each successive mission unlocks new toys with which you can play. But it isn't until the final mission that the game unlocks all of your units and buildings. By that point, there isn't a lot of opportunity to play with the really cool stuff, like mighty experimental units, which are gigantic war machines that can turn the tide of battle. Sure, you can always play a skirmish or multiplayer game and get access to everything, but the single-player story always feels a bit lacking in that regard. That problem is solved with Forged Alliance, which assumes that you've played through Supreme Commander and are ready to remove the training wheels. Each of Forged Alliance's six missions gives you access to almost everything from the get-go, with a handful of new units introduced during the course of the campaign. There's no ramp-up here because each battle is far bigger than anything seen in the original game. The warfare is much more epic and the battles are that much fiercer. You'll finally be able to unleash navies, air forces, and armies on huge maps. Opponents will throw masses of advanced and experimental units at you, which you'll need to respond to in kind. The average mission will take at least an hour and a half or so, although some will take longer. There's a nice variety of missions, including a large, naval battle set amid frigid seas; a desperate last stand against overwhelming odds; and a struggle among three sizeable foes. You can't play as the alien Seraphim in the campaign; they're only available in skirmish or multiplayer. Skirmish mode introduces a nice new adaptive artificial intelligence personality that alternates between offense and defense. There are also a slew of new maps to beef up the overall number considerably. Multiplayer over Gas Powered Games' excellent GPGNet service is excellent because it makes matchmaking a breeze. You can also check statistics, watch replays, and track the geographical location of your opponents. On top of the epic campaign, Gas Powered found time to completely redo the user interface, making it slightly more informative and a lot more attractive. Supreme Commander's interface always seemed bland and dated, but this new UI is sharper and more colorful. The interface improvements are nothing compared to the graphical upgrade. For example, polygon counts on units, textures, and shaders have been improved; thus, the difference between Supreme Commander and Forged Alliance is almost startling. However, this comes at a slight price because performance seems to bog down a bit more on midrange machines, but you can tweak the settings down to what they were before. On high-end rigs, the graphics are a very nice improvement. The visual improvement over Supreme Commander is considerable. Forged Alliance does feature some balance tweaks that aren't quite as welcome. One of the most notable is how nuclear weapons have basically been taken out of the picture. Nukes now take a ridiculously long time to construct. In fact, they take so long that they're almost useless because almost any game can be resolved before a nuke is even constructed. For instance, the UEF's mighty and superexpensive Mavor artillery gun, which can launch an unending barrage of shells anywhere on the biggest maps, is a lot faster to build than a single nuke, as well as a lot more valuable. As it is right now, nukes seem like a red herring. Aside from the nuke quibble, there's a lot to like in Forged Alliance because it makes an already gargantuan game bigger and better. Supreme Commander fans will finally get to experience campaign missions that let them unleash the full weight of their arsenals, while the size and scope of the game remains far beyond almost anything else on the market. When we look back at 2007 in terms of strategy gaming, it may very well be remembered as the year of Supreme Commander."}