{"ref": "https://www.gamespot.com/reviews/infinite-crisis-review/1900-6416096/", "date": "April 10, 2015", "game_name": "Infinite Crisis", "text": "Unlike the superheroes of comic books, Infinite Crisis makes no effort to hide its true identity. It is, through and through, a clear play for the lucrative MOBA market featuring familiar DC Universe characters as playable champions. While no one can fault Warner Brothers for wanting its franchise to be represented among the ever-growing population of MOBAs, you might have expected to see more effort to mask the face of gameplay we've seen regurgitated over the past few years.Infinite Crisis follows a formula similar to most of the DotA and League of Legends knock-offs that have sprung up over the years. Each team has a nexus--er, power core--connected by lanes to the enemys power core. Those lanes have towers that need to be destroyed so you can reach the enemys core. Your champion starts out at level one and levels up by defeating wave after wave of minions--er, drones--and unlocking access to more powerful abilities and items that will help you combat the enemy champions.If you only play the standard maps in DotA and League of Legends, you will find Infinite Crisis' default map a bit different from what youre familiar with due to the objectives beyond defeating towers and neutral monsters. At a certain point, power relays unlock that players capture by standing on them. Controlling two of the three relays enables stronger drones for your top lane, while controlling all three powers the drones in both lanes. The inhibitor/rax interaction of other games is completely absent in lieu of this territorial control element. The extra level of strategy involved in controlling the relays greatly affects gameplay: Getting your teammates to help you force away the lone enemy jungler trying to capture his own territory can mean a huge swing in power early on in the game and catalyze a wave of momentum leading to victory.Although the majority of combat is intended to take place in the lanes, I found myself to be much more effective in the game's poorly-tuned Urban Jungle, where it is far too easy to get massive leads in credits (gold) over other players. It isn't clear at the outset, but the two camps near the center of the Coast City yield far more experience and credits without much more risk--controlling those two camps alone can slingshot you ahead of allies and enemies alike that stick to farming the lanes instead. As long as the game isn't particularly bloody, your jungler can find herself thousands of credits ahead of everyone else in the game, even without interacting with other players. This discrepancy in the expected balance sticks out like a sore thumb, and in my own play time, I was able to abuse that feature to drastic effect.Infinite Crisis does have its own carbon copy of the DotA/LoL map along with a few others, but matchmaking queues for all of these are disabled due to population concerns, thus ensuring that everyone is funneled into the Coast City queue for fast matchmaking times. If you wish to play the other variants, you must have friends willing to join you in the custom lobbies. The queues for these maps could return in the near future if the game's population rises again, but in the interim, it's frustrating to see player choice diminished by players abandoning the DC Multiverse.Champion design in Infinite Crisis is overtly familiar, with some skills being almost direct ports of their League of Legends counterparts, though no kit feels like a direct rip-off. The game does a good job of making each champions skill set make sense for that superhero--even the alternate universe versions of those heroes. The Flash is overloaded with mobility, as one would expect from the Fastest Man Alive. Green Lantern comes with massive magical nuke powers thanks to his ring. The Joker's play style can be summarized with the word ~trickster.~ IC even brings out Superman's trusty canine, Krypto, whose entire gameplay kit revolves around him fetching a bone to empower his support abilities. Infinite Crisis also enlists the alternate Earths of Arcane, Atomic, Gaslight, Mecha, and Nightmare for champion designs. Gaslight's steampunkish designs and Nightmare's monsters both managed to output my favorite characters.Infinite Crisis' main problem is that it lacks snappiness. It's hard to get a good grasp on just how much damage you're going to do, even after practice with certain champions. Playing Gaslight Catwoman, I only knew my assassination attempts would succeed if I engaged with someone low on health or massively overextended. If the target were at full health, it was a coin toss whether I would get the kill I was going for. This problem is exacerbated by underwhelming visual effects that don't deliver the justice one would expect from a clash between superheroes. Apart from a few exceptions, such as the Green Lantern incarnations' ring manifestations, the game's spell effects don't pop from the screen and encourage engagement in combat. The visuals fail to evoke excitement; Much like the drone minions, interacting with Infinite Crisis feels robotic and mechanical, turning the combat into the games biggest drone.Another setback is the user interface. The main menu features an imbalanced presentation of relevant information versus auxiliary information. Achievement progress takes up nearly a quarter of the screen, while the game's shop, where players can unlock champions, skins, and stolen powers, is tucked away in the right-hand corner. Once in-game, the item shop is no easier to manage. Granted, the recommended item builds are easy to use (the game includes a button to auto-buy the next recommended item any time you can afford it and are near the shop), but the full list of items is displayed as icons, with no names showing unless you hover over the icons. You can sort items by what stats they give, but hunting down a specific item's passive effect gets tedious and slows down your gameplay. Learning how to use the item shop made me feel like I was memorizing vocabulary for third grade all over again, and it wasn't a pleasant experience.By design, items also have their own problems; because Infinite Crisis doesnt include any component items and each item must be upgraded from its base form to its final form to unlock its passive effect, changing your item builds midgame to accommodate your team's needs or adjust for any new situations is much less efficient than it is in similar games. Items dont have branching upgrade paths, so once you've started an item, you're stuck with that path unless you sell it or start a new item.The game is friendlier for newer players than some of its in-genre siblings, however. While League of Legends keeps rune slots locked until certain account levels, Infinite Crisis gives characters completed Augment/Mod kits they can use even at level 1. Players can purchase augments and mods to customize a character to their liking, but no player is at an outright disadvantage simply for being at a lower level. In this sense, Infinite Crisis improves upon existing MOBA conventions. Unfortunately, the game otherwise lacks the Old English finish it so sorely needed; Where's Alfred when you need him?"}