{"ref": "https://www.gamespot.com/reviews/breath-of-fire-ii-review/1900-6184578/", "date": "January 10, 2008", "game_name": "Breath of Fire II", "text": "For Wii owners, the Virtual Console service seems like the perfect spot to give fans of such series as Final Fantasy and Dragon Quest a taste of their origins. Yet, so far, there's very little to turn to when it comes to Japanese role-playing games. The closest we have is Capcom's Breath of Fire II, and unfortunately, its unrefined localization and balance issues--the latter of which is mitigated by the portable nature of its earlier and more recommended Game Boy Advance port--tends to overshadow its redeemable qualities. Um, why do you want to kill me? In Breath of Fire II, the new religion of St. Eva has gathered a cultlike following. You play as Ryu, saddled with a mysterious destiny, and embark on a journey during which you'll discover true St. Eva's nature, meet powerful allies, quell demon uprisings, and combat an evil that threatens to destroy the world. The game has you traversing the world and its dungeons in a top-down fashion, collecting treasures, fighting monsters with a menu-driven, turn-based system, and strengthening your party members' abilities. There are small touches that add some unique flavor to the familiar recipe. For starters, each of your party members has a special ability that can be used outside of combat, mostly to help you navigate the world. One member turns into a giant frog and swims across lakes. Another walks through otherwise impassable forests. You'll also start a town that you can populate with merchants found across the world, some selling very powerful equipment. Ryu can fish, and two of his friends can hunt for meat--all of which can be used as curatives or cooking ingredients for rare items (if you find your town a chef). You'll recruit shamans who can bind their powers to your party members, resulting in some fantastic metamorphoses and powers. Finally, Ryu himself learns how to transform into intimidating dragons during battle. The game is brought to life with bright environments and detailed sprites. Every monster and party member has idle animations during battle, and higher-level spells make decent, though not extensive, use of the Super NES color palette and special effects. Sadly, most melodies loop repetitively and obnoxiously, and many sound effects sound as if they're coming out of a wind tunnel. Still, some tunes adequately help the visual presentation to effectively push along the more intense and touching moments of the plot. You'll appreciate this as you witness angering deaths and heroic sacrifices, all set atop heavy religious themes that were uncommon during the game's original release. However, two huge problems hinder the experience. The more egregious issue is the game's deplorable localization job. Menu commands, item names, and even location names are shortened to the point of obscurity. For instance, an accessory called ~DreamBR~ is simply described as ~Erase the spell.~ Oh, and good luck figuring out what the battle command ~Sweh~ stands for. Much of the dialogue is similarly vague and childish-sounding, and thus holds back any gravitas that the story would have had otherwise. This can also obfuscate what and where your next goal is supposed to be. The other issue is the game's poor pacing. From the outset, it's peppered with fetch quests that have you backtracking across half the world--but you won't obtain a speedy method of travel or the warp spell until a fourth of the way in, so until then you're on foot. Many interesting treasures, events, shamans, and dragon transformations are squeezed into the game's last few hours. A smattering of oddities round out the negatives: You can't unequip weapons or armor; many combat abilities are useless or detrimental to your characters; and none of Ryu's ~elemental~ dragon attacks actually do elemental damage. Last time I checked, that's not how you spell rod. Because of these issues, not only is Breath of Fire II less enjoyable story- and gameplay-wise, it also comes off as a hasty, careless effort. It's a shame, because for 800 Wii points, you still get a lengthy quest--potentially more than 35 hours--that sports some truly engaging and worthwhile ideas, and the last few hours are genuinely exciting. Ultimately, you can have a good time if you decide to check it out, but only if you're patient enough to look past its very rough edges."}