{"ref": "https://www.gamespot.com/reviews/contra-shattered-soldier-review/1900-2895593/", "date": "October 23, 2002", "game_name": "Contra: Shattered Soldier", "text": "There's no denying that Konami's Contra is a classic. First released in arcades back in 1987 and later successfully ported to the Nintendo Entertainment System, the action-packed shooter featured a mix of side-scrolling and pseudo-3D levels, a number of powerful weapons, lots of tough opponents, and plenty of surprises. Impressive graphics, an excellent musical score, and two-player simultaneous gameplay ensured the game's long-term popularity, and a couple of great sequels--particularly the outstanding Contra III: The Alien Wars--helped turn Contra into one of Konami's best-known franchises. And now, after hitting a couple of bum notes during the late '90s, the Contra series returns in what can easily be described as an homage to the series' roots. Nostalgic Contra fans are therefore likely to get a real kick out of Contra: Shattered Soldier for the PlayStation 2, which essentially re-creates the series' classic gameplay using 3D polygons instead of 2D sprites. And while the game packs many of the same types of surprises and difficult challenges that have characterized the series' best offerings, the fact is, the year isn't 1987 anymore, and not everyone these days is going to appreciate this game's short length and simple gameplay. For that matter, die-hard Contra fans hoping for a pure Contra remake may find themselves a little disappointed that, for all its similarity to its classic predecessors, Contra: Shattered Soldier takes a few too many liberties. They'll more than likely enjoy the game anyway, though. Not that a game about blasting aliens needs any kind of story, but Contra: Shattered Soldier is basically a retelling not of the 1987 original, but of the Sylvester Stallone/Wesley Snipes sci-fi flick Demolition Man. In a far-flung future, Bill (who was player one in the original Contra) is released from some sort of cryogenic containment facility because he's the only soldier powerful enough to defeat Lance (who was player two in the original Contra), his former partner and now the apparent mastermind behind an all-out alien invasion. Player two this time is Lucia, a female counterpart to Bill, though both characters are completely identical in terms of gameplay. So Bill and/or Lucia set out to shoot their way through five short, action-packed levels. In Contra: Shattered Soldier, you can run, you can jump, and you can shoot. You can actually shoot in eight directions (depending on where you push the directional pad or analog stick), and pressing and holding the L2 button causes you to lock your aim in one of those positions. Additionally, at any point, you can switch between three different weapons--a machine gun, a flamethrower, and a grenade launcher. These each have an optional charge-up attack, as well. The machine gun can shoot out a device that causes a pinwheel of bullets to spray the screen; the short-ranged flamethrower can fire a long-ranged energy blast; and the grenade launcher can shoot a salvo of seeking missiles. All these attacks feel somewhat underpowered, as they tend to be useful only in specific types of situations. For better or worse, there's no dominant weapon in the game. The three weapons in your possession are all you'll ever get, which seems rather disappointing since part of the fun of the classic Contra games was when you'd manage to grab exactly the one weapon power-up that you most desperately needed. On the other hand, having constant access to three different weapons certainly makes Shattered Soldier seem like a more tactical game than its predecessors. Then again, the tactics are pretty thin. There's usually not just a best weapon for each situation, but even a best mode of fire. Some bosses are easily defeated using the flamethrower. Some swarming enemies are easily vanquished using the seeking missiles. Sure, there's nothing to prevent you from using any of the weapons in any situation, but rest assured you'll only meet a swift defeat if you're not using the right weapon for the job. Contra's style of gameplay is still fun and intense and is still a real test of skill...and memorization. The fact is, you won't survive any of the game's five levels (four of which are playable from the get-go) the first time through, and probably not the second or third time, either. Each time you play you'll probably get a little farther along, armed with the prescience of exactly where all your enemies will come from leading up to the moment you perished in your previous attempt. This wouldn't be a Contra game unless a single hit from enemy fire or even the slightest contact with a foe was lethal, and so some of the game's battles can be extremely tough. But you'll gradually pick up on life-saving patterns you can use to safely get through pretty much all of the game's encounters. Earlier this year, a truly excellent shooter called Ikaruga was released for the Dreamcast in Japan, and that game proved that reflex-oriented gameplay combined with some necessary pattern memorization could still make for a great gaming experience in this day and age. Contra at times confirms this notion, but on other occasions you'll just feel as though you're beating the system rather than playing skillfully. You'll almost certainly die the first few times you encounter some of the game's situations, but once you figure out some trick to the situation, suddenly the fight turns easy and formulaic. By comparison, even when you know the patterns, Ikaruga is never, ever easy. This wouldn't be a Contra game without impressive boss battles. The five levels in Contra: Shattered Soldier stay very true to the series and incorporate a variety of side-scrolling and pseudo-3D shooting sequences that are certainly impressive the first few times through. Special mention must be given to some of the game's boss battles, in which you'll have to take on some truly hideous or just flat-out creepy foes. Konami is legendary for the excellent boss battles seen in many of its games, and Contra: Shattered Soldier should do well to maintain the company's reputation. Actually, though, you'll get the impression that the designers focused way too heavily on the boss battles and not enough on everything else. Whatever happened to the concept of facing a powerful boss only at the end or even at the middle and end of a level? In this Contra game, roughly three quarters of your time playing will be spent in battle against bosses. These fights are all unique, but the game's more straightforward run-and-gun sequences are so exceedingly rare by comparison that you'll actually wish there were a lot more of them. It's strange to criticize a game's level design for not being padded out with more filler action, but really, that's exactly what this Contra could have used. No one's going to complain about repetition in an arcade-style shooter like this. Another consequence of the nonstop boss battles is that these bouts are frequently characterized by in-engine cinematic cutscenes, which can't be skipped and only serve to interrupt the flow of the action, diminishing the game's replay value. Remakes of games such as Contra call attention to the fact that gaming in general has really improved over the years. The fact that, with practice, you can blast through Contra: Shattered Soldier in about an hour would be unacceptable if the game were anything other than a throwback to a classic. The fact that the game's default difficulty setting puts a strict limit on the number of lives and number of continues you have to complete the game could also be seen as nothing more than frustrating. Meanwhile, the game's ~easy~ setting doesn't actually make the game easier, but merely gives you more lives and a ton of continues. Back in the day, the inability to save one's progress during or in between levels was mostly due to technical limitations. The same goes for the relative short length of old action games, as cartridge-based consoles couldn't exactly store massive numbers of levels. Simply put, expectations were lower, yet those are the expectations that Contra: Shattered Soldier lives up to. Consider that either a warning or an invitation. It's better as a rental, but Contra fans shouldn't miss Shattered Soldier. Contra: Shattered Soldier may have an antiquated design, but it certainly looks like new. The consistently smooth frame rate, sharp resolution, and highly detailed, fluidly animated, and often imaginative creatures make the game's graphics the best thing about it. Contra fans will love some of the obvious visual references to the classic games, but anyone would agree that this is a great-looking PS2 game. The audio isn't quite as impressive, but it's still pretty solid. Many of the sound effects are generic, and there's a distinct absence of spoken dialogue during the game's couple of 3D cutscenes between levels. On the other hand, the sound track, which combines heavy metal guitars and some fast-paced techno, is just the ticket for a high-intensity game like this, even if it isn't very memorable. Even though they'll finish the game in a hurry, fans of the Contra series should by all means play Contra: Shattered Soldier, as it'll certainly rekindle some of their nostalgia for some of Konami's excellent, old shooters. Shattered Soldier does have some hidden bonuses to be unlocked and has a decent amount of replay value in general, since playing the game with two players puts a different spin on the action, and the game's default difficulty level is very tough. Still, at its core, it's a short, simple game that's both a great example of why some of us have such fond memories of this style of gameplay and a great example of why games like this are much less common now than they used to be. Earlier this year, a truly excellent shooter called Ikaruga was released for the Dreamcast in Japan, and that game proved that reflex-oriented gameplay combined with some necessary pattern memorization could still make for a great gaming experience in this day and age. Contra at times confirms this notion, but on other occasions you'll just feel as though you're beating the system rather than playing skillfully. You'll almost certainly die the first few times you encounter some of the game's situations, but once you figure out some trick to the situation, suddenly the fight turns easy and formulaic. By comparison, even when you know the patterns, Ikaruga is never, ever easy. The five levels in Contra: Shattered Soldier stay very true to the series and incorporate a variety of side-scrolling and pseudo-3D shooting sequences that are certainly impressive the first few times through. Special mention must be given to some of the game's boss battles, in which you'll have to take on some truly hideous or just flat-out creepy foes. Konami is legendary for the excellent boss battles seen in many of its games, and Contra: Shattered Soldier should do well to maintain the company's reputation. Actually, though, you'll get the impression that the designers focused way too heavily on the boss battles and not enough on everything else. Whatever happened to the concept of facing a powerful boss only at the end or even at the middle and end of a level? In this Contra game, roughly three quarters of your time playing will be spent in battle against bosses. These fights are all unique, but the game's more straightforward run-and-gun sequences are so exceedingly rare by comparison that you'll actually wish there were a lot more of them. It's strange to criticize a game's level design for not being padded out with more filler action, but really, that's exactly what this Contra could have used. No one's going to complain about repetition in an arcade-style shooter like this. Another consequence of the nonstop boss battles is that these bouts are frequently characterized by in-engine cinematic cutscenes, which can't be skipped and only serve to interrupt the flow of the action, diminishing the game's replay value. Remakes of games such as Contra call attention to the fact that gaming in general has really improved over the years. The fact that, with practice, you can blast through Contra: Shattered Soldier in about an hour would be unacceptable if the game were anything other than a throwback to a classic. The fact that the game's default difficulty setting puts a strict limit on the number of lives and number of continues you have to complete the game could also be seen as nothing more than frustrating. Meanwhile, the game's ~easy~ setting doesn't actually make the game easier, but merely gives you more lives and a ton of continues. Back in the day, the inability to save one's progress during or in between levels was mostly due to technical limitations. The same goes for the relative short length of old action games, as cartridge-based consoles couldn't exactly store massive numbers of levels. Simply put, expectations were lower, yet those are the expectations that Contra: Shattered Soldier lives up to. Consider that either a warning or an invitation. Contra: Shattered Soldier may have an antiquated design, but it certainly looks like new. The consistently smooth frame rate, sharp resolution, and highly detailed, fluidly animated, and often imaginative creatures make the game's graphics the best thing about it. Contra fans will love some of the obvious visual references to the classic games, but anyone would agree that this is a great-looking PS2 game. The audio isn't quite as impressive, but it's still pretty solid. Many of the sound effects are generic, and there's a distinct absence of spoken dialogue during the game's couple of 3D cutscenes between levels. On the other hand, the sound track, which combines heavy metal guitars and some fast-paced techno, is just the ticket for a high-intensity game like this, even if it isn't very memorable. Even though they'll finish the game in a hurry, fans of the Contra series should by all means play Contra: Shattered Soldier, as it'll certainly rekindle some of their nostalgia for some of Konami's excellent, old shooters. Shattered Soldier does have some hidden bonuses to be unlocked and has a decent amount of replay value in general, since playing the game with two players puts a different spin on the action, and the game's default difficulty level is very tough. Still, at its core, it's a short, simple game that's both a great example of why some of us have such fond memories of this style of gameplay and a great example of why games like this are much less common now than they used to be."}