{"ref": "https://www.gamespot.com/reviews/pac-man-world-2-review/1900-2850759/", "date": "May 17, 2006", "game_name": "Pac-Man World 2", "text": "The original Pac-Man World for the PlayStation remains one of the best-executed remakes of a classic arcade game--not that that's saying much. But the game did an excellent job with its source material--Namco's incredibly famous arcade classic--both in terms of the aesthetics and its play mechanics as a platform game. The PS2 sequel closely follows the original's formula and improves certain aspects of the first game in the process. Specifically, the sequel's level design is varied and interesting, and the individual environments are well paced, challenging, and packed with a whole lot of minute-to-minute action. Pac-Man himself boasts a couple of new moves and has access to some unique modes of transportation, including skates, swimming flippers, and even a submarine. All this boils down to a good amount of diversity, which is precisely what keeps the game from ever growing stale, as can be the case with less-polished platformers. Pac-Man World 2, like its predecessor, is a 3D platformer in which you play as Namco's round, yellow mascot, Pac-Man. You'll make your way through some 20 odd levels, replete with pits, ghost monsters, and other nasty creatures and obstacles. Your quest is to recover the five golden fruit filched by that good-for-nothing band of ghosts, which constantly terrorizes Pac-World. Though their motive was purely to vandalize the venerable Pac relics, the ghost monsters got a whole lot more than they'd bargained for, along with the fruit--it turns out that the Pacs of old had trapped an ancient evil under the tree on which the golden fruit rested. By pilfering the fruit, the ghosts unleashed upon the world a being called Spooky--an even bigger, more evil ghost monster than any of them. Pac-Man is soon summoned by the brilliant and kindly Professor Pac and sets forth to recover the stolen relics--and thus to put a stop to the threat. As absurd as all of this sounds, you can be sure that it's much more so when witnessed firsthand. Pac-Man himself is still the animate sphere you remember from the arcade cabinet art, and as he walks around, interacting with all the abstract creatures and environments, his mug will be marked with the same euphoric grin that's haunted more than two generations of gamers. Still, given how well Pac-Man World 2 is executed, it's hard to envision a more appropriate platform mascot. The game takes place across six worlds, each of which is designed around a very precise platformer archetype--there's a precarious treetop world, a slippery ice world, an underwater world, and even a haunted ghost-ship world. Each stage in a world will feature at least one new element of gameplay, which does a whole lot to keep things interesting over the course of the game. In the second world, for instance, you'll encounter butane torches that you have to deactivate with a switch to safely traverse the platforms on which they're set. The level prior to that one is built around super high-launching bounce pads (called ~b-doings~) that you have to launch off sequentially. The end result is that the game's action isn't just well paced, but also stays rather intense every minute of the way. Pac-Man himself has a couple of basic movements that have been put to great use by the designers. He can jump, of course, and execute a butt-bounce along with it. His is literally a bounce, though--if you perform it repeatedly, you'll actually bounce around like a basketball. You can also execute a spin-kick while up in the air, which you'll use to dispatch flying enemies and crack open any crates that may be floating about. Finally, Pac-Man can dash, just like Sonic the Hedgehog. You ~charge up~ by hitting the square button, and when you release it, you shoot forth like a yellow streak cutting through space. Each of these moves must be used to get through the stages, and many sequences will focus specifically on some aspect of their use. In the treetop stages, for instance, you'll come across a handful of ramplike platforms, which you'll need to dash across to reach other platforms far away. Some of these long jumps can get quite challenging. They're tough enough as it is, so you won't thank the game's camera for making some of them more difficult than they should be. While the camera works fine most of the time, in some areas your view is fixed, and in a few instances the camera is fixed at a bad angle. You won't see where you're going or what you're doing. Your only hope in these cases is for the camera to reset automatically, which doesn't always happen. These occurrences are fortunately rare enough that they aren't such a big deal. Besides, in most cases, you're able to manually control the camera with the right analog stick, and you can always reset it behind Pac-Man by hitting the L1 button.The game's boss battles are definitely worth mentioning. Most revolve around battling one of the four ghost monsters, who are more often than not behind the controls of giant, deadly automatons. These battles take place on specially designed stages, which you'll have to take advantage of to emerge victorious. According to the classic boss battle formula, each boss has a weakness that you have to exploit to eventually empty out its life bar. This usually involves performing a combination of jumps and dashes, as well as using some of the terrain features, such as b-doings and dash-ramps. Pac-Man World 2's graphics and entire presentation will likely draw you in right from the start. It's simple, but the game makes brilliant use of the classic's design, and the whole retro style never seems forced. You'll still chomp power pellets and various types of fruit and be treated to the same exact sound effects as in the classic game whenever you do so. Some sequences are also designed around the classic's gameplay; you'll encounter a field of dots arranged in a maze, with four ghost monsters roaming around. Since ghosts can be chomped only when you're imbued with the power of a power pellet, you'll find yourself using the very same strategies you used in the old arcade game. It's clever rather than contrived, and the whole game runs at a consistent 60 frames per second. Pac-Man World 2 is a great platform game overall, one that anybody who's into the lighthearted style of the game would do well to check out. There are a fair bit of extras packed in as well, which extends its longevity--the most significant of these is an arcade full of classic emulated Pac-Man games, which you'll find in Pac-Village. Pac-Man World 2 is a fun game, and anyone who's the least bit excited by the history of gaming and the sights and sounds that started it all should enjoy it. The game's boss battles are definitely worth mentioning. Most revolve around battling one of the four ghost monsters, who are more often than not behind the controls of giant, deadly automatons. These battles take place on specially designed stages, which you'll have to take advantage of to emerge victorious. According to the classic boss battle formula, each boss has a weakness that you have to exploit to eventually empty out its life bar. This usually involves performing a combination of jumps and dashes, as well as using some of the terrain features, such as b-doings and dash-ramps. Pac-Man World 2's graphics and entire presentation will likely draw you in right from the start. It's simple, but the game makes brilliant use of the classic's design, and the whole retro style never seems forced. You'll still chomp power pellets and various types of fruit and be treated to the same exact sound effects as in the classic game whenever you do so. Some sequences are also designed around the classic's gameplay; you'll encounter a field of dots arranged in a maze, with four ghost monsters roaming around. Since ghosts can be chomped only when you're imbued with the power of a power pellet, you'll find yourself using the very same strategies you used in the old arcade game. It's clever rather than contrived, and the whole game runs at a consistent 60 frames per second. Pac-Man World 2 is a great platform game overall, one that anybody who's into the lighthearted style of the game would do well to check out. There are a fair bit of extras packed in as well, which extends its longevity--the most significant of these is an arcade full of classic emulated Pac-Man games, which you'll find in Pac-Village. Pac-Man World 2 is a fun game, and anyone who's the least bit excited by the history of gaming and the sights and sounds that started it all should enjoy it."}