{"ref": "https://www.gamespot.com/reviews/chris-sawyers-locomotion-review/1900-6108957/", "date": "September 27, 2004", "game_name": "Chris Sawyer's Locomotion", "text": "Chris Sawyer's Locomotion poses something of a dilemma. On one hand, the latest game from the creator and designer of RollerCoaster Tycoon is a fun and compelling economic strategy game about building a vast and intricate transportation network. On the other hand, we've played this game before, back in 1994, when it was called Transport Tycoon. Indeed, Locomotion is billed as the spiritual successor to Transport Tycoon, and that it is, almost down to the bells and whistles. Yes, the graphics are a little snazzier, but this is almost a dead ringer for Transport Tycoon. And while Locomotion doesn't vary much from Transport Tycoon--which itself is a classic game--you can't help but feel that this remake doesn't really feature any of the improvements and enhancements that you'd expect after 10 years. If you build it, they will come. At least, that's the idea in Locomotion, where you must build an epic transportation empire. The basic idea behind the gameplay in Locomotion is that you have to connect things. You start a scenario with a huge map dotted with villages, towns, cities, and industries, all isolated from each other. That means you must build roads, rail lines, ports, and airports to link population centers and industries together. After you create the infrastructure, you then create a fleet of vehicles consisting of buses, trains, ships, trucks, and airplanes to move people and goods. Building a vast and varied transportation empire can be a very enjoyable experience, and you'll see the fruits of your labor as cities grow in size. For example, if you create rail lines that supply coal and iron to a steel factory, and then ship the factory's output to a city, the steel is used to fuel the growth of the city. As a city grows, it supplies more passengers for your transportation system, and demands greater amounts of food and goods, which you can also ship to the city. You'll recognize the Chris Sawyer touch in Locomotion right away, from the opening montage to the signature 2D tile-based graphics engine that powered Transport Tycoon and RollerCoaster Tycoon and the user interface that's straight out of the latter. Unfortunately, Locomotion also shares some of the interface issues found in RollerCoaster Tycoon--trying to build a road or a railroad can be a frustrating experience that will usually necessitate frequent reloads. That's mainly due to the fact that you can't completely undo the mistakes you'll often make when trying to figure out the best way to bridge a river or build an elevated railway over a town. If you spend tens of thousands of dollars to build a bridge and then realize it's in the wrong place, you can recoup only a fraction of your costs when you demolish it. You'll go though a lot of this kind of trial and error in an effort to build the least expensive project possible, because trying to minimize costs is an important goal in the game. This makes it even more galling to see your computer opponents seemingly unaffected by costs, as they build audacious pieces of engineering around you that would easily put you millions of dollars in debt. Another issue with the game is the reliability of your equipment. As in Transport Tycoon, each of the vehicles that you purchase has a reliability statistic. Basically, reliability indicates the wear and tear on a vehicle. New vehicles tend to have a high level of reliability, while older ones tend to have a low one, and therefore break down a lot more. Obviously, you must replace a vehicle as it reaches the end of its service life. This means having to purchase a new vehicle, transfer the route of the old vehicle to the new one, and then sell the old vehicle. It's a cumbersome process that gets worse when you realize that you'll likely be replacing vehicles almost constantly as your transportation network grows. There's no way to maintain a vehicle to prolong its service life, and you'll find yourself replacing whole fleets of vehicles after only a handful of game years. Locomotion also has some of the same pathfinding issues that plagued Transportation Tycoon--it's possible to watch a vehicle go in circles because it can't find a path to its destination or there's a slight break in the roadway that you didn't notice. It also shares one of the annoying aspects of Transport Tycoon in that your trains and airplanes can use only your own facilities. So instead of municipalities building airports that all competitors can use or numerous companies using the same rail lines, each company has to build its own, exclusive airports and rail lines. Since real estate is at a premium in the game, it's almost silly to see the transportation infrastructure overshadow the actual cities at times. Locomotion uses the same graphics engine as Transport Tycoon, but it's a little more colorful 10 years later. As noted earlier, Locomotion uses an enhanced version of the graphics engine that was used in Transport Tycoon a decade earlier. It's a bit more colorful, and there are a few more building styles, but you have to look hard at times to tell the difference between the two. Admittedly, the focus in Chris Sawyer games is less on graphical style and more on gameplay, but Locomotion feels very much like an anachronism. The only good news is that the game is playable on a very wide range of systems, and even older systems shouldn't have much trouble with it. The sound and music are also throwbacks to an earlier age--while enthusiastic, there's no masking their synthesizer-like nature. Like Transport Tycoon, Locomotion is a flawed but engaging strategy game. But Locomotion certainly doesn't break any new ground, and its problems aren't as forgivable as those of its 10-year-old predecessor. Those who loved Transport Tycoon may find some of their old feelings rekindled when playing Locomotion. However, if you're someone who was expecting something new, you'll most likely find Locomotion to be nothing more than a fun, lightweight distraction."}