{"ref": "https://www.gamespot.com/reviews/samurai-warriors-katana-review/1900-6185600/", "date": "March 20, 2008", "game_name": "Samurai Warriors: Katana", "text": "The Dynasty/Samurai Warriors franchise is about as polarizing as you get. Either you love the series' completely mindless hacking and slashing, or you hate it, not least of all because every entry is essentially the exact same game. This time, Koei decided to mix things up a bit by applying its tried-and-true formula of button-mashing, beat-'em-up action to the first-person on-rails shooter genre. Unfortunately, Samurai Warriors: Katana is as boring as it is uninspired, and includes some of the worst motion controls available on the Wii. Even diehard fans of the series will find it difficult to enjoy; this is a Samurai Warriors game in name only. Like the other games in the series, Katana takes place in the Sengoku era of Japan's tumultuous history. Against the backdrop of several powerful factions warring to unite the entire nation, you will battle with or against the forces of legendary figures such as Nobunaga Oda, Yukimura Sanada, and Ieyasu Tokugawa. In a bizarre twist that is one of the most disappointing parts of the game, you don't actually get to play as one of these historical giants, but rather must assume the guise of a nameless warrior in their armies. In the rare opportunities that you get to see yourself, you're depicted as one of the random soldiers that you spend the entire game beating up by the hundreds. As disappointing as this sounds, that is not Shredder. Each of the less-than-historically canonical stories have overall themes that range from becoming a master ninja to collecting the most attractive women in Japan and then deciding which is the most beautiful (by beating up the ones who are not, of course). The individual missions you participate in include tasks such as breaking into a heavily fortified enemy stronghold by climbing a poorly placed staircase along the outside, or stopping enemy cavalry with your scoped, semiautomatic musket. As you can probably tell, Katana doesn't exactly take itself seriously. In many ways, the bizarre sense of humor that it exhibits--such as the always entertaining way in which bosses rag-doll backward in slow motion upon defeat--works in its favor, but it ultimately proves to be nothing more than a brief aside that tries to take your mind off of the insipid combat system and terrible controls. As a first-person on-rails action game, combat in Katana is as cut and dry as can be. A targeting reticle appears onscreen wherever your Wii Remote is pointed, and whichever weapon you currently have equipped is poorly mapped to its position. Each of the four types of melee weapons you can use work fundamentally the same, in that you target the enemies you want to kill and mash the A button. However, the weapons do differ in the type and degree of gratuitous controller waggling required to use their charged and Musou attacks; by the time you complete the game, you will have thrust your controller at the screen more times than you would care to admit in polite conversation. Ranged weapons are more varied, in that each operates completely differently, but they suffer from the same motion-control issues as the melee weapons. At best, you'll simply point and hit the B trigger, and at worst, you'll fight to swing your controller horizontally at just the right speed while trying to prevent it from interpreting your motion as a vertical toss. The most egregious use of motion controls is not in the way that you must engage in combat, but rather in the ridiculous minigames you're forced to participate in during missions. When riding a horse, you'll have to turn your Wii Remote on its side and tilt it left or right to steer while flailing the Nunchuk to gain speed. When dodging spear soldiers and spiked balls on an excruciatingly slow march uphill, you'll have to turn both controllers from side to side. Furthermore, in what is quickly shaping up to be a video-game-related crime against humanity, whenever you need to get anywhere fast you'll run by alternately swinging your controllers forward. Throughout the game, your normal combat strategy amounts to knowing or guessing when to block. Boss battles are slightly more involving, but in the end amount to nothing more than a matter of memorizing attack patterns through painful trial and error. As if they recognized that these encounters were completely one-dimensional, developers Omega Force mixed things up a bit in select battles by introducing new abilities, such as the power to slow down time to reveal weak spots that wouldn't otherwise be seen. Unfortunately, normal boss fights seem watered-down and frankly incomplete after experiencing some of these skills, and it's unclear why they weren't implemented for the rest of the game, given that it would have gone a long way toward improving the otherwise-stale gameplay. At the end of each mission, your performance is rated and you're awarded gold, which you can use to purchase role-playing-game-style ability upgrades and helpful disposable items, or to add special powers to your weapons. To earn even more money, you can redo story missions or participate in optional trials that assign you a rapid series of tasks. If you want a break from solo play, Katana offers local multiplayer support. Oddly enough, the multiplayer doesn't include co-op, and instead forces you to compete in a number of different split-screen modes. For the entire length of Katana, you will battle wave after wave of entirely dispensable soldiers, samurai, and ninja with artificial intelligence so brain-dead that you'll begin to question exactly how it was that their real-life counterparts ever managed to accomplish anything. Despite the number of enemies onscreen at any given time, they will for the most part politely take turns trading blows with their friends, and in the few chances they get to surround you on the missions that are not on rails, they won't so much as raise a hand against you if you're not looking directly at them. If you enjoy waggling your controller around randomly, this game is for you. Katana certainly isn't the prettiest game on the block. Enemies are as generic-looking as ever, and after killing a hundred or so identical swordsmen, you begin to wonder where the cloning facilities are. Every castle, dungeon, and village looks similarly mass-produced, and exploring any of these drab locations induces an overt sense of dj vu. The sound effects aren't much of an improvement. The repetitive sounds of every enemy scream, sword slash, and so on seem to blur into each other endlessly, and the brief amount of voice acting is half-hearted at best. On the other hand, Katana's music is a completely bizarre blend of traditional Japanese instruments and ambient electronica that entirely embraces the kitschy nature of the game--something that you wish that the rest of it did--and somehow seems wholly appropriate. While Samurai Warriors: Katana is a departure from the assembly line of the Dynasty Warriors franchise, it provides such a vastly different and ultimately inferior experience that it ironically manages to alienate the fan base that made it so popular. Although it does offer a somewhat lengthy single-player campaign, with side missions and multiplayer, the poor motion controls and the complete lack of compelling gameplay make this a game best avoided."}