{"ref": "https://www.gamespot.com/reviews/dragon-ball-z-shin-budokai-another-road-review/1900-6168234/", "date": "March 28, 2007", "game_name": "Dragon Ball Z: Shin Budokai - Another Road", "text": "Last year's Dragon Ball Z: Shin Budokai for the PlayStation Portable was a decent fighting game that succeeded on its ability to deliver manic action with a good amount of over-the-top, Dragon Ball Z flair. A year later, Atari returns with Dragon Ball Z: Shin Budokai - Another Road. It was a wise decision not to call it Shin Budokai 2, as Another Road brazenly recycles nearly everything of consequence from the first Shin Budokai. What's there is still good, but the package feels kind of pointless. Another Road offers much the same experience as the original Shin Budokai--perhaps too much. The action is identical, offering straightforward, one-on-one fighting. The cast offers little in the way of surprises, featuring most of the major heroes and villains from the Frieza Saga on through to Dragon Ball GT, many of whom come in multiple forms. There are a good number of fighters to choose from, but there's not much of an attempt to balance them, with some fighters simply being rated as more powerful than others. There are plenty of signature DBZ touches to the gameplay, with a heavy focus on ridiculously potent energy attacks, most of which are unique to each fighter. Aside from their different power levels and special attacks, though, every fighter in Another Road handles identically, so once you've mastered one fighter, there's not a lot left to learn. The gameplay modes are also stock for the genre, with a local, wireless two-player versus mode, an arcade mode, as well as survival, time trial, and challenge modes. As was the original Shin Budokai, Another Road is a pretty good-looking game. The environments are pretty bland and there are lots of blurry textures, but the characters look sharp and are well animated, and most of the time the game is soaked with crazy, explosive effects. Sometimes all of the glowing characters and massive energy attacks get to be too much, though, and there's occasionally some pronounced slowdown. Most of the voice work and sound effects have been pulled directly from the show, giving it a sense of authenticity, though during battle the fighters have a tendency to repeat the same few exclamations in rapid succession. So what sets Another Road apart from the original Shin Budokai? Mostly it's the new single-player story mode, aptly named ~Another Road.~ Rather than plodding through the same tired sagas that have been done to death in just about every prior Dragon Ball Z game, Another Road conjures up a sort of ~What If?~ story about Babidi appearing in the alternate future where Future Trunks lives...in the future. It quickly snowballs into a much greater conflict that involves loads of time travel and trips to the afterlife, as well as just about every Dragon Ball Z character you'd care to mention. While storytelling has never been a real strength of Dragon Ball Z, the arc in Another Road is so singularly focused on cramming in as much fan service as possible that the nonsensical story borders on insulting. To its credit, the story mode does add one somewhat interesting layer to the gameplay. Each chapter consists of several missions, each based on a different continent populated with a handful of villages. Often, you can take on these missions in any order you please, but once you do, you'll find yourself with an overworld view of the continent, able to fly around above it in real time. The villains you have to defeat will also be cruising around this overworld, and more often than not they'll immediately start attacking the villages. You can stop them by rushing up to them and attacking, which will initiate a regular, one-on-one fight. Keeping the villages in good health is key, since your character's health bar carries over from fight to fight, and aside from using the extremely limited Senszu beans to replenish your health after losing a fight, the only way to replenish your health is by hovering over a village. Most of the time, you'll be accompanied by two other hero characters of your choosing. Though you can't control them directly, which characters you choose will inform their behavior, such as whether they'll prioritize defending you or villages from attacks. Between keeping an eye on your health, your companions, the villages, and your enemies, there's a lot to juggle in the overworld. While it's frustrating when you need to be in two places at once, it's satisfying when you're able to keep yourself, your companions, and the villages all in good health. It's too bad, then, that the mode is undermined by fights that pit you against the same opponents over and over again, and an incessant amount of pace-killing load times. The new power-up system is interesting, but it's just not enough. Which characters you choose to back you up can make a big difference in how a mission plays out, though the new power-up system plays a pretty big role as well. In nearly every other Budokai game, powering up your hero was done through capsules that you'd earn either by winning fights, or by purchasing them from a shop with money earned by winning fights. Here, the capsules have been replaced with cards that can be placed on a three-by-three grid for each character. What makes this system functionally different from the capsules is that in addition to cards that boost specific attributes like health, ki, melee attacks, energy attacks, and so on, there are other cards, which, depending on where they're placed on the card grid, will boost the effectiveness of other, adjacent cards. It's not overly involved, but being thoughtful about fighters' card grids can make an appreciable difference in how they perform in a fight. If you're a DBZ fan who missed the original Shin Budokai, Another Road is a simple, enjoyable fighting game featuring a number of fan-favorite characters, all wrapped up in a tidy portable package. But if you've already played any amount of the original Shin Budokai, the new story mode and card-based power-up system, though interesting, are just not enough."}