{"ref": "https://www.gamespot.com/reviews/dino-crisis-3-review/1900-6075422/", "date": "September 18, 2003", "game_name": "Dino Crisis 3", "text": "Capcom isn't a company to put a good franchise out to pasture. Case in point: Dino Crisis. The series deservedly known by many as ~Resident Evil with dinosaurs~ has been moderately successful in the past, so now we're getting a third installment, this time on the Xbox. The newest iteration brings a few changes in the story and gameplay categories that help to differentiate the game from the survival horror genre. Unfortunately, what could have been a pretty cool game is mired by a slew of poor design decisions, and, ultimately, playing Dino Crisis 3 is far more tedious and frustrating than it is fun. If you like shiny things, you'll definitely like the look of Dino Crisis 3. The biggest surprise about Dino Crisis 3 is its setting--the game takes place on a derelict starship in the year 2548. Strange place to find rampaging dinosaurs, eh? But find them you will. You play as members of SOAR (Special Operations and Reconnaissance), who are sent to investigate the sudden and mysterious reappearance of the Ozymandias, a large colonial starship that vanished 300 years before. Once you board the ship, you'll run into all manner of nasty reptilian creatures that are, of course, out to get you. These monsters don't exactly look like dinosaurs--they can often do strange things like generate electricity--but their dinosaurian parentage will become more evident as you uncover the plot. The storyline is a bit hokey (dinosaurs in space!), a fact that isn't helped by the typically B-grade writing and voice acting, but at the least it's nice that Capcom did something a little more ambitious here than remaking Jurassic Park. Dino Crisis 3 is effectively a shooter and a platformer, but many of its gameplay mechanics betray its survival horror heritage. The SOAR team members are equipped with jetpacks that allow them to jump to great heights (which facilitates all the platforming) and also to glide and dash around nimbly (which assists you in combat against the dinos). You'll also accumulate a score of sorts by racking up credits when you kill monsters, and you can augment your credits by finding collectibles hidden around the ship. These credits can be cashed in at save points to purchase more items, augment your stats, and that sort of thing. The jetpack is what makes Dino Crisis 3 feel like an action game, since otherwise it's very much like your basic survival horror game--you'll be searching for keycards, gaining new weapons from time to time, and reading leftover ship's logs and memos that slowly unravel the storyline. Dino Crisis 3's biggest problems begin and end with its awful camera system. The game relies on a 3D version of the camera that we've seen in every survival horror game since Resident Evil. That is to say, the camera perspective is tethered to the background at all times, so your view on the action is dependent on where in the room you're standing. The camera has no regard whatsoever for things that might be happening offscreen, such as a monster that's about to charge you when you've got only a shred of health and are one hit away from dying (yes, this will happen). Frankly, Dino Crisis 3 is damned by its camera; if you could just freely control the angle, the game would be a whole lot better. Dino Crisis 3's biggest problems begin and end with its awful camera system. On the other hand, if you like shiny things, you'll definitely like the look of Dino Crisis 3. The visual designers have gone absolutely nuts with the interior of the Ozymandias--everything (and we mean everything) in the backgrounds has a highly reflective metallic look. This can be nice to look at for the first hour or so, but in fact it has a detrimental effect on the gameplay. Since everything looks so similar, you'll sometimes get lost simply because it's hard to tell the rooms apart, and it can be hard to pick details, such as items or doors, out of the background. Thankfully there's a complete 3D map to somewhat alleviate this problem, but a little more variety in the visuals would have been nice (though admittedly it's hard to vary the innards of a starship too much). The sound design is perfectly passable, excepting the aforementioned voice acting, so you'll be able to give your home theater a decent workout if you have one. Finally, the music is generally sparse and understated, but it does a good job of establishing some mood and tension as you wander the deserted corridors of the Ozymandias. Dino Crisis 3 is a disappointing game because it does have a few cool things going for it. If only Capcom had implemented a better camera control system, the game would have been far more enjoyable to play than it is. So here it is: If you can stomach a frustratingly bad camera and have a yen to shoot a bunch of space dinosaurs, Dino Crisis 3 may be worth a rental. Though as you may have guessed, that description probably doesn't fit very many players."}