{"ref": "https://www.gamespot.com/reviews/nhl-hitz-2002-review/1900-2815516/", "date": "May 17, 2006", "game_name": "NHL Hitz 20-02", "text": "Midway may have placed its arcade business on ice, but that hasn't stopped the company from bringing its arcade-influenced sports games to all the consoles. Wayne Gretzky's 3D hockey debuted on the Nintendo 64 back in 1996 and then disappeared for a few years, only to be resurrected this year as NHL Hitz 2002. With the other arcade sports games in its stable, such as NFL Blitz and NBA Jam, Midway has built its reputation over the years, creating the most action-packed sports games on the market, but a lack of refinements over time have stymied the sales of what once were some of the hottest franchises in the industry. NHL Hitz is another example of the same formula being duplicated with minimal improvements, resulting in a game that can be exciting at first, but it loses its charm rather quickly.Midway's former sports games were sparse where gameplay modes were concerned, but that's one facet of NHL Hitz that has vastly improved since previous installments in the series. There's an exhibition mode for head-to-head play, a season mode that requires you to defeat all the NHL teams, a franchise mode that asks you to take a created team to the Midway Cup finals, and a skills mode that helps you tune your abilities. Points are awarded after each victory--for answering trivia questions following each game and for accomplishing specific directives in the skills mode. The points can then be spent in the hockey shop to unlock player heads, alternate jerseys, and fantasy rinks. The create-a-player mode is surprisingly in-depth--you may customize a player right down to his nose size and head width. If you choose to create a team for the franchise mode, you may choose from 11 different jerseys, pick a rink, and start chipping away at the ladder of NHL teams to beat. Both created players and teams are available for play in the exhibition mode, and it's nice to be able to improve created player stats while handing out a whooping on your friends. While the gameplay modes included in NHL Hitz are nowhere near as deep as those found in EA's NHL games, there's enough variety to keep fans of arcade sports games busy for quite a while.The one aspect of NHL Hitz that seems to have undergone the least number of revisions is the gameplay. Each team is composed of three skaters and a goalie. You may pick the three players to use before the start of each period, and while you're playing in franchise or season mode, players will sometimes be unavailable if they've taken too many hits in past games. The action is fast and furious, but it still seems a bit slow when compared with Midway's Wayne Gretzky games. You can crank up a speed meter, but the action still never reaches the fever pitch that fans of the series have become accustomed to. Anyone who's ever played NFL Blitz or NBA Jam should be familiar with rubber band AI. This allows the computer to adjust to your abilities on the fly and guarantees that each game will come down to the final seconds. The result is that it never seems to matter how good you play. If you're up by a few goals, your goalie will suddenly become brain-dead and allow slapshots from center ice to find their way into the net. Yet, the computer's goalie will become a veritable brick wall, not allowing a single goal no matter how good the shot. This same AI carries over into the multiplayer modes as well and will anger experienced players when their skills are rendered moot. Like in Midway's other sports games, a player will be on fire after scoring three times in a row. Team fire is awarded after you score on three unanswered one-timers and can effectively place victory out of reach of your opponent. The fighting engine used in NHL Hitz is the most impressive yet found in a hockey video game. You can fire two different types of punches, duck, dodge, block, and finish off the other player with a knee to the stomach or a chokehold. Compared with the button-mashing fighting engines found in most hockey video games, it's a vast improvement. Despite a few tweaks, the gameplay found in NHL Hitz is almost identical to that in Midway's Wayne Gretzky games. It's exciting for a while, but as you become a skilled player, you'll be less willing to tolerate the cheap computer AI.Speed is paramount in any arcade sports game, so player models in said games have traditionally been pared down to keep the frame rates speedy. This ideal holds true in NHL Hitz as well. The player models aren't of low-poly Nintendo 64 quality, but they fall well short of the stark realism demonstrated in EA Sports' NHL series. Even with these simplified character models, the frame rates will occasionally stutter when the action is intense around the goal. This is partly the fault of the completely polygonal crowd. While there are only a few rows of fans in the arena, their polygonal composition allows them to interact with the game in a realistic manner. If the game's a total blowout, they will stand up and walk out, and some fans will hold up signs displaying codes for the game. Unfortunately, the crowd is rarely shown, so many will miss its intricacies. Other small details, such as helmets dislodging from players' heads and the glass being shattered during especially violent checks along the boards, help keep the action intense. Real-time shadows chase each player around the ice, and electricity will come down from the rafters and strike a player who is on fire. Black Box has made the right sacrifices in keeping NHL Hitz both pretty and predominantly fast, but it's a shame that the impressive crowd isn't more a part of the game. The same announcer behind the play-by-play in other sports games by Midway has returned for NHL Hitz 2002. His statements don't repeat nearly as often as they used to, but after a few days, you'll be glad there's an option to turn him off. Both cheers and boos can be triggered with the bottom shoulder buttons, and they come in handy, depending upon the in-game situation. Several licensed artists have made it onto the soundtrack, including Limp Bizkit, Fuel, and Staind, but their respective songs are played only in between games. The sound effects for checks and shots are a bit exaggerated when compared with those found in NHL 2002, but that's exactly what you'd expect from a game of NHL Hitz's nature. NHL Hitz can be fun for the first few days of play, but its computer AI, which basically chooses which team wins, ultimately zaps the game of long-term replay value. But if you're looking for some quick-hit fun from your hockey games, NHL Hitz isn't only the best option on the PS2, but also the only option. Hockey fans might want to pick up NHL Hitz 2002 if they're looking for something different, but for everyone else, a weekend rental should suffice.Speed is paramount in any arcade sports game, so player models in said games have traditionally been pared down to keep the frame rates speedy. This ideal holds true in NHL Hitz as well. The player models aren't of low-poly Nintendo 64 quality, but they fall well short of the stark realism demonstrated in EA Sports' NHL series. Even with these simplified character models, the frame rates will occasionally stutter when the action is intense around the goal. This is partly the fault of the completely polygonal crowd. While there are only a few rows of fans in the arena, their polygonal composition allows them to interact with the game in a realistic manner. If the game's a total blowout, they will stand up and walk out, and some fans will hold up signs displaying codes for the game. Unfortunately, the crowd is rarely shown, so many will miss its intricacies. Other small details, such as helmets dislodging from players' heads and the glass being shattered during especially violent checks along the boards, help keep the action intense. Real-time shadows chase each player around the ice, and electricity will come down from the rafters and strike a player who is on fire. Black Box has made the right sacrifices in keeping NHL Hitz both pretty and predominantly fast, but it's a shame that the impressive crowd isn't more a part of the game. The same announcer behind the play-by-play in other sports games by Midway has returned for NHL Hitz 2002. His statements don't repeat nearly as often as they used to, but after a few days, you'll be glad there's an option to turn him off. Both cheers and boos can be triggered with the bottom shoulder buttons, and they come in handy, depending upon the in-game situation. Several licensed artists have made it onto the soundtrack, including Limp Bizkit, Fuel, and Staind, but their respective songs are played only in between games. The sound effects for checks and shots are a bit exaggerated when compared with those found in NHL 2002, but that's exactly what you'd expect from a game of NHL Hitz's nature.NHL Hitz can be fun for the first few days of play, but its computer AI, which basically chooses which team wins, ultimately zaps the game of long-term replay value. But if you're looking for some quick-hit fun from your hockey games, NHL Hitz isn't only the best option on the PS2, but also the only option. Hockey fans might want to pick up NHL Hitz 2002 if they're looking for something different, but for everyone else, a weekend rental should suffice."}