{"ref": "https://www.gamespot.com/reviews/nanostray-review/1900-6129665/", "date": "July 22, 2005", "game_name": "Nanostray", "text": "Dating back to arcade classics like Gradius and Galaga, the best shoot-'em-ups have always tested your skills and reflexes as they challenged you against all odds in one enemy-filled level after another. Gameplay like that ought to never go out of style, so it's good to see a game like Nanostray come out for the Nintendo DS. A true-blue you-against-the-world space shooter, Nanostray pays homage to the genre's greats, and comes from the makers of the similarly styled Iridion titles for the Game Boy Advance. Unfortunately, underneath Nanostray's excellent presentation is a game that's not nearly as good as its sources of inspiration. A weak multiplayer mode, repetitive level design (even for a shoot-'em-up), and limited replay value put Nanostray squarely in the ~almost, but not quite~ category. In Nanostray, what you do is you shoot everything that moves. It's cool for as long as it takes to clear the game's small number of short levels. No one's expecting much of a storyline from a shoot-'em-up, but something, anything probably would have helped here. But there's no plot whatsoever in Nanostray, not in the game and not even in a sentence or two in the manual (the Web site at least mentions something about the ship's pilot losing his or her memory). The main single-player ~adventure~ mode simply throws you from one vertical-scrolling stage to the next, in no particular order, until the credits roll and your spaceship can be seen pointlessly flying around, apparently having killed everything in the galaxy for whatever reason. Gameplay takes place exclusively on the top screen, and for what it's worth, the game looks great and mostly runs smoothly, though there are occasional, distracting instances of slowdown. The eight different stages of the game are based on different planets, and predictably include water-logged, industrial, and fiery landscapes from one to the next. Each stage is only a few minutes long but basically works the same way, regardless of the level. You shoot through swarms of bullet-spitting enemies while also drilling into much bigger, chunkier foes. Some environmental hazards occasionally must be dodged as well. The few twists to the gameplay aren't particularly imaginative or well implemented. Since this is a Nintendo DS game, the developers went out of their way to incorporate the touch screen into the gameplay, but the results feel completely forced. Your ship has four different weapons, which you can switch at any time using the touch screen. Forget that there are face buttons on the DS that are left unused by this game--it forces you to fumble on the bottom screen if you want to switch from your different ammo types. There's also a radar on the bottom screen, which, much like the switching of weapons, seems to have been put there in order to get you killed more often. This is a very fast-paced game that requires your undivided attention to be focused on the top screen (where the action is), so the way in which the bottom screen was implemented feels like a waste. The gameplay certainly isn't bad. The four weapons are reasonably different, especially the one that lets you shoot out the sides of your ship, but not forward. You can safely rely on the default beam weapon to do all your damage, though. Your ship also gets screen-killing bombs and an energy-based power attack, which can be recharged after certain enemies are killed. The bombs trivialize the game's boss fights at the end of every level, in which you have to dodge some big, honking mechanical thing's lasers while blasting its one or two weak points. On normal difficulty, you get bomb refills each time you lose a life, allowing you to obliterate each end-level boss without any effort. Nanostray's three difficulty settings create less replay value than you'd expect, since they don't actually change the makeup of the levels. Instead, they determine how many lives you get, how many bullets you can withstand before blowing up (collisions are always fatal), how many continues you have with which to finish the adventure mode, and so on. After unlocking all the levels in the adventure mode, you're free to play them in any order in the arcade mode, and there's also a challenge mode for you to mess around with. The challenges are much, much tougher (for the most part) than what you get out of the adventure mode when you first whip through it on normal. The challenges task you with clearing stages using one life, killing all the enemies, and other tasks that require you to spend lots and lots of time memorizing each layout. Also, for those who get really, really into this sort of thing, there's a Web-based worldwide scoreboard where you can compare your best scores from each level against other Nanostray players. Nanostray looks and sounds great, but it's not as intense or interesting as the shoot-'em-up genre at its best. A seemingly rushed multiplayer mode tops off a game that's flashy but shallow. For starters, there's actually no way to play the competitive two-player mode if both players have a Nanostray cartridge. One player must upload one of four different multiplayer levels to the other player's Nintendo DS, at which point the two of you compete in a score challenge. Different time spans and a one-life ~sudden death~ mode are available to give this mode some variety, but since you're flying alongside each other while both trying to shoot down as much stuff as possible, the fun really doesn't last long. A few power-ups unique to this mode are suggestive of a few good ideas, but they don't do much to keep multiplayer Nanostray from feeling like a novelty instead of a fully realized multiplayer mode. Even just a straightforward two-player co-op probably would have been better. Nanostray's pretty graphics and catchy music will quickly win over fans of space shoot-'em-ups. But despite their ability to masterfully capture the look of this style of game, the developers of Nanostray didn't quite succeed at capturing the spirit. Unless you get madly addicted to Nanostray's high-score challenge, it seems unlikely that the game would hold your interest for more than a little while."}