{"ref": "https://www.gamespot.com/reviews/guild-wars-factions-review/1900-6149248/", "date": "January 17, 2007", "game_name": "Guild Wars", "text": "Last year's game that combined most of the best aspects of online role-playing (without any monthly fees attached), action role-playing games, and competitive gaming in general is back in a similarly huge and interestingly complex follow-up. While Guild Wars Factions is inherently similar to its predecessor, and saddled with some of the same relatively minor shortcomings, it still delivers a deep, addictive, and satisfying experience on many levels. The game is ultimately best suited for social, competitive players (like fans of the original), but it effectively weaves together solo, cooperative, and competitive content in a way that's undeniably impressive. Cantha's miles of dilapidated buildings stand in stark contrast to its majestic temples and archways. And man, the women are totally hot. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Guild Wars Factions Video Review The underlying action in Guild Wars Factions builds on the great formula of the original. You still control a single character who grows to have access to dozens of unique skills (there are hundreds in all), though you can have only eight of them readied at a time--a fairly large number that still forces you to choose very carefully, like the process of building a good deck in a collectible card game. No one character type is unstoppable, as the game is filled with numerous skills designed to disrupt opponents, encouraging you to be an organized team player and also to experiment a lot. If you start off as a role-playing character, you get to proceed through a large story-driven campaign spanning dozens of hours and featuring a practically countless number of missions and side quests. During the course of this campaign, you'll be introduced to many of the gameplay nuances and thrust into some of the cooperative and competitive scenarios on offer. However, it's also possible to go through a good amount of the story stuff with computer-controlled henchmen, though they're pretty stupid and will only end up letting you down in the game's main missions--not that there's a heavy penalty for getting killed. You can't permanently die, though your maximum health and energy decreases each time you die in a combat scenario. If your whole team is wiped out, it's time to magically teleport back to town and consider a different course or strategy. Guild Wars Factions is a stand-alone game, and it doesn't require you to own the original, though the two games are very much interconnected regardless of whether you own one or both. Whereas the first Guild Wars took place on and around the massive continent of Tyria, Factions introduces the Asian-inspired continent of Cantha. Reminiscent of the setting of last year's Jade Empire, Cantha mashes together various Chinese, Japanese, and other Asian influences into a beautiful but often bleak setting that's a good counterpart to the predominantly Western-medieval Tyria. One of the best parts is that all six of the original character classes from Guild Wars are back in Factions, but the Canthan versions of these characters have distinctively Asian features and clothing. It makes for a greater variety of player characters running around. Factions also introduces two new character classes, the assassin and the ritualist. Assassins are highly maneuverable and hit quickly and hard, while ritualists have various weird shamanistic spells and may summon numerous different spirits to aid themselves and their allies. Guild Wars veterans will naturally want to try these classes out, but by virtue of the game's meticulous intentions to balance all possible character archetypes, you won't automatically prefer them to your existing characters or the other available classes. You also can't start off in the original Prophecies campaign as one of these new characters if you own the original Guild Wars, though you can work your way up to where they can get to the lands of Tyria by ship--and vice versa if you have existing characters on Tyria. Like in the first game, you can create a role-playing character and play through a lengthy storyline with other people or create a PVP-only character and kill them. Basically, Tyria and Cantha are divided by a sea that's as easy to cross as the click of a mouse button, if your character has reached the port and you own the other game. Just like in the original, one of the refreshing things about Guild Wars Factions is that you can basically teleport to any major location you've previously visited in mere seconds. The enormity of the gameworld makes this seem like a necessity, and yet it's possible to cross Cantha on foot, moving from one big region to the next with only brief loading times in between (provided you don't have to download any new content--like in the original, you must be connected to the Internet at all times while playing). In between the two continents lie the Battle Isles, where most of the player-versus-player combat takes place. As in the first Guild Wars, Factions lets you create a high-level PVP-only character at any time, who'll be limited to engaging in competitive matches and won't get to experience the storyline or see much of the world of the game. Still, the PVP combat is where some of the most exciting action is. The role-playing portion of Guild Wars Factions doesn't have the same epic feel as its predecessor, especially in how it seems to quickly rush you all the way up to the game's maximum character level of 20. The campaign's thinly veiled tutorials and training scenarios are clearly intended to help prepare you for battle against other players, and the story itself--involving a plague causing Cantha's populace to turn into aberrations that look a lot like the Flood from Halo--isn't particularly well told. Apart from some story cutscenes delivered using not-particularly-convincing voice performances, quests are given in little text windows that don't do a great job of drawing you into the plot. And since you're not really earning much in the way of new stuff once you reach the maximum level, the campaign might not hold your interest. However, it's worth pressing through in search of those elite skills and crafted weapons and armor pieces that can give your character an advantage, and some of the campaign missions are a lot of fun. Yet there's a lot more to the game than its campaign. Like its predecessor, Guild Wars Factions offers competitive team-based combat in a variety of modes and environments, but there's an even greater variety of options than before. Some of the most interesting examples take place in the story and pit players on opposite sides working either with or against each other depending on the context. It comes as a thrilling surprise the first time it occurs to you that the mission you're in has a whole other player team in it besides yours, and though these missions can be frustrating, they're executed well and are certainly novel. Those who just want to dive right into some PVP combat can enter the random arenas, which automatically assign you to a small team and let you battle a rival team until one team is wiped out. Larger organized team battles can have various objectives, some of which are slightly more complex than simply killing the other players. Battles for control over territory are new to Guild Wars Factions and effectively pit alliances of multiple guilds in a pitched conflict. The ~Factions~ from the title also comes into play in the new alliance battles, waged between multiple player guilds and pitting the Kurzick and the Luxon sects against each other. As one side or the other wins successive battles, the borders between these warring factions shift back and forth, granting one side or the other control over additional outposts and resources. The losing side can never be completely eliminated, though, and as the borders push deeper into the losing side's territory, it gains natural advantages in the maps where the fighting takes place. This tug-of-war setup has what it takes to keep guilds busy for a while, even though there aren't a ton of alliance-battle maps. Winners of alliance battles earn faction points, redeemable for special rewards. You also gain this type of currency for killing other players and winning battles in standard PVP matches. In addition to the purely competitive alliance battles, there are new cooperative-focused challenge missions that are also tied to the factions systems, allowing alliance members to contribute to the cause without having to viciously battle other players. These fast-paced missions are often a race against the clock. It's good to have these alternative ways to contribute to your guild. Player guilds of course are a key part of Guild Wars Factions, and in this respect the game clearly caters to the hardcore. Nowhere is this more pronounced than in tournaments that pit the strongest, most dedicated player guilds against each other. It's possible to observe tournament matches, which can be entertaining and quite educational for those looking to improve their skills. As if having access to all these action-packed scenarios weren't enough, as guilds grow stronger and more influential, they may earn their own luxurious guild halls--and now may invite allied guilds to come lounge. It's worth noting that for as much as the game pushes you to get yourself into a guild, it still doesn't do a particularly good job of letting you interact with other players. As a testament to Guild Wars' worldwide success, outposts and towns tend to be teeming with players...but they're also filled with ~noise~ in the form of a constant stream of text chat messages, mostly from players hurriedly trying to form teams. The random PVP arenas automatically throw players together into a team, but the story missions leave you to your own devices, which can be frustrating if you have trouble finding good people to play with. Guild Wars Factions doesn't have as much content that effectively caters to solo players as the original, so unless you've already got a willing group of friends to play with, you'd best not hesitate to start looking for comrades early on. You won't find a shortage of other players in Guild Wars Factions, that's for sure. The deep gameplay and absence of monthly fees should keep them coming back. Last year's Guild Wars stood out partly on account of its gorgeous visuals and slick game engine, which let you boot up and quit out of the game in moments. The ability to get into and out of the action so easily is still a great asset, and the visuals have held up nicely. Excellent character graphics, imposingly huge monsters, and impressively rendered scenery are everywhere to be found, though the action tends to noticeably slow down in larger battles, except on very fast systems. Character animations are decent but unremarkable, though overall, Guild Wars Factions is a great-looking game. Some good musical compositions make the fantasy world feel more vibrant, though not all the music fits the Asian theme as well as the rousing title track for the game. Solid sound effects round out the audio in a game whose presentation quality more than lives up to the ambition of its underlying concepts. Having both the original game and Factions installed adds still more layers of complexity, by letting you experience the content from the respective continents in new ways, with characters who originated on the other side. Like in the first game, just the sheer number of things to see and do in Guild Wars Factions is quite amazing, and there are enough different styles of gameplay available that you'll more than likely find aspects you really enjoy and get hooked on. In some ways this is an imposing, complicated game, but since it doesn't punish you for experimenting (apart from the possibility of a tongue-lashing from fellow players), and since it doesn't saddle you with monthly fees, it's really quite hard to resist. Like its predecessor, Guild Wars Factions offers competitive team-based combat in a variety of modes and environments, but there's an even greater variety of options than before. Some of the most interesting examples take place in the story and pit players on opposite sides working either with or against each other depending on the context. It comes as a thrilling surprise the first time it occurs to you that the mission you're in has a whole other player team in it besides yours, and though these missions can be frustrating, they're executed well and are certainly novel. Those who just want to dive right into some PVP combat can enter the random arenas, which automatically assign you to a small team and let you battle a rival team until one team is wiped out. Larger organized team battles can have various objectives, some of which are slightly more complex than simply killing the other players. Battles for control over territory are new to Guild Wars Factions and effectively pit alliances of multiple guilds in a pitched conflict. The ~Factions~ from the title also comes into play in the new alliance battles, waged between multiple player guilds and pitting the Kurzick and the Luxon sects against each other. As one side or the other wins successive battles, the borders between these warring factions shift back and forth, granting one side or the other control over additional outposts and resources. The losing side can never be completely eliminated, though, and as the borders push deeper into the losing side's territory, it gains natural advantages in the maps where the fighting takes place. This tug-of-war setup has what it takes to keep guilds busy for a while, even though there aren't a ton of alliance-battle maps. Winners of alliance battles earn faction points, redeemable for special rewards. You also gain this type of currency for killing other players and winning battles in standard PVP matches. In addition to the purely competitive alliance battles, there are new cooperative-focused challenge missions that are also tied to the factions systems, allowing alliance members to contribute to the cause without having to viciously battle other players. These fast-paced missions are often a race against the clock. It's good to have these alternative ways to contribute to your guild. Player guilds of course are a key part of Guild Wars Factions, and in this respect the game clearly caters to the hardcore. Nowhere is this more pronounced than in tournaments that pit the strongest, most dedicated player guilds against each other. It's possible to observe tournament matches, which can be entertaining and quite educational for those looking to improve their skills. As if having access to all these action-packed scenarios weren't enough, as guilds grow stronger and more influential, they may earn their own luxurious guild halls--and now may invite allied guilds to come lounge. It's worth noting that for as much as the game pushes you to get yourself into a guild, it still doesn't do a particularly good job of letting you interact with other players. As a testament to Guild Wars' worldwide success, outposts and towns tend to be teeming with players...but they're also filled with ~noise~ in the form of a constant stream of text chat messages, mostly from players hurriedly trying to form teams. The random PVP arenas automatically throw players together into a team, but the story missions leave you to your own devices, which can be frustrating if you have trouble finding good people to play with. Guild Wars Factions doesn't have as much content that effectively caters to solo players as the original, so unless you've already got a willing group of friends to play with, you'd best not hesitate to start looking for comrades early on. You won't find a shortage of other players in Guild Wars Factions, that's for sure. The deep gameplay and absence of monthly fees should keep them coming back. Last year's Guild Wars stood out partly on account of its gorgeous visuals and slick game engine, which let you boot up and quit out of the game in moments. The ability to get into and out of the action so easily is still a great asset, and the visuals have held up nicely. Excellent character graphics, imposingly huge monsters, and impressively rendered scenery are everywhere to be found, though the action tends to noticeably slow down in larger battles, except on very fast systems. Character animations are decent but unremarkable, though overall, Guild Wars Factions is a great-looking game. Some good musical compositions make the fantasy world feel more vibrant, though not all the music fits the Asian theme as well as the rousing title track for the game. Solid sound effects round out the audio in a game whose presentation quality more than lives up to the ambition of its underlying concepts. Having both the original game and Factions installed adds still more layers of complexity, by letting you experience the content from the respective continents in new ways, with characters who originated on the other side. Like in the first game, just the sheer number of things to see and do in Guild Wars Factions is quite amazing, and there are enough different styles of gameplay available that you'll more than likely find aspects you really enjoy and get hooked on. In some ways this is an imposing, complicated game, but since it doesn't punish you for experimenting (apart from the possibility of a tongue-lashing from fellow players), and since it doesn't saddle you with monthly fees, it's really quite hard to resist."}