{"ref": "https://www.gamespot.com/reviews/castlevania-review/1900-6170346/", "date": "May 9, 2007", "game_name": "Castlevania", "text": "In the era of the Nintendo Entertainment System, publisher Konami was known for making maddeningly difficult but remarkably enjoyable games. Fortunately, games like Gradius and Contra at least had cheat codes to make the difficulty slightly more reasonable. Castlevania, on the other hand, had no such crutch. In fact, the game had an unlockable ~hard~ mode instead. But somehow, as frustrating as Castlevania could be, it was still an entertaining game because of its solid action and dark, appealing atmosphere. Castlevania is now available on the Wii Virtual Console for 500 points ($5), and it's every bit as challenging and playable as it was when it was originally released 20 years ago. Some of the most annoying enemies in all of video games first appeared in this game. In Transylvania, the sinister vampire known as Dracula awakens just about every century and threatens to unleash evil upon the world. Each time, various members of the Belmont family must use a trusty magic whip to defeat the old bat and put him back to sleep for another hundred years. In Castlevania you play as Simon Belmont, and you have to enter Dracula's castle and make your way through six levels, killing enemies, bosses, and ultimately Dracula himself. Castlevania is a 2D side-scrolling game in which you move left or right through each stage whipping anything that moves. Each level is populated with devious and often downright cheap enemies that will do everything they can to kill you. Skeletons hop around throwing bones at you; medusa heads fly into you and knock you off platforms; lizard men jump out of the water beneath your feet; tiny Igors will erratically hop around at your feet; and so on. You can pick up special weapons such as daggers to throw, holy water, and a boomerang, which can be extremely helpful and necessary to kill some enemies. Some of the enemy patterns are difficult to avoid, especially when you're trying to fight two or three creatures at a time while simultaneously hopping between precarious platforms. It gets even more ridiculous later in the game because you're able to take only three or four hits before dying, and health-replenishing items are rare. A slight consolation for this is the fact that you have infinite continues, so you can keep trying a level until you either memorize each and every enemy movement, or you just happen to get lucky enough to survive to the end. The bosses, enemies, and backgrounds don't look anywhere near as detailed as more recent Castlevania games, but they still have a distinct, consistent style. Backgrounds are full of nice touches like piles of skulls, crumbling walls, and tattered curtains. The characters all animate well and move quickly, although you will see some sprite flickering and slowdown on occasion. The soundtrack greatly enhances the atmosphere, with energetic, gothic-tinged tunes that set the tone for the rest of the game. If you cut your teeth on any of the more recent Castlevania games, you'll probably be disappointed with this one. It lacks the level of depth and detail of the others, and it follows a very linear path. It's a good game, though, and it still looks and feels very much like any other Castlevania game. Playing Castlevania, you might be struck by just how little the series has evolved over the last 20 years. But whether you're revisiting this classic or are playing it for the first time, you'll have a good time. Just be prepared to diea lot."}