{"ref": "https://www.gamespot.com/reviews/classic-nes-series-castlevania-review/1900-6111774/", "date": "October 28, 2004", "game_name": "Castlevania", "text": "Konami's Castlevania has the reputation of being one of the most gut-wrenchingly hard games of the Nintendo Entertainment System's early days, and it also helped spawn one of Konami's most successful franchises. In fact, a slew of games have borne the Castlevania name in the years since its 8-bit debut, but now the series is going back to its roots, thanks to Nintendo's Classic NES Series on the GBA. Like the other installments in this series, this is a very old and fairly short game that is being sold for the somewhat dubious price of $19.99. However, unlike many of the other games in this series, Castlevania hasn't really been compromised for the sake of making it work on the GBA. So, while it isn't an especially great value, you're still getting a classic game of the NES era without any serious caveats. Eek! Bats! If by some miracle of chance you've never encountered Castlevania, here's a quick crash course. You, Simon Belmont, are a whip-carrying, holy-water-dousing, knife-tossing vampire hunter extraordinaire who is up against Dracula and his many monstrous minions, including mummies, ghosts, bats, flying Gorgon heads, mermen, bats, possessed suits of armor, evil jaguars--and did we mention a hell of a lot of bats? Fundamentally, the game is a side-scrolling action game with some platforming elements. You'll jump over a lot of pits, whip a lot of evil creatures, take part in some fairly epic boss fights, and be brought nearly to tears by the game's difficulty. That's right, even in this modern age of gaming, with all sorts of new fancy-pants games of the same genre currently available for the GBA, Castlevania is still an impressively challenging endeavor. Equal parts frustration and fun, Castlevania has an amazing penchant for throwing just the right combination of tough enemies and difficult jumps at you to cause you to die repeatedly. But, despite all the irritation it can cause, it's still a lot of fun to play. The level designs, even in this day and age, still hold up well, and though the combat is mostly very simplistic, it more than gets the job done. It's rare that you find a game as old as this one that still manages to provide you with an entertaining experience from beginning to end, but Castlevania definitely does. In terms of how well this game stands up as a port, it's actually almost perfect. The game itself suffered no ill effects in its transition from the NES hardware, neither in the gameplay nor in the visuals. In fact, the only real difference is the new save system, which, incidentally, also happens to be our only real complaint about the game. Basically, this version uses a variation on the continue system found in the NES game. Like in the original game, a continue point is established at the beginning of each stage, and if you lose all your lives in that stage, the game will let you continue from that point. However, on the NES, if you powered down the system, you would lose that continue point. Here, by pressing both the trigger buttons at the same time, you'll bring up a menu screen that lets you save. It would have been nice if the game had just automatically saved your progress, but this works well enough. Eek! More bats! When it comes to graphics and sound, well, you can pretty much guess where this is going. Yes, Castlevania is a very old game, and yes, it does look pretty crusty compared with most GBA games. But, if you have the ability to look past the game's technical limitations and the slightly squashed background graphics, all in all, it actually doesn't look so bad. The levels still look pretty good, and even though the character sprites are archaic looking, there's still a degree of charm to be found in them. It's sort of like watching a really old horror movie. Even though the special effects suck, you can appreciate them for what they are. The audio, again, is enjoyable in spite of its technical limitations. The game's music is still as catchy as ever, and all the classic sound effects are here with no discernable issues, save for the fact that they're more than 15 years old. Ultimately, this all leads to a single question: Should you buy this version of Castlevania? Surprisingly, the answer is yes, provided, of course, that you're into side-scrolling adventure games, the Castlevania license, or anything old-school gaming. This is a well-produced port of an excellent game, and even though it probably would have been better served as part of a collection than as a stand-alone product, you could certainly find a number of worse ways to spend $20 for your GBA."}