{"ref": "https://www.gamespot.com/reviews/castlevania-review/1900-6102298/", "date": "July 9, 2004", "game_name": "Castlevania", "text": "Castlevania is one of those game series that has stood the test of time. From its North American debut in 1987 all the way to today, there have been many classic games to bear the name Castlevania. Now, the vampire-hunting series is making its debut on mobile platforms in the form of a remake of the first NES game in the series. However, the game has a series of shortcomings that make this release more of a stripped-down remake than anything else. Whipping + stair climbing = total body workout When Castlevania debuted on the NES, it was noteworthy for its genre-defining gameplay and its high degree of audiovisual polish. The game's sprites were large and clear, and its music was appropriately ominous--a one-two punch that delivered an engrossing, atmospheric play experience. In its mobile iteration, Castlevania's presentation isn't quite as strong. While the mobile version makes good use of Vision handsets' color palette, which is far superior to that of the NES (65,000 vs. 52), the mobile game's backgrounds are less visually interesting than those of their antecessor. Fortunately, the mobile title's frame rate is quite respectable. It's at least on par with similar wireless games. Last year's Dracula makes a convenient comparison, as it was an unapologetic Castlevania clone, albeit one that played from the opposite end of the stake. Although Dracula featured larger sprites and generally better artistry, it didn't run quite as smoothly as Castlevania does on the same handsets. Castlevania's music is, as always, quite good. The game features abbreviated versions of two tracks from the original game. These will be immediately recognizable to Castlevania veterans, although they sound as though they were made with a narrower range of MIDI instruments. The original Castlevania featured six stages, each of which ended in a boss battle. Castlevania for mobile sports the first two of these levels, and along with them, the game's first two bosses. This is not a great deal of gameplay, especially considering that these stages are the easiest in the game. As long as you're handy with your whip and you can gather enough hearts to fuel your alternate weapon, you'll be able to defeat both the bat and Medusa in under 10 seconds. Also of note is that the selection of alternate weapons has been cut down to only the holy water and the axe, so you won't find any boomerangs, daggers, time-stopping clocks, or anything like that here. It is possible--and even likely--that experienced players will burn through the game in a quarter of an hour, at which point a ~to be continued~ message will appear. Presumably the rest of the game will be released in similar, small chunks in the future. Regardless of that, $4.99 for two easy levels of Castlevania isn't a very good deal, especially when you consider that the original NES game can be found used for around the same price. The game's control varies depending on which phone you're using. Castlevania's biggest problem is, not surprisingly, its control. It's difficult to perform simple jumps because of the generally unresponsive control on current handsets. The Sanyo 8100 provided, by far, the best play experience, due to its large, comfortable navigation bar. On this handset, at least, the game seemed to allow chording. Play on other devices, such as the Samsung A600, was another matter entirely. On that particular phone, Castlevania was almost unplayable. Although Castlevania for mobile is a poor value, fans of the series will certainly get something out of it. It's not a pixel-perfect port, but Castlevania is a serviceable version of the original. If you're a fan of side-scrolling action and beating up monsters with a whip, you should give it a look."}