{"ref": "https://www.gamespot.com/reviews/bankshot-billiards-2-review/1900-6140889/", "date": "December 8, 2005", "game_name": "Bankshot Billiards 2", "text": "The most expensive game available to download on Xbox Live Arcade at launch with a price tag of 1,200 Microsoft Points ($15), Bankshot Billiards 2 is a pool game that boasts no fewer than nine different modes of play, as well as Xbox Live support for up to three players. In addition to the regular 8-ball and 9-ball gameplay modes that you'd expect to find in any pool game, Bankshot Billiards 2 lets you take on the CPU or another player at Euro 8-ball, 14.1 continuous, or 3-ball. A three-player game titled cutthroat is also included, along with single-player golf, time trial, and trick shot options. Bankshot Billiards 2 is a decent-looking package as far as the menu screen is concerned, then; but once you get to the table, the game consistently disappoints. Figuring out the rule sets used in Bankshot Billiards can be a real challenge. One of the first things that you'll notice about Bankshot Billiards 2, particularly if you're playing on an HDTV, is that its visuals are simple but convincing. The game is played exclusively from a bird's-eye view, using a camera situated directly above the table, and while the table itself and the cue mysteriously floating in the air above it are nothing special, the lighting and the shadows on the balls make them look really solid. Furthermore, you can customize the look of just about everything in the game to suit your tastes, including the table, the cloth, the floor surrounding the table, the balls, and your cue. What's unfortunate is that the customization options for the gameplay aren't nearly so impressive. One of the most intriguing things about the sport of pool is that there are so many different rule variations, to the extent that they can vary from one bar to the next. Bankshot Billiards 2 doesn't let you adjust the rules of your chosen game at all, though, save for determining how many racks are needed to win a match. It's also worth noting that at no point are you given an opportunity to read up on said rules, so you're left to figure them out for yourself through trial and error. The only other significant gameplay options available are a shot timer, skill level settings for CPU players, and three different levels of aiming assistance. Regardless of your skill level choice, the CPU players are an erratic bunch, prone to moments of genius or baffling stupidity practically every time you play them. The aiming assistance system isn't without its problems either, because playing with no assistance enabled whatsoever makes it very difficult to know where even the white ball is headed, while opting for level 2 or level 3 assistance invariably makes the game a walk in the park if you have even the faintest idea of how to play in real life. Level 1 aiming aids, which show you where you're hitting the white ball but not where any of the object balls are going, should be the happy medium, but the onscreen arrow doesn't do a particularly good job of letting you know where you're actually going to make contact with whichever ball you're aiming for. None of the aiming aids would be much of an issue if the game let you move the camera around, of course, but it doesn't. After lining up a shot in Bankshot Billiards 2, you'll be able to use a simple interface to determine the angle at which you hit the cue ball, the power of your shot, and whether you'll be applying any topspin, draw, or English to the cue ball by striking it somewhere other than dead center. The system is both intuitive and effective, but you certainly won't need to master it to succeed in many of Bankshot Billiards 2's gameplay modes. The only exceptions, in fact, are golf and trick shots, which demand a decent level of cue ball control. With that said, the pockets on the Bankshot Billiards 2 table often seem like black holes sucking in any ball that strays anywhere near them, so having the skill to keep the white ball as far away from them as possible will definitely give you an advantage. The table in Bankshot Billiards 2 is also noticeably faster than most that you'll encounter, with balls sometimes appearing to stop only because they hit another ball or find their way into a pocket--which they often will. The sound effects associated with balls hitting each other or getting sunk are realistic, but the game boasts only five instantly forgettable looping music tracks to listen to while you play, simply titled electronic, rock, funk, pop, and lounge. The shot interface affords you a great deal of control over the cue ball. Unsurprisingly, there aren't a whole lot of Xbox 360 owners playing Bankshot Billiards 2 online right now, so while playing against a human opponent is undoubtedly preferable to taking on a CPU player, actually finding someone to pit your skills against can be a real challenge. When playing online, the game also froze up on us on more than one occasion, frustratingly forcing both us and our opponent to return to the main menu screen. Bankshot Billiards 2, then, isn't nearly as good a package as its menu screen suggests it might be. And with a price tag of 1,200 Microsoft Points, it certainly doesn't represent good value for money, particularly when you consider that PC versions of three of its nine gameplay modes can be downloaded for free from MSN's Games Zone. If you've got Microsoft Points burning a hole in your pocket, there are plenty of better things you can do with them than purchase Bankshot Billiards 2."}