{"ref": "https://www.gamespot.com/reviews/serious-sam-advance-review/1900-6098709/", "date": "May 18, 2004", "game_name": "Serious Sam Advance", "text": "Between the lack of usable buttons and its modest graphics capabilities, the Game Boy Advance isn't an optimal system for first-person shooters. Doom and Duke Nukem 3D were ported to it just fine, but games that pushed the envelope--like James Bond: 007 Nightfire and Medal of Honor Underground--ended up ugly and uncontrollable. For Serious Sam Advance, the developers kept things simple and played to the GBA's strengths. There aren't as many puzzles as there were in the PC game, there aren't as many levels, and you can't jump or go swimming either, but all of the great weapons are here and the levels have enough surprises waiting behind each corner to keep your adrenaline going. Ultimately, though, Serious Sam Advance comes up short because there just aren't enough levels to play. The pistol is one of the first weapons Sam receives. The GBA game is similar to the PC game in a number of ways. The story looks ahead to the year 2014, when humanity is brought to the brink of extinction by an alien race. You control a character named Sam Stone, a lone warrior that has been selected to travel into Earth's distant past and stop the aliens before they have a chance to infiltrate and weaken human society. Long story short: The aliens follow Sam back into the past and the fighting gets serious. Just like the PC game, levels are set in exotic locations around ancient Egypt and Rome. Also like the PC game, Sam has a wild arsenal of weapons--10 in all--such as a chainsaw, tommy gun, minigun, and rocket launcher. Clearly, Serious Sam Advance doesn't pack the same audio-visual punch that the PC version did. Nonetheless, it stacks up well compared to the other first-person shooters that are already available for the GBA. The music is forgettable, but the bullet and monster sound effects complement the onscreen action nicely. The environments have a believable 3D look to them, and the textures that make up the walls and decorations aren't muddy or grainy like the textures in similar games (Medal of Honor Underground comes to mind). The enemies do appear pixilated up close, which seems to be the case in every FPS on the GBA, but the developers wisely made sure that monster skin tones don't have a habit of blending in with the environment. If you see a green splotch standing in front of a brown door up ahead, chances are it's a monster. For the most part, the frame rate is decent, although there are plenty of places where the action slows down or stutters to keep up. These instances usually happen in large, open areas when there are a half-dozen monsters and their projectiles onscreen, along with a few weapons packs sitting around. The graphics and audio are sufficient to get across the game's primary purpose: gunplay. The directional pad and shoulder buttons allow you to move Sam around and strafe from side to side. Whenever you enter a room or pass by a particular trigger zone, enemies teleport in and focus their attention on Sam. The selection of different enemies is great (20 in all), although the intelligence that steers them isn't very complex. Monsters will patrol their areas and chase after you if you come into view or make a noise. However, it is possible to sneak up on enemies if they're not looking your way, but they won't try to evade your attacks once you open fire, which makes most fights somewhat one-sided. The game is challenging though, mainly because there are literally hundreds of enemies to fight in each level and the odds are good that you'll end up surrounded by groups of them on numerous occasions. There is some strategy involved in fighting certain enemies too. For instance, beheaded kamikazes explode when they die. If you frag a kamikaze while it's close to you, you'll sustain damage. However, if you frag it near a cluster of other enemies, you can take out the entire group at once. To use Sam's weapons, you use the D pad to aim the crosshair and hold down the A button to fire. Ammunition boxes scattered throughout each level allow you to reload, and you can switch weapons by pressing the B button. Some people will find the controls too sensitive, since the crosshair moves extremely fast with just a light tough. Using the strafe buttons to aim softens this problem quite a bit. Sam prefers the minigun against groups of enemies. Where Serious Sam Advance comes up short is its length, or call it depth if you like. Whatever the definition, Sam's quest is over much too soon. Every level is huge and littered with stairs, doors to traverse, and countless rooms full of hundreds of enemies--but the single-player mode clocks in with just 12 separate levels. For fans of the genre, that totals out to around three hours of playtime, though the average player may require a total of five or six. Assuming you can cajole a few friends into buying the game, you can get the most for your money by playing in the deathmatch mode. The inclusion of a password save instead of a battery backup save doesn't help matters any either. Sam has an encyclopedia that keeps track of high scores and records the number of enemies you've encountered, how many you've killed, and how many have successfully attacked you; but once you turn off the system, this information is erased. The password simply lets you restart at the last level you played. In many ways, Serious Sam Advance is just as good as any other first-person shooter on the GBA. Unfortunately, it's over right when it hits its stride. Twelve levels aren't enough."}