{"ref": "https://www.gamespot.com/reviews/batman-vengeance-review/1900-2828170/", "date": "November 28, 2001", "game_name": "Batman: Vengeance", "text": "Batman has a long record of games based on its movies and comics that, for the most part, reads like a rap sheet citing a number of transgressions. Until the recent release of Batman: Vengeance for the PS2, most had populated the lower echelon of games that rode on their franchises. As was pointed out in the PS2 review of Batman: Vengeance, most games wearing the Batman mantle were decidedly poor and existed only to placate die-hard fans and feed the hungry pockets of game developers not willing to go the extra mile. Ubi Soft has taken up the rights to the animated series, a slick anime that is thick in atmosphere and has the ability to follow its own path in the story of Batman, free of the constraints of the many comic books and Hollywood movies. Luckily, the new breed of Batman games has reflected this so far by yielding a decent enough title. While the Game Boy Advance version of the game in no way tries to push any boundaries, it does succeed in delivering a fun game with a variety of modes for players to delve into. Initially, the game puts you in the boots of Batman and lets you loose in the pocket-sized version of Gotham City. The variety of play styles range from a top-down view in the vein of games like Alien Syndrome to a standard side view platformer like those enjoyed in the 16-bit days. Also included are a driving level that functions much like a cross between the arcade driving classics Bump 'N Jump and Spy Hunter, as well as a flying level that acts like a standard shooter like R-Type. Each of these tends to have a particular playable character assigned to them--the overhead view uses Robin, the platforming uses Batman and his utility belt, and so on. While the variety of modes mixes things up a bit, none of the different styles never really stand out as being particularly strong. All land smack-dab in the middle of the road, and while some--especially the driving and flying levels--can be enjoyable, by the time you reach the end of the said level, you're ready to move on to the next. Each different level has its own general goals. The platforming levels simply require that you make it to the end intact; the driving and flying levels have you running and gunning; and the overhead view variety have you rearranging boxes to allow passage through an area. Again, it's a nice way to mix things up, which serves to keep the game interesting, if not at the head of the class. The graphics are pretty decent, especially the opening sequence, which gives a sweeping view of the city before it homes in on Batman brooding high above the many noirish buildings that decorate the landscape. The game takes a graphic novel approach to progressing the story, with text-based cutscenes that dovetail the levels together nicely. Some of the characters have more detailed idle animations than others as well. Batman, when he comes to a standstill, encircles himself with his cape, which flutters as if he were standing in a perpetual wind. Others simply cease to move. The control of each character and vehicle is pretty tight, with exceptions. For some reason or another, when playing as Batman, it's wise to give ledges the benefit of the doubt, as you will often find yourself plummeting to an untimely death when you should have been standing right at the chasm's edge. Luckily, you can use your cape to glide short distances, so this doesn't become a glaring flaw. As for the driving and flying, both are no-frills examples of their style. Both can fire energy balls that humanely stun enemies or passersby without vaporizing them. This is particularly useful in the driving levels, as there is a large amount of civilian traffic for you to avoid. The sound is pretty good; in fact, the title music is quite nice, as is the boss music, but on some of the levels, you'll have to deal with methodical loops of tracks that fit the atmosphere. Playing as Robin will give you a dark and methodical industrial tune, and driving the batmobile will give you a more action-oriented tune. What it all boils down to is that Batman: Vengeance for the Game Boy Advance is a decent enough game. It can be quite fun in parts, but other levels can merely be a chore to deal with while you make your way to the next. If you're in the market for a cross-genre game that combines many different gameplay styles or you're a fan of Batman in general, then this one is right up your alley. If not, you might be better off playing games that are geared toward delivering one solid type of game, rather than taking four beaten paths."}