{"ref": "https://www.gamespot.com/reviews/hotel-giant-2-review/1900-6249439/", "date": "February 4, 2010", "game_name": "Hotel Giant 2", "text": "You probably won't want to check in to Hotel Giant 2, which is a management sim that could be summed up as convoluted and a bit cranky. This sequel to the tycoon game that was a modest hit eight years ago dumps most of the enjoyable aspects of playing a Hilton-like heir in favor of rigorous micromanagement. This isn't as much of a game as it is a total re-creation of life in the hotel business. In fact, it's so focused on the nitty-gritty that you'd have more fun taking overnight shifts on the front desk at the nearest Motel 6. There is a certain charm here that might appeal to the detail-oriented among you, but the game is so demanding that even the biggest control freaks will likely find themselves worn out after a few hours of play. Some of the hotels you're called upon to renovate don't look like they need much help, at least from the outside. The core gameplay mimics the original Hotel Giant, as well as a score of copycat tycoon games last seen gathering dust in the PC games aisle of your local department store. As usual in these sorts of things, in the single-player campaign (there is no multiplayer; just the solo campaign, a random option, and a few sandbox hotels), you're a near-omniscient boss who is given control of a series of reclamation projects in various states of disrepair. Your orders are simple--get them into the black. You work on everything from massive elite hotels in desirable locales like Paris and Hollywood to rustic inns in the middle of nowhere. Just about everything can be tracked here, so if you like micromanagement, sit right down and stay a spell. The menus are extremely detailed, as well as loaded with all sorts of information like room occupancy, reservation rate, customer satisfaction, employment policies, advertising campaigns, and package deals. You can even delve into your market share to compare how you're doing against your rivals or get strict on the staff members and review their uniforms. Refitting hotels is a major focus of gameplay. Guests always want something that you don't have, so you're constantly called upon to gut existing accommodations and lay down new rooms. The Sims-like aspect of dressing up your hotels is the most entertaining aspect of the game because there are absolutely tons of options here for room types and furnishings. You can add nearly anything to your hotels, from groovy piano bars and swimming pools to arcades and gift shops. Then, you can outfit them with an incredibly broad range of accoutrements like a virtual Martha Stewart. There are numerous choices for everything. Don't like the basic style of urinal for your bathrooms? Spend a little more and buy the glitzy ones. Feel like a new floor? Browse the dozens of carpet and tile samples to lay down a new one. Interested in some arcade machines for your game room? Check out the multiple types of shooting and racing games on offer. Everything looks great, too. All of the objects are sharply drawn, and the sheer number of those objects ensures that you don't have to build the same room twice. Guests mill about amiably, eating meals; hitting the tanning beds; shooting pool; and even hanging out in the sauna, pouring water on the hot coals. It looks and feels like you're actually in a hotel, right down to the annoying Muzak soundtrack. But it's all a bit much. Hotel Giant 2 could have been fun. Running a glitzy European getaway for the rich and famous doesn't sound half bad. Neither does trying to turn around a faded icon on Sunset Boulevard. But most of these fantasy aspects of being a big-time hotelier have been drained away through a focus on mundane tasks. There are just too many options here, forcing you to make decisions that you really don't want to bother making. Was it really that important, for instance, to give you a dozen or so options for mood lighting on tables in your hotel bar, including a few variations on basic candles? Or to force you to set up a menu in your hotel restaurant, right down to picking the appetizers, soups, entrees, and desserts? Depth is one thing. Having to choose between the stuffed spider crab and the crispy lamb chops with almond is quite another. You can easily spend hours and hours fiddling with little things like this, and the problem is that there's no way to automate most of them. At first, though, you really get pulled into it. Just working on a restaurant can be all consuming because you get caught up in trying to make sure that people have a good range of main courses and that they can afford your lobster. Still, everything is so meticulous that the thrill wears off. Setting up a hotel restaurant is kind of fun. Choosing every single item on the menu, not so much. Scenarios also don't have big objectives that are blasted out to you at the start of play. There are goals to be met, like increasing the overall hotel rating or building a restaurant with good customer satisfaction scores, but you have to hunt for them in the menus. It can be a little hard figuring out what you're supposed to do. You can click on a tips button to get a couple of ideas and on individual rooms to see what you're missing, but generally, you have to see what guests are complaining about to really find out how to improve your hotel. Unfortunately, they moan about anything and everything. My room is too small. The lighting in the lobby is too dim. I want a spa in the health club. There aren't enough exercise benches in the gym. I wish my room had one more TV. I want a phone in the lobby. And so on. All the griping seems widespread and random, unlike in most other management games where the great unwashed tend to all moan about one problem at a time, which gives you a good idea as to what needs to be prioritized. Here, it's often like you're doing nothing but manning a virtual complaint desk and racing around responding to bleats about seemingly every little thing, from the carpet weave to the snooty guy at the front desk. It might be realistic, but you spend more time with busywork than you do planning a dream destination for tourists. If you're contemplating a real career in hotel management and love fiddling with every little detail, you might want to give Hotel Giant 2 a shot. Otherwise, give this crash course in the hospitality business a pass. While you can tell a lot of design work went into this carefully considered and encyclopedic hotel game, the sheer weight of what you're called upon to manage is too heavy for all but the most dedicated player with a lot of time on his or her hands."}