{"ref": "https://www.gamespot.com/reviews/zatch-bell-electric-arena-review/1900-6142670/", "date": "May 17, 2006", "game_name": "Zatch Bell! Mamodo Battles", "text": "Like so many other cartoon-licensed games, Zatch Bell!: Electric Arena captures the personality of the show it's based on but doesn't really offer much in the way of engaging gameplay. Beneath the sharp sprite-based graphics and Manga-style cutaways, which admittedly do look very nice, this is just a poorly designed fighting game that even the show's youngest fans are likely to laugh at. In Zatch Bell, human beings fight alongside magical dolls known as mamodos. In the Zatch Bell! cartoon and comic book stories, magical creatures called mamodos have come to Earth to fight it out for the crown of the mamodo world. There's just one catch--the mamodos need human partners in order to use their powerful spell books. Central to the show are the characters of Kiyo, a 14-year-old boy, and Zatch, a mamodo that wants only to be a kind king, although unbeknownst to him, he has a dark past and powerful hidden abilities. The two-on-two fights that occur between the various teams and the subsequent moral dilemmas that arise are the main focus of the franchise, so it makes sense that Bandai would orient the video game around fighting, too. The game offers a decent assortment of characters and play modes, including a two-player versus link option. Other play modes include story, free battle, challenge, and survival, along with four minigames inspired by the show. Initially, only a pair of teams are available for play, but by playing through the story, challenge, and minigame modes a few times, you'll be well on your way to unlocking all 12 teams. Matches are set up Street Fighter-style, with the two teams squaring off in the middle of a wide, two-dimensional battlefield. Successful attacks will drain the recipient's stamina meter. In order to win the match, a team has to win two out of three rounds. Only the human member of the team can take damage, although both the human and mamodo can perform attacks. For the most part, team members stick close together and function as a single unit. If you push the jump button, the human and mamodo will jump in unison; if you hold back to guard, they'll both cross their arms; if you perform a magic attack, they'll both pause to cast the spell; and so on. Although there are plenty of teams to pick from and each team has a good assortment of attacks, there really aren't any combos or counters to speak of. Furthermore, some attacks are ridiculously overpowered. Basic melee attacks hardly dole out any damage at all, while magic attacks, which are tough to block, can slice away a quarter of the health meter per use. Then there are the super magic attacks that dish out crippling damage and can't be blocked, but can be recharged simply by holding the attack button for a few seconds. If there is any strategy at all, it comes into play when both teams activate magic attacks at the same time. Doing so causes a clash, which is won by repeatedly pressing the attack button as fast as possible. More often than not, the team that wins is the one that performs the most special attacks, regardless of any other factors. Because there is so little strategy and almost no balance to speak of, matches in Zatch Bell!: Electric Arena are nothing more than drawn-out spellcasting displays that result from rapid button-mashing. Good looks, true, but the game is all button-mashing. Still, if you or your children are hooked on the cartoon and committed to picking up the game, you can at least look forward to characters and backgrounds that look like they were copied pixel for pixel from show episodes or comic issues. The backdrops don't animate in any way, but they are colorful and have multiple scrolling layers. The character sprites are large, sharply defined, and exhibit a nice assortment of amusing attack animations. Sadly, the accompanying music and sound effects don't achieve the same standard. The tunes are generic and the sound effects are eerily similar to what the 8-bit Game Boy used to output. Some people will be lured into getting Zatch Bell!: Electric Arena because it is easy on the eyes and somewhat faithful to the cartoons and comics it's based on. That's unfortunate, because there's literally nothing under the hood but button-mashing."}