{"ref": "https://www.gamespot.com/reviews/monster-hunter-rise-review-standing-tall/1900-6417652/", "date": "January 11, 2022", "game_name": "Monster Hunter Rise", "text": "The locations you explore in Monster Hunter Rise have already felt the delicate touch of humanity's hand. Traditional Japanese torii can be found weaving through mountainside paths, leading to sacred shrines, while decaying temples have been reclaimed by nature as local plant life envelops the aging architecture. Signs of human life can even be found at the base of a raging volcano and in the midst of a flooded forest, where a Mesoamerican-style pyramid dominates the landscape.If 2018's Monster Hunter World was all about unearthing a new continent as an intrepid frontiersman, then Rise is a triumphant return to the Old World with valuable lessons learned. An enhanced port of the 3DS title Monster Hunter Generations Ultimate may have already graced the Nintendo Switch, but Rise is the first game in the series built from the ground up for Nintendo's latest console. As such, Rise closely follows in the footsteps of World while reneging on some of its changes and introducing plenty of new impactful ideas that excellently shift the focus towards the series' heart-pumping action.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Monster Hunter Rise Video ReviewThe core Monster Hunter gameplay loop has remained relatively unchanged as you hunt down gargantuan monsters, harvest their materials to craft new weapons and armor, and tackle increasingly tougher foes. World coalesced both the single and multiplayer parts of the experience into one cohesive whole, but Rise reverts back to the old ways by splitting them into disparate Village and Hub quests. Village quests can only be played alone, while Hub quests can still be tackled solo but are designed with multiple players in mind. This isn't the most welcome setup for newcomers since it isn't immediately clear which quests progress the story, nor is there any indication of whether or not you should be alternating between both paths. The impact this structure has on the game isn't as substantial as it initially seems, though. Hunting the same monster multiple times has always been a part of Monster Hunter's DNA, so repeating the same mission as both a Village and Hub quest is something you would typically seek out anyway.That's not to say Rise isn't approachable in other areas either. There's a renewed focus on fast-paced action that strikes an impressive balance between being welcoming for newcomers and satisfying for battle-hardened veterans. When entering a location, for example, your trusty pet Cahoot will mark all of the nearby monsters on your map. You won't immediately know the identity of each one until you've already discovered them, but this cuts down on the time it takes to seek out your foe and gets you into the heart of the action much faster. It's an ideal fit for the Switch's handheld mode, allowing you to jump in and out of its most thrilling moments without having to engage with the long-winded slog to find and follow a monster's tracks.Exploration is still a key part of the experience, even if you know the exact location of your prey. There are plenty of shortcuts and hidden paths to uncover within each location, and the addition of local wildlife--known as Endemic Life--encourages you to seek out every nook and cranny in order to gain the temporary buffs to damage output, stamina regeneration, and so on, that they offer. On the flip side, if you're not interested in boosting specific stats to get a leg up in battle, you can always ignore the Endemic Life and tailor the challenge to your liking. Rise offers a degree of flexibility in the way you're able to tackle each monster that goes beyond your choice of weapon and armor.With that being said, the verticality afforded by the new Wirebug mechanic has the most significant impact on Rise's exploration. This exciting new tool allows you to zip through the air by utilizing what's known as Wire-dashing. From here, you can chain moves together, mixing in wall runs with additional Wire-dashes to reach previously unattainable heights and traverse the environment at a rapid pace. The finesse it requires takes some getting used to, and you still need to be shrewd with the Wirebug's forgiving cooldown to be successful, but it's an incredibly fun tool to use once you're comfortable with its demands.There's a renewed focus on fast-paced action that strikes an impressive balance between being welcoming for newcomers and satisfying for battle-hardened veterans.The Wirebug also plays an important role in combat, as each of Rise's 14 signature weapons has its own Silkbind attacks. These unique moves are relatively easy to pull off and range from a timing-based counter with the Long Sword to an uppercut leading into an explosive downward strike with the Switch Axe. Each Silkbind attack can be linked into different combos, opening up your repertoire of potential techniques, and the Wirebug expands on this even further with its defensive maneuvers. The evasive Wirefall move, for instance, gives you an opportunity to get back on your feet and avoid a monster's follow-up attack after being knocked down or pushed back, while the Wire-dash extends the reach of your dodge for when you need to quickly evade a rampaging beast.Aside from the addition of Silkbind attacks, each of Rise's weapon types have remarkable depth in keeping with the series' traditions. Mastering a particular weapon is just as rewarding as before, and there's also an element of customization available this time around too. The aptly named Switch Skills allow you to swap out certain regular and Silkbind attacks to make a weapon that's reflective of your play style and preferences. An improved training area, and a reduction in the amount of materials necessary to upgrade a new weapon, also makes this aspect of the game more approachable for newcomers who need to experiment in order to find a weapon type that suits them.Stamina and weapon sharpness have also been streamlined thanks to the addition of Palemutes. These new dog-like buddies will help you out in combat and can be decked out with weapons that only add to Rise's combat depth, and they also act as mounts for you to ride any time you want. Stamina isn't consumed when you're on the back of your trusted Palemute, and you can even sharpen your weapon while traversing to give you something productive to do during travel, thus alleviating some of the more time-consuming aspects of Monster Hunter.Multiplayer is also a hassle-free experience, whether you're playing with a group of friends or with up to three strangers. The wait times are relatively short when joining an online hunt, and lag is a non-issue on Nintendos new online infrastructure. The frame rate holds up, too, even when the screen is awash with multiple hunters, particle effects, and the beasts themselves. And this is to say nothing of how good Rise is as a multiplayer game. Theres nothing else quite like gathering a party to go and hunt down an imposing adversary, and Rises new features only add to the inherent joy you can glean from its hectic cooperative action. Not to mention the fact that it gives support-oriented weapons--such as the reworked Hunter Horn--time to shine.There is a basic story that sets all of this up by casting you as Kamura Village's sole hunter, but the narrative is little more than a paper-thin vehicle for introducing Rise's new mechanics and game modes. Chief among the latter is the Rampage: a special mission type that requires you to defend a stronghold from waves of ferocious monsters. The Rampage is inspired by Japanese folklore and the Hyakki Yagy ~Night Parade of One Hundred Demons~ idiom in particular, which sees an uncontrollable horde of yokai march into our world. In gameplay terms, the Rampage is similar to a tower defense game, tasking you with placing various hunting installations around each stronghold in order to repel the frenzied invaders. Some of these installations are automatic and manned by NPC companions, while others can be manually controlled if you fancy dishing out some damage of your own with ballistas, cannons, and other heavy weaponry.Rampage quests offer a respite from the usual Monster Hunter formula, delivering histrionic thrills as you find yourself bombarded by multiple monsters at once. There's some satisfying depth to it as well, with progression rewarding you with more powerful installations and upgraded weapons. You can even jump into the action as you would on any other monster hunt, or lure the enemy to specific points on the battlefield to unleash devastating attacks with powerful installations like the Dragonator and the Splitting Wyvernshot. Completing a Rampage quest will reward you with the usual assortment of monster parts with which to craft weapons and armor, but you're also incentivized to finish them in order to unlock Defender Tickets. These can be spent on numerous Rampage Skills that permanently boost specific weapons stats such as attack, affinity, and defense.Part of what makes the Rampage so exciting is the addition of Wyvern Riding to your offensive arsenal. Monster riding was first introduced in Monster Hunter 4, but it's had a significant shakeup in Rise. By performing a series of Silkbind and aerial attacks, a monster will enter a mountable state that allows you to hop on their back and go for a ride. You can launch your helpless prey into walls to deal damage and put them in a downed state that leaves them vulnerable for a time, or you can use them as a massive battering ram to attack other monsters. This is a tad cumbersome due to some stiff controls, but being able to ravage the monster you're hunting with another beast is a singular treat that adds a tinge of kaiju-esque action to the proceedings--not to mention the strategic considerations it introduces to each hunt. Monsters will occasionally bump into each other and fight over territory, but you can also use Wyvern Riding to seek out another monster and force them into a confrontation, creating emergent moments that enhance the game's core combat.The monsters themselves consist of fan favorites such as Rathian, Diablos, and Puki-Puki, along with plenty of new monsters and a few surprises. Much like the Rampage, each of the new beasts are inspired by yokai and other legendary creatures from Japanese folklore. The menacing Somnacath, for example, is based on Japanese mermaids, which have the lower body of a fish and the upper body of a demon. It's a fascinating creature to fight as it moves through the water like a sea otter before putting you to sleep with its siren's song. Bishaten, on the other hand, is inspired by tengu, presenting an ape-like monster with the face of a crow and a dangerous tail the shape of tengu's fan. Aside from using its rear appendage to deal damage, the Bishaten also throws large pieces of fruit at you, making it one of the more peculiar monsters in the bestiary.Going toe-to-toe with these intimidating beasts is the unmistakable core of the Monster Hunter experience, and Rise still feels like a distinctly Monster Hunter game, even if it's more of a fully-fledged action title than any other entry in the series. This renewed focus doesn't diminish its layered RPG mechanics, nor does it dumb down on any single aspect of the hunt. Certain changes make Rise a more approachable game for newcomers, but you also have the freedom to tailor the experience to your liking. The moment-to-moment combat is as impeccable as it's ever been and puts Rise on a pedestal as one of the feathers in the Nintendo Switch's cap.Monster Hunter Rise was one of 2021's best games. It still delivered the quintessential Monster Hunter experience of killing increasingly large monsters with increasingly powerful weapons, but Capcom also stripped away a lot of the fat to deliver the most dynamic and accessible entry in the series thus far. After almost a year of Nintendo Switch exclusivity, Rise has now made its way to PC with a souped-up port that improves on what was already a fantastic game in almost every way.The most obvious improvements are, of course, visual, as it comes with all of the bells and whistles you would expect from a snazzy PC port. The addition of high-quality textures results in a sharper and more detailed image even when bumping the resolution up to 4K, and the system requirements are lenient enough that you can get it running at 60fps or higher with every graphical setting maxed out on even moderate hardware. There are a few new graphical settings like motion blur and depth of field that can be toggled on or off to add an extra layer of fidelity, and support for ultra-wide monitors is also included. It's incredibly well-optimized right out of the box, too, which wasn't the case when Monster Hunter World launched on PC back in 2018. Rise isn't as hardware intensive, but it's always nice when you don't have to wait for post-launch patches for a game to reach its full potential.Monster Hunter has always had a deliberate pace, especially during combat where timing your moves and their locked animations is an essential skill. As such, the increase in performance afforded by the PC version isn't a game-changer, although it's still difficult to return to the Switch release after experiencing Rise at a buttery smooth frame rate. The new wirebug mechanic completely alters the flow of traversal and exploration by letting you effortlessly zip around the environment, and it's here where the unlocked frame rate really shines. Rise is also a much snappier game than its predecessors, and the PC version's faster load times take this a step further by getting you into the action almost instantaneously.Keyboard and mouse support is also robust, letting you set shortcuts and new key bindings until it's palatable on something other than a gamepad. If you are using a controller, however, the gyro-aiming found in the Switch version is absent here, despite the PC port being compatible with both the Switch Pro controller and the PS5's DualSense. You're not going to miss it if this is your first time playing Rise, but for those who became accustomed to tilting the controller when soaring above the ground with the wirebug, it might take a while to acclimatize to solely using the right stick again.If you did play Rise on the Switch and are wondering whether the PC version is worth picking up, one of the most significant aspects you'll have to take into consideration is the absence of cross-play and cross-save. Capcom is unable to implement these features for both Rise and its upcoming Sunbreak expansion, so if you've already invested hours into depleting Kamura's monster population, you'll have to do it all over again if you want those visual and performance boosts.Fortunately, there is some new content to sink your teeth into if you haven't played the Switch version in a while and are making the jump to PC. All of Rise's free post-launch content is included up to version 3.6.1, with tougher apex monster variants to hunt and special event quests that feature collaborations with the likes of Okami, Street Fighter, Mega Man, and Sonic the Hedgehog. Capcom is also planning on syncing content between the Switch and PC versions at the end of February, so the PC won't be lagging behind when new content drops. Meanwhile, the Sunbreak expansion is scheduled to launch on both Switch and PC at the same time when it releases sometime this summer.Monster Hunter: Rise is still a technical marvel on Switch, but the graphical and performance enhancements present in this PC port make it the definitive version of one of 2021's best games. It will even retain its portability if you're planning on picking up a Steam Deck later this year. For those who already own Rise on Switch, picking up the PC version will come down to how willing you are to replay the game from the beginning. For everyone else, it should be a no-brainer."}