{"ref": "https://www.gamespot.com/reviews/monster-hunter-rise-sunbreak-review-sunrise-over-the-kingdom/1900-6417916/", "date": "July 14, 2022", "game_name": "Monster Hunter Rise", "text": "Monster Hunter Rise: Sunbreak sees your intrepid hunter leave Kamura Village behind to venture across the sea to the outpost of Elgado. It functions almost like a brand new game, introducing a new HUB and cast of characters, locales to explore, monsters to fight, and weapons and armor to craft from their parts. Yet there's very little about Sunbreak that feels truly new or surprising. More Monster Hunter is never a bad thing, and Sunbreak is an excellent expansion with some smart additions that reinforce just how good Rise already is, but it's difficult not to feel a little disappointed by its formulaic nature.For starters, the story is typically boilerplate, revolving around a brand-new threat that's making all of the monsters overly aggressive. It's as predictable and easy to ignore as any previous Monster Hunter tale, although the new cast of characters are at least more defined and interesting than those found in Rise, partly because you spend a lot more time with them.New Follower Quests give you a chance to embark on hunts in the company of various non-player characters, allowing their personalities to surface more than the series usually allows. These are single-player-only quests, but the intricacy of your allies' artificial intelligence makes them almost indistinguishable from multiplayer hunts. Your companions fight like other players, using lifepowder at opportune times, laying down traps, drawing the monster's attention for prolonged periods, and sometimes disappearing before emerging on the back of another reluctant beast. You'll notice them when they're actively helping you, and they're smart enough not to frustrate you by doing something boneheaded. These quests might be optional, but each one rewards you with unique items, and they make it much more enjoyable to grind for monster parts on your own.Having a helping hand is also greatly appreciated since Sunbreak rips the training wheels off from the get-go. Rise was by no means an easy game, but its approachability made for a more gentle introduction to the Monster Hunter franchise, saving the real threats for its post-campaign hunts. In order to access Sunbreak, you first need to complete the Hunter Rank 7 quests in Rise, thus ensuring that you're ready to tackle its new challenges. Once you begin the expansion and arrive in Elgado, you're quickly promoted to Master Rank and sent off to defeat some particularly tough foes--albeit ones you've mostly fought before. It makes sense to throw some familiar foes your way at the beginning, just in case you're returning to the game after a number of months, but Sunbreak falls into the trap of dragging this process out for far too long.Your first hunt is against a variant of the Hermitaur, a large crab-like enemy that has appeared in the series numerous times before. It has some new moves, and it's a new encounter for Rise, but for long-time players, it's not the most exciting way to open an expansion. There are other subspecies of different Rise monsters sprinkled throughout, such as the Blood Orange Bishaten, which trades the poisonous persimmons of Rise's normal Bishaten for explosive pinecones. For the most part, though, you'll be hunting a familiar rogue's gallery with slightly expanded movesets.This is par for the course when it comes to Monster Hunter's endgame--which Master Rank usually represents--but considering this is a paid expansion, it would've been nice if it were frontloaded with a few new monsters to avoid the feeling that you're simply revisiting well-trodden ground. As it is, the first time you'll face off against a new threat isn't until a dozen or so hours into Sunbreak, when you reach Master Rank 3.One change Sunbreak does introduce from the very beginning is the Switch Skill Swap. This lets you take two different Switch Skill loadouts into battle, letting you alternate between them on the fly. Doing so puts you into a bespoke animation that can also transition into a rangy dodge that's much more effective than your standard dodge, and being able to utilize double the number of Switch Skills adds more variety and dynamism to your offensive arsenal. Much like its new monsters, however, Sunbreak holds back on unlocking new Switch Skills until you reach Master Rank 4.It would've been nice if it were frontloaded with a few new monsters to avoid the feeling that you're simply revisiting well-trodden ground ... While it can be frustrating that so many of this expansion's new additions are withheld for so long, they're almost worth the wait.While it can be frustrating that so many of this expansion's new additions are withheld for so long, they're almost worth the wait. The new monsters in particular are all fantastic additions that offer unique challenges, and they're just as fun to look at as they are to fight. While Rise's aesthetic was inspired by Feudal Japanese culture and folklore, Sunbreak is influenced by Western and European mythology. The Three Lords--an infamous trio of rampaging beasts--are the standout monsters and the ones that tap into this new influence, introducing nasties inspired by both werewolves and vampires.Lunagaron, for instance, is a formidable wolf-like monster that stalks the Kingdom on all fours. That is, until it transforms into its true form and stands up on its hind legs, cutting down hunters with its razor-sharp claws and ability to freeze the air. Malzeno, on the other hand, is a fearsome elder dragon that proves especially tricky because it can teleport around the battlefield. Some of its attacks also inflict the Bloodblight status effect, which drains your health and reduces the effectiveness of healing items. When you're in this state, attacking the beast will refill your health proportionate to the amount of damage you deal, adding a tinge of Bloodborne to these tense encounters with Malzeno.While you'll regularly revisit each of the locales from Rise throughout Sunbreak's campaign, the expansion does add two new biomes: Jungle and Citadel. If you've ever played Monster Hunter 2 before, you'll probably recognize the tropical island of Jungle with its palm trees and sandy beaches. It's been masterfully recreated here, making use of Rise's seamless maps and increased verticality to update the 16-year-old location. Citadel, on the other hand, is brand new, offering an eclectic mix of different environments for you to traverse in a single hunt. You can go from fighting in a murky, poisoned swamp to finishing the job on a frozen mountain peak, all against the backdrop of a crumbling castle. Both locales are denser than those in the base game, although every single map has been updated with new forms of endemic life to enhance the world's vivacity.New Wirebugs are focused on wyvern-riding, either making punisher attacks more lethal or increasing the drop rate when two monsters clash. You'll also find small critters known as Starburst Bugs latched onto various surfaces. These little buggers will explode if a monster collides with them, giving you another way to inflict significant damage when riding on the back of a monster. The new Marionette Spider offers an alternative and much more satisfying tactic, though, letting you wrap your target in silk before yanking them full pelt into an explosion. These new forms of endemic life may only represent a small change, but much like the Switch Skill Swap, their impact becomes more apparent over time for how much they improve each hunt.Almost every other system in Sunbreak has been touched in a small yet meaningful way. Bunny Dango, the pre-fight meal you scorf down before embarking on a quest, now lets you alter the effectiveness of each Dango ability by changing the order in which you select them, adding some purposeful decision-making to the process. Traversal has also been improved by removing the requirement to perform a Wiredash before being able to wall run, which not only makes navigating each map much faster, but it also makes it easier to utilize their verticality. There are also new weapons and armor sets, Master Rank layered armor, decorations you can socket into your gear to activate various buffs, and so on. You can min-max your hunter to your heart's delight.Monster Hunter Rise represents the series at its very best, and the subtle improvements made by Sunbreak meaningfully improve upon its compelling gameplay loop, even if they're not apparent until a few hours in. The lack of fresh ideas is disappointing, and this feels more like the challenging endgame Rise was initially missing than an entirely new experience. The new and returning monsters are fantastic, though, as are the two new locales, and it's still relatively easy to lose yourself in Monster Hunter Rise's exhilarating world. Sunbreak might not be as substantial as some of the franchise's previous expansions, like Iceborne was for Monster Hunter World, but it improves upon Rise's foundations with another thrilling selection of hunts. It's just a shame most of them are overly familiar."}