{"ref": "https://www.gamespot.com/reviews/opoona-review/1900-6190117/", "date": "April 29, 2008", "game_name": "Opoona", "text": "The titular character of Opoona is a feisty sort. He reads fortunes, goes fishing, and delivers room-service orders, all at the behest of a bureaucratic planetary government that apparently doesn't heed universal child-labor standards. Yet the portly, round-headed tot keeps a smile on his face the entire time (well, except when he runs). This cheerfulness trickles into every aspect of Opoona, from its clean, vibrant visual design to some wacky, badly translated dialogue that proclaims things such as ~You've won acceptably.~ And that's a very good thing, because though Opoona himself may approach the endlessly mundane tasks with gentle good humor, you won't be inclined to tackle the constant red tape with the same enthusiasm. Without its colorful charm, this role-playing game's aimless wandering, shallow story, and other minor annoyances would be hard to forgive. Yet like that spoonful of sugar that helps the medicine go down, the game's adorable presentation makes it easier to stomach the bitter shortcomings. In Opoona, you spend more time wandering around than you do fighting monsters. Opoona is from the planet of Tizia, where everyone resembles an old Fisher-Price action figure. He and his family are en route to their vacation destination when a mysterious incident causes them to crash-land on planet Landroll. Opoona is taken in by the kindly and efficient Landrollians, who put him to work as a ranger as he searches for his brother Copoona and sister Poleena. There's a little bit of intrigue and a little bit of emotion scattered throughout the journey, but for the most part, the tale is a sweet, chewy morsel: superficial and insubstantial, but too well-meaning to out-and-out dislike. Every character and every bit of dialogue is supercute, which makes the game sound nauseating, but wacky characters and interesting locales make it just quirky enough to keep it from getting annoying. Or, to lift a bit of dialogue from the game itself, it's more like a heart cookie playing the ukulele in the evening than it is a mound of white chocolate that is too big for just one person to eat. Thus the stage is set for the most amusing and alarming trek through governmental red tape since your last visit to the DMV. To progress, you must upgrade your ranger license and earn other licenses by performing various tasks, from fighting evil flatscreen televisions to vacuuming in a cafe. You'll spend a lot of time in Landroll's domed habitats, applying for licenses, searching for mission targets, and wandering aimlessly while trying to figure out what to do next. The domes are expansive, with wide-open areas and multiple towers that must be traversed through a web of elevators. It's all unnecessarily spacious, which makes it easy to get lost, and the in-game map (called a GPS here, which is as accurate as calling a fast-food burger patty a filet mignon) is no help at all. There are no mission waypoints, and the job descriptions are so vague that you'll be stuck from time to time, speaking with every non-player character and checking out every nook until you trigger the next task. Opoona, with its simple story and sleek, colorful visual design, is obviously aimed at younger players. Yet there's nothing friendly about navigating its various corridors and wide-open spaces, and the frequent mistranslations (What do you mean, go to the elevator on the left? There is no elevator to the left!) and vague instructions may cause many youngsters--and adults, for that matter--to give up. Fortunately, things pick up once you leave the domes behind and engage in actual combat. Battles in Opoona are usually random, but they are simple and fun, and they highlight the game's unusual, minimalist control scheme. There are a few options available, but the best (and default) control setup is to use only the Nunchuk. All you need is a single analog stick and two buttons, and you have it made. This can lead to some fussy, fumbling moments, such as when you want to rotate the camera or switch targets in battle, but the one-handed controls work rather well. However, you may find the classic controller more to your liking, given that the unnecessary Wii Remote might get in your way if you go the Nunchuk route. Either way, you'll attack your enemies by pushing the stick in any direction and releasing it, at which point the party member you control will fling his or her bon-bon at the target. What, pray tell, is a bon-bon? It's a floating ball that each sibling possesses (though in an ironic twist, sister Poleena has two of them). Bon-bons can be enhanced in a variety of ways, from the ability to cut through multiple enemies in one toss to adding lightning damage to your standard attack. You can hold the stick a little bit longer before you let go to give your bon-bon some extra oomph, but you need to keep an eye on your energy meter. The longer you hold the stick, the more energy you deplete--and the longer it takes to replenish. This means that you need to weigh the pros and cons of each toss, considering that a quick throw takes some time to reach a distant enemy, whereas a stronger one will get the bon-bon there faster but will also take your meter longer to refill. This is an important consideration because you can't perform any action until your energy gauge is full. You can also make your bon-bon curve and twist in different directions, depending on which direction you push the stick. This can be handy if, for example, you are targeting a rear enemy and don't want your bon-bon to hit an enemy directly in front of it. This sounds slightly strategic, but Opoona's battles are not difficult. Not only will you rarely need to worry about how you curve your bon-bon, but the siblings' spells (here called Forces) will also make quick work of most enemies. The most common challenge occurs when bombs are added to the battlefield; they explode and damage your party if directly attacked. There's a lot to do outside of combat if you are so inclined, though few of the side missions are all that engaging. You can get licenses for fishing and vacuuming, make friends who will send you on fetch quests, find your missing puppies, and more. The problem with most of these tasks is that they are tedious and boring, and sometimes just plain stupid. For example, you will help out a fast-food restaurant by serving up some vegetable juice, sushi, popcorn, and eel rice to its customers (the residents of Landroll have the oddest diets). It's cute the first two or three times; it's mind-numbingly dumb by the time you reach your 10-customer quota. In the case of fortune-telling, you have to figure out whether the image you see in your bon-bon, which does double duty as a crystal ball, is positive or negative. Is a herd of cows flying in the rain a positive sign, or not? What about an old guy doing a sexy dance? The images are funny, sure, but your success is left largely to chance. Finishing the main quest while doing a minimal number of these tasks might take you 25 or 30 hours. You could double this length if you tackle fishing, mining, and other mundane tasks, but all of those tasks add up to needless padding in an RPG that's wanting for depth--not length. The alien world of Landroll is home to some beautiful landscapes. Opoona is brought to life with an appealing and colorful visual design. The character and monster models are clean and simple, and have a nice cel-shaded look. Some of the environments, such as a huge corporate lobby, look bland and are underpopulated. A few other vistas are gorgeous, such as an art museum's towering sculpture and a cavernous concert hall. The sound design is similarly minimal, and it partly succeeds thanks to a lovely, spacey New Age soundtrack. On the other hand, sound effects are far too sparse and understated, which waters down any sense of drama that may have accumulated. For instance, an important late-game scene capped by the casting of a powerful spell wasn't accompanied by any sound effects at all. Opoona emanates a liveliness that will keep even the most jaded role-player from hating it. However, the candy coating goes only so far, and tedious side missions and other frustrating elements sprinkle too much salt onto the sweetness. The first few bites of Opoona are scrumptious, but you'll be full in no time."}