{"ref": "https://www.gamespot.com/reviews/armored-core-formula-front-review/1900-6141418/", "date": "December 17, 2005", "game_name": "Armored Core: Formula Front - Extreme Battle", "text": "Armored Core: Formula Front Extreme Battle brings the hulking masses of metal and firepower to the PSP, and while the esoteric stat-balancing and constant tweaking may dissuade newcomers, Armored Core enthusiasts will be pleased by how well the game stands up on the handheld. If you're looking for an arcade-style robot battle game, you won't find it here. Armored Core is an extremely in-depth simulation that appeals to gearheads rather than button mashers. That said, if you're looking for some stat-heavy mech management, this is definitely your game. Now you can get your giant robot fix on the go. The game puts you in charge of a rookie team of five armored core (AC) units. As an ~architect~ you have to assemble and tune the AC units and use them to square off against other mechs in the futuristic sport known as Formula Front. The majority of the gameplay is found in the garage, where you can outfit your AC units with hundreds of different parts and weapons. When building your robot you have to account for things like energy output, weight, heat, and mobility. Each AC unit has six different stats that you have to balance: attack power, defensive power, mobility, energy supply, cooling, and VS ECM, which is your AC unit's resistance to electronic countermeasures that can be used to disrupt radar and weapon targeting. The trick is to balance those six parameters to achieve a high overall rating. That's much easier said than done though, and it takes a lot of designing, tweaking, and testing to build a fabled S-rank AC unit. There are hundreds of parts available to you right at the start of the game, and because you always have five AC units in your garage, you can have each one tuned for specific purposes. Before each match you can research your opponent, and based on their strengths and weaknesses you can determine which AC unit to use, and exactly how to tune it. You can choose from dozens of heads, arms, legs, generators, and radiators to build the basic structure of your AC. All these parts can be further tweaked by tuning them up, which basically amounts to allocating points to a handful of different stats. When tuning up a radiator you might want to put all the points into cooling to improve performance, or you can put points towards energy drain to make the part operate more efficiently. Once you have the basic structure of your AC you can outfit it with tons of different weapons, including energy blades, plasma cannons, machine guns, rocket launchers, shotguns, sniper rifles, and more. You can choose your weapons based on stats alone, but the performance of each weapon is also important. Blade weapons have high attack power, but if you don't have a nimble enough AC to make close-quarters combat feasible, all those cool energy blades are useless. Building and tuning your AC units comes down to a process of trial and error. Battles can often be won by simply swapping out one kind of gun for another, or by emphasizing mobility over defense. Sometimes you'll find yourself losing to the same opponent several times, only to later make a seemingly minor adjustment and go on to win the match. You'll spend the vast majority of your time with Armored Core: Formula Front in the garage tuning up your AC units, but once in a while you'll actually need to participate in battle. You'll start out battling in the bottom league, and when you fight your way to the top you can move up to the regular league. There you'll start off ranked 31st, and you'll have to battle all the way to the first rank. There are more than 31 battles though, because any opponent you defeat can request a rematch, and by league rules you're obligated to accept. The battles are all three-minute one-on-one encounters set in a variety of venues, from cityscapes to canyons and tiny indoor arenas. The two AC units go at it until one of them runs out of armor points. At the beginning of a match you can choose to control your AC manually, or to let the artificial intelligence do the work. It sounds somewhat unsporting to simply sit back and watch the AI battle, but that's actually the best way to do it. For one, the manual controls are sluggish and difficult to master, which only makes sense because you're controlling massive hulks of machinery. Still, manual battles just aren't much fun. Unless you really spend the time to get a handle on the controls, the opponent AI will usually be able to run circles around you and you'll never have a chance. Another reason to opt for the AI control in battles is that it gives you a whole new robust set of options to tweak and adjust. In fact, there are so many ways to customize your AC unit's AI that you really don't feel like you're sacrificing much control, because you can basically adapt an AC unit's behavior to fit any tactic or strategy you might want to use. You can use sliders to set your AC unit's range, movement, tactics, and actions. These different stats actually have a huge influence on battles, as well. You can replay the same match and get approximately the same result each time, but then you can tweak the AI a bit and get a completely different outcome. In addition to the base character AI, you can equip operations chips, which give your AC unit specific orders for each 30-second block of time during battle. You get these chips by completing battles, and there are quite a few different chips to suit every scenario you can think of. For example, if you think your opponent will rush you at the beginning of a match, you can set an operations chip to have your AC hang back out of range for the first 30 seconds of the match, then set another chip to have your AC use a specific weapon for the next 30 seconds, and so on. Some of the chips have very specific commands, like, ~Attempt to boost over opponent and take up a position behind them.~ Some of the commands are more general, like, ~Move around by using repeated jumping motions.~ As you collect these chips you can exert quite a bit of control over the flow of each battle. Aside from building AC units and tuning AI, there isn't much to this game. There's an ad-hoc wireless mode in which you can connect with a friend and duke it out using your customized units, but aside from that, the entire game takes place in the garage. You can get nasty e-mails from your opponents in the single-player league, which is funny, but there's no kind of story here. The game is all about numbers and stats, but somehow it's still pretty fun, just because there are so many ways to customize your AC units, and because the game does a good job of making your work very visible in the way your AC units perform in battle. What isn't fun is waiting for menus and battles to load. It's frustrating to go from a battle to the garage, where you have to wait for menus to load, and then have to wait even more when you're ready to test out your AC in battle again. Even though most of the time you're looking at menu screens, Formula Front looks great. Each and every part is highly detailed, and it looks really cool to see all those parts add up to create a giant robot. The AC units animate well, and they can even seem graceful as they move around the battlefield. The weapon effects are great as well, and there's quite a variety of explosions, laser beams, missiles, and machine gun rounds to be seen flying around the screen. The environments have a good draw distance, and although they're pretty empty, they look nice. Despite all the action, the frame rate never drops. The menus are all simple and easy to navigate, too, and it quickly becomes second nature to skip from menu to menu as you tune an AC. Gearheads, rejoice: There's a ton of stuff to tweak and tune in this game. The game also sounds pretty good. The explosions and weapon noises are all fairly powerful, and they do a good job of creating a sense of impact on the battlefield. The soundtrack is made up of a bunch of light techno beats that play endlessly in the background. It isn't anything you'll remember after you turn off the game, but it's easy on the ears and fits the theme. Armored Core: Formula Front is a fun game for fans of hardcore simulations, but the steep learning curve and lack of any real action will probably turn off a lot of people. But, if you're familiar with the Armored Core games, this style of gameplay is nothing new to you, and you'll most likely be very satisfied with what you find in Formula Front."}