{"ref": "https://www.gamespot.com/reviews/turok-evolution-review/1900-2879454/", "date": "September 5, 2002", "game_name": "Turok: Evolution", "text": "Before GoldenEye 007, there was Turok: Dinosaur Hunter, one of the early premier first-person shooters on the Nintendo 64. The game's mix of prehistoric surroundings and futuristic weaponry helped introduce console audiences to the FPS genre, and now, Acclaim is revisiting the Turok series on the GameCube with Turok: Evolution. Exactly how much the Turok series has evolved with this latest installment is debatable, but the game does provide a healthy dose of shooting lizards with big guns, and, in the end, that's why we play Turok. Evolution is sort of a prequel to the Turok series. It casts you in the role of Tal'Set, a Native American warrior fighting against the incursions of the United States Army. While Tal'Set is fighting his archrival, Captain Bruckner, on a cliff, a mysterious energy swells up and pulls him into a strange realm called the Lost Land. Tal'Set is rescued by the indigenous people of this primitive world, and from the seer Tarkeen he learns that he is Turok, the legendary Son of Stone sent to battle the villainous reptilian Sleg and their master, Lord Tyrannus. Tal'Set reluctantly accepts this charge and sets out to do battle with the Sleg, Tyrannus, and even the not-quite-dead Captain Bruckner. As in past games, the storyline in Turok: Evolution is passable, but nobody really plays first-person shooters for their stories, anyway, and the plot here serves mainly as an excuse to frag some dinosaurs. The original Turok game's subtitle, ~Dinosaur Hunter,~ may be consistent with the license's comic-book roots, but in Evolution, you won't be battling as many of the massive beasts as you might hope. Most of the game's dinosaurs serve as backdrop elements only, although you'll occasionally have to defend yourself against a couple of raptors or a tyrannosaur. The bulk of the fighting in Evolution is directed at the Sleg, a warlike humanoid-reptilian race with a perplexing command of technology. The upright lizards have overrun the Lost Land, and you'll spend most of the game's 15 chapters engaging in standard run-and-gun shooter combat against them. Periodically, you'll have to engage in some extremely basic forms of puzzle solving, such as finding two switches to open a gate, but for the most part, your single objective is to kill everything that moves and reach the end of the level. Enemy AI is a bit inconsistent in Turok: Evolution. At times, you'll find the Sleg warriors hiding behind cover, rolling out of the way of your shots, falling back to a defensible position--in short, making your life difficult. Other times, though, you'll see silliness like an enemy dinosaur stuck on a piece of the background, making it a pathetically easy kill. We even saw a so-called sniper running around and around in a circle, ad nauseam... until we mercifully removed his head. Generally, the enemies are pretty deadly, but occasionally they can be more droll than dangerous. The shooter levels in Turok: Evolution really don't do anything new for the genre. You do have access to an impressive arsenal, ranging from the primitive club and bow and arrow to the more-futuristic plasma cannon, remote-controlled spider mines, and tekbow, which is a high-tech version of the classic bow and arrow. Evolution tries to incorporate stealth into a few of its levels, but it often comes off as contrived, as the nature of the guns-blazing gameplay and controls make it very difficult to avoid being spotted by enemies. Fortunately, Evolution does feature one major new addition to the Turok series: flying stages. Several times in the game, Tal'Set takes to the back of a pterodactyl armed with, well, .50-caliber machine guns and guided missiles. As silly as that scenario sounds, the flying stages are actually pretty fun and don't feel at all like a last-minute addition to the game. They provide a nice dose of variety when the shooting levels begin to border on monotony. Of course, no first-person shooter released today would be complete without a multiplayer mode, and Turok: Evolution comes with a fully featured one that supports up to four players. It gives you complete control over multiplayer variables like power-ups, available weapons, and one-hit kills. A generous selection of maps is available, and 10 gameplay variations are included. In addition to the standard deathmatch, there's a kill-the-man-with-the-ball game called ~monkey tag,~ a sniper match that allows only headshots, and ~one flag,~ which is a twist on capture the flag. There's even a multiplayer mode involving pterodactyl combat. In all, Evolution's multiplayer activities should keep you busy for a while after you've finished the single-player game. Even before you've hit the multiplayer segment of Turok: Evolution, you can get your money's worth from the single-player campaign. Each of the 15 chapters in the game is pretty lengthy, with multiple sub-levels in each one, and the pterodactyl-piloting stages are interspersed between the on-foot levels evenly enough that you've always got another one coming up fairly soon. From an aesthetic standpoint, Turok: Evolution does its job well. Of course, that job is depicting overgrown, armored lizards armed with laser rifles, but Turok fans have come to expect this. The environments comprise a good mix of lush tropical settings and futuristic industrial locations that span the Lost Land. Visually, Evolution looks like the same sort of techno-jungle that we've seen in previous Turok games, this time with a stark graphical upgrade. In terms of sound, there isn't much of it worth noting. Everything from the weapon blasts to the gravelly enemy voices to the unobtrusive tribal music is quite serviceable but not really outstanding. Your allies' communications in the flying stages can be unintelligible sometimes, unfortunately. When the first Turok game was released, it was a Nintendo exclusive. In this day and age, though, many third-party games are now appearing on all three major consoles, and Turok: Evolution is an adherent of this new trend. Thus, owners of two or three of the systems will probably be wondering which version of Evolution is the one to get. The GameCube version is probably the most well rounded overall, although it's in a close race with the Xbox version. Though the game's visuals are slightly more impressive in the Xbox version, the frame rate is generally much higher in the GameCube version. This makes the game easier to play, as the smoother frame rate contributes to more responsive controls. The C stick on the GameCube's controller also seems to make aiming more precise, although this could also be due to the frame rate. If you own both a GameCube and an Xbox, which version you prefer may be a tossup based on your controller preference and whether you value performance or image quality more highly. However, you should also consider that the loading times are faster in the Xbox version. The PS2 version of Turok: Evolution has no real advantages over the other two. You won't find much that's new in Turok: Evolution, but if you're a fan of the series, you'll find what you're looking for. The game has the typical drawbacks--it can be a bit difficult or repetitive at times, the enemy AI sometimes exhibits laughable behavior, and the controls suffer from the same awkwardness that plagues most console shooters. If this is your kind of game, however, you'll be able to take these minor flaws in stride and have a good time with Turok: Evolution."}