{"ref": "https://www.gamespot.com/reviews/sega-smash-pack-volume-1-review/1900-2705680/", "date": "April 6, 2001", "game_name": "Sega Smash Pack Volume 1", "text": "Sega Smash Pack Volume 1 is Sega's latest pack-in software, available only when you purchase a Dreamcast. It contains several classic Sega Genesis games, as well as Virtua Cop 2 and the previously available freebie, Sega Swirl. While this all may sound like a great value, every single one of the ports is incredibly poor, resulting in nothing but disappointment for anyone looking to replay any of these classic games.The disc contains the following Genesis games: Sonic the Hedgehog, Vectorman, Altered Beast, Golden Axe, Revenge of Shinobi, Streets of Rage 2, Columns, Phantasy Star 2, Shining Force, and Wrestle War. The 16-bit Genesis games are all emulated, which, if done properly, should deliver an almost exact duplicate of the original game's presentation. In terms of graphics and gameplay, the games are mostly correct. Even the games' hidden features are present, such as Revenge of Shinobi's infinite-shuriken mode. However, the sound in all the Genesis games has been horribly butchered. Golden Axe is one of the most clear-cut examples, but all the Genesis games sound more like Sega Master System games at best and Atari 2600 games at worst. The music is horribly rendered. Rich sound effects have been replaced with monotone beeps and boops, and what little speech the original games had is usually played back at the wrong pitch. But the inaccuracy doesn't stop there. Some games, most notably Sonic the Hedgehog, have slowdown that wasn't present in the Genesis original. You'd think a 128-bit powerhouse like the Dreamcast would be able to perfectly duplicate the 16-bit Genesis experience and that Sega would be able to emulate its own system with a little more accuracy, but this is definitely far from the case.Virtua Cop 2 is taken from the early 2000 Japanese Dreamcast release, which is essentially a shoddy port of the PC version of the game. The game plays reasonably well, but it only looks marginally better than the Saturn version and not nearly as good as the arcade release of the game. Sega Swirl is the same game that has been available for free in magazine and in-store demos for quite some time. It's a basic, no-frills puzzle game that you'll either enjoy or despise. Different-colored swirls sit in a well on your screen. Clicking on one swirl eliminates it, as well as any other like-colored swirls that are connected to it. The idea is to get the largest color combos possible while refraining from eliminating only one swirl per click, which subtracts points from your score. There are a few different options in the game, including the ability to play turn-based matches against a PC-based player via e-mail.In the end, the extra $20 you have to pay to get a Dreamcast with the Smash Pack disc included could be better spent on other games, especially when you consider the DC's rich budget lineup. If you're after the classic games on this disc, do yourself a favor and just purchase a Genesis and some used carts."}