{"ref": "https://www.gamespot.com/reviews/dragon-ball-z-taiketsu-review/1900-6085911/", "date": "December 18, 2003", "game_name": "Dragon Ball Z: Taiketsu", "text": "Dragon Ball Z: Taiketsu is a 2D fighting game based on Akira Toriyama's manga-turned-anime series, and it is downright awful. Atari showed how willing it was to turn a quick buck off the Dragon Ball Z name earlier this year when it released the 8-year-old Dragon Ball Z: Ultimate Battle 22 for the PlayStation, and Taiketsu is as offensively bad. Perhaps even more so, since the age of Ultimate Battle 22 could be blamed for its terrible quality, while Taiketsu is a brand-new title. Dragon Ball Z: Taiketsu plays as bad as it looks. And it looks terrible. The selection of fighters in Taiketsu is a predictable mix of heroes and villains from across the Dragon Ball Z timeline, with the only real surprise being the inclusion of Broly. The combat in Taiketsu is on the verge of being totally broken. For starters, the hit boxes are wildly inconsistent, causing some erratic behavior--characters will slide across the screen seemingly at random, and they'll regularly pop over to the other side of one another when in close-quarters combat. The actual fighting itself is sloppy and simplistic, with every character only having a few combos and a special move or two of its own, outside of the catalog of punches and kicks that all of the characters share. The only component of Taiketsu that's even moderately original is the sky battle mode, where both characters will jump into the air and exchange a quick volley of punches and kicks, but all you need to do to come out on top here is mash buttons. Actually, the gameplay is so sloppy and the artificial intelligence so simplistic that all you need to do at any point in Taiketsu is mash buttons. The game also contains link cable support, so you can play this mess with a friend, if you're so inclined. While playing with a friend takes the sloppy AI out of the way, it really isn't any more fun. The game's presentation mirrors the dearth of depth and finesse in the gameplay, featuring large, pixilated versions of what appear to be prerendered 3D sprites with really choppy animations. Even when standing still, the sprites look uniformly bad, most of them only resembling their hand-drawn counterparts when you really squint your eyes. Some of the backdrops are reminiscent of familiar Dragon Ball Z locations, like Kame's tower, but a lot of them just sort of look like bad abstract prerendered 3D art projects. The game's music could have easily been stolen from one of a dozen generic 16-bit 2D fighters, and the sound effects are unwaveringly tinny and indistinct. You'll be hard pressed to find a GBA fighting game as lousy as this. Dragon Ball Z: Taiketsu is a very bad game. The GBA might not seem like the ideal home for fighting games, but there is a small library of fighting games that are worlds better than this one. There's virtually nothing to the game that suggests that any real effort or care went into Taiketsu's creation, and every facet of its execution--the sound, the graphics, the combat--feels unfinished. All in all, Atari and Webfoot have combined to deliver a game that not even the series' hardcore fans can enjoy."}