{"ref": "https://www.gamespot.com/reviews/espn-x-games-skateboarding-review/1900-2804370/", "date": "August 14, 2001", "game_name": "ESPN X Games Skateboarding", "text": "While the freestyle sports craze popularized by Tony Hawk's Pro Skater has hit just about every platform available, aside from a couple of snowboarding games, the PlayStation 2 has remained fairly ~extreme~ free. Konami has the honor of breaking in the PlayStation 2 as a platform for skateboarding games with its ESPN-licensed game, X Games Skateboarding. Like most modern skateboarding games, X Games borrows enough control and design mechanics from the Tony Hawk series to make it feel similar, but shoddy control, random frame rates, and unfocused level design make Konami's skateboarding game a prime target for a three-day rental. Like any other skateboarding or BMX game currently on the market, X Games has a goal-based mode that challenges you to complete a set of objectives in each level. Each level has six goals. Two are score based, one is a series of checkpoints, one involves smashing a set of specific objects found throughout the level, one challenges you to do a long combo, and the last involves finding and grabbing a spinning X Games logo hidden somewhere in the level. Each goal earns you a license, and each level is unlocked by earning a certain number of licenses. The levels in this mode range from realistic street-based levels like hilly San Francisco or the suburbs of Los Angeles to more fantasy-based levels like a museum complete with grindable dinosaurs or a boat done up to look like the Titanic. While the levels are decent in theory, in execution, they suffer from boring design. There aren't many good, long trick lines in the levels, and some levels, like the museum, have way too many short sets of steps in them, which can be just enough to totally stop your momentum. While the game has its goal-based arcade mode, the game's main mode is the X Games mode, which puts you into an authentic X Games skateboarding competition. You can choose between two different levels, vert and street. Each one lets you skate for one minute and then judges your performance. Neither competition is particularly challenging, and anyone who has spent the time it takes to get used to the game's mushy control should be able to get a gold medal in both levels without much effort. Additional modes include a practice mode, a small tutorial, and a few two-player competitions. From a control standpoint, the game plays roughly the same as Tony Hawk's Pro Skater, with a few additions. For example, you must hold up to continue kicking and gaining momentum. Also, there are three different air trick buttons, as opposed to Tony Hawk's two. Square is used for flip tricks, L1 and R1 are used for grabs, and circle is used for air tricks. A few tricks are a little more complicated to do than simply pushing a direction and hitting a button. A McTwist, for example, requires you to spin two full circles on the D-pad and push the circle button. While the game features more trick buttons, that doesn't automatically translate to more tricks, as you use only the four compass directions for tricks, not the diagonals. As a whole, the game feels a little stiff. Turning isn't quite as sharp as you'd want it to be, even when your board is adjusted for better turning. The skaters auto-center themselves on vert tricks, so as long as you let go of the spin and trick buttons with enough time for your skater to auto-correct, you'll land every single trick. The game doesn't really have any clear-cut way to link tricks together for Tony Hawk 2-like endless combos. You land into a manual, but the game doesn't let you ollie out of a manual into another trick. Finally, the game rewards button-mashing on vert tricks, making it easy to put together decent air combos.Like most other skateboarding games, X Games features professional skaters. The roster is crowned by former Tony Hawk skater Bob Burnquist, and he is joined by Colin McKay, Chris Senn, Kerry Getz, Carlos De Andrade, Lincoln Ueda, Chad Fernandez, and Rick McCrank. Each skater has two costumes, and you can unlock extra boards by finding them in the arcade mode levels. However, aside from some slight statistical differences that affect speed, turning, and ollie height, the skaters play identically. Outside of four skater-specific tricks, each skater has the same exact trick set--even the four special tricks are done the same way for each skater. What's more, the developers couldn't even be bothered to name all the tricks--aside from your superspecial trick, which totally empties your special meter, the other three tricks are generically named (for example, ~special grab~). From a presentation standpoint, Skateboarding puts on a pretty weak show. The character models look OK and animate reasonably well, but their surroundings don't fare quite so well. The environments are a little bland, and the larger outdoor arenas are plagued by extremely noticeable draw-in. As you skate up the street in the suburbs, you'll see houses quickly fade into view at an unacceptably close distance. To make matters worse, the frame rate will occasionally take a major dive, usually when you're doing something as simple as wallriding or wrecking. When you combine the slowdown with the pop-up, the resulting game is one that seems almost unfinished at times. While the game's sound effects are pretty bland, the soundtrack picks up a bit of the slack, featuring tracks by bands such as American Hi-Fi, Linkin Park, New Found Glory, Voodoo Glow Skulls, and Sum 41, which contributes ~Fat Lip,~ the same song that recently appeared in THQ's PS2 motocross game, MX 2002. In the end, ESPN X Games Skateboarding is a pretty weak game. With poor control, counterintuitive level design, and drab graphics, X Games Skateboarding is best suited for skateboarding fans looking for a quick fix in the form of a rental. Save your money and wait for something better to come along.Like most other skateboarding games, X Games features professional skaters. The roster is crowned by former Tony Hawk skater Bob Burnquist, and he is joined by Colin McKay, Chris Senn, Kerry Getz, Carlos De Andrade, Lincoln Ueda, Chad Fernandez, and Rick McCrank. Each skater has two costumes, and you can unlock extra boards by finding them in the arcade mode levels. However, aside from some slight statistical differences that affect speed, turning, and ollie height, the skaters play identically. Outside of four skater-specific tricks, each skater has the same exact trick set--even the four special tricks are done the same way for each skater. What's more, the developers couldn't even be bothered to name all the tricks--aside from your superspecial trick, which totally empties your special meter, the other three tricks are generically named (for example, ~special grab~). From a presentation standpoint, Skateboarding puts on a pretty weak show. The character models look OK and animate reasonably well, but their surroundings don't fare quite so well. The environments are a little bland, and the larger outdoor arenas are plagued by extremely noticeable draw-in. As you skate up the street in the suburbs, you'll see houses quickly fade into view at an unacceptably close distance. To make matters worse, the frame rate will occasionally take a major dive, usually when you're doing something as simple as wallriding or wrecking. When you combine the slowdown with the pop-up, the resulting game is one that seems almost unfinished at times. While the game's sound effects are pretty bland, the soundtrack picks up a bit of the slack, featuring tracks by bands such as American Hi-Fi, Linkin Park, New Found Glory, Voodoo Glow Skulls, and Sum 41, which contributes ~Fat Lip,~ the same song that recently appeared in THQ's PS2 motocross game, MX 2002. In the end, ESPN X Games Skateboarding is a pretty weak game. With poor control, counterintuitive level design, and drab graphics, X Games Skateboarding is best suited for skateboarding fans looking for a quick fix in the form of a rental. Save your money and wait for something better to come along."}