{"ref": "https://www.gamespot.com/reviews/xyanide-review/1900-6120724/", "date": "March 21, 2005", "game_name": "Xyanide", "text": "This is it. Mobile gaming goes hardcore. After two years of meekly courting the casual player, someone has cracked. Dutch developer Playlogic has taken its own European Xbox blaster, Xyanide, and reinterpreted it for Java handsets with not so much as a nod toward the casual audience. The 3D original may be laden with modern graphical and gameplay features, but this version takes some inspiration from Konami's seminal 1985 arcade shooter, Gradius. Xyanide is an uncompromising, irreverent, and beautifully realized monster of a game. If you aren't up for a challenge, you should probably sit this one out. The game delivers 12 stages of rock-hard horizontally scrolling 2D action. The grueling waves of enemy fighters are punctuated only by six nightmarish end-of-level boss encounters. You know you are in '80s territory when the story, so central to the Xbox rendition, is cast aside in a few paragraphs of explanatory text, never to be mentioned again. It goes something like this: The inhabitants of the planet Mardar have sentenced evil space witch, Aguira, to death. Unconventionally, the favored method of execution in this part of the galaxy is to lock the convict on a spaceship and send it hurtling into a black hole. Mardar's greatest star fighter, known only as Drake, accompanies the craft, just to be on the safe side. But en route, Aguira's ship is hit by an asteroid containing xyanide, a substance that turns thoughts into matter. Instantly, she conjures up an armada of attack craft to pulverize Drake while she makes good her escape. You play Drake. You shoot stuff. You keep shooting stuff for many, many hours. The game's main debt to shooters of the past is the central power-up system, which more or less provides the tactical heart of the game. You start with a basic primary weapon, but every time you take out an entire enemy attack wave, a power-up icon appears, giving you access to a more interesting alternative. Flying over the icon marked ~L~ gets you the laser cannon, while ~S~ delivers a spread shot, and ~C~ provides a charger weapon (keep the 5 key depressed and the beam charges up to deliver a devastating death ray). It's also possible to collect two secondary weapons--a homing missile launcher and a floating orb--both of which take out enemies behind, above, and below you while you concentrate your primary fire on what's in front. Like Raiden, if you pass over the same icon again, you increase the power of the weapon. You can do this several times, creating a staggeringly destructive beast that blasts through anything daft enough to come at you. However, if at any point you fly over a different icon, you take on that weapon at its lowest setting and then start building up again. Throughout each level, you also encounter wild card icons that power up any weapon you have, as well as some particularly evil icons, marked by a broken heart image, which drop you right back down to your basic primary weapon. As veteran shoot-'em-up fanatics will attest, this system adds many layers of depth to the whole experience. You'll find yourself having to avoid unwanted icons (as well as bullets and incoming craft) if you want to keep hold of your supercharged blaster, so powering up means having to pick a more-troubled route through the action. On the plus side, the multiple power-up structure allows you to choose a weapon route that suits your method of play. Plus, after you have been through the same stage a number of times, you'll know how to tailor your weapons for the specific enemies or boss characters you know you're going to have to face later on. It's a rigorous challenge to your planning skills as well as to your immediate dexterity and accuracy. Making things just that bit more difficult is the fact that you have no diagonal movement. Avoiding incoming ships often involves a tricky sequence of precise incremental movements--up then left, up then left, up then left--across the screen. Also, the Nokia 6600's tiny display means utter claustrophobia. There's no margin for error. Movements have to be exact--a fraction of a millimeter can separate you from destruction or escape. Unforgiving? The word doesn't do this game justice. Fortunately, Playlogic isn't entirely heartless. You have a generous shield to protect against enemy fire, and this can be recharged with pickups. You can also gain extra lives throughout each stage. Most primary weapons autofire, so you don't have to keep punching the 5 key--although this will improve your fire rate, so you will do it anyway. Mercifully, once you've completed a level, it becomes selectable from the main menu, so you don't have to play from the beginning every time you load up. This is a vital acknowledgement that you don't always have the luxury of playing from beginning to end with mobile games. Will you want to spend a few hours with a retro blaster? You will when you see Xyanide in motion. Even when the screen is thick with bullets, explosions, and swooping spacecraft, the animation is slick and surprisingly consistent. Attack waves are varied, ranging from tiny craft that hug the edges of the screen to bulky battleships that barge down the middle, making way for no one. In between, you get ships that spin across the screen, streaming from top to bottom, bottom to top, or splitting rank and exploding off in multiple directions. You get ships that suddenly speed up or slow down, ships that spiral out from behind you in enormous attack arcs, and ships that just bob up and down blasting at you, creating a slalom of fizzing electronic death. Besides the basic attack waves, there are other enemies lurking on each stretch of the journey. As in R-Type, you get the sneaky, hard-to-spot walkers that trudge along the base and top lines of the screen, subtly firing deadly homing bullets at you. Then there are the indestructible space mines, which blast out bullets all around themselves. There are devices that run parallel to each other along steel rails, trailing an energy-zapping force field between them. It means there's never anywhere on the screen to hide. You just have to keep moving, anticipating, reading enemy movement, and reacting in a nanosecond. End-of-level bosses range from massive destroyer craft with lone weak spots to bouncy, spiky organic balls and pure, starlike energy spheres that just need to be blasted continuously until they explode (while you avoid their ceaseless streams of deadly laser fire, of course). There's nothing particularly new--you've seen all this before from Gradius all the way through to, well, Gradius V on the PS2--but as a ~best of alien attack strategies~ compilation, Xyanide is authoritative and intricately researched. Careful, Drake. Careful. The backgrounds provide typical sci-fi shooter fare--various tunnels and corridors, all well drawn and well colored with some excellent parallax scrolling to add depth. On stage 11 for example, you're speeding through a vast cavern with several layers of stalagmites and stalactites in the background and huge steel supports in the foreground, so that the environment seems to surround your craft. Add a decent range of sound effects for different weapons and explosions, and a John Carpenter-style sinister synth soundtrack, and that, ladies and gentlemen, is Xyanide. For newcomers to the genre, and those used to downloading more-sedate fare to their handsets, this is going to be a shocking wake-up call. The action is demanding, unyielding, invigorating, and frustrating. Fans of the shooter genre need to get this one as soon as possible."}