{"ref": "https://www.gamespot.com/reviews/final-fantasy-ix-review/1900-2605459/", "date": "July 19, 2000", "game_name": "Final Fantasy IX", "text": "Final Fantasy IX has been billed as a return to the series' roots, but this is an oversimplification. The roots of the Final Fantasy series have always been appealing characters, an epic story, engaging battles, and an impressive presentation. Elements such as airships, pointy-hatted mages, and crystals have always just been surface symbols, while an emotional tale of humanity in the face of adversity lies at the core of each installment of the series. That's not to say that the return to the older art style is unimportant or without meaning. Final Fantasy VII boosted the role-playing game market on two new continents, and Final Fantasy VIII sold the most copies of any game in the series. Both games were critically acclaimed. So why tinker with a winning formula? The game itself no doubt holds the answer. The story begins on the Mist Continent in the Kingdom of Alexandria. The puckish Zidane, a member of a rogue group and theater troupe called Tantalus, reviews the group's plan to capture Princess Garnet Til Alexandros XVII from an upcoming festival. Meanwhile, the young black mage Vivi wants to see a popular romance play (I Want To Be Your Canary), but his ticket turns out to be a fake. With some help from street rat Puck (who's literally a rat), he sneaks into the show. During the performance, Zidane and company attempt to make off with Garnet, rousing the ire of royal bodyguard Adelbert Steiner. Steiner tries to protect Garnet from Zidane's kidnapping and womanizing ways, but to no avail. That's because Garnet actually wants to be kidnapped. After all, her mother, the once peaceful Queen Brahne, has been attacking neighboring kingdoms with her army of black mages. Perhaps the answers Garnet seeks lie outside the walls of Alexandria. Final Fantasy IX is even more story-driven than previous games in the series. The plot often switches focus between different characters or parties. One particularly exciting sequence on the second disc features two separate parties trying to escape a sticky situation. The game cuts between the two parties and builds an incredible sense of tension. Moreover, changing circumstances force characters to switch from one party to the other, which creates a real sense of dynamic teamwork. Final Fantasy IX is filled with creatively scripted set pieces that ensure that the player gets to know and use every character. However, when the story drags, or when your party seems particularly unbalanced, the scripting can seem overly heavy-handed, and you may find yourself wishing for more freedom. It's not until disc three that you can truly pick and choose your party members at will. While the art style may have reverted to that of the earlier Final Fantasies, the storytelling - thankfully - has not. The suitably complicated plot explores many ideas and emotions - love, death, hope, fear, and even the nature of existence -and your party members learn about these things and more as they seek answers to the questions that drive them. No matter how bizarre each member of your party might appear, each one is actually a fully realized character whose fantastic appearance belies his or her depth of character. Throughout Final Fantasy IX, even characters like elderly rat women, obese clown chefs, and young moogle girls all have very human feelings. But while the characters may be interesting, the game's main storyline is weak by comparison. A large part of the game simply consists of proceeding from area to area with little or no impetus to continue, and the main villain is almost assuredly the least threatening in the series' history.One welcome addition that Final Fantasy IX brings to the series is a strong sense of humor. More than any other Final Fantasy to date, Final Fantasy IX is filled with moments that are sure to make you laugh. The dialogue and situations are frequently amusing, and almost every character has an amusing personality trait. Some of these are Zidane's instinctive womanizing, Steiner's unflappable obstinacy, Garnet's attempts to ~fit in~ with commoners, Vivi's clumsiness and endless angst, Quina Quen's single-minded search for delicious food, 9-year-old Eiko's take-charge presence, and Amarant's laissez-faire attitude toward everything. Even when it's not trying to make you laugh, the game is still lighthearted - it doesn't just try to impress or overwhelm you. The gameplay has been tweaked so that Final Fantasy IX has one of the more balanced combat systems of any game in the series. Each character that joins your party has a character class and unique skills. For instance, Zidane is a thief. Garnet is a white mage and summoner, Vivi is a black mage, Steiner is a knight, Freya is a dragoon, Quina learns blue magic (which consists of enemy techniques) by eating opponents, Eiko is also a white mage and summoner (but focuses more on curative magic), and Amarant uses ~flair~ techniques and can throw weapons. You expand on these basic character types by equipping objects on your characters. The weapons, armor, hats, wrist guards, boots, and accessories you find all contain particular abilities. If a character equips an item with an ability he or she can use, that ability becomes accessible. Different characters can draw out different abilities from the same item, and sometimes an item won't provide an ability at all. Winning battles earns your characters experience and ability points (AP). Earn enough AP while an ability is equipped, and you ~master~ the ability, which allows the character to access the ability even when the item has been removed. Some abilities, such as spells and special techniques, become innate and can be activated by spending magic points. Other more passive types of abilities, such as auto-potion, counter, and resistances to status ailments, exist only in a potential form. You must assign these skills using ability crystals in order for them to become effective. The number of ability crystals a character has increases with the character's level. The item-ability system establishes an excellent balance between individual character skills and player customization. Moreover, the addition of ability crystals prevents players from creating invincible, overpowered characters who have mastered every skill in the game. While not as complex as either the materia or junction systems of the previous two Final Fantasy games, Final Fantasy IX's system is sure to satisfy players who like to micromanage, as well as those who just want to play the damned game already. The battle system itself has been re-expanded to permit four simultaneous party members, as opposed to three as in the previous two installments. The larger party size permits more possible interactions with the enemies and with each other, which makes for more interesting battles. Since characters are more specialized in Final Fantasy IX than in recent games in the series, the larger party size goes a long way toward making the battles more tactical. Also, the preordained parties used at many points in the game have let the game designers carefully balance many of the larger boss battles. Limit breaks return in the form of the trance system. As characters receive damage, their trance meter fills, and once the meter is full, the character enters a trance. Tranced characters have glowing skin, a more powerful appearance, and access to a new set of techniques and skills. The series' trademark summoning spells also return. Called eidolons in Final Fantasy IX, they appear with all the visual flair and over-the-top destruction that series fans, as well as detractors, have come to expect. Fortunately, after a few uses, the eidolons' animations are truncated to a short splash-damage effect.One welcome addition that Final Fantasy IX brings to the series is a strong sense of humor. More than any other Final Fantasy to date, Final Fantasy IX is filled with moments that are sure to make you laugh. The dialogue and situations are frequently amusing, and almost every character has an amusing personality trait. Some of these are Zidane's instinctive womanizing, Steiner's unflappable obstinacy, Garnet's attempts to ~fit in~ with commoners, Vivi's clumsiness and endless angst, Quina Quen's single-minded search for delicious food, 9-year-old Eiko's take-charge presence, and Amarant's laissez-faire attitude toward everything. Even when it's not trying to make you laugh, the game is still lighthearted - it doesn't just try to impress or overwhelm you. The gameplay has been tweaked so that Final Fantasy IX has one of the more balanced combat systems of any game in the series. Each character that joins your party has a character class and unique skills. For instance, Zidane is a thief. Garnet is a white mage and summoner, Vivi is a black mage, Steiner is a knight, Freya is a dragoon, Quina learns blue magic (which consists of enemy techniques) by eating opponents, Eiko is also a white mage and summoner (but focuses more on curative magic), and Amarant uses ~flair~ techniques and can throw weapons. You expand on these basic character types by equipping objects on your characters. The weapons, armor, hats, wrist guards, boots, and accessories you find all contain particular abilities. If a character equips an item with an ability he or she can use, that ability becomes accessible. Different characters can draw out different abilities from the same item, and sometimes an item won't provide an ability at all. Winning battles earns your characters experience and ability points (AP). Earn enough AP while an ability is equipped, and you ~master~ the ability, which allows the character to access the ability even when the item has been removed. Some abilities, such as spells and special techniques, become innate and can be activated by spending magic points. Other more passive types of abilities, such as auto-potion, counter, and resistances to status ailments, exist only in a potential form. You must assign these skills using ability crystals in order for them to become effective. The number of ability crystals a character has increases with the character's level. The item-ability system establishes an excellent balance between individual character skills and player customization. Moreover, the addition of ability crystals prevents players from creating invincible, overpowered characters who have mastered every skill in the game. While not as complex as either the materia or junction systems of the previous two Final Fantasy games, Final Fantasy IX's system is sure to satisfy players who like to micromanage, as well as those who just want to play the damned game already. The battle system itself has been re-expanded to permit four simultaneous party members, as opposed to three as in the previous two installments. The larger party size permits more possible interactions with the enemies and with each other, which makes for more interesting battles. Since characters are more specialized in Final Fantasy IX than in recent games in the series, the larger party size goes a long way toward making the battles more tactical. Also, the preordained parties used at many points in the game have let the game designers carefully balance many of the larger boss battles. Limit breaks return in the form of the trance system. As characters receive damage, their trance meter fills, and once the meter is full, the character enters a trance. Tranced characters have glowing skin, a more powerful appearance, and access to a new set of techniques and skills. The series' trademark summoning spells also return. Called eidolons in Final Fantasy IX, they appear with all the visual flair and over-the-top destruction that series fans, as well as detractors, have come to expect. Fortunately, after a few uses, the eidolons' animations are truncated to a short splash-damage effect.Final Fantasy IX also features a lot more minigames and diverting events than its predecessors. Everyone in the world seems to play Tetra Master, a souped-up version of Final Fantasy VIII's card battle game. Unfortunately, Final Fantasy VIII's enjoyable diversion has been turned into an unplayable nightmare. There's no longer any real reason to play the card game, but worst of all, Tetra Master literally has no rules. The game tells players to ~discover them for yourself,~ though most players may instead opt to not play Tetra Master at all. Otherwise, your party members can take time off to jump rope with schoolchildren, visit a high-stakes auction house, deliver letters for the network of moogles around the world, and generally comb the four corners of the world in search of things to do. Graphically, Final Fantasy IX is slightly improved over Final Fantasy VIII. The backgrounds are rich, vibrant, and realistic. Many backgrounds are animated, which further increases the amount of visual detail. The in-game character models are slightly less detailed than those found in Chrono Cross - no doubt because there are four player characters onscreen instead of three. The full motion video cutscenes are as detailed as those in Final Fantasy VIII, though of course the characters themselves don't look as real. Square has been pushing the limits of what the PlayStation can reasonably do for quite a while, so it's difficult to see much improvement over previous games. Even so, Final Fantasy IX is one of the most graphically impressive games available on the console. Unfortunately, Final Fantasy IX is unable to shake the PlayStation Final Fantasy audio curse. As with Final Fantasy VII and VIII, the music arrangements are distinctly synthesized and sound 16-bit. When Square's other teams are producing soundtracks like those in Final Fantasy Tactics, Xenogears, and Chrono Cross, there's no excuse for the sound quality of the company's marquee title to suffer so much. Even longtime series composer Nobuo Uematsu's compositions seem to be languishing. Save for a few standout tunes on the later discs, most of the songs are forgettable. Also, the sound effects are taken from the same Foley CD Square's been using since Final Fantasy IV. After playing through four discs of Final Fantasy IX, the reason behind Square's return to the graphical style of old should be very clear: nostalgia. Nearly every element of Final Fantasy IX seems designed to trigger a nostalgic response in series fans. Plot sequences, characterizations, and environments will evoke warm feelings of dj vu if you've played the older games. Final Fantasy IX's world, like that of every Final Fantasy, is distinct from the rest. Nevertheless, both obscure and specific references abound to everything from the first Nintendo-era Final Fantasy to last year's Final Fantasy VIII. Final Fantasy IX is like a sprawling, gushing love letter from Square to series fans. Of course it's not enough to say ~I love you~ and expect reciprocation. Every turn of phrase and word choice counts - and it's here that Square's localization has failed its faithful fans. The translation of Final Fantasy IX is technically competent. The dialects are accurate (if sometimes overdone), the dialogue flows naturally and never seems forced or stilted, and the text is grammatically correct and spelled properly. But the devil is in the details, and it's here that Final Fantasy IX is exceedingly sloppy. On many occasions a reference or allusion to a previous Final Fantasy game is localized in a manner that differs from that of the original. Sometimes the astute series aficionado can puzzle out what the game is trying to reference, while other times the original intent of the game designers has been lost entirely. This normally wouldn't be much cause for alarm, but in a game as steeped in nostalgia as Final Fantasy IX, it can completely undermine the designers' intended effect. When the storyline dragged, the Japanese version would depend on nostalgia to carry you forward. Now, English-speaking audiences have been denied even that simple pleasure - ~Rally-ho!~ indeed.Final Fantasy IX also features a lot more minigames and diverting events than its predecessors. Everyone in the world seems to play Tetra Master, a souped-up version of Final Fantasy VIII's card battle game. Unfortunately, Final Fantasy VIII's enjoyable diversion has been turned into an unplayable nightmare. There's no longer any real reason to play the card game, but worst of all, Tetra Master literally has no rules. The game tells players to ~discover them for yourself,~ though most players may instead opt to not play Tetra Master at all. Otherwise, your party members can take time off to jump rope with schoolchildren, visit a high-stakes auction house, deliver letters for the network of moogles around the world, and generally comb the four corners of the world in search of things to do. Graphically, Final Fantasy IX is slightly improved over Final Fantasy VIII. The backgrounds are rich, vibrant, and realistic. Many backgrounds are animated, which further increases the amount of visual detail. The in-game character models are slightly less detailed than those found in Chrono Cross - no doubt because there are four player characters onscreen instead of three. The full motion video cutscenes are as detailed as those in Final Fantasy VIII, though of course the characters themselves don't look as real. Square has been pushing the limits of what the PlayStation can reasonably do for quite a while, so it's difficult to see much improvement over previous games. Even so, Final Fantasy IX is one of the most graphically impressive games available on the console. Unfortunately, Final Fantasy IX is unable to shake the PlayStation Final Fantasy audio curse. As with Final Fantasy VII and VIII, the music arrangements are distinctly synthesized and sound 16-bit. When Square's other teams are producing soundtracks like those in Final Fantasy Tactics, Xenogears, and Chrono Cross, there's no excuse for the sound quality of the company's marquee title to suffer so much. Even longtime series composer Nobuo Uematsu's compositions seem to be languishing. Save for a few standout tunes on the later discs, most of the songs are forgettable. Also, the sound effects are taken from the same Foley CD Square's been using since Final Fantasy IV. After playing through four discs of Final Fantasy IX, the reason behind Square's return to the graphical style of old should be very clear: nostalgia. Nearly every element of Final Fantasy IX seems designed to trigger a nostalgic response in series fans. Plot sequences, characterizations, and environments will evoke warm feelings of dj vu if you've played the older games. Final Fantasy IX's world, like that of every Final Fantasy, is distinct from the rest. Nevertheless, both obscure and specific references abound to everything from the first Nintendo-era Final Fantasy to last year's Final Fantasy VIII. Final Fantasy IX is like a sprawling, gushing love letter from Square to series fans. Of course it's not enough to say ~I love you~ and expect reciprocation. Every turn of phrase and word choice counts - and it's here that Square's localization has failed its faithful fans. The translation of Final Fantasy IX is technically competent. The dialects are accurate (if sometimes overdone), the dialogue flows naturally and never seems forced or stilted, and the text is grammatically correct and spelled properly. But the devil is in the details, and it's here that Final Fantasy IX is exceedingly sloppy. On many occasions a reference or allusion to a previous Final Fantasy game is localized in a manner that differs from that of the original. Sometimes the astute series aficionado can puzzle out what the game is trying to reference, while other times the original intent of the game designers has been lost entirely. This normally wouldn't be much cause for alarm, but in a game as steeped in nostalgia as Final Fantasy IX, it can completely undermine the designers' intended effect. When the storyline dragged, the Japanese version would depend on nostalgia to carry you forward. Now, English-speaking audiences have been denied even that simple pleasure - ~Rally-ho!~ indeed.The taste of nostalgia is always bittersweet, so you might end up feeling that Final Fantasy IX signals the end of an era. At times, the force of the series' heritage threatens to overwhelm the narrative, and the game teeters dangerously close to becoming some sort of meta-RPG about the Final Fantasy series. Allegedly Square internally debated if Final Fantasy IX should have been released as a main series title or as a side story. The concern seems valid, because at times, the way Final Fantasy IX encompasses all that has come before makes it feel as if it exists outside of the main series. For fans of traditional role-playing games, the forthcoming Final Fantasy X's drastic design shifts and Final Fantasy XI's online-only focus are the writing on the wall. After the aesthetically revolutionary Final Fantasy VII and the dramatic maturity of Final Fantasy VIII, the complacent Final Fantasy IX may seem like somewhat of a throwback. But some players may not mind one bit, as they prefer a polished if traditional role-playing game over the sometimes awkward consequences of more original play mechanics. Final Fantasy IX serves as a coda to the series as you know it - it's a summation of everything that players have enjoyed about the past ten years of Final Fantasy games. The taste of nostalgia is always bittersweet, so you might end up feeling that Final Fantasy IX signals the end of an era. At times, the force of the series' heritage threatens to overwhelm the narrative, and the game teeters dangerously close to becoming some sort of meta-RPG about the Final Fantasy series. Allegedly Square internally debated if Final Fantasy IX should have been released as a main series title or as a side story. The concern seems valid, because at times, the way Final Fantasy IX encompasses all that has come before makes it feel as if it exists outside of the main series. For fans of traditional role-playing games, the forthcoming Final Fantasy X's drastic design shifts and Final Fantasy XI's online-only focus are the writing on the wall. After the aesthetically revolutionary Final Fantasy VII and the dramatic maturity of Final Fantasy VIII, the complacent Final Fantasy IX may seem like somewhat of a throwback. But some players may not mind one bit, as they prefer a polished if traditional role-playing game over the sometimes awkward consequences of more original play mechanics. Final Fantasy IX serves as a coda to the series as you know it - it's a summation of everything that players have enjoyed about the past ten years of Final Fantasy games."}