{"ref": "https://www.gamespot.com/reviews/return-to-mysterious-island-review/1900-6114402/", "date": "May 17, 2006", "game_name": "Return to Mysterious Island", "text": "Resurrecting popular works of fiction has long been a favorite pastime of adventure game developers, but few such adaptations have been as successfully realized as Return to Mysterious Island. Just like the 19th-century Jules Verne novel that inspired it, this game works both as a sci-fi saga and an earthy tale about surviving as a castaway on a deserted island in the South Seas. Aside from a few overly convoluted puzzles and some other flaws common to traditional adventure games, puzzle-solving doesn't get much more captivating than this. What would an adventure on a tropical island be without a simian sidekick? Readers familiar with Verne's classic The Mysterious Island will particularly appreciate the plot. It serves as a modern follow-up to the 1870 tale about Americans who escape the Civil War battle of Richmond by stealing a hot-air balloon and wind up playing Survivor with Captain Nemo (who didn't just appear in Verne's better known Twenty Thousand Leagues Under the Sea). You assume the role of Mina, a solo around-the-world sailor who survives a shipwreck in the South Pacific, only to wash up on a forsaken isle with a cryptic past. There is one major ~retcon~ here--the island was destroyed by a volcanic eruption at the book's climax--but the storyline otherwise pays homage to the original narrative. It also pays homage to adventure-game conventions handed down since Larry Laffer blew up his first sex doll. Mina must collect everything that isn't nailed down and use these items to progress. Being patient and observant are crucial skills here, as most screens have at least one object that needs to be tossed into Mina's inventory before she moves on. There is a dose of reality in the proceedings, however. Instead of tackling ridiculous puzzles like Gabriel Knight 3's infamous ~fake moustache~ head-scratcher (whose solution involved the use of syrup and a cat), Mina spends her first moments on the island figuring out how to make a fire to cook crabs and fish, and how to make a knife to cut open oysters and coconuts. She goes about this in a distinctly adventure-game fashion--combining a vine with a stick and worms to make a fishing pole, for example--but at least her problems are rooted in real-world concerns like hunger, rather than abstractions so remote that you need a walk-through to find a solution. Also, most puzzles in Return to Mysterious Island have multiple solutions. Fires can be kindled with dried lichen, palm fronds, or mold, and lit with either a makeshift lighter or a lens that can focus the sun's rays. Climactic puzzles can be solved in two or three ways, including one piano-based variation that tests your ability to read musical notes. This allows you to pick and choose paths through the game. Since there are so many variations, you can work on numerous items at the same time in hopes of solving a problem. So even when you are stuck, you're at least experimenting so much that you don't feel stuck. There are also a lot of hints provided in the item descriptions, so you usually have some idea of what you're supposed to be doing. Being able to solve the riddles in different ways doesn't make the game easy, though. Some puzzles stretch the boundaries of common sense, especially after Mina heals and makes friends with a cute monkey she names Jep. An adventure game is certainly the only place that you're going to find an ape scaling a windmill to grease up its rusted parts with seal fat so that it can be used to make flour for no apparent reason. And the problems in the closing sequences involve cracking some very tough combinations to shut down lasers and open doors. Gathering items is also challenging. Hunting pixels can strain your eyes, and roaming over every millimeter of every screen until the mouse cursor changes to a grasping hand or moving gears is necessary throughout the entire game. Many objects blend right into the backgrounds--thick foliage often obscures edible items like oranges, while darkened indoor locales practically hide such vital supplies as saltpeter. And there are so many items to pick up that the game feels like a scavenger hunt at times. Mina plays Robinson Crusoe on one pretty island. If not for the absence of amenities like food and shelter, this would be a nice vacation spot. At least Kheops Studio compensates for the camouflage with truly gorgeous backdrops. Aside from graphic-novel-like cutscenes that pop up during action sequences, the game is played in the first-person, through Mina's eyes, in front of postcard vistas that look like advertisements for getaways on tropical islands. Going indoors doesn't lessen the impressive quality of the visuals, either. The audio quality isn't as noteworthy. As you spend the game alone, except for your monkey pal, there is little dialogue. Atmospheric sound effects are sparse as well, as befits this picturesque yet spooky deserted island. The musical score provides some memorable moments, though, particularly during the eerie tunes featuring choral odes. Essentially, Return to Mysterious Island is aimed directly at the cult audience still addicted to traditional adventure games. As such, it probably isn't going to convert anybody, but it's a good game that adventure fans will probably enjoy."}