{"ref": "https://www.gamespot.com/reviews/and-1-streetball-review/1900-6152599/", "date": "June 9, 2006", "game_name": "And 1 Streetball", "text": "In the late 1990s, street basketball underwent a renaissance, fueled by an upstart shoe company looking to make a mark for itself in the highly competitive basketball shoe industry. That company, And1, succeeded in creating a grassroots phenomenon known as the And1 Mixtape Tour, an event that showcases the country's slickest streetballers with their acrobatic dunks and electrifying ball-handling moves. Today, the Mixtape Tour is nationally known, with a regular show on ESPN, and now its players are household names among most basketball fans. A video game based on the real-life streetballers is a logical extension, and while And1 Streetball does offer all the basic amenities and an interesting ball-handling design, sloppy execution makes this a game that most basketball fans can safely avoid. While And1 Streetball tries to live up to a great premise with a unique ball-handling design... On the surface, And1 Streetball seems like a perfectly fine game for avid fans of the Mixtape Tour. The game includes just about all the most prominent And1 ballers, their likenesses, and their signature moves, including original stars like Half Man, Half Amazing, and Main Event. Newer stars like Spyda, he of the amazing hops, and the slick-handling Pharmacist, are also prominently featured. Of course, it wouldn't be an And1 game without everyone's favorite, The Professor, whose unassuming looks belie his incredible quicks and a savant-like mastery of ball handling. To a lot of basketball fans, The Professor is the true ~White Chocolate,~ not Jason Williams of the Miami Heat. And1 Streetball's primary strength is actually in its unique ball-handling design, which is entirely appropriate for a genre of basketball that promotes its exciting brand of jukes and fakes. Instead of relying on buttons or combinations of button presses, And1 Streetball's ~I-ball~ system requires you to use the analog stick to execute your fakes. The game is sensitive to eight degrees of input from the sticks, and the jukes are separated into three tiers. Level-one fakes are setup dribbles, where the ball handler dribbles in place to try and lull the defender into complacency. Second-level fakes are more dramatic and abrupt, which then lead to the tier three finisher moves, which you can use to break your opponents' ankles. Not literally, of course--you just make them fall down--but the game shows this off dramatically as it goes into slow motion. The more jukes you work in, the more respect points you earn, which will fill up a meter that eventually earns you a ~mic.~ You can consume these mics at any time to either unleash a canned, animated ~breakdown~ dunk worth three to five points, or to get your whole team on fire, which increases all of their general abilities. Sounds good so far, but the execution of the I-ball is flawed in that you must chain together moves in a specific way for maximum effectiveness--the game attempts to show you visually how to time your transitions from setup dribble, to fake, to finisher. That's fine on paper, but in practice, the inputs from the controller are not usually responsive in the way you'd expect. At times it feels like mashing around on the sticks and hoping for the best can be almost as effective as trying to play in the way the designers intended. What's more, the act of breaking the defender's ankles is tied in to an ankle-breaking meter that fills whenever the on-ball defender is close. Since it requires proximity to make it work, the defender can simply back up off you to shut off your ankle-breaker meter. You can do the same to your opponents, as well. So if the defender backs away, you should just pop the open jumper, right? That's not usually a great option, as most of the players in the game don't seem to be great outside shooters, and the massive rewards you get from building up a mic off of respect points are simply too great to ignore. The most efficient way to win a game is to build up as many mics as you can and then run off as many three- or five-point breakdowns as possible. This means the game boils down to a lot of one-on-one play where you mash on the I-ball controls to build up points before finishing off with a layup or dunk. The game design doesn't give much incentive to pass the ball, unless you want to see a cool alley-oop, but the animations on these are not that varied anyway, so once you've done it a few times you'll just want to score it yourself and not risk missing the pass. Defense in the game is also suspect--the collision detection isn't so great, so playing position defense is usually not rewarding. You get more mileage out of just slamming on the steal button, or, failing that, trying to block shots--in other words, high-risk, high-reward defense is better than playing in a solid but conservative style. Cynical observers might say that these characterizations of shooting, teamwork, and defense are accurate descriptors of street basketball, but no matter what you may think, it doesn't make for a very compelling video game. The different game modes range from one-on-one up to three-on-three half-court basketball, or three-on-three to five-on-five full-court play. There's a story mode in the game that integrates all of these. You'll start as a prospect trying to get on the And1 bus at the start of its tour in New Jersey, then you'll make your way across the country and the world in various cities like ATL, the Illadelph, and Paris. In each city you'll play in the open run and the main run, where you'll try and play well enough to stay on the bus. You'll also play in some story-based side games against the And1 ballers, where you'll unlock new moves that you can use to create your own breakdown moves. You'll also earn money that you can use to buy new gear for your created baller or improve his skills. The problem with this mode is that it quickly gets repetitive. Winning isn't always good enough, either. And1 Streetball inexplicably copies one of NBA 06's story mode's worst features in that there's usually a side goal you need to accomplish along with winning, like getting a certain number of steals or ankle-breaker moves. It can be frustrating to win a game but be short in some insignificant stat and have to repeat it. While the cutscenes in the story mode might be amusing to hardcore fans of the And1 Mixtape, you won't find much value in the mode after you get through the first few cities. ...the overall game falls flat in the end. Unfortunately, And1 Streetball's presentation isn't too hot, either. While certain animations look pretty decent and the models look OK for the most part, the game's animations just don't blend well together. Sometimes a body or the ball looks like it's moving too fast, and then a second later, too slow. This gives the game a very stilted look. The ball and players also tend to clip through one another, and even in the canned animations, you often don't see the ball move cleanly into the basket. Passing and shooting can look awkward at times depending on player position, and it can be disconcerting to see a close-up of a player talking without moving or having any expression on his face. It's as if you're balling with a bunch of trash-talking ventriloquists. Speaking of sound, And1 doesn't hold up well in that department, either; the game's hip-hop-inspired music is generally pretty bad, and the voice and commentary get repetitive very quickly. You can only hear Duke Tango say ~Oh baby!~ or ~Let's watch this!~ so many times before you'll have to repress an urge to chuck the ball right at his mouth. Online and offline multiplayer is available for both the PS2 and the Xbox versions of the game. But given a core basketball engine that feels primitive and has some basic design flaws, being able to play against your friends doesn't redeem the game or add much value, despite the fact that these features seem to work well. While there are some decent ideas in And1 Streetball, it feels like the game wasn't refined nearly enough as it should have been. Everything, from the core gameplay to the presentation, seems very roughly executed, so it's difficult to recommend this game to anyone. You'll probably get more entertainment value out of the latest And1 Mixtape DVD than you will out of the And1 Streetball game."}