{"ref": "https://www.gamespot.com/reviews/timesplitters-future-perfect-review/1900-6120899/", "date": "March 22, 2005", "game_name": "TimeSplitters: Future Perfect", "text": "The TimeSplitters series has, up to this point, been a bit of a missed opportunity. The games are first-person shooters that place an extreme emphasis on sheer variety and fast action. But until now, the series has been limited to four players, unless you've been lucky enough to live on a TimeSplitters 2-loving LAN. But with the third iteration, TimeSplitters: Future Perfect, the series is finally making good on the great ideas that developer Free Radical had back in 2000. While it might not pull you away from some of the more engrossing action games out on the market, TimeSplitters' charm and ~something for everybody~ mentality means that you're almost certain to find something to like in Future Perfect. The TimeSplitters series feels like a throwback to GoldenEye and Perfect Dark. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: TimeSplitters: Future Perfect Video Review While the game's bread is buttered by its multiplayer focus, it still has a very cool story mode. Though it's not going to test your skills or patience to the fullest--expect to blow through the medium difficulty in six hours or so--the story is compelling and funny. You're cast as a character named Cortez, and you start out by returning from a quest where you had to secure a collection of crystals that power a time machine. Once you return with the crystals, you're sent hopping through time in an attempt to prevent mankind's current conflict--a losing battle against creatures of unknown origin--from ever happening. As you leap around throughout the past, you're put into a lot of different wacky scenarios. What starts as a futuristic battle sends you back to the early 1900s a lot, as well as to the 2200s (which, in this game's timeline, is still the past), and yes, to 1994. Each time period has you doing something different, too. In 1969, you'll team up with the swinging superspy, Harry Tipper, as he attempts to stop a Bond villain-type from launching a missile from a moving train. In 1994, you'll team up with a short-skirted girl (complete with a T-shirt that reads ~slut~) to infiltrate a zombie-filled mansion. The coolest part about the story mode is that Cortez, who initially seems like a very Riddick-like action hero, is really a very likable character. And you'll be seeing a lot of him, too, because thanks to the constant mishaps involved in time travel, you'll always be running into yourself. Each time period has you working together--with yourself--in some way. Sometimes it's a simple cutscene where your future self will pass you a key and then run off. Other times, you'll be providing cover fire for your past self to make sure that your past self eventually gets to become your...future self. The interactions between different versions of Cortez are inventive and often very funny, too. You'll always be looking forward to the next wormhole. It's a shame that the game's conclusion doesn't play off this absurd level of paradoxes a little better, but the stuff you encounter along the way is cool enough to make up for that. You can also play the story mode with a second player, which makes for some solid co-op. The game also has a lot of other single-player features. The arcade mode has a league option, where you'll go up against bots in a variety of matches in an effort to earn trophies. The challenge mode also has some unique things you can do alone, like engage in robot cat racing, throw bricks through windows, and more. Some of these activities are fun, but most of them are a little shallow. Regardless, all of this single-player trophy-gathering ties back into the multiplayer, as you'll constantly be unlocking new characters and options for the game's thick list of multifriend fun. There are 150 characters in all, each ranked in four different categories, like speed and stamina, but you can turn those stats off if you're looking for a perfectly level playing field. While there are plenty of modes to choose from, many of TimeSplitters' match types are very similar. When it comes to the multiplayer first-person shooting, TimeSplitters offers up a pretty hefty list of gameplay modes to choose from. Great deals of them are simple deathmatch variants, like vampire, where you must kill other players on a regular basis to prevent a meter from draining, which in turn kills you. There's also thief, which moves the scoring to coin collecting, rather than killing. Team games are represented with capture the bag and assault (an objective-based team game that splits you up into offensive and defensive units), among others, though the game only comes with four different assault-ready maps and two of them are a little simplistic. You can play all of these games with bots of varying skill levels, though the bots are better gunmen than they are tacticians. In assault, for example, the bots on your team often seem to completely ignore the objectives and just shoot it out with the other team, leaving players to do all the dirty work. You can build your own set of bots, which allows you to adjust their skill level from one to five stars. The default three-star rating is easy to beat if you're at all handy with the headshots. Bumping up to five stars gives the game more of a challenge, but really, you're better off playing against people. When playing against others, you can play on a four-player split-screen, but this is 2005, people. Split-screen first-person shooting is, like, sooo seven years ago. Thankfully, TimeSplitters: Future Perfect is the first game in the line to feature online play. With standard player-matching features and room for up to 16 players, Future Perfect's multiplayer is at its best when you're playing with a gang of people. All of the customizable stuff really makes a difference here, since there are plenty of free-for-all and team-based modes to choose from. Plus, as we quickly discovered, shooting people through walls with the equivalent of Perfect Dark's X-ray gun is even more fun when you're reaching across a continent to ruin someone's day with one headshot after another. Once you've had enough fun with that, though, you can simply select a different weapon set and carry on without fear of phantom headshots. Much like Woody Harrelson, your man can't jump in TimeSplitters: Future Perfect. It might have all the modes in the world, but a long list of features doesn't automatically equal out to the best game ever made. TimeSplitters is, at its core, a pretty stripped-down game that isn't too much more than a faster-moving, better-looking version of GoldenEye for the Nintendo 64. The health and armor meters show up in the same spots on the sides of the head's-up display, and yeah, you still can't jump. There's a good, wide variety of weapons to choose from, though, and you'll be able to customize which weapons appear on any given level to your heart's content. This adherence to convention works if you're already a fan of the TimeSplitters series, but even though most of the levels were designed with your movement limitations in mind, it still feels a little too stripped down at times. Many of the weapons aren't all that satisfying, but the sheer variety of them should keep things interesting. Still, there's something to be said for making sure that you have a good, solid rocket launcher in your game's arsenal. The launcher in TimeSplitters: Future Perfect is disappointingly sluggish. Mapmaking is something that's a standard on the PC side of things, but still practically unheard of for consoles. The TimeSplitters series has had a basic mapmaker for some time now, and at this point, it's pretty robust. Even better, you can now take your created maps and upload them to an online repository for other people to check out. This is a cool feature. It's not for everyone, but anyone looking to get creative (without having to learn how to use actual level-editor tools for a PC-based shooter) will find an outlet here. TimeSplitters looks great on the Xbox and PlayStation 2. The Xbox version does look slightly better, but not so much so that PlayStation 2 owners will feel cheated or anything like that. Both versions sport good player models and well-designed levels. The virtual reality setting in multiplayer has a Tron-inspired look to it that really sets it apart from the rest of the environments. But you'll still see disco floors, Vietnam, large underwater bases, the inside of a zeppelin, and other spots that look good. The character models look nice, too, and with 150 to choose from, you'll be able to sport plenty of different looks. However, you'll notice some aliasing here and there, especially on the edges of player models. The online multiplayer really adds a lot of value to the game. The techno-style soundtrack for Future Perfect is upbeat and light enough to fit with the rest of the game's casual style. Weapon effects are a little more subdued than they probably should be, and in general, the sound is lacking. Specifically, you won't hear any character footsteps. That, combined with a lack of view bob, makes you feel like you're just some sort of wheeled robot, rolling around the environments. Cortez is the star of the show when it comes to voice work, and he has both well-written lines and strong delivery to make them work. The rest of the story mode cast is pretty good. Also, each of the game's 150 characters has a little voice clip that plays when you select them. This is just another layer of flavor that helps sell the game's unique sense of humor. All in all, TimeSplitters: Future Perfect makes for good, meaningless fun. However, many of its modes don't feel complete. As consoles get more and more competent at handling the first-person shooter genre, TimeSplitters feels more and more like a relic from a bygone era. Although, a lot of credit is still due to the variety you'll find in Future Perfect, and fans of the series' mapmaker functionality will certainly enjoy diving right back into this feature and trading new maps online. So the formula might feel slightly dated when compared to the Xbox's best first-person shooters, but with significantly less competition for your online first-person shooter dollar on the PlayStation 2 side, TimeSplitters: Future Perfect will probably shine slightly brighter there. When playing against others, you can play on a four-player split-screen, but this is 2005, people. Split-screen first-person shooting is, like, sooo seven years ago. Thankfully, TimeSplitters: Future Perfect is the first game in the line to feature online play. With standard player-matching features and room for up to 16 players, Future Perfect's multiplayer is at its best when you're playing with a gang of people. All of the customizable stuff really makes a difference here, since there are plenty of free-for-all and team-based modes to choose from. Plus, as we quickly discovered, shooting people through walls with the equivalent of Perfect Dark's X-ray gun is even more fun when you're reaching across a continent to ruin someone's day with one headshot after another. Once you've had enough fun with that, though, you can simply select a different weapon set and carry on without fear of phantom headshots. Much like Woody Harrelson, your man can't jump in TimeSplitters: Future Perfect. It might have all the modes in the world, but a long list of features doesn't automatically equal out to the best game ever made. TimeSplitters is, at its core, a pretty stripped-down game that isn't too much more than a faster-moving, better-looking version of GoldenEye for the Nintendo 64. The health and armor meters show up in the same spots on the sides of the head's-up display, and yeah, you still can't jump. There's a good, wide variety of weapons to choose from, though, and you'll be able to customize which weapons appear on any given level to your heart's content. This adherence to convention works if you're already a fan of the TimeSplitters series, but even though most of the levels were designed with your movement limitations in mind, it still feels a little too stripped down at times. Many of the weapons aren't all that satisfying, but the sheer variety of them should keep things interesting. Still, there's something to be said for making sure that you have a good, solid rocket launcher in your game's arsenal. The launcher in TimeSplitters: Future Perfect is disappointingly sluggish. Mapmaking is something that's a standard on the PC side of things, but still practically unheard of for consoles. The TimeSplitters series has had a basic mapmaker for some time now, and at this point, it's pretty robust. Even better, you can now take your created maps and upload them to an online repository for other people to check out. This is a cool feature. It's not for everyone, but anyone looking to get creative (without having to learn how to use actual level-editor tools for a PC-based shooter) will find an outlet here. TimeSplitters looks great on the Xbox and PlayStation 2. The Xbox version does look slightly better, but not so much so that PlayStation 2 owners will feel cheated or anything like that. Both versions sport good player models and well-designed levels. The virtual reality setting in multiplayer has a Tron-inspired look to it that really sets it apart from the rest of the environments. But you'll still see disco floors, Vietnam, large underwater bases, the inside of a zeppelin, and other spots that look good. The character models look nice, too, and with 150 to choose from, you'll be able to sport plenty of different looks. However, you'll notice some aliasing here and there, especially on the edges of player models. The online multiplayer really adds a lot of value to the game. The techno-style soundtrack for Future Perfect is upbeat and light enough to fit with the rest of the game's casual style. Weapon effects are a little more subdued than they probably should be, and in general, the sound is lacking. Specifically, you won't hear any character footsteps. That, combined with a lack of view bob, makes you feel like you're just some sort of wheeled robot, rolling around the environments. Cortez is the star of the show when it comes to voice work, and he has both well-written lines and strong delivery to make them work. The rest of the story mode cast is pretty good. Also, each of the game's 150 characters has a little voice clip that plays when you select them. This is just another layer of flavor that helps sell the game's unique sense of humor. All in all, TimeSplitters: Future Perfect makes for good, meaningless fun. However, many of its modes don't feel complete. As consoles get more and more competent at handling the first-person shooter genre, TimeSplitters feels more and more like a relic from a bygone era. Although, a lot of credit is still due to the variety you'll find in Future Perfect, and fans of the series' mapmaker functionality will certainly enjoy diving right back into this feature and trading new maps online. So the formula might feel slightly dated when compared to the Xbox's best first-person shooters, but with significantly less competition for your online first-person shooter dollar on the PlayStation 2 side, TimeSplitters: Future Perfect will probably shine slightly brighter there."}