{"ref": "https://www.gamespot.com/reviews/viva-pinata-pocket-paradise-review/1900-6197455/", "date": "September 9, 2008", "game_name": "Viva Pinata: Pocket Paradise", "text": "For those who have always dreamed of cultivating a garden full of living pinatas without being tethered to a home console, the Viva Pinata franchise has finally made its portable debut. Pocket Paradise is a surprisingly faithful conversion that condenses the animals, plants, and micromanagement options that made the Xbox 360 original so enthralling into a DS game. The slower pace and in-depth tutorials make this a good entry point for people overwhelmed by the often chaotic flow of the console games, but Viva veterans may find themselves struggling to stay awake as they plow through hours of gardening before the more interesting animals start to arrive. Pocket Paradise can satiate your desire to romance a family of whirlms while you're on the road, but it lacks the unrelenting grip that makes the console versions impossible to put down. It's a good thing fizzlybears don't like eating doenuts. The basic gameplay in Pocket Paradise is indistinguishable from the gameplay of its console brothers. You attract pinatas into your garden based on your level and the plants and animals that currently populate your land. It's a simple concept but it makes for a very engaging game. You never know exactly what will tempt a lurking pinata, so you'll constantly be overhauling your lands trying to entice a stubborn outsider. The controls make excellent use of the touch screen, allowing you to easily sweep around the garden planting bushes with precision and directing pinatas back to their homes. Going to the store or whipping out one of your trusty tools is only a couple of taps away, so molding the garden to your liking is even easier than in the console versions. There is still some clumsiness when objects are too close to each other, but the controls are predominantly superior in this portable iteration. The initial batches of pinatas are extremely easy to please. They desire only a nice patch of soil or a lone flower before they'll move in and start to romance, a silly dance that lets you populate your garden with more of the same species. The later pinatas are much pickier, though, and you'll need to completely overhaul your terrain, provide a bushel of rotten fruit, or even tempt them with a flock of tasty pinatas. Figuring out how to lure these fickle friends into your merry garden can be tricky, but getting them to procreate is much easier than it was on the Xbox 360. Though pinatas still have a seemingly arbitrary set of requirements that must be met (for instance, fizzlybears need to eat a bottle of medicine before they'll romance, for some terrifying reason), you can circumvent these entirely and just feed them romance candy. Previously, romance candy would work only if you had already convinced two pinatas to romance. Being able to force-feed them these aphrodisiac treats takes away a lot of the satisfaction of the breeding process. It's best to ignore this option and not cheat your way past the romance requirements. More troubling than easy romancing is the sluggish progression system. Leveling up now moves like a shellybean through water, which means you'll be dealing with the same group of low-level pinatas for hours before you can lure some more interesting beasts into your abode. In previous games, there was a seemingly never-ending stream of new items and animals being introduced to you. After accomplishing just a few new actions (such as luring in a new pinata or growing a new plant), you would level up, which would bring even more new pinatas and plants to deal with. In Pocket Paradise, it takes a lot longer to advance, which means you will come across new items less frequently. One of the main hooks in the console games is this extremely generous progression system, which makes it difficult to stop playing because you're so regularly rewarded with something new. When the rewards are limited, it's easier for less experienced gardeners to manage their land, but anyone familiar with the formula will curse the listless pace. The romance dances have made the transition intact. The graphics in Pocket Paradise do an admirable job of replicating the visuals in the Xbox 360 games. The 3D pinatas mesh seamlessly with the 2D environment, creating a living world that looks enticing. Fog will drift lazily over your land every dawn, which adds a bit of ambiance to the docile breeding grounds. Unfortunately, while the game is technically impressive, it lacks the cuteness factor necessary to push you to lure in and romance new pinatas. The idle animations and silly facial expressions in the console versions add a dose of motivation that is sadly missing on the DS. While Pocket Paradise does an impressive job of squishing the console pinata experience onto a small screen, it lacks the generous progression and rewards system that makes the other versions so addictive. The simple formula is so captivating, though, that even a sluggish leveling system and less-than-cute inhabitants cannot destroy what is still a fun, engrossing experience. Pocket Paradise may not be able to match the original versions in cuteness, but it sure packs a powerful punch in the portable market."}