{"ref": "https://www.gamespot.com/reviews/motor-city-online-review/1900-2826690/", "date": "November 21, 2001", "game_name": "Motor City Online", "text": "When Electronic Arts first announced plans for Need for Speed: Motor City two years ago, it sounded like a racing buff's dream--and for good reason. Imagine a persistent-world gameworld such as Ultima Online or EverQuest, blended with the high-powered action of the Need for Speed series and soaked in the atmosphere invoked by movies like American Graffiti and Two Lane Blacktop, and it's easy to see why the news of its development caused such a stir. The game would offer players the chance to buy, sell, and trade cars and parts to build their own fast, flashy rides from the golden age of automobiles, then hang out talking trash in joints like Roxy's Diner and the Roadkill Cafe as they waited to blow the next challenger off the line or hook up a new member for their car club. It sounds tantalizing, and in many respects Motor City Online (or MCO for short--EA Games switched titles shortly after news of the game's development) delivers on its potential, but it's most definitely not for casual online gamers or those whose patience is easily taxed. One of the first issues many will have with MCO will come at the checkout counter: The game carries a $40 sticker price, and for your money you get a flashy box, a jewel case, a CD, and a month's free play--but no manual. All the documentation is accessed online either from the MCO software or the MCO Web site, and the process of getting answers to specific questions can be tedious even for those with broadband access. It's nice that EA Games is offering all of the documentation online, especially since the service will have new features and rules as it evolves. But there should have been some help to turn to offline, especially for the less mechanically inclined who find themselves struggling to turn their initial junker into a car that can make it around the street courses at decent speeds without constantly spinning out of control. Also, some info from the MCO ~knowledge base~ is already outdated. For instance, it says you can have up to three personas per server, when you actually can have only one. After you first log on, you get to choose a persona to represent you online. There's a pretty good variety--guys can choose from models like townie, mohawk punker, runty rebel, beefcake greaser, and many more, while the ladies can opt to be play as a rocker chick, go-go gal, mademoiselle oo la la, and halter topper bopper, to name just a few. As you pick a name and change your clothes colors, a radio blasts out guitar-soaked instrumentals--everything from twangy surf tunes and gritty blues numbers to some ~wacka-wacka~ funk. From there it's on to buy your first car, and it's then you run into the game's first anomaly: Why are you given only three pathetic choices--a Bel-Air, a Fairlane, and a Ranchero (all '57s)--for your first vehicle? Because you can actually race and earn money without owning a car (more on that later), the wise person might try to save the $8,000-plus these death traps cost and sock it away toward a real car, but no dice: You must buy one. To be fair, MCO wouldn't be much of a game if all the great cars were available right off the bat (even in stock form), because the whole point is to encourage a thriving online economy, and the best way to do that is to leave users with no choice but to lay it on the line and race for cash. But there are two problems: The first is that EA Games should have figured a way to provide a few more choices from the get-go, and the second is that it seems hardly anyone earns money and the points needed for level advancement (which leads to higher weekly paychecks and eventually unlocked tracks) by actually racing the car they bought. Here's how it works. There are four major classes of races: street, circuit, time trials, and drag races. In any of them you can choose an open race where you drive your own car, a sponsored race where you choose from a predetermined selection of common vehicles, or a club race against another team (both of you drive your own cars). Theoretically, the fastest way to build a bankroll is to run open races because the purses can be larger, but hardly anyone is willing to do it. One reason is the classifications aren't narrow enough--you can limit horsepower to under 300, for instance, but there can be a lot of variance in that class, and it's quite easy to find out you don't stand a chance against a more souped-up car. Another is that any damage you incur must be repaired out of pocket, but the expenses are so small that shouldn't stop anyone from giving it a go. Time after time we tried to start an open street race, but no one would join and no one would create one. So we headed over to the circuits and finally got one person to join in--but when we changed the number of participants to two to reflect the smaller field, the game automatically added two computer-controlled racers who thrashed both of us. It's a double whammy: A computer opponent wins human players' cash, and the computer opponent didn't have to pay an entry fee! When we asked tech support about this, we were simply told that computer opponents would be added whenever there weren't enough humans, and that was that. That's no problem in the sponsored races because the cars are all equal, the physics are more forgiving, and the computer's artificial intelligence can be more easily beaten (especially on circuits). But until you get a really good personal car, it's just not worth the risk. Anyone who's searched for an open circuit or street race in Motor City Online will soon realize that they're very few and far between.So what happens is that many players tend to run sponsored circuit races (sponsored street races only yield experience points) or, even better, sponsored time trials. These are an easy way to rack up cash quickly--no waiting on humans to join and select cars, and you can easily pick up between $150 and $200 every two or three minutes with a decent showing (more on harder tracks). But here again, you won't even think about running the open time trials because the game doesn't take into account what class your car is in when computing your run. If you enter the open time trial in the Bel Air Grand Prix, for instance, you're going up against cars that could have superb handling and 200hp more than you do, and you have no hope of finishing high enough to make it worthwhile. Instead, to gain cash more quickly, the vast majority of beginning players will run sponsored time trials--again, in common cars with more forgiving physics, which makes it even harder to get acclimated to the more realistic handling of personal cars when you finally make enough money to get a better car you feel comfortable racing. Sponsored races are probably the simplest way to make some money. What about the drag races? This would seem to be the great equalizer because races can be handicapped with dial-in times, but in our many visits to the two drag strips we saw a lot of strange things happen. You might find that the announcer will indicate an opponent redlined, but when you finish the run you'll learn you really lost. We also noticed our elapsed times during practice runs didn't correlate closely with what we got during real races, and often we set our dial-ins too low and gave our opponents too much of a lead. Still, this does seem to be where most of the real action--racing for big-ticket purses or pink slips--is going down. The issue of latency has always been a sticky wicket for any online racing game, and MCO is no exception. When a broadband user squares off against opponents with dial-up connections (or, even worse, an AOL dial-up connection), there's no telling what sort of magic will take place--cars disappearing and reappearing, bouncing up and down on the track as though it were a trampoline, and sometimes shooting from behind to win a race when you thought you'd left them in the dust long before. Perhaps these things are to be expected--at any rate, anyone who gets too ripped up over them should probably find another online game to try. What isn't to be expected, on the other hand, is the feeble attempt the game's interface makes to address the latency issue before it becomes a problem. There are currently four MCO servers where you can have a persona, but when you log on you aren't shown what your latency is to each one. And while your opponents' latencies are displayed via color codes during a race, you're given no idea what the latencies are as you sit in the chat room before the race starts. If you knew that info ahead of time, many of the races that end up as wild smash-'em-ups because of lag could be avoided. Though the box proclaims you'll eventually be able to buy T-Birds, Stingrays, Cobras, GTOs, Camaros, 'Cudas, and Firebirds, we couldn't find any of those for sale on two servers, either in current or completed auctions or at the auto lot. The auction interface is rather clunky: There are six auctions run by the service and one user-based auction, and after checking out one you're returned to the main menu and must start all over. Another problem with the auction interface is its small screens--to view all 197 cars being auctioned by users on one server, we had to scroll through nine very laggy screens. All this could be streamlined with a filter to display only certain makes and models (you can at least sort the full lists that way), so one can only hope that this will be an improvement in an upcoming patch. Even if we did find an attractive car, it probably wouldn't have mattered. The lone Mustang we saw being auctioned was running upward of $267,000, and while we saw users online with $2 million or so in the bank, it's hard to imagine an average player coming up with this kind of money. Motor City Online can be frustrating, but should appeal to hard-core racing fans. Despite all these issues, a funny thing happened on the way to the finish line. Despite a nonracing interface that's unwieldy and cluttered, and the fact that Roxy's Diner and the Roadkill Cafe are nothing more than chat rooms rather than cool 3D environments, there are times when MCO just sucks you in. It's especially tempting on the weekends, when the servers are heavily populated and there's always somebody ready to run--even if it is around that same dirt track at the fairground or the Gearborn Tri-Oval. You can spend hours trying to scrape up enough cash to juice up your wretched Ranchero. Before long, you'll be getting invitations to join car clubs, where you can compete in a ~turf war~ to claim a track as your own and earn extra cash. It's a time-consuming game, but it can certainly be fun. MCO probably won't satisfy the Grand Prix Legends or NASCAR 4 crowd accustomed to near-perfect authenticity in their racing games, because EA took some creative license in determining car weights in an attempt to balance gameplay. But there's no denying that MCO theoretically lets you build a screamer that's pure fun to drive--just don't plan to earn one in a sitting or two. If you're into racing and, perhaps more importantly, into trying to find bargains to squeeze more horsepower or handling out of a custom-built ride, you'll probably find it easy to look past MCO's shortcomings and immerse yourself in its wild, weird world.So what happens is that many players tend to run sponsored circuit races (sponsored street races only yield experience points) or, even better, sponsored time trials. These are an easy way to rack up cash quickly--no waiting on humans to join and select cars, and you can easily pick up between $150 and $200 every two or three minutes with a decent showing (more on harder tracks). But here again, you won't even think about running the open time trials because the game doesn't take into account what class your car is in when computing your run. If you enter the open time trial in the Bel Air Grand Prix, for instance, you're going up against cars that could have superb handling and 200hp more than you do, and you have no hope of finishing high enough to make it worthwhile. Instead, to gain cash more quickly, the vast majority of beginning players will run sponsored time trials--again, in common cars with more forgiving physics, which makes it even harder to get acclimated to the more realistic handling of personal cars when you finally make enough money to get a better car you feel comfortable racing. What about the drag races? This would seem to be the great equalizer because races can be handicapped with dial-in times, but in our many visits to the two drag strips we saw a lot of strange things happen. You might find that the announcer will indicate an opponent redlined, but when you finish the run you'll learn you really lost. We also noticed our elapsed times during practice runs didn't correlate closely with what we got during real races, and often we set our dial-ins too low and gave our opponents too much of a lead. Still, this does seem to be where most of the real action--racing for big-ticket purses or pink slips--is going down. The issue of latency has always been a sticky wicket for any online racing game, and MCO is no exception. When a broadband user squares off against opponents with dial-up connections (or, even worse, an AOL dial-up connection), there's no telling what sort of magic will take place--cars disappearing and reappearing, bouncing up and down on the track as though it were a trampoline, and sometimes shooting from behind to win a race when you thought you'd left them in the dust long before. Perhaps these things are to be expected--at any rate, anyone who gets too ripped up over them should probably find another online game to try. What isn't to be expected, on the other hand, is the feeble attempt the game's interface makes to address the latency issue before it becomes a problem. There are currently four MCO servers where you can have a persona, but when you log on you aren't shown what your latency is to each one. And while your opponents' latencies are displayed via color codes during a race, you're given no idea what the latencies are as you sit in the chat room before the race starts. If you knew that info ahead of time, many of the races that end up as wild smash-'em-ups because of lag could be avoided. Though the box proclaims you'll eventually be able to buy T-Birds, Stingrays, Cobras, GTOs, Camaros, 'Cudas, and Firebirds, we couldn't find any of those for sale on two servers, either in current or completed auctions or at the auto lot. The auction interface is rather clunky: There are six auctions run by the service and one user-based auction, and after checking out one you're returned to the main menu and must start all over. Another problem with the auction interface is its small screens--to view all 197 cars being auctioned by users on one server, we had to scroll through nine very laggy screens. All this could be streamlined with a filter to display only certain makes and models (you can at least sort the full lists that way), so one can only hope that this will be an improvement in an upcoming patch. Even if we did find an attractive car, it probably wouldn't have mattered. The lone Mustang we saw being auctioned was running upward of $267,000, and while we saw users online with $2 million or so in the bank, it's hard to imagine an average player coming up with this kind of money. Despite all these issues, a funny thing happened on the way to the finish line. Despite a nonracing interface that's unwieldy and cluttered, and the fact that Roxy's Diner and the Roadkill Cafe are nothing more than chat rooms rather than cool 3D environments, there are times when MCO just sucks you in. It's especially tempting on the weekends, when the servers are heavily populated and there's always somebody ready to run--even if it is around that same dirt track at the fairground or the Gearborn Tri-Oval. You can spend hours trying to scrape up enough cash to juice up your wretched Ranchero. Before long, you'll be getting invitations to join car clubs, where you can compete in a ~turf war~ to claim a track as your own and earn extra cash. It's a time-consuming game, but it can certainly be fun. MCO probably won't satisfy the Grand Prix Legends or NASCAR 4 crowd accustomed to near-perfect authenticity in their racing games, because EA took some creative license in determining car weights in an attempt to balance gameplay. But there's no denying that MCO theoretically lets you build a screamer that's pure fun to drive--just don't plan to earn one in a sitting or two. If you're into racing and, perhaps more importantly, into trying to find bargains to squeeze more horsepower or handling out of a custom-built ride, you'll probably find it easy to look past MCO's shortcomings and immerse yourself in its wild, weird world."}