{"ref": "https://www.gamespot.com/reviews/klaus-review/1900-6416372/", "date": "February 29, 2016", "game_name": "Klaus", "text": "Klaus began trying my patience a bit less than halfway in. In fact, at one stage, this mysterious amnesiac clone of a clone of a clone rebelled against my commands. I'm not used to this. I'm familiar with controller frustrations, missed button presses, poor timing, and a bevy of other problems that can plague a gaming experience, but I'm not used to a character willfully disregarding my instructions. That threw me. Those levels, like the rest of the game, still relied on precision platforming, but the inputs were all messed up. It was obnoxious and abrasive, but also the point.Following the tradition of Mario-style 2D platformers, Klaus relies on familiarity with playing video games to understand its message. It disrupts conventions with abstract areas, confusing composition, and a relentless critique of the monotonous drudgery that dominates our lives. That's not an easy set to manage, but most of the time Klaus succeeds. It shifts deftly between the mundane familiarity of your standard action platformer and a surreal adventure that reflects on how modernity dehumanizes us.Despite the heady philosophical musings, playing Klaus is a simple affair. You hit one button to jump around, another to interact with things, and wiggle the joystick to control your on-screen character. That gets a bit muddled later, though, when you must tap on the PS4's touchpad to manipulate objects in the environment. And that's also where we hit the cerebral stuff head first.Klaus, which is to say the game, makes it clear that there's a big difference between how it interprets your control of Klaus the character via buttons and touchpad vs. the controller's touchpad. Its a strange distinction, but it's one that comes to mean more in time.When using the touchpad, you're actually taking control of the environment and Klaus begins to assume that you're a benevolent force outside of his world. You're a god. Looking out for him, guiding him, protecting him, and always ensuring success. At first, you also have total control of him. But that only lasts as long as Klaus's goals and yours align. Eventually, he decides he's had it with you. He's frustrated by your constant interference. This feeds into a discussion about existentialism. When Klaus takes control of his life, when he breaks free of your godly/omnipotent influence, he's making choices about who he wants to be and what he wants to do. And you're left controlling just the world he's in with that touchpad.It's a cute spin on a gaming staple. After three decades of playing as the star of the show, now you control to the forces against them. It all starts in a series of levels modeled after a white-collar office, replete with satiric posters about ~Big Brother~ and hundreds of robotic Klaus lookalikes. The imagery is hardly subtle, but the way the game weaves that iconography with its play is commendable. It seeks to empower you to take agency of your own life, in an Office Space-inspired jab at modernity.Challenging and sometimes frustrating though it may be, Klaus is a refreshing take on one of the most lasting genres around.Gluing this commentary together are the usual series of straightforward platformer-style levels. There are jumping puzzles, obstacles, enemies, and projectiles to dodge, as well as new character abilities to explore. Sprinkled throughout the standard fair, however, are a smattering of bizarre, experimental areas that act as short trips through Klaus's subconscious. In each level level, text unfurls on the background scenery, revealing Klaus's inner monologue and providing most of the exposition. Each ~world~ centers on a theme--a basement, an office, etc.But every so often, you find flashing orbs of light that draw Klaus into the recesses of his mind. Here, the narrative text yields to a single, stark word. These will frame the level, and center its theme on a simple idea. ~Success,~ for example, will have representations of the idea float as literal platforms that you have to jump to. Surrounding that safe haven, however are red words like ~fear of failure.~ Touching one of those, instead of landing safely on ~success,~ kills you. Other areas will limit your movement, or force you to play outside of the level altogether. These are strange, furtive experiments that yield bizarre, meditative results. Completing one will warp Klaus back into the grind of the game proper, and you continue on your way.Curious twists on the platforming genre aside, it's hard to know how to parse and digest Klaus, and it left me with far more questions than answers. But again, that seems to underscore the adventure. It's hard to knock a game for being frustrating when those segments are rare and brief. They're also bookended by the eponymous Klaus declaring that he's ~not fine~ with any of this, before wrenching himself from your control and asking, ~Are you frustrated?~ Some, I'm sure, will find the added challenge of those segments delightful, but the same can't be said for Klaus's somewhat common bugs.Challenging and sometimes frustrating though it may be, Klaus is a refreshing take on one of the most lasting genres around.In my time with the game, Klaus crashed several times, once forcing me to restart my console. The game saves often enough that such interruptions aren't huge problems, but it's disheartening when an untimely bug can dash the relief of success after a challenging sequence.Bugs aside, Klaus is a passion project by freshman designers, and one that toys with decades-old game conventions. It wraps in those twists a dialogue less about the role of games today, and more about how we live our real-world lives. Challenging and sometimes frustrating though it may be, Klaus is a refreshing take on one of the most lasting genres around."}