{"ref": "https://www.gamespot.com/reviews/mega-man-legacy-collection-review/1900-6416229/", "date": "August 27, 2015", "game_name": "Mega Man Legacy Collection", "text": "Preserving video games is difficult. Outside of illegal ROMs, it's tricky to find clean and reliable copies of the vast swath of video game history. With the Mega Man Legacy Collection, Capcom is preserving and reintroducing the roots of a franchise built into the very building blocks of modern gaming--even if the actual act of playing the games themselves isn't always the treat you remember them to be.The Mega Man Legacy Collection is a tribute to the Blue Bomber's 8-bit origins, collecting Mega Man 1-6 as well as the games' soundtracks and a lot of original concept art. The games are recreated faithfully, with all of their glitches and framerate issues intact. These are the Mega Man games you played in the late 80s and early 90s, thus, The Legacy Collection is a valuable gaming history. While anyone can appreciate that aspect, the games' high levels of difficulty may be a turn off if your experience isn't guided by nostalgia and first-hand experience.Let's pretend for a moment that you've just landed on Earth after having been abducted by aliens for the last 28 years and you've never heard of Mega Man. The original entries in the series task you with saving the world from Dr. Wily's evil Robot Masters as kind robot Rock, who has volunteered to become the powerful Mega Man to save humanity. In these action-platformers, you use your Mega Buster gun and the weapons you salvage from defeated bosses to proceed and defeat all Robot Masters and ultimately Dr. Wily himself (and the rare other big bad that the series throws at you).The stories in these games rarely go much further than ~save the world,~ and that's fine, because Mega Man delivers more enjoyment through its 8-bit graphics and music. With sharp, vivid color palettes and expressive, memorable enemy designs, these tiny worlds from decades ago still work their way into your heart. Whether it's the escalating silliness of the Robot Master designs--I was particularly fond of the elegance of Star Man and Ring Man--or the way almost every song becomes etched into your memory, the Mega Man Legacy Collection shows how much can be accomplished with broad strokes and limited resources.It's in every other portion of the game that I am consistently less enthused to be returning to Mega Man's roots, because the franchise's core combat and platforming loops have become frustrating at best and agonizing at worst. You begin each game with your simple Mega Buster--a basic beam gun attack--and each boss you kill drops a new weapon. Each of these weapons is the weakness of a different robot master. And the beginning of each game is a matter of figuring out which boss has the simplest AI and then killing him and then proceeding in order of weaknesses with the rest of the enemies.There's one simple problem there. The game gives you zero hints as to the order these fights should occur or which enemies are weak to what. So unless you're ready to dive into the internet to figure out good boss rotations, be prepared to spend hours experimenting until you figure out bosses' weak points. And even if you have the proper weapon, you'd better hope you beat the boss on your first try, because you aren't always given the chance to refill your special weapons' energy meters, That weapon is your sole hope of winning most fights, which means you have to start the whole level over again if you lose.That's assuming you make it to the boss fights. Starting with three lives is a big challenge when Mega Man's levels are digital gauntlets designed to kill you at every turn. Dozens of enemy types are spread throughout the six games, along with bottomless pits, spike pits, laser traps and other perils. The ways that Mega Man can, and will, die are numerous. At it's best moments, Mega Man offers the player recognizable patterns and enemy behaviors, and if you're patient you can learn how to survive and persevere. I got to points in Mega Man 2 and 3 where I could get to the boss rooms without getting hit more than a couple times. But Mega Man isn't always that fair.Pixel-perfect precision barely comes close to describing the Jedi-like reflexes needed to consistently excel at specific levels in this game. Platforming is stiff and unresponsive to begin with and any jumps that require the bare minimum of finesse can feel like a coin flip for success. And although patterns are Mega Man's bread and butter, you'll have to learn most of these patterns by dying--a lot. There are levels with surprise enemies and environmental obstacles, and some levels are just plain glitchy. The Snake Man level in Mega Man 3 is particularly egregious because you will often just slide off the rising fans you use to traverse the final portion of the stage. Later bosses attack in patterns, but there's so much variation to how they play out that properly estimating some of them is an act in controller-smashing futility. I rarely felt triumphant, but I often I felt unsure why I'd finally won this time. The speed running community for these games clearly shows that people can conquer every last bit of enemy programming and platforming, but for anyone who's played a platformer or action game in the last decade, it's hard to return to games that are this obtuse and unresponsive.Watching the evolution of Mega Man's abilities between games, however, makes the worst frustrations of earlier entries seem less torturous. It took me nearly six hours to beat the Robot Masters in the first game, and the later entries are significantly easier--though they all have their own degrees of frustrationand brokenness. The welcome additions of the chargeable Mega Buster and the ability to slide, as well as Mega Man's loyal dog Rush, give you new ways to overcome challenges. And the steady creep towards more intuitive patterns in later games compared to the throw-you-int-the-deep-end approach to the first games makes them less of a chore. Mega Man IV is the best entry in the collection, as it achieves a degree of accessibility without sacrificing difficulty.The Mega Man Legacy Collection holds more value as a window into gaming's past and the importance of preserving our cultural touchstones than it does as something I actively want to keep playing. There were countless moments throughout my near 20 hours with the game where I know I would have moved on to something less punishing if I weren't playing it for review. But I'm glad I own the Mega Man Legacy Collection. It's a peek into the early days of complex level design, interlocking combat mechanics, basic physics, and the best of what could be accomplished visually and sonically on the NES. Just don't ask me to beat Snake Man again. Please, never ask me to do that."}