{"ref": "https://www.gamespot.com/reviews/shadowrun-hong-kong-review/1900-6416246/", "date": "September 18, 2015", "game_name": "Shadowrun: Hong Kong", "text": "Shadowrun, as a universe, is already a great marriage of two very separate, very Western fantasy scenarios; one part D&D-inspired elves-and-dwarves witchcraft and wizardry, one part William Gibson-brand gritty, street-level cyberpunk. The series has done a fantastic job exploring both of these aspects through several games now, but with Shadowrun: Hong Kong, the series adopts an Eastern flavor, incorporating a classic facet of the cyberpunk genre for the first time in its nearly 30 year tenure.The change-up is welcome, in part because not much else about Shadowrun has changed since 2013s well-received Shadowrun Returns. The focus in Shadowrun Hong Kong is exactly where it belongs, and thats on the storytelling. Narrative, character development, and world-building are king here. The plotting is a little uninspiring: Youre an ex-con, recently released, now trying to make an honest living in Seattle, when you get a call from your estranged foster father to return to China. Not even five minutes after stepping onto Chinese soil, you find out your foster father is missing, presumed dead, and theres an APB out to arrest you, your brother, and anyone seen with you that evening. And by arrest, of course, they mean brutally murder on sight.So begins the tale of how you became a Shadowrunner, a member of the vast, unstoppable network of scrappy cybercriminal underdogs fighting the questionably good fight against the cabal of mega corporations running the worlds lower classes even deeper into the dirt. In another universe, this could very easily be the futuristic brother of Grand Theft Auto: Chinatown Wars, yet another tale of a low-level underling killing their way into the mantle of boss in the name of revenge, just with the twist of being able to create your own character out of the multiple fantasy races and RPG classes offered at the outset. For occasionally long swaths of the game, thats exactly what it is. But Shadowrun has far too weighty a pedigree to make it that simple.The focus in Shadowrun Hong Kong is exactly where it belongs, and thats on the storytelling.Most of your time in Shadowrun is spent playing it strictly as a point-and-click adventure, running messy errands for your Triad boss, a badass old buzzard named Kindly Cheng. Missions involve no small amount of investigation, collecting clues from crime scenes, interviewing eyewitnesses, organizing thefts, making back-alley deals for information, negotiating trades and delivering messages, in ink or blood, to the worst brand of scumbag on the planet.When words wont do the trickthough quite often, they canyou turn to the sword. The turn-based isometric gameplay of Shadowrun: Hong Kongs predecessors is back, unchanged, and things get tense and brutal from the very first fight, when two potential allies take a bullet to the head before you even remember their names. Its actually a bit unforgiving for folks jumping into the series for the first time, which is a possibility, considering this is a complete disconnect story-wise from the previous titles. The surely, youve done this before expectation is jarring when you get thrown in at the deep end.Theres a small tutorial for basic combat, and anyone whos played XCOM will pick up on things quickly; its more or less the same system, with some melee combat and magical summoning thrown in for good measure. Combat puts you on an invisible grid, with each character in your crew free to attack, heal, move around a specified distance each turn at the cost of Ability Points the more elaborate the maneuver. The mix of fantasy and cyberpunk comes into play here too. A shotgun-wielding orc might find himself facing off against a human casting a fire spell, providing a distraction so a katana-wielding samurai can slip behind the enemy and get critical melee damage. Winning depends entirely on tactical prowess, getting characters to cover, getting damage bonuses for flanking, slowing your enemies before they even manage to get their turn. The reward, regardless: money and Karma points, which can be spent upgrading your main characters abilities.Even then, its both blessing and curse that, more often than not, youre spending your time reading and talking to NPCs rather than killing street punks and corporate stooges. Many of the games missions involve making your Shadowrunner talk their way out of a situation instead of fighting their way out.It wouldnt be cyberpunk without some measure of hacking, however, and the Matrix-- the system by which Shadowrunners can hack into computer systemsdoes fill a little bit of the gap there for action, though not necessarily in the most accessible and enjoyable of ways. Its an isometric stealth mini-game, essentially, where your avatar in the Matrix must sneak past security systems to get to a specific node of information or a killswitch for a computer system. The actual gameplay in these sections is given a quick splash screen explanation, and then youre on your own. It gets easier once you level up, but the game is notoriously stingy with the Karma points required to do so, even after the games most hectic fights. Its almost universally better figuring out the non-hacking alternative, of which one always exists.The turn-based isometric gameplay of Shadowrun: Hong Kongs predecessors is back, unchanged, and things get tense and brutal from the very first fight.It might seem counter-intuitive for a game trying to be engaging for 1520 hours not to break up the reading with a fight--and without a doubt, to some people, thats exactly what may happen--but not when the writing is this good. Evil men and women will often earn pity or at least grudging respect, and you are given the options through dialogue to respond to those emotions in kind. Mysteries often have several alternative solutions, depending on who you talk to and just how down and dirty you want to get. Sometimes, its worth talking to an NPC just to hear their story. Much of the playtime depends less on how many side missions you take on, and more on how much time you spend getting to know the people around you, even though its possible you may never meet them again. Fleeting as these interactions may be, they offer some of the best storytelling moments in the game. One of my favorites is told by an Irish elf who leaves their faction to create a new Tir Na Nog--a realm of eternal youth. Her purpose is really just to hand you a key to a sewer, and yet I spent 10 minutes chatting with her about her dealings with the new IRA, and how some of the creatures of Irish legend happen to be real.The story streamlines after some time when the real plot presents itself, though this introduces a scary new element of the citizenry of Hong Kong all experiencing the same terrifying nightmare, and falling victim to homicidal insanity. It uses Chinese myth and spirituality in an interesting way, albeit with a few predictable elements. Players who have already taken this trip with Shadowrun Returns and its expansion may find themselves wanting a bit with the gameplay, and newbies will have quite the learning curve to surmount, but if you see the gameplay as an adequate means to experience the more satisfying narrative end, Shadowrun: Hong Kong more than earns your attention."}