{"ref": "https://www.gamespot.com/reviews/transworld-surf-review/1900-2826733/", "date": "May 17, 2006", "game_name": "TransWorld Surf", "text": "When it comes to games based on board sports, you can always point to a single title that has validated one of the sports and ushered in a flood of imitators and hangers-on. SSX legitimized the snowboarding game. Tony Hawk's Pro Skater legitimized the skateboarding game. And now it appears that Angel Studios has legitimized the surfing game with Transworld Surf, easily the most graphically impressive, deepest, and by and large most enjoyable surfing game to be released yet.Though it uses several conventions laid down by both Tony Hawk and SSX, Transworld Surf offers a unique gameplay experience. Your surfer can perform a variety of wave-face tricks, lip tricks, and aerial tricks. Face tricks include cutbacks and bottom turns, which are executed simply by cutting back and forth across the face of the wave, as well as the more advanced snap turns. You can perform three different types of lip tricks, known as floaters, which are the surf equivalent of grinding. There are also a variety of aerial tricks at your disposal, which are executed by using the shoulder buttons in conjunction with the X button. Points can also be scored by riding inside the curl, a relatively simple task, but the claustrophobic feeling you get inside the barrel really makes it one of the most fun portions of the game. Each surfer also has a special trick that can be executed only after you've filled up your trick meter, which is done by pulling off big combos.Combos in Transworld Surf are much more forgiving than in other board sports games. Instead of having to transition directly from one trick to another, a combo can be a set of maneuvers performed in quick succession, with the score being multiplied by mixing up what types of tricks you pull off. The game's physics model generally works well, though you'll occasionally find yourself in a physically impossible position or wiping out for no apparent reason. Considering the complex physics associated with surfing, these problems are almost forgivable, though it doesn't keep them from detracting from the experience. Players who approach Transworld Surf as if it were a skateboarding or snowboarding game will be brutally rebuffed, as the basics of surfing are fundamentally different from those two sports. Like most surf games before it, Transworld Surf has a pretty steep learning curve, and you'll want to spend a lot of time honing your skills before you jump into the meat of the game.The different modes of play in Transworld Surf are the action sports standards: There's a pro tour mode, a single run mode, a free surf mode, and a multiplayer mode. As you might've already guessed, in the pro tour mode you'll take one of 13 pro surfers through the game's nine locations. You'll surf each location at two different times of day--with these runs being goal-based--and enter a competition run before moving on to the next location. In the goal-based runs, you're given a set of objectives that must be completed before you can move on to the competition and, ultimately, to the next location. Each level has the standard point objectives, as well as a photo-shoot objective, where you must pull off a trick within sight of a surf photographer hanging out in the water. Other objectives call for you to perform big trick combos or especially long barrel runs. Each level also has an objective specific to the location. As you play through the game, you'll have to free dolphins from tuna nets, scare birds away from the surf, and ollie over boats. These location-specific objectives are usually some of the most difficult to accomplish and don't feel nearly as natural as some of the other skill-based goals. In the competition mode, you'll face three other pro surfers in three, three-minute heats. You'll be judged on the quality of your run, with points being docked for wiping out or running into or spraying another surfer. The variety of play offered by Transworld Surf keeps things interesting, and while the trick system isn't the deepest ever, it's deep enough and finds equilibrium between intuitiveness and challenge.Transworld Surf is the first surfing game to acknowledge that surfing does not occur in a vacuum. While you're out on the water, you'll encounter debris in the water--man-made and naturally occurring--a variety of sea life, and other surfers. The game has a karma meter, which will move from good to bad depending on how you interact with the surfers and the sea life. If you snake waves from other surfers, spray them with your wake, or generally mistreat the marine life, you're more likely to get abused by other surfers or, worse, eaten by a shark. It's really a minor point, and if you didn't know about it, you might simply chalk your bad luck with sharks up to fate. But knowing about karma and using it to your advantage will make playing Transworld Surf a more enjoyable experience.Surfing games have never been known for impressive graphics, but Transworld Surf effectively breaks that trend. Angel Studios, the developer of Transworld Surf, is best known for its racing games like the Smuggler's Run series, Midnight Club, and Test Drive Off-Road Wide Open. One of the hallmarks of Angel Studios' games has been natural, believable environments, and its experience pays off in Transworld Surf. Since the focus of the game is on your surfer and the water, an exceptional level of attention has been paid to both of these elements. Your surfer generally animates smoothly, crouching down onto his board in especially tight barrels, dipping his hand into the water to help maintain balance, and making subtle celebratory gestures after pulling off an especially big combo. While the surfer just looks good, the water in Transworld Surf looks simply incredible. The use of high-quality textures and bump mapping and the natural shape of the waves make you believe that you're out in the surf, making that suspension of disbelief needed for past surfing games obsolete. The game tends to run at a solid 60 frames per second; however, on the odd occasion that a wave crests at two different points, eventually forming together into a single barrel, you might notice a tad bit of slowdown. And, as with many of the Xbox launch titles, Transworld Surf lays on some of the special effects just a tad too liberally. Your surfer's skin has a little bit too much shine to it, and the effect of water spray beading up on the ~camera lens~ is overdone and ultimately distracting. Aside from these minor offenses, the game has a level of polish that sets it apart from other surfing games or console launch games. Simply put, surfing has never looked and felt more real than in Transworld Surf. Transworld Surf's sound really works well on multiple levels and comes together to produce a truly immersive effect. Each round of surfing is introduced with an announcer breaking down the current conditions of the surf, such as wave size, tide conditions, and the temperature of the water. The environmental sounds are generally great, and it's the smaller details that really do an excellent job of selling the surfing experience. The splash of your surfer paddling to the next big wave, the increasing roar of the water as a curl slowly creeps up behind you, the muffled sounds you'll hear once inside the tube, and the fizzing of the sea foam as you pass over a wave are all expertly executed. The soundtrack is also quite impressive, if only because of the sheer volume of songs available. Instead of falling back on a soundtrack of Dick Dale-style surf rock filler, Transworld Surf actually has eight different soundtracks that cover a variety of musical genres. So whether you prefer punk rock, alterna-rock, heavy metal, hip-hop, down tempo, or good old-fashioned surf rock, Transworld Surf has got a soundtrack for you. The only thing that tarnishes the game's aural production is that when one song ends and another begins, you'll experience a split-second pause in the gameplay. Considering that in the pro competition mode a run lasts three minutes, and considering that a good portion of the soundtrack is made up of songs that clock in at just under three minutes, this stutter usually happens right when you least want it to. Due to qualities inherent to the sport of surfing, Transworld Surf won't enjoy the same level of accessibility as titles like SSX and Tony Hawk and will definitely appeal to a more niche market than either of those games. However, if you're an action sports fan who's grown tired of the more well-worn board sports, Transworld Surf offers a unique gaming experience that's worth checking out. Fans of surfing and surfing games will agree that no other game has been able to capture the essence of surfing quite as well as Transworld Surf. And when it comes down to it, Transworld Surf is one of the best action sports titles in the Xbox launch lineup.Surfing games have never been known for impressive graphics, but Transworld Surf effectively breaks that trend. Angel Studios, the developer of Transworld Surf, is best known for its racing games like the Smuggler's Run series, Midnight Club, and Test Drive Off-Road Wide Open. One of the hallmarks of Angel Studios' games has been natural, believable environments, and its experience pays off in Transworld Surf. Since the focus of the game is on your surfer and the water, an exceptional level of attention has been paid to both of these elements. Your surfer generally animates smoothly, crouching down onto his board in especially tight barrels, dipping his hand into the water to help maintain balance, and making subtle celebratory gestures after pulling off an especially big combo. While the surfer just looks good, the water in Transworld Surf looks simply incredible. The use of high-quality textures and bump mapping and the natural shape of the waves make you believe that you're out in the surf, making that suspension of disbelief needed for past surfing games obsolete. The game tends to run at a solid 60 frames per second; however, on the odd occasion that a wave crests at two different points, eventually forming together into a single barrel, you might notice a tad bit of slowdown. And, as with many of the Xbox launch titles, Transworld Surf lays on some of the special effects just a tad too liberally. Your surfer's skin has a little bit too much shine to it, and the effect of water spray beading up on the ~camera lens~ is overdone and ultimately distracting. Aside from these minor offenses, the game has a level of polish that sets it apart from other surfing games or console launch games. Simply put, surfing has never looked and felt more real than in Transworld Surf.Transworld Surf's sound really works well on multiple levels and comes together to produce a truly immersive effect. Each round of surfing is introduced with an announcer breaking down the current conditions of the surf, such as wave size, tide conditions, and the temperature of the water. The environmental sounds are generally great, and it's the smaller details that really do an excellent job of selling the surfing experience. The splash of your surfer paddling to the next big wave, the increasing roar of the water as a curl slowly creeps up behind you, the muffled sounds you'll hear once inside the tube, and the fizzing of the sea foam as you pass over a wave are all expertly executed. The soundtrack is also quite impressive, if only because of the sheer volume of songs available. Instead of falling back on a soundtrack of Dick Dale-style surf rock filler, Transworld Surf actually has eight different soundtracks that cover a variety of musical genres. So whether you prefer punk rock, alterna-rock, heavy metal, hip-hop, down tempo, or good old-fashioned surf rock, Transworld Surf has got a soundtrack for you. The only thing that tarnishes the game's aural production is that when one song ends and another begins, you'll experience a split-second pause in the gameplay. Considering that in the pro competition mode a run lasts three minutes, and considering that a good portion of the soundtrack is made up of songs that clock in at just under three minutes, this stutter usually happens right when you least want it to.Due to qualities inherent to the sport of surfing, Transworld Surf won't enjoy the same level of accessibility as titles like SSX and Tony Hawk and will definitely appeal to a more niche market than either of those games. However, if you're an action sports fan who's grown tired of the more well-worn board sports, Transworld Surf offers a unique gaming experience that's worth checking out. Fans of surfing and surfing games will agree that no other game has been able to capture the essence of surfing quite as well as Transworld Surf. And when it comes down to it, Transworld Surf is one of the best action sports titles in the Xbox launch lineup."}