{"ref": "https://www.gamespot.com/reviews/clock-tower-3-review/1900-6024583/", "date": "April 3, 2003", "game_name": "Clock Tower 3", "text": "There's a continuing debate in some circles about the potential artistic merit of video games. One side argues that games are a mere mindless pastime, a diversion meant to distract you from everyday tedium. The other side thinks games can be more--that they can combine gameplay and high production values to create a visual and cerebral experience that's akin to an interactive movie. The Metal Gear Solid games are probably the most well-known example of this phenomenon, and in Clock Tower 3, Capcom has provided us with a game that has similar intentions. The game's cutscenes, both prerendered and real-time, were directed by Kinji Fukasaku of Battle Royale fame, and his influence pays off in spades. Alas, Clock Tower 3's movie portions are stronger than the gameplay that underpins them, and the result is a game that you'll probably want to finish more for its storyline than for the fun you'll have actually playing it. The cutscenes in the game are some of the best that you'll find in any game. The previous two Clock Tower games were critically maligned point-and-click adventure games released for the PlayStation. Thankfully, Clock Tower 3 throws out this antiquated control mechanism, which doesn't work very well with a console controller, and replaces it with a more appropriate Resident Evil-style scheme. You play the role of Alyssa Hamilton, a British teenager away from home at boarding school. Alyssa receives a distressing note from her mother instructing her to go into hiding immediately for her own safety and to avoid the family home at all costs. As any dutiful teen would do, Alyssa goes straight home to find her mother, and upon arriving she's thrust into a sinister, otherworldly plot that involves ancient spirits and spans across several time periods in London. The story in Clock Tower 3 is surprisingly interesting, and you're given just enough plot details as you go along that you're always inspired to keep playing. Clock Tower 3 is essentially a survival horror game, although it diverges somewhat from the standard formula set forth by Resident Evil and Silent Hill. The game is divided up into chapters, and each chapter except the first one has a brutal serial murderer on the loose that you have to deal with. Chapter two, for instance, puts you in the streets of mid-World War II London and has you trying to stop a madman with a giant hammer. To stop these sadists, you have to satisfy some sort of goal, which often consists of helping the ghosts of the murderers' previous victims find peace by gathering items and solving basic puzzles. For instance, the ghost of the little girl murdered by the rampaging hammerman can only be satisfied by receiving the locket given to her by her late father in life. After you fulfill your objective for the chapter, you'll enter a combat mode to fight against the villain and send him packing. As a 14-year-old schoolgirl, you can imagine that Alyssa doesn't pack the firepower of, say, Resident Evil's Jill. Indeed, a small girl in a Catholic school uniform blasting zombies with a shotgun would be pretty absurd. That's not necessary here, though, because unlike most games of this type, Clock Tower 3 doesn't really have any combat to speak of. There are no common enemies, only the restless ghosts of departed citizens. The one tangible enemy in each chapter is the murderer you're trying to escape, and you deal with those characters by hiding or otherwise utilizing features of the background to your advantage. Alyssa does have a jar of holy water that she can splash on ghosts and murderers to temporarily stun them, but you can only be rid of ghosts by satisfying their tormented souls with a sentimental item, and you can only fight the murderers after you've helped the ghosts. In place of a standard life bar, Alyssa has a panic meter that fills up as she's pursued by ghosts and the killer in a chapter. When the panic meter is filled, she stumbles around, freezes up in fright, and generally becomes hard to control. If you can hide long enough, she'll calm down and you can continue playing. One hit when in panic mode is fatal, however. This gameplay model sounds enjoyable in theory, and sometimes it is. Other times, though, it can be maddeningly frustrating. The killers are very often on your heels--too often really--and it can be very difficult to figure out what you need to do next when you're constantly trying to find a hiding place and lose your assailant. The AI can also be pretty flaky--you can sometimes enter a hiding place right before the killer's eyes, and he'll immediately start to look around the room as if he didn't see where you went. Of course, this is necessary for the gameplay, but that doesn't make it any more believable. Finally, the boss fights are often pretty annoying. You're equipped with a divine bow and arrow, and you have to charge up your arrows to do maximum damage to your opponent. You're entirely stationary while charging your shots, though, and you can't even change your aim once you start to charge, which leaves you completely open for attack. The game is fun sometimes, not so fun other times--the gameplay could have used another coat of polish, but at least it's got the right idea. Clock Tower 3 is a suitably dark and moody game. The environments are all very dingy and sinister, and they manage to achieve an intangible quality of authenticity--that is, you do feel like you're crawling the damp streets of a bombed-out London in the 1940s, for instance. Character models (of which there are few) look fine and animate pretty well. The game doesn't feature a whole lot of music, but each chapter has an urgent piece that plays when a killer is on your trail. Clock Tower 3 won't blow you away with its sensory stimuli, but it certainly gets the job done, and it manages to be pretty creepy in the process. As mentioned before, the cutscenes in the game deserve special mention. Quite simply they're some of the best that you'll find in any video game. The voice work in the game is suitably British and generally high quality, and the cinemas make brilliant use of motion capture in animating the characters. Further, it's very clear that the scenes were lit, framed, and paced by a veteran film director, because they play out exactly like, well, a movie. It's really rare to see this level of cinematic flair in a video game, and it's cool that the late, venerable Fukasaku got to add his talent to a new medium before his passing. The story and cinematics in Clock Tower 3 are actually strong enough that they make up for some of the gameplay's flaws and spur you on to keep playing. Clock Tower 3 is disturbingly violent. One last note: Clock Tower 3 is disturbingly violent. This isn't a Resident Evil style of violence, where you're blowing the heads off of zombies; rather, the violence is realistic and a bit alarming. One scene depicts the hammer-wielding killer bludgeoning a young girl to death, while another has a villain gouging a man's eyes out and then plunging his elderly mother into a vat of acid. It's not really worse than you'll see in any slasher flick, but the game's personal treatment of the violence makes it hit home. The M rating is definitely earned. Clock Tower 3 is mostly a welcome change of pace from the typical survival horror formula. It's interesting to play a game in this genre where your character basically can't fight back--you have to hide and use your wits to win instead of gaining an increasingly heavy arsenal of weapons. This powerless feeling as you flee from a pursuer adds a good bit to the scariness of the game--it's just a shame that the gameplay parts don't come together in a less awkward fashion. It's also on the short side--at just five chapters, you'll be able to finish it in roughly six to eight hours. But the grievances presented by the game's mechanics and brevity are made up for by the excellent production values and interesting storyline. In the end, the uneven parts of Clock Tower 3 add up to a pretty enjoyable whole."}