{"ref": "https://www.gamespot.com/reviews/mat-hoffmans-pro-bmx-review/1900-2717983/", "date": "May 11, 2001", "game_name": "Mat Hoffman's Pro BMX", "text": "It's been a little more than a year since Activision announced that it would be expanding its alternative sports line beyond the realm of skateboarding games. While we've yet to see much of the company's upcoming snowboarding and surfing games, Activison's BMX game is finally upon us. The game uses the same engine as the one in Tony Hawk's Pro Skater, with a few small changes that make the game feel different enough to be interesting, though not different enough to alienate fans of Tony Hawk.OK, take the original Tony Hawk's Pro Skater. Change the videotapes you collected to magazine covers, change the skateboards to bikes, alter the game's physics a bit to account for the differences between bikes and boards, and add the manuals from Tony Hawk 2. That pretty much sums up how the game works. The trick system is identical, allowing for lots of different tricks, from barspins to supermans. However, the timing on the tricks is a little different. It takes a little longer to get back on a bike after doing a superman than it would take to straighten out a skateboard for landing, so you must let go of your tricks earlier to give your rider time to remount the bike. Also, the control is much stiffer on the tricks. If you don't tap out your moves in a deliberate fashion--hitting the directional before hitting the button rather than hitting them at the same time--nothing happens. Once you've adjusted to these small changes, the game becomes extremely easy to grasp. Anyone who took the time to master the original Tony Hawk game shouldn't have trouble applying those skills here, and will be able to complete Hoffman with every cover and gold medals within four hours.The list of modes closely mirrors the Tony Hawk games. In career mode, you'll start out on a weaker bike, and you'll have to go through various levels, accomplishing tasks to earn magazine covers. Every level aside from the two competition levels contains five covers. Two of them are obtained by breaking certain score-based barriers. One is granted by picking up five letters around each level--the letters spell out ~trick,~ while another is earned by breaking five things in a level, things like portable toilets, satellite dishes, or vending machines. The fifth cover is simply hidden somewhere on each level, usually requiring you to accomplish a difficult grind or jump sequence to reach its high perch. Earning covers unlocks new levels and bikes with better stats. Aside from the career mode, there's a free ride mode, a single run option, and multiplayer options, such as graffiti, trick attack, and horse. Finally, the game has a Tony Hawk 2-style create-a-level mode, which has some nice features, though the levels you can create seem limited when compared with the huge, sprawling environments in the rest of the game.Between the game sound and the game's eclectic soundtrack, Mat Hoffman's Pro BMX is totally amazing. Little things in the sound, like the clicking sound of a rotating crank when you're in the air, add a lot of realism to the game. Meanwhile, the soundtrack rivals Wipeout XL for the title of best licensed soundtrack ever. The game features a wide mix of music that, in theory, should be able to please most players. Some of the bands included are Outkast, Deltron 3030, Bad Brains, Stone Roses, Jurassic 5, Paris, and a collaboration between Static-X and dead prez. Mat Hoffman's Pro BMX manages to be a pretty good-looking PlayStation game. Even though most riders do similar tricks, some of them do the tricks slightly differently. So every superman in the game doesn't look identical, which is a nice touch. The textures are a little rough, and the models can be blocky at times, though the wheels on the bikes look almost totally round. Also, some textures have a tendency to warp, and they appear to be vibrating at times. These flaws are a little less disheartening when you take into account the large size of most of the game's levels.While the game doesn't have the trick depth of its closest competitor, Dave Mirra Freestyle BMX, Hoffman simply blows Mirra out of the water in every other way imaginable and stands as the best BMX game on the market. However, once you widen that focus to include other alternative sports games, Activison's other efforts leave Mat Hoffman in the dust. If this game had shipped prior to Tony Hawk 2, it would have bridged the gap between the two Tony Hawk games nicely. Now, however, this ~Tony Hawk 1.5~ feels a little out of place, especially with games like Tony Hawk's Pro Skater 3 on the horizon. If you're looking for some filler while you wait for Tony Hawk 3, Mat Hoffman's Pro BMX will fit the bill. But those who go in looking for a game equal to Activision's skateboarding franchise will be a little disappointed."}