{"ref": "https://www.gamespot.com/reviews/the-chronicles-of-narnia-the-lion-the-witch-and-th/1900-6141014/", "date": "May 17, 2006", "game_name": "The Chronicles of Narnia: The Lion, The Witch and The Wardrobe", "text": "The Chronicles of Narnia: The Lion, The Witch and The Wardrobe is a video game based on the just-released film of the same name, which is, in turn, based on the classic book series from C.S. Lewis. The game is a basic fantasy adventure with plenty of puzzle-solving and some light combat. It closely follows the events of the movie and actually uses quite a bit of footage from it to set up and close each stage of the game. As a result, you might not want to play this game until after you've seen the film, lest you run the risk of spoiling the plot. Even if you haven't seen the movie or read the books, you'll still be able to appreciate some of the interesting and varied levels, each of which present unique challenges that require you to utilize the special abilities of each of the four playable characters. This isn't a basic hack-and-slash platformer, as it actually requires a bit of critical thinking, which is a nice change of pace from the usual game based on a movie license. That said, there are still plenty of better, family-friendly, action adventure games available, and unless you find the Narnia license to be especially appealing, there's no reason to go too far out of your way to play it. Oh great, another game based on a family film... If you're interested in the game, then you're probably already familiar with the basic storyline. The Chronicles of Narnia: The Lion, The Witch and The Wardrobe is based on the Disney movie of the same name. The game follows the events of the movie and actually uses quite a bit of footage from it to set up and close each stage. Even if you haven't seen the movie, it doesn't take long to get the gist of what's going on. You can play as any of the four Penvensie siblings: Peter, the older brother; Susan, the older sister; Edmund, the younger brother; and Lucy, the younger sister. One day, while playing hide and seek, young Lucy wanders into a magical wardrobe that transports her to the fantasyland of Narnia. Eventually, all of the children end up in Narnia, where they embark on an epic adventure to save the world from the evil White Witch. The story is filled with your basic fantasy standbys like ogres, Minotaurs, dwarves, and talking animals. There are 15 levels in the game, although some are fairly small. For example, one entire level is a boss fight. Depending on which level you're playing, you'll be able to play as at least two of the four children, although some levels require you to use all four. This is because each character has special moves and abilities that are required to overcome certain obstacles. Peter is the strongest of the bunch, so you can use him for fighting off enemies or breaking through barriers. Susan is your ranged attacker, and she can throw snowballs and tennis balls, as well as use a bow and arrow. Edmund is a decent melee fighter, but he's also light and athletic enough that he can climb trees or posts and walk on delicate surfaces like thin ice or weakened floorboards. Lucy is small, so she can crawl through small passages to reach areas that the other children can't. Lucy can also charm animals and use them to attack, and she can use a first-aid skill to heal all the children. But wait, this one is actually pretty decent. You can switch between the characters at any time with a press of a button, and you'll often have to do so to complete various challenges. In one boss fight you'll have to attack the boss with Peter, then use Lucy to climb on the boss' back to distract it, and then have Susan take out the dwarven archers that attempt to shoot Lucy off the boss' back. It sounds complicated, but once you figure out what you have to do in a given situation, it's fairly easy to manage all of the characters. There are also tandem abilities that require two of the children to team up. When you move close to a character you can press a button to initiate a cooperative attack. You can team up with Susan and Lucy to slide Lucy through breakable barriers or to fire a volley of flaming arrows into the air. Also, Peter can grab Edmund and swing him around to inflict radial damage or to break down tough barriers. There are multiple different cooperative attacks for each combination of characters, although most of the challenges don't require you to use cooperative attacks at all. The biggest problem with this multiple-character system is that the artificial intelligence is completely useless. You can only control one character at a time, so there's always at least one character being controlled by the AI. Most of the time, the characters just follow you around and don't do anything helpful. It's frustrating when you're trying to get a shot off with Susan, only to have a bunch of enemies attack you while the other children stand there doing nothing. Likewise, the AI doesn't know how to use any of the characters' special abilities. It would be extremely helpful if Lucy could automatically use her first-aid ability when a character is about to die, rather than have to switch characters each time you need to use that skill. If you can get past the occasionally frustrating camera angles and the brain-dead AI, you'll have some fun with this game. When you aren't fighting enemies or solving puzzles, you'll spend a lot of time collecting coins, statues, and bonus items. Coins can be used to purchase new abilities and upgrades for each of the characters. You can buy health upgrades, special moves, and cooperative attacks at any time, although some abilities only become available later in the game. You can unlock bonuses like movie clips by collecting other bonus items and statues. All this collecting feels tacked on here, though, and at times it just makes the game feel awkward. In an early level you can get coins by hitting pieces of furniture, so you have to run around the house beating the crap out of chests of drawers and end tables, which just seems ridiculous. The game does a decent job of emulating the overall presentation of the movie. The characters are all modeled after the actors from the movie, and although they look a bit plastic, they are fairly detailed and animate well when attacking. We saw a bit of slowdown in a couple of areas, but it isn't sustained or pronounced enough to be much of a problem. The biggest visual problem is the fixed camera angles. You don't have any control of the camera, which can be really frustrating when you're trying to see what's going on around you. The sound is about average. The soundtrack seems like it's lifted directly from the film, and it works well in the game. The sound effects are pretty weak and are repeated so often that you'll quickly get sick of them, especially some of the more annoying screeching and grunting noises that enemies make as they attack. Narnia does a good job of emulating the movie--just beware of potential spoilers. The three console versions look about the same, although the Xbox version is slightly sharper than the other two. The game looks the best on the PC if you have the hardware to max out the resolution, although some of the lighting effects make the characters look even more like shiny, plastic dolls than they do in the other versions. The controls are simple and easy to pick up on all three versions, so it's just a matter of your preference there. The PC supports a gamepad, which is really the only way to play this game, because the default keyboard controls are rather awkward. If you like the movie and the book, you'll probably enjoy The Chronicles of Narnia: The Lion, The Witch, and The Wardrobe game for the five or six hours that it manages to stay entertaining. And if you have a friend or sibling that wants to play, he or she can simply pick up a controller and jump in at any time for some two-player cooperative action. The best thing that can be said about the game is that it makes good use of the license, and it feels like the developer actually put some thought into the design, rather than simply taking the characters from the movie and slapping them into a basic button masher. On the other hand, if you don't care one way or another about the license, you won't find anything here that hasn't already been done better in plenty of other games. The biggest problem with this multiple-character system is that the artificial intelligence is completely useless. You can only control one character at a time, so there's always at least one character being controlled by the AI. Most of the time, the characters just follow you around and don't do anything helpful. It's frustrating when you're trying to get a shot off with Susan, only to have a bunch of enemies attack you while the other children stand there doing nothing. Likewise, the AI doesn't know how to use any of the characters' special abilities. It would be extremely helpful if Lucy could automatically use her first-aid ability when a character is about to die, rather than have to switch characters each time you need to use that skill. If you can get past the occasionally frustrating camera angles and the brain-dead AI, you'll have some fun with this game. When you aren't fighting enemies or solving puzzles, you'll spend a lot of time collecting coins, statues, and bonus items. Coins can be used to purchase new abilities and upgrades for each of the characters. You can buy health upgrades, special moves, and cooperative attacks at any time, although some abilities only become available later in the game. You can unlock bonuses like movie clips by collecting other bonus items and statues. All this collecting feels tacked on here, though, and at times it just makes the game feel awkward. In an early level you can get coins by hitting pieces of furniture, so you have to run around the house beating the crap out of chests of drawers and end tables, which just seems ridiculous. The game does a decent job of emulating the overall presentation of the movie. The characters are all modeled after the actors from the movie, and although they look a bit plastic, they are fairly detailed and animate well when attacking. We saw a bit of slowdown in a couple of areas, but it isn't sustained or pronounced enough to be much of a problem. The biggest visual problem is the fixed camera angles. You don't have any control of the camera, which can be really frustrating when you're trying to see what's going on around you. The sound is about average. The soundtrack seems like it's lifted directly from the film, and it works well in the game. The sound effects are pretty weak and are repeated so often that you'll quickly get sick of them, especially some of the more annoying screeching and grunting noises that enemies make as they attack. Narnia does a good job of emulating the movie--just beware of potential spoilers. The three console versions look about the same, although the Xbox version is slightly sharper than the other two. The game looks the best on the PC if you have the hardware to max out the resolution, although some of the lighting effects make the characters look even more like shiny, plastic dolls than they do in the other versions. The controls are simple and easy to pick up on all three versions, so it's just a matter of your preference there. The PC supports a gamepad, which is really the only way to play this game, because the default keyboard controls are rather awkward. If you like the movie and the book, you'll probably enjoy The Chronicles of Narnia: The Lion, The Witch, and The Wardrobe game for the five or six hours that it manages to stay entertaining. And if you have a friend or sibling that wants to play, he or she can simply pick up a controller and jump in at any time for some two-player cooperative action. The best thing that can be said about the game is that it makes good use of the license, and it feels like the developer actually put some thought into the design, rather than simply taking the characters from the movie and slapping them into a basic button masher. On the other hand, if you don't care one way or another about the license, you won't find anything here that hasn't already been done better in plenty of other games."}