{"ref": "https://www.gamespot.com/reviews/dracula-x-import-review/1900-2533899/", "date": "May 2, 2000", "game_name": "Castlevania: Symphony of the Night", "text": "Pity the poor deprived Saturn. Despite being generally acknowledged as the 2D powerhouse that the PlayStation wasn't, Saturn fans languished in agony as Sony's gray box received all manner of 2D platformers both great and small: Abe's Oddysee, Tomba, and of course, Castlevania: Symphony of the Night. Well, they can stop crying. Castlevania (or Dracula X as it's called in Japan) has finally arrived, Belmonts in tow, on the Sega Saturn.For anyone who doesn't know the premise behind Dracula X, the story picks up where the last Castlevania left off, at the final confrontation between Richter Belmont and that nasty Lord Dracula. Following Dracula's eventual demise, we fast-forward five years into the future, where Richter has gone missing. Mysteriously, the kingdom of Castlevania, which Richter had destroyed, reappears in the mist. Alucard, the son of Dracula, reawakens after a 400-year sleep to destroy, once and for all, his father, Count Dracula.Now that that's out of the way, most people will want to know the differences between the PlayStation version and the Saturn version. To be honest, it's a shame this game wasn't principally designed for the Saturn. If it was, perhaps the programmers might have better utilized the Saturn's 2D processing power and welded in some extra finesse like high resolution and extra character animations. As it is, aside from a couple of notable additions, this was simply a straight port from the PlayStation version. Not a great idea in any case.Although mostly aesthetic, the differences in the two versions are fairly annoying. The eye-pleasing transparencies seen in the PlayStation version have now been replaced by the infamous Saturn screens, and there is a fair amount of slowdown at the strangest possible places - usually when there is only one enemy onscreen. Oddly enough, loading times are also a touch longer. Not that any of this affects gameplay, but why on earth is it even an issue? Surely the Saturn could have found a way around these slight gaffes?Anyway, for those of you looking for the brighter side of things, this is what the Saturn version has exclusively. First off, you can now start the game as Alucard, Richter, or Maria. Those of you familiar with the PlayStation version know that after you beat the game you could then play as Richter via a code. In the Saturn version he's selectable from the start. As far as Maria is concerned, she is exclusive to this version, although her inclusion seems more slapped on at the last minute than anything else. While fairly powerful, it's not very inspiring to play as either Maria or Richter since they can't (or won't) carry any items or level up. The only real character with depth is Alucard. In the Saturn version you also get two exclusive levels that weren't in the PlayStation version. While these extra levels are nothing to write home about, they are exclusive and therefore better than nothing.Animation-wise, all the frames are there. Alucard is still one of the most animated 2D characters ever conceived. The soundtrack is still as vibrant, epic, and brilliant as ever, and the sound hasn't suffered anything noticeable. So for those of you who own a Saturn and don't have a PlayStation, this would be a good import to pick up. If it never came out for the PlayStation, gamers around the world would be calling this one of the best 2D platformers ever, and it is. It's just that a slightly prettier version came out before Sega got its dose of Castlevania. As it stands, Saturn fans have good reason to celebrate. Not only did they get a decent port of a great game, but they got a bunch of extras that can't be dismissed. Highly recommended no matter what system you own, Dracula X will always be a classic."}