{"ref": "https://www.gamespot.com/reviews/tenchu-wrath-of-heaven-review/1900-2912066/", "date": "March 4, 2003", "game_name": "Tenchu: Wrath of Heaven", "text": "The original Tenchu: Stealth Assassins was quietly released back in 1998, a matter of months before two other definitive stealth action games, Metal Gear Solid and Thief: The Dark Project, hit shelves. The three of them were each very different but collectively defined a style of gaming that's remained popular ever since, where staying hidden and striking from out of sight is the key, and slugging it out toe-to-toe with one's enemies is bad form. If anyone's keeping track, Tenchu by all rights is the first modern stealth game--a true innovator. Years later, though, its formula hasn't changed much: The series is up to its third installment in Tenchu: Wrath of Heaven, a game that's mostly similar to the original Tenchu as well as its 2000 sequel but that has been enhanced to take advantage of current-generation technology. Tenchu: Wrath of Heaven challenges you to once again think, move, and act like a ninja through numerous enemy-infested levels in an exotic feudal Japan filled with magic and mysticism. The game offers up plenty of great and memorable action, making Tenchu: Wrath of Heaven well suited not just for existing fans of the series, but for virtually anyone with an interest in the game's subject matter. As in previous Tenchu games, the main characters in this one are a young male and female pair of ninjas from the Azuma clan, the strong and disciplined Rikimaru and the lithe and lightning-fast Ayame. A number of other old characters make returning appearances, and while the plot doesn't necessarily expect you to be familiar with them, it won't make a whole lot of sense either way. The connection from one mission to the next is vague, and the story introduces a lot of details that aren't really fleshed out. Suffice it to say that both Ayame and Rikimaru are on the trail of a couple of bad guys, and what other excuse do you really need to step into their shoes and try to silently slay everything from lecherous samurai, to renegade ninjas, to potbellied demons, to festering zombies, to weird automatons, to evil monks? This isn't lighthearted stuff, as both Rikimaru and Ayame are equipped with a good variety of moves designed to deal swift, painful death to their enemies. Like in previous Tenchu games, Rikimaru and Ayame can kill any foe with a single attack if they can sneak up on that foe--though if detected, the two can still hold their own in a head-on fight. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tenchu: Wrath of Heaven Video Review The game's story mode initially lets you choose either Rikimaru or Ayame, each of whom has a good-sized 10-mission campaign for you to fight through. Once you finish those, a third not-so-secret character, a martial artist doctor named Tesshu, also becomes available and has his own slightly shorter campaign. Tesshu isn't as conventional of a ninja as the other two and fights bare-handed, hitting his enemies' pressure points or dislocating and breaking their limbs as necessary, with plenty of dramatic flair. Each character's campaign has some replay value due to the game's multiple difficulty settings and also because there are three variations on each level, which change around the layout of enemy guard patrols. The campaigns are all somewhat similar, meaning you'll revisit mostly the same locations from one campaign to the next, though your objectives in them and your path through them will be different. Nevertheless, while Tenchu: Wrath of Heaven does have a lot of missions and a lot of variations on those missions, you'll get to know the game's relative few locations--from a bizarre castle filled with traps, to a ronin village, to a cemetery--very well by the time you've gone through all three campaigns. The settings and objectives of each mission do vary, but each one plays out roughly the same way. You control your ninja from a third-person perspective and must work your way through each large, sometimes mazelike level while dispatching enemy guards when their backs are turned. Your ninja can see farther than your enemies can, and moving about while crouched often allows you to remain completely invisible to your enemies even when you'd expect them to be able to see you. Your character is virtually silent, too, so it's possible to run right up and murder an enemy who's looking the other way. An indicator representing your ninja's heightened senses informs you of when enemies are nearby and of which stage of alert they're in so that you know when to tread carefully or when to actively stalk for prey. Furthermore, your ninja can use a wide variety of gadgets and items in each mission, from poisonous rice balls that can distract and paralyze enemy guards, to explosives, to throwing stars, to bear traps, to mind control devices, but most of these--with the exception of the healing potions that restore you to full health--aren't essential. They can still be a lot of fun to use, though. Potions aside, the other item that often comes into play is the grappling hook, which lets your ninja scale high walls and grab onto otherwise unreachable ledges. You can use the hook to latch onto most surfaces, and this not only serves to make your ninja seem extremely mobile, but also gave the level designers of Tenchu: Wrath of Heaven license to create big, multistory environments rather than purely flat ones. The thrill of the hunt in Tenchu: Wrath of Heaven can be quite thrilling indeed. The characters have different stealth kill moves depending on whether they catch the opponent from behind, from the side, from the front, from above, and more, and all these motion-captured animations look really good. Certain types of opponents can be quite tough if fought head-on, so there's definitely incentive to get the stealth kill, especially since landing enough stealth kills in one mission unlocks a new special move for your character. On the other hand, the campaigns never strictly require you to remain hidden (though you're ranked at the end of each level based on your stealth), and at the default difficulty setting, the combat in Tenchu: Wrath of Heaven is actually rather easy for the most part. If that enemy ninja you're sneaking up on happens to notice you, you should still be able to take him down in a one-on-one fight. His attacks won't hurt you too much, and he'll do a pretty poor job of blocking yours. And it's relatively rare to come up against more than one opponent at a time, let alone more than two, though those situations are definitely more dangerous.Getting ganged up on in Tenchu: Wrath of Heaven is dangerous partly because the camera perspective can cause you to get blindsided. The R1 button allows you to reset the camera behind your character, which works pretty well, but sometimes the camera will do its own thing and leave you with a less-than-adequate vantage point. For example, the camera automatically tilts downward when you're near a ledge, which is great if you're trying to get the drop on an enemy below--but not great if you're trying to time a jump across a bottomless pit. Actually, bottomless pits are probably the biggest source of frustration and the biggest source of challenge in Tenchu: Wrath of Heaven, as the few stages that include deadly drops are by far the most difficult, again because of camera issues and because of the relative ease of the combat. What an ignoble way for a ninja to die. The gameplay has a few other small flaws. In some situations the right analog stick lets you conveniently adjust the camera perspective, and at other times it doesn't. During head-on combat, there's a lot of clipping, and you and your foe will often seem to pass right through each other. These aren't major issues, but they may detract a bit from your enjoyment of the game. The stealth kill sequences in Tenchu: Wrath of Heaven certainly are one of the highlights of the game. Enemies aren't that smart even when not engaged in combat, and they will conduct simple, extremely predictable patrols until they notice you or get killed by you. If it's the former, they'll give chase, sometimes dropping into said bottomless pits in the process--and if you manage to get out of their line of sight, which usually isn't hard, they'll conduct a halfhearted search for a few seconds before foolishly returning to their patrol, setting themselves up for a stealth kill again. There's never the fear of having alarms go off or having reinforcements pour in or anything like that, and surprisingly, the gameplay doesn't involve hiding in shadows--only around corners, behind obstacles, and on higher ground like rooftops. You also needn't worry about disposing of the corpses of your foes. So for better or worse, Tenchu: Wrath of Heaven is actually one of the most forgiving stealth games to date, notwithstanding those pesky pitfalls. In addition to the campaigns, Tenchu: Wrath of Heaven also features a two-player split-screen mode, which includes a handful of missions designed for cooperative play as well as a versus mode. The cooperative missions are definitely the highlight, as they allow you and a friend to execute great-looking double-team stealth kills. The co-op missions are disjointed and aren't part of the main storyline, but each has unique objectives, and they can be quite a bit more challenging than the missions in the campaigns. Meanwhile, the versus mode lets you and a friend choose from most of the game's main characters (plus some hidden unlockable ones) and slug it out against each other and a bunch of enemy grunts. Tenchu's combat system isn't that great and mostly consists of jamming on the attack button to string together attack combos or holding down the block button to defend against similar combos, so the versus mode is a diversion at best. All in all, though, the inclusion of multiplayer features is a good bonus, especially since the frame rate tends to remain perfectly smooth here just as it does during the main single-player portion of the game. The silky smooth frame rate is one of the best aspects of the graphics, though the character models for Rikimaru and Ayame in particular are also extremely well done. Their swords glisten realistically, and they move with the sort of grace and agility that's probably to be expected from master ninjas such as themselves. Many of the other characters in the game also look good, such as the numerous boss opponents you'll be forced to fight (none of whom are especially tough). Vanquished foes die spectacularly, spraying blood everywhere, though this is more stylish than grisly. The game's presentation does have some shortcomings. On very rare occasions, the frame rate can seize up, such as if you try to herd a bunch of enemies onscreen at once, though again, it's perfectly smooth the vast majority of the time. More importantly, most of the game's environments aren't particularly detailed and are often enough just straightforward corridors or wide-open spaces with room to hide behind cover. Also, some of the animations in the game are held over from previous installments of Tenchu and look noticeably worse than the new ones. Nevertheless, these graphical issues stick out only because, by and large, Tenchu: Wrath of Heaven looks great. A multiplayer mode, three campaigns, and several variations on all the campaign levels add up to some good replay value. The game's audio is of similarly high quality. Though the English voice acting is mostly well done and is provided by some of the most experienced voice actors in the business, Activision thankfully included the option to play the game with Japanese voices and English subtitles, for an authentic touch. Either way, you'll notice that standard enemy guards repeat the same lines of dialogue a bit too often, adding to the sense that you're picking off one mindless foe after another. Since this is a game about stealth, as you can imagine, there isn't a ton of loud noise in Tenchu: Wrath of Heaven, but what sound effects there are sound good. Meanwhile, the music is definitely the highlight of the game's audio and features numerous tracks that mix traditional Japanese instruments and electronic ones for a distinctive sound. Some of the tracks are a bit short and will loop frequently during the course of a long level, and the game's music doesn't change dynamically depending on whether you're skulking around or fleeing for your life, but it's still outstanding and adds a lot to the game's atmosphere. Tenchu: Wrath of Heaven may not be a huge departure from previous games in the series, but that's mostly to its credit. The series yet retains its own unique style and very cool main characters. Though the stealth mechanics themselves aren't necessarily as complex as those of other recent stealth games like Tom Clancy's Splinter Cell and Hitman 2: Silent Assassin, they work well and can make for some highly gratifying sequences. Most of the other aspects of gameplay--acrobatics with the grappling hook and having to explore all the large levels, for example--are also solid. And between the different level variations and the multiplayer features, Tenchu: Wrath of Heaven has plenty of lasting value for good measure, making it a game that not only lives up to its predecessors' own high standards, but also to the generally high standards of this popular style of gaming. Getting ganged up on in Tenchu: Wrath of Heaven is dangerous partly because the camera perspective can cause you to get blindsided. The R1 button allows you to reset the camera behind your character, which works pretty well, but sometimes the camera will do its own thing and leave you with a less-than-adequate vantage point. For example, the camera automatically tilts downward when you're near a ledge, which is great if you're trying to get the drop on an enemy below--but not great if you're trying to time a jump across a bottomless pit. Actually, bottomless pits are probably the biggest source of frustration and the biggest source of challenge in Tenchu: Wrath of Heaven, as the few stages that include deadly drops are by far the most difficult, again because of camera issues and because of the relative ease of the combat. What an ignoble way for a ninja to die. The gameplay has a few other small flaws. In some situations the right analog stick lets you conveniently adjust the camera perspective, and at other times it doesn't. During head-on combat, there's a lot of clipping, and you and your foe will often seem to pass right through each other. These aren't major issues, but they may detract a bit from your enjoyment of the game. Enemies aren't that smart even when not engaged in combat, and they will conduct simple, extremely predictable patrols until they notice you or get killed by you. If it's the former, they'll give chase, sometimes dropping into said bottomless pits in the process--and if you manage to get out of their line of sight, which usually isn't hard, they'll conduct a halfhearted search for a few seconds before foolishly returning to their patrol, setting themselves up for a stealth kill again. There's never the fear of having alarms go off or having reinforcements pour in or anything like that, and surprisingly, the gameplay doesn't involve hiding in shadows--only around corners, behind obstacles, and on higher ground like rooftops. You also needn't worry about disposing of the corpses of your foes. So for better or worse, Tenchu: Wrath of Heaven is actually one of the most forgiving stealth games to date, notwithstanding those pesky pitfalls. In addition to the campaigns, Tenchu: Wrath of Heaven also features a two-player split-screen mode, which includes a handful of missions designed for cooperative play as well as a versus mode. The cooperative missions are definitely the highlight, as they allow you and a friend to execute great-looking double-team stealth kills. The co-op missions are disjointed and aren't part of the main storyline, but each has unique objectives, and they can be quite a bit more challenging than the missions in the campaigns. Meanwhile, the versus mode lets you and a friend choose from most of the game's main characters (plus some hidden unlockable ones) and slug it out against each other and a bunch of enemy grunts. Tenchu's combat system isn't that great and mostly consists of jamming on the attack button to string together attack combos or holding down the block button to defend against similar combos, so the versus mode is a diversion at best. All in all, though, the inclusion of multiplayer features is a good bonus, especially since the frame rate tends to remain perfectly smooth here just as it does during the main single-player portion of the game. The silky smooth frame rate is one of the best aspects of the graphics, though the character models for Rikimaru and Ayame in particular are also extremely well done. Their swords glisten realistically, and they move with the sort of grace and agility that's probably to be expected from master ninjas such as themselves. Many of the other characters in the game also look good, such as the numerous boss opponents you'll be forced to fight (none of whom are especially tough). Vanquished foes die spectacularly, spraying blood everywhere, though this is more stylish than grisly. The game's presentation does have some shortcomings. On very rare occasions, the frame rate can seize up, such as if you try to herd a bunch of enemies onscreen at once, though again, it's perfectly smooth the vast majority of the time. More importantly, most of the game's environments aren't particularly detailed and are often enough just straightforward corridors or wide-open spaces with room to hide behind cover. Also, some of the animations in the game are held over from previous installments of Tenchu and look noticeably worse than the new ones. Nevertheless, these graphical issues stick out only because, by and large, Tenchu: Wrath of Heaven looks great. The game's audio is of similarly high quality. Though the English voice acting is mostly well done and is provided by some of the most experienced voice actors in the business, Activision thankfully included the option to play the game with Japanese voices and English subtitles, for an authentic touch. Either way, you'll notice that standard enemy guards repeat the same lines of dialogue a bit too often, adding to the sense that you're picking off one mindless foe after another. Since this is a game about stealth, as you can imagine, there isn't a ton of loud noise in Tenchu: Wrath of Heaven, but what sound effects there are sound good. Meanwhile, the music is definitely the highlight of the game's audio and features numerous tracks that mix traditional Japanese instruments and electronic ones for a distinctive sound. Some of the tracks are a bit short and will loop frequently during the course of a long level, and the game's music doesn't change dynamically depending on whether you're skulking around or fleeing for your life, but it's still outstanding and adds a lot to the game's atmosphere. Tenchu: Wrath of Heaven may not be a huge departure from previous games in the series, but that's mostly to its credit. The series yet retains its own unique style and very cool main characters. Though the stealth mechanics themselves aren't necessarily as complex as those of other recent stealth games like Tom Clancy's Splinter Cell and Hitman 2: Silent Assassin, they work well and can make for some highly gratifying sequences. Most of the other aspects of gameplay--acrobatics with the grappling hook and having to explore all the large levels, for example--are also solid. And between the different level variations and the multiplayer features, Tenchu: Wrath of Heaven has plenty of lasting value for good measure, making it a game that not only lives up to its predecessors' own high standards, but also to the generally high standards of this popular style of gaming."}