{"ref": "https://www.gamespot.com/reviews/tony-hawks-pro-skater-2x-review/1900-2825024/", "date": "May 17, 2006", "game_name": "Tony Hawk's Pro Skater 2x", "text": "Tony Hawk's Pro Skater 2x is the equivalent of a ~director's cut~ edition, containing the original product and some nominal enhancements. While the game is technically the best version of Tony Hawk 2 to date and while the addition of the Tony Hawk 1 levels is a nice touch, the game feels a little dated, whether you compare it to the rest of the Xbox lineup or the recently released Tony Hawk 3 for the GameCube and the PlayStation 2. While not a terrible game by any means, it's definitely designed to appeal to both the ~hiding under a rock for the past year~ set and the ~owns only an Xbox~ crowd. Anyone playing Tony 3 or anyone with the DC version of Tony 2 needn't bother. Like the rest of the series, Tony Hawk's Pro Skater 2x is a freestyle skateboarding game that revolves around various level goals. Each stage of the game has a collection of goals, some of which are score based, while other objectives challenge you to smash a set number of objects in a level, perform a certain trick with a certain object in the level (kickflipping from roof to roof, for instance), and so on. Each goal has a dollar amount attached to it. Completing goals earns cash that can be used to increase your skater's stats or customize his arsenal of tricks. Reaching dollar plateaus unlocks the next level, and so it goes. Some levels are competition oriented--here, you'll simply try to impress the judges with a clean one-minute run rather than collect items or break things. The game starts you out with the full Tony Hawk 2 career. Once that is completed, a short 2x career mode, made up of entirely new levels, is unlocked. Winning a medal in the Tony 2x competition level opens up the Tony Hawk 1 career mode. While the Tony 2 and Tony 1 levels are, for the most part, well designed, balanced, and free of problems, the 2x levels, which are new and exclusive to this version of the game, don't hold up nearly as well. There are some nice textures and lighting effects used in the exclusive areas, but the design is quite dull when compared with the standard set by the real levels. The game also has a few small bugs. Occasionally, bailing into the fence in the Philly level from Tony 2 will cause you to warp through it, allowing you to reach the skate park without knocking down the fence first. It's also pretty easy to get stuck between a wall and some scaffolding in the new construction yard level, but you can escape that with no problem. These few gripes aside, however, the game plays just like Tony 2 with the addition of a grind balance meter similar to the one introduced in Tony Hawk 3. The meter helps you stay on your board during long grinds and definitely makes grinding significantly easier. Aside from the main career mode, there's free-skate and single-session modes, which let you take the levels at your own pace, away from the goal-oriented career. A create-a-skater mode lets you customize your own skater from head to toe, and unlike in Tony Hawk 2 (though just like in Tony Hawk 3), you can create female skaters here. The multiplayer section of the game allows for up to four players to play on one Xbox and eight players to play on two units that have been linked together, though more populated games will be limited to free-skate and trick-attack competitions. The other games include Horse, in which you do a trick, and if the next player can't beat your score, he gets a letter; graffiti, in which doing tricks on unclaimed items in a level turns them into your color, and another player can steal items from you only by doing a better trick on your claimed items; and the self-explanitory tag.When compared with other Xbox games, Tony 2x underachieves in the graphics department. While it's easily the best-looking version of Tony Hawk 2, surpassing both the Dreamcast and PC releases, it definitely lacks the polish and high-quality textures of Halo and Dead or Alive 3. The game makes excellent use of lens flare and lighting effects to deliver more realistic shadows and settings. Additionally, the game lays the bump mapping on as thick as it gets, giving most of the textures a more realistic look. The game also has a nice, long draw distance that all but eliminates the heavy draw-in that was seen on less-powerful hardware. Some of the level of detail stuff is a little screwy, though, as you'll often see squares of grass ~pop~ from low- to high quality as you skate closer. The game animates very well, running at a smooth frame rate and showing off better, cleaner animation transitions than other versions of the game. At times, the game almost seems like it's animated a little too well, resulting in a game that has roughly the same game speed as other versions of Tony 2 yet manages to feel significantly slower. Also worth noting is that anyone who has been exposed to Tony Hawk 3 will feel extrasluggish while playing 2x due to Tony 3's extreme speed increase. The major space increase inherent in moving from a CD-based format to a DVD-based one seems to have been wasted here, as some of the ending movies are extremely artifacted and pretty low quality. The soundtrack, also taken from Tony Hawk 2, covers a lot of ground in terms of genre, including groups such as Naughty By Nature, Powerman 5000, Rage Against the Machine, Dub Pistols, Anthrax (featuring Public Enemy), and Bad Religion. The game's sound effects are quite good, effectively conveying the noise of your trucks slamming against rails, the sound of your wheels on different types of terrain, and so on. Another nice touch is that the Tony Hawk 1 levels have the original THPS1 sound effects, so rail clinks and a few other sounds are different. Your love of Tony Hawk's Pro Skater 2x depends directly on your involvement with other games in the series. If you've already played the heck out of both Tony Hawk 1 and Tony Hawk 2 on different platforms, the updated graphics and new 2x levels don't add anything significant to the experience, and you won't get much out of the game unless you intend to play the expanded multiplayer modes on a LAN. If you've played Tony Hawk 3 at all, 2x is going to seem almost entirely unplayable due to its slower speed and more limited combo potential. But 2x represents the ultimate version of a classic game, so anyone who is looking for a nice, solid freestyle sports game for the Xbox and who isn't looking for a graphical showpiece for his or her new system won't be disappointed.When compared with other Xbox games, Tony 2x underachieves in the graphics department. While it's easily the best-looking version of Tony Hawk 2, surpassing both the Dreamcast and PC releases, it definitely lacks the polish and high-quality textures of Halo and Dead or Alive 3. The game makes excellent use of lens flare and lighting effects to deliver more realistic shadows and settings. Additionally, the game lays the bump mapping on as thick as it gets, giving most of the textures a more realistic look. The game also has a nice, long draw distance that all but eliminates the heavy draw-in that was seen on less-powerful hardware. Some of the level of detail stuff is a little screwy, though, as you'll often see squares of grass ~pop~ from low- to high quality as you skate closer. The game animates very well, running at a smooth frame rate and showing off better, cleaner animation transitions than other versions of the game. At times, the game almost seems like it's animated a little too well, resulting in a game that has roughly the same game speed as other versions of Tony 2 yet manages to feel significantly slower. Also worth noting is that anyone who has been exposed to Tony Hawk 3 will feel extrasluggish while playing 2x due to Tony 3's extreme speed increase. The major space increase inherent in moving from a CD-based format to a DVD-based one seems to have been wasted here, as some of the ending movies are extremely artifacted and pretty low quality. The soundtrack, also taken from Tony Hawk 2, covers a lot of ground in terms of genre, including groups such as Naughty By Nature, Powerman 5000, Rage Against the Machine, Dub Pistols, Anthrax (featuring Public Enemy), and Bad Religion. The game's sound effects are quite good, effectively conveying the noise of your trucks slamming against rails, the sound of your wheels on different types of terrain, and so on. Another nice touch is that the Tony Hawk 1 levels have the original THPS1 sound effects, so rail clinks and a few other sounds are different. Your love of Tony Hawk's Pro Skater 2x depends directly on your involvement with other games in the series. If you've already played the heck out of both Tony Hawk 1 and Tony Hawk 2 on different platforms, the updated graphics and new 2x levels don't add anything significant to the experience, and you won't get much out of the game unless you intend to play the expanded multiplayer modes on a LAN. If you've played Tony Hawk 3 at all, 2x is going to seem almost entirely unplayable due to its slower speed and more limited combo potential. But 2x represents the ultimate version of a classic game, so anyone who is looking for a nice, solid freestyle sports game for the Xbox and who isn't looking for a graphical showpiece for his or her new system won't be disappointed."}