{"ref": "https://www.gamespot.com/reviews/journey-ps4-review/1900-6416195/", "date": "July 23, 2015", "game_name": "Journey", "text": "This review contains spoilers. For a spoiler-free review of Journey, you can read our original review here. It was my eighth playthrough and the tears still streamed, almost inexplicably; Journey is a song without words, reliant on its rapturous presentation and liberating movement to stir your mind and move your heart. With many games, I have wished that I could play them again for the first time--to experience that buzz that inevitably diminishes with each return visit. I will never need to waste this wish on Journey, however: each pilgrimage is as bittersweet as the last. How appropriate, given the game's theme of death and rebirth, that it feels so sorrowful, so joyous, and so true, each and every time.~Journey would be just as effective as a movie,~ a friend once told me, but I must contradict her. Not that I can argue against the game's sumptuous environments and its sublime musical score, which earned masterpiece status the moment Journey was initially released on the PlayStation 3 in 2012. Certain landscapes have rightfully gained iconic stature, becoming the very definition of video game beauty. One shot depicts the cloaked figure you control standing atop a sand drift and gazing at the mountain you must reach, which rises above the desert and pierces the clouds. The view is a master class in simplicity and color story; the peach-orange tones of the sand give way to a sea-green sky--hushed hues for a hushed visual revelation. Another seminal sight: you skate across the sand from right to left, illuminated by a godly beam of sunlight while watching the remnants of a lost culture rush past. The screen is awash with shades of amber, and the warm sand glimmers as if mixed with golden crystals. Yes, even as a work of cinema, Journey would instill wonder.But Journey is not a film, and its power is not gained by pretty pictures alone, but by your presence in its world. That side-scrolling glide would not choke me up if I couldn't feel the sand beneath my feet, and couldn't hit a ramp in just the right way to propel myself into the air. I wouldn't feel so beat down by the wind if I didn't feel it pushing against me as I trudged forward, and I wouldn't be so euphoric if I didn't personally experience the joy of skimming the ground. You see, you hear, and, vitally, you do. You surf the sand, you ride the wind, you seek shelter from danger, you make a friend. Seeing is believing, but it takes interaction to understand and know.Describing Journey means describing these moments and these emotions. The mechanical basics are almost secondary, and quickly explainable. As a mysterious robed figure, you cross sand and other terrain en route to a far-off mountain. You make use of only two buttons. By pressing X, you leap into the air and soar, an ability that is limited by the length of the scarf that trails behind you. By pressing circle, you cry out to whatever or whomever might heed your call. Journey is desolate, but you are not alone. You call to flocks of ribbons that hover about like restless robins, and they provide energy to your scarf. You meet cloth creatures that become travel guides and provide magic-carpet rides to higher ground. And presuming you play while connected to the Internet, you may encounter another lone individual in your travels--an individual you can ignore, or one you can accompany, chirping to her when you locate secret hieroglyphs, or when a fearsome ribbon-dragon appears and you don't want to continue alone.The mechanics are simple, but they establish a direct connection to the heart. Consider that flowing scarf, which trails behind you as you surf and soar, growing larger whenever you locate and touch a glowing flower. On a mundane level, it functions as a power bar that you fill up by making contact with cloth, and deplete by leaping. In context, the scarf is your life force, governing your ability to joyfully drift through the air. Gliding is Journey's most exuberant act, and by limiting its use, the game makes joy itself a currency.Journey uses this ecstasy-based economy to craft an emotional arc across its entirety, as well as to emphasize individual moments. Your scarf grows longer and longer, but a frightful encounter with that terrible ribbon-monster turns your rippling shawl into a mere stub. You cannot fight--you can only hide. Being discovered is devastating because the scarf is where the cheer and comfort of flight are stored. You were offered a heartwarming gift, only to have it yanked from your hands. Journey also uses this moment to connect you with your wordless cooperative companion. By this stage, you understand the meaning the scarf carries with it. Seeing your sidekick succumb like this forges empathy: you know that the monster has abolished his joy.This give-and-take is how the final levels gain their potency. Your ability to glide is diminished, then revoked. You no longer drift through sand, but brace yourself against an exhaustive wind. Then, the moment comes when all hope seems lost. You hold your breath and assume the worst. And then, the controller rumbles--just once, like a single heartbeat. And all that was taken away is restored, then multiplied, and multiplied again.This is the source of those tears. It is not the sadness of the loss, but the bliss of being honored for your perseverance. These are tears of elevation, so perfectly described by Roger Ebert in 2009. I have heard people describe this final climb in terms of an afterlife, and that's a reasonable interpretation of the scene, in which you float higher and higher towards the mountain's zenith. But even in the moment, whether or not you make this conscious religious association, you might feel weepy in spite of yourself. The gift was given, and it was taken away. And then, you were liberally showered with gifts, and so you ascended, higher and higher, towards your next journey.It is possible that Journey will not move you. In such a case, it is simply a beautiful game with a glorious soundtrack, grounded by a wistful cello melody later threaded through a warm quilt of winds and strings. The chance you might be swept away, however, makes it worth plunging your feet into the warm sand. If you are returning to Journey, a higher resolution and a higher frame rate are your ostensible rewards for returning--a return that doesn't cost you anything if you already own the game on the PlayStation 3. But Journey's real rewards aren't so pedestrian. Journey offers you comfort. It gives you companionship in a lovely but forsaken world. It gives you reason to dream even when facing loss."}