{"ref": "https://www.gamespot.com/reviews/burnout-legends-review/1900-6132926/", "date": "September 7, 2006", "game_name": "Burnout Legends", "text": "Driving games happen to be the genre the PSP is wealthiest in, but that didn't stop EA and developer Criterion's Burnout Legends from coming in and smoking the competition. Burnout Legends is almost like something of a greatest hits collection, combining gameplay elements with cars and tracks from the first three console Burnout games to form a package that actually feels pretty original and unique on its own merits. Apart from that, though, Legends simply makes fantastic use of the PSP technology, providing a profoundly impressive audiovisual experience and fast, frantic racing, both of which easily rank with the best the platform has to offer. The debut of the Burnout franchise on the PSP is a resounding success. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Burnout Legends Video Review Racing in Burnout is a high-speed, crash-filled affair. Your main controls are gas, brake, and boost. Boost is integral to your racing, as the opponent-racer artificial intelligence keeps it tight pretty much at all times. You earn boost by basically driving like a maniac, steering into oncoming traffic, nearly missing random cars, and, of course, knocking your opponents around like you own the place, ultimately hoping to take them out entirely. Burnout is all about the act of breaking cars in the most spectacular ways possible, especially those of your opponents. And Legends gets this aspect down pat with extremely satisfying crashes across the board. You won't see quite the level of crash detail on the PSP that you would in the console games (most notably, particle effects and explosions have been toned down), but even still, the wrecks are pretty fantastic. Cars deform, sparks fly, and given the right circumstances, broken husks of vehicles will fly through the air in incredibly satisfying ways. Not to mention that the game gives you ways to control your wreck so you can ultimately cause even greater carnage. Once your car is wrecked, you have the ability to slow time by holding down a button. Once that's done, you can use the game's aftertouch mechanic to literally steer your charred husk of a car into any other traffic you see fit, sometimes even taking out opposing cars in the process. Nowhere is this more prevalent than in the game's crash mode, where the whole point is simply to cause the most havoc possible by steering your car into a carefully crafted traffic scenario. Here you're graded by the monetary value of the damage you inflict on the available cars, and along the way, you can pick up cash bonuses. And if you cause enough wrecks, you can pick up a crashbreaker. Crashbreakers blow your car to smithereens, as well as any surrounding traffic, and they also give you the chance to steer your car around to cause even more damage--so you can pick up even more bonuses. The incredible sense of speed made famous on consoles is retained extremely well in Legends. Any Burnout fan is likely to already be quite familiar with the crash mode, and he or she will be intimately familiar with pretty much all the other modes, too. Apart from normal races, you'll also engage in: road rage races, where the whole point is to gain as many takedowns of opponents as possible in a set amount of time; burning laps, which are just basic time-trial races; faceoffs, in which you go against a single opponent to try to win his car; and pursuit mode, which was absent in Burnout 3 but will fondly be remembered by long-time Burnout fans. In this Chase HQ-like mode, you play as a cop car, and the whole goal is to chase down a target opponent and wreck his car silly until he's finally taken down. Though none of these modes are new in any way for the franchise, the familiarity of the gameplay actually works to Legends' benefit, as any fan should be able to pick it up and jump right into the action. And even those who have never played a Burnout game ought not to have much trouble, given the relative simplicity and overall addictiveness of the racing. All these races are tied together into one main single-player mode called world tour. You start the game with only one car class unlocked (the compacts), as well as just a couple of map locations available. As you race through assorted events, you'll eventually unlock more races, and then GP events, which (once beaten) will unlock more car classes. Crash events are kept separate from races, but you'll still need to play them to unlock certain cars. Between all the races and crash events, there are 175 to play through in total, and getting gold medals in all events is no quick exercise. It can be somewhat taxing trying to bust through the world tour mode in long stretches, as many of the race types and tracks repeat fairly regularly. But played in shorter, regular bursts, Burnout Legends can be a highly addictive single-player game. Plus, you've also got the multiplayer to jump into when the single-player becomes too much to deal with. The multiplayer races are for up to six players via ad hoc wireless play (no online, unfortunately), and you can engage in races, road rage races, pursuit races, party crashes, and double impact mode, which is basically a two-player single-crash event. Game hosts can create single games or tournaments with up to five rounds. The multiplayer action is definitely best played with more than a couple of players, as the game is at its best with lots of cars competing with and frequently taking down one another. But certain modes, like pursuit or double impact, work just fine if you've only got a single friend around. With 175 single-player races, it's unlikely you'll run out of stuff to do anytime soon. Legends also looks and sounds amazing. Part of what makes Burnout...well, Burnout, is its incredible sense of speed. And Legends doesn't disappoint on that front. The first few cars go fast, but not fast, so you might initially think that the PSP game got the short shrift. That notion will quickly traipse its way out of your head once you start unlocking the faster cars, as some of the higher-end vehicles go some kind of ridiculous fast. Sometimes this presents a problem, as due to the PSP's smaller screen, it can occasionally be hard to see oncoming traffic coming up on the horizon until it's too late. Thankfully, over time you'll start to get accustomed to the brief but noticeable signals the game gives when traffic is coming, like the glare of headlights or taillights, and that problem will essentially correct itself. It also bears mentioning that Legends maintains a brilliant frame rate pretty much all throughout, with noticeable drops only coming during extreme crashes with lots of smoke effects. There's one really annoying frame hitch that seems to occur when the soundtrack is switching songs, as the game will lock up for about a half-second. Fortunately, this momentary hitch never caused us to wreck or do anything stupid, but we certainly could have done without it. This is easily one of the best-looking games on the PSP. Soundwise, the audio effects in Burnout Legends are top-notch. Cars whiz by with big whooshes of air, engines rev to peak pitches, and every wreck sounds absolutely brutal. The soundtrack is made up of the typical EA Trax fare, with plenty of hipster-type indie punk and rock bands like Finch, Goldfinger, OK Go, Junkie XL, The Dead 60s, and Yellowcard. There are 21 tracks in all, and though some are repeats from other recent EA games, pretty much every track fits with the vibe of the game at least reasonably well. Perhaps the best part of Burnout Legends' audio is actually an omission--namely, the obnoxious radio DJ, whose chatter was merely a detriment to Burnout 3's in-game experience. All in all, Burnout Legends is pretty much exactly what you would want from a handheld Burnout game. The marriage of all the best aspects of the first three Burnouts into a single package makes for a deep, lasting game that also manages to be a consistently challenging and exciting endeavor pretty much the entire way through. While the PSP isn't exactly suffering from a dearth of quality racers, make no mistake about it: Burnout Legends is the best racer the PSP has to offer, and any PSP owner should definitely check it out. The multiplayer races are for up to six players via ad hoc wireless play (no online, unfortunately), and you can engage in races, road rage races, pursuit races, party crashes, and double impact mode, which is basically a two-player single-crash event. Game hosts can create single games or tournaments with up to five rounds. The multiplayer action is definitely best played with more than a couple of players, as the game is at its best with lots of cars competing with and frequently taking down one another. But certain modes, like pursuit or double impact, work just fine if you've only got a single friend around. With 175 single-player races, it's unlikely you'll run out of stuff to do anytime soon. Legends also looks and sounds amazing. Part of what makes Burnout...well, Burnout, is its incredible sense of speed. And Legends doesn't disappoint on that front. The first few cars go fast, but not fast, so you might initially think that the PSP game got the short shrift. That notion will quickly traipse its way out of your head once you start unlocking the faster cars, as some of the higher-end vehicles go some kind of ridiculous fast. Sometimes this presents a problem, as due to the PSP's smaller screen, it can occasionally be hard to see oncoming traffic coming up on the horizon until it's too late. Thankfully, over time you'll start to get accustomed to the brief but noticeable signals the game gives when traffic is coming, like the glare of headlights or taillights, and that problem will essentially correct itself. It also bears mentioning that Legends maintains a brilliant frame rate pretty much all throughout, with noticeable drops only coming during extreme crashes with lots of smoke effects. There's one really annoying frame hitch that seems to occur when the soundtrack is switching songs, as the game will lock up for about a half-second. Fortunately, this momentary hitch never caused us to wreck or do anything stupid, but we certainly could have done without it. This is easily one of the best-looking games on the PSP. Soundwise, the audio effects in Burnout Legends are top-notch. Cars whiz by with big whooshes of air, engines rev to peak pitches, and every wreck sounds absolutely brutal. The soundtrack is made up of the typical EA Trax fare, with plenty of hipster-type indie punk and rock bands like Finch, Goldfinger, OK Go, Junkie XL, The Dead 60s, and Yellowcard. There are 21 tracks in all, and though some are repeats from other recent EA games, pretty much every track fits with the vibe of the game at least reasonably well. Perhaps the best part of Burnout Legends' audio is actually an omission--namely, the obnoxious radio DJ, whose chatter was merely a detriment to Burnout 3's in-game experience. All in all, Burnout Legends is pretty much exactly what you would want from a handheld Burnout game. The marriage of all the best aspects of the first three Burnouts into a single package makes for a deep, lasting game that also manages to be a consistently challenging and exciting endeavor pretty much the entire way through. While the PSP isn't exactly suffering from a dearth of quality racers, make no mistake about it: Burnout Legends is the best racer the PSP has to offer, and any PSP owner should definitely check it out."}