{"ref": "https://www.gamespot.com/reviews/saints-row-iv-gat-out-of-hell-review/1900-6416007/", "date": "January 20, 2015", "game_name": "Saints Row IV", "text": "Saints Row developer Volition loves Johnny Gat. Saints Row fans, in general, like Johnny, but Volition loves that psychopath, and it's been trying to share the love for three games now, only to have him overshadowed by the gang of puckish rogues we know today. In that way, Gat Out of Hell was almost a foregone conclusion. Johnny was always going to get his time in the solo spotlight and all Volition needed was a good excuse to get that band of rogues we've come to love so well over the last three Saints Row games out of the way so it could happen.The irony is that when Gat Out Of Hell succeeds, it succeeds around Johnny, not because of him. He is more of a cipher than the player-created Boss. That's not because he's a bad character--he is slightly one-note here, and the storyline isn't doing the heavy lifting it does in the main game--but because Volition's obvious focus on world-building in Gat Out Of Hell is so strong. Virtually everything else small and character-based suffers as a result. This isn't necessarily the add-on you buy because you're looking for some sense of finality from these characters--How The Saints Saved Christmas actually managed to do more of that than anyone could have expected. You buy it because you're looking for one last jolt of wild, unhinged chaos from Saints Row in a brand spanking new playground, as the series as we know it moves onward and upward. Gat Out Of Hell delivers that, but it could have delivered so much more.When the game starts, The Boss (who can be imported from your Saints Row IV saves) is kidnapped by Satan himself for an arranged marriage to his demonic Disney princess daughter, Jezebel. Without even thinking twice, Johnny and Kinzie jump through a gateway to Hell to come to The Boss' rescue. Hell, in the Saints Row universe, feels like the unholy marriage of the nuclear, wind-blasted hellscape of the Keanu Reeves Constantine flick, and Biff Tannen's gaudy sleaze palace in Back to the Future II. It's about half the size of Steelport, but built entirely from scratch, and vastly more imaginative in its design. The humor is still persistent, with mean little passive aggressive jabs at its denizens on every street (a common billboard from Hell's ad bureau simply says ~If we're being honest, this is all your fault.~), but the city succeeds at bringing a broken, high-rising verticality to the mix, where floating platforms, impractical architecture, and arcane artifacts jut out of every corner. With the added details granted by next-gen horsepower, it's possibly the most memorable town Volition's ever plopped us in.You get every opportunity to enjoy that architecture, as the flight controls no longer have you gliding through the air like a gun-toting flying squirrel, but with full-on angel wings. It's got a lot in common with the Arkham titles in its approach to flight, with a right combination of dives, daredevil stunts, and split second timing needed to dart through the air above, around, and through gaps in buildings like, well, a boss. It's far more forgiving of mistakes, though, and you're able to get up to some breakneck, insane speeds in the process.Much of Johnny and Kinzie's combat repertoire is copy-pasted straight from Saints Row IV, although Johnny does get his own special animations for some seriously brutal melee combos. Superpowers make their way back, with a few minor tweaks (Stomp now has a vacuum variant, Telekinesis gets swapped out for the ability to summon monsters to your aid, Blast can drain life instead of setting things, redundantly, on fire). There are no costume options for characters or guns this time around, but the guns are all insane enough to make up for the lack of customization, especially the seven hidden weapons based on the deadly sins. Everything has its own hellish twist, though the variety has taken a minor hit.All of this is literally in aid of one thing: destroying everything. Where the freedom to wreak havoc was mostly just implied in previous games, Johnny and Kinzie's entire mission in this game is to get Satan's attention, and nothing gets Big Red to take notice more than murder, mayhem, and chaos. A lot has been brought over from Saints Rows past--Mayhem and Survival and variants on those two themes are a mainstay--but once again, Volition did take the time to make some improvements. Insurance Fraud, in particular, had started to become a slog, but the activity is now Torment Fraud, which now involves accelerating the pain and suffering of a poor derelict soul in order to get him out of Hell and back into the Almighty's good graces again ahead of schedule, all while Jane Austen narrates his hilarious life story. The Trail Blazing races now take full advantage of the flight ability, involving some ridiculously fun rides through claustrophobic caverns, alcoves, buildings, and 90-degree vertical climbs. Earning new abilities is now done by activating a hidden glyph with your powers, and fending off waves of powerful enemies with nothing but that ability and your guns. Opening up gateways to teleport around Hell is done by activating glyphs in dark chasms scattered throughout Hell, fending off numerous high-powered demons before a Legionnaire mini-boss demon shows up. The best new mini-game involves trying to prevent falling souls from getting into Satan's hands before they hit hellish ground, so Johnny/Kinzie have to snatch them up in midair. It feels like a side mission from a Superman game we never got, and plays better than any Superman game ever did.Aside from a repetitive new King of the Hill activity, all the activities are still as fun as ever. The issue is, well, that's it. While normally there are campaign missions guiding the madness in a particular direction, with the side missions there to speed up ability development, here, it's the entirety of the game, other than an occasional side mission to rescue some of Hell's more infamous inhabitants along the way. Therein lies the biggest problem with Gat Out of Hell: Those inhabitants--namely William Shakespeare, Vlad The Impaler, Blackbeard, and the DeWynter Twins from Saints Row: The Third--are set up as major helper characters whose assistance you'll need to cause the most ruin during your time in hell. What you'll get are a few nifty bits of historical fan fiction--in which Shakespeare became Satan's spymaster general and Vlad The Impaler's castle in Hell ends up being turned into Hell's official frat house--and then being sent on, you guessed it, more side quests. Each figure has Loyalty Quests, and you keep waiting for the character-specific material that made Saints Row IV's Loyalty Quests absolutely imperative, but they never come. If the missions weren't as fun as they were, it'd be far more of an annoyance. The reality is that it just makes the expansion feel a little more watered down than its premise and its best ideas deserved. The DeWynters running a security company in Hell, and Shakespeare being beloved by Satan's daughter as a private tutor are absolutely ripe with ideas, and its disappointing to watch nothing come of them.Sadly, this problem extends to the main storyline, where Johnny is trying to rescue The Boss from Satan's clutches. While the much ballyhooed musical sequence is a highlight, the game never capitalizes. Once Johnny and Kinzie have done enough to invoke Satan's Wrath (which literally, has a little meter in the menu screen), a cutscene triggers, allowing the story to continue, and all the best parts happen without your input. When Johnny finally gets to crash the fateful wedding, the best parts of it (a demon shootout, culminating in a certain tag-team move that's going to make many a wrestling fan grin ear to ear) happen during the cutscene, leaving only the final, irksome boss fight, leading to six short, amusing, but ultimately somewhat anticlimactic endings. The best part of the main story is Johnny and Kinzie being led by the nose by Dane Vogel, Ultor's dead CEO voiced by Jay Mohr, who gets to play a lot looser (and a lot more alcoholic) than in Saints Row 2. The expansion's best lines come from him, and he makes the tutorials a blast to live through; when the game finally shifts focus to the impending marriage at hand, his presence is missed. That's something that can be said much less about Johnny and Kinzie. Both are fun to hang out with in their own rights, but the expansion's truncated nature means we don't get nearly as much out of them as we want and need. It makes the expansion feel like a brief afternoon visit with old friends, as opposed to an epic send off, which wouldn't be expected of an expansion, but a premise this great warrants more than what we got.Saints Row IVs current gen spit shine is enough of a cause for celebration, so the fact that Volition decided to throw in a new expansion to boot feels like an embarrassment of riches on principle alone. It's an expansion that leaves a lot to be desired, only because theres enough fertile ground to support a full blown game. It's the kind of expansion that gets you imagining what else this world and these characters are capable of, which is the best kind of disappointment you can have."}