{"ref": "https://www.gamespot.com/reviews/bust-a-move-4-review/1900-2536151/", "date": "March 12, 2014", "game_name": "Bust-A-Move 4", "text": "Taito's bubble-popping puzzle game has been around in one form or another for half a decade now, and it's one of those games that seems perfect for the handheld format. For the most part, this conversion has worked out well, but there are a few annoyances that prevent Bust A Move 4 from achieving classic status. The objective of Bust A Move 4, as it always has been, is to clear the screen of differently colored bubbles. This is done by firing more bubbles up into the pile from your cannon at the bottom of the screen, which can be directed through 180 degrees. If you connect three or more like-hued bubbles together, they pop. Any bubbles that are hanging off them disappear, too, so there's plenty of opportunity for smart combinations and quick screen clearances. These of course result in huge point bonuses later on. Each level must be cleared before the bubbles inevitably descend to the bottom row of the screen, in which case it's game over. Special bubbles increase the game's variety: Glue bubbles remain on the screen taking up space until all the bubbles above them are destroyed; clone bubbles remain neutral and can't be cleared until bubbles they are connected to pop; and gems destroy all bubbles of a particular color once hit. Three game variations are available - puzzle, vs. com, and challenge. The first is the one most Puzzle Bobble/Bust A Move arcade players will be familiar with: Keep clearing screens until you lose. After clearing a stage you can choose what level to go on to via a map screen. Challenge plays in a similar style; in fact, it's almost like a baby puzzle mode. These two are fine but offer no great incentive to continue playing besides a harder challenge later on. Vs. com is where the action is. At the start of each game you can choose what character to be, and each one has a different range of bubbles that will most likely appear during the game. Once that's done you're thrown into a head-to-head match with a Game Boy-controlled opponent, and for the most part it puts up a decent challenge. However, it's easy to force the opponent to lose simply by taking your time with every shot. Despite this disappointing gameplay loophole there's plenty of fun to be had when you rack up extra lines of bubbles that are added to your opponent's pile by clearing many bubbles at once. Bust A Move 4 has a fair number of letdowns, we're sad to report. The first and most glaring omission is the lack of a two-player mode. That's just insane, Acclaim. There's absolutely no reason why this game couldn't have one. Moving on, we have the graphics. While we salute the more-than-impressive effort made to fit the intricate designs of the arcade original onto the tiny GBC screen, the lack of color is off-putting. The biggest offenders in this department are the bubbles themselves - there are plenty of colors available, yet many bubbles are colored in using stipple shading. Looks like the development team wasn't sure if it was going to add a GBC-specific mode or not until it was too late. The monochrome bubbles, which use symbols rather than colors, work well, but they're a distant second to playing on a Color machine. The important question: Is it worthy of purchase? Yes, especially if you're a fan of the still-addictive series. In the great scheme of things however this isn't as compelling as Puyo Puyo Sun. Of course, you can't buy Puyo Puyo Sun in the US yet...."}