{"ref": "https://www.gamespot.com/reviews/the-great-ace-attorney-chronicles-review-no-objections-here/1900-6417704/", "date": "August 12, 2021", "game_name": "The Great Ace Attorney Chronicles", "text": "Like a great detective novel, The Great Ace Attorney Chronicles gives us clues in its opening moments that wont pay off until its final hours. That trick is even more impressive here as the adventure games collected, The Great Ace Attorney: Adventures and The Great Ace Attorney 2: Resolve, were originally published two years apart and together tell one continuous 80 hour story. Clues, character arcs, cases--all are revealed slowly over the course of the two visual novels, culminating in one satisfying conclusion that ties it all together.Adventures, from 2015, and Resolve, from 2017, take players back roughly 100 years before Phoenix Wright ever entered the courtroom. Here, players take on the role of that famous ace attorneys ancestor, Ryunosuke Naruhodo, at the dawn of the 20th century. The story begins in Meiji Period Japan before traveling to Victorian-era England, where the bulk of the action takes place. That action, as in Phoenix Wright, involves collecting evidence from crime scenes, waiting for the right moment to use it in court and then presenting it at the right time during a cross examination to make a witness testimony fall apart.As The Great Ace Attorney: Adventures begins, Japan and Great Britain have just entered into a trade agreement. The ink on the agreement is barely dry--historically speaking, that is; a character later suggests that the agreement has been in place for a decade--so when Naruhodo is caught with a pistol in his hand at the scene of a visiting British professors murder, the resulting trial carries with it the weight of the fragile alliance between the two empires. With the case all but decided against him, Naruhodo must prove his innocence with the help of his best friend, Kazuma Asogi, a law student set to embark the next day for a study abroad program in England. The katana-wielding Kazuma is strong-willed, confident, and believes wholeheartedly that his friend is innocent, and that belief motivates Naruhodos own practice of law as the game progresses, with the young defense attorney understanding well the difference that his belief in his clients innocence can make.The game is great in moments like that opening case, when the player begins a case on their backfoot and must learn the facts on the fly. These cases, which introduce evidence over the course of the trial, much more capably sustain interest than the cases that have full-fledged investigations before you even enter the courtroom. Adventures final case, which features a lengthy investigation followed by an even lengthier court case, suffers from the feeling that it may never end.Both games feature court cases in the East and in the West, which means learning procedures for both Japanese and British courtrooms. The biggest difference is that British court cases are decided by a jury--who, in a fun visual metaphor, must cast balls of fire onto white or black braziers on a massive scale which looms over the courtroom--while Japanese verdicts are adjudicated exclusively by the judge. As a result, in both games, Japanese court cases function as a tutorial, introducing players to the basics of cross-examining witnesses and presenting evidence before the added complexity of the jury is added later on. The basic gameplay is fairly straightforward. After a crime occurs, you search the scene and find objects that may or may not have relevance to the case and as you do, theyre entered into the Court Record, so you can access them in the stand. Then, once a court case begins, you use the evidence youve collected to highlight issues in a witness testimony by cross examining them. While The Great Ace Attorney Chronicles is not entirely free from the I know what the game means, but it will only accept one specific piece of evidence problems that have popped up in past Ace Attorney games, its rare enough here that it didnt bother me. Plus, you can save anytime or switch to Story Mode, which makes the game play itself, if you ever get stumped.The distinct personalities on the jury add an extra layer of fun, requiring players to pit jurors against each other and contrast their contradictory statements to pinpoint holes in their reasoning. Often the reasoning presented is fuzzy. One guy who shows up in multiple juries just says that he wants the trial to be over so he can get back to work. Sometimes jurors just have a bad feeling about the defendant and let that prejudice cloud their judgment. Its your job to press them until they clarify their stance, then select their statement and another jurors statement to bring the contradiction to light. Its a smart system that requires some critical thinking from the player and I enjoyed the process of turning a statement over in my head, searching for a flaw.The upshot of introducing more and more mechanics as the game progresses is that the final case in Adventures is extremely long. While the tutorial case can be completed in three to five hours, the final case in Adventures took me roughly 10 hours to complete. Thats a long time to spend on one case and, as I approached the conclusion, the twists that were, initially, charming and exciting, became exhausting. Rather than actually solving the puzzle, it can feel like youre spending hours wrangling unwieldy pieces into place, despite coming to the correct conclusion long before the game reveals it.Clues, character arcs, cases--all are revealed slowly over the course of the two visual novels, culminating in one satisfying conclusion that ties it all together.These pacing problems mostly apply to Adventures, not Resolve. The sequel is a marked improvement on the first game, introducing overarching plotlines that kept me guessing the whole time, playing with structure to keep cases moving at a fast pace, and paying off character arcs that began in the first game in satisfying ways. Resolve is the better game, to be sure, but it draws much of its excitement and power from the foundation its predecessor laid. While Adventures often has you working through the entirety of an investigation before heading into court to try the entirety of the case, Resolve splits up the action. You investigate for a while, head into court for a while and then emerge for another opportunity to search for clues. This staggered structure helps Resolve maintain interest, and provides more opportunities for character development outside the courtroom.Both games boast plenty of great characters brought to humorous life with funny writing and animations. The purpose of the slow pace is evident here, as it gives the player plenty of time to get to know standout characters like the brilliant but error-prone Herlock Sholmes and his youthful mad scientist assistant, Iris Wilson. Herlock first shows up in the second case of Adventures before playing a major role in later cases and Resolve, and by the end I was just happy whenever he popped up. Capcoms take on the Great Detective--hes actually just straight-up called Sherlock Holmes in the original Japanese release--is humorously hapless. He is brilliant, but still manages to come to the wrong conclusions. This Sherlock feels a little like if Harry Potters Gilderoy Lockhart believed his own hype (and actually deserved it, for the most part). Herlocks errors invite Naruhodos correction via a recurring segment called the Dance of Deduction. Here, Herlock posits his ideas about what happened at a crime scene (which, again, are almost right), before Naruhodo comes in to course correct. These sections mostly involve rotating the camera around the guilty party to find and identify something theyre hiding or a clue they reveal with an involuntary glance. These bits arent complicated, but its always fun to hear Herlocks erroneous conclusion with the knowledge that another, better explanation is lurking beneath the surface.The art is a mixture of 3D models and 2D backdrops. It isnt quite as gorgeous as the 2D animation Nintendo employed in its Famicom Detective Club remakes earlier this year. But, it is a winning, sharp take on the visual style these games had on the 3DS upon release in 2015 and 2017. Character designs are striking and Capcom has given each character memorable animations. A harried soldier who attends his day in court with his infant child strapped to his back, and has to stop talking fairly often to push his mischievous, climbing child down his back is a funny early example. The Scotland Yard inspector Tobias Gregson is constantly munching away on a packet of fish and chips that, somehow, never seems to run out. A young prince, who shows up as a witness in a Resolve case, got big laughs from me by turning to the salesman next to him with a silver coin in hand, before knowingly looking into the camera to say, ~Im rich.~ The Great Ace Attorney Chronicles strikes an excellent balance, humanizing its central cast with deft characterization while allowing the members of the rogues gallery that take turns at its witness stand to exist in the realm of archetype. As a result, Adventures and Resolve are able to easily shift from funny to serious and back again.This is an impressively complete story. By the end of Resolve, I felt like all of the plot threads had been tied up; that questions that had lingered, some for almost 80 hours, had been answered. While Chronicles moves too slowly at times--especially during the Adventures half--the payoff at the end is worth the wait."}