{"ref": "https://www.gamespot.com/reviews/custom-robo-review/1900-6098835/", "date": "May 19, 2004", "game_name": "Custom Robo", "text": "Robot-on-robot violence seems to be at an all-time high these days, but the trend is nothing new. From 2D robot fighting like Cyborg Justice to 3D robot gunfights like Virtual On, robots have been beating the crap out of other robots for decades. Nintendo is contributing to this hot-button election year issue with Custom Robo, an action RPG of sorts that allows you to customize little robots and bring them into real-time battle. While the level of customization is nice, the RPG section of the game and the actual combat leave a lot to be desired. Custom Robo is a skill-based game, but the only truly necessary skill is the ability to hit the fire buttons as often as possible. Though you can dive right into the versus mode, the game won't be very exciting until you've played the RPG section of the game long enough to unlock enough parts to make for a varied battle. The single-player RPG puts you in the role of a teenage boy who is setting out to make his missing and assumed-deceased father proud by fulfilling his last wish--to become a commander, someone who is able to control custom robos. Custom robos, the highly customizable robot fighters, are only around 30 centimeters tall, but within the society found in the game they're used to solve conflicts and fight crime. You quickly join up with a bounty hunter outfit known as the Steel Hearts, and get right into the thick of things by stopping some crooks from stealing a new robo called Ray 01. From there you'll be sent around to several locations in the city, eventually uncovering a more insidious plot involving an autonomous robo that seems to be leaving a trail of bodies around the city. More importantly than the silly short story found in the RPG, is that as you battle in this mode you'll be unlocking new robo parts and, eventually, new stand-alone modes and options. These things make the other parts of the game playable, because you can't really have interesting battles without a wide selection of parts to choose from, and the game won't let you play exhibition matches against computer players until you unlock that option from the RPG side of the game. The real point of the game is to battle. Fighting is done in small, varied arenas. Your robo can be customized in five different areas, and the body type governs how a robo moves. Some types allow multiple air dashes, and others have different movement speed, different defensive capabilities, and so on. Each also has its own charge attack. You can select your main gun, which starts out as a simple blaster, but you'll quickly earn a three-way cannon, a flamethrower, and around 50 more weapons. Bombs tend to launch a large rocket up and over the arena--over 30 of these are found in the game, and they also have different attributes. Your final offensive ability is your shoulder-mounted pod weapon. The default pod is a slow-moving ground-based rocket, but you'll soon get faster pods as well as pods that are better suited for defensive maneuvers, such as the caboose pod, which fires two rockets behind you, covering a quick escape. The last custom part is a robo's legs. Different legs affect hover time and things of that nature. Combat plays out in real time with up to four robots skittering around the small arenas, unloading their three different weapons as often as possible. When you have more than one available target, a wrestlinglike lock-on toggle lets you select at which robot you want your shots aimed. The main strategy is to split your time between hiding behind walls in the arena to dodging shots and popping up over the walls to fire at your enemies. Battles tend to be over fairly quickly, especially against the computer-controlled robots, once you've figured out how to properly dash in to attack and dash away to dodge enemy fire. All told, the combat feels a little shallow. Despite options like tag-team battles, four-way free-for-alls, and so on, there isn't much strategy to the game beyond making sure that you're firing as often as possible when you aren't hiding behind something. Once you unlock some arenas and a variety of parts, the multiplayer mode is a lot more interesting. Graphically, Custom Robo looks fair, at best. The battle arenas are small and, for the most part, nondescript. The robos themselves are designed reasonably well, and some configurations look pretty cool. But the game rarely gives you a clear view of your robo once the battle has already started, and you'll spend more time focusing on the health numbers and other status information that appears around each robo than anything else. The RPG section of the game looks OK, but the character design and various locations are pretty bland. The game's sound is similarly dull, and there is not much in the way of standout audio. The music is fairly boring, and the text in the game is accompanied by an annoying prattling noise that is meant to simulate human speech. When you add it all up, Custom Robo for the GameCube doesn't really have enough to it to hold most players' interest for long. While you'll probably have some multiplayer fun with this one after you toil through the boring RPG section to unlock some parts, the payoff isn't really worth the effort. Fans of multiplayer combat may want to rent this one just to mess around with it, but it isn't worth too much more than that."}