{"ref": "https://www.gamespot.com/reviews/pokken-tournament-review/1900-6416381/", "date": "March 15, 2016", "game_name": "Pokken Tournament", "text": "Theres a lot to love in Pokken Tournament, but its most immediate joy comes from something so simple: two Pokemon physically interacting. This may seem trivial to most, but for longtime fans its the opportunity to finally scratch an itch thats been out of reach for 20 years.Fights in Pokemon have always played on the imagination. Clashes between exotic and captivating creatures are reduced to text boxes and back-and-forth wobbles. Its like reading telegrams about a fireworks display. Some visual flourishes add a dash of dynamism, but since combatants remain rooted to one spot, the physicality of brawls is lost.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Pokken Tournament - Video ReviewThat changes with Pokken Tournament, in which a pint-sized luchador Pikachu can punt a Charizard three times its size in the stomach, wrap its stubby arms around the dragon's thick neck, launch into the air, and Stone Cold Stunner it into the ground.What a delight it is to witness Nintendos iconic Pokemon unshackled, free to leap around and trade blows up close. Better yet, beneath the spectacle is a thoroughly satisfying set of fighting game mechanics. These are deep and technical but, crucially, the accessibility and tactical spirit of the RPG series has also been retained.Developer Bandai Namco has achieved this by splitting battles into two phases, which Pokken constantly shifts between. In the Field Phase, players use a ranged attack to prod their opponent from a distance. This attack can be executed during sideways movements or jumps and, if charged, will travel further and leave the enemy vulnerable upon being hit. At the right moment, a homing attack can be used to auto-pilot a fighter across the arena and deliver a powerful follow-up.The beauty of the Field Phase is that it creates strategy in simplicity. Both players have the same objectives and tools at their disposal. Although you can get up-close-and-personal, the focus is on firing and dodging projectiles, maneuvering into an advantageous position, then capitalising. Its engaging and thrilling in the same way thumb wrestling is: two players pecking at each other, waiting for that perfect opportunity to go for a pin.Pokken is not just a successful cross-pollination of two game series, its an outright excellent entry point into fighting games.Doing enough damage or landing specific attacks in Field Phase will move the battle into the Duel Phase, where the game becomes Tekken and Street Fighter-like. The two-dimensional plane and smaller field of movement forces direct confrontations, and its here the real technicalities of Pokkens mechanics open up.Fighting game aficionados will understand the dynamics here instinctively, while newcomers can quickly get comfortable with the logic: Light attacks are quicker than heavy ones, but do far less damage. High attacks are vulnerable to sweeps, while those who attack whilst crouched can be interrupted by standing attacks. Throws are a reliable way to punish players with their guard constantly up. Then theres Counter-Attacks, which function like Street Fighter 4s Focus, letting you hit back through an enemys assault, but will leave you open if mis-timed.Strikes are governed by a priority triangle: Normal Attacks trump Grabs, which beat Counters, which crush Normal Attacks. At this basic level its an elaborate game of rock-paper-scissors, but theres depth below the surface. Like with Tekken, combos rely on timed button presses, but its not as strict as Street Fighters frame-precise requirements. Leaping over a downed opponent and attacking with a crossup makes blocking trickier, and pressuring an enemy into the corner gives way to wall slam opportunities. On top of this are intricacies such as anti-airs, dashing out of Counter-Attacks, and special cancels.Pokken is a game laced with smart ideas and design feats, but one of the most important is that it offers depth without overwhelming new players. The majority of special moves, for example, can be executed with a single button. With specific timing and more button presses, combos can become complex, but they always seem masterable. The gap between button-mashers and advanced players doesnt seem insurmountable and, as a result, making that transition is more appealing. At the same time, the systems dont seem exploitable to the extent that a skilled player can ruin the fun for a casual fan. Do not fear: Tekkens endless juggles have not made the transition. By beautifully striking that balance, Pokken is not just a successful cross-pollination of two game series, its an outright excellent entry point into fighting games.Layered on top of the core mechanics are technicalities that give the game the variety it needs for replayability. Like all fighting games, there are character pick considerations: Charizard is a lumbering behemoth with massive damage output; Weaviles attacks are feeble by comparison but can overwhelm in barrages.Then theres the unique attributes and abilities for each fighter that cater to different styles of play. Braixen, for example, can increase her damage for a short period, but Sceptile can leech health from the enemy and wage a war of attrition. Pikachu is great at applying pressure, but Machamp can take a beating, and so on.Pokken is a game laced with smart ideas and design feats, but one of the most important is that it offers depth without overwhelming new players.Support characters are another of Pokkens gameplay wrinkles, and a clever way of drawing from the series turn-based tactical roots. It allows players to select from a pool of Pokemon to lend a hand in battle. The advantages these support characters provide range from directly attacking the other player with fireballs or point blank uppercuts, to setting up traps and conferring stat benefits. Since the ability runs a cooldown, picking a Pokemon that complements the fighter or the players strategy isnt always the difference between winning or losing, but it certainly helps in getting the edge.Meanwhile, Synergy is a new ability that has a more profound effect in battle. Over the course of a fight, a gauge is filled by delivering damage and, once maxed out, can be used to trigger a Mega Evolution for the Pokemon that have one, or a powered-up state for those that dont. In this mode moves are enhanced and the Pokemon also has access to a Synergy Burst. These are powerful cinematic special attacks that, without understatement, are stunning to behold.Blaziken, an anthropomorphic chicken that fights like Bruce Lee, erupts in flames and leaps into into a furious flurry of kicks, leaving his victim at the center of an exploding ball of fire. Shadow Mewtwo flies into deep space, creates a fireball out of dark energy, and slams it back onto earth like something out of Dragon Ball Z. Machamp, meanwhile, goes full Fist of the North Star and hits his opponent with 1000 consecutive punches (somehow they arent turned into Poke-paste).Pokken Tournaments presentation is lovingly crafted, with a slick broadcast style for its battles and each of its 19 stages filled with eye-candy and fan-service. One favourite is Mystery Carnival, a creepy rustic mansion lit by a roaring fire and multicolored Jack-O-Lanterns. It also happens to be haunted by ghost Pokemon, so keep an eye out for the grinning Gengar floating in a doorway. The Pokemon themselves are just as full of life. Its hard not to crack a smile when Pikachu Libre shouts PI-KA-CHU as it pulls of an electrifying frogsplash. If you want to explain to someone why you find Pokemon so charming, this is the game you should reach for.Out of the box, Pokken is a fully-featured fighting game replete with gameplay modes, customisation features, and a comprehensive training suite. The meat of the single-player experience is its Ferrum League, in which players fight through five skill tiers to be crowned ultimate champion. Each is comprised of qualifying fights, a tournament, and promotion battle against a special trainer. Weaved throughout these is the story of a mysterious trainer and a corrupted Mewtwo, which is a nice touch that alleviates the monotony of grinding through each ranks many qualifying matches.Pokken Tournament also has online multiplayer, which GameSpot will be testing extensively when the game is released. This review will be updated to reflect the online experience in the coming days. As it stands, however, the games robust single-player campaign and multiplayer mode are already enough to make it an essential purchase.Its a testament to the quality of Pokken Tournament that I just wish there were more characters. Theres more than 600 Pokemon now and Pokken Tournament features just 16 of those. Perhaps this is an unfair criticism since this number is similar to most fighting game rosters at launch, but I simply need more. I need Hawlucha.Nintendos Wii U provides a paucity of fighting games, but Pokken Tournament has redeemed that drought by being one of the best on any platform. Frequently magnificent to look at, delicately designed, and rewarding for players across all skill levels, its the Pokemon fighting game deserving of a 20-year wait."}