{"ref": "https://www.gamespot.com/reviews/baldurs-gate-dark-alliance-ii-review/1900-6086635/", "date": "January 16, 2004", "game_name": "Baldur's Gate: Dark Alliance II", "text": "Two years ago, Interplay and little-known developer Snowblind Studios surprised just about everyone when they delivered an action RPG to the PS2 under the banner of Black Isle's venerable Baldur's Gate series, and it was good--great, even. Striking a middle ground between the likes of Diablo and Gauntlet, Baldur's Gate: Dark Alliance combined hack-and-slash dungeon-crawling gameplay with a moderate amount of character customization options, and it showcased the whole package with some of the best-looking graphics to be seen on the PS2 at the time. Snowblind may not be at the helm anymore, but the new Baldur's Gate: Dark Alliance II delivers a similar experience. Though not as impressive as the original game, Dark Alliance II will surely satisfy players looking for a well-crafted, accessible action RPG experience. Dark Alliance II does a decent job of picking up where the first game's cliff-hanger left off. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Baldur's Gate: Dark Alliance II Video Review The first Dark Alliance ended with a rather wicked cliff-hanger, and Dark Alliance II dutifully picks things up from there. The human archer, elven sorceress, and dwarven fighter from Dark Alliance appear in the opening cinematic, having just defeated that game's final boss, and are swiftly captured by the wicked vampire king, Mordoc, who plans to use the fallen onyx tower of Eldritch the Betrayer for his own nefarious purposes. If you didn't play the first Dark Alliance, this probably doesn't make a lick of sense, but fear not. Dark Alliance II makes plenty of references back to the events of the first game, and several familiar characters reappear, but the game is just as fun if you have no awareness of past events in the series. To be honest, though, the story is kind of convoluted whether you've played Dark Alliance before or you haven't. But this isn't too big a deal, as the story functions purely for the purpose of giving you continued motivation to engage in a series of hack-and-slash dungeon-crawling quests. Since the original cast gets locked up in a dungeon somewhere, Dark Alliance II lets you choose from an all-new cast of five: the human barbarian, the dark elf monk, the moon elf necromancer, the dwarven rogue, and the human cleric. Each of these characters has its own innate proficiencies--the barbarian works best with melee combat, the monk with unarmed combat, the rogue with stealth and ranged attacks, and the necromancer and cleric with dark and light magic, respectively. The gameplay experience can be pretty fundamentally different depending on which character you choose, so you can choose the character that best fits your own personal style. And if you've got a friend who's willing to commit the nine or 10 hours or so it'll take you to finish the game, Dark Alliance II lets you play through the game as a two-player cooperative team, much like its predecessor. Though the ability to play with a party of four, or even the inclusion of online support, would have really upped the ante on the multiplayer game, the co-op mode still proves to be great fun, and it's a decidedly different experience from flying solo. The action in Dark Alliance II breaks down into four basic activities: fighting, character leveling, shopping, and conversing with non-player characters. Though you can't interact with every NPC you see, the ones that you need to talk to in order to keep the game rolling are clearly marked with large ~talk~ icons over their heads, and a quick run through a short dialog tree will have you adventuring off on a new quest in a short time. You'll occasionally run into nonessential NPCs who, if questioned, can yield extra experience and side quests, though this isn't a terribly common occurrence. You'll spend most of your time in Dark Alliance II hacking your way through monster-infested dungeons. The context varies from quest to quest, but all of them basically boil down to working your way through a dungeon, or at least a dungeon-type environment, while fighting monsters and plundering all kinds of treasure, and the quests usually culminate in some kind of boss fight. The action here is pretty straightforward. You issue melee and magic attacks in real time using the controller's face buttons. You can also block, jump, use health and magic potions, bring up a translucent minimap of your immediate surroundings, and switch which magic spell you currently have equipped at any point. The options for melee weapons have been expanded a bit since the first game. You can now wield a single-handed weapon in each hand, though with a pretty fair attack penalty. You can also equip three different weapon types--single-handed, double-handed, and ranged--at the same time and cycle through them on the fly using the D pad, which is a clever addition that helps keep the pace of the game going at a nice clip. The ranged weapons also function a bit differently now. You no longer have to buy new projectiles, which effectively means you have unlimited ammo, and you have a red aiming guideline right off the bat, which was a skill you previously had to earn. Both of these additions make the ranged weapons a much more attractive option. Though there are a few minor differences in the way certain functions are mapped, the Xbox and PlayStation 2 controllers handle the action in Dark Alliance II with an equal level of proficiency. Every single button on the controller is put to use, which can be a little daunting at first, but once you become familiar with the layout, it becomes fairly clear that any further simplification of the controls would hurt the overall experience. Carrying out quests and slaughtering monsters will earn you experience points, which you can periodically spend on different character attributes and abilities. Many of these character advancements are pretty subtle, incrementally increasing statistics like attack rate and magic regeneration rate, though there are plenty that will grant you all-new abilities, such as new magic spells, or the ability to equip specific classes of weapons or armor. The customization isn't incredibly deep, but two players who use the same character class yet choose to use their experience points differently will, by the end of the game, have two fairly divergent characters. The game does a pretty good job of ramping up the difficulty of your opponents at roughly the same speed that you're gaining experience, which generally keeps things from being too easy or too difficult most of the time. The workshop adds some surprising depth to the weapon system in Dark Alliance II. You'll also pick up large quantities of booty while dungeon crawling, including a variety of rings, amulets, jewels, potions, armor, weapons, and, of course, gold coins. You can keep what you like, but you have a limited carrying capacity, and you'll regularly have to unload unneeded gear to Baldur's Gate's resident shopkeeper (fortunately, recall potions let you instantly teleport back to town). You can also buy some basic weapons and armor there using the coins you've collected at the shop, which is good when you're just starting off, though better equipment usually awaits you in the dungeons. The best stuff, however, you'll have to build yourself. New to the shopping portion of Dark Alliance II is the workshop, where you can take existing pieces of weaponry and armor and equip them with special rune stones and jewels, which will imbue them with special properties. With nearly a dozen different types of gems available in the game, and space for rune stones and two different types of gems on any piece of gear, the customization options here are simply staggering. It can be quite intimidating, as every different combination of gems yields different results, but if you spend time figuring out the effects of the different gems, you'll be able to craft weapons and armor of unparalleled power. The workshop is a great addition to the Dark Alliance formula, removing some of the random chance in which weapons you'll get and putting the onus squarely on the player. As mentioned earlier, Baldur's Gate: Dark Alliance was a great-looking PlayStation 2 game when it was released in December of 2001. A little more than two years later, Dark Alliance II hasn't done much to improve the overall fidelity of the graphics, which leaves it looking a little bit dated. The water effects, which were some of the best we'd seen in 2001, look more like mercury in 2004. The game tones down the shiny reflective effects that Dark Alliance bandied about with gleeful abandon, which is really to the game's advantage. The one thing that still looks really good is the lighting, which is mostly static, save for the soft glow that your character gives off, but it's effective in creating atmosphere. The game also lifts many environment tilesets and creatures from its predecessor. It's just enough to give the game a sense of familiarity, though, as there are also plenty of all-new monsters to fight and dungeons to explore. It doesn't amaze like its predecessor did, but Dark Alliance II still has a pretty clean look, and the different tilesets that make up the many environments you'll traverse are admirably sharp. Technical aptitude aside, the art direction in Dark Alliance II doesn't seem quite as focused as in the first game, and there are some dungeons and creatures that are inspired by some of the more obscure corners of the Forgotten Realms. The differences between the graphics in the PlayStation 2 and Xbox versions are noticeable, with the Xbox version sporting cleaner special effects and slightly sharper textures, but they're also pretty nominal. Still, if you have the option, the Xbox version is definitely the way to go. Many creatures from Dark Alliance appear in its sequel, though the gelatinous cubes are sorely absent. Dark Alliance II features sound design befitting of a Dungeons & Dragons game. There's plenty of spoken dialogue littered with quasi-medieval language, all of which is delivered in an appropriately serious tone by a skilled cast of voice actors, a few of whom have returned from the first game to reprise certain roles. The orchestrated score is grand and sweeping, and though it'll often drop out for minutes at a time when you're just poking around a dungeon, it always makes a point to swell up to a big crescendo whenever you come to a big boss encounter. It's not perfect though, and sometimes the music will start picking up some steam for no real apparent reason. The effects that accompany your magic and melee attacks are satisfying, and your character will regularly shout out a little battle cry in the heat of the moment. And, in a nice little touch, the voices of certain characters will begin to change as their experience level increases. Baldur's Gate: Dark Alliance was an RPG for people who didn't like RPGs, and its sequel does a fine job of maintaining that design philosophy. Though the ending is a little unsatisfying, and the actual adventure is a little short, the game offers plenty of replay value with five appreciably different character classes and a really satisfying cooperative mode. The future of Black Isle Studios is uncertain, so it's hard to say if there will be a Baldur's Gate: Dark Alliance III. If this is the final stand for the Dark Alliance name, it's not a perfect ending, but it's still pretty good. Carrying out quests and slaughtering monsters will earn you experience points, which you can periodically spend on different character attributes and abilities. Many of these character advancements are pretty subtle, incrementally increasing statistics like attack rate and magic regeneration rate, though there are plenty that will grant you all-new abilities, such as new magic spells, or the ability to equip specific classes of weapons or armor. The customization isn't incredibly deep, but two players who use the same character class yet choose to use their experience points differently will, by the end of the game, have two fairly divergent characters. The game does a pretty good job of ramping up the difficulty of your opponents at roughly the same speed that you're gaining experience, which generally keeps things from being too easy or too difficult most of the time. The workshop adds some surprising depth to the weapon system in Dark Alliance II. You'll also pick up large quantities of booty while dungeon crawling, including a variety of rings, amulets, jewels, potions, armor, weapons, and, of course, gold coins. You can keep what you like, but you have a limited carrying capacity, and you'll regularly have to unload unneeded gear to Baldur's Gate's resident shopkeeper (fortunately, recall potions let you instantly teleport back to town). You can also buy some basic weapons and armor there using the coins you've collected at the shop, which is good when you're just starting off, though better equipment usually awaits you in the dungeons. The best stuff, however, you'll have to build yourself. New to the shopping portion of Dark Alliance II is the workshop, where you can take existing pieces of weaponry and armor and equip them with special rune stones and jewels, which will imbue them with special properties. With nearly a dozen different types of gems available in the game, and space for rune stones and two different types of gems on any piece of gear, the customization options here are simply staggering. It can be quite intimidating, as every different combination of gems yields different results, but if you spend time figuring out the effects of the different gems, you'll be able to craft weapons and armor of unparalleled power. The workshop is a great addition to the Dark Alliance formula, removing some of the random chance in which weapons you'll get and putting the onus squarely on the player. As mentioned earlier, Baldur's Gate: Dark Alliance was a great-looking PlayStation 2 game when it was released in December of 2001. A little more than two years later, Dark Alliance II hasn't done much to improve the overall fidelity of the graphics, which leaves it looking a little bit dated. The water effects, which were some of the best we'd seen in 2001, look more like mercury in 2004. The game tones down the shiny reflective effects that Dark Alliance bandied about with gleeful abandon, which is really to the game's advantage. The one thing that still looks really good is the lighting, which is mostly static, save for the soft glow that your character gives off, but it's effective in creating atmosphere. The game also lifts many environment tilesets and creatures from its predecessor. It's just enough to give the game a sense of familiarity, though, as there are also plenty of all-new monsters to fight and dungeons to explore. It doesn't amaze like its predecessor did, but Dark Alliance II still has a pretty clean look, and the different tilesets that make up the many environments you'll traverse are admirably sharp. Technical aptitude aside, the art direction in Dark Alliance II doesn't seem quite as focused as in the first game, and there are some dungeons and creatures that are inspired by some of the more obscure corners of the Forgotten Realms. The differences between the graphics in the PlayStation 2 and Xbox versions are noticeable, with the Xbox version sporting cleaner special effects and slightly sharper textures, but they're also pretty nominal. Still, if you have the option, the Xbox version is definitely the way to go. Many creatures from Dark Alliance appear in its sequel, though the gelatinous cubes are sorely absent. Dark Alliance II features sound design befitting of a Dungeons & Dragons game. There's plenty of spoken dialogue littered with quasi-medieval language, all of which is delivered in an appropriately serious tone by a skilled cast of voice actors, a few of whom have returned from the first game to reprise certain roles. The orchestrated score is grand and sweeping, and though it'll often drop out for minutes at a time when you're just poking around a dungeon, it always makes a point to swell up to a big crescendo whenever you come to a big boss encounter. It's not perfect though, and sometimes the music will start picking up some steam for no real apparent reason. The effects that accompany your magic and melee attacks are satisfying, and your character will regularly shout out a little battle cry in the heat of the moment. And, in a nice little touch, the voices of certain characters will begin to change as their experience level increases. Baldur's Gate: Dark Alliance was an RPG for people who didn't like RPGs, and its sequel does a fine job of maintaining that design philosophy. Though the ending is a little unsatisfying, and the actual adventure is a little short, the game offers plenty of replay value with five appreciably different character classes and a really satisfying cooperative mode. The future of Black Isle Studios is uncertain, so it's hard to say if there will be a Baldur's Gate: Dark Alliance III. If this is the final stand for the Dark Alliance name, it's not a perfect ending, but it's still pretty good."}