{"ref": "https://www.gamespot.com/reviews/broken-sword-shadow-of-the-templar-review/1900-2546882/", "date": "March 7, 2008", "game_name": "Broken Sword: The Shadow of the Templars", "text": "Weaving a tale of murder, mystery, mayhem, and medieval history, Revolution Software has ported its popular PC title Circle of Blood to the PlayStation. The terrific storyline has been kept intact, with all its shadowy nuances of the occult and unexpected humor, but the game just isn't as fun to play as it was on the PC.You're George Stobbart, hapless American tourist in Paris drawn into a far-reaching world-domination plot by a bomb exploding in the quiet cafe where you're drinking coffee. You're called to be an unlikely and somewhat awkward hero as you cross the globe - from Spain to Syria to France to Ireland - in search of the truth and the reason behind a seemingly unconnected series of murders. The storyline is solid, laden with historical myth and mystery (the Knights Templar, central to the game, were known to exist in early medieval times, but no one knows what happened to them, if they still exist, where their treasure went, and so on). The story also introduces a handful of well-developed characters, including your accomplice, the sophisticated Parisian Nicole Collard, as well as the psychic police inspector Rosso and pub-lurking exaggerator Liam MacGuire.Puzzles fit well into the fabric of the game. Most are relevant and usually are solvable with a reasonable portion of wit and a slow mouse (stumpers can often be solved if you crawl the cursor over the screen very, very slowly and find that small object). Only one or two felt illogical or random, which in an adventure game with more than 25 puzzles or so, seems a reasonable ratio.The problem, however, is that the load times are terrible. Because this is an adventure game, it is necessary to move frequently between screens, and to have to wait and wait while the next screen loads is annoying. One puzzle requires that you use a wet object, but the place where you use the wet object is six screens away from where you wet it, so woe betide you if your object dries out before you can make use of it (it's guaranteed, by the way, to happen at least once). You have to backtrack six screens, waiting for each to load, wet the object, and trundle back through the same six screens to use it. Broken Sword takes far longer to play through than it should because it takes so long to put a solution into place. Likewise, load times destroy some cutscenes, particularly ones that cut from George's startled face to the action, to George, to the action. What was originally designed as a suspenseful back and forth is completely undermined by the slowness of moving from one image to the next.Finally, Circle of Blood was acclaimed for its superb graphics. Broken Sword retains the exotic locales and the crispness of background scenes - many of the team members worked on comic book cult hit Tank Girl - but it's more difficult now to see character faces clearly or in any kind of detail (and I played on a big TV). The graphics feel condensed and smushed when compared with the PC version, which also might explain why it can be so challenging to place the cursor in exactly the right place. Broken Sword is compatible with the PlayStation mouse and has an excellent original score and involving storyline peopled with curious and unusual characters. If only it wasn't so hard to physically get through it."}