{"ref": "https://www.gamespot.com/reviews/x3-reunion-review/1900-6140636/", "date": "November 30, 2005", "game_name": "X3: Reunion", "text": "The X games (and we're referring not to the extreme-sports event, but to Egosoft's space exploration/trading/empire-building simulations) have always been a bit like the famous sci-fi movie 2001: A Space Odyssey. In other words, they're beautiful to look at, but they also unfold at a snail's pace. X has become the spiritual heir to Elite, the old-school, deeply open-ended space games that let you go off and do your own thing for hours at a time. Rather than running through a series of scripted missions, you can explore the void, buy and sell goods for a profit, and battle the occasional bad guy. X3: Reunion, the latest game in the series, delivers some stunning visuals and more of that wide-open-ended gameplay, which is great if you're a fan of the genre. X3 also features a single-player storyline to deliver some structure for those of us with shorter attention spans, though this doesn't pan out anywhere near as well. Welcome to deep space and the open-ended universe of X3: Reunion. Set in the distant future where humanity has colonized the stars and now rubs elbows with various alien species, X3 puts you in the role of Julian Brenner, the hero of X2. You start alone in your little vessel and are given the hints of a plot involving a great and powerful ancient McGuffin that various factions are trying to control. From there, you can try to follow the plot and see where it leads you, or you can just go off on your own and explore the many different sectors of the known universe, or both. You can follow the plot for a while, then go off and do something else, and then pick up the plotline later on, though this isn't as helpful as it seems. If you are expecting some kind of Wing Commander: Privateer-style story with plenty of structure, you won't find it here. X3's single-player storyline doesn't hold your hand; rather, it exists for you to stumble upon it every now and then. One case in point is an early mission where you're tasked with hunting down a certain person for information. You're told where that person is, but, of course, you have no idea where that place actually is. What comes next is a lot of flying around, exploring sectors and charting where their jumpgates lead, and then exploring those sectors and finding out where those jumpgates lead. Eventually, you'll find the place you need to go, but it's by no means quick or easy. Most of the time in X3 will instead be spent simply flying around, looking for missions, and buying and trading goods. This is necessary, even if you're just looking to get through the campaign, because you need mountains of cash to buy the various upgrades that you'll need to survive later in the game. And, generally, you'll need to trade to generate that kind of cash, so if you're looking to live the mercenary life, you're at a bit of a disadvantage since the payoffs are downright miniscule compared to what you can make trading. Eventually, you'll get to the point where you have a fleet of vessels running trade routes, and you can build your own factories and stations to manufacture products that you can ship. No matter what path you choose, you'll need a lot of patience in X3, because this is a game that unfolds at a very slow pace. You'll spend a lot of time simply flying from one point to another; however, you can have the computer fly the route for you, and then you can hit the time-compression button to speed the passage of time, or you can simply ~jump~ from sector to sector, though at the cost of energy crystals. Even then, though, you'll spend a lot of time simply exploring, looking for work, and figuring out the best trade routes. While combat does play a role in the game, it's not the focus of X3. You'll spend more time exploring and trading. We only wish there were a bit more personality in X3. Apart from the grandeur of flying around some really impressive galactic scenery, there's very little sense of emotion in X3. Like the action in the previous games in the series, X3's action happens entirely from the cockpit of your ship (aside from the occasional extravehicular jaunt in your space suit), so you never get a chance to see the inside of any of these marvelous stations. There are the occasional diversions, such as a blackjack game that you can play while docked, but even that happens while you're strapped to the cockpit of your ship. X3 doesn't help itself out with its lack of any kind of in-game tutorial. Aside from the 87-page manual, the game uses mainly pop-up tooltips that provide lots of information but hardly any guidance as to what to do next. And this is a dense game to begin with. While you can use a joystick (and some space-genre purists will), X3 is designed so that it's completely playable using the mouse and keyboard. Steering your ship is as simple as moving the mouse, and clicking on the mouse button will toggle between steering the ship and moving the mouse cursor around the screen to access the interface, which itself is a bit complex and awkward for its own good. For instance, you can call up a navigational map of the known universe, but if you want to chart a course to a specific sector, you have to drop into a different navigational map to do so. From a visual standpoint, few games are as stunning as X3. Though space is an empty void, the folks at Egosoft have managed to make it look downright beautiful, and you'll fly through sectors admiring the many intricate and complex space stations as well as the photo-realistic planets and more. There's a realistic metallic sheen to ships and stations, as well as some fancy lighting and shadowing to really hammer in the illusion. It's so good that even docking or doing a slow flyby past a station is a treat. There's some concession to Newtonian physics, as you can turn your ship around and watch momentum carry you in the direction you were originally following for a few seconds. However, the game does experience a few performance hitches, even on high-end machines. Sadly, the sound effects and voice acting are nowhere near the quality of the graphics; they're fairly generic for the most part, and much of the voice work is pieced together much like the automated response that you get when you call tech support or your bank. There are few games that are as visually impressive as X3. With its open-ended gameplay and emphasis on trading and exploration, X3 will most likely appeal to fans of the series, though if you were looking forward to a strong single-player story or campaign, then you'll most likely be disappointed. Still, for what it is, X3 is easily one of the prettiest games to date, as well as an impressive, though dry, achievement. If you like your space epics to be more 2001 than Star Wars, you'll probably feel at home in the universe of X3."}