{"ref": "https://www.gamespot.com/reviews/gauntlet-dark-legacy-review/1900-2717306/", "date": "May 17, 2006", "game_name": "Gauntlet: Dark Legacy", "text": "The PlayStation 2 version of Gauntlet Legends: Dark Legacy is easily the most robust home port of a Gauntlet game ever released. More of an expansion than a true sequel, Dark Legacy serves as a decent, albeit moderate, refinement of the original Gauntlet Legends. The game itself is fairly large--it contains all the areas from the original Gauntlet Legends, in addition to several new to the expansion, adding up to 60 individual stages. And due to the game's design, you're almost guaranteed to spend a bit of time trekking through each level more than once, hunting for items necessary to your advancement. But however hearty the game's broad objectives are, it all ultimately comes down to classic Gauntlet-style gameplay. Some find this type of gameplay focused and engaging, while others think it the epitome of mindless tedium.The Gauntlet series hasn't changed much over the years--its games are half shooter, half beat-'em-up, and the first two games were classics. Basically, you and up to three friends trek through maze after maze of monsters, gold, and food in an eternally unfolding quest to find the current maze's exit. The games are built on a genius arcade mechanic--each quarter, historically, bought you health, and as the game had no real end, pumping in a small fortune was a disturbing possibility. The Gauntlet Legends games--Dark Legacy included--don't stray too far from this formula; they started their lives, after all, in the arcades. The modern iterations mix the formula up by making the levels slightly more linear and adding scripted elements. The essence of play, however, has remained largely unchanged.Dark Legacy allows you to choose from a variety of characters--the archer (formerly the elf), the knight, the warrior, the jester, and the sorceress, among others--most of which are available at the outset. Aside from their stat-based differences, each character comes with unique combat animations. The jester, for example, dances clownishly as he attacks, while the sultry sorceress struts through battle. All characters have access to both strong and quick attacks--which, when combined, make up the game's simple combos-- as well as magic and turbo attacks. Magic is more versatile in Dark Legacy--it can be used to perform a screen-clearing blast or power other effects, such as magical shields. The turbo attacks, finally, round out the offensive package. Governed by a self-replenishing turbo meter, turbo attacks deliver strong, usually focused effects, with their damage potential increasing as your meter fills. It's hard to argue that Dark Legacy's combat system isn't well thought-out--it definitely is, and it serves the game it's wrapped around quite well. But it's similarly hard to argue that Gauntlet's premise isn't dated and limited. Fortunately, the game is fairly adept in the area in which it excels.Playing Gauntlet Legends: Dark Legacy with a few friends can infinitely improve the experience. Going at it alone, the combat is monotonous and the pacing becomes quickly predictable. Throw a few other heads into the mix, however, and the human factor provides the perfect dash of uncertainty to spice up the dull experience. What's more, you could potentially each play your own leveled-up character. The frame rate does falter a decent amount during the proceedings, but those accustomed to multiplayer console games should know that tune by now.The PS2's Dark Legacy is easily the best-looking version of Gauntlet Legends available--the textures are superclear, the spell effects are generous, and the overall speed has been turned up a notch. While overall, it's difficult to call it anything other than a modest-looking PlayStation 2 game, its visuals will surprise you when you least expect it. The game's aural qualities are unquestionably modest, however. The music is definitely minimal, and the sounds are somewhat muted and hushed. The sound effects consist of odd interjections, courtesy of your character, and mild whirrs and explosions. It needn't be stated that the ubiquitous ~Gauntlet voice,~ illustrator of the obvious and channel of inspiration, has returned for Dark Legacy. Sadly, though, the voice has been given a body. Now, the wizard who owns the tower from which your adventures spring supposedly does the talking. Needless to say, a wonderfully absurd myth has been quenched.If you have a group of bored, bloodthirsty friends visiting, having Dark Legacy around would definitely be an asset. You'll even get into the single-player game, for a little while--or a long while, depending on your attention span. But, ultimately, it's hard to argue that the game has any long-standing single-player value. While this isn't due to its design--there definitely is a lot there, and the manner in which it's presented to you is very functional--the game isn't exactly action-packed, making it a game that becomes tedious after only a few hours of play."}