{"ref": "https://www.gamespot.com/reviews/lego-batman-review/1900-6198251/", "date": "September 26, 2008", "game_name": "LEGO Batman: The Videogame", "text": "After Traveller's Tales released the well-paced, delightfully funny Lego Indiana Jones earlier this year, it seemed like it had finally gotten a handle on how to shrink iconic action heroes into the diminutive Lego universe. With a cast of diabolical, memorable characters and more gadgets than you can shake a batarang at, Lego Batman was poised to be the best entry yet for the family-friendly, block-building franchise. Unfortunately, it's a huge step back in the series. The perpetually bewildered AI and repetitive combat that have haunted the Lego games since the beginning are on full, frustrating display again, along with a smattering of baffling puzzles and agonizing vehicle sections that will make you feel like you've been punched in the gut by Bane. When the stud-collecting, puzzle-solving gameplay is able to rise above the problems, Lego Batman is an eminently enjoyable cooperative romp. It just won't make you want to do the Batdance. The Joker has no regard for fine art. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Lego Batman Video Review 1 Storytelling has always been one of the series strengths. Parodying famous scenes with silent Lego characters has provided consistent laughs, serving as a worthwhile reward for overcoming a particularly cheap puzzle or boss fight. Lego Batman doesn't offer up any such reward. The story does elicit a few smirks, but the jokes more often than not fall completely flat. Robin serves as the expected punch line whenever he's onscreen, repeatedly displaying his cowardice in the face of danger, but the joke quickly gets beaten into the ground. The reason for the lackluster laughs is that the story doesn't have anything specific to parody. The plot is based on the comic book characters, and though it does have some nods towards the movies, it doesn't make fun of any well-known scenes, so the humor relies on predictable slapstick instead of spoofing moments ingrained in popular culture. The lone cinematic bright spot is being able to see the story develop from both sides of the morality coin. As Batman and Robin, you successfully thwart Gotham's angriest individuals as they attempt to steal riches, unleash a flock of gun-toting penguins, or put a permanent smile on the populace's face with laughing gas. And while seeing good overcome evil certainly has its place, it's even more fun playing through as the bad guys; although it's odd that while most of the Batman levels end in a boss fight against a well-known rapscallion, the villain levels will never pit you against the Caped Crusader. It would have been satisfying to freeze him into a block of ice or give him a joy-buzzer handshake, but you're left fighting hordes of nameless police officers instead. The gameplay stays true to the rest of the series. Lego Batman is primarily a puzzle-solving game with light platforming and combat elements. Though you're given some fancy throw moves and a batarang to dispatch your foes with, the combat gets repetitive in a hurry. Some sections are overloaded with respawning foes, making it a chore to dispatch waves of enemies while trying to figure out how to pass a tricky puzzle. At least you can change into different suits, which keeps things relatively fresh. These outfits grant you different abilities, such as being able to glide as Batman or control robots as Robin. Not all of these skills are fun to use. For instance, Robin is given a vacuum cleaner to suck up stray blocks, and Batman acquires a special gun that shatters glass but can't hurt enemies. Lego Batman does have one huge advantage over its predecessors, though. You'll no longer be stuck controlling a droid or some guy who isn't Indiana Jones. Batman and Robin are both fun to play as, which makes cooperative play satisfying no matter who you are. And if you think controlling Robin is cool, just wait until you can inhabit the body of The Riddler or Mr. Freeze. Controlling the villains is the best part of Lego Batman, so it's good that half of the game is devoted to these miscreants. The villain levels are far less predictable than Batman's because of the sheer variety of characters you can control. Every level lets you control a new charlatan, so you'll be able to lash out with your whip as Catwoman in one level and then unleash tiny penguin bombs as the felonious fowl in the next. Though the villains' tale mirrors Batman's story, the levels are different. You'll go through some of the same sections, but you'll predominantly move through new locations, making this adventure twice as long as previous Lego games. They're probably laughing at Robin. Though cooperative play makes the experience more enjoyable, Lego Batman is virtually unplayable at times if you opt to go through it alone. The friendly AI is horrific. As in previous games, your AI companion cannot dispose of enemies. This means you'll have to fight off all the enemies and solve all the puzzles by yourself while your AI pal stands around doing nothing. Worse is the AI's complete disregard for puzzles that require two people to solve. For instance, a few puzzles require one person to stand on a platform while another flips a switch. In a few cases, the AI pal will stupidly follow you wherever you walk, which makes it impossible to complete the puzzle without plugging in a second controller and maneuvering both characters yourself. There is one vehicular boss fight where one player has to tow the enemy while the other peppers him with missiles. The battle is nearly impossible to win because the friendly AI refuses to help. Despite the lack of humor and sometimes obstinate puzzles, Lego Batman can be really fun. The game has a ton of unlockables, from new characters to fancy costumes, which makes it well worth replaying. It's just a shame the problems that have plagued this series since the beginning have yet to be addressed. There is no excuse for distressingly thick-headed AI in such a simple game. If you can rope a friend into playing with you, though, the game is a blast. You'll just have to provide the cheesy Mr. Freeze puns yourself."}