{"ref": "https://www.gamespot.com/reviews/gothic-3-review/1900-6162673/", "date": "December 4, 2006", "game_name": "Gothic 3", "text": "Gothic and its sequel, Gothic II, offered a challenging role-playing experience but had technical issues that caused the games to run poorly. You can pretty much say the same thing about Gothic 3, although the sequel is better in some areas. It still suffers from performance problems, especially on computers that don't have a lot of horsepower under the hood, but its strengths make it worth a look if you have a computer that can handle it and you're in the market for a challenging, open-ended game. Gothic 3 offers great graphics, an open-ended world to explore, and some unfortunate technical issues. Like the previous games, Gothic 3 places you in the role of the series' nameless hero, a soft-spoken adventurer who can eventually pursue one of three career paths: warrior, archer, or wizard. The game's story--which puts you in the middle of a nation enslaved by brutal orc oppressors--may seem a bit opaque to players who haven't played the previous games, but those who have will appreciate the references to characters and items from Gothic and Gothic II. Like in those games, the nameless hero starts off with little to no basic training in the game's many different profession skills (which include various schools of sorcery, mastery of different hand-to-hand weapons, and animal skinning, among other things), and can eventually learn these skills by gaining enough experience to gain levels and visit advanced trainers who can teach him. Gothic 3 makes some real improvements over the previous games. For instance, though you're still expected to progress through most of the game by taking quests that are kept in a less-than-organized journal, the overall quest structure is much better defined and more cohesive. You'll find yourself taking on fewer long-term quests that require travel to many different areas and more short-term, local quests whenever you enter a new area. Though they're sometimes a bit shallow and often require you to kill a certain number of monsters or retrieve certain items, these shorter-term quests are much easier to keep track of, and they're designed to keep you moving throughout the game's vast world in a logical progression--one that can actually affect how the world is laid out. A lot of Gothic's real estate consists of wilderness broken up by small encampments led by a powerful chieftain character. If you can gain enough of that village's confidence by completing faction-specific quests, you can get the chieftain's attention and, usually, a quest to exterminate an enemy village, which will then be repopulated by the faction you were working for. But the world of Gothic is huge and the game is quite long, so you can still wander all over the place and get lost if you care to, though if you wander too far, you may be ambushed by tough monsters that will make short work of you. In addition, the combat and control schemes in Gothic 3 have been revamped to be much more accessible and to make more intuitive sense. Gothic 3 uses a simpler ~one-click-performs-one-swing~ system that makes combat a lot easier to get into, though parrying attacks with a shield doesn't seem as effective as simply dodging backward, which gives the game's melee combat a stick-and-move rhythm that requires you to dodge back from your enemies and weave in to swing your sword. It may seem a bit shallow, but it's not the only option; you can also choose to bring a bow or, later in the game, sorcery into battle. You can get into ranged combat with an easy-to-use first-person shooter interface that lets you point and shoot at your foes. The combat system is a bit more shallow than that in previous games, but it's easier to get into. Even Gothic 3's audio is pretty good. Much of the game's music is subdued but suitably symphonic, and it changes dynamically and appropriately, depending on where your character is and whether you're in battle. The game also has a lot of spoken voice dialogue, and while it isn't great, it mostly gets the job done. The dialogue itself isn't snappy or witty, and the actors' delivery isn't always very enthusiastic, but at least the nameless hero sounds much tougher and his delivery isn't as stilted. Also, there's actually a varied cast of voice actors in this new sequel who try to give appropriate performances, as opposed to the embarrassingly tiny pool of voice talent that stretched itself too thin in the previous games. So no, Gothic 3 doesn't have any crotchety old castle guards warning you about orcs and wizards in a thick Yiddish accent, or any jive-talking pimps trying to draw your attention away from purchasing a rusty battleaxe at the docks. Unfortunately, just like its predecessors, Gothic 3 was released in a buggy state with some notable technical problems, including a tendency for the game to briefly hiccup between frames of animation, depending on how powerful your computer is. Our upper-midrange system with 1.5GB RAM and a 256MB graphics card experienced only occasional frame rate hitches, while our lower-end system with 512MB of RAM and a 128MB card had noticeably more frame rate issues, especially when trying to render new areas. And like the previous games in the series, Gothic 3 still has issues with polygon clipping--you'll still see both enemies and your characters getting ~stuck~ on geometry in the gameworld, and you'll occasionally see characters clip right through walls, especially when provoked to attack. Also, the game has some issues with character and monster artificial intelligence, particularly when you either gain followers or need to escort characters to safety as part of your quests--a combination of pathfinding issues and getting stuck on geometry often causes your wards to get lost, which means you have to backtrack and go looking for them. Gothic 3 is also a great-looking game that has detailed character models and interior environments and beautiful outdoor vistas, especially if you have a higher-end computer system and can get away with turning the game's graphics settings up. The game's good-looking graphics go a long way toward making the game seem like an epic adventure in a huge, sprawling world, even if the flat dialogue and issues with characters getting stuck on things sometimes detracts from it. You'll find plenty of quests and new areas to explore in the game. All things considered, it's unfortunate that the game shipped with its technical problems, and that it shipped in the same year as The Elder Scrolls IV: Oblivion, since it's almost impossible to avoid comparing the two. Gothic 3 doesn't have Oblivion's huge breadth and might not look quite as impressive just because of that difference in scale, but it does offer a fairly well put-together story in its set of linked quests, as well as plenty of freedom to roam. To enjoy the game, you'll need a high-end computer, time and patience, and tolerance for a brisk challenge--but if you have all these things, Gothic 3 could be what you're looking for."}