{"ref": "https://www.gamespot.com/reviews/neverwinter-nights-2-review/1900-6160878/", "date": "November 1, 2006", "game_name": "Neverwinter Nights 2", "text": "To say that the expectations are high for Neverwinter Nights 2 would be a massive understatement. Not only is it the sequel to one of the best role-playing games ever to bear the Dungeons & Dragons license, but it's also been developed by some of the creative talent behind such other revered role-playing games as Baldur's Gate and Icewind Dale. The good news is that Neverwinter Nights 2 lives up to its pedigree by delivering a captivating story full of exciting twists and characters who you'll grow attached to out of fondness or, perhaps even better, complete loathing. It's not without a few frustrating technical shortcomings, but overall Neverwinter Nights 2 is a great role-playing adventure that just about anyone can enjoy. Treasure box? Check. Shield? Check. Pointy ears? Check. Neverwinter Nights 2 has all the trappings of a classic Dungeons & Dragons adventure, but it doesnt come off the least bit hokey or clich. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Neverwinter Nights 2 Video Review As great as the story is in Neverwinter Nights 2, it's difficult to convey without spoiling the plot; but suffice it to say that it will keep your interest throughout the entire campaign--which, at around 50 hours long, is no small feat. You begin the game by creating a character. You can choose a race, subrace, appearance, class, moral alignment, and even a voice for your hero. After you create your character, you are taken on a journey that will see you rise from your beginnings as a humble peasant to become one of the most respected and elite heroes of Neverwinter. It's a long journey that involves the awakening of an arcane and unstable evil power that only a chosen savior (guess who?) can banish. As clich as it sounds, the story reaches far beyond the usual good-versus-evil plot. You'll get a heavy dose of political treachery; shattered, shifting, and solidified alliances; ethereal mysticism; dark secrets; and much, much more. In addition to the main story, the world is full of side stories that you can explore or ignore as you see fit. It all adds up to make this feel like a real world with real history and very real inhabitants, but beyond even that, the game does a great job of making you feel like an integral part of that world, rather than some insular hero who comes out of nowhere to save the day and then disappears. A large part of what makes the story so interesting is that you play an active role in the way it unfolds. As you talk to all of the characters in the world, you're given several choices in how to respond, and your responses often have a very apparent effect on the progression of the story. When speaking to someone, you might be given the choice to lie, intimidate, or simply ask questions to get the information or response you're looking for. The choices aren't black-and-white, though, and you'll often come across some difficult moral dilemmas that make your part in the conversation much more interesting. Your responses have both immediate and delayed effects. If you tell a goblin chieftain that you're sick of hearing him talk and would rather paint the walls with his blood, you can expect that you'll have an immediate fight on your hands. But sometimes the effects are more subtle. If you are forced to make a decision and one of your party members tries to convince you to take a certain course of action, you can comply or simply tell her to keep quiet. Either way, your influence over that person will be affected. It isn't much of an issue at first, but repeatedly going against an ally's wishes can eventually turn him or her against you. The interactive dialogue is well written and so engaging that you'll probably want to save your game often, so you can reload and repeat conversations just to see what will happen if you choose your words differently. Even though you create a character who serves as the central hero for the tale, there's a great and varied cast of supporting characters who will join you along the way. You can have up to three supporting characters in your party, in addition to the occasional non-player or special character who will tag along with you. With a quick click you can take direct control over any of your party members at any time (as long as they're conscious), which adds some welcome variety to the single-player experience because you aren't pigeonholed into playing a single class for the entire game. By creating a well-rounded party of casters, fighters, rogues, and rangers, you'll have access to a huge array of skills and abilities. For the most part you'll use those skills and abilities to combat all kinds of monsters, people, spirits, and animals that always seem to get in your way. The combat takes place in real time, but you have the option to pause the game and assign up to five successive actions to each of your characters. Then it's just a matter of hitting the space bar to unpause the game and watching your characters go to work. The most frequent battles don't usually require that level of management, though, because you'll almost always come out on top by just rushing into a mob of enemies and letting the artificial intelligence do the work. If you do happen to lose all your health you'll be temporarily knocked out (despite the cobwebbed corpse icon that replaces your character portrait). As long as one of your characters survives the battle your party will revive, and then you can use the rest function to fully replenish your health in just a few seconds. Unfortunately, the AI in Neverwinter Nights 2 isn't always reliable. If you're in an open area you can usually count on your companions to stick by you and back you up in a fight, but when you're exploring the narrow hallways and labyrinthine corridors of the games' numerous, sprawling dungeons, your characters will sometimes get lost or stuck, or will just freeze up for no apparent reason. Needless to say, it's extremely frustrating when you're in the middle of a heated battle and your supporting characters are just standing there watching you get trounced. At least if that happens you can pause the game and assign actions to spur your lifeless cohorts to action, but when you have to struggle just to get your characters to follow you, you'll find your patience wearing thin. The artificial intelligence is usually passable, but it can be downright stupid sometimes. Don't worry, though--all that work fighting mob after mob of nefarious foes does pay off. Primarily you'll be vanquishing evil for the sake of completing quests. There are a ton of quests in the game, most of which you aren't actually required to complete in order to beat the game. The quest design is interesting and usually fits well within the context of the story. There are some quests that just require you to find or deliver a certain item, but the required quests are usually much more involved than that. You'll be asked to do everything from saving damsels in distress to answering riddles and even acting as a trial attorney. By completing quests you earn experience points, and when you have enough experience points your characters will gain a level. By gaining levels you develop basic skills like strength, dexterity, and intelligence, and you also learn new feats and spells. You also gain experience points for defeating enemies, but the vast majority of your experience comes from finishing quests, and all of your characters earn experience simultaneously, whether they're actively in your party or not. In addition to experience points, you'll collect copious amounts of treasure that you can use or sell for gold. Since your weapons and armor greatly affect your stats and performance in battle, you'll always be on the lookout for new and exotic treasures that will help you squeeze a little bit more damage out of each blow you land on your enemies. There's also an item synthesis system in Neverwinter Nights 2 that lets you collect ingredients and recipes and use them to create new, useful items, as long as your character is at the required skill level to do so. Still, you'll probably end up selling the vast majority of the loot you collect, rather than actually using it. The joy of looting is slightly diminished by the unnecessarily cumbersome interface. There's no way to sort your items by type, so you'll end up having to sift through four pages of cluttered, often barely distinguishable icons representing all of your items. To examine your items you have to right-click and select the option from a menu, which makes checking the stats on the new bastard sword you just picked up a bit more of a hassle than it should be. Interface issues like these have been addressed in numerous other role-playing games, so it feels a bit dated here. With the right cast of characters in your party you'll be ready to face just about anything as you stroll through one dungeon after the next. Neverwinter Nights 2 bears the official Dungeons & Dragons license, which is apparent right from the beginning of the game when you start reading about things like saving throws, will saves, modifiers, armor class, and die rolls. Everything from creatures and items to character classes and abilities are all taken from version 3.5 of Dungeons & Dragons. If you've never rolled a 20-sided die in your life then you might be a bit confused by all the stats and jargon in this game, but if you give it a bit of time you shouldn't have a problem getting a general idea of how everything works. After all, the same principle of ~bigger numbers are better~ that works in just about every role-playing game still applies here. If you're a D&D veteran, though, you'll feel right at home here, and you aren't likely to find a more accurate and faithful adaptation of the Dungeons & Dragons rule set in any other video game. Like Dungeons & Dragons, Neverwinter Nights 2 emphasizes multiplayer interaction and creative development. You can play the game online or on a local network with up to three other players. The single-player campaign is available to play cooperatively, although you'll need to start from the beginning because you can't add new players into an existing single-player game. You can set options such as a level cap, item restrictions, and whether or not to allow players to damage each other. The in-game server browser makes it easy to find or set up a game, and although you need a BioWare Community account to log in, it's free and easy to set up, and it just requires an e-mail address. We did notice some slight lag when playing multiplayer on a local network, but not enough to cause any real problems. If you've had enough of the main story campaign, you can create your own and share them online. Included with Neverwinter Nights 2 is an editor program so robust that it's seemingly limited only by your own imagination. It will take a good deal of time and effort to start building your dream campaign, but the possibilities are there if you're determined and moderately savvy with similar software. Given the large and active community of module creators for the original Neverwinter Nights game, the opportunity is there for the sequel to be just as interminable as its predecessor. Most of the shortcomings of Neverwinter Nights 2 are technical in nature. First off, the game has some fairly steep system requirements, but that horsepower won't get you much. Even on a system that exceeds the recommended specs, with all of the options maxed out, there are some rough spots that make this game look dated. In some of the dialogue sequences the view switches to a zoomed-in, letterbox perspective. It's a nice effect that makes the cutscenes a bit more dramatic than small text windows, but getting in that close also reveals some blurry, low-resolution textures, jerky character animations, and frequent clipping. The game doesn't look bad by any means, and some of the level designs are genuinely interesting and fun to explore, but at the same time it's reasonable to expect the game to be a bit more pleasing on the eyes given its system requirements. When a character's beard is clipping right through his chest, or when he floats across the floor without moving his legs, the game just looks a little sloppy. That said, some of the spell effects are pretty spectacular, and when you're in a large battle with several casters it's like watching a pyrotechnics show. The most frustrating part of the presentation in Neverwinter Nights 2 is the camera. There are four different camera modes to choose from, but they all require almost constant adjustment to see what's going on. The camera will get stuck on a building or object or will just start tweaking out for no reason, which is incredibly annoying. The best option is to zoom the camera all the way out for a bird's-eye view. Even then you'll feel like you've found a barely workable solution rather than an ideal viewing angle. You'll eventually come to terms with the camera, but it's unnecessarily awkward. You have to be mindful of your companions' feelings, otherwise they might turn on you. This game sounds much better than it looks. There's a ton of voiced dialogue in the game, and although some of the voices are annoying, all of the main characters sound great, and their respective voices lend each one a lot of personality. From the sinister-sounding evil wizard to the feisty young demon girl, the voices all sound appropriate and fitting. The music is excellent, with dramatic orchestrated tracks that sound as if they could be taken right from a big-budget Hollywood film. The music does a great job of setting an appropriately grandiose and bombastic backdrop for your adventure, without being overwhelming. If you're willing to look past a few relatively minor technical issues, you'll have a great time exploring the world of Neverwinter Nights 2. The excellent story, characters, and quests will appeal to your sense of adventure without getting overly convoluted. The many paths you can take through the lengthy single-player campaign are enough to make this game worth your money, but when you factor in the multiplayer and the editing tools you'll find that Neverwinter Nights 2 is a fantastic value and a thoroughly enjoyable game. The joy of looting is slightly diminished by the unnecessarily cumbersome interface. There's no way to sort your items by type, so you'll end up having to sift through four pages of cluttered, often barely distinguishable icons representing all of your items. To examine your items you have to right-click and select the option from a menu, which makes checking the stats on the new bastard sword you just picked up a bit more of a hassle than it should be. Interface issues like these have been addressed in numerous other role-playing games, so it feels a bit dated here. With the right cast of characters in your party you'll be ready to face just about anything as you stroll through one dungeon after the next. Neverwinter Nights 2 bears the official Dungeons & Dragons license, which is apparent right from the beginning of the game when you start reading about things like saving throws, will saves, modifiers, armor class, and die rolls. Everything from creatures and items to character classes and abilities are all taken from version 3.5 of Dungeons & Dragons. If you've never rolled a 20-sided die in your life then you might be a bit confused by all the stats and jargon in this game, but if you give it a bit of time you shouldn't have a problem getting a general idea of how everything works. After all, the same principle of ~bigger numbers are better~ that works in just about every role-playing game still applies here. If you're a D&D veteran, though, you'll feel right at home here, and you aren't likely to find a more accurate and faithful adaptation of the Dungeons & Dragons rule set in any other video game. Like Dungeons & Dragons, Neverwinter Nights 2 emphasizes multiplayer interaction and creative development. You can play the game online or on a local network with up to three other players. The single-player campaign is available to play cooperatively, although you'll need to start from the beginning because you can't add new players into an existing single-player game. You can set options such as a level cap, item restrictions, and whether or not to allow players to damage each other. The in-game server browser makes it easy to find or set up a game, and although you need a BioWare Community account to log in, it's free and easy to set up, and it just requires an e-mail address. We did notice some slight lag when playing multiplayer on a local network, but not enough to cause any real problems. If you've had enough of the main story campaign, you can create your own and share them online. Included with Neverwinter Nights 2 is an editor program so robust that it's seemingly limited only by your own imagination. It will take a good deal of time and effort to start building your dream campaign, but the possibilities are there if you're determined and moderately savvy with similar software. Given the large and active community of module creators for the original Neverwinter Nights game, the opportunity is there for the sequel to be just as interminable as its predecessor. Most of the shortcomings of Neverwinter Nights 2 are technical in nature. First off, the game has some fairly steep system requirements, but that horsepower won't get you much. Even on a system that exceeds the recommended specs, with all of the options maxed out, there are some rough spots that make this game look dated. In some of the dialogue sequences the view switches to a zoomed-in, letterbox perspective. It's a nice effect that makes the cutscenes a bit more dramatic than small text windows, but getting in that close also reveals some blurry, low-resolution textures, jerky character animations, and frequent clipping. The game doesn't look bad by any means, and some of the level designs are genuinely interesting and fun to explore, but at the same time it's reasonable to expect the game to be a bit more pleasing on the eyes given its system requirements. When a character's beard is clipping right through his chest, or when he floats across the floor without moving his legs, the game just looks a little sloppy. That said, some of the spell effects are pretty spectacular, and when you're in a large battle with several casters it's like watching a pyrotechnics show. The most frustrating part of the presentation in Neverwinter Nights 2 is the camera. There are four different camera modes to choose from, but they all require almost constant adjustment to see what's going on. The camera will get stuck on a building or object or will just start tweaking out for no reason, which is incredibly annoying. The best option is to zoom the camera all the way out for a bird's-eye view. Even then you'll feel like you've found a barely workable solution rather than an ideal viewing angle. You'll eventually come to terms with the camera, but it's unnecessarily awkward. You have to be mindful of your companions' feelings, otherwise they might turn on you. This game sounds much better than it looks. There's a ton of voiced dialogue in the game, and although some of the voices are annoying, all of the main characters sound great, and their respective voices lend each one a lot of personality. From the sinister-sounding evil wizard to the feisty young demon girl, the voices all sound appropriate and fitting. The music is excellent, with dramatic orchestrated tracks that sound as if they could be taken right from a big-budget Hollywood film. The music does a great job of setting an appropriately grandiose and bombastic backdrop for your adventure, without being overwhelming. If you're willing to look past a few relatively minor technical issues, you'll have a great time exploring the world of Neverwinter Nights 2. The excellent story, characters, and quests will appeal to your sense of adventure without getting overly convoluted. The many paths you can take through the lengthy single-player campaign are enough to make this game worth your money, but when you factor in the multiplayer and the editing tools you'll find that Neverwinter Nights 2 is a fantastic value and a thoroughly enjoyable game."}