{"ref": "https://www.gamespot.com/reviews/neverwinter-nights-2-storm-of-zehir-review/1900-6201808/", "date": "December 1, 2008", "game_name": "Neverwinter Nights 2", "text": "Obsidian Entertainment attempts to turn back the clock with Storm of Zehir, a Neverwinter Nights 2 expansion that tries hard to emulate the seminal single-player role-playing game Baldur's Gate. But even though nostalgia makes this notion appealing, this attempt to shoehorn an old-fashioned strategic RPG boasting a full party of adventurers into an engine built to showcase a story-driven tale about a single lead character hasn't really succeeded. So while taking a trip back in time might seem like a nice idea for an RPG vacation, the result is a clumsy affair that plays more like an above-average homebrewed mod than a full-blown official add-on. Storm of Zehir feels different from the very beginning. The story is extremely stripped down, especially in comparison with the cataclysmic original Neverwinter Nights 2 showdown against the King of Shadows and the epic first expansion, Mask of the Betrayer. Here, you play as a pedestrian low-level hero not looking to save the world but to escort a trade mission on a ship heading from the overexposed Sword Coast to the never-before-seen jungles of Samarach. The game takes this concept so far that you can even sell goods between towns and set up trade routes to make a few bucks as actual merchants. The plot wont necessarily grab you throughout its 20 hours or so of play, and the first few hours seem to have plenty of RPG clichs--youll lose all your gear early on in the game, for instance. Dull quests take a lot of the shine off the bright and colorful visuals. Instead of tackling the usual earth-shattering events of a Dungeons & Dragons game, here you take on the duties of a mop-up crew coming in after the party's over. The King of Shadows has already wreaked his havoc, and you're just some poor schlub out to try to make a buck by ensuring that merchants can once more ply their trade. The quests reflect this mundane storyline. You run a lot of lame errands to kill specific monsters and recover lost or stolen merchandise, and you clean out a bunch of formulaic dungeons, caves, graveyards, and the like. Most locales are fairly small, so they seem more like minor obstacles that can be raced through in a few minutes than the huge strongholds and lairs typical of RPGs. Trading feels more like a minor irritant than a worthwhile feature. Generally, you acquire the game's three goods--ore, lumber, and skins--in one place and then sell them at a profit somewhere else. Transactions are handled on simple menu screens when you enter a town, so you don't do anything more than hit a few buttons to add money to your coffers. And the concluding reveal and battle come up so suddenly and are so anticlimactic that you won't believe they're the ending of the game until you've exited to the desktop. Rather than playing as a solo hero chosen for some great destiny, you roll up a party of four average joes just like you did way back when in D&D classics like the Baldur's Gate and Icewind Dale franchises. While you start off with a single lead protagonist meant to be your alter ego, you add three adventurers to the party roster almost immediately and can then add two more cohorts as the campaign moves along. You can take total control of all of these characters and fight battles in a style similar to the quasi-tactical struggles of old-time strategic RPGs, which makes the campaign ideal for multiplayer adventuring online. Where both the original campaign and the one in Mask of the Betrayer didn't seem to do much with the outstanding multiplayer options in the Neverwinter Nights series, this one seems almost designed to be played with friends, even though, oddly, Obsidian doesnt recommend the scenario for multiplayer games.. The atmosphere is different from that in the previous Neverwinter Nights games; the emphasis on a single hero and a heavily scripted story has been dumped in favor of more traditional, more wide-open role-playing. If you pause the game enough or play with some friends, you can almost pretend that you're back in a turn-based game circa 1989. Unfortunately, it seems like the Neverwinter Nights 2 engine wasnt quite up to the task of making this experience consistent. Artificial intelligence is a big problem. You can switch between having full control of your party members and letting the AI handle things, but neither option works all that well. If you go for total control, you're constantly pausing the action to wrangle with an interface geared for looking after just one character. The pull-down menu that never worked smoothly for the original Neverwinter Nights 2 is far worse when dealing with at least four characters. A proper turn-based interface would require a lot less messing around and investment of your time. You can turn on the AI to automate party decisions during combat, though this can lead to even worse results. Leaving the game on its default settings leads to suicidal melee attacks and all-out magic assaults that can empty your spellcasters' arsenals in moments, often in battles with piddly opponents, such as a swarm of bats. Actions can be thoroughly customized, but it's tough to come up with a formula that works in all battle situations. You can find yourself fussing with the settings so much that it makes more sense to simply shut the AI off and do everything manually. Additions to the main aspects of Neverwinter Nights 2's gameplay are sort of adventurous, if not entirely successful. The best and worst new feature is an overland map used for traveling between quest locales, like towns and dungeons. This is a simple, old-fashioned interface where you pick a party leader and he or she then leads your adventurers into the wilderness. The good news is that this map allows for open-ended exploration that adds a sense of venturing into the unknown that hasn't been incorporated into a D&D RPG for years. You can discover loads of hidden goodies just by wandering around, from secret lairs to magical artifacts to bundles of clothing you can use to make an impromptu health kit. The bad news is that this map is loaded with a crazy number of random encounters. Unless you have a party leader like a ranger who has serious points dedicated to skills like hide, move silently, and survival, you can't help but stumble into one pack of monsters after another every time that you hit the overland map to head to a new quest. One moment you're set upon by skeletons, then it's a gang of gnolls, then zombies, then earth elementals, then spiders, and so on. Monsters can hit so hard and so often that you can never rest, which turns map travels into tedious slogs that wear you down over time. Still, the overland map could be a great feature with some serious tweaking. It will be interesting to see what modders do with it. Overland map travels add a dash of old-fashioned RPG goodness to the adventure. The expansions other extras include tweaks to the game engine that hardcore fans of the series may appreciate, but more-casual players may gloss over. Conversations have been tweaked to enhance the use of character skills that often go ignored. A menu featuring all party members now appears in the dialogue window, allowing you to change speakers on the fly to open up different conversation options and best use abilities such as intimidate and bluff. Parties are further emphasized with teamwork benefits that can give you bonuses such as fearsome roster, which can scare off enemies on the overland map, and circle of blades, which hits opponents with extra damage whenever you can flank them. You also get two new races (Gray Orc and Yuan-Ti Pureblood), a trio of new prestige classes (Doomguide, Hellfire Warlock, and the Swashbuckler), some minor changes to crafting, and the usual handfuls of new items and spells. The visuals do a better job of building a believable setting than the plot does. Many scenes are gorgeous, and the jungle is the most realistic-looking terrain presented by the Neverwinter Nights 2 franchise. Just about everything is green and covered with lifelike lichen. Lighting effects and spell pyrotechnics are also spectacular. The voice acting, however, is awful. With the exception of the subtly slimy take on Forgotten Realms' ne'er-do-well Volo, the actors here seem to have just two gears: way over the top and dull monotone. It's a long way from the stellar acting found in the original Neverwinter Nights 2. On the other hand, the soundtrack is absolutely brilliant. This subtle, sweeping score is right up there with the best that Hollywood has to offer, giving you something to hum long after you've shut down the game. Storm of Zehir isn't a terrible addition to the D&D gaming canon, although it is a lot less refined than you might expect. You have to suspect that this is the result of straying too far from the original Neverwinter Nights 2 formula, and ultimately this expansion pack isn't as enjoyable."}