{"ref": "https://www.gamespot.com/reviews/splashdown-review/1900-2825368/", "date": "May 17, 2006", "game_name": "Splashdown", "text": "Regardless of whether or not it's warranted, comparisons will always be drawn between the Wave Race series and successive water-based racing games since, to this date, very few games have successfully replicated Wave Race's excellent wave physics. Rainbow Studios' Splashdown doesn't compare favorably in such a scenario because it lacks any substantial wave dynamic--which is suitably disappointing when taking into account the location of some courses in the game. But to dismiss this game based solely on its lack of surf would be undeserved--Splashdown's driving mechanics still excel beyond those found in similar games, and the interaction between the wave runner and the water is still done well. Splashdown has a variety of driving methods and techniques that can impact the outcome of any race. Pulling back on the analog stick while approaching top speed causes the craft to hydroplane across the water, decreasing the amount of water resistance and giving you a slight boost in speed. However, hydroplaning before the wave runner reaches optimal speeds can have a detrimental effect on your race performance, as such an action usually results in your craft losing speed. As rare as they may be, waves can be particularly problematic for racers who use hydroplaning because the waves will lift you into the air, reducing your speed. Even basic actions like turning use alternative strategies. When going into a turn around a wall or a buoy, you must decide whether or not you want to make a sharp cut by pressing diagonally on the analog stick--or you can simply perform a basic turn. Consistent use of the sharp-turning function can shave a few seconds off your final lap time, whereas a basic turn doesn't really help or hurt your chances of a great finish. However, the catch with making proper sharp turns is that it can take a little time before you can execute them properly, so you're better off practicing this technique in one of Splashdown's other modes. Splashdown's trick system serves a similar purpose by offering similar risks as other methods for winning a race. Whenever you perform a trick in Splashdown--which usually involves a ramp--a small meter located to the right of your speed gauge will slowly fill. As the meter reaches capacity, the overall performance of your wave runner increases once again, giving a possible advantage over the other competitors. Basic tricks like can-cans or kicks fill the meter in small segments, but the more difficult tricks, like the handlebar foot grab, will fill it much quicker--although you run the risk of losing control of the wave runner with the complex tricks. If you need a quick boost and there aren't any ramps in sight--as unlikely as that is--you can do a quick invert trick that involves quickly dipping under the water and then launching into the air, allowing you to perform a back flip. Unfortunately, you can lose a lot of speed performing this maneuver, so the benefits don't necessarily justify it. Overall, the trick system is easy to use--it requires you to press only one of three trick buttons and a direction on the analog stick, and since it plays such an important role in the game, this nearly effortless trick system is certainly welcomed. While Splashdown's mechanics are sound, you can't help but be disappointed by the fact that these mechanics would've been put to better use had the development team incorporated more waves and more dynamic water physics into each course, but at the same time, that disappointment seems almost unfounded. Many of the courses in Splashdown are fresh water areas, which are generally not known for having enormous waves. Even on the oceanside courses, most of the action takes place close to land where large waves wouldn't normally be found. The few sets of waves that are in the game seem pathetic at attempting to demonstrate that this particular engine is capable of calculating waves, as they seem almost out of place or unnatural in their positioning on the course--perhaps leaving the waves out altogether would've been a better course of action.Still, the water cosmetically looks good--smaller undulating waves are quite clear, as is the foam that laps up onto the shore and various objects, which are happily plentiful. The individual rider models look solid and animate well, and the model of the Sea-Doo wave runner also looks about as accurate as you can get. Splashdown does have a few visual flaws, like draw-in, though it's never so horrible that it handicaps your ability to play. However, there is some noticeable slowdown in the championship mode, which occurs when you're trying to take a turn along with a few competitors. Since the other competitors are literally right on top of you in this situation, the stuttering frame rate can make it difficult to successfully navigate out of the pack. Splashdown's sound complements the game well. At the start of the race, you'll be able to hear the familiar noise of a wave runner's engine gargling water. Racers will talk as they perform tricks off ramps and even make comments about other competitors when they're in close proximity. Unfortunately, these voices--which border on being offensive in some cases--can become a little annoying when you hear the same line constantly repeated while you progress through the game. The soundtrack offers a mix of popular songs from bands like Smash Mouth and a few lesser-known songs that fit the general theme of the game. There is quite a bit of potential replay value in Splashdown, but a majority of the extras really aren't worth playing the game through repeatedly. The championship mode--in which you participate in either 12 or 20 races depending on difficulty--lets you unlock additional courses, costume colors, and riders that you can access in other modes. In the arcade mode, you can participate in a few different events such as time attack and countdown--a mode in which you have to a number of different colored buoys before time expires. Splashdown's arcade and split-screen multiplayer modes offer a fun little diversion from regular competition, but most of your time will probably be spent in the championship mode. Splashdown is one of those games that successfully executes a number of different elements but, at the same time, doesn't take full advantage of the setting. The gameplay mechanics reward players who take the time to become familiar with different racing techniques, which aren't that difficult to learn thanks to the game's equally good control. The water physics are generally good, but it's clear that a little more time should've gone into making them much more dynamic and interesting--like having the water change depending on weather conditions. In any case, Splashdown is a good racing game that--with a few tweaks-- could have easily been one of the greatest.Still, the water cosmetically looks good--smaller undulating waves are quite clear, as is the foam that laps up onto the shore and various objects, which are happily plentiful. The individual rider models look solid and animate well, and the model of the Sea-Doo wave runner also looks about as accurate as you can get. Splashdown does have a few visual flaws, like draw-in, though it's never so horrible that it handicaps your ability to play. However, there is some noticeable slowdown in the championship mode, which occurs when you're trying to take a turn along with a few competitors. Since the other competitors are literally right on top of you in this situation, the stuttering frame rate can make it difficult to successfully navigate out of the pack. Splashdown's sound complements the game well. At the start of the race, you'll be able to hear the familiar noise of a wave runner's engine gargling water. Racers will talk as they perform tricks off ramps and even make comments about other competitors when they're in close proximity. Unfortunately, these voices--which border on being offensive in some cases--can become a little annoying when you hear the same line constantly repeated while you progress through the game. The soundtrack offers a mix of popular songs from bands like Smash Mouth and a few lesser-known songs that fit the general theme of the game. There is quite a bit of potential replay value in Splashdown, but a majority of the extras really aren't worth playing the game through repeatedly. The championship mode--in which you participate in either 12 or 20 races depending on difficulty--lets you unlock additional courses, costume colors, and riders that you can access in other modes. In the arcade mode, you can participate in a few different events such as time attack and countdown--a mode in which you have to a number of different colored buoys before time expires. Splashdown's arcade and split-screen multiplayer modes offer a fun little diversion from regular competition, but most of your time will probably be spent in the championship mode. Splashdown is one of those games that successfully executes a number of different elements but, at the same time, doesn't take full advantage of the setting. The gameplay mechanics reward players who take the time to become familiar with different racing techniques, which aren't that difficult to learn thanks to the game's equally good control. The water physics are generally good, but it's clear that a little more time should've gone into making them much more dynamic and interesting--like having the water change depending on weather conditions. In any case, Splashdown is a good racing game that--with a few tweaks-- could have easily been one of the greatest."}