{"ref": "https://www.gamespot.com/reviews/homeworld-2-review/1900-6075223/", "date": "September 16, 2003", "game_name": "Homeworld 2", "text": "A space opera of epic proportions awaits in Homeworld 2, the impressive sequel to the 1999 real-time strategy game that successfully incorporated three-dimensional deep-space combat. This is something that, arguably, no other games since have achieved as successfully, save for Homeworld: Cataclysm, a follow-up to the original. Homeworld 2 is a full-fledged sequel, but it is nonetheless very similar to its predecessor--it's like a remake, reintroducing the uniquely paced gameplay and virtually retelling the story of the original Homeworld with outstanding, new graphics and sound that are as remarkable today as Homeworld's were upon its release. As any fan of the original would expect, the gameplay again involves dramatic, tense ship-to-ship battles between various far-future fighter craft, bombers, frigates, capital ships, and more, which can readily be ordered to move about the game's seemingly boundless battlefields along any trajectory. Homeworld 2's lengthy single-player campaign is the main attraction, with its mesmerizing storyline and settings. It can be very difficult, even for experienced players of the original game, possibly in part because Homeworld 2's battles are so enthralling that you may just catch yourself staring at them rather than directing them. Homeworld 2 is a visually stunning and highly challenging real-time strategy game. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Homeworld 2 Video Review In Homeworld 2's campaign, you'll guide the self-sufficient mothership, The Pride of Hiigara, and its fleets of defenders in an effort to thwart the Vaygr, an imperial race that has come to claim the Hiigarans' domain. Along the way, the Hiigarans will engage in many fierce battles against the Vaygr, encounter some old allies, discover long-lost secrets, and attempt to fulfill an ancient prophecy. All this and more occurs during and in between more than a dozen big missions, which compose Homeworld 2's linear single-player campaign. The game's story is narrated soberly by The Pride of the Hiigara's two chief officers, whose emotionless, disembodied male and female voices relay important information constantly. The entire tone of the storyline, which is also manifest in the matter-of-fact radio chatter you'll hear in the midst of the game's intense space skirmishes, is highly unusual for its remarkable calmness and for how this calmness drastically contrasts with the epic scale of the conflict. All this gives Homeworld 2 a remarkably surreal quality and makes the campaign distinct and memorable. The basic structure of Homeworld 2's gameplay is exactly like the original's. At heart, this is a straightforward real-time strategy game in which your mothership is your base and factory and in which you must harvest a single resource from nearby asteroids in order to fuel your war machine. You must defend your resource collectors as they go about their business, all while building mixed fleets with which to attack the enemy's positions. Ships can be set to several different default behaviors, including passive, defensive, and aggressive, and can also be arranged into several different tactical patterns. Initially there seem to be fewer formations available than in Homeworld, but actually, different combinations of behaviors and tactics make for different fleet formations in Homeworld 2. The various ships in the game all seem well balanced, more so than those of the original. You'll likely gain respect for even the smallest ones. All ship classes may be upgraded by researching enhancements, such as to their engines and armor, and smaller ship classes--fighters, bombers, and most corvettes--are automatically constructed in squadrons, so you get a good deal for a relative small cost of resources. Though some of the late-game ships, namely destroyers and battleships, are extremely powerful and cannot be defeated without sustained, concentrated fire from many, many smaller ships (who may optionally target the larger ships' subsystems, like their weapons and engines), generally there are ways to counter all the different vessels in the game, and early-game units such as fighters and bombers remain useful even later on in a battle. As such, as with many other real-time strategy games, the proficient Homeworld 2 player is one who can quickly gather resources while marshalling an overwhelming, well-rounded strike force. This can be more complex than it sounds. One of the interesting changes in Homeworld 2 versus the original is that, in a typical skirmish or multiplayer match, and through the vast majority of the campaign, you have a fleet carrier to work with as well as your mothership. You can build and research from two separate points, and therefore you needn't put all your eggs in one basket. The mothership and carrier are both painfully slow units, but nonetheless, it may be viable to move these units to different parts of the map, which puts them both at risk but may lead you to a tactically advantageous position. There are also interesting defensive options available. Anti-fighter gun turrets, and anti-capital ship ion turrets and missile platforms are relatively inexpensive structures that can be moved once--build them and order them to a point on the map, and there they will remain, automatically firing on any enemies that come into range. These are great for protecting your resource operations as well as deterring a frontal assault against your stalwart but relatively defenseless mothership and carrier. As mentioned, Homeworld 2 is uniquely paced among real-time strategy games and harkens to tense, tactical naval battles instead of to the typical breakneck pacing commonly seen in the popular real-time strategy games of today. Larger capital ships can take a tremendous beating before finally erupting in a blinding explosion. Smaller ships are great at evading most types of fire and tend to last a lot longer than you'd expect. And if even one fighter from a standard squadron of five makes it back from a sortie, the whole squadron may be quickly restored. The resulting conflicts are all about momentum, about who is pressing the advantage and gradually wearing away at the opponent. Don't expect fleet-demolishing superweapons here. Victory comes from deliberate and sustained attack, and it doesn't come quickly, especially since most ships--particularly larger ones--move quite slowly. Homeworld 2's campaign missions, skirmishes, and multiplayer matches can all be quite time-consuming, so you'd best set aside at least a good hour for a complete battle. Nevertheless, though the game's combat is methodical, it's by no means boring. It's common to have fleets operating in all different parts of the map, and between checking on the progress of numerous simultaneous engagements and queuing up new fleets and research projects at home base, you'll certainly have your hands full. The epic-scale battles between fighters, frigates, and capital ships are tense, methodical, and amazing to watch. The game's interface is streamlined and elegant, allowing you to effectively manage vast fleets of starships spread all across hundreds of thousands of kilometers of void. As in Homeworld, you use the shift key to move your forces ~up~ or ~down~ as necessary (you can also press and hold the left mouse button for the same effect), and you can press the space bar to toggle between a relatively up-close view and a more-tactical ~sensors~ view in which even your mothership is just a speck on the map. The transition between these perspectives is seamless, and using the mouse, you can effectively zoom in and out and rotate your view to set an ideal vantage point, or zero in on a particular ship, and then zoom in so close, you can make out the tiny details of the ship's paint job, see moving parts and flashing lights, and more. This is partly for show (and it's a great show), but since ship damage is clearly visible, and since you can actually watch as warring spaceships attack and hit each other, getting a close-up view of combat is actually the best way to gauge who's winning and who's not. So in fact, Homeworld 2 is one of the only 3D real-time strategy games to date in which zooming in to get a close-up of a battle isn't a pointless waste of time. The interface has a few other nice features, such as how you can toggle on a building and research queue and how you can see at a glance how many unit groups you've established and how units within a given group are faring. Also, each class of ship is outlined slightly differently in the sensors view, a very important and useful feature that informs you whether that dot is a scout squadron or a missile frigate. The interface does have a few minor issues that are specific enough to not warrant detail, and it certainly takes getting used to--a process facilitated by Homeworld 2's step-by-step tutorial, which is reminiscent of the excellent tutorial from the original game. However, all in all, the game controls very well, allowing you to work efficiently and spend your time planning and executing, rather than fumbling with the controls. The lengthy and often difficult campaign is well produced and is the main attraction of Homeworld 2. The game's artificial intelligence both for friendly and enemy units is also quite good. You don't need to babysit your forces, which by default will engage any incoming enemies and will concentrate on whichever specific foes they're best equipped to fight. You'll need to micromanage the reprioritization of targets and any tactical retreats, but generally, you can leave your capable spacecraft to their own devices. Meanwhile, the enemy, both in the campaign and in skirmishes, poses a serious threat and will decisively overpower your forces with counterforces if you overspecialize (such as if you only build ion cannon frigates and fighter escorts). As mentioned, the game can be very difficult. Your enemy will compete for the same resources and may quietly assemble an unstoppable fleet without your knowing. Since the campaign is linear and scripted, reattempting the missions can give you the benefit of foresight, though you'll still have a serious challenge ahead of you. One interesting aspect of Homeworld 2 is that, like in Homeworld, you retain your resources and fleets from one mission to the next. Thankfully, unlike in the first game, you instantly and automatically gather all remaining resources on the map once you complete a campaign mission's objectives. This lets you hit the ground running in the next scenario and keeps the campaign's pacing tight. On the other hand, some missions require you to eliminate all remaining enemy forces from the map before you can move on, and this can be irritating when all that's left is some hidden ship someplace. But as you learn to employ scouts and probes with your fleets, to quickly survey your surroundings, this shouldn't be such a problem. Homeworld 2's skirmish and multiplayer modes are straightforward, offering a good number of options for customizing a match prior to its start and allowing players to choose from either the Hiigarans or the Vaygr. The two factions are more differentiated than those of Homeworld, but they are by no means drastically dissimilar, and as such, players expecting a ton of multiplayer variety from Homeworld 2 may not get it. Likewise, the game uses a third-party application for its multiplayer player-matching, and it doesn't offer the quick-game modes or other useful features found in other currently popular multiplayer real-time strategy games. Multiplayer Homeworld 2 supports up to six players and can be as tense and exciting as the single-player mode, but it isn't necessarily the game's focal point or its strong suit. Stunning graphics undeniably add to the game's appeal. Homeworld 2's ships feature fully articulated weapons and other moving parts, and they feature uniquely alien designs, some of which are surprisingly distinctive, considering how difficult it must be to come up with an interesting-looking spaceship at this point. Warm-colored gasses and huge pieces of space detritus make the scenery anything but barren, and weapons fire, the cataclysmic capital ship explosions, and the evasive flight patterns of fighter craft all look incredibly convincing. The battles in Homeworld 2 do a thoroughly convincing job of evoking the drama and spectacle of the cinematic space battles seen in Star Wars, Star Trek, Robotech, and other films. For good measure, the game features stylishly done black-and-white cinematic cutscenes, reminiscent of those from the original game. Complex gameplay, well-designed units, and a slick interface make Homeworld 2 highly recommendable. Homeworld 2's audio is a perfect match for its visuals. The moody, atmospheric musical score, which uses various ethnic themes to help make all the interstellar activity as exotic as possible, is extremely well done. The music cuts in and out smoothly as you switch between close-up views of the ships and your sensors view, which is a great effect. Likewise, the sounds of combat are muted and distant as you watch from afar, but zoom in close to a given ship and you'll independently hear its weapons systems, engines, and more, all of which sound outstanding. The voice work in the game is also first-rate. As mentioned, the Hiigarans' commanding officers seem coolly detached but nonetheless seem to fit the parts perfectly. Meanwhile, your various ships all largely sound identical and will do a reasonably good job of reporting changes to battlefield conditions as they come up. By default, the radio chatter is a bit too frequent, and you'll start to hear it repeat. Nevertheless, this is a refreshing change of pace from the typically repetitive unit acknowledgements you get in other real-time strategy games. Overall, Homeworld 2 lives up to the high standards set by its predecessor. It may not be the ideal real-time strategy game for the player looking for another quick rush of multiplayer battles, but its production values are impeccably well done, its campaign is long and captivating, and its core gameplay is complex, tactical, and rewarding. As such, those who had a great time playing the original should by all means enjoy the sequel, as will most anyone interested in managing epic battles between huge spaceship fleets. The interface has a few other nice features, such as how you can toggle on a building and research queue and how you can see at a glance how many unit groups you've established and how units within a given group are faring. Also, each class of ship is outlined slightly differently in the sensors view, a very important and useful feature that informs you whether that dot is a scout squadron or a missile frigate. The interface does have a few minor issues that are specific enough to not warrant detail, and it certainly takes getting used to--a process facilitated by Homeworld 2's step-by-step tutorial, which is reminiscent of the excellent tutorial from the original game. However, all in all, the game controls very well, allowing you to work efficiently and spend your time planning and executing, rather than fumbling with the controls. The lengthy and often difficult campaign is well produced and is the main attraction of Homeworld 2. The game's artificial intelligence both for friendly and enemy units is also quite good. You don't need to babysit your forces, which by default will engage any incoming enemies and will concentrate on whichever specific foes they're best equipped to fight. You'll need to micromanage the reprioritization of targets and any tactical retreats, but generally, you can leave your capable spacecraft to their own devices. Meanwhile, the enemy, both in the campaign and in skirmishes, poses a serious threat and will decisively overpower your forces with counterforces if you overspecialize (such as if you only build ion cannon frigates and fighter escorts). As mentioned, the game can be very difficult. Your enemy will compete for the same resources and may quietly assemble an unstoppable fleet without your knowing. Since the campaign is linear and scripted, reattempting the missions can give you the benefit of foresight, though you'll still have a serious challenge ahead of you. One interesting aspect of Homeworld 2 is that, like in Homeworld, you retain your resources and fleets from one mission to the next. Thankfully, unlike in the first game, you instantly and automatically gather all remaining resources on the map once you complete a campaign mission's objectives. This lets you hit the ground running in the next scenario and keeps the campaign's pacing tight. On the other hand, some missions require you to eliminate all remaining enemy forces from the map before you can move on, and this can be irritating when all that's left is some hidden ship someplace. But as you learn to employ scouts and probes with your fleets, to quickly survey your surroundings, this shouldn't be such a problem. Homeworld 2's skirmish and multiplayer modes are straightforward, offering a good number of options for customizing a match prior to its start and allowing players to choose from either the Hiigarans or the Vaygr. The two factions are more differentiated than those of Homeworld, but they are by no means drastically dissimilar, and as such, players expecting a ton of multiplayer variety from Homeworld 2 may not get it. Likewise, the game uses a third-party application for its multiplayer player-matching, and it doesn't offer the quick-game modes or other useful features found in other currently popular multiplayer real-time strategy games. Multiplayer Homeworld 2 supports up to six players and can be as tense and exciting as the single-player mode, but it isn't necessarily the game's focal point or its strong suit. Stunning graphics undeniably add to the game's appeal. Homeworld 2's ships feature fully articulated weapons and other moving parts, and they feature uniquely alien designs, some of which are surprisingly distinctive, considering how difficult it must be to come up with an interesting-looking spaceship at this point. Warm-colored gasses and huge pieces of space detritus make the scenery anything but barren, and weapons fire, the cataclysmic capital ship explosions, and the evasive flight patterns of fighter craft all look incredibly convincing. The battles in Homeworld 2 do a thoroughly convincing job of evoking the drama and spectacle of the cinematic space battles seen in Star Wars, Star Trek, Robotech, and other films. For good measure, the game features stylishly done black-and-white cinematic cutscenes, reminiscent of those from the original game. Complex gameplay, well-designed units, and a slick interface make Homeworld 2 highly recommendable. Homeworld 2's audio is a perfect match for its visuals. The moody, atmospheric musical score, which uses various ethnic themes to help make all the interstellar activity as exotic as possible, is extremely well done. The music cuts in and out smoothly as you switch between close-up views of the ships and your sensors view, which is a great effect. Likewise, the sounds of combat are muted and distant as you watch from afar, but zoom in close to a given ship and you'll independently hear its weapons systems, engines, and more, all of which sound outstanding. The voice work in the game is also first-rate. As mentioned, the Hiigarans' commanding officers seem coolly detached but nonetheless seem to fit the parts perfectly. Meanwhile, your various ships all largely sound identical and will do a reasonably good job of reporting changes to battlefield conditions as they come up. By default, the radio chatter is a bit too frequent, and you'll start to hear it repeat. Nevertheless, this is a refreshing change of pace from the typically repetitive unit acknowledgements you get in other real-time strategy games. Overall, Homeworld 2 lives up to the high standards set by its predecessor. It may not be the ideal real-time strategy game for the player looking for another quick rush of multiplayer battles, but its production values are impeccably well done, its campaign is long and captivating, and its core gameplay is complex, tactical, and rewarding. As such, those who had a great time playing the original should by all means enjoy the sequel, as will most anyone interested in managing epic battles between huge spaceship fleets."}