{"ref": "https://www.gamespot.com/reviews/sword-of-the-stars-born-of-blood-review/1900-6173132/", "date": "June 26, 2007", "game_name": "Sword of the Stars", "text": "Sword of the Stars: Born of Blood is an expansion pack to last year's stylish turn-based space strategy game, Sword of the Stars. Like most expansions, it adds a fair amount of new content to its predecessor. There's a new, playable alien race (boosting the total to five); a slew of cool new gameplay features; and loads of improvements. However, it's also like a graduate-level course in the original game because Born of Blood feels like it was made for diehard Sword of the Stars fans ready for a new level of difficulty. The key new addition in Born of Blood is the Zuul, an alien race that features some excellent voice work that stands out from the rest of the races. Their voices are deep, gravelly, and delectably evil, which matches their nature. In keeping with the trend in Sword of the Stars, the Zuul play quite differently from any other race. Their fleets use tunnel drives to carve unstable paths to different worlds. The Zuul are also masters at reverse engineering alien technologies and mating them to their ships. On the flip side, they must keep conquering as they slowly drain their planets of resources and leave behind empty husks. However, their ships are a lot more durable than other races, making them a difficult foe in battle. The Zuul are a fun race to play, and their addition adds some welcome variety to the game, as the pickings seemed a bit slim with just four races. Hard to believe, but the galactic maps can be a lot larger than this. Along with the Zuul, Born of Blood introduces a slew of new features and enhancements to the core game. The diplomacy system has been beefed up, so it's possible to make demands of another race or designate a target world so that your allied races will know to attack it. There's a new intergalactic trade system built around freighters, and wherever there are trade routes, there's the opportunity for merchant raiding, so you may want to provide escorts for convoys. The weapons tree has also been bulked up a bit with the addition of new toys, such as armor-piercing rounds and boarding pods, along with new ship parts that allow you to create whole new classes of starship. Combat itself is a lot more rewarding because of the enhanced explosions and visual effects; when a ship explodes in this game, it can do so in a supernova-like blast that damages nearby ships. Still, even with all these new toys, Born of Blood is tougher than Sword of the Stars. The new alien menaces that roam about the galaxy are what make Born of Blood so brutal. In Sword of the Stars, you occasionally encountered a dangerous alien derelict or asteroid monitor around an unexplored planet and thought that was about it. But with Born of Blood, you'll carve out a nice interstellar empire for yourself and think you're in a good position when some truly nasty things suddenly appear to upset the galactic balance of power. For example, you may encounter the Locusts, a devastating alien menace that will wipe out the mightiest fleet in seconds and then completely strip a planet of its resources, rendering it all but worthless to you. Trying to come up with a counter for the Locusts is extremely vexing because almost all technologies are useless in the face of their threat, and they're just one of the new menaces that can ruin your day. At the same time, these alien menaces do a lot to help keep you on your toes, as well as wreak havoc on the mid-to-late stages of a game. Previously, all factions would colonize all available worlds and begin the slow, grinding war of attrition. But now with alien menaces, whole worlds can get taken out of play in a matter of a few turns. Get ready for a Darwinian battle for survival. Succeeding in Born of Blood is not easy because there are threats everywhere, from rival alien races to random alien menaces. It makes for a thoroughly challenging game, one that might daunt newcomers, though Born of Blood seems geared toward veteran players. One thing that hasn't changed in the expansion is the huge scale of the game. At the default galactic sizes, Born of Blood is a big game that will have you managing dozens upon dozens of colony worlds and fleets. And while the gameplay isn't as micromanagement-heavy as standard space strategy games, there's still a lot of information to crunch through each turn. If you want a more manageable game, it's much easier to scale the size of the galaxy down at the beginning. There's enough content in the expansion to give you room to explore new possibilities, and the surprises alone should help shake up any established strategies that you may have developed. Born of Blood adds some refreshing improvements to what was already an engaging space strategy game, though you should make sure you're up for the challenge before diving in."}