{"ref": "https://www.gamespot.com/reviews/shadowgrounds-review/1900-6149160/", "date": "May 5, 2006", "game_name": "Shadowgrounds", "text": "If you like your shooters built on nostalgic value, Meridian4 and Frozenbyte's Shadowgrounds might be up your alley. A top-down shooter in the vein of Smash TV with an atmospheric twist that borrows heavily from the Doom series, Shadowgrounds has simplistic mechanics but uses challenging gameplay to back them up. Unfortunately, challenging doesn't always equate to fun, and in the case of Shadowgrounds, its difficulty doesn't make the action any less monotonous as time goes on. Rather than testing your skill by throwing huge gangs of enemies at you, as many old-school top-down shooters tended to do, Shadowgrounds keeps its enemy attacks regulated to short bursts done to induce some kind of jump or scare in you. The trouble is that it's not effective. Shadowgrounds is too campy to be even remotely moody or scary, and without the scares, the action just comes across as kind of flat after a while. The top down shooter hasn't gotten much love in recent years, especially on the PC. Kudos to Shadowgrounds for at least trying to kickstart the genre again. The premise of Shadowgrounds ought to be eerily familiar to fans of the Doom franchise. You're a lowly mechanic on a space base parked on one of Jupiter's moons. One day, all hell breaks loose when a crew of creepy alien creatures shows up on the scene and starts wreaking havoc. Amid many moments of verbally wondering what the hell is going on, you're forced into battle, shooting your way through the scads and scads of nasty aliens. The game tries to inject some story into the whole equation by having you interact with other survivors on the base and even by out-and-out thieving the whole thing from Doom 3 where you'd walk around, reading people's computer screens and PDA's to piece together a picture of how this all came about. Unfortunately, none of it is interesting. The dialogue is generally pretty stilted, and the snippets of story just aren't all that intriguing. On the plus side, you don't really need to get too heavily into the story to appreciate a game like this. However, you do need to get into the gameplay. Initially, any shooter fan almost certainly will. Shadowgrounds takes the top-down shooter perspective and gives you plenty of labyrinthine environments to explore, as well as plenty of ugly aliens to blast your way through. The aliens themselves are nicely varied and come at you with a wide array of attacks. One moment you'll be flamethrowing acid-spitting slug creatures and the next you'll be firing off rockets at a towering beast with laser rifles for hands. The inspirado for Shadowgrounds' aliens is blatantly borrowed from many, many sci-fi action games of years past, but that doesn't make them any less satisfying to shoot. And it is satisfying...for a time. As mentioned earlier, the problem with Shadowgrounds' gameplay is not the mechanics or the weapons or the enemies, but rather the core design of how the action is presented. Shadowgrounds really wants to be Doom 3. It only sends you periodic swarms of enemies and more often tries to unsettle you by having small groupings of them pop up through the floor or out of a dark corner, and so forth. It goes even further by keeping things rather dark and forcing you to use a rechargeable flashlight to effectively get around certain areas. But as we said before, it's just not scary. There are no moments of fright to be had in the game, and the atmosphere really isn't all that creepy. So what you end up with are a few specific moments of excitement, experienced during the scant number of times in the game where you feel legitimately frantic and overwhelmed as you stave off heavy enemy attacks. Otherwise, you're just corridor crawling through dark rooms and occasionally shooting off small groupings of enemies. That's not to say that this isn't at all challenging, as even these small groupings can present a fair bit of danger, but it's not very thrilling for very long, and it all becomes predictable once you get a feel for the rhythm of the game. Also, there are some quirks and glitches in the gameplay that drag things down. In several scenarios you'll find yourself traveling with artificially intelligent companions. They're good about shooting at enemies when they come around, but they're also real bad about grouping up too closely next to you, to the point where you actually can't move. Eventually they'll get out of the way, but if this happens in the middle of battle, you usually won't be able to get away before the enemies have pounced and horribly murdered you. It wouldn't be such a big deal, except that you get limited respawns for each stage, and once you're out, you have to do the whole stage over again. Respawns themselves are also an annoying quirk. The game is real strange about where it wants to respawn you when you die, often forcing you to trek back much further than you'd prefer. You won't have to shoot down any of the enemies you've previously killed on the way back, but if you died in an especially inopportune spot, you may find yourself screwed. For example, in one scenario we died while standing inside an elevator on a top floor. After dying, we respawned on the bottom floor. After finding the elevator again and taking it back up, we were unpleasantly surprised to learn that the enemies that had killed us were all still standing in exactly the same spot inside the elevator and killed us in seconds simply because there was really not anywhere for us to go. Other times, respawns can be too opportune and destroy a challenge. In the game's first boss fight, you're in a room where the door locks behind you and you've got to fight a giant squidlike thing that keeps popping out of various water tanks. If you die, you'll respawn outside the room, and if you don't walk immediately back in, you can simply shoot the squid from afar while using the doorway to the room as cover and never die again. It's annoyances like these that make Shadowgrounds decidedly underwhelming from a gameplay perspective. The game's monsters are appropriately grotesque and evil-looking, but the game just isn't very creepy or scary. Atmospheric deficiencies aside, Shadowgrounds does do a good job of presenting itself. Since the game takes on a top-down camera angle through most of the game, it's not too surprising that the character models aren't exceptionally detailed up close. However, from that top-down view, the game has a pretty nice look to it. There's more detail in the environments than you might expect from a game of this type--the weapon effects are all pretty cool and the enemy designs are, again, varied and cool-looking, if not exactly original as far as aesthetics go. Also, Shadowgrounds runs quite well. Even with every graphical bell and whistle turned up, the frame rate only suffered during a few very specifically crazy sequences, but otherwise it ran wonderfully. Shadowgrounds is one of those games that manages to endear itself with certain qualities but ultimately can't shake off its problems to make the whole experience worthwhile. Its old-school nature is certainly going to appeal to a specific audience, but most people will find themselves rather bored with the whole thing once they realize that the game is neither scary nor action-packed but rather a muddled gray area between the two. If you're the sort of person who simply loves the idea of a Doom 3-esque sci-fi shooter done in classic top-down fashion, the game's cheap price tag and single-PC cooperative play might be enough to make it worth checking out (although playing the game with multiple people doesn't make it any less monotonous). But if you aren't within this specific group of people, Shadowgrounds probably won't do much for you."}