{"ref": "https://www.gamespot.com/reviews/sega-genesis-collection-review/1900-6162286/", "date": "November 22, 2006", "game_name": "Sega Genesis Collection", "text": "Classic game compilations are practically a dime a dozen at this point, but ones as good as this are highly uncommon. The Sega Genesis Collection, assembled by the emulation specialists over at Digital Eclipse, includes pixel-perfect renditions of nearly 30 different games, many of them great for their time, from the lifespan of Sega's famous 16-bit console. In addition, it's packed with some great extras, including bonus unlockable arcade games, interviews with Sega developers who worked on some of this stuff, and more. So if you have fond memories of playing the Genesis in the 1990s, this collection is practically a must-have. Many of the games in this collection are still highly playable and very challenging. The Sega Genesis Collection is available for both the PlayStation 2 and PSP, and the two versions are a little different. The core content of both versions is the same: The main menu lets you browse through an alphabetized list of 28 Genesis games, many of which are some of the system's greats, if not its classics. Sonic the Hedgehog and its superior sequel are included, along with Ristar, another solid platformer from the developers of Sonic. On the role-playing front, Phantasy Star II, Phantasy Star III, and Phantasy Star IV are included in this package, which helps make it an amazing deal. Phantasy Star II and IV, in particular, still stand out as some of the best RPGs of the era. For good measure, there's also Sword of Vermillion, an interesting action RPG with some then-great music and graphics. Other favorites like Golden Axe, Shadow Dancer, and Ecco the Dolphin are present, along with some other oldies-but-goodies like Kid Chameleon and Alex Kidd in the Enchanted Castle. Smaller, arcade-style titles like Flicky and Bonanza Bros. are included for a change of pace. Finally, some latter-day Genesis games are in there, like Comix Zone and Vector Man--games that are visually impressive but rather punishing. Not every game in the collection is a hit, but the inclusions are interesting. For example, you might derive some perverse pleasure from tracing the downward spiral of the Golden Axe series from the excellent original through to its two increasingly disappointing sequels. Ironically, this collection includes so many different Genesis games that the gaps in the lineup do stand out. The most notable absence is the Streets of Rage series, which was Sega's response to Final Fight and the overall popularity of side-scrolling beat-'em-ups. The fairly popular fighting game Eternal Champions also isn't in here, though you do get the Sega Genesis translation of Virtua Fighter 2. Many dismissed it at the time since it, of course, lacked the arcade version's stunning 3D graphics, but it looks good and plays quite well. The Streets of Rage omission notwithstanding, it's hard to complain about the selection of games in the Sega Genesis Collection, since it hits most of the bases and offers up a great cross section of the Genesis lineup. As mentioned, the emulation quality of these titles seems to be virtually perfect, even for some of the obscure vector-graphics arcade games. The music and sound effects are all there, the graphics move at the proper speed, and the visuals aren't filtered, dithered, or otherwise altered from their original versions. We spotted a few minor issues with the sound in a couple of spots--such as the tone made when jewels disappear in Columns, Sega's Roman-themed Tetris clone--but these were largely negligible. It's strange to think that getting these old games to work properly on today's hardware would be any sort of a challenge, but considering how many classic game compilations fail to emulate their classic games properly, it's great to see that a lot of care must have gone into making the Sega Genesis Collection look, sound, and play just like the games did for their time. The PlayStation 2 version of this collection features support for progressive-scan displays, while the PSP version includes different visual options, letting you play in the games' native resolutions or stretch them to fill the screen. Both versions give you the option to save your progress midgame if you want to. We noticed a slight ~ghosting~ effect playing some of the games on the PSP, causing the backgrounds to go a bit darker when in motion, but this wasn't a big deal. The PSP version also features Wi-Fi support for the two-player games in the collection, though you'll need multiple copies of the game. However, easily the biggest difference between the versions is in their unlockable bonus games. Some unlockable Sega arcade games are included as a great bonus, along with a number of developer interviews. On the PlayStation 2, you can unlock the original arcade version of Altered Beast, which, as you may discover, is superior to the Genesis version that's included in the package. You also get the isometric arcade classic Zaxxon and some other obscure but interesting titles from Sega's early arcade days. On the PSP, the arcade standouts include Super Zaxxon and Congo Bongo, but there's nothing from the late '80s like Altered Beast. That detail, along with the PSP version's higher retail price, make the PlayStation 2 version of the game the better choice for most people, unless you strongly prefer the idea of having these games with you on the go. Minimal loading times in both versions and a great menu system that lets you easily switch between different games makes it convenient to quickly browse through the lineup before hunkering down with some of your favorites. The Sega Genesis Collection is one of the most satisfying, well-put-together classic game compilations to date. That it's available for a budget price on the PlayStation 2 makes it all the more tempting, though being able to take these games with you anywhere makes the PSP version a great choice, too. Even if you were an avid fan of the Genesis back in its heyday, chances are you never got around to playing a number of these games, many of which are still quite fun and remarkably challenging even by today's standards. Or, even if the Genesis is before your time or you simply never got one, there's just so much history packed into this collection that it'd be a great choice for anybody interested in video games in general."}