{"ref": "https://www.gamespot.com/reviews/stitch-experiment-626/1900-2872278/", "date": "May 17, 2006", "game_name": "Disney's Stitch: Experiment 626", "text": "Jointly released by Sony and Disney Interactive, Stitch: Experiment 626 is being billed as a prequel to the new Disney animated film Lilo and Stitch. This 3D action platformer was developed by High Voltage Software, which recently did Hunter: The Reckoning, and it seems to take a few cues from the humorous, action-packed MDK games. Throughout the game you play as Stitch, the diminutive, four-armed, genetically engineered star of the movie, and are made to wreak havoc on a variety of worlds, all in order to collect DNA samples for your master and creator, Jumba. Structurally, Stitch: Experiment 626 is a lot like most modern platform games. You have to collect objects (in this case, DNA strands) scattered throughout the worlds to unlock new areas to explore, until you reach the conclusion. Its focus on blowing things up gives it a bit of a distinction, but since there's little context to the game and the levels seem thrown together, you'll probably lose interest quickly. Stitch is a pretty capable creature. He can hold a gun in each of his four arms, and he's much stronger and durable than you'd expect. If you've ever played MDK 2, then the four-armed dog, Max, is a good analogy for the way Stitch controls. You move around with the left stick, fire your guns with the square button, and strafe side to side with the L2 and R2 buttons. The circle button lets you pick up certain in-game objects and hurl them at enemies, usually for explosive results. The X button is reserved for jumping, or double-jumping if you double-tap the button. You have a host of other powers at your disposal, some of which are hard-coded into Stitch's unique genetic makeup and others that you obtain via special items that you get access to. The most notable of these is Stitch's ability to slow down time while retaining his own relative speed. It works much like the bullet-time mechanic in Max Payne, though Stitch can use it for more than just steadier aiming. Specifically, while using this power, he can then use his body as a projectile and careen into his enemies, like Street Fighter II's Blanka. There's a meter that regulates just how much you'll be able to use this power, but power-ups that replenish it are scattered throughout the environments in fairly generous supply. The remainder of Stitch's abilities is related to how he moves. Being a four-armed mutant, it's logical enough that he's able to wall-crawl. The surfaces that you'll be able to crawl on are marked by distinct textures, though these aren't consistent from level to level. Usually, though, the designs of the rooms will tip you off, or else, in the most confusing of cases, the designers have seen fit to include in-game messages to prompt you on your way. Stitch also has two high-tech gadgets that help him get around pretty effectively. First is a laser grapple that he can use to connect to and swing from remote surfaces--think Bionic Commando. You'll be able to gain momentum by swinging back and forth, and some sequences in the game have been pretty effectively designed around this mechanic. Last is Stitch's jetpack. It'll take the place of the laser grapple in some stages, and its use is regulated by a fuel meter. Stages in which you'll use it have fuel pickups scattered throughout them, so as with the slow-motion power, liberal use is usually possible. Stitch may have a decent number of abilities, but there seems to be little cohesion to the flow of the levels in the game. There's very little story or context to explain what you're doing from one level to the next, no doubt in part to prevent from spoiling the upcoming movie's plot. For what it's worth, on their own terms, some of the game's levels can be pretty amusing, especially if you have a propensity for blowing things up. Enemies aside, there are lots of destructible elements in Stitch: Experiment 626, including crystal formations, crates, alien totems, and the like. Some will hold power-ups, and others will hold DNA strands, but they all do much to further what seems to be the theme of the game: fast-paced, wanton destruction. That aside, some level designs are a bit more complex in concept. For instance, one will have you hopping on the backs of giant reptiles as they swim through pools of acid, in some sort of strange homage to Frogger. However, most of the levels are strictly linear, and while they don't necessarily encourage you to run through them heedlessly, they certainly don't punish you for doing that. It's the haphazard level design that really keeps the game from being more than middling. After playing through a few levels, you won't be able to shake the feeling that everything has been slapped together all willy-nilly. Power-ups are strewn about seemingly at random, often in spots unreachable except during suicide runs, and enemy spawn points seem as if they were set purely as afterthoughts. Cool gameplay concepts aside, much of the game's levels appear more like the product of someone playing around with a level editor rather than creating a professional game. The fact that every mission is essentially a hunt for DNA strands is a bit weak as well, and once you get over the rush associated with blowing up crates and crawling on walls, you'll find very little here to keep your attention. All told, if you have a little bit of twitch-game prowess and a rather long attention span, you'll be able to collect enough DNA strands to reach the game's final levels in a handful of hours, though given how repetitive things get even a few minutes in, you likely won't be motivated to get that far. Stitch: Experiment 626 is a fairly decent-looking game, with a relatively smooth frame rate and some genuinely neat particle effects. The character models are hit or miss, with some of the enemies looking nice and detailed and others looking sort of slapped together. The environments are cool looking--their color palettes are nice and vibrant, and the textures are passable. On the other hand, the game's camera perspective is a bit off a lot of the time, and in certain sequences--wall-crawling ones especially--it makes the game harder to play than it should be. Still, it's nothing that anyone who's played some other 3D platformers wouldn't already be used to. In terms of its sound, nothing in the game stands out one way or another. Stitch will occasionally yelp now and again, and Jumba will brief you frequently--and both voices are done decently. The music consists mostly of various repetitive techno confections. Stitch: Experiment 626 provides a disjointed gameplay experience, and as such it can't be recommended to anyone who isn't very into the recently released Disney movie. Though it isn't as bad as movie-based games tend to be, there are much better PS2 action games out there that would probably make better use of your time and money."}