{"ref": "https://www.gamespot.com/reviews/mafia-review/1900-2879254/", "date": "September 4, 2002", "game_name": "Mafia", "text": "Between Swedish developer Digital Illusions' upcoming World War II shooter Battlefield 1942 and Czech Republic-based Illusion Softworks' newly available Mafia, September's turning out to be a banner month for great driving-shooting hybrids from European companies with the word ~illusion~ in their name. Arriving without much prerelease hype, Mafia is a highly engaging combination of the driving and living-city elements of Grand Theft Auto III and the story-driven third-person shooting action of Max Payne. What's more, it isn't plagued by the litany of problems usually associated with ambitious games from small development houses. Mafia looks and sounds great, it's exciting, it's suitably bug-free, and, at a time when eight hours is becoming the standard length for single-player shooters, it's long. Quite simply, Mafia is one of the best games of the year. As implied by the first paragraph of this review, comparisons between Mafia and the famous Grand Theft Auto III are inevitable. Both games take place in detailed and sprawling clockwork cities, both games involve stealing cars and avoiding the police, and both games have plots in which you navigate a criminal underworld. The comparison breaks down when the details and structure of the games' gameplay are considered, however. In much the same way that Grand Theft Auto III includes an almost-complete version of Crazy Taxi as a minigame, Mafia can be considered a generally linear third-person shooter that features a miniature version of Grand Theft Auto III. Mafia's living city, a 1930s metropolis called Lost Heaven, is almost as fully realized as Grand Theft Auto III's Liberty City. Lost Heaven's bigger, in fact, and it features plenty of vehicular and pedestrian traffic, lots of different neighborhoods, working lift bridges, a train system, and even some outlying country areas. It lacks only Liberty City's dynamic day-night cycle and weather patterns--each mission takes place at a particular time and in specific weather conditions. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Mafia Video Review Most of Mafia's 20 large missions are split into sections. You'll usually watch one of the game's long but well-done in-engine cutscenes, get assigned a few weapons, choose a car, and then drive through the city to a given destination. At this point, a separate level--generally a third-person action sequence--is loaded. After you complete the level, you'll usually drive home. Some missions mix the structure up a little, and some offer an optional bonus task on the drive home. The most serious complaint that can be made about Mafia is that the city isn't as tightly integrated into the missions as it is in Grand Theft Auto III. Often, driving across the city is more of a mood-enhancing interactive cutscene than a gameplay element that poses an actual challenge. This is fine in the beginning, but by the time you've reached the halfway point, you may find yourself wishing that you could simply fast-forward through these parts. You're often free to deviate from the quickest path to your destination and go exploring, but unlike in Grand Theft Auto III, there's little reason to do so. There are no bonuses to find, and, while you can run people around in a taxi for money, this option is available only in a mode that's completely detached from the single-player campaign and must be accessed separately from the main menu. Mafia's realistic car physics and police behavior both add to the occasional tedium of the straightforward driving segments. For the most part, the game's 60 or so 1930s-era vehicles aren't rocket cars. They don't often go very fast, they don't always start the first time you turn the key, and they have some serious problems climbing steep hills. You won't be making 300-foot barrel-roll jumps in any of them. Furthermore, the Lost Heaven PD will see to it that you don't even drive as fast as the cars will go. They'll pull you over for driving over 40 and running red lights, among other things. Even if you're in a really cool-looking old-time car, a simulation of driving the speed limit isn't exactly a recipe for thrills. Fortunately, the biggest part of the aggravation that will eventually be caused by the puttering-around-town driving segments will be your impatience to get to the next action portion of a given mission, which are uniformly amazing. Mafia offers one incredible action set piece after another. Some involve straightforward shootouts in enclosed areas, and some take place in huge compounds composed of outdoor areas, multiple buildings, and drivable vehicles. Most involve multiple paths to your goal. The developers have even managed to pull off some decent sneaking levels, though blasting your way through them is also always an option. Occasionally, you'll even have computer-controlled companions with you. For example, one level that takes place in a parking garage begins with a battle between six or seven of your guys and as many members of an opposing mob. Enemies will use cars for cover, and one tactical option is to aim for the vehicle and blow it up, taking nearby mobsters with it. Even better, you can break into and drive any of the parked cars and use them as mobile shields or battering rams. The whole battle is a truly exciting mixture of cat-and-mouse tactics, reckless charges, flying bullets, and exploding cars. To describe other missions would simply ruin the surprise of them. Thanks to its consistently memorable and ingeniously staged action scenes, Mafia never devolves into a long series of indistinguishable firefights. The game is packed with great little details. In what might be a first for a shooter, reloading a gun means losing any bullets left in the current clip. Enemies also need to pause to reload and have a limited supply of ammo, and once they're out, they'll usually charge you with knives. Since you're given only one or two weapons and a limited supply of ammo at the beginning of any mission, and since you can loot dead bodies for their equipment, you'll often have to decide whether to stay hidden and hope an enemy runs out of ammo before he kills you, or risk attacking him in order to grab his supplies before he wastes them. Also, cars sustain damage in incredibly satisfying ways. You can smash out individual windows, blow out individual tires, break off headlights and bumpers, and even shoot holes in gas tanks, causing the fuel to begin draining out. You can also target a car's occupants, who'll expire in classic gangster death poses such as ~slumped over the steering wheel~ or ~clutching a tommy gun while hanging out a rear window.~ The graphics are generally top-notch. The cars look fabulous, and they're especially notable for the way they authentically re-create the curviness of the era's vehicle design. The texture work in the city segments is occasionally a little muddy, though, and there's some pop-up on the horizon that's especially evident when you're going over bridges. The action levels, on the other hand, contain some really beautiful lighting and texture work, and the game's cutscenes feature some of the most detailed and expressive face models ever created for a computer game. The sound is equally excellent. The period soundtrack, composed mostly of cuts by swingy jazz legend Django Reinhardt, with extra tracks by artists such as Louis Prima and the Mills Brothers, matches the game's theme perfectly and also acts as a brilliant alternative to the generic techno and orchestral music used in most games. It should be noted that the developers have opted to rely on the widely unpopular limited save system. There are a few instances where this choice leads to some frustration, but for the most part the save points are both ample and intelligently placed. The 20 missions include more than 100 automatic save points. Once you finish the single-player campaign, which should take anywhere from 10 to 15 hours, an extra mode called ~freeride extreme~ becomes available. This mode lets you drive around Lost Heaven without any police interference while uncovering 19 wild driving challenges. Completing each one unlocks a special vehicle. The first task involves chasing down a man in his underwear who can run 50 miles an hour and has flaming feet, for which you're rewarded with a psychedelic hippie mobile. The missions get weirder from there and will occupy at least another five to 10 hours of your time, if not more. Someday, some developer will successfully integrate the nonlinear portions of Grand Theft Auto III and the incredible action sequences of Mafia. Until that time, you can consider the two games halves of an eventual whole. Separate, but equally amazing."}