{"ref": "https://www.gamespot.com/reviews/gallop-racer-2003-a-new-breed-review/1900-6024827/", "date": "April 9, 2003", "game_name": "Gallop Racer 2003: A New Breed", "text": "After a yearlong hiatus, Tecmo has brought its horse racing simulation series back to the PlayStation 2. Gallop Racer 2003: A New Breed makes some adjustments to the formula found in Gallop Racer 2001, streamlining the gameplay modes and adding some features to make the game accessible to more than just the hard-core horse racing enthusiasts. For all that's different, though, Gallop Racer 2003 is still largely the same game, and for the most part, it continues to appeal to the same core audience it always has. Gallop Racer 2003 continues to appeal to the same folks it always has and not much more. When you first start up the game, you're put through a tutorial explaining the mechanics behind the actual horse racing. For players who haven't been entrenched in Tecmo's particular brand of simulated horse racing since it appeared on the PlayStation, this is a nice touch that makes the rather arcane racing portions of the game much less bewildering. The tutorial breaks the race down into start, middle, and finish. Your performance out of the gate at the start of the race is determined by a timing-based meter where an arrow swings between ~good~ and ~bad.~ Obviously, the closer you are to ~good~, the faster you'll come out of the gate. During the middle section, as the tutorial explains, it's vital to find a position in the pack that best suits your horse, as each horse has different abilities and preferences. Running your horse out of its desired position or running it too fast or too slow will drain your horse's stamina, which is vital for the all-important finish. Basically, everything can change during the final stretch of a race. The key to raising or maintaining your track position down the final furlongs is in proper use of the whip. The tutorial doesn't get terribly specific about using the whip, other than mentioning that you shouldn't use the whip before the last four furlongs of the race, and if you continue whipping your horse after its ~guts~ meter has been tapped, your horse's speed will drop dramatically. The gameplay in Gallop Racer 2003 is not action oriented at all, instead relying almost entirely on strategy and a strong understanding of your horse's strengths and weaknesses. Not to put too fine a point on it, but Gallop Racer 2003 is not terribly kind to newcomers, and unless you're coming in with an existing passion for the ponies, the payoff isn't really worth it. Though the gameplay tutorial is a welcome addition, once you've gone through it the game just dumps you to a menu screen, with no explanation as to how you're supposed to start your first race. Getting to a position where you can actually participate in a race requires you to navigate a series of counterintuitive menus. First, you'll need to buy a horse, but since you're a jockey without any cash, all of the horses initially presented to you are way out of your league. Instead of just showing you which horses you can get for free, you'll have to scroll past pages and pages of higher-ranked horses. Once you've built up your stable, you can start scheduling races, though again, this requires more needlessly convoluted menu navigation. Winning races nets you both points and cash--points can be used to purchase new horses for your stable, and cash can be used to bet on the races. Unlike in Gallop Racer 2001, you can actually wager on races you're competing in, though the game sidesteps the seedy underbelly of professional horse racing by only allowing you to bet on your own horse. Additionally, the more extensive betting system found in Gallop Racer 2001 has been stripped out entirely, which may be a disappointment to long-standing fans of the series. The breeding aspect of Gallop Racer remains largely the same, allowing you to combine two horses to create a new horse that shares many of its parents' abilities. Unless you're coming in with an existing passion for the ponies, the payoff isn't really worth it. Visually, Gallop Racer 2003 makes no effort to improve upon its predecessor. The horses still look pretty good--aiming for a realistic look and more or less accomplishing it. The animations of the horses, however, have started looking a bit mechanical, and the abrupt changes between animations are even more noticeable. The rest of the game looks pretty bland and nondescript, with the size and shape of the grandstands being the only meaningful difference between the tracks. The sound design for Gallop Racer 2003 has undergone a bit of an overhaul, and for the better. The previously overenthusiastic commentator has been reined in significantly, and though the soundtrack is still essentially a collection of synthesized Japanese lounge music, it seems a bit catchier this time around. Though Gallop Racer 2003 does make some halfhearted attempts to make simulated horse racing more appealing to a broader audience, it's just not enough. A more well-designed interface, a less punishing learning curve, an independent and more robust betting system, and a more action-oriented gameplay system would all go far in bringing new players into the fold, but as it stands, Gallop Racer 2003 is mostly just more of the same for its niche audience."}