{"ref": "https://www.gamespot.com/reviews/tower-bloxx-deluxe-review/1900-6238106/", "date": "October 26, 2009", "game_name": "Tower Bloxx Deluxe", "text": "Tower Bloxx Deluxe is a quick and simple puzzle game that's entertaining if you play it in small chunks. Unfortunately, while simplicity is undoubtedly one of the game's strengths, the shortcomings of its original Flash design are all too evident. Colorful 3D visuals and a new mode in which you must position towers in a city before building them make this a better game than the original, but it doesn't compare as favorably with other Live Arcade games. Moving the new tenants' furniture in should be interesting. The core action is a simple one-button process that makes Tower Bloxx easy to pick up and play. Pressing A drops a building block that's swinging from a crane down onto the game screen, and your ultimate goal is to build a tower as tall as possible. Keeping all of the blocks in perfect alignment as you build unlocks score multipliers, but the higher your tower gets, the more it sways in the wind, so timing is crucial in getting your blocks to land correctly. If you drop a block and miss the tower completely, then you lose one of your three lives. In Quick Game you simply need to last as long as possible without losing all of your lives, thus maximizing your score in the process. To some degree this is quite compelling because the game does a good job of showing your friends' scores after each round. There is even an achievement for overtaking three of your friends on the leaderboards. However, it won't maintain most players' long-term interest, though thankfully there is a much more substantial Build City mode to play with. Build City is clearly inspired by SimCity in its design. You play as an architect asked by a struggling town to better its image and increase the population. You must choose which areas of the city to build in and then use the game's core mechanics to build new and better architecture. The more precise your buildings are and the more multipliers you earn when building, the more people will come to the city. When the population reaches certain milestones, more areas of the city open up and new types of building can be created. It's a surprisingly well-paced game mode thanks to well-spaced-out checkpoints designed to inspire you to keep plugging away. Unfortunately, the management mechanics are underused, so you spend far more time in the normal building gameplay than you do choosing where and when to build. Though it is an entertaining diversion, Build City mode ends up feeling like window dressing for the limited puzzle mechanic. Having a second player to tidy up your sloppy work makes the game easier. Other modes do a much better job of applying the building mechanics to different scenarios. For example, in Time Attack, a clock counts down and time is extended when your tower reaches a certain height or when you drop a block in perfect alignment with the rest of the tower. This mode can be played with up to four players, but only offline. There is also Battle mode, where two or more players race to reach a certain height first, as well as Co-Op mode, where a second player can nudge loose tower blocks back into place to prevent a collapse. Of the multiplayer modes, Co-Op is the most enjoyable, but it's a huge shame that you can only play multiplayer modes locally. Tower Bloxx Deluxe's stylized backgrounds and buildings are pleasing to the eye, and while you never get to interact with him or her, it's neat that your Xbox Live avatar appears onscreen during gameplay. The music and sound effects fit the overall presentation well but don't stretch above the standards set by other puzzle games on the platform. With a price point of 800 MSP, it's difficult to recommend Tower Bloxx Deluxe unconditionally. However, if you have young gamers in your household, or someone who is getting into games for the first time, they might find it interesting as a first foray into puzzle gameplay. The core building game can be enjoyable, particularly if you have a few friends to compete with on the leaderboards or someone to play the offline Co-Op mode with. But there just isn't enough gameplay variety or content to justify the price tag. Tower Bloxx worked as a Flash game and a mobile game, but on Live Arcade the competition is much stronger."}