{"ref": "https://www.gamespot.com/reviews/mx-vs-atv-reflex-review/1900-6242336/", "date": "December 7, 2009", "game_name": "MX vs. ATV Reflex", "text": "The MX vs. ATV series seems to not only represent the battle between motocross bikes and all terrain vehicles, but also the differences between arcade and simulation racing. The newest entry, Reflex, attempts to combine the best of both worlds: outlandish tricks and environments with finely tuned control. The result is a thrilling, yet flawed racing game. It features intuitive controls and a ton of content, but it's only worth checking out if you're a racing fan with patience. Despite the name of the game, youll be driving more than just bikes and quads in Reflex. You'll also steer UTVs, buggies, and sport trucks through the game's large collection of races and events. The different vehicles make for a considerably different experience, depending on what you're driving and how you have it customized. The options are nice, but the improvements made to the series aren't as apparent in the larger vehicles. Those improvements include track deformation and rider control. Cosmetically, the deformation is convincing--your tires dig into the terrain and the dirt they kick up actually piles up into new mounds--but it doesn't alter gameplay too much, especially if you're in a larger vehicle. The bikes and ATVs can get tripped up in muddy lines, but deformation rarely causes wrecks. Still, it's a welcome addition that inches the series closer to its competitors and makes for a more realistic racing experience. The other new addition--the dual-stick rider control--adds a layer of strategy to the series. You control your vehicle with the left stick and your rider with the right stick. You can lean into turns, lean back to preload for a jump, or lean forward to climb hills or right your bike in mid-air. You also use the stick to execute tricks by flicking it in different directions while in the air. The system is intuitive and satisfying once you get the hang of it, and it also addresses a problem that plagued the last game: constant wipeouts. When you land a little wonky from a jump, a green arrow will flash on the screen; if you press the direction quickly, your rider regains his balance. You'll likely end up playing this racer in the same way you'd play a first-person shooter--both thumbs on the sticks making constant, quick adjustments. It might feel a little weird at first and requires a greater level of attention because you have to keep your eyes on the terrain, as well as your rider, but it's a rewarding system when everything works correctly. Unfortunately, things don't always work correctly in MX vs. ATV Reflex. Kinks in the physics system can lead to some unpredictable, chaotic rides. There are times when everything syncs up so that you're rhythmically soaring over muddy ramps, as well as leaning into turns like a true MX pro, which is both satisfying and fun. Then, you'll hit a random little bump or piece of scenery and your hefty vehicle will tumble around the track like a tissue box down a flight of stairs. This inconsistency can be intensely frustrating, especially when it happens at the end of a close race. The sharp controls help a bit, but even after you master them, you'll still have to battle an occasional violent gravitational oddity. A new deformation system makes this track bumpier the second time around. Some of the game's courses are more treacherous than others when it comes to physics freak-outs. The outdoor waypoint races, in which you race through the open wilderness to reach checkpoints before your opponents, are the worst thanks to some dangerously uneven terrain and road hazards. At times, you'll feel like you're barely in control as your vehicle ricochets off trees, logs, and other drivers. Other courses, like the guided organic tracks through the mountains or the more traditional dirt tracks, are easier to handle and, consequently, more fun to play. Those courses feature smart designs with challenging elevation changes, as well as surprising twists and turns. Even without a minimap, you'll rarely get lost on the large, lengthy tracks. You've got a bevy of racing options to keep you busy throughout the lengthy career. These include elimination races, time trials, trick competitions, a free ride mode that lets you cruise around an open environment to take on different location-based goals, and more. The variety of events and vehicles keeps the racing fresh, even when some environments are reused. The freestyle trick events have improved since the last game, thanks to the intuitive trick controls, but the judging needs work. Instead of just assigning a score based on your tricks, you're judged across four categories: difficulty, execution, flow, and variety. It's a novel system that takes a holistic approach to judging your performance, but like the physics, it's inconsistent. Sometimes you'll pull off an unbelievable stunt and your score won't budge. At other times, you'll land two out of 10 tricks and ride away in first place. It's a good thing there are a ton of other events available because this one needs some more tweaking. You can compete in all of the events online with up to 12 people or three others with split-screen multiplayer. The multiplayer-only minigames--Snake and Tag--seem to be getting the most play time. Snake is a Tron-like game that has you trying to box in your competitors with a colored stream, while Tag is a game of keep-away where the person to reach the end of his allotted ~it~ time, which runs down while in possession of a weird-looking giant flaming head, wins. Both games can be a blast to play when a dozen players are frantically ramping up and down the environment trying to outrun and outdrive each other. Reflex is not a particularly good looking game on either system, with blurry, low-res textures that are distracting in the open world tracks. The track deformation is a pretty addition, but there are better looking alternatives, especially for the Playstation 3, where the game looks considerably worse. The textures are grainier, and they tend to get drawn in slower, sometimes right under your wheels, and background objects like trees and fans often pop in just as you pass them. The PS3 version also suffers from a spotty frame rate. It's a bummer to crest over a huge jump only to see blotchy scenery stutter into view below you. Load times are also longer on the PS3 version. It's not bad before race events since the game lets you drive around an arena and practice some tricks while it loads, but they'll slow you down in the menus when you're trying to customize a vehicle. The one positive standout is the rider animation, which reacts fluidly and realistically to your commands. PlayStation 3 owners get the short end of the visual stick. The sound doesn't offer much variety. The engine sounds differ between vehicles, but not between models, so when you're close to other racers using the same vehicles, it just sounds like one deafening engine roar. The musical set list is filled with hard rock and screaming vocals. If that's not your favorite genre, you might want to plug in some of your own tunes. MX vs. ATV Reflex takes the series two steps forward and one step back. The new controls, terrain deformation, and plethora of events make it a fun, often-exciting racer. But the squirrely physics sometimes throw water on the fire, leaving you frustrated and annoyed. If you can put up with the occasional gravity hiccup, though, there's a ton of quality MX and ATV action available here."}