{"ref": "https://www.gamespot.com/reviews/mind-zero-review/1900-6415784/", "date": "June 5, 2014", "game_name": "Mind Zero", "text": "There's a notorious production company called The Asylum. It's not involved with gaming (at least, not yet), but you might know the company as the folks behind such films as Transmorphers, The Day the Earth Stopped, Atlantic Rim, and Android Cop. Its modus operandi is making half-baked films--mockbusters--that clearly want to ride on the themes and popularity of much more visible properties, while trying to remain different enough that they aren't completely wholesale rip-offs of a source.Why do I mention this? Because Mind Zero feels like The Asylum's version of the Persona series. The similarity of the setting, story concepts, and overall design is undeniable. And like the inept mockbuster trying desperately to re-create the spectacle of its bigger inspiration, Mind Zero fails at anything beyond being occasionally mediocre.The premise behind Mind Zero sounds familiar: in modern-day Saitama, Japan, mysterious happenings are afoot, with random people going on violent rampages due to a force called MIND. While the police are investigating these freak occurrences, a group of high school kids stumble into a portal to a strange alternate world where they are given weapons and told the secrets of MINDs: they are parallel beings from another world. Some MINDs are leaking out into the world we know and are preying on people with negative emotions, and it's up to a scrappy team of kids (plus a grizzled supernatural detective) to investigate and stop the MINDs from opening doors from their world to ours, all while keeping their special powers a secret from the police.Sound a bit familiar? It might, because it's basically the plot of all of the various Persona games stitched together like some sort of Frankenstein's monster. And much like said creature, Mind Zero's plot trudges along with the speed of molasses for a good chunk of the game. Even in the most cinematic-heavy Japanese role-playing games, there are usually things developing in the story when you're not dungeon-crawling. Mind Zero takes its sweet time just getting past the basic ~MINDs are bad; let's find and fight them~ conceit into something more substantial.But while other RPGs might emphasize interactions between characters to help make up for a weak main plot, Mind Zero gives you a cast of teenagers whose personalities fall into one of two categories: incredibly irritating all the time or about as well defined and interesting as a brick. The lead character, Kei, is so aloof and angsty that he may as well have been a mass-produced unit purchased straight from JRPG Hero Stereotype Industries Inc. It wasn't long after my introduction to him that I was wishing I could have a silent lead this time.Mind Zero's plot trudges along with the speed of molasses for a good chunk of the game.Other characters have one-note traits and are easily summed up in single sentences: ~He won't shut up ever about buying dumb crap,~ ~She's kind of stupid in a way that's supposed to be endearing but isn't,~ ~She has no discernible personality to speak of, but she fights stuff, so she's OK,~ and so on. The game's most interesting characters end up being Ogata, the grizzled detective and sole adult on your team, and the antagonists that emerge later on. The sheer dullness or unlikability of everyone makes the game's attempts to present short vignettes of interaction between characters (akin to Persona's social-link sequences) laughable.The combat and exploration are better than the story, though that's not really saying much. Dungeons are presented as first-person-view mazes, and a map fills out as you explore, making things much easier for you--especially since the dungeons become quite expansive, quite fast. What they never really become, however, is attractive. The visuals for these settings are bland and uninspired (the fact that setting assets are recycled by the third major dungeon is seriously off-putting), and the layout of the mazes is sprawling and confusing, with only a few uninteresting gimmicks to break up the monotony.Combat, however, has a few interesting elements. Up to three characters can participate in combat, and they have three separate meters each: life points, mind points, and technical points. Life points are pretty easy to grasp: lose them all, and the character is out of commission. Mind points determine the health of a character's MIND; these points recover over time unless the MIND is on-field. Finally, technical points are used to activate skills of MINDs. They also recover over the course of combat.These gauges are all very important to keep track of, because they all affect the most crucial element of combat in Mind Zero: the usage of the MINDs, which are summoned with the R trigger. Characters have differing sets of commands depending on whether or not their MINDs are active on the field: defense, item, and escape commands can only be used sans a MIND, while skills are only available with MINDs summoned. MINDs alter other elements as well. Normally, whenever characters are attacked by enemies, they lose LP. However, if their MINDs are active when characters are hit, they lose MP instead of LP, thus rendering MINDs as something of a protective shield. If all MP is lost to attacks, however, characters' MINDs are broken, and the characters are stunned and unable to summon their MINDs again for a few turns. This adds an element of risk to simply putting one's MIND out as a meatshield against enemies.Active MINDs improve standard attack power slightly and give access to skills, which consume TP and sometimes LP when used. The number of skills that can be equipped is determined by a character's level, and skill-granting cards can be equipped, enhanced, and shuffled about from character to character outside of combat. Assembling a solid skill set is crucial to success, though the skills' interchangeability robs characters of individual combat importance, so you'll tend to focus on leveling up a few characters, which may come back to bite you at certain story points. Finally, there's the burst command, which can be used with MINDs turned on or off. Burst allows for a command to be executed instantaneously at a significant TP cost--it's an expensive godsend when emergency healing, absolute escape, or immediate fatal damage on a foe is needed.All of these aspects to fighting seem as if they should be great, and there are boss battles where the combat elements get a chance to shine. The problem comes from the sheer tedium of the regular enemy encounters, and the constant difficulty spikes that accompany them. There's really no such thing as a quick battle in Mind Zero: enemies not only soak up and deal a lot of damage (even on the lowest difficulty), but they also have elemental and anti-MIND affiliations that you must pay attention to.It's one thing for random RPG battles to require you to at least pay attention to not suffer an embarrassing death, but the amount of command shuffling, MIND toggling, and bursting just to kill some cannon-fodder is downright annoying, especially when you just want to explore and get somewhere. Making it all worse is the massive difficulty spike that arrives with each new dungeon; you'll be finishing many fights by the skin of your teeth until you can eke out a couple of extra levels for your crew each time there's a new location introduced. After just a few hours in, you grow to loathe the random encounters (and the irritating music that accompanies them), but at least you'll be thankful for the R button fast-forward feature to make them slightly less of a pain.There are a few high points beyond good combat ideas: the artwork for the MINDs and characters is nice, and the localization gives conversations a natural flow, but the snoozefest of a story and monotonous encounters make playing Mind Zero feel like work. To top it all off, the finale is atrocious, failing to deliver any answers to the questions the story poses (and, in fact, creating new ones), all while suggesting a follow-up that may or may not ever happen. After the utterly laborious process of completing the game, the unsatisfying finale is a slap in the face. But hey, at least you get a post-game dungeon to slog through!The Vita isn't hurting for JRPGs, but even if you've already played and finished Demon Gaze, Ys: Memories of Celceta, and Persona 4 Golden, it's best to skip Mind Zero. Like The Asylum's film oeuvre, Mind Zero is capable, at times, of at least holding your attention, but it's rarely entertaining, and when you're done, you'll be wondering why you didn't invest your time in a superior alternative instead."}