{"ref": "https://www.gamespot.com/reviews/project-igi-im-going-in-review/1900-2668524/", "date": "December 22, 2000", "game_name": "Project IGI: I'm Going In", "text": "The awkwardly named Project IGI: I'm Going In follows in the trend of the Rainbow Six series, the Delta Force series, and SWAT 3. It eschews the outlandish futuristic weapons and imaginary settings of many traditional shooters and focuses instead on contemporary realism. In the game, you play as David Llewelyn Jones, a former Special Air Service member who now works as a freelance operative for both the British and American governments. The game features a blend of stealth, covert surveillance, and high-powered firefights at secret military bases, and it has much of the thrill and daring of the James Bond films of the late Cold War era. But it also has several significant shortcomings. In Project IGI, your mission is to help retrieve a stolen nuclear warhead and prevent an act of nuclear terrorism. The action begins in the former Soviet Union, and your first goal is to rescue a contact who has vital information about the nuke and who is being held and tortured at a military airfield in Estonia. The narrative is primarily told through in-engine cutscenes at the beginning or end of each mission, and they're visually stylish - their dramatic camera angles and lighting effects approach film quality at times, though the flat dialogue can be a bit tedious and the cast of characters isn't very interesting. The tone of the missions tends to be realistic: While you're a skilled agent, you're just one man - not a one-man army. As such, you'll need to do a lot of creeping through the shadows, sneaking around security cameras, hacking computers to deactivate surveillance systems, and using binoculars to scout the area. When you run into the inevitable confrontation with guards, fast and furious firefights ensue. The game's general emphasis on realism means you'll need quick reflexes: Even if he's wearing body armor, a few shots can still put a painful end to the hero's career. You can restore health only by grabbing a medical kit from an infirmary - if there even is one in the area. Project IGI is a strictly single-player game with 14 missions that are often large and complex, but they're divided into smaller, more manageable objectives. Unfortunately, there's no way to save your game during a mission, and even on the lowest difficulty setting, some missions can be quite hard, and they will inevitably require you to restart from scratch a number of times before you achieve success. Since you'll typically be infiltrating military installations, you'll run into swarms of guards, many of whom stand waiting in towers with their sniper rifles. Death awaits at every corner. The abundance of guards is necessary because the game's enemy artificial intelligence is spotty if not downright poor, as enemies sometimes stand obliviously when you kill one of their comrades, who is only a few feet in front of them. Also, the game sometimes cheats by making guards appear out of thin air or from buildings that you've already cleared. During missions, you'll have access to a large arsenal of weapons, some of which you're equipped with at the start of the missions, and many of which you pick up from dead guards. They run the gamut from a combat knife for silent kills to antitank weapons for the occasional armored fighting vehicle. Other real-world weapons in the game include the Glock 17, Desert Eagle, MP5, M16 A2, Minimi, Spas 12, Uzi, Pancor Jackhammer automatic shotgun, Dragunov sniper rifle, and others, along with flashbang and fragmentation grenades. Weapon physics are generally believable: Automatic weapons have a noticeable kick that hinders your aim, and bullets will penetrate walls and doors of varying material and thickness depending on the caliber or muzzle velocity of the gun. Since much of the game is about stealth and careful observation, you'll get to use some clever gadgets in addition to your weapons. Your binoculars have night vision and a digital compass, and they smoothly zoom out to very long ranges. You also have a PDA that lists your mission objectives and visually keys them with numbers to a live satellite video reconnaissance feed. You can zoom and pan the readout, and since it's shown in real time, you can actually watch guards advance and attack you if you neglect to turn off the PDA map at an inopportune time. The PDA also logs your communications, which include both status reports and tips from Anya, your advisor back at headquarters who's watching your progress. Frequently, reports from Anya, including those that advance the game's plot, appear when you're busy avoiding or fighting guards, so the ability to read them later on your PDA helps make up for that flaw.Another flaw in the game is the way you manipulate or interact with certain objects. When you stand next to an object you can use, you'll see an icon light up at the bottom of the screen. During time-consuming actions like hacking a computer or climbing a ladder, the game switches from first- to third-person view, which can seem awkward initially. However, this lets you retain situational awareness during these times since you can pan the camera in all directions with the mouse. You do need to precisely line yourself up with an object to manipulate it in the first place, which can result in your death if you need to make a quick escape. Despite the odd perspective switching, the graphics overall are very good. Textures are highly detailed (albeit dully colored), varied ambient lighting depicts different times of day and atmospheric conditions vividly, and weapon models and skins are convincing. Weapons interact visually with the environment too, and they will shatter glass and leave bullet holes in walls for the duration of a mission. When you fire at wood or other light materials, shards and splinters fly. Some of the weapon effects are also quite graphic: You'll see blood spatter on walls during close-quarters firefights, and sometimes even pieces of cranium fly when you snipe someone in the head. Oddly, the bodies of dead guards simply vanish after a few seconds. Some of the effects are less gruesome but still memorable, such as the occasional static on your PDA as you watch the live satellite imagery and the dynamic displays on your binoculars. The vast outdoor environments really steal the show in Project IGI. Some design concepts for the proprietary 3D engine came from Innerloop's flight simulator, Joint Strike Fighter - and it shows. Early in the game, you'll infiltrate a military airbase with a seemingly endless runway, a geodesic radar dome, huge hangars with parked fighter jets, troop barracks, and so on, all of which are surrounded by realistically scaled and subtly textured hills and mountains. This huge visual scope is really immersive and memorable, especially since the outdoor terrain is so well textured. By contrast, the indoor environments in the game tend to be repetitive and forgettable. Also, because of the huge areas, you'll have to do lots of laborious running. The sound compares favorably with the graphics - it is sometimes even better. The musical score, while hardly outstanding, is nevertheless well crafted, and its tense mood complements the action of the game well. Voiceovers are competent but bland, and Russian or Estonian guards will shout at you in English instead of their native tongues. The sound effects suffer none of the weaknesses of the dialogue; in fact, they're often spectacular. Each weapon has a convincing and vivid set of sounds, and explosions are suitably loud. Footsteps alter according to the surface on which you're walking and whether or not you're running or padding softly. The environmental sounds are superb - gates grind, motors hum, security cameras beep, and elevators chime as they reach a new floor. Intermittent thunder will boom during a rainstorm, and depending on what type of roof you're under, the rain alters from muffled tapping on wood to loud drumming on a sheet metal overhang. The sound is especially well done during cutscenes - for instance, helicopter rotors nearly drown out characters' radio communications, and you can hear details like the canopy lowering on a Russian fighter as you make off with it. While none of the individual elements of Project IGI are particularly original, they're meshed together very well. The missions feature a finely paced balance between tense stealth and dramatic combat. By mixing military firefights with careful sneaking, the game manages to be entertaining overall, and the environments are very convincing. Still, the game has problems that can't be overlooked, such as the lack of midmission saves, the weak artificial intelligence, and a general lack of interesting or memorable characters, including the one you play. Also, while you can approach each mission slightly differently, there's only so much variety that each affords, and there are no multiplayer modes or level editor. So, despite the long and complex missions, the game's replay value is really limited. Still, as a single-player shooter with a traditional progressive mission structure set in realistic and memorable environments, Project IGI is a fun, if flawed, action game.Another flaw in the game is the way you manipulate or interact with certain objects. When you stand next to an object you can use, you'll see an icon light up at the bottom of the screen. During time-consuming actions like hacking a computer or climbing a ladder, the game switches from first- to third-person view, which can seem awkward initially. However, this lets you retain situational awareness during these times since you can pan the camera in all directions with the mouse. You do need to precisely line yourself up with an object to manipulate it in the first place, which can result in your death if you need to make a quick escape. Despite the odd perspective switching, the graphics overall are very good. Textures are highly detailed (albeit dully colored), varied ambient lighting depicts different times of day and atmospheric conditions vividly, and weapon models and skins are convincing. Weapons interact visually with the environment too, and they will shatter glass and leave bullet holes in walls for the duration of a mission. When you fire at wood or other light materials, shards and splinters fly. Some of the weapon effects are also quite graphic: You'll see blood spatter on walls during close-quarters firefights, and sometimes even pieces of cranium fly when you snipe someone in the head. Oddly, the bodies of dead guards simply vanish after a few seconds. Some of the effects are less gruesome but still memorable, such as the occasional static on your PDA as you watch the live satellite imagery and the dynamic displays on your binoculars. The vast outdoor environments really steal the show in Project IGI. Some design concepts for the proprietary 3D engine came from Innerloop's flight simulator, Joint Strike Fighter - and it shows. Early in the game, you'll infiltrate a military airbase with a seemingly endless runway, a geodesic radar dome, huge hangars with parked fighter jets, troop barracks, and so on, all of which are surrounded by realistically scaled and subtly textured hills and mountains. This huge visual scope is really immersive and memorable, especially since the outdoor terrain is so well textured. By contrast, the indoor environments in the game tend to be repetitive and forgettable. Also, because of the huge areas, you'll have to do lots of laborious running. The sound compares favorably with the graphics - it is sometimes even better. The musical score, while hardly outstanding, is nevertheless well crafted, and its tense mood complements the action of the game well. Voiceovers are competent but bland, and Russian or Estonian guards will shout at you in English instead of their native tongues. The sound effects suffer none of the weaknesses of the dialogue; in fact, they're often spectacular. Each weapon has a convincing and vivid set of sounds, and explosions are suitably loud. Footsteps alter according to the surface on which you're walking and whether or not you're running or padding softly. The environmental sounds are superb - gates grind, motors hum, security cameras beep, and elevators chime as they reach a new floor. Intermittent thunder will boom during a rainstorm, and depending on what type of roof you're under, the rain alters from muffled tapping on wood to loud drumming on a sheet metal overhang. The sound is especially well done during cutscenes - for instance, helicopter rotors nearly drown out characters' radio communications, and you can hear details like the canopy lowering on a Russian fighter as you make off with it. While none of the individual elements of Project IGI are particularly original, they're meshed together very well. The missions feature a finely paced balance between tense stealth and dramatic combat. By mixing military firefights with careful sneaking, the game manages to be entertaining overall, and the environments are very convincing. Still, the game has problems that can't be overlooked, such as the lack of midmission saves, the weak artificial intelligence, and a general lack of interesting or memorable characters, including the one you play. Also, while you can approach each mission slightly differently, there's only so much variety that each affords, and there are no multiplayer modes or level editor. So, despite the long and complex missions, the game's replay value is really limited. Still, as a single-player shooter with a traditional progressive mission structure set in realistic and memorable environments, Project IGI is a fun, if flawed, action game."}