{"ref": "https://www.gamespot.com/reviews/nba-live-06-review/1900-6135481/", "date": "October 11, 2005", "game_name": "NBA Live 06", "text": "NBA Live 06 isn't the first EA basketball game to hit the small screen on the Sony PSP. The publisher released NBA Street Showdown earlier this year. This recent release of Live 06 marks the first appearance of the venerable franchise on a portable platform since Live 96 on the Game Boy. The result is a game that, for better or for worse, looks and plays remarkably similar to its home console cousins, even going so far as to include the new freestyle superstar control features. If you're familiar with the NBA Live games on the console, the PSP version will have you feeling right at home. The first thing you'll notice about NBA Live 06 is its great overall presentation value. Attractive menus greet you upon startup, and this continues as you load into a game, with high-level stadium views. The default camera angle is a sideline broadcast camera that gives you a great look at the court, taking full advantage of the PSP's wide screen. The player models are detailed and recognizable. If you're familiar with the home-console versions of NBA Live, then you'll probably recognize the players doing a lot of the same animations for moving, passing, shooting, and dunking. Though Live 06 for the PSP doesn't always run at the crispest frame rate, the wide variety of different animations and the detail in the character models makes the game quite pleasing to look at. You may notice some strange bugs in some of the transitional cutscenes, such as at the end of a quarter when players walk back to the bench, but this doesn't detract too much from an attractive overall package. Live 06 doesn't skimp on the sound, either. The broadcast duo of Marv Albert and Steve Kerr call the action in the PSP version of the game. Though they don't have quite as much to say as they did in the console versions, they do get a nice flow going for the most part, except for the odd occasion when the audio doesn't stream fast enough off the UMD. Kerr, in particular, will make lots of specific comments about the star players in the game, talking about Dwyane Wade's time at Marquette or Allen Iverson's ankle-breaking prowess with the crossover dribble. The court sounds and crowd noise also add to the atmosphere, with some stadium announcing and music to round out the soundscape. The menu music comes from EA Pocket Trax, so you can expect a predictable array of hip-hop tunes from the likes of Jurassic 5, M.I.A, and the Black Eyed Peas. The gameplay in Live 06 has a very similar feel to its console cousins. Controlwise, some compromises have been made because of the lack of a right analog stick. You can't do freestyle juke moves. Instead, crossovers and wraparound dribbles can be executed with the square button. This also means that there are no separate shoot and dunk buttons in the PSP version of the game. Both functions are married to the circle button, but the shoot-versus-dunk logic is generally good. You can still execute quite a few different moves, such as adjusting your shot in midair, give-and-go plays, alley oops, and more. Overall, the PSP version maintains that fast-paced, arcade-like feel that has been a signature of the Live series for years. What's interesting is that this game includes the newest control feature for the Live series, freestyle superstar. As in the console version, certain star players have been given special moves--power players like Shaq and Ben Wallace can overpower defenders with strong dunks down low. Scorers like Kobe Bryant or Allen Iverson can unleash a variety of acrobatic moves near the basket to get their shot off in traffic. Playmakers like Steve Nash and Jason Kidd can toss off fancy passes. These are executed by holding down the left trigger button and then tapping or holding one of the face buttons. Two of the superstar classes, defender and sharpshooter, didn't make it into the PSP version of the game. But overall, the superstars who are in the PSP version of Live 06 play and animate much like they do in the console versions. High flyers and power dunkers can easily dominate the game at the lower difficulty levels. Freestyle Superstar is a flashy and nice-looking way to show off some cool animations, but it gives the game less of a sim feel and more of an NBA Street-like feel. Unfortunately, while it's great that Live 06 for the PSP plays very similar to its bigger brothers, a lot of the warts of the console game engine made their way into this game as well. Players still look and feel like they're ice skating over the court. This makes defense a chore; it feels as though the computer can just push you deeper and deeper into the paint, because collisions aren't handled very well. Rebounding is also arguably worse in this version of the game than in the console versions. You'll see a lot of players go up for tip dunks and miss, while players near the ball just don't seem to reach out for it. The result is that a lot of rebounds hit the floor, which just about never happens in the NBA. The offensive team also seems to recover way too quickly off of tipped balls, blocked shots, and near-steals. You might be in perfect defensive position and make a satisfying shot rejection, only to see another offensive player off the ball zoom in with hyperspeed and pick up the garbage before anyone else can react. But again, if you're used to the series on the console, none of these issues will come as a big surprise. NBA Live 06 offers a number of other features aside from playing single exhibition matches. A full-season mode and playoff mode have been included. You can offer and accept trades, sign free agents, play out each game, or sim them with ~intervention~ capability, which means you can jump into a game in progress and play out the last half or quarter to save your team from defeat. All-Star weekend minigames have also been included with the dunk contest, three-point contest, and all-star game. Finally, a special PSP-exclusive mode called Superstar Challenge is included. These are situational challenges based on real-life games from the past NBA season. You might find yourself in control of Dwyane Wade with four minutes left in the fourth quarter of a tight game with the Suns. Your goal would be to score 10 more points with Wade and win the game by as big a margin as possible. Another situation might put you in Steve Nash's shoes as he tries to get two more assists against his old Mavericks team at the end of a close game. Successfully completing the challenges unlocks throwback jerseys for you to use in exhibition mode. The Superstar Challenge makes for a quick, fun minigame that you can complete in just a few minutes; it really helps put the focus even more on the superstars of the game. The included freestyle superstar controls allow prolific scorers like Dirk Nowitzki to get off their shots in high traffic. Live 06 also includes head-to-head multiplayer action, both ad-hoc and over the Internet, through infrastructure mode. If you intend to get online, though, you'll need to go through EA's convoluted account signup process and also agree to get spammed by ESPN or else pay $2 for the privilege of playing online. Once you do get through all that rigamarole, you'll find that there aren't very many people playing online at all. The online lobbies contained anywhere from zero to six other players at the times we tried to play. It was exceedingly difficult to get a clean connection with players, as games would often time out before we could get them started. When we actually were able to start games with others, the experience was decent for the most part, but with noticeable lag on control input. In other words, it was playable, but not crisp. Despite the fact that we didn't get as much mileage out of online multiplayer as we hoped, NBA Live 06 for the PSP offers a good arcade basketball experience. Season mode, all-star weekend, and the superstar challenge should keep basketball fans busy for a while, and longtime fans of the NBA Live series will definitely appreciate that this portable version stays very true to its roots."}