{"ref": "https://www.gamespot.com/reviews/nba-live-06-review/1900-6140286/", "date": "November 22, 2005", "game_name": "NBA Live 06", "text": "NBA Live 06 can be considered, in a lot of ways, the first true next-generation basketball game. The game engine has been rebuilt from scratch, and the game does indeed make a great first impression on high-definition screens, with excellent-looking player models and courts. Unfortunately, that great initial impression fades gradually the more you play. Though NBA Live 06 is still a fun basketball offering that's noticeably slower and more simlike than recent entries in the series, it falls short of its promise. Flaws like poorly blended animations, an erratic frame rate, a horribly flawed free-throw-shooting mechanic, and the lack of a franchise mode combine to keep NBA Live 06 from being the great basketball game it could have been. Player models look fantastic in NBA Live 06. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: NBA Live 06 Video Review When you first look at NBA Live 06 on an HDTV, it truly does look like a next-generation game. After initially loading Live, you're immediately dumped into a practice court, where you can start shooting around and dunking with an NBA player (the game defaults to cover-athlete Dwyane Wade). Pressing start brings up a menu from which you can jump into a game, create a player, fiddle with rosters, or start season mode. If you choose to play a quick match, the game will load while still letting you shoot around the practice gym. Once the game loads, you're treated to a fantastic broadcast-quality introduction, with the camera spinning around the arena from up high and then right in to player introductions. Immediately, you'll notice the high-quality player models. Player faces are spot-on, for the most part, and it's also nice seeing the same amount of care and detail going into the coaches. The skin textures, even if they are a bit shiny, are also the best we've seen in a basketball game, with excellent definition on musculature. The lighting inside the arenas is a bit odd, though. It's most noticeable when you look at a shot of players huddling around their coach, but it almost seems as though the arenas aren't fully lit, as you'll see an excessive amount of shadowing on character models. Sometimes it looks like you're playing an interactive basketball documentary shot through a Hi-8 video camera instead of watching an NBA game broadcast. Just looking at the introductions and the first few possessions on the floor, NBA Live 06 would easily be pronounced the best-looking basketball game ever. But once you play the game for a while, the biggest weakness in the visuals begins to become more apparent: the animation. Certain animations look great, like players fighting through screens, some of the juke moves, and especially the various dunk animations--which look extremely fluid and are fun to watch. The developer has even cleaned up a lot of the ice skating that we've all grown weary of in the other versions of Live. Where the visuals really fall apart is in the way the animations blend together. Player dribbles and collisions all seem to pop from one to the next. Sometimes you'll see a passed ball fly across the court at an unnatural speed, or players will suddenly stick to (and unstick from) one another. The defensive crouch stance and animation also looks odd, as the players look more like chimps hobbling around with their arms outstretched than they look like pro basketball players trying to stay in front of the ball handler. What's more, the frame rate can be slightly erratic at times, especially when playing at 720p. It's never enough to hinder your gameplay experience, but it's definitely noticeable enough to exacerbate the animation issues. The dunks are also a highlight of the game. If you're unlucky enough to still be playing on a standard-definition television, then NBA Live 06, like many other Xbox 360 launch games, probably won't induce much of a wow factor, either. The detailed character models still look pretty good during replays, but the players in-game look so small and fuzzy that they're tough to distinguish from one another. Worst of all, the font sizes used for the menus and interface were clearly designed with HD in mind, only. You'll have a tough time reading certain menu items in standard definition. This issue is most apparent with the names underneath the players you control, as they're all but unreadable on a standard-definition TV. The actual gameplay should feel very familiar to veterans of NBA Live. The control scheme is lifted right out of NBA Live 05 (not 06, as freestyle superstar controls are not in this game), with separate dunk and shoot buttons, a pro hop button, tip dunks, and, of course, the freestyle control stick. You will notice, however, that the freestyle stick isn't as powerful as in previous games. Since it's not so easy to break down your defender off the dribble, you'll probably feel more inclined to move the ball around with some passes to find an open man. The offensive artificial intelligence seems better here than in previous Live entries, with regard to player spacing, so passing the ball around should be just as viable an option as isolating your best ball handler. You'll also get some fun out of the post game, where you can use fadeaways, drop steps, and spin moves to try to free yourself for an easy score. If that's not enough offensive variety for you, Live 06 also uses a quick play system similar to March Madness' floor-general feature, which lets you quickly call six different plays from your playbook using the D pad. You can also easily adjust offensive and defensive sets at any stoppage of the ball through a quick menu system, as well as bring in bench players or adjust rebounding/fast-breaking tendencies. Unfortunately, the animation doesn't blend well. As far as defense goes, Live 06 on the Xbox 360 feels a lot like previous games in the series. You can easily bring a double-team to the post by just dropping a perimeter defender down to try to tie up the ball. You can use the right analog stick to poke at the ball with either hand, but missing a steal on a lunge can result in an open lane to the basket for your opponent. Your AI teammates do seem somewhat slow to both rotate and close off driving lanes if you let a ball handler into the paint, and the default slider setting seems to call quite a few fouls if you mistime your block attempts on defense. Rebounding still offers some of the same ball-vacuuming flaws as found in previous Live games. You'll see some balls mysteriously end up in the hands of rebounders who are boxed out of position, but the problem isn't too pronounced. We also didn't like the fact that players running the fast break with you don't seem to run hard or fill lanes the way they should. These are all minor quibbles, though, compared to the horrible new free-throw-shooting mechanic. The new mechanic isn't described anywhere in the manual. You have to pull back on the right analog stick, then push forward in a straight line, kind of like swinging a club in Tiger Woods. The problem with this mechanic is that it's hard, and you get absolutely no feedback on why you've missed. You need a surgeon's precision in order to sink a foul shot. The ball will simply clank off the rim, and you don't have much of an idea why. Were you off-center? Did you push too hard? Too slowly? Not a steady enough speed? Who knows? The game certainly doesn't tell you. And the worst part is that there's no practice mode where you can try free throws to figure it out yourself. Expect to shoot about 10 percent or worse from the charity stripe, until you figure out how it works. We never quite did figure it out in our days playing the game. Since the computer tends to foul you a lot in the paint, not being able to hit a realistic number of free throws ends up being a great hindrance to winning. This is an even bigger problem for online play where a cheesy strategy is to just foul your opponent anytime he goes for a dunk. Since it's so hard to hit free throws, getting fouled basically equates to a turnover. Aside from quick games, NBA Live 06 includes a create-a-player feature, season mode, and online play over Xbox Live. No, we didn't forget anything in that list, but you'll wonder if maybe the developer did, as there's no franchise mode in the game. You can trade players and coach your team through the playoffs in season mode, but once the championships are over, so is the season. The lack of a multiyear franchise mode certainly hurts the value of the overall package. You'll also find some other odd missing features, like a fully controllable replay mode. You can toggle instant replays after any basket you score, but these will only show canned replays of the score from two different camera angles. If you want to see a replay of anything, or if you want to move the camera around in replay mode yourself, you're out of luck. As far as online play goes, performance in our online play testing ranged from bearable to unplayable. The smoothest games we experienced still made it difficult to get the timing down on jumpshots, while some of the other games moved at utterly glacial framerates. Hopefully the problem will get better as the online population ramps up and the geographic distribution of players evens out, but as it stands, online play is certainly not a strongsuit for the game. You can play online, but no franchise mode is available. At least the sound is excellent. The crowd realistically gets riled up or quieted down, depending on the performance of the home team. When it gets really excited, the roar is actually quite impressive--especially on a good 5.1 setup. The commentary from Marv Albert and Steve Kerr is also excellent, with a lot of insightful and interesting color comments from Kerr. There's also a decent hip-hop soundtrack from EA Trax, which features the likes of Jurassic Five and M.I.A. to groove to. The best way to sum up NBA Live 06 on the Xbox 360 is that it feels a lot like NBA Live 05 with a fresh coat of paint thrown on. Aside from minor tweaks here and there, not a lot has changed with the basic gameplay, which should feel very familiar to longtime fans of the series. The graphics definitely are a great step up from previous-generation basketball games, especially with the fantastic character models in the game. Unfortunately, NBA Live 06 doesn't look quite as good as it should in motion, thanks to poorly blended animation and a sometimes uneven frame rate. The game also doesn't look very impressive on a standard-definition TV. The lack of a franchise mode further hurts long-term replayability. If you've been a longtime player of NBA Live and want to get a peek at the direction EA is taking the series in, then the game is still worth checking out. But taken as a full product, it falls short of delivering a true next-generation basketball experience. The actual gameplay should feel very familiar to veterans of NBA Live. The control scheme is lifted right out of NBA Live 05 (not 06, as freestyle superstar controls are not in this game), with separate dunk and shoot buttons, a pro hop button, tip dunks, and, of course, the freestyle control stick. You will notice, however, that the freestyle stick isn't as powerful as in previous games. Since it's not so easy to break down your defender off the dribble, you'll probably feel more inclined to move the ball around with some passes to find an open man. The offensive artificial intelligence seems better here than in previous Live entries, with regard to player spacing, so passing the ball around should be just as viable an option as isolating your best ball handler. You'll also get some fun out of the post game, where you can use fadeaways, drop steps, and spin moves to try to free yourself for an easy score. If that's not enough offensive variety for you, Live 06 also uses a quick play system similar to March Madness' floor-general feature, which lets you quickly call six different plays from your playbook using the D pad. You can also easily adjust offensive and defensive sets at any stoppage of the ball through a quick menu system, as well as bring in bench players or adjust rebounding/fast-breaking tendencies. Unfortunately, the animation doesn't blend well. As far as defense goes, Live 06 on the Xbox 360 feels a lot like previous games in the series. You can easily bring a double-team to the post by just dropping a perimeter defender down to try to tie up the ball. You can use the right analog stick to poke at the ball with either hand, but missing a steal on a lunge can result in an open lane to the basket for your opponent. Your AI teammates do seem somewhat slow to both rotate and close off driving lanes if you let a ball handler into the paint, and the default slider setting seems to call quite a few fouls if you mistime your block attempts on defense. Rebounding still offers some of the same ball-vacuuming flaws as found in previous Live games. You'll see some balls mysteriously end up in the hands of rebounders who are boxed out of position, but the problem isn't too pronounced. We also didn't like the fact that players running the fast break with you don't seem to run hard or fill lanes the way they should. These are all minor quibbles, though, compared to the horrible new free-throw-shooting mechanic. The new mechanic isn't described anywhere in the manual. You have to pull back on the right analog stick, then push forward in a straight line, kind of like swinging a club in Tiger Woods. The problem with this mechanic is that it's hard, and you get absolutely no feedback on why you've missed. You need a surgeon's precision in order to sink a foul shot. The ball will simply clank off the rim, and you don't have much of an idea why. Were you off-center? Did you push too hard? Too slowly? Not a steady enough speed? Who knows? The game certainly doesn't tell you. And the worst part is that there's no practice mode where you can try free throws to figure it out yourself. Expect to shoot about 10 percent or worse from the charity stripe, until you figure out how it works. We never quite did figure it out in our days playing the game. Since the computer tends to foul you a lot in the paint, not being able to hit a realistic number of free throws ends up being a great hindrance to winning. This is an even bigger problem for online play where a cheesy strategy is to just foul your opponent anytime he goes for a dunk. Since it's so hard to hit free throws, getting fouled basically equates to a turnover. Aside from quick games, NBA Live 06 includes a create-a-player feature, season mode, and online play over Xbox Live. No, we didn't forget anything in that list, but you'll wonder if maybe the developer did, as there's no franchise mode in the game. You can trade players and coach your team through the playoffs in season mode, but once the championships are over, so is the season. The lack of a multiyear franchise mode certainly hurts the value of the overall package. You'll also find some other odd missing features, like a fully controllable replay mode. You can toggle instant replays after any basket you score, but these will only show canned replays of the score from two different camera angles. If you want to see a replay of anything, or if you want to move the camera around in replay mode yourself, you're out of luck. As far as online play goes, performance in our online play testing ranged from bearable to unplayable. The smoothest games we experienced still made it difficult to get the timing down on jumpshots, while some of the other games moved at utterly glacial framerates. Hopefully the problem will get better as the online population ramps up and the geographic distribution of players evens out, but as it stands, online play is certainly not a strongsuit for the game. You can play online, but no franchise mode is available. At least the sound is excellent. The crowd realistically gets riled up or quieted down, depending on the performance of the home team. When it gets really excited, the roar is actually quite impressive--especially on a good 5.1 setup. The commentary from Marv Albert and Steve Kerr is also excellent, with a lot of insightful and interesting color comments from Kerr. There's also a decent hip-hop soundtrack from EA Trax, which features the likes of Jurassic Five and M.I.A. to groove to. The best way to sum up NBA Live 06 on the Xbox 360 is that it feels a lot like NBA Live 05 with a fresh coat of paint thrown on. Aside from minor tweaks here and there, not a lot has changed with the basic gameplay, which should feel very familiar to longtime fans of the series. The graphics definitely are a great step up from previous-generation basketball games, especially with the fantastic character models in the game. Unfortunately, NBA Live 06 doesn't look quite as good as it should in motion, thanks to poorly blended animation and a sometimes uneven frame rate. The game also doesn't look very impressive on a standard-definition TV. The lack of a franchise mode further hurts long-term replayability. If you've been a longtime player of NBA Live and want to get a peek at the direction EA is taking the series in, then the game is still worth checking out. But taken as a full product, it falls short of delivering a true next-generation basketball experience."}