{"ref": "https://www.gamespot.com/reviews/wreckless-review/1900-2897379/", "date": "March 8, 2006", "game_name": "Wreckless: The Yakuza Missions", "text": "As a primarily visual medium, video games can occasionally forgo rock-solid game mechanics in favor of slick flashy visuals, and get away with it. Wreckless: The Yakuza Missions on the Xbox is a perfect example of style over substance, where the developer's main concern was creating a unique, cohesive look for the streets of Hong Kong, complete with narrow, bustling streets, miles of glowing neon, and a near-palpable level of humidity. Now the game has found its way to the GameCube. And though the game touts a fair amount of new content, the poorly optimized GameCube version robs the original of most of its visual style and slows the pace considerably, resulting in a mediocre mission-based driving game with poor handling. The basic structure of Wreckless: The Yakuza Missions remains largely unchanged from the Xbox version. The game is split into two independent stories revolving around the presence of the Japanese mafia (or Yakuza) in Hong Kong. The first story puts you in the shoes of two female Hong Kong police officers, and in the second you play as a pair of bumbling spies with questionable training and motives. Each story is made up of 10 missions, many of which are very similar between the two plot lines. As the HK cops, you'll have to destroy a cavalcade of Yakuza cars that have hijacked an armored truck; as the spies, your mission is to steal the contents of the armored truck itself, and deliver them to your employer. The level of difficulty increases as you progress through the game, but the complexity of your objectives stays pretty cut-and-dried all the way through. There are easy and hard versions of every mission, and the big difference between the two difficulty levels seems to lie mostly in the amount of traffic and the durability of enemy vehicles. Each mission has a sub-mission objective, like destroying 400 objects on the street, hitting 60 cars, or finishing the mission with 30 seconds left on the clock. Completing the sub-mission objective will unlock an especially difficult bonus mission, and completing the bonus mission objective will unlock one of the game's many, many bonus cars. Outside of the primary story mode, Wreckless: The Yakuza Missions has a two-player mode not found in the Xbox version. There are seven different two-player gameplay variants to be played in four different areas of the city, though all of them involve one player chasing another, just with slightly different scoring conditions. Most interestingly, this mode is not played via a split screen, instead putting both cars on the screen at the same time. This can cause for some awkward camera situations, where the player being chased has to turn a blind corner without knowing what's coming, though the range needed to ~escape~ your pursuer is short enough that this isn't a game-breaker of an issue. Wreckless belongs to a fairly exclusive club of mission-based driving games with destructive tendencies, with other members including Acclaim's Burnout series and Rockstar's Midnight Club: Street Racing. In Wreckless, it's almost as important to destroy as much property as possible as it is to actually complete the mission objective at hand. This may sound thrilling, but everything in Wreckless has a hollow, thin feel to it, making all the destruction seem less than satisfying. The cars you'll drive feel like they're perpetually on the verge of being completely out of control, and this, combined with the crowded streets and sidewalks of Hong Kong, help create the game's overall chaotic feel. Somewhere in the game's transition from the Xbox to the GameCube, the speed of the cars you'll drive has slowed down significantly. In fact, you won't find a car in Wreckless that can move at speeds above 90 unless it's going down a hill. The cars still handle as though they were moving at ludicrous speeds, forcing you to constantly fight the controls just to keep your car driving in a straight line, and making the car unmanageably unpredictable. Also, for reasons unknown, the vehicles in Wreckless on the GameCube come equipped with a missile launcher. In an apparent attempt to counterbalance the cataclysmic effect of the missile launcher, Yakuza cars tend to be more resilient, and civilian vehicles are a lot tougher too, no longer blinking out of existence when you tip them over. In the end, though, Wreckless is really no more or less difficult on the GameCube because of the addition of the missile launcher, and it's actually not an incredibly exciting piece of hardware to use, bringing in to question why Activision felt the need to include it in the first place. The slower pacing of Wreckless on the GameCube is most likely due to the game engine's inability to render the high-speed action at a reasonable frame rate. Almost all the special effects, high-resolution textures, and detailed car models that made the Xbox version so easy on the eyes have fallen victim to the shortcomings of the game's engine. But the real tragedy here is that even with all the atmospheric filters stripped out, a minimal amount of particle effects, and dumbed-down textures and car models, the game still suffers from sporadic slowdown. And unlike the frame rate problems seen in the PlayStation 2 version, Wreckless on the GameCube will chug for no apparent reason. Even the prerendered cutscenes, which were done in real time on the Xbox, appear to have been shoddily captured and compressed. Though the game's graphics have taken some pretty bad knocks in the transition, the sound design in Wreckless has remained largely unchanged. The soundtrack is mostly high energy electronic music, which is a suitable fit, and complements the embellished sounds of destruction as you plow through dim sum carts, sandwich boards, phone booths, potted plants, and, of course, other cars. The voice acting during the cutscenes is competent, and you'll generally hear little chatting during the actual missions, save for the curt directions of your captain on the radio. Without the gorgeous visuals to distract from its troublesome gameplay mechanics and simplistic mission objectives, Wreckless doesn't have much going for it. Players expecting the same visual smorgasbord seen on the Xbox will be deeply disappointed with Wreckless on the GameCube. Even if you have a serious craving for some destructive driving action on the GameCube, you should still probably give this one a rental before you consider buying it."}