{"ref": "https://www.gamespot.com/reviews/a-total-war-saga-troy-review-my-kingdom-for-a-cent/1900-6417534/", "date": "August 19, 2020", "game_name": "A Total War Saga: TROY", "text": "The Aegean Sea is a raging inferno. You may have heard tales of a great war between the ancient Greeks and the Trojans, a feud kindled by divine intervention, stoked by love and betrayal, and finally extinguished in an epic siege. In the newest Total War Saga, the Paris-Helen-Menalaus love triangle is the spark that doesn't just ignite the Trojan War of legend--it turns the entire eastern Mediterranean into a tinderbox.As a more focused, more specific take on Total War, Troy has an epic tale to tell. But to the benefit of the series' strategic legacy, Homer's writings set the scene rather than deliver a script, leaving plenty of room for those of us who haven't memorised The Iliad to enjoy crashing one enormous army into another and watching the world burn.At first, Troy seems a bit small. There's just the one map upon which the campaign is played. But that map is absolutely massive, taking in all of mainland Greece, a hefty slab of the western coast of modern-day Turkey and dozens of islands in between. The diverse geography provides a healthy mix of terrain types across the map, which in turn present different strategic challenges: The densely forested mainland is ideal for ambushes and funnelling armies through its mountainous corridors while the islands in the Aegean may be more exposed but any invading force is likely to have suffered attritional losses making the treacherous journey by sea.Fortunately, since you'll be spending most of your time playing Troy scrolling around the campaign map, it looks beautiful, too. Those forests and mountains, those archipelagos ringed by reefs and gorgeous blue water are depicted in exquisite detail. However, the settlements themselves lack distinguishing features and don't seem to evolve in appearance as they develop. It's disappointing you can't actually see the farmlands, quarries, lumbermills, and temples you've built spill out onto the map. Still, the way the crumpled parchment fog of war burns away as you chart new territory is lovely, and it echoes the stunning black and red figure paintings that loom over the horizon at all times. If Troy isn't the best looking Total War yet, it's certainly the most visually striking.There are only eight playable factions--split evenly between the Trojans and the Danaans--though each one feels distinct in crucial ways. Faction leaders possess markedly different abilities both on and off the battlefield that, when combined with a clutch of unique units and buildings, allow for contrasting strategic approaches. They even introduce whole new mechanics. I played a lot as Sarpedon of Lycia and was able to take advantage of his ability to interfere in trade deals between other factions, redirecting resources my way or cancelling deals outright. I felt like a Trojan puppetmaster, pulling the strings to bend the region's politics in my favour.Even though I only toyed with the other factions and didn't get to fully appreciate their unique mechanics, it's clear these mechanics are incredibly powerful--Odysseus, for example, can construct buildings of his own inside an allied settlement while Paris can move Helen around the map and gains huge bonuses and penalties depending on how near or far apart they are. The starting locations add a further dimension--Sarpedon is quite isolated albeit vulnerable to attack from across the sea while Agamemnon is protected by powerful neighbouring allies but as a result doesn't have much elbow room to expand. Such disparate beginnings prompt a fresh set of priorities when you move from one faction to the next. Your early turns on the strategic campaign map are an opportunity to scope out the lay of the land and ponder how the new multi-resource system is going to influence your plans for expansion. You have just the one small army initially, and the options to recruit additional troops are basic. To support more troops you need more food, and to recruit better troops you need wood, stone, and bronze to build the various barracks from which they spawn. Each settlement on the map specialises in one of these resources, so marching off to war isn't necessarily a case of pointing your spearmen in the direction of your nearest neighbour. The war machine can quickly grind to a halt if you're not producing enough bronze. Properly scouting the land to identify valuable and complementary resource deposits is important, and it's immensely satisfying when you finally conquer a target and the goodies start rolling in.Once you've secured yourself a handful of provinces, managing your empire's economy can feel a little rote. When it came to selecting which buildings to build and which ones to upgrade, I rarely felt like I was making tough choices. Much of the time, in fact, it felt like it didn't really matter whether I opted for the farmland or the granary or the hunter's lodge since they all basically do the same thing to varying degrees. Do you want a bunch of stone per turn or do you want a slightly larger bunch of stone per turn and a slight hit to your province's happiness? Does it really matter?Indeed, there's a consistent sense that plenty of the choices you're making are trivial, as if a whole lot of tiny decisions are adding up to not very much at all. I levelled up one of my spies 24 times over the course of the campaign and I really couldn't tell you whether that time I opted for an 8% boost to his movement made any difference whatsoever to his performance. He did manage to assassinate a Spartan general when he had only a 17% chance of succeeding, so I dunno, maybe I made a smart choice somewhere along the line.The effects of your decisions are far more apparent on the battlefield, assuming you prefer to fight them yourself rather than auto-resolving. Troy is simply a terrific demonstration of the Total War battle system. Here, the granularity and accumulation of small differences are genuinely meaningful. Mostly, it's in the make-up of the army rosters and your ability as a general to bend subtle statistical variations to your will. It's about recognising that your opponent's slingers have slightly better range than yours, but if you can send your nible light chariots down the flank they can hit the slingers from behind and force them back into range. There isn't a huge range of unit types, but there is a seemingly endless variation. Even the nods towards Greek myths with the presence of harpies, centaurs, and so on are in fact simply twists on the standard archetypes. The centaur, for instance, is merely one of the few cavalry units--just a dude riding a horse, albeit a really quick one who serves as a useful scout and irritating flanking force.Sometimes the granularity is too fine and things can become hard to read in the heat of battle. I would find myself pausing the action now and again to double-check an enemy unit. It's not always immediately obvious that these guys with an axe and shield also have a ranged attack, or that these chaps with the spears are better armoured than those other chaps with the spears. This lack of clarity, and resulting reliance on stat comparisons mid-battle, isn't too much of an issue though since you'll want to be pausing things anyway to tweak your instructions and better coordinate the next phase of your assault. Indeed, the only real negative when it comes to Troy's combat suite is the tedium of the special siege battles. Whether you're encamped for multiple turns outside the castle gate on the campaign map or waiting for your battering rams to slowly do their thing, there's an awful lot of not doing very much during a siege. What should be climactic encounters rarely generate the level of excitement or tactical ingenuity found when fighting in the open.Despite its smaller, more intimate focus, Troy is unable to shake some of the annoyances that plague the Total War series. There are too many battles to fight. As enjoyable and accomplished as the battle system most certainly is, it can be exhausting to fight this many of them. The option to auto-resolve any battle goes some way to alleviating combat fatigue, but the AI is a poor substitute for your tactical leadership--if you want to avoid unnecessary losses, you have to fight them yourself. There's also too much diplomacy. Like the battles, the diplomacy system is deep and dynamic, affording you considerable opportunity to barter, trade, and form all sorts of alliances, but the AI is too eager to engage you in it. Every turn you find yourself bombarded with diplomatic offers--Want some bronze for this stone? How about a non-aggression pact?--that you're never in a million years going to accept. It slows down a game that is already slow enough to process the AI turns and contributes nothing other than forcing you to manually decline each offer. There's a fine line between wanting the game world to feel alive with other factions pursuing their own interest and not wanting the player to feel overwhelmed with notifications, and sometimes Troy falls on the wrong side.Perennial issues aside, with Thrones of Britannia and now Troy, the spin-off Saga series has proved adept at delivering a kind of Total War that is more focused, flavourful, and even experimental than the mainline series. In the specific case of Troy, it's not always an unmitigated success; for every dose of granular detail that reveals more strategic options there's another element of graininess that obscures. At its best, though, Troy is a pretty epic series of bloody enjoyable battles that is just about as good as the series has delivered."}