{"ref": "https://www.gamespot.com/reviews/herdy-gerdy-review/1900-2857230/", "date": "May 17, 2006", "game_name": "Herdy Gerdy", "text": "It's good to see developers finally trying something new with the platforming genre. There are only so many Super Mario 64 clones and collecting frenzies one can take. Core Design's latest project, Herdy Gerdy, steps outside the box and injects some refreshing ideas into the platforming genre. But technical limitations undermine the game's unique premise and impressive visuals to create a game that is far too frustrating to play. The story behind Herdy Gerdy is a simple one. Gerdy, a young lad living in a simple village, wakes one day to find that his father refuses to get out of bed. He soon learns that a magic spell has been placed over his father to keep him from entering and winning his island's annual herding tournament. Looking for answers, Gerdy heads off for the tournament in search of the vile person responsible for the spell. Gerdy meets plenty of people along his journey who will aid him along his quest, but it's never really clear just who the antagonist is, and it keeps the game from building any sort of tension. If you couldn't already tell by its name, the gameplay in Herdy Gerdy primarily consists of herding different types of animals. But to do so, Gerdy must gradually win new items to upgrade his herding and adventuring abilities. Sometimes you'll be forced to move on and return to the level when you've acquired new abilities that will grant you access to new areas. There is some light platforming to be done, 100 bells to collect in each level, and several fetch quests to be completed, but herding is the backbone of the game. There are two primary types of creatures in the game, and each requires a special herding technique. The doops look like pink chickens and are the most popular creatures in the game. To herd them you simply run behind them until they form a pack. The game's other primary creatures, bleeps, must be herded using a magical instrument that Gerdy wins from one of the bosses in the game. Once Gerdy begins playing the instrument, the bleeps will form a single-file line behind Gerdy and follow him wherever he goes. Bleeps can fly, but they'll die if they come into contact with water. The game manipulates the levels around the abilities of each creature to create simple puzzles. Sometimes a bleep pen will have walls built around it, forcing you to find a high point to fly down from and into the pen. Bleeps are also commonly placed around water so that the chance for their immediate death is always a possibility. But what pose the most immediate threat to your creatures are huge pink monsters called gromps. If a gromp catches a glimpse of Gerdy, it will immediately begin chasing him unless he comes across some bleeps or doops, in which case the monster will stop and begin eating them. If the gromp catches Gerdy, it will strike him with an uppercut and send him back to the beginning of the level. Gromps have a tendency to hide around blind corners, which can make for excellent surprises. But Gerdy isn't completely helpless against the gromps. Often the best course of action to take when starting a new level is to lead the gromps into traps that will permanently disable them. This lets you herd the animals without the threat of leading them into a gromp ambush. To complete each level, you must pen the doops and bleeps before they're eaten by the gromps. It's a simple premise and one that could have been executed in a much less elaborate manner. The level design can be confusing, and many times you'll run around the level with a gromp on your tail for several minutes before locating a trap.One of the primary issues with the gameplay is the creature AI. Doops are stupid, and there's always one stray that seems to want to ignore the rest of the pack and do its own thing. This can cause headaches, particularly in the timed boss levels when you're trying to win an item that will give Gerdy new abilities. Creatures will also get stuck on portions of the level and remain stuck until the game is reset. Another problem is that each group of creatures seems predetermined to be herded to a particular pen. You may have a group of 15 doops right in front of a doop pen, but they will fight going in and instead run in the opposite direction toward another doop pen. Because of these AI problems, it's always good to keep the camera panned way out, but this only brings the game's largest issue to the fore.Some games have bad cameras that you can eventually learn to use after some practice, but the camera in Herdy Gerdy is about as wild and stubborn as they come. It gets caught on objects, obscuring your view, and it will zoom in and out without any warning. When a gromp is chasing you or you're trying to draw its attention away from creatures, it can become a major point of aggravation. The gameplay in Herdy Gerdy presents some interesting ideas, but the execution is too flawed to allow the concepts to fully develop. Though Herdy Gerdy is primarily a puzzle game, completing it is more a question of memorization than skill. After going toe-to-toe with the camera for a few hours, most will find the gameplay repetitive and needlessly difficult. Add some crash bugs to the mix and long loading times, and you have a recipe for frustration. Cel-shading is all the rage with developers these days, and Herdy Gerdy uses a modified version of the technique. With the thick black outlines found in cel-shaded games removed, Herdy Gerdy truly looks like an animated feature film. But because there are no black lines around objects in the game, it can sometimes be difficult to pick out specific objects from the landscape. Turning down the brightness setting on your TV will remedy this. Once you can really see the organic worlds constructed by Core Design, they immediately become far more impressive. The levels are littered with wildlife that seemingly pops out from behind every tree. The animation for the game is particularly impressive, and it really helps its many characters come to life. The facial animation is really striking during the real-time cutscenes, and it's obvious that a lot of time has gone into getting them just right. Where polygon counts are concerned, Herdy Gerdy holds up quite well. There can be upward of 40 doops onscreen at once with only a slight hint of slowdown. Despite this, the draw distance is adequate, though there is definitely some fogging used to hide draw-in, and the frame rates rarely soar over 30 per second. Special effects such as real-time lighting and environmental mapping are strangely absent, and you won't see any other cool graphical extras like reflections in water or real-time shadows. It should be said that some of the characters in the game, particularly the mole that aids Gerdy in his quest, look to have been stolen directly from other games in the genre. But Herdy Gerdy's overall look is unique enough that it still manages to set itself apart from its contemporaries. Like Herdy Gerdy's visuals, the sound in the game is quite good. Some of the compositions feature woodwinds with splashes of brass, while others resemble the minimalist synth rock Depeche Mode was producing for its first album. The music will change on the fly, and the tempo will build when Gerdy is being chased by a gromp. As another nice touch, Gerdy will play his magical instrument along to the main composition being played. The voice acting for the game is average at best, thanks to a limp script. You won't find any of the hidden innuendos that can be used in seemingly harmless games like Herdy Gerdy to make them appeal to the older player. For the hearing impaired, there are subtitles to accompany each cinema. Ambient sound effects are handled rather well. You can hear streams running, birds chirping, and the wind blowing when Gerdy is standing on a lookout. Herdy Gerdy is a classic example of why most great games end up being delayed before being released. Another five or six months in the cooker and Herdy Gerdy could have really been something special. The herding aspects of the game can be addictively fun when the camera isn't throwing a fit; the graphics and sound provide a nice technical foundation; and the level design can be clever at times. But the bad stands on equal footing with the good, resulting in a game that only the most stubborn players will play to the end. Hopefully the potential exhibited by Herdy Gerdy won't go to waste and Core Design will have all the time it needs to complete its next effort.Some games have bad cameras that you can eventually learn to use after some practice, but the camera in Herdy Gerdy is about as wild and stubborn as they come. It gets caught on objects, obscuring your view, and it will zoom in and out without any warning. When a gromp is chasing you or you're trying to draw its attention away from creatures, it can become a major point of aggravation. The gameplay in Herdy Gerdy presents some interesting ideas, but the execution is too flawed to allow the concepts to fully develop. Though Herdy Gerdy is primarily a puzzle game, completing it is more a question of memorization than skill. After going toe-to-toe with the camera for a few hours, most will find the gameplay repetitive and needlessly difficult. Add some crash bugs to the mix and long loading times, and you have a recipe for frustration. Cel-shading is all the rage with developers these days, and Herdy Gerdy uses a modified version of the technique. With the thick black outlines found in cel-shaded games removed, Herdy Gerdy truly looks like an animated feature film. But because there are no black lines around objects in the game, it can sometimes be difficult to pick out specific objects from the landscape. Turning down the brightness setting on your TV will remedy this. Once you can really see the organic worlds constructed by Core Design, they immediately become far more impressive. The levels are littered with wildlife that seemingly pops out from behind every tree. The animation for the game is particularly impressive, and it really helps its many characters come to life. The facial animation is really striking during the real-time cutscenes, and it's obvious that a lot of time has gone into getting them just right. Where polygon counts are concerned, Herdy Gerdy holds up quite well. There can be upward of 40 doops onscreen at once with only a slight hint of slowdown. Despite this, the draw distance is adequate, though there is definitely some fogging used to hide draw-in, and the frame rates rarely soar over 30 per second. Special effects such as real-time lighting and environmental mapping are strangely absent, and you won't see any other cool graphical extras like reflections in water or real-time shadows. It should be said that some of the characters in the game, particularly the mole that aids Gerdy in his quest, look to have been stolen directly from other games in the genre. But Herdy Gerdy's overall look is unique enough that it still manages to set itself apart from its contemporaries. Like Herdy Gerdy's visuals, the sound in the game is quite good. Some of the compositions feature woodwinds with splashes of brass, while others resemble the minimalist synth rock Depeche Mode was producing for its first album. The music will change on the fly, and the tempo will build when Gerdy is being chased by a gromp. As another nice touch, Gerdy will play his magical instrument along to the main composition being played. The voice acting for the game is average at best, thanks to a limp script. You won't find any of the hidden innuendos that can be used in seemingly harmless games like Herdy Gerdy to make them appeal to the older player. For the hearing impaired, there are subtitles to accompany each cinema. Ambient sound effects are handled rather well. You can hear streams running, birds chirping, and the wind blowing when Gerdy is standing on a lookout. Herdy Gerdy is a classic example of why most great games end up being delayed before being released. Another five or six months in the cooker and Herdy Gerdy could have really been something special. The herding aspects of the game can be addictively fun when the camera isn't throwing a fit; the graphics and sound provide a nice technical foundation; and the level design can be clever at times. But the bad stands on equal footing with the good, resulting in a game that only the most stubborn players will play to the end. Hopefully the potential exhibited by Herdy Gerdy won't go to waste and Core Design will have all the time it needs to complete its next effort."}