{"ref": "https://www.gamespot.com/reviews/tyranny-review/1900-6416570/", "date": "November 11, 2016", "game_name": "Tyranny", "text": "Being evil is not a new concept to role-playing games, but Tyranny takes playing the bad guy further than Ive ever seen before. While Ive sided with demons, robbed innocents, and even slaughtered many a bystander just because I felt like it in other RPGs, the nasty stuff is taken to another level in Obsidian Entertainments latest opus. How wicked is it? Well, at one point I was encouraged to murder an infant by the tykes own grandfather, no less. At another, I was given the option of tossing a captive off a tower to deliver a message to friends far below. I even got to listen to a soldier ally tell me how much his parents would be proud of him if they could see him now... right after he recounted how he had to murder them both to achieve his present position.Such atrocities would qualify Tyranny as one of the most disconcerting games of the year all on their own. But what really sets this game apart from the crowd is that you play more of a cog in a machine instead of the usual capital-V villain. The old Hannah Arendt phrase about the Nazi banality of evil ran through my mind constantly as I played through the campaign, doing my bloody duty over and over again to prop up a conquering empire. Yet even though I found all of this deeply unsettling, the mature and realistic handling of the dark side of humanity drew me into what has to be one of the most thought-provoking games that Ive played in ages. The game makes it all too easy to relate to evil acts, as the typically bleak circumstances depicted herein frequently make atrocities seem necessary. Youre often killing to expand the locked-down order of your empire and avoid more bloodletting and chaos, so even the most heinous actions somehow come off like justice being served. Its only when you look back at what youve done that you realize how monstrous youve become in service to the idea of, well, a tyranny. Add in stellar roleplaying depth, constant opportunities to make decisions that affect the entire game world, and brilliant tactical combat mechanics, and youve got one of the best RPGs of this--or any other--year.The setting is the fantasy realm of Terratus, which has been wracked by war for centuries due to the ambitions of the monstrous Overlord Kyros. This enigmatic immortal never actually appears in the game, but she (or he, as nobody even knows if the tyrant is female or male) looms over everything as kind of a cruel god that has steadily conquered the entire world. As befits the games malicious leanings, you take on the role of one of Kyros top servants, a freelance judge and executioner called a Fatebinder. First up on your docket is looking into the brewing civil war between factions in the Overlords squabbling army, a dispute causing problems in the effort to subjugate the last free refuge on the map. Kyros has grown so tired of the delays that she fires off a spell that places the entire region under a curse that will kill everyone in the area if the enemy citadel isnt captured within a week.Heavy story development gives even more weight to everything that you do. Politics are paramount, and fear is the one constant motivator. Kyros chief lieutenants are demigod-like figures called Archons who wield incredible power within their own spheres of influence--and are, of course, constantly jockeying for position with the boss. You directly serve the Archon of Justice, Tunon the Adjudicator, but are also heavily involved with two others. Graven Ashe leads the military fanatics in the Disfavored, while The Voices of Nerat command a psychotic gang of rapists and murderers called The Scarlet Chorus. Most of Tyranny sees you bouncing between these two sides, choosing whether or not to align yourself with one or the other depending upon the circumstance and personal choice.And there are a lot of choices to make. Tyranny is loaded with meaningful dialogue, and the options you select have an immediate impact on the people, factions, and even the land around you. Everything is so responsive that the game feels like a Choose Your Own Adventure novel. The game actually begins exactly like one of those books--you decide on courses of action in the prologue that can be used to set up the world differently for each campaign. Whatever you decide to do and say during this opening makes a huge difference. At one point, you select between burning a magical library to the ground with no warning to the inhabitants or giving them advance notice of the coming arson so that they can flee. Choose the latter option, as I did, and the those inside are nicer and even compliment you for your mercy when you show up there later in the game.Choices carry even more weight once the proper story gets underway. I dont think Ive ever played an RPG packed with so many personal choices, most of which can be seen to dramatically change the world at large. Just about every other comment you make causes a reaction. Be too harsh with a party member, and that will increase his or her fear of you. Play the nice guy, and you build up loyalty. Act the same way when it comes to a faction, and you engender loyalty or wrath. Too much of either approach with the Disfavored and the Scarlet Chorus, and youll inevitably form an alliance with one and develop enmity with the other.Most of your choices also have a moral dimension to them that rarely involve black-and-white situations. While you can act like a serial killer and slaughter people for kicks, most of the time youre stuck right in the middle of that good old banality of evil. Decisions pop up out of nowhere all the time. You run across criminals being escorted to an execution and are asked to make a ruling on their fate. You have to make hard calls about how to best reach quest goals, solve dilemmas that often come down to deciding if you should take the easy route and kill people or look for more creative solutions. Not much here is clear cut. The game includes few (if any) good guys, so sometimes murder is the more sensible option to keep the peace and leave fewer problems for yourself down the road (yes, the game is a downer; heck, even the soundtrack is pretty much one long moan). These ethical predicaments dont exactly add up to Nietzsche, but they still made me think a lot more than I would during a typical RPG.This is a unique experience that makes you think about human nature, morality, and what role mercy and compassion should (or even could) play in a centuries-old war.Which side you lean toward has a big influence on how your campaign plays out. I wound up siding with the Disfavored choosing the Lawful Evil path of these medieval fascists instead of the crazed Chaotic Evil of the rampaging Blood Chorus. I enjoyed this alliance, although it left me wondering what my game would have been like if Id given in to bloodlust. As a result, I was constantly planning out what I would do in my next playthrough, which bodes well for replay value. It would probably take a good two or three plays to even come close to seeing everything the game has to offer.Tyranny is a spiritual successor to Obsidians last RPG effort, 2015s Pillars of Eternity, and this game uses the same general engine and interface. As expected, its loaded with role-playing depth (as well as gorgeous spell effects and detailed background art). Characters are not bound to set D&D-style classes. Instead, you freeform it by boosting core abilities every time you level up and select options from extensive skill trees that cover all manner of specialties from might to magic. An innovative (if fussy) rune system governs how you research and learn spells. Many of these incantations are a bit out of the ordinary--and a bit sadistic. Fire magic causes inflamed foes to scream horribly for mercy, and other spells like the ability to place a water bubble on the head of a victim, drowning him in the open air, perfectly match the ghastly nature of the overall game.Combat is equally captivating, although it always takes a backseat to the storytelling. This is a long way from a hack-and-slasher, but the traditional Baldurs Gate-style tactical approach used here relies on a pausable real-time engine to provide tense battles. Tyranny doesnt include the ludicrous mob scenes that hampered and dragged out Pillars of Eternity, either. Most scraps are short, nasty affairs with no more than a handful of baddies. Thinking strategically is often a necessity in these fights, although the party AI is so good (especially when it comes to spellcasters) that you dont need to micromanage too often. I actually left the AI on a lot of the time to help me sail through most battles. The difficulty is also nearly perfectly balanced on the default setting, with battles steadily scaling up until you hit the challenging boss fights at the end of the game.Some aspects of the game feel overly convoluted or unnecessary. Every NPC seems to come with about 10 minutes worth of dialogue, much of which serves little purpose aside from adding color to the game world. Three different values of currency are used here, for no apparent reason. Most items have been given such a wide range of stats that its difficult to compare them on the fly. Im all for +2 swords and the like, but not bronze swords accompanied by a half-dozen numbers rating their damage per second, parry and accuracy ratings, recovery time, and so forth. Some frills are barely used. I didnt understand the point of the missives section where you could send off letters seeking advice from other Fatebinders. Being able to conquer and set up magical spires as bases of operation with special buildings to research spells, make weapons, and train characters, also didnt seem all that necessary. I took them over pretty easily, but then only used them afterward when the plot demanded it.Tyranny also isnt quite as wide open as you might expect. The game is brief in comparison with many other traditional RPGs. I got through the campaign in under 25 hours, despite taking a lot of time to read through dialogue and complete most of the side quests. Such brevity is good in some ways, allowing for a tight focus on the story and linear maps that get right to the point. But the story ends too soon and too abruptly, stranding you without a fulfilling climax. Just when you think youre gearing up for a final showdown, the game simply stops and presents you with clips recounting what you did during your adventure and letting you know what the future holds for both the realm and your companions. It feels like the game was chopped in half at the last minute, so you can probably expect DLC or a full sequel to arrive in short order.Evil may be banal, but Tyranny is not. While I have some personal misgivings over how much I enjoyed such a twisted, unscrupulous game, this is a unique experience that makes you think about human nature, morality, and what role mercy and compassion should (or even could) play in a centuries-old war. It reaches beyond the standard heroic fantasy RPG where you slay monsters and save the kingdom, inverting that familiar story and setting and creating something utterly different--and somewhat depressingly realistic."}