{"ref": "https://www.gamespot.com/reviews/ephemeral-fantasia-review/1900-2617272/", "date": "August 18, 2000", "game_name": "Ephemeral Fantasia", "text": "If the success of Square's Final Fantasy series is any indication, the story-driven approach of linear RPGs is the golden ticket when it comes to popularity. However, in recent years, a growing faction has also come to prefer the ~do anything/go anywhere~ approach of nonlinear RPGs, such as Shenmue and Dark Cloud, where plot progression often takes a backseat to things such as character development, exploration, and battle. Konami's Ephemeral Fantasia attempts to unify both groups by serving up a quest that is significantly open-ended at the start but becomes increasingly more focused as time marches on.Assuming the role of a guitar-playing bard named Mouse, you and your guitar, Pattimo, find yourselves invited to play at a royal wedding on the island of Pandule. Unfortunately, things soon get hot and heavy when you discover that Xelpherpolis, the groom, has placed the island under a nasty time-looping spell and intends to suck the life out of every living man, woman, and child of Pandule. As you continually relive the next five days of your life, your primary task is to enlist partners in your quest against Xelpherpolis. Each week gives you an opportunity to acquire an additional party member, as well as complete tasks related to the time loop, level your characters in battle, or just explore various spots around the island. As long as you remember to store your items in Claire's broken clock between loops, you won't lose any money or health potions either.Time looping, an idea borrowed from Nintendo's The Legend of Zelda: Majora's Mask, isn't the only RPG clich present in Ephemeral Fantasia. Like Sega's Shenmue, the game has its own running clock. This timer plays a major role in being able to access dungeons, acquire items, and enlist new party members. So much so that if you're not in the proper place at the proper time and not with the proper person and holding the proper item, you'll have to wait an entire game-based week to try again. Also like Shenmue, or more recently, Sony's Dark Cloud, Ephemeral Fantasia features a number of optional minigames, such as rhythm-based guitar playing, swimming, arena fighting, dominoes, and even a drinking competition. These minigames don't have much bearing on the overall outcome of the story, but a little extra gold, map pieces, or health items can't hurt.By far, Ephemeral Fantasia takes the majority of its design clichs from two of SquareSoft's larger series, Final Fantasy and Chrono Trigger. In addition to the active battle system, which lets you select attacks, cast magic, use items, and change strategy in real time, the constant appearance of enemies with multiple forms is something ripped right out of Square's collective conscious. Some enemies, like Grantus or Beak, will even join your party once they're defeated. In all, there are 10 possible party members to enlist, some of which can even alter the outcome of the game depending on how well you communicate with them--yet another classic SquareSoft idea. Even Rummy, Mouse's hotheaded, big-breasted soldier friend, is strikingly similar to another SquareSoft creation, Tifa from Final Fantasy VII.Lack of originality aside, the two greatest criticisms of Ephemeral Fantasia are actually somewhat significant. First, the game's storyline is woefully immature and noncomplex. There are no surprise plot twists or major whodunits to discover--only an endless array of sex-related jokes to endure en route to the final battle with Xelpherpolis. Second, the game's scope is overwrought on so many levels. The island itself is a single, huge area full of forests, beaches, towns, and dungeons, all of which exist on a 1-to-1 scale with one another. Combined with frequent random battles, this makes travel from one town to the next a highly time-consuming and labor-intensive endeavor. The artificial time loop doesn't help matters any either--if you miss the chance to acquire an important item, you'll have to wait five full game days for a second opportunity. Whether you love or hate the game's clichs and shortcomings, Ephemeral Fantasia is nothing more than average when compared with the majority of other RPGs. Graphically, both Dark Cloud and the upcoming Final Fantasy X offer more bang for the buck in terms of visual splendor. Character models, especially those for Rinna, Rummy, and Loreille (the game's female characters) are as colorful, smooth, and pleasing as you'd expect from a PS2-powered 3D RPG, but scenery detail and spellcasting effects are laughably simple. Musically, the game doesn't compare with Shenmue, Final Fantasy, Grandia, and a whole slew of other examples, with the exception of the spectacular six tracks in the guitar-playing minigame. RPGs are a highly subjective experience. Because of this, Ephemeral Fantasia is going to find an audience regardless of its flaws. Although it doesn't possess the charm of Final Fantasy or the replay value of Dark Cloud, there is something refreshing about a game that offers so much in the way of freedom and variety. It's hard to recommend this game if you're married to a particular series, but if you're relatively unversed in the RPG genre or have an amazing sense of direction, then by all means, give Ephemeral Fantasia a try."}