{"ref": "https://www.gamespot.com/reviews/bubble-bobble-neo-review/1900-6229007/", "date": "September 23, 2009", "game_name": "Bubble Bobble Neo!", "text": "It has long been rumored that dragons breathe deadly blasts of fire to strike down their enemies, but Bubble Bobble provides a very different spin on this mythology. Pint-size protagonists Bub and Bob shoot bubbles from their mouths, and you use these floating orbs to trap enemies, clearing the screen of evil so that you can continue on your quest. The single-screen action is as fun and silly as it was when the original game first appeared in arcades 23 years ago, and it gets even more enjoyable when you take a friend (or three) along for the ride. The lack of online multiplayer is a bit of a downer, as is the sometimes punishing level design in which you need pixel-perfect placement to succeed. But those small faults fade into the background when you're matching wits with a flying whale or summoning giant lightning bolts to rain down from the sky in this enjoyable platformer. Bubble Bobble Neo is a simple idea, but that certainly doesn't make it easy. Every level has a handful of enemies onscreen, and you must trap them in your magic bubbles to immobilize them, and then ram into them to finish them off, causing them to burst into tasty fruit that you collect to boost your high score. Your foes have their own plans of attack, though. Wizards shoot red balls of death, pinwheel flyers zigzag in unpredictable patterns, and rock monsters will hurl themselves right at you. One touch from your attackers and your life ends, so you need to stay on your toes, knowing when to lead the attack with a full-on assault of bubble power, and when to leap away in fear to live to fight another day. One special item appears in each level to help you stay alive. These take a variety of forms, such as shoes that make you faster, a parasol that skips a few levels, or a bomb that kills everyone onscreen. Bubble Bobble Neo includes the 100 levels from the arcade original along with 100 new levels just for this game. These alternate levels are more challenging than the original mix, giving you less room to flee from danger, and they add a couple of new features that shake up the formula. First, you can shoot diagonally. This may not sound like a huge difference, but navigating slanted paths and having to be fearful of enemies laying the smack down on you from a 45-degree angle forces you to expect danger from any direction. More importantly, you can tackle these levels with up to three friends. While the original stages are still restricted to just two players, these double that amount, giving you extra help in the more challenging levels as well as extra competition for points at the end of each round. There is a four-player competitive mode as well in which you play through a random assortment of levels until your limited stash of lives is used up. The victory crown goes to the dragon with the most points, and it's great fun trying to nab fruit before your buddy does. You can even trap your dragon friends inside of bubbles, keeping them immobilized while you scarf up the precious points. The classic bubble-popping action is as fun as it ever was, but the controls have been tweaked slightly in transition, resulting in some levels being more difficult than they previously were. In a few levels across both modes, you begin the stage inside of a long vertical shaft. To reach the top, you have to climb your own bubbles, which is usually an easy-enough feat. But it is extremely difficult to successfully blow bubbles in these confined spaces without causing them to burst immediately in your face, and the difference between success and failure is just a few pixels. Getting to the top is frustrating, because you have to rely on luck as you frantically smash the jump and bubble buttons until something finally works. There are only a handful of these annoying levels in the game, but your progress and fun can come to a halt when you struggle to pass them. Slanted blocks take bubble shooting to the extreme next level. The visuals have received an upgrade from the original release, but the charm has been kept intact. The differences are slight: The heroes and villains have been given a 3D overhaul, and the fruits and special items that litter the screen are even more vibrant than before. There is no option to switch back to the original visuals, but it's not necessary either. The face-lift is subtle but effective, making this look presentable even in a world of high-definition televisions. The music has also stayed mostly the same. It repeats every 30 seconds or so, but the tune is so infectious it only adds to the experience. A few frills have been tossed in to give the soundtrack a bit more complexity, but, thankfully, the same hummable riff is kept intact. Bubble Bobble Neo is a faithful re-creation of the arcade classic, bringing the joys of bubble popping to a modern audience. The controls are not always perfect, but the action is still enjoyable, and you usually have only yourself to blame when you die. The biggest disappointment is the lack of online multiplayer, which is a very unfortunate omission. But as long as you can find a few friends to play with, Bubble Bobble has aged well and provides just as much fun in 2009 as it did way back in 1986."}