{"ref": "https://www.gamespot.com/reviews/hand-of-fate-review/1900-6416038/", "date": "February 26, 2015", "game_name": "Hand of Fate", "text": "Hand of Fate may not be a Dungeons & Dragons game, but it captures the imagination in a similar way: by abstracting exploration and encouraging your mind to create exactly what the forests, dungeons, and villages you encounter might look like. The game's mysterious and melodramatic card dealer takes the role of dungeon master, uncovering cards that represent star-crossed lovers looking for a friendly face, or raging riverbeds that must be crossed. Meanwhile, you sit across from the enigma holding the cards, choosing whether to help the lovers, or to alert their parents; you navigate that river, hoping to traverse it unscathed, rather than to draw the ire of nearby lizardpeople. You never see these lovers: they exist only as a few words and a card. Hand of Fate invites you to look beyond its abstractions and picture such moments with your mind's eye. When the game tells you of a surreal circus that dissipates on the wind once you make your exit, the writing is just clear enough to let you paint within the outlines drawn for you.It's tempting to call Hand of Fate a cross between a collectible card game and an action role-playing game, and while you can customize your deck, that comparison doesn't seem quite right. A typical CCG is competitive, having players attack and counter using cards that represent creatures, heroes, statistics, and so forth. In Hand of Fate, those cards act in tandem as a tabletop game board in which you move your token one square at a time, uncovering events with each turn. The enigmatic dealer places his cards face down in a linear or non-linear arrangement, and with each move, you lose a single ration of food, which is one of three primary resources--along with gold and health--that you must track. That card might represent a simple bandit ambush, a bard asking for coin in return for a song, or a magic portal that takes you to the next adventuring area--which means navigating a new arrangement of cards.Drawing a card often leads to more choices, many of which are determined solely by luck. You are running from a giant tentacled behemoth, and your destiny belongs to the whims of four cards, only one of which represents success, while the others represent various degrees of failure. The four cards are shuffled, and with a shaky hand, you choose the one you hope leads to safety. Some events are stacked in your favor--the hand may consist of three success cards and one failure card, for example--while others punish you with several randomized draws in a row, each of which possesses only a single chance of success. Victory often means drawing from a stack of equipment cards from your own deck (Ooh, look: a flaming sword!). Failure, on the other hand, usually means drawing loss cards that diminish your maximum health, or even curse you with negative effects that last until the game is over--unless, that is, you draw a card for a mage that sells curse removals, and you actually have the 75 gold necessary to buy his services.Encounter cards lead you into battles that are not left to your imagination, but occur in real time. Combat ushers you into a small map within a forest, or within a ruined temple, and you swing your axe or sword at rats and mages until they fall--or until you do. Skirmishes have a Batman: Arkham vibe, in the sense that prompts appear over your head, and you must press the proper button to counter a melee attack, or to deflect an incoming projectile. Early battles are easy enough to survive, but as the story mode wears on, you face difficult situations made even more challenging by bear traps hidden in bushes, and giant golems that pound the ground, forcing you to tumble away lest you lose a giant chunk of health.Hand of Fate's brilliance lies in how its abstract components inform very real battles. Should you run out of food, for instance, each turn slashes ten health points away from your total supply. If you are nearing death when the next battle begins, you are all that more anxious about timing your swings perfectly, and avoiding traps at all costs, knowing that being hit by a single dart is enough to change the tide of battle. Back and forth you move, from battle arenas to the cards in front of you. When you draw near death during battle, you return to the cards hoping the next move might bring you nearer a priest who might heal you, rather than draw a curse that siphons away your last remaining spirit. When you leave the cards for battle, you wish you hadn't sold shield for the food you were so desperate for. Tensions rise as the pendulum swings back and forth, and all you can do is pray the hand of fate provides cards that favor and bless you. It's a satisfying tug of war, unusual in the way it marries the conceptual with the physical.It is in the details that Hand of Fate suffers, occasionally allowing the frustrations to outweigh the fun. On the battlefield, the small maps and fixed camera don't play nice, too often limiting your point of view when you most need situational awareness. I often longed for breathing room, such as when close to a dozen rats swarmed me on a sea vessel so small that neither I nor my enemies could properly move about. And I often wished for a better camera, particularly during the occasional trap mazes, when I couldn't quite tell if a map square was trapped because a wall was in my way, and the camera had yet to pull closer. Off the battlefield, the element of chance also proves vexing. What is an adventurer to do when a series of curses has reduced your maximum health pool to one point of health before you have ever entered battle? You might play several story matches over and over again, pining for triumph, only to throw the controller and move on to something less cruel, like Spelunky or Dark Souls.Technical troubles hinder the game in and out of combat. The frame rate in particular is habitually unstable; the single-digit jitters that typically occur when the dealer performs his mystical shuffles may not affect gameplay, but it certainly diminishes the magic of the moment. I also encountered numerous bugs; there was a period during which I had to start up the game multiple times before it would run, and another stretch during which the lava golem would immediately die when he performed his first attack, as if he was taking damage from his own wallops. (Note that I have only played on the Xbox One; these problems may or may not occur on PlayStation 4 or PC.)Yet Hand of Fate has a way of drawing you back into its fold, even after you have completed its story and have taken to Endless Mode, which challenges you to stay alive as long as you can before your luck runs out. The game absorbs you in three ways at once, by invoking both the loot-gathering vibe of an action RPG, the deck-fiddling fun of a CCG, and the ~I'm feeling lucky this time!~ aspirations of games of chance. It's a powerful one-two-three punch, though you need to be prepared: sometimes those punches land with unexpected pain."}