{"ref": "https://www.gamespot.com/reviews/ms-pac-man-review/1900-6128925/", "date": "May 17, 2006", "game_name": "Ms. Pac-Man", "text": "Ms. Pac-Man, the sequel to the most popular arcade game of all time, is a paradigm for sequels everywhere. While retaining all of the necessary gameplay elements of the original, Ms. Pac-Man adds just enough twists to be distinctly interesting. In fact, although some might argue otherwise, Ms. Pac-Man is by all measures an improvement upon Pac-Man, with multiple level maps and more-complicated artificial intelligence. Ms. Pac-Man for mobile stays true to the form first molded by the arcade edition, maintaining almost all of what was worthwhile about the original. The only major detriment of Ms. Pac-Man on mobile is that you can, for only a little more money, play Ms. Pac-Man for Prizes--the same game with additional benefits. Ms. Pac-Man takes feminism to a new level. In Ms. Pac-Man, your objective is to clear the stages and avoid the ghosts, just as you do in every other game in the series. The difference is that the stages change, three times, so that you're not always dealing with the same exact layout. The ghosts are different as well--Sue replaces Clyde as the odd ghost out--and their AI patterns, which were regimented in Pac-Man, are seemingly much more random. All in all, this makes the game slightly tougher and more variable, which is good when you're faced with 255 levels of the same game. Of course, you're probably not going to play all 255 levels, but the change of pace is nice for whatever duration you do happen to play. The sound effects are fine, although they fail to replicate the chomp noise that the Pac family makes when biting down on every pellet, just like in Pac-Man mobile. Otherwise, the startup and death noises are well replicated. The graphics, too, are very well done, down to Ms. Pac-Man's notorious bow, eyeliner, and Monroe-positioned mole. The one oddity about the game is that the demo loop, which introduces the cast of characters, occasionally lags, even on faster phones like the LG VX7000. This has no impact on the game, but it's strange nonetheless. Ms. Pac-Man is a worthy adaptation if you've got the Pac-Man fever, but if you can shell out a dollar more, you can treat yourself to Ms. Pac-Man for Prizes, which is the same, but better. No matter what your fancy, you're sure to find your Pac-Man fix on mobile, and you'll be pleasantly surprised with how good the game is, all over again."}