{"ref": "https://www.gamespot.com/reviews/fifa-2003-review/1900-2897912/", "date": "November 18, 2002", "game_name": "FIFA Soccer 2003", "text": "Last year, EA Sports made substantial changes to the FIFA series with FIFA 2002, by generally slowing down the gameplay and making it much more difficult to execute complex plays, such as the cross field pass to a running man near the goal. It was probably the closest the FIFA series had ever come to mimicking the actual sport of professional soccer, until now with the arrival of FIFA 2003, which not only surpasses FIFA 2002 in terms of sheer soccer authenticity, but also in terms of gameplay mechanics. In FIFA 2003, your offense must run a coordinated attack that draws careless defenders in towards the ball, thus leaving teammates open down the field--even against the worst international teams, pushing the ball straight up the field with only a few players isn't the most effective strategy and will almost always result in an interception. Indeed, other gameplay mechanics that were relatively straight forward in previous FIFA games, such as corner and penalty kicks, have a greater level of depth, and jukes moves are now performed via EA Sports' freestyle control system, which doesn't particularly work all that well. The different gameplay modes in FIFA 2003 aren't all that different from those in previous FIFA games. Under the club championship option, you can play a club championship friendly (the equivalent to an exhibition match) or you can play a club championship season in which the best club teams vie for the championship trophy. Of course, there's also a basic friendly option where you can select from dozens of different club teams from around the world or even international teams. Similarly, if you want to bypass an entire season and go straight to a tournament, you can jump right into FIFA 2003's tournament mode where you can choose to participate in one of six tournaments or create your own. While each of these modes will undoubtedly draw the interest of both hardcore and casual soccer fans, the real heart of FIFA 2003 lies in its season mode. In this mode, you can take control of a team from one of 14 leagues, including Major League Soccer, the Italian League, the FA Premier League, Spanish Primera Division, and others. Once a league has been selected, you can choose one of the teams from within that league and take it through an entire season in the hope of winning championships. It's worth noting that there are minor differences between a few of the leagues. For example, most of the European leagues have to worry about cup and divisional matches while in the MLS, none of these things exist--one of many nice little touches featured in FIFA 2003. But regardless of the league, you'll still have the same sort of options to select from before going into an actual game. First, you can view the team standings to get an idea of where your team ranks in the league and whether or not you have a good chance of getting into a championship tournament. It's also possible to monitor the schedule and look at what divisional matches are coming up or you can fly right through the season by simulating the outcome of any upcoming games. In the team management option, you can view individual player skill levels, set formations, determine who takes free kicks, corner kicks from the left or right side of the field, and which player takes spot kicks. Lastly, you can also buy and sell players, but you won't be limited to players within your league, so if your team has enough cash, you can certainly try to go after one of the top international players. The season mode is pretty interesting and most fans will find it entertaining going from season to season, but it's not exactly an in-depth look into what goes on behind the scenes and in the offices of those that control a professional football team. For most, the gameplay will make up for any shortcomings that FIFA 2003 has as far as secondary features are concerned because it's simply incredible. The single most important aspect of gameplay in FIFA 2003 is teamwork, without it, your opponent will always end up with the ball and within close proximity of your goal. You always have to be aware of teammates and plan your offensive strategy, depending on where they are in relation to defenders. For example, if you drive the ball up the middle of the field, than you'll probably draw defenders from the wings, allowing you to perform a small ground or lob pass to an open teammate at the edge of the field. When you push the ball up with that player, the objective is to draw more defenders and find another open man, but if it looks like you have the opportunity you can hit the sprint button and drive the ball up the field a little more before giving the ball up to a teammate. Obviously, passing plays an important role here, and thankfully, it can be quite easy to have a precise passing game in FIFA 2003 just as long as you aren't careless. Computer controlled players like to stand in the passing lanes of players that are up the field, so they'll usually intercept the ball if you try to push it past them. Lob passes or even crosses can be a useful tactic in these types of situations, especially when they're close to the goal, but it can be difficult to perform one properly if a defender is directly on the player attempting to make the pass. Since the strength of the cross (indicated by a meter below the player's name) is determined by how long you wait to tap the lob pass button a second time, you essentially give the defender more time to react if you want to kick the ball across the field. But if performed correctly, a cross can result in a variety of different actions ranging from headers and bicycle kicks, to players chesting the ball down, getting it on the ground, and then taking the shot. Like in FIFA 2002, it can be pretty difficult to connect a cross-field pass near the goal. Passing hasn't changed dramatically, but EA Sports has made some changes to the corner and penalty kick system. Instead of just a gigantic arrow determining where the ball lands on a corner or penalty kick, FIFA 2003 uses a new system where accuracy depends on your ability to get a small cursor to fall in the green area of a new kick accuracy meter. The direction that the kick will take is directly related to where you hit the ball, and you can choose to hit any portion of the ball by moving the right analog stick around the ball icon that appears at the bottom of the screen. This might seem like a straightforward idea, but it can actually take some time before you fully understand the mechanics and discover accuracy and kick placement combinations that work well in particular situations. Shooting remains virtually unchanged, but it seems the accuracy has been tweaked so that a shot on goal doesn't always mean it will magically come anywhere near the goal. The juking system on the offensive side of the ball has also changed with the inclusion of the freestyle control system. Theoretically, this system is supposed to give you more control over your ball fakes and generally bring you closer into the game, but it'll be quite some time before that actually happens, The problem with the freestyle control in FIFA is that it just isn't all that free--so many moves depend on what your player is doing at the time that he'll end up doing nothing because you didn't use the correct directional combination for that situation. It's also depends on which foot he's using to take control of the ball, so there's a lot of a little things that you need to pay attention to. After a while, you'll start to get a feel for a few of the different moves that you can execute using freestyle, but there's no question that it's not even remotely as free flowing or smooth as the freestyle controls used in NBA Live. On the defensive side of the ball, there aren't quite as many overall changes. You can perform the standard slide tackle, which usually results in a foul if you're not careful, as well as a challenge that simply entails that you run up to a player with the ball attempt to take it away from him. Goalie AI is generally very good and will rarely make any mistakes that the goalies in the actual sport don't make. The keeper will run out to grab or even challenge the ball if no other offensive players are in the vicinity. He'll punch out lobs or crosses, and quickly reach out his hand to cover the ball even when a shot that has absolutely no chance of making it into the goal goes flying by. The Xbox version is marginally better looking than the GameCube and PlayStation 2 versions, but the game still looks fairly similar to its predecessor. The player models are quite detailed, especially the faces, which look a little more realistic than in previous FIFA games. The player animation is also incredibly good, with each movement flowing seamlessly into another. All the stadiums in the game look excellent, and much of that has to do with the lively crowd, the swaying of various flags, and the fireworks that are occasionally set off. There's also plenty of detail on the sidelines, with officials running up and down the field with the flow of the game. Unfortunately, the freestyle control scheme is pretty restrictive. The sound is probably the only really disappointing aspect of FIFA 2003's overall presentation. It's not that the commentary is horrible, but it basically sounds the same as the last two FIFA games with a play-by-play and color commentator that don't really interact with each other all that much and it just doesn't sound all that natural. However, the stadium noise is incredible with some having team specific chants and there's even some chatter down on the field--it's definitely worth turning down the commentary just so you soak in the atmosphere of a professional soccer match. Soccer fans really can't go wrong with FIFA 2003. The gameplay is excellent and probably comes closer to mimicking the actual sport than any other soccer game currently available on the Xbox. Of course, the simulation aspects may turn off those looking for a faster-paced game, and even the game's arcade mode, which features a faster-paced game with fewer rules, requires some strategy and punishes haphazard play. Still, anyone craving for realistic soccer action should definitely pick up FIFA 2003. Obviously, passing plays an important role here, and thankfully, it can be quite easy to have a precise passing game in FIFA 2003 just as long as you aren't careless. Computer controlled players like to stand in the passing lanes of players that are up the field, so they'll usually intercept the ball if you try to push it past them. Lob passes or even crosses can be a useful tactic in these types of situations, especially when they're close to the goal, but it can be difficult to perform one properly if a defender is directly on the player attempting to make the pass. Since the strength of the cross (indicated by a meter below the player's name) is determined by how long you wait to tap the lob pass button a second time, you essentially give the defender more time to react if you want to kick the ball across the field. But if performed correctly, a cross can result in a variety of different actions ranging from headers and bicycle kicks, to players chesting the ball down, getting it on the ground, and then taking the shot. Passing hasn't changed dramatically, but EA Sports has made some changes to the corner and penalty kick system. Instead of just a gigantic arrow determining where the ball lands on a corner or penalty kick, FIFA 2003 uses a new system where accuracy depends on your ability to get a small cursor to fall in the green area of a new kick accuracy meter. The direction that the kick will take is directly related to where you hit the ball, and you can choose to hit any portion of the ball by moving the right analog stick around the ball icon that appears at the bottom of the screen. This might seem like a straightforward idea, but it can actually take some time before you fully understand the mechanics and discover accuracy and kick placement combinations that work well in particular situations. Shooting remains virtually unchanged, but it seems the accuracy has been tweaked so that a shot on goal doesn't always mean it will magically come anywhere near the goal. The juking system on the offensive side of the ball has also changed with the inclusion of the freestyle control system. Theoretically, this system is supposed to give you more control over your ball fakes and generally bring you closer into the game, but it'll be quite some time before that actually happens, The problem with the freestyle control in FIFA is that it just isn't all that free--so many moves depend on what your player is doing at the time that he'll end up doing nothing because you didn't use the correct directional combination for that situation. It's also depends on which foot he's using to take control of the ball, so there's a lot of a little things that you need to pay attention to. After a while, you'll start to get a feel for a few of the different moves that you can execute using freestyle, but there's no question that it's not even remotely as free flowing or smooth as the freestyle controls used in NBA Live. On the defensive side of the ball, there aren't quite as many overall changes. You can perform the standard slide tackle, which usually results in a foul if you're not careful, as well as a challenge that simply entails that you run up to a player with the ball attempt to take it away from him. Goalie AI is generally very good and will rarely make any mistakes that the goalies in the actual sport don't make. The keeper will run out to grab or even challenge the ball if no other offensive players are in the vicinity. He'll punch out lobs or crosses, and quickly reach out his hand to cover the ball even when a shot that has absolutely no chance of making it into the goal goes flying by. The Xbox version is marginally better looking than the GameCube and PlayStation 2 versions, but the game still looks fairly similar to its predecessor. The player models are quite detailed, especially the faces, which look a little more realistic than in previous FIFA games. The player animation is also incredibly good, with each movement flowing seamlessly into another. All the stadiums in the game look excellent, and much of that has to do with the lively crowd, the swaying of various flags, and the fireworks that are occasionally set off. There's also plenty of detail on the sidelines, with officials running up and down the field with the flow of the game. The sound is probably the only really disappointing aspect of FIFA 2003's overall presentation. It's not that the commentary is horrible, but it basically sounds the same as the last two FIFA games with a play-by-play and color commentator that don't really interact with each other all that much and it just doesn't sound all that natural. However, the stadium noise is incredible with some having team specific chants and there's even some chatter down on the field--it's definitely worth turning down the commentary just so you soak in the atmosphere of a professional soccer match. Soccer fans really can't go wrong with FIFA 2003. The gameplay is excellent and probably comes closer to mimicking the actual sport than any other soccer game currently available on the Xbox. Of course, the simulation aspects may turn off those looking for a faster-paced game, and even the game's arcade mode, which features a faster-paced game with fewer rules, requires some strategy and punishes haphazard play. Still, anyone craving for realistic soccer action should definitely pick up FIFA 2003."}