{"ref": "https://www.gamespot.com/reviews/toca-race-driver-2-the-ultimate-racing-simulator-r/1900-6093868/", "date": "April 19, 2004", "game_name": "TOCA Race Driver 2: The Ultimate Racing Simulator", "text": "TOCA Race Driver 2, Codemasters' follow-up to 2002's Pro Race Driver, claims to be ~the ultimate racing simulator.~ That's a pretty lofty goal. The Xbox has plenty of quality racing games to compete with, such as Project Gotham Racing 2, Rallisport Challenge, and even Codemasters' other budget racing gem, Colin McRae Rally 04. However, brazen proclamations and moderate shortcomings aside, TOCA Race Driver 2 is still a fine all-around racing title that features more than its share of race types and available tracks, as well as a deep and engaging career mode. Codemasters' follow-up to Pro Race Driver features more types of racing than any other racing title in recent memory. TOCA Race Driver 2 is all about variety. Rarely has there ever been a game that brings so many types of races to the table as this one does. You can choose from a bevy of different race types and concordant cars, including stock cars, rallies, Super Trucks, street racing, Formula One cars, Land Rovers, and so on. There are 15 different varieties of races in all, each of which is actually represented quite well, both visually and gameplay-wise. TOCA Race Driver 2 also features a huge roster of more than 50 different worldwide race tracks, ranging from the Texas Motor Speedway to Pikes Peak, to Brands Hatch, and more. Every track is represented, in addition to the game's race types, and serious race fans should find each track immediately recognizable. The racing mechanics in TOCA Race Driver 2 are primarily geared toward the more-realistic ilk of racers. Each type of car handles uniquely and feels pretty accurate. Slideouts happen precisely when they should, and wrecking your car adversely affects your ability to race in several different ways. Blowing a tire will obviously kill your ability to steer properly, and thrashing your gearbox affects your acceleration and speed quite a bit. The only real complaint about the gameplay stems from the game's physics model, which is a little unreliable in certain situations. Though wrecking into other cars is generally not advised, it's too easy to simply use other cars as padding when sliding around corners. Bumping into the side of an opposing car at the right angle simply prevents you from sliding out at all, and it usually lets you gain a number of spots in a race pretty cheaply. Furthermore, crashes don't always seem to look or feel as they ought to. This is mainly an issue with bigger crashes, specifically in situations where you ought to be rolling your car or otherwise sustaining or inflicting a huge amount of damage, which sometimes doesn't actually happen correctly. These physics issues aren't a huge problem, by any stretch of the imagination, but they're definitely an annoyance. Anyone who played Pro Race Driver will remember its unique career mode, which focused on a young, passionate driver named Ryan McKane. The game's method of storytelling gave you a much more unique and prominent look at the behind-the-scenes elements of racing, and though the story was a little on the ham-fisted side in certain spots, overall it did an excellent job of keeping you captivated throughout. In TOCA Race Driver 2, the same method of career mode has been implemented, though with a completely different type of story. In the game, you play as a nameless rookie driver, who, quite literally, begins in a trial by fire. Upon starting the career mode, you begin midlap during a race, with your mechanic, Scotty, feeding you instructions on your controls. Once the race is over, you are presented with the first of many first-person-perspective cutscenes. As the story progresses, you are approached by an attractive female agent who promises to help bring you to the top of the racing circuit, and much to Scotty's chagrin, you agree to let her help you. The story itself, like its predecessor, can be a bit cheesy at times, but for the most part, the cutscenes are so well directed and written that the few goofy moments become instantly forgivable. TOCA Race Driver 2's career mode puts you on the path of a rookie driver who's looking to come up in the ranks. To advance in the career mode, you'll have to both compete in championships and complete objectives. Objectives vary from championship to championship; some require you only to place at a certain level, and others require you to earn certain amounts of cash prizes. These objectives are usually not too difficult, though often you will find yourself getting frustrated simply because you'll be racing on a new track that you've never experienced before. And, of course, there is no option to take practice laps before a race, so it will require a fair amount of trial and error to learn racetracks, especially when experiencing new car types for the first time. Oddly enough, though, you can participate in qualifying laps outside of the career mode--just not within it. Often you'll be presented with multiple options for championship types, though unfortunately, there are no options for what racing team you might want to race for, nor is there any ability in the game to determine your own position on the starting line, since both are arbitrarily picked for you seemingly at random. On the plus side, the career mode is quite long and should take you a solid eight hours or more to complete the first time around. Outside of the career mode, you can also take part in free races and time trials offline, and you can play online via Xbox Live. Each of these modes lets you choose from any of the game's available championships. However, you can't simply pick a car and track and then race. Championship selection effectively takes care of this for you, because only certain cars are permitted to race on specific tracks. It's a bit of a confusing interface if you're used to the industry-standard method of just picking a car and track, but overall, it isn't that big of a deal. One major bonus to the noncareer modes is that in them, you can make adjustments to your car. Options such as gears, downforce, suspension, ride height, and tires and brake bias can be adjusted to your personal content, which is nice, considering not every track features the same types of terrain. This system isn't quite as intuitive as Colin McRae Rally 04's excellent car-adjustment system, but, ultimately, it serves its purpose just fine. TOCA Race Driver 2 features fully competitive Xbox Live Support for up to 12 racers. From a multiplayer standpoint, TOCA Race Driver 2's Xbox Live component heavily outshines its offline counterpart mainly because it's basically the difference between only two players offline and up to 12 players online. Online, TOCA Race Driver 2 employs an interesting rating system, where you earn rating points based on your standing in a race. You start at 1500 and move up or down depending on how you perform. This rating, in turn, translates into your standing on the leaderboards. The game's online performance is a bit spotty, and some lag was definitely apparent on most any connection type we tried, because opposing cars would jump and skip around and do some funny things during races. However, this lag never affected our ability to race, nor did it ever become detrimental to our standings, so its effect is minimal, at most. Graphically, TOCA Race Driver 2 is an impressive game, though it's not overly so. The car models are a big step up from Pro Race Driver and look very good overall. Each car features quite a bit of shine off its reflective surfaces, and every model is polished up very nicely--to where you won't really notice any jags or imperfections. Damage modeling is also fairly well done, and there are more than plenty of ways to bust up your car, if you're so inclined. The one issue we had with the damage modeling is that the modeling itself doesn't always quite match up to the cause of the damage. So, for instance, getting rear-ended on the right side will sometimes cause weird dents on the left side of the bumper that shouldn't be there, and windows and windshields break with almost reckless abandon. As mentioned before, each of the game's tracks is nicely representative of its real-life counterpart. The tracks and terrain look great, and little touches, like realistic tire skids and pieces of damaged cars that remain on the tracks, add to the realism. Unfortunately, the background environments and crowds don't look nearly as good and are actually decisively unpleasant to look at up close. Granted, these aren't details you'll be paying a lot of attention to while in the throes of a race, but they do stick out at times. TOCA Race Driver 2's cutscenes are also very well produced. Though the models for the characters don't always look especially great, each and every character animates superbly. TOCA 2 isn't the prettiest racing game on the market, but it's still quite pleasing to look at. The voice acting during the cutscenes is equally top-notch, and nowhere will you find a poorly delivered line or a badly acted character. In terms of in-game sound, everything is basically as it should be. Engine sounds are nicely representative of their respective cars, crashes sound pretty good--if a bit ineffective in certain spots--and the little things, like the screech of your tires as you zoom around a corner and the sound you make as you skid off the track and into the gravel--all come together very nicely. There's really no music in the game outside of menu screens, but, thankfully, TOCA Race Driver 2 features in-race custom soundtrack support. Is TOCA Race Driver 2 really ~The Ultimate Racing Simulator~? Not quite, but that doesn't mean that it isn't a great racing game. Lofty aspirations aside, what you will find in TOCA Race Driver 2 is a deep and enjoyable racing title with more racing variety than you're likely to find anywhere else on the market today--and at a meager price tag. To put it simply, if you're a racing fan with an Xbox and $30 to spend, TOCA Race Driver 2 is a great way to go. Outside of the career mode, you can also take part in free races and time trials offline, and you can play online via Xbox Live. Each of these modes lets you choose from any of the game's available championships. However, you can't simply pick a car and track and then race. Championship selection effectively takes care of this for you, because only certain cars are permitted to race on specific tracks. It's a bit of a confusing interface if you're used to the industry-standard method of just picking a car and track, but overall, it isn't that big of a deal. One major bonus to the noncareer modes is that in them, you can make adjustments to your car. Options such as gears, downforce, suspension, ride height, and tires and brake bias can be adjusted to your personal content, which is nice, considering not every track features the same types of terrain. This system isn't quite as intuitive as Colin McRae Rally 04's excellent car-adjustment system, but, ultimately, it serves its purpose just fine. TOCA Race Driver 2 features fully competitive Xbox Live Support for up to 12 racers. From a multiplayer standpoint, TOCA Race Driver 2's Xbox Live component heavily outshines its offline counterpart mainly because it's basically the difference between only two players offline and up to 12 players online. Online, TOCA Race Driver 2 employs an interesting rating system, where you earn rating points based on your standing in a race. You start at 1500 and move up or down depending on how you perform. This rating, in turn, translates into your standing on the leaderboards. The game's online performance is a bit spotty, and some lag was definitely apparent on most any connection type we tried, because opposing cars would jump and skip around and do some funny things during races. However, this lag never affected our ability to race, nor did it ever become detrimental to our standings, so its effect is minimal, at most. Graphically, TOCA Race Driver 2 is an impressive game, though it's not overly so. The car models are a big step up from Pro Race Driver and look very good overall. Each car features quite a bit of shine off its reflective surfaces, and every model is polished up very nicely--to where you won't really notice any jags or imperfections. Damage modeling is also fairly well done, and there are more than plenty of ways to bust up your car, if you're so inclined. The one issue we had with the damage modeling is that the modeling itself doesn't always quite match up to the cause of the damage. So, for instance, getting rear-ended on the right side will sometimes cause weird dents on the left side of the bumper that shouldn't be there, and windows and windshields break with almost reckless abandon. As mentioned before, each of the game's tracks is nicely representative of its real-life counterpart. The tracks and terrain look great, and little touches, like realistic tire skids and pieces of damaged cars that remain on the tracks, add to the realism. Unfortunately, the background environments and crowds don't look nearly as good and are actually decisively unpleasant to look at up close. Granted, these aren't details you'll be paying a lot of attention to while in the throes of a race, but they do stick out at times. TOCA Race Driver 2's cutscenes are also very well produced. Though the models for the characters don't always look especially great, each and every character animates superbly. TOCA 2 isn't the prettiest racing game on the market, but it's still quite pleasing to look at. The voice acting during the cutscenes is equally top-notch, and nowhere will you find a poorly delivered line or a badly acted character. In terms of in-game sound, everything is basically as it should be. Engine sounds are nicely representative of their respective cars, crashes sound pretty good--if a bit ineffective in certain spots--and the little things, like the screech of your tires as you zoom around a corner and the sound you make as you skid off the track and into the gravel--all come together very nicely. There's really no music in the game outside of menu screens, but, thankfully, TOCA Race Driver 2 features in-race custom soundtrack support. Is TOCA Race Driver 2 really ~The Ultimate Racing Simulator~? Not quite, but that doesn't mean that it isn't a great racing game. Lofty aspirations aside, what you will find in TOCA Race Driver 2 is a deep and enjoyable racing title with more racing variety than you're likely to find anywhere else on the market today--and at a meager price tag. To put it simply, if you're a racing fan with an Xbox and $30 to spend, TOCA Race Driver 2 is a great way to go."}