{"ref": "https://www.gamespot.com/reviews/dark-void-review/1900-6246711/", "date": "January 20, 2010", "game_name": "Dark Void", "text": "The idea of a personal, rocket-powered flight device has captured man's imagination for decades, yet the reality of such a device remains depressingly distant. This disparity between dream and reality mirrors the experience of playing Dark Void. There are moments when jetpack flight is joyous, freewheeling fun, such as when you're pulling daring acrobatic maneuvers, dogfighting with UFOs, and boldly zooming around enclosed areas. It gives you a thrilling taste of the speedy promise of a jetpack-powered world, yet this fantasy is too often brought down to earth by the rest of Dark Void's gameplay. The third-person shooter sections are competent but mundane, and there are long sections when fully powered flight isn't possible. Furthermore, the campaign is only about eight hours long, and there are no multiplayer modes to bolster replayability. While there is certainly high-flying fun to be had, the lackluster action hinders Dark Void's lofty ambitions. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Dark Void Video Review Unfortunately, the first few hours of the game don't do much to get your hopes up. After a perfunctory and pointless prologue, you begin the game proper on your own two feet. Dark Void has a sticky cover system, and much of the on-foot shooter action relies on moving from cover to cover. Some of these sections have vertical areas where taking cover means leaning over the edge of a platform or hanging below one and aiming upward. It's a novel twist, and it shakes up your spatial awareness in a way you'll appreciate once you take to the skies. Shooting mechanics are competent, and you can upgrade your run-of-the-mill weapons to make them fairly fun to shoot. Enemies are very resilient to your weapon fire, though a few shots to the head will yield a satisfying explosion, and taking cover is often prudent. However, you can kill most of your enemies with one punch, and this makes sitting behind cover and firing feel slow and ineffective. Dark Void counters this by throwing more enemies at you, and at the end of skirmishes you generally feel a mild sense of satisfaction. Yet the freedom and speed of jetpack flight is an ever-present prospect, casting its shadow over the third-person shooter sections and making them feel a bit like extra padding. Your first flight entails little more than hovering, but it gives you a taste for exploring and using vertical space. Dark Void takes circle-strafing to a whole new level, and shooting down on enemies can increase your chance of scoring headshots. Hovering does leave you more exposed to enemy fire, but it also allows you to zip over to an enemy and deliver a deadly melee attack. There are a number of ways to dispose of your enemies during combat, including some high-impact quick-time events for bigger enemies, and taking advantage of this variety can make the ho-hum combat slightly more engaging. But even though your enemies change, their appearance does not vary significantly. It can start to feel repetitive, despite Dark Void's solid level design. Once you don your fully powered jetpack, things get a lot more interesting. You can launch into the air at any time, and the flailing liftoff animation is a great visualization of the forces that propel you. If you don't aim properly, ground-based takeoffs can send you careening into the earth, but once you get the hang of it you can take to the skies with ease. You can quickly switch between flying, hovering, and landing/free-falling, and there are a number of acrobatic maneuvers you trigger while flying to help you evade or pursue enemies. Alien UFOs are similarly maneuverable. This makes them formidable foes and means that you'll be comfortable in the cockpit when you hijack one. Other vehicles aren't as fun to fly as your jetpack, but they do provide variety to aerial combat. When you punch a robot in the head, bright blue goo comes out. Despite the reasonable amount of versatility in both ground- and air-based combat, the action doesn't mesh into something truly entertaining until you take the initiative. Sure, you could land on that hangar deck, shoot your way into the control room, smash the panel, and then shoot your way back out. You could also fly in there at top speed, bludgeon the guard to death, and then take off, racing back through the narrow opening. It's risky, and you might smack into a wall and die, but if you aren't trying reckless and daring stunts, what's the point of even having a jetpack? Likewise, you could stop to hover every few feet as you make your way down a vertical shaft, or you could just skydive the whole way down and ignite your thrusters when you are seconds from splattering on the ground. Dark Void's best moments are those you create yourself, and the game's chief success is allowing you the freedom to be creative with flight. It's a shame that Dark Void doesn't capitalize on it's high-flying potential as well as it could. And it's even more unfortunate that there's no way to face off with your friends in aerial combat or stunt competitions. Dark Void offers only a single-player campaign, and the story has enough intrigue to keep you mildly interested throughout. The adventure is reasonably long, and once it's over you can replay sections you enjoyed and continue to upgrade your arsenal. Even so, there isn't enough content to justify paying full price for the game. If you are hungry for some jetpack-fueled excitement and willing to spend a few hours to earn it, then Dark Void will reward your determination with some great opportunities. The thrills are in there, but you'll have to handle a lot of baggage if you want to find them."}