{"ref": "https://www.gamespot.com/reviews/soul-reaver-2-review/1900-2821295/", "date": "October 30, 2001", "game_name": "Soul Reaver 2", "text": "The story behind the Soul Reaver series was convoluted before it even began. Set several thousand years after the PlayStation role-playing game Blood Omen: Legacy of Kain, the original Soul Reaver put you in the role of Raziel, a vampiric lieutenant in a medieval fantasy world ruled by the vampire protagonist and namesake of the previous game. With us so far? Good. There's more. After being cast into an abyss and mutilated beyond repair by Kain, Raziel awoke many years later to find himself transformed into a being that now survived on soul energy instead of blood, and he was quickly set after his former master and cohorts by a creature called The Elder God who claimed to have rescued and restored him. Still with us? We're almost done. At Soul Reaver's climax (or anticlimax, as many would call it), Kain eluded your grasp by escaping into the time stream and traveling into the past. In Soul Reaver 2, you travel back in time, as Raziel, to find Kain and discover the answers to all the unanswered questions from the first game. If matters weren't complicated enough already, you now find yourself interacting with characters and plotlines from the original Blood Omen, itself already awash in mysteries, manipulations, and time paradoxes. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Legacy of KainSoul Reaver 2 Video ReviewLuckily, you don't need to fully understand the complete back story of the series at the outset of Soul Reaver 2 to enjoy it. Throughout the game, the narrative alludes to past events, strings you along with partial answers to its long-standing questions, or provides you with new mysteries to try to uncover. If its lush CG cinemas and in-game story sequences don't fully set the stage for the current events, its text-based timeline fills in the necessary gaps.Obviously, the story is a very important element of Soul Reaver 2. In fact, it's your main motivation to progress in the game. With every new environment that you gain access to and with every puzzle that you solve, you're rewarded with a sequence that either moves the story along or gives you a clear understanding of where you need to go next. As complicated as the storyline might sound, it's very compelling and inspires you to push on through much more than the storylines of games such as Eidos' Tomb Raider series. The gameplay in Soul Reaver 2 is similar to that of Tomb Raider, but it's much more interesting. You move columns and blocks, line up mirrors, jump, and climb, much like you would with Lara Croft. But unlike that series' heroine, Raziel has a number of magical and vampiric abilities, such as gliding through the air with his tattered wings and shifting into the spectral realm, a distorted dimension where spirits dwell. The game sends you to the spectral realm automatically if your body incurs too much damage, or you can choose to go there to surmount obstacles found in the material plane. Often, the two realms differ slightly, and a ledge that's too high to jump to in the material realm will be manageable once you shift to the spectral. You're also able to pass through certain barriers such as gates in the spectral realm, a handy trick that you learned back in the original Soul Reaver. This time, your goals are centered on gaining new powers for your magical energy blade, the Soul Reaver, instead of yourself. This is accomplished by powering up one of four elemental forges, a multiple-step process in each case that can only be carried out by someone possessing your unique abilities. To light the dark forge, for instance, you must gain access to areas where you can open apertures and move mirrors to allow sunlight to come in, and then affix a special mirror directly in front of the forge. Once that's done, your reaver is imbued with dark energy, which you use to power devices that let you access new areas. Each of the reaver's forge powers lasts until you either light up another one or shift into the spectral realm. Since some areas require you to shift into the spectral realm to pass through a gate, solving certain puzzles requires you to figure out a way to relight your forge power (which can be done in certain spots once you've gained it) where you need to use it. As you might imagine, there's much more variety in the puzzles in Soul Reaver 2 than in the original, which focused primarily on moving blocks around. Anyone who grew weary of those puzzles will find these to be far more interesting, as they should be, since games such as ICO have recently raised the bar for what we expect from them.The combat in Soul Reaver 2 is different from the original as well. You're now able to summon the Soul Reaver at any time, instead of only when you're at full health. The reaver now also devours all the soul energy from fallen foes, and if you use it too much, it will begin to suck soul energy from you. This makes it a powerful weapon that you'll only use when you absolutely need to, opting for hand-to-hand combat or traditional weapons otherwise. Additionally, you're no longer able to sneak up on enemies and destroy them unawares, which makes encounters less cheap but eliminates the stealth aspect of the series entirely. The combat itself is also generally more involved than in the original. Your enemies are much smarter than before and possess special attacks that you must sidestep. While the foes that you come across early in the game are an annoyance that you can avoid, the creatures that you encounter farther in are challenging and fun to fight. Since story is such an important part of the game, it should come as no surprise that sound plays a large role as well--and Soul Reaver 2 is one of the best sounding games ever made. Its story sequences are voiced by notable voice talents such as Michael Bell, Tony Jay, and Simon Templeman (who reprise their roles of Raziel, the Elder God, and Kain), and they're joined by Star Trek: Deep Space Nine's Rene Auberjonis, who plays a character who is both new and old to the series. The game's soundtrack and sound effects are equally impressive, with music that's of the same caliber as a Danny Elfman film score and sound effects that noticeably differ depending on the dimensions of the room you're in at the time. Soul Reaver 2 is also great to look at. At first, it might simply appear to be a high-resolution version of the original, but as you progress into it, you'll notice many effects that stand out. For instance, each new environment looks distinctly different from the last and is populated by different creatures (such as frogs and fireflies in the swamp and rats in the temple), which helps bring the surroundings to life. The story sequences look fantastic, the lighting and water effects are often stunning, and the elaborate architecture of the first game appears here as well. It's true that the game doesn't look quite as impressive on the PlayStation 2 as Soul Reaver did on the PlayStation, and it doesn't take advantage of the PlayStation 2's hardware as some other games have. But, like the original, it has a near-perfect game camera, and that counts for a lot. Soul Reaver 2 is shorter than the original, and you can beat it in roughly 12 to 14 hours, compared with Soul Reaver's 18 to 20. Attribute some of that to the fact that the game no longer requires you to do as much backtracking. While the original started you in the same place every time you loaded your saved game and required you to teleport to where you were last, much like Banjo-Kazooie, Soul Reaver 2 has save points and checkpoints. The game also lacks any real boss fights, which were a big part of the first Soul Reaver and in some cases took serious time to complete. There are some boss-like final battles in Soul Reaver 2, but, without giving too much away, they don't require any great skill to beat and are, as such, decidedly lackluster. Even beyond those changes, the game is simply shorter. It feels as if the developers had originally planned to have at least one more forge for you to power your reaver with. Whether or not that was actually the case is irrelevant, because its length begs for one more. Soul Reaver 2's DVD-style extra features, which explore the making of the game and even include outtakes from the voice acting sessions, provide some added value, but they don't make up for the game's shorter length entirely. If there were one main criticism of the first Soul Reaver, it was that it left so many questions unanswered in the end. Soul Reaver 2 answers nearly all the questions from the original Soul Reaver, but it raises as many or more. Those who were hoping to find a resolution to the game's storyline will be disappointed to find another cliffhanger ending in this one. Soul Reaver 2, as the saying goes, burns bright, but not as long as you'd like. It's an excellent sequel in that its puzzles and combat have evolved to the next level, and it provides a compelling, if not wholly satisfying, storyline. Unfortunately, if it were only a little longer, it could've counted among the best games available on the system.The combat in Soul Reaver 2 is different from the original as well. You're now able to summon the Soul Reaver at any time, instead of only when you're at full health. The reaver now also devours all the soul energy from fallen foes, and if you use it too much, it will begin to suck soul energy from you. This makes it a powerful weapon that you'll only use when you absolutely need to, opting for hand-to-hand combat or traditional weapons otherwise. Additionally, you're no longer able to sneak up on enemies and destroy them unawares, which makes encounters less cheap but eliminates the stealth aspect of the series entirely. The combat itself is also generally more involved than in the original. Your enemies are much smarter than before and possess special attacks that you must sidestep. While the foes that you come across early in the game are an annoyance that you can avoid, the creatures that you encounter farther in are challenging and fun to fight. Since story is such an important part of the game, it should come as no surprise that sound plays a large role as well--and Soul Reaver 2 is one of the best sounding games ever made. Its story sequences are voiced by notable voice talents such as Michael Bell, Tony Jay, and Simon Templeman (who reprise their roles of Raziel, the Elder God, and Kain), and they're joined by Star Trek: Deep Space Nine's Rene Auberjonis, who plays a character who is both new and old to the series. The game's soundtrack and sound effects are equally impressive, with music that's of the same caliber as a Danny Elfman film score and sound effects that noticeably differ depending on the dimensions of the room you're in at the time. Soul Reaver 2 is also great to look at. At first, it might simply appear to be a high-resolution version of the original, but as you progress into it, you'll notice many effects that stand out. For instance, each new environment looks distinctly different from the last and is populated by different creatures (such as frogs and fireflies in the swamp and rats in the temple), which helps bring the surroundings to life. The story sequences look fantastic, the lighting and water effects are often stunning, and the elaborate architecture of the first game appears here as well. It's true that the game doesn't look quite as impressive on the PlayStation 2 as Soul Reaver did on the PlayStation, and it doesn't take advantage of the PlayStation 2's hardware as some other games have. But, like the original, it has a near-perfect game camera, and that counts for a lot. Soul Reaver 2 is shorter than the original, and you can beat it in roughly 12 to 14 hours, compared with Soul Reaver's 18 to 20. Attribute some of that to the fact that the game no longer requires you to do as much backtracking. While the original started you in the same place every time you loaded your saved game and required you to teleport to where you were last, much like Banjo-Kazooie, Soul Reaver 2 has save points and checkpoints. The game also lacks any real boss fights, which were a big part of the first Soul Reaver and in some cases took serious time to complete. There are some boss-like final battles in Soul Reaver 2, but, without giving too much away, they don't require any great skill to beat and are, as such, decidedly lackluster.Even beyond those changes, the game is simply shorter. It feels as if the developers had originally planned to have at least one more forge for you to power your reaver with. Whether or not that was actually the case is irrelevant, because its length begs for one more. Soul Reaver 2's DVD-style extra features, which explore the making of the game and even include outtakes from the voice acting sessions, provide some added value, but they don't make up for the game's shorter length entirely. If there were one main criticism of the first Soul Reaver, it was that it left so many questions unanswered in the end. Soul Reaver 2 answers nearly all the questions from the original Soul Reaver, but it raises as many or more. Those who were hoping to find a resolution to the game's storyline will be disappointed to find another cliffhanger ending in this one. Soul Reaver 2, as the saying goes, burns bright, but not as long as you'd like. It's an excellent sequel in that its puzzles and combat have evolved to the next level, and it provides a compelling, if not wholly satisfying, storyline. Unfortunately, if it were only a little longer, it could've counted among the best games available on the system."}