{"ref": "https://www.gamespot.com/reviews/transformers-devastation-review/1900-6416275/", "date": "October 10, 2015", "game_name": "Transformers: Devastation", "text": "Nostalgia can be a cruel and misleading force. The part of our brain that wants desperately to relive our past experiences can sometimes trick us into eagerly consuming games and books and movies that ultimately turn out to be crassly recycled garbage merely masquerading as the thing we once loved. Thankfully, Transformers: Devastation spares us this hurtful indignity. Rather than vaguely imitating certain superficial aspects of the franchise, Devastation recaptures its spirit and presents it anew. The overall experience is shallow and imperfect, but it also delivers the frenetic fun of the original cartoon in a way anyone could appreciate, not just the franchise's most devout fans.Even just looking at Devastation feels fun. Its cel-shaded world is steeped in bold, saturated hues that perfectly suit the subject matter. Action sequences explode with bursts of color, characters move with dramatic speed blurs, hard black outlines frame every object the way they might in a comic book--essentially, every loving detail perfectly conveys the vibe of a classic Saturday morning cartoon, as does the story.Megatron has teamed up with the Constructicons, and they're once again wreaking havoc because, like, they're bad and stuff. The narrative is utterly simplistic in a ~Suitable for ages 8 and up~ kind of way, but there's something oddly comforting about its absolute moral clarity. The villains are evil, the good guys are noble, and friendship wins the day. In essence, it's a story for kids that pulled a neat trick by making me feel like a kid again. There's only about as much story content as you'd expect from a three episode arc of the show, but honestly, that's enough. It hits the high notes and cuts all the filler. Fans will be served, and everyone else will be entertained.Besides, the real star here is the flashy, dynamic combat. Devastation was developed by famed Japanese studio PlatinumGames, and it shows. The gameplay evokes shades of Vanquish and Bayonettas flashy, fast-paced, combo-driven madness, only simplified and streamlined. As with most contemporary third-person action games, you have light and heavy attacks that can be strung into combos. At the end of each successfully executed combo, you'll see a button prompt for a powerful ~vehicle attack.~ After that, you can dodge your opponent's next move, triggering a brief moment of slow motion that allows you start the process all over again.Action not only looks and feels satisfying, it also requires a keen sense of timing. Should you fail to activate your vehicle attack in time, your surprisingly formidable opponents won't hesitate to break your rhythm and beat the crap out of you for a while. That risk of failure creates a genuine feeling of reward, on top of the visceral joy and empowerment that comes with pummeling bad guys with effortless style. All this satisfaction is further amplified when you're able to implement other combat techniques like launchers/aerial combos or ranged attacks just to add a little variety. The well of options runs impressively deep--assuming you're willing to hunt around in menus to learn the ins and outs of each character--and like Platinums other games, this depth allows for a welcome sense of creativity and self-directed challenge.Those characters, by the way, are of course the iconic Autobots. Following a relatively short introductory segment, you can choose to play as Optimus Prime, Bumblebee, Sideswipe, Wheeljack, or even goofy robotic T. rex Grimlock during any of the campaign's missions. While these characters aren't hugely distinct, they're far more than simple pallette swaps. Optimus moves a bit slower but deals more damage, Bumblebee has greater agility and can more easily link vehicle attacks--you get the idea. Your character choice won't drastically alter your experience, but you can at least pick the Autobot that best suits your gameplay preferences.You can also outfit each bot with upgradable weapons and technology built from loot you gather in game, although this component may be Devastation's biggest misstep. The idea of combining two weapons to make one stronger weapon is, fundamentally, pretty cool, but the whole system is poorly explained and needlessly convoluted. Worse still, nothing I created ever seemed to impact the gameplay in any material way, rendering both the weapon system and in-game loot hunting pointless. The gameplay remains fun regardless, but a feature that could have really enhanced the experience instead just sits there unused.Unfortunately, Devastation suffers from other issues beyond a half-baked loot system. Some--like slightly overpowered weapons and poorly communicated mission information--are negligible, and to the game's credit, it's generally pretty clever about concealing its flaws. For example, the beautiful characters models and fluid animations make the bland, repetitive environments and ugly textures easier to ignore. The frequent and diverse boss encounters distract from the otherwise rote, unimaginative, and oft-repeated mission objectives.Other issues, however, are unavoidable, the largest of which is a simple lack of depth and content. There's just not that much game here. The campaign lasts roughly six hours and offers only limited replay value. The only additional mode is a series of challenges that mirror the campaign's empty side quests. I mean let's face it, ~Kill all these enemies within this time limit~ is not a real mission. You can rove around the hub city within the campaign, but rather than feeling open, it's a weird maze of tight, samey looking corridors littered with lazy invisible walls. Plus, given the pointlessness of the aforementioned crafting system, there isn't much incentive for exploration.The frequent and diverse boss encounters distract from the otherwise rote, unimaginative, and oft-repeated mission objectives.Still, the thought of simply beating up a bunch of slick-looking robots for a few hours is plenty appealing on its own. Devastation leverages the Transformers license masterfully and delivers tight, satisfying action with incredible flair. Honestly, I had fun just driving around trying to do donuts, and at one point, I randomly picked up a taxi and threw it over a building just for laughs. That's pretty great. And when that perfect rockin' soundtrack kicks in as you face off against Megatron, that's even better."}