{"ref": "https://www.gamespot.com/reviews/naruto-ultimate-ninja-2-review/1900-6172764/", "date": "June 19, 2007", "game_name": "Naruto: Ultimate Ninja 2", "text": "The quality of the Naruto games that Namco Bandai has been cranking out over the past few years hasn't come close to matching the quantity, though last year's Naruto: Ultimate Ninja was the rare exception. The core one-on-one ninja-fighting action favored speed and simplicity over depth, and some distinct graphical theatrics made it a fun, ridiculous game to watch. Twelve months later, Naruto: Ultimate Ninja 2 delivers much the same experience, though the cast of playable characters has been expanded and the story mode streamlined. These changes are sure to be enough to please many Naruto fans, though they might not impress anyone else. The ridiculous chakra attacks are really what makes Naruto: Ultimate Ninja 2 worthwhile. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Naruto: Ultimate Ninja 2 Video Review 1 Hyperkinetic fight sequences between mystically charged ninjas are a defining characteristic of the Naruto anime and manga series, and they're also one of the biggest assets in Naruto: Ultimate Ninja 2. With one button to perform up-close melee combos, one for throwing projectiles, and a rather versatile jump button, it should take a first-timer only a few minutes of fumbling around to get the hang of it. That's not to say there's no nuance to the action; it will take a little practice before you're dashing back and forth across the screen, countering your enemies' counterattacks and performing crazy, acrobatic combo attacks. It's the special chakra attacks, though, that really charge the action in Ultimate Ninja 2. Pulling off one of these attacks, which can take some pretty precise timing, puts the brakes on the regular action and provides a series of severe, dramatic camera angles that look ripped from the pages of a comic book as the attacking character dishes out an involved, protracted attack. The chakra attacks have been updated a little since the first Ultimate Ninja, giving characters new attacks and changing the way the level-three chakra attacks work. Rather than execute a set of random button presses faster than your opponent can, as is still the case with chakra attacks for levels one and two, you now have to mash wildly on a specific button or rapidly spin one of the analog sticks. A meter at the bottom of the screen shows who's currently winning the struggle. The net effect is that you sometimes need endurance more than precision to get the most out of certain chakra attacks. Ultimate Ninja 2 introduces a glut of new characters to play as, nearly doubling the cast of the original, which means there are many more chakra attacks to be seen. While these attacks always look great and give the game a lot of its flair, they sometimes produce a lot of sound and fury without actually dealing much damage. Also, they can go on for quite a while, dragging out the length of a fight. The chakra attacks look great, and the rest of the game isn't too shabby either. Solid cel-shading effects, as well as specific effects such as textured shadowing and the dramatic use of Japanese writing, go a long way in making the game look like a manga come to life. The huge cast of characters animate smoothly, and their attacks really pack a punch. The game sounds as much like the Naruto anime as it looks like the Naruto manga. There's plenty of voice work from the American cast, which is great for authenticity, even if some of the voices are instantly grating. Naruto: Ultimate Ninja 2 consolidates two of the single-player modes from the original into the new ultimate road adventure, which has you playing as several members of the Leaf Village ninja clan as they deal with foes and rivals from all sides. Unlike the scenario mode in the original, which provided just enough context to string the fights together, the story here is much meatier. Still, you'll probably need to have existing Naruto knowledge to be able to make total sense of it. Often, simply beating your enemy isn't enough to advance, and as you progress the victory conditions can become quite demanding and specific. Sometimes you'll have to beat your enemy, perform three level-three chakra attacks, and finish the fight still carrying a level-two chakra charge; other times, you'll be charged with not beating your enemy, running down the clock, and finishing the fight with a certain percentage of your health bar left. The new ultimate road mode gives the single-player game a more cohesive feel. While the various victory conditions can radically change the flow of the gameplay from fight to fight, it can also be frustrating when you've managed to meet five out of the six victory conditions, only to have to do it all over again. The ultimate road feels much more cohesive than the scenario and mission modes from the original Ultimate Ninja; it would seem that you'll be able to blow through the single-player portion of Ultimate Ninja 2 much more quickly. There's still the two-player versus mode to fall back on, but more single-player content would've been appreciated. The expanded cast of characters and the improved story mode in Naruto: Ultimate Ninja 2 will likely be enough to bring back Naruto fans for more. It's not bad for a fluffy, flashy fighting game, but it's still too similar to the original to warrant much attention outside the Naruto fan base."}