{"ref": "https://www.gamespot.com/reviews/sid-meiers-pirates-review/1900-6164936/", "date": "January 29, 2007", "game_name": "Sid Meier's Pirates!", "text": "After triumphantly making the rounds on the PC and the Xbox over the past couple of years, Sid Meier's Pirates! has finally arrived on the PlayStation Portable. It is quite possibly a perfect fit for the platform because the minigame nature of the gameplay is well suited for the PSP and because it is an addictive strategy game that captures all of the charm of being a pirate, but without any of the pesky downsides, such as scurvy. The PSP version of Sid Meier's Pirates! captures much of the charm and addictive gameplay of the excellent PC game. The PSP version is a fairly faithful translation of 2004's hit PC game (which itself was a remake of the classic 1987 original). In Sid Meier's Pirates!, you play as a pirate out for revenge against the evil Spanish nobleman who wronged your family. But the beauty of Sid Meier's Pirates! is that this open-ended strategy game lets you live the glorious life of a swashbuckler your own way. You can pursue the career of a privateer, a treasure hunter, an explorer, or a trader. More often than not, you'll dabble in all those fields at the same time. You'll sail the Spanish Main, trade broadsides with other ships, engage in dashing swordfights, search for buried treasure, sneak into hostile towns, and dance with many a governor's daughter along the way. Your character will age over time, so your ultimate goal is to amass as much fame and fortune as possible before you retire. At that point, your pirate will go into the hall of fame, and you can start all over again. The game's prologue explains how your wealthy merchant family was imprisoned and how you escaped as a young boy. Now, years later, it's up to you to save your family, vanquish the evildoers, and get rich along the way. The first thing you'll do is choose a name for yourself, as well as a specialty, such as swordfighting (which is useful in duels), navigation (which makes you sail a bit faster), or wit and charm (which help your dancing skills). You also select a nation to align yourself with, which determines the ports that are friendly to you, as well as a time period, which affects the starting balance of power in the Caribbean. After that, you'll begin aboard your tiny ship in a great big sea that's alive with commerce and activity. Your first stop will be in port, where you can pick up a letter of marquee from the local governor, which basically gives you the right to sink any ship not flying that nation's flag. You can also swing by the tavern to get the latest gossip (which can reveal useful info, such as the sailing of a treasure ship), purchase a useful item from the mysterious guy in the corner, or hire a bunch of scurvy knaves for your crew. After you check in with the shipwright, who patches up any damage and upgrades various components of your ship, you'll visit the local merchant, where you can provision your ship and purchase or sell trade goods. Living the life of a pirate isn't just sinking ships and digging up treasure. There's also dancing! What makes Sid Meier's Pirates! so compelling is its exquisite pace. There's just so much for you to do when you're sailing around the Caribbean. You're never too far from accomplishing some kind of goal, whether it's finding the final part of an important treasure map or chasing down some dastardly nobleman who wronged your family. This pacing makes it easy to get drawn into the game and even harder to stop playing it. At the heart of the game is the sense that it's essentially a series of enjoyable, fast-paced minigames stitched together. In the span of half an hour, you can easily wage several ship battles, dance with numerous governors' daughters, sneak into an enemy port, and dig up a stash of buried treasure. The PSP version turns out to be much more faithful to the excellent PC game than the 2005 Xbox version because the game seems so natural and effortless on the PSP. The action translates well to the PSP's wide screen, and the controls make it remarkably easy to pick up and play. More importantly, the PSP version isn't plagued with the tedious loading times of the Xbox version. Sailing in and out of port is instantaneous, as is accessing most in-town options, such as the shipwright and tavern. You'll encounter load times only when talking to the governor, dueling, dancing, or hunting for treasure, and even then, the load times are reasonable. When your ship engages in battle, the game zooms in on your immediate patch of ocean (including any nearby landmasses, rocks, and shoals). You have to maneuver into position and then fire broadsides at the enemy. These battles last only a couple of minutes at the most, but there's a great deal of tactical depth to them, particularly at the harder difficulty levels. Not only is the enemy more cunning at harder levels, but you must also factor in the constantly shifting wind, which affects your ship's maneuverability. And to capture a ship, you must use different ammunition, including medium-range chainshot to destroy sails and rigging and short-range grapeshot to whittle down the opposing ship's crew. That last one is the most important because if you try to board a ship, there's a chance you'll have to fight its captain in a duel, triggering the swordfighting minigame. If you defeat the captain, you can capture the ship and sail it into the nearest port, where you can sell it and its cargo for a profit and then pay a visit to the governor for your reward. You may also have the opportunity to dance with his daughter. And if you charm her, she may reward you with a valuable piece of information. You'll then go out to sea to repeat the cycle all over again. When you need to infiltrate a hostile port, you'll encounter the sneaking minigame, which is sort of Pac-Man in reverse. Your goal is to skulk around the mazelike streets of a town, avoiding the town watch. If captured, you'll be thrown into jail, where you'll rot for a few months before they let you go. At the easier difficultly levels, dodging the guards is incredibly easy, but at the harder levels, it's a lot tougher. Thankfully, you have a few moves at your disposal, such as the ability to scale walls, knock out guards from behind, and duck behind bales of hay to hide. The suspense can be high at times, especially when you narrowly weave between several guards. Then there are the turn-based land battles that occur when you try to raid an enemy port or face off against the main bad guy at the end of the rescue-your-family storyline. In these, you have three kinds of units at your command: officers, sailors, and buccaneers. Officers and sailors are melee units, while buccaneers are armed with muskets. In battles, you have to maneuver your units to take advantage of the terrain and try to destroy or demoralize the enemy. You can flank enemies or use the jungle as cover. If you win the battle, not only will you plunder the town, but you'll also have the ability to switch its allegiance, thus earning you points with a particular faction. This is certainly one of the best strategy games that you can get for the PSP, and it'll provide hours of entertainment. The Caribbean of Sid Meier's Pirates! is a colorful place, and the game approaches the subject matter with a light touch. The pirates are charming rogues who like to sing drinking songs, the stuffy army officers are bombastic buffoons, and the ladies are all lovely. In other words, these are the sorts of characters who would feel at home in an Errol Flynn movie or Pirates of the Caribbean. Visually, the PSP version seems a bit spartan because the art style is minimal to keep the frame rate smooth, but the game still feels warm and inviting. The audio effects stumble a bit in the PSP version; you'll certainly notice when music and sound are absent during large stretches of the game. The single-player game is so compelling that it'll engross you for days at a time, but there's not much to be said for multiplayer. The PSP version features multiplayer battle support for up to four. This simply pits your sailing skills against others as you maneuver and fight in a handful of arena levels. Nevertheless, this is still a completely engrossing strategy game that will easily consume countless hours. And it's certainly a game that deserves to be in every PSP library."}