{"ref": "https://www.gamespot.com/reviews/sid-meiers-pirates-review/1900-6128864/", "date": "May 17, 2006", "game_name": "Sid Meier's Pirates!", "text": "The original Sid Meier's Pirates! came out way back in 1987, and it was one of the first big multiplatform games to emerge. Although, in those days, multiplatform meant Commodore, Atari, and the IBM PC. So it wasn't surprising that when Firaxis announced the remake of Pirates last year, it also announced that it was working on both a PC and an Xbox version. The PC remake, which came out late last year, was excellent, and the good news is that, for the most part, the Xbox version is faithful to it, though it does have a fair bit of give and take. The Xbox version has a number of enhancements over the PC version, but on the other hand, it's also missing some of the PC's gameplay elements. Still, that doesn't stop this new Sid Meier's Pirates! from being a wonderfully lighthearted game that boasts an intoxicating blend of strategy and action. Sid Meier's Pirates! is a colorful, lighthearted game about piracy. It's all about high adventure. In Sid Meier's Pirates!, you play as a pirate out for revenge against the evil Spanish nobleman who wronged your family. At least, that's your initial reason for going to sea. The beauty of Sid Meier's Pirates! is that this open-ended strategy game lets you live the glorious life of a swashbuckler your own way. You can pursue the career of a privateer, a treasure hunter, an explorer, or a trader. More often than not, you'll dabble in all those fields at the same time. You'll sail the Spanish Main, trade broadsides with other ships, engage in dashing swordfights, search for buried treasure, sneak into hostile towns, and dance with many a governor's daughter along the way. Your character will age over time, so your ultimate goal is to amass as much fame and fortune as possible before you retire, at which point your pirate will go into the hall of fame and you can start all over again. The game's prologue explains how your wealthy merchant family was imprisoned and how you escaped as a young boy. Now, years later, it's up to you to save your family, vanquish the evildoers, and get rich along the way. The first thing you'll do is choose a name for yourself, as well as a specialty, such as swordfighting (which is useful in duels), navigation (which makes you sail a bit faster), or wit and charm (which help your dancing skills). You also select a nation to align yourself with (this determines which ports are friendly to you), as well as a time period, which affects the starting balance of power in the Caribbean. After choosing these two things, you'll begin in your tiny ship in a great, big sea that's alive with commerce and activity. A nice new addition in the Xbox version includes a very structured, linear path that you can follow, giving the campaign a sense of direction that wasn't in the PC version. Oh, you can still sail around and do your own thing, but it's also easy if you want to get back on the main path of getting revenge on the main bad guy. Sid Meier's Pirates! is remarkably easy to pick up and play, yet that simplicity belies a considerable amount of strategic depth. Your first stop will be in port, where you can pick up a letter of marque from the local governor, which basically gives you the right to sink any ship that's not flying its own nation's flag. You can also swing by the tavern to get the latest gossip (which can reveal useful info, such as the sailing of a treasure ship), purchase a useful item from the mysterious guy in the corner, or hire a bunch of scurvy knaves for your crew. After you check in with the shipwright, who patches up any damage and can upgrade various components of your ship, you'll visit the local merchant, where you can provision your ship and purchase or sell trade goods. When sailing around the Caribbean, you can go anywhere, though you're limited by two constraints. The first is food. You can carry only so much food, and the bigger your crew, the faster your food will disappear. While this doesn't sound like much of a problem, it becomes an issue quickly, as you're in an age when sailing voyages took weeks and even months. Thankfully, you can always pull into a friendly port, or hijack a nearby vessel and commandeer its food. The other constraint is the morale of your men. Your salty crew members expect a fair share of the plunder when the voyage is over, and you'll have to keep them happy by bringing in the income--otherwise they'll start to desert you in droves. Firaxis made some subtle changes to the sailing component of Pirates!, mainly to compensate for the displacement between PC monitors and televisions. Since you can't zoom far out to get a good look at the world like you can in the PC version, there's instead a nice map overlay system that lets you display a semitransparent map over the whole game. Think of the airplane sequences in any of the Indiana Jones movies where you see scenes of a plane in flight over a map of the world at the same time...that's what we're talking about here. Though simple in concept, there's a lot of depth to be found in Pirates!. What makes Sid Meier's Pirates! so compelling, though, is its exquisite pace. There's just so much for you to do when you're sailing about the Caribbean, and you're never too far from accomplishing some kind of goal, whether it's finding the final part of an important treasure map or chasing down some dastardly nobleman who wronged your family. This pacing makes it easy to get drawn into the game and even harder to stop playing (you may well discover yourself looking up from the game and realizing that you've spent the entire night playing). At the heart of the game is the sense that it's essentially a series of enjoyable, fast-paced minigames stitched together. In the span of half an hour, you can easily wage several ship battles, dance with numerous governors' daughters, sneak into an enemy port, and dig up a stash of buried treasure. Pirates! in general is well suited to these kinds of minigames, thanks to the simple control schemes. When your ship engages in battle, the game zooms in on that specific patch of ocean (including any nearby landmasses, rocks, and shoals), and you have to maneuver into position and then fire broadsides at the enemy. These battles last only a couple of minutes at the most, but there's a great deal of tactical depth to them, particularly at the harder difficulty levels. The enemy is more cunning at harder levels, plus you have to factor in the constantly shifting wind, which affects your ship's maneuverability. Ideally, if you're upwind of an opponent (which is called ~having the weather gauge~), you can control the battle. And to capture a ship, you must use different ammunition, including a medium-range chain shot to destroy sails and rigging a short-range grape shot to whittle down the opposing ship's crew. That last one is the most important, because if you try to board a ship there's a chance you'll have to fight its captain in a duel, triggering the swordfighting minigame. If you defeat the captain, you can capture the ship and sail it into the nearest port, where you can sell it and its cargo for a profit and then pay a visit to the governor for your reward. You may also have the opportunity to dance with the governor's daughter, and if you charm her, she may reward you with a valuable piece of information. You'll then go out to sea to repeat the cycle all over again. You can dance if you want to, but be careful of the frame rate stuttering. Perhaps the most difficult minigames involve swordfighting and dancing, due to the fact that they rely on fast reflexes. To keep things simple, swordfights are highly scripted in that they all unfold the same way. During a bar fight, for instance, if you're winning, you'll always knock your opponent off the balcony; if you're losing, he'll always chase you back up the stairs. Push him back far enough and the barmaid will break a bottle over his head, knocking him out. The only thing you have to worry about is timing the right swing at the right moment, and parrying or dodging your opponent's swings. Meanwhile, during a dance, you have to quickly respond to the dance cues that your partner gives you, or else you'll stumble and mess up. While both swordfighting and dancing can be difficult at first, they get much easier once you learn to recognize the patterns. Plus, you can purchase or acquire special items to make both minigames easier, such as a superbly balanced sword that lets you swing faster, or dancing slippers that give you more time to react to a cue. Unfortunately, the Xbox version suffers from some inexplicable frame rate issues when it comes to dancing, and this can make an already-daunting task even more difficult when you're trying to keep rhythm. When you need to infiltrate a hostile port, you'll encounter the sneaking minigame, which is sort of Pac-Man in reverse. And the big news for the Xbox version is that the perspective has changed from a top-down, rat-in-a-maze-like experience to a behind-the-back, third-person perspective, which makes it more challenging, as you can only see what's directly in front of you. Your goal is to skulk around the mazelike streets of a town, avoiding the town watch. If captured, you'll be thrown into jail, where you'll rot for a few months before they let you go. At the easier difficultly levels, dodging the guards is incredibly easy. But at the harder levels, it's a lot tougher. Thankfully, you have a few moves at your disposal, such as the ability to scale walls, knock out guards from behind, and duck behind bales of hay to hide. The suspense can be high at times, especially when you narrowly weave between several guards. Then there are the turn-based land battles that occur when you try to raid an enemy port or face off against the main bad guy at the end of the rescue-your-family storyline. In these, you have three kinds of units at your command: officers, sailors, and buccaneers. Officers and sailors are melee units, while buccaneers are armed with muskets. In battles, you have to maneuver your units to take advantage of the terrain and try to destroy or demoralize the enemy. You can flank enemies or use the jungle as cover. Win the battle, and you will not only plunder the town, but you'll also have the ability to switch its allegiance, thus earning you points with a particular faction. Surprisingly, Firaxis removed the treasure hunt minigame from the Xbox version. In the PC version, when you got a treasure map, you sailed to the area in question, disembarked, and then explored the landscape, trying to match up terrain features to locate the buried stash. However, in the Xbox version, all you need to do is simply make landfall at the general location, and you will automatically recover the treasure if you landed close enough. You'll come up empty, though, if you didn't land in the right spot. The Caribbean of Sid Meier's Pirates! is a colorful place, and the game approaches the subject matter with a light touch. The pirates are charming rogues who like to sing drinking songs, the stuffy army officers are bombastic buffoons, and the ladies are all lovely. In other words, these are the sorts of characters who would feel at home in an Errol Flynn movie or Pirates of the Caribbean. The game has a beautiful art style that's simple, clean, and packed with all sorts of graphical frills. The cotton sails on your ship softly glow in the warm sun, and beneath the glittery ocean water you can see dolphins and porpoises swimming in your ship's wake. The game's audio effects are also lighthearted and soothing, from the sound of water lapping against wooden hulls to the distant crack of cannons firing. Above it all is the wonderful soundtrack, which mixes historical tunes with memorable original themes. It also helps that the characters in Sid Meier's Pirates! speak in a sort of The Sims-like gibberish, which adds to the game's overall charm. Swordfighting can be downright tricky at the hardest difficulty levels. Unlike the PC version, the Xbox version does have some multiplayer in it as well, in the form of up to four-player ship battles that play a lot better than expected. Basically a fast-paced party game, multiplayer lets you and your friends each control a ship as you all battle it out (you can also let the CPU jump into any of the slots). There are only a small number of maps, but in general they're well designed and create the insane type of game in which you're trying to desperately maneuver around a tiny area while dodging cannon fire left and right. You can only play the head-to-head mode on a single Xbox, since the game is only Xbox Live-aware, so the online component is limited to only downloadable content and leaderboards. Nevertheless, this is still a completely engrossing strategy game that will easily consume countless hours. While the average pirate career might last only about 5 to 10 hours, the game offers tons of replay value, as you can play on harder difficulty levels, try out different approaches, and check out different sailing eras. With its engrossing gameplay, impeccable pacing, and charming presentation, Sid Meier's Pirates! has a lot of great things going for it. When your ship engages in battle, the game zooms in on that specific patch of ocean (including any nearby landmasses, rocks, and shoals), and you have to maneuver into position and then fire broadsides at the enemy. These battles last only a couple of minutes at the most, but there's a great deal of tactical depth to them, particularly at the harder difficulty levels. The enemy is more cunning at harder levels, plus you have to factor in the constantly shifting wind, which affects your ship's maneuverability. Ideally, if you're upwind of an opponent (which is called ~having the weather gauge~), you can control the battle. And to capture a ship, you must use different ammunition, including a medium-range chain shot to destroy sails and rigging a short-range grape shot to whittle down the opposing ship's crew. That last one is the most important, because if you try to board a ship there's a chance you'll have to fight its captain in a duel, triggering the swordfighting minigame. If you defeat the captain, you can capture the ship and sail it into the nearest port, where you can sell it and its cargo for a profit and then pay a visit to the governor for your reward. You may also have the opportunity to dance with the governor's daughter, and if you charm her, she may reward you with a valuable piece of information. You'll then go out to sea to repeat the cycle all over again. You can dance if you want to, but be careful of the frame rate stuttering. Perhaps the most difficult minigames involve swordfighting and dancing, due to the fact that they rely on fast reflexes. To keep things simple, swordfights are highly scripted in that they all unfold the same way. During a bar fight, for instance, if you're winning, you'll always knock your opponent off the balcony; if you're losing, he'll always chase you back up the stairs. Push him back far enough and the barmaid will break a bottle over his head, knocking him out. The only thing you have to worry about is timing the right swing at the right moment, and parrying or dodging your opponent's swings. Meanwhile, during a dance, you have to quickly respond to the dance cues that your partner gives you, or else you'll stumble and mess up. While both swordfighting and dancing can be difficult at first, they get much easier once you learn to recognize the patterns. Plus, you can purchase or acquire special items to make both minigames easier, such as a superbly balanced sword that lets you swing faster, or dancing slippers that give you more time to react to a cue. Unfortunately, the Xbox version suffers from some inexplicable frame rate issues when it comes to dancing, and this can make an already-daunting task even more difficult when you're trying to keep rhythm. When you need to infiltrate a hostile port, you'll encounter the sneaking minigame, which is sort of Pac-Man in reverse. And the big news for the Xbox version is that the perspective has changed from a top-down, rat-in-a-maze-like experience to a behind-the-back, third-person perspective, which makes it more challenging, as you can only see what's directly in front of you. Your goal is to skulk around the mazelike streets of a town, avoiding the town watch. If captured, you'll be thrown into jail, where you'll rot for a few months before they let you go. At the easier difficultly levels, dodging the guards is incredibly easy. But at the harder levels, it's a lot tougher. Thankfully, you have a few moves at your disposal, such as the ability to scale walls, knock out guards from behind, and duck behind bales of hay to hide. The suspense can be high at times, especially when you narrowly weave between several guards. Then there are the turn-based land battles that occur when you try to raid an enemy port or face off against the main bad guy at the end of the rescue-your-family storyline. In these, you have three kinds of units at your command: officers, sailors, and buccaneers. Officers and sailors are melee units, while buccaneers are armed with muskets. In battles, you have to maneuver your units to take advantage of the terrain and try to destroy or demoralize the enemy. You can flank enemies or use the jungle as cover. Win the battle, and you will not only plunder the town, but you'll also have the ability to switch its allegiance, thus earning you points with a particular faction. Surprisingly, Firaxis removed the treasure hunt minigame from the Xbox version. In the PC version, when you got a treasure map, you sailed to the area in question, disembarked, and then explored the landscape, trying to match up terrain features to locate the buried stash. However, in the Xbox version, all you need to do is simply make landfall at the general location, and you will automatically recover the treasure if you landed close enough. You'll come up empty, though, if you didn't land in the right spot. The Caribbean of Sid Meier's Pirates! is a colorful place, and the game approaches the subject matter with a light touch. The pirates are charming rogues who like to sing drinking songs, the stuffy army officers are bombastic buffoons, and the ladies are all lovely. In other words, these are the sorts of characters who would feel at home in an Errol Flynn movie or Pirates of the Caribbean. The game has a beautiful art style that's simple, clean, and packed with all sorts of graphical frills. The cotton sails on your ship softly glow in the warm sun, and beneath the glittery ocean water you can see dolphins and porpoises swimming in your ship's wake. The game's audio effects are also lighthearted and soothing, from the sound of water lapping against wooden hulls to the distant crack of cannons firing. Above it all is the wonderful soundtrack, which mixes historical tunes with memorable original themes. It also helps that the characters in Sid Meier's Pirates! speak in a sort of The Sims-like gibberish, which adds to the game's overall charm. Swordfighting can be downright tricky at the hardest difficulty levels. Unlike the PC version, the Xbox version does have some multiplayer in it as well, in the form of up to four-player ship battles that play a lot better than expected. Basically a fast-paced party game, multiplayer lets you and your friends each control a ship as you all battle it out (you can also let the CPU jump into any of the slots). There are only a small number of maps, but in general they're well designed and create the insane type of game in which you're trying to desperately maneuver around a tiny area while dodging cannon fire left and right. You can only play the head-to-head mode on a single Xbox, since the game is only Xbox Live-aware, so the online component is limited to only downloadable content and leaderboards. Nevertheless, this is still a completely engrossing strategy game that will easily consume countless hours. While the average pirate career might last only about 5 to 10 hours, the game offers tons of replay value, as you can play on harder difficulty levels, try out different approaches, and check out different sailing eras. With its engrossing gameplay, impeccable pacing, and charming presentation, Sid Meier's Pirates! has a lot of great things going for it."}