{"ref": "https://www.gamespot.com/reviews/a-kingdom-for-keflings-review/1900-6201387/", "date": "November 21, 2008", "game_name": "A Kingdom for Keflings", "text": "A Kingdom for Keflings is an easily accessible and totally relaxing city-building simulation. Like Cloning Clyde and Eets: Chowdown before it, Keflings is an exemplary display of developer NinjaBee's knack for filling a niche with charming peculiarity. But the amount of micromanagement is likely to scare off a herd of potential players who are looking for punchy dialogue or explosive action--and you should know that Keflings has neither. For the console crowd looking to dig in to the minutiae of a classic PC genre, however, Keflings fuses Zen relaxation and obsessive-compulsive addiction in one of the most accessible Xbox Live Arcade games yet. Handy markers help indicate where you need to put specific building parts. Playing as a hefty giant, you will start off with a mere hamlet and a couple of Keflings and will manually gather resources and build new structures as you attempt to expand the kingdom. There are four colossal characters available to play as, and the option to play as your Xbox Live avatar is a cool alternative. You probably won't want to play with Trevor or Maia when you can work, dance, and smash buildings as your avatar, which fits in to the world's aesthetic design remarkably well. Your objective remains the same regardless of which titanic laborer you choose. Starting with a partially built town square, you'll harvest lumber, mine rocks, sheer sheep, and gather other resources to put toward various structures that are laid out on unlockable blueprints. You'll spend hours chopping away at the various resources, piling them up, and carrying the stacks to their designated shops so they can be used to build new homes, factories, castles, cathedrals, and more. But you won't be doing the work alone. As you assemble houses and fill them with ~love,~ adorably represented by heart-shaped pickups, you'll bring more Keflings to your ever-growing kingdom. Placing these little people next to something that they can interact with earns them a job. They'll work with you to harvest crystals, move minerals, and generally increase your income at a steady clip. It's a great feeling to see dozens of Keflings hustling and bustling about as they aid in the expansion of your empire. There's an immense sense of satisfaction that comes with constructing increasingly complex structures as a character instead of as a cursor--you get a more tangible experience than, say, using a hotkey to build a skyscraper in Sim City or having a trained creature water a field in Black & White. It's a great feeling to successfully expand your Kefling empire at your own pace, doing what you want to, when you want to, without hindrances like enemies, boss fights, or even nasty weather to slow you down. Difficulty has been sacrificed in favor of making Keflings an accessible and stress-free game in an otherwise daunting genre. Instead of having you compete against another force, the game focuses on simply letting you play as you please without any stress. You wont have to defend the town, instead you can just approach the mayor for miniature missions. These objectives (usually something simple, such as ~move 50 planks to the contractor's office~ or ~punt a couple of Keflings to show them who's the boss~) are quick to complete and always wrap up with a worthwhile reward, such as a new axe that allows for speedier lumberjack work or gloves that permit heavier loads to be carried. Similar items can be found scattered around the world for you to find and equip as well, so there's an incentive to explore if you feel the need for a breather. Other times you'll earn stars by erecting significant edifices in order to unlock batches of blueprints with a new layout. It's easy to get caught up in making ~just one more~ design before going to bed, but before you realize it, it has been an hour and a half and you've cranked out three or four more than initially intended. The addictive nature of racking up the right number of resources to create a specific piece and then combining that piece with 14 others to create a cathedral will have you happily forcing yourself to finish every outline you have. Since each structure serves a worthy purpose, such as enhancing the Keflings' work speed, you'll strive to unlock even more goodies that help make your kingdom a prosperous one. In addition to the go-at-your-own-pace gameplay and steady stream of unlockable prizes, the music and art of A Kingdom for Keflings add a lot of appeal. The joyful tunes are relaxing, and the cartoony graphics are oozing with endearing charm. Like the vibrant saturated colors, the mellow acoustic music changes with the four seasons, though some people might find the looping melodies to be irritating during longer play sessions. Regardless, the amiable artistic direction lends itself to accessibility--perfect for a game that never ends and can't be won or lost. And because there is no final boss to conquer, you can expand, decorate, and preen your city to perfection at the rate of your choosing before starting up a brand-new one with your buddies. By the time you've got the goods to build a castle, you'll have one heck of a city. Be proud! The online-only multiplayer is a co-op affair that speeds up the spread of your kingdom as well as the rate at which rewards are earned, so it's just as fulfilling to fashion an expansive world with friends as it is to do it solo. Gameplay is never interrupted when you're online either; new people can seamlessly join in on the oddly compelling fun of working an odd job and can leave on a whim. Hosting power is even reassigned if the game's creator is forced to exit a session. It's easy to be worried about your precious man hours being wasted if a lowly ~griefer~ decides to kick down your work, but the online community is a laid-back bunch who simply enjoy creating. The entertainment in A Kingdom for Keflings doesn't come from high-octane action, as in games like Viva Pinata it comes from seeing the fruits of your labor in full force. Even the work itself is fun, almost like tinkering with Lego blocks; you will align individual pieces to create something cool and will get a sense of satisfaction when a jousting arena or leather shop comes to life. Mayoral assignments, gear upgrades, and new blueprints keep you moving with a purpose and ensure that the game is fresh throughout each hour of every kingdom you construct. A Kingdom for Keflings is a fantastic take on a well-established PC genre, and the omission of impediments allows for soothing, peaceful gameplay and extreme ease of entry for gamers of all ages."}