{"ref": "https://www.gamespot.com/reviews/chibi-robo-zip-lash-review/1900-6416271/", "date": "October 9, 2015", "game_name": "Chibi-Robo! Zip Lash", "text": "Chibi-Robo Zip Lash has the building blocks of a great game, but like a haphazard Jenga tower, it was just a matter of time before it toppled over. It's a competent platforming adventure featuring a cute robot who uses its power cord as a grappling-hook to attack enemies, swing from ceilings, and lasso objects. By picking up certain items, its cord can grow longer, opening the door for complex puzzles that require you to bounce your cable off walls to hit far-off targets. It's not all cord action, though; sometimes Chibi-Robo is dashing on a skateboard, leaping off ramps and dodging obstacles at the last second.Despite being a key part of completing some levels, seeking out extensions for your grappling-hook ultimately feels pointless. It's great at the end of the level when you can toss it into a hallway and watch it bounce here and there, grabbing coins and other collectibles, but it's deflating when it's back to square one at the start of the next level. It would have made for a much more meaningful experience if your tools and abilities progressed over the course of the entire game, and it could have paved the way for more complex levels, too. Unfortunately, it's handled on a level-by-level basis, thus any joy you derive from making progress is short-lived, and you begin every level tackling the most basic of challenges.For most of its adventure, Chibi-Robo is the definition of mundane; you kill slow moving enemies and overcome basic platforming scenarios, collecting items, including literal garbage, such as a discarded coffee cup. Other times, it's candy--real-world candy. While there's nothing inherently awful about seeing brands like Pocky or Dots in a game, Zip Lash fetishizes these products, with NPCs who yearn for specific treats. Upon receipt, they repeat marketing catch-phrases, their favorite commercials, and lists of flavors, just in case you had any doubt that Tootsie-Rolls are the snack for you. There are dozens of these snacks to collect, but by the time you've seen the tenth ~commercial,~ it becomes a non-priority as you search for more worthwhile goals.These garish displays could be forgiven if the rest of Zip Lash offered meaningful substance, but it's a game that's far too easy, with very little in the way of interesting level design. You play through six worlds, set in different locations such as North Africa, the South Pole, and Europe. These window dressings rarely amount to anything of note, with few standout elements. There's some variation in the enemies you face as you travel the world, but not enough to make each location standout in a meaningful way. North America's world does contain some lively and challenging stages, with lots of moving parts and chaotic sequences that effectively communicate the nature of factories during the industrial revolution. It can be fun to move about with your grappling-hook and search for hidden areas, but these joys are fleeting. It doesn't help that Chibi-Robo is a slow-moving character whose actions are sluggish and few. Unlike other Nintendo platformers that thrive on variety, Chibi-Robo's adventure is monotonous.To be fair, Chibi-Robo tries to offer a mix of experiences, but beyond status-quo platforming and grappling, you only find variety in boss fights and vehicle-based levels. The aforementioned skateboarding is fun, but I wish there were more stages that offered the same level of reflex-based challenges. When you're plopped into a submarine that moves achingly slow, or a similarly-paced inflatable balloon, you groan out of frustration the same way you do when driving behind someone going 5 MPH in a 35 MPH zone. Sure, you're doing something different than jumping and swinging, but that doesn't mean much when the activity is aggravating.Boss fights provide some of the best moments in the game, offering a real challenge as you're required to use your grappling-hook in fresh ways in the face of new behaviors and obstacles. The bosses themselves are ornate, exhibiting a level of detail that's rarely seen elsewhere in Zip Lash. These encounters are a breath of fresh air that only magnify the mediocrity of the rest of the game.Chibi-Robo loves to collect, but there's more in the world to find than just candy and trash. Coins, Chibi-Robo children, and medallions await the intrepid explorer, though you won't have to dig deep. Most ~hidden~ items lie near the beaten path and are easy to locate if you look around with the slightest of care. The game toys with the idea of returning to completed levels to seek out collectibles you might have missed, but earning high-marks for finding everything isn't motivation enough to return to unremarkable levels.To make matters worse, Zip Lash features a convoluted world map designed around a mechanic that wastes your time. Rather than moving in a straight path from level to level, you're forced to spin a wheel that determines how many steps you will move along the world's path. This mechanic would make sense if you could hit a high number, end up on the final stage, and quickly complete a world. Zip Lash doesn't work that way--you have to beat all six levels in a world before you can move on to the next, so there's no incentive to aim for anything other than a panel with the number one--the most prevalent panel there is.While you could argue that the spinning wheel makes it tough to revisit levels exactly in the order you wish, you can freely move about the map once you've completed all six levels and beaten the world's boss. Even if you're clumsy, you collect so much currency in the game through casual play that you can always purchase specifically-numbered panels for the wheel to increase your chances of landing on the number you wish. When the wheel disappears after you beat the boss, or you fix the odds to your advantage, you wonder why it ever existed to begin with.These frustrations don't make Zip Lash a bad game, but they prevent it from rising above adequacy. For every promising moment--which are few and far between--there's a commercial for candy, or a series of mini-tasks and menus that drag you back down. Chibi-Robo is a sleepy trip through a forgettable world. Plead with it to go faster, beg it to surprise you with new experiences, but don't be surprised when it answers back with the merits of biting into the center of a Tootsie Pop."}