{"ref": "https://www.gamespot.com/reviews/world-of-warcraft-dragonflight-review-who-says-you-cant-go-home/1900-6418011/", "date": "January 30, 2023", "game_name": "World of Warcraft", "text": "World of Warcraft: Dragonflight is about coming home, in more ways than one. It's a homecoming for the titular Dragonflights of Blizzard's long-running MMORPG, who return to their ancient ancestral home to pick up the pieces and rebuild after thousands of years away. It's also a homecoming for players, who after years of languishing in WoW's unpopular Shadowlands expansion, get to return to Azeroth and all the familiar sights and sounds it holds.Dragonflight, in that regard, is incredibly nostalgic, but not in the way you might expect. Though it without a doubt features the return of fan-favorite characters, monsters, and even gameplay systems, it never feels beholden or shackled by them. Instead, it takes those familiar elements and breathes new life into them. Whether it's the return of talent trees reminiscent of those from the game's earliest expansions, the game's updated user interface, its lack of mandatory activities, or the feeling of adventure the new dragonriding system invokes, Dragonflight miraculously feels both fresh and familiar at the same time. Even if there are some aspects of Dragonflight that could be improved, I can't help but be impressed at how a handful of new ideas, along with major facelifts to some old ones, breathe new life into Blizzard's flagship title.Dragons, as you might expect, are the star of this new expansion. Players ride new, highly customizable Dragon Isles Drakes. The majority of the main campaign's primary characters are dragons. There's even a new dragon race, the Dracthyr, that is only playable as the new dragon-themed spellcasting class, the Evoker. The Dragon Aspects Alexstrasza, Nozdormu, Wrathion, and Kalecgos all play key roles in the game's initial story campaign. To see them all front and center for the first real time since 2010's Cataclysm expansion is part of what makes Dragonflight feel so nostalgic, signaling a return to the high fantasy of Azeroth after nearly two years of the dark, dour, and death-themed settings and characters of Shadowlands.Even if its setting and characters feel familiar, there is no mistaking that Dragonflight brings a modern perspective to Blizzard's nearly 20-year-old MMO. WoW has long been defined by the rivalry between Azeroth's two political superpowers, the Horde and the Alliance. It was just four years ago that a massive war between the two factions nearly tore Azeroth apart in the game's Battle for Azeroth expansion. Dragonflight, however, feels almost entirely removed from the franchise's long history of inter-faction conflict.Part of that is thanks to the story Blizzard is trying to tell in Dragonflight. The expedition to the mystical Dragon Isles, which has only recently reemerged after 10,000 years, is not a race between the Horde and Alliance to see who can colonize it first (as was the case when the two factions discovered the continent of Pandaria back in 2012) but scientific in nature. From the outset, you're told the petty differences between the Horde and Alliance are to be put aside and that violence between the groups will not be tolerated. Adventurers (aka players) are welcome to join the Dragonscale Expedition, which consists of members of both factions, not because their martial prowess is needed to wage war against their longtime rivals, but because all the artisans, scientists, and explorers coming along are bound to need a hand, and some occasional protection, while documenting the many mysteries of the Dragon Isles.Dragonflight's themes of cooperation and exploration also stem from gameplay realities. It was earlier this year that Blizzard tore down the wall between the two factions, at long last allowing friends on different sides of Azeroth's Iron Curtain to group together for dungeons, raids, and more. To play up the idea of a faction war and insist that each and every Horde and Alliance player are mortal enemies, even while players on opposite factions are quite literally fighting side-by-side and talking to one another, would have been absurd. Blizzard, thankfully, didn't go that route, and smartly focused on aspects of WoW that have felt largely absent in recent years, namely its sense of adventure.Dragonriding works miracles in that department. On paper, it doesn't sound like much. The ability to fly in WoW has been around since 2007, after all. But if there was ever a feature introduced specifically for a single expansion that deserves to become a new standard in all expansions moving forward, dragonriding is it. Dragonriding is fast. Very fast. As in, almost three times as fast as the game's fastest non-dragonriding mounts. But even putting aside the obvious speed advantages, it's also remarkably fun. That's because rather than effectively functioning as a passive speed buff, as the game's normal mounts do, dragonriding mounts bring actual gameplay to the table and allow you to interact with the environment in meaningful ways. Diving will help increase your speed. Flying uphill, conversely, can be a struggle. Trying to get to a high-up mountain top? Find a nearby building or uprooted tree to take off from and give yourself a little extra height as you begin your ascent. Flying is no longer just a way to get from point A to point B, but engaging gameplay all its own.You even have abilities while dragonriding, namely a speed boost and an upward surge that helps get you off the ground. You can unlock more later, along with the power to use your abilities more often, from collecting dragonriding glyphs that are scattered throughout each of the four Dragon Isles zones. In a brilliant design choice for a game that has long held players' hands when it comes to questing and exploring its world, these glyphs are not marked on your map. Instead, when one is nearby, the game will alert you, giving you a general idea of where the glyph might be and how far away it is. From there it's up to you to ascend skyward and keep your eyes peeled. These are hardly hidden and can usually be found in high places, but it makes the act of flying through a zone all the more exciting, knowing there are meaningful rewards to be found. Better yet is that all of the glyphs are available for you to find from the moment you acquire your first Dragon Isles Drake within the first hour of the expansion. There is no max level requirement or any kind of barrier keeping you from simply spending the next hour meticulously collecting each glyph and unlocking dragonriding's full potential as soon as possible, if your heart so desires. After numerous expansions of having flying be off limits at the start and needing to be unlocked months later through an assortment of achievements and in-game accomplishments, simply having access to this new form of flying from the get-go does wonders when it comes to exploring the new world Blizzard has created.The one downside to dragonriding is you can occasionally find yourself needing to go uphill, but without the required energy to get high enough into the air to make any meaningful progress. That results in you hoofing it on foot or simply waiting around for your dragonriding stamina meter to recharge. It's not a great feeling, but it's one that thankfully starts to happen less and less often as you discover more glyphs and unlock more dragonriding traits that help to improve the experience. Flying at high speeds passively recharges your stamina, and the ability to do so consistently and more effectively becomes easier as you find more glyphs as well, allowing you to stay skybound for longer and eliminating the need to wait around for your stamina to recharge if you play your cards right.As you work to aid the Dragonscale Expedition and the inhabitants of the Dragon Isles, you'll also help each of the Dragonflights renew their vows as Azeroth's protectors and restore their homelands. This all is happening just as an ancient enemy of the dragons, the intimidatingly-named Raszageth the Storm Eater, looks to forge a new path for dragonkind by essentially destroying everything the Dragon Aspects (and by extension the Titans, who gifted the Dragon Aspects their power) stand for. Villains can make or break a WoW expansion (see Shadowlands' comically disappointing Jailer for a masterclass on how not to make a big bad), so I'm happy to report that Raszageth, over the course of the game's main story campaign, is refreshingly over-the-top and straightforward. While there is some truth behind her reasons for wanting to burn down the established order and she sets up some intriguing mysteries that will no doubt be explored later on in the expansion, she is not some morally gray or misunderstood character. Will she likely be overshadowed by whoever the ultimate baddie of Dragonflight turns out to be to several patches from now? Probably. But for the time being, she's big, she's bad, and she's bold, and it's nice to have a main villain like that coming off of Shadowlands.It was to help defeat Raszageth the first time around that the game's new Dracthyr race were originally created, before being put into a magic-induced coma by none other than Neltharion, the dragon Aspect that would go on to become Deathwing. Now, thousands of years later, the Dracthyr have awoken to a strange new world and must fight to find their place in it. Dracthyr are highly customizable, with both an elf-like ~Visage~ form and a dragon-form to spend hours perfecting in the game's character creator. The Dracthyr even come with a fun racial ability that automatically transforms you in and out of your Visage form depending on whether or not you are in combat. The primary downside to playing a Dracthyr from a visual standpoint is that your equipped gear while in dragon form is largely invisible, with only your shoulders and belt viewable on your character. There is a wide selection of cosmetic armor that can be equipped on your Dracthyr from the character creation screen to counteract this somewhat, but it's a remarkably odd choice (or in all likelihood a technical limitation) to have it so the majority of your gear can't be seen.Though the new Evoker class that is exclusive to the Dracthyr isn't as instantly iconic as the other two hero classes that have been added to WoW over the years, there's no denying the Dracthyr are Warcraft through and through. Some of their abilities, like Strafe and Deep Breath, are directly inspired by WoW's most iconic dragon raid bosses, while the majority of their toolset pulls directly from the various magics associated with each Dragonflight. The DPS-focused Devastation specialization utilizes the potent offensive capabilities of the Red and Blue Dragonflights, while the healing-oriented Preservation specialization takes full advantage of the nature-focused Green Dragonflight and the time-warping magic of the Bronze Dragonflight to keep allies healthy and out of harm's way. As for how they play, they are among the most mobile classes in the game, coming equipped with a built-in slow-fall, multiple movement-speed-enhancing abilities, and even a mini version of dragonriding that they can use at any time, no mount required. In addition to sporting numerous instant-cast spells, they are also the first class to feature what Blizzard has dubbed ~Empowered~ abilities, which is a fancy way of saying you hold down an ability key to charge up an ability, and then let off the key to fire off the ability to devastating effect. These all together make for a class that feels more active than even the Demon Hunter, as you are constantly charging up abilities, casting on the move, darting between friends and foes, and even rewinding time. It's fun and frenetic, and choosing for how long to charge up an Empowered ability and when to release it adds another level of planning and reactivity to each enemy encounter.If you've played any modern-day WoW expansions, you largely know what to expect when it comes to how Dragonflight's campaign is structured. You're ferried from main story quest to main story quest, working your way through each of the game's four new zones before hitting max level, after which you're granted access to things like Heroic dungeons, World Quests, and more. It's a little disappointing that for an expansion so steeped in themes of discovery, the main campaign on your first character is remarkably linear. You must complete the story campaign in The Waking Shores, for example, before unlocking the story campaign for the next zone, the Ohn'ahran Plains, etc.There is no skipping ahead or bouncing between multiple storylines, even though each zone's main story is largely standalone and isn't influenced by the events of the story in any other. You can break off and do side quests in any zone to your heart's content (and you'll likely want to, as Dragonflight's side quests are where many of its best stories and moments can be found), but you'll eventually have to return to the linear, critical path and finish the main story if you want to start progressing your character into the endgame. It's only then that you have the option for subsequent characters of selecting the order in which you'd like to play the main story thanks to the addition of a new Adventure mode, along with the added benefit of being able to tackle various World Quests from the start. It's a welcome feature, but it wasn't that long ago that WoW expansions let players go where they wanted from the get-go. Combined with the independence dragonriding grants you, and it feels like Blizzard missed a major opportunity to inject some much-needed freedom into the game's increasingly on-rails first-playthrough campaign experience.The four zones of the Dragon Isles themselves are a joy to journey through. Each zone is massive and built with verticality in mind in order to accommodate dragonriding, but they critically don't feel empty. Whereas many modern WoW expansions have felt the need to cram as many locations and enemies into its zones as possible, oftentimes to their own detriment, the new Dragon Isles zones feel remarkably open, alive, and lived in. The Azure Span and the Ohn'ahran Plains in particular feel like greatest-hits versions of zones from expansion's past. The Ohn'ahran Plains captures the essence of zones like Nagrand (both versions) and even the Barrens, while the Azure Span is almost like a long-lost Northrend zone, complete with the ever-lovable Tuskarr and music that invokes one of WoW's most beloved zones, Grizzly Hills. The capital city of the Dragon Isles, Valdrakken, is conveniently located high above the rest of the zones. It never gets old leaping off the city's walls on your dragonriding mount, going into a dive, and flying at high-speeds to wherever in the Dragon Isles you want to go. At max level, many of the zones have unique world events that add some great personality to them, like a giant community soup-making event at the Tuskarr village in the Azure Span or a siege to retake an ancient keep belonging to the Black Dragonflight in The Waking Shores. These kinds of events, in addition to being a great way to snag some rewards, help to make the Dragon Isles feel like real places rather than mere quest hubs.Dragonflight feels nostalgic without falling into the common trap of focusing too heavily on what came before. The Azure Span, for example, isn't a carbon copy of any one zone from Northrend. Instead, it's inspired by the past in all the right ways while still standing on its own. The same can be said for WoW's reworked talent tree system, which takes some key inspiration from the iconic talent trees of the game's early expansions but reimagines them in a thoughtfully modern way. At first glance, they can be a little intimidating. Instead of one talent tree for your chosen class and specialization, each specialization now has two trees to contend with. One is shared across the entire class, and focuses more on useful utility like interrupts, movement-enhancing abilities, and survivability. The specialization-specific tree is where you'll get into the real meat of the new system, as you look to create a build for your specialization.The level of freedom the new talent trees offer, especially when compared to the Mists of Pandaria-era talents that simply offered a list of multiple-choice questions, can be overwhelming initially, but each specialization tree is usually structured in a way that sticking primarily to the left, middle, or right of any tree will result in a build that synergizes relatively well. There is, of course, tons of room for more customization and fine-tuning, and I can safely say it's been a long time since I've spent hours simply staring at talents, reading about abilities, and theorycrafting builds like I've done in Dragonflight. Talents can also now be changed and tweaked at nearly any time outside of combat, and dedicated players will want to have multiple builds saved for specific situations, whether it's a particular encounter in a dungeon or a build that focuses more heavily on area-of-effect abilities. Though that kind of depth is likely to turn some players off, the ability to simply look up a guide online and import a talent build directly into the game is a nice convenience for those who don't feel like diving into the nitty-gritty details themselves.The new talent tree system is overall a huge success, with every new level gained and every talent point spent feeling impactful in a way the previous talent system never did. Classes play largely like they have in more recent expansions, with many of the abilities on offer in each talent tree having been pulled directly from sources like Artifacts in Legion and Covenant abilities in Shadowlands. If I do have one complaint about the new talent trees, it's that many abilities that were once baseline across a class, in particular utility-focused abilities, have now become optional in each class's class talent tree. That means when you group with a Paladin, for example, you can no longer be sure that particular Paladin has access to previously class-defining abilities like Blessing of Protection, Devotion Aura, Blessing of Freedom, etc. Even if it's nice to have the option to forgo picking up every possible utility ability offered in the talent trees, in the future I would like to see more of those kinds of spells become part of each class' built-in toolkit, and instead see more new and interesting choices offered in the talent trees.Reputation grinds have long been a part of WoW, and Dragonflight smartly overhauls those too, in a way that somehow both keeps the spirit of the old system intact while also offering something new. Instead of the standard ~Neutral, Friendly, Honored, Revered, Exalted~ reputation format used since the game's creation, Dragonflight uses a Renown system similar to what was seen in Shadowlands. Key faction reputations are now spread out across 25-30 different levels instead of five and require far less reputation to unlock per level, meaning you are more regularly unlocking new rewards. Critically, increasing your Renown level with these factions isn't tied to player power like they were in Shadowlands, and are largely cosmetic in nature, unlocking new transmogrification pieces for your character and customization options for your Dragon Isles Drakes. Leveling them up at your own pace is part of Dragonflight's endgame, with most side quests and world quests rewarding various amounts of reputation. There is unfortunately some key story content locked behind certain Renown ranks that run the risk of making the reputation grind feel more mandatory than it should be. Additionally, those keen on professions will want to push harder than the average player in order to unlock certain crafting recipes through the Renown system. Even with that in mind, the new system is undoubtedly a vast improvement over what has come before.The fact that there is no player power tied to increasing faction Renown gets to another key aspect of what makes Dragonflight feel so refreshing. For over half a decade, WoW players have been living in what has now been coined the ~borrowed power~ or ~Artifact power~ era of Blizzard's MMO. This is an era where progression was not simply tied to finding better gear, but to numerous additional systems that required players to collect specific resources in order to invest and make their character more powerful. These ~AP grinds~ made huge swathes of content, whether it was collecting Soul Ash from Torghast in Shadowlands or completing Island Expeditions for Azerite Power in Battle for Azeroth, feel mandatory, regardless of how fun or interesting those particular activities were. All of that is gone in Dragonflight. It's almost disorienting to hit max level and not be hit over the head with weekly chores and tasks that need to be completed in order to not fall behind. But that disoriented feeling soon gives way to elation over the realization that in Dragonflight's endgame, you can simply do what you want to progress your character, instead of feeling forced to do things you don't. You can do dungeons. You can PvP. You can farm reputation and unlock various cosmetic rewards with the key factions. You can focus on professions. Nothing feels mandatory in Dragonflight when it comes to progressing your character, and that fact feels every bit as liberating as the game's dragonriding.Speaking of professions, Dragonflight has given those a major overhaul as well, adding some much-needed complexity to a system that until now has largely gone untouched from the game's earliest days. There are now crafting-specific stats (which can be further boosted by equipping profession-specific gear and accessories), specializations, item crafting difficulty, multiple ways to improve or fine-tune your crafted gear, and more. It's definitely a little confusing diving into it all for the first time, but even if the exact reasons why a particular piece of crafted gear came out the way it did isn't 100% clear, the basics of the system--i.e. gather specific types of materials and then craft it--are the same as they've always been. There are numerous crafting-focused NPCs that can be talked to who attempt to explain how the new systems work, but I found the information they provided to not be entirely useful or not specific enough to truly help.For those who want to solely focus on professions, doing so seems much more rewarding and viable now. That's partly due to the new work order system, where players can post items they would like to have made and provide certain materials, and which crafters can then fulfill. It's a handy system for when you want a specific item made, and it's even handier for crafters, who no longer need to spam trade chat with their wares or randomly fill the auction house with items that may or may not be wanted in an effort to make some gold. Even if professions aren't your primary focus, it still feels cool to deck out your character in profession gear and specialize in particular aspects of your chosen craft. A miner, for example, may excel at mining a particular kind of ore, or a blacksmith may be able to craft gear for one particular armor slot at a higher item level. Starting out, you won't be able to specialize in more than a few aspects of your profession at once. However, with enough time and dedication, it will eventually be possible to effectively learn all of a profession's specializations. It's still a little too early to tell how professions will shake out over the course of the expansion, but for now it feels like they are more relevant and more engaging than they've ever been for a long time, even if there is a higher learning curve associated with them than before.Blizzard wisely decided to not fill Dragonflight with too many one-off systems and instead focus on core aspects of the game that were overdue for a shake-up. Alongside the game's talent tree revamp and an overhaul for professions, the game's user interface has also undergone a dramatic modernization in Dragonflight. The new UI is still definitively WoW (complete with gryphons, or the for the first time, wyverns, on each side of the primary action bar), but far more subdued and modern-looking. More importantly, the UI is now highly-customizable with the addition of an ~Edit Mode.~ In this mode, nearly every aspect of the UI is able to be resized, moved, or tweaked in some form. It's great to, for the most part, no longer need a long list of fan-made add-ons (goodbye Bagnon and Bartender) and instead be able to customize your UI to your liking with just a few in-game clicks, no addon managers or fansites required. No doubt many players will still want to use some UI-enhancing addons, but it no longer feels mandatory, which is a boon for more casual or first-time players. There are still some aspects of the UI and Edit Mode that could use improvement (why in the world can't I resize the minimap or move the XP bar?), but all-in-all, they are a huge, if overdue, step forward.The bones of Dragonflight at launch are an incredible foundation for Blizzard to build upon. Whether it's the new flow of an endgame freed from mandatory grinds or how it feels to break the speed of sound on dragonback, Blizzard's MMO is currently in the best state it's been in over half a decade. It's worth mentioning how many systems and unlocks are now account-wide in Dragonflight, which should make leveling up alt characters a far more enjoyable, and less time-consuming, experience. Dragonriding will be accessible from the start on all your additional characters once it's unlocked on your first, and dragonriding glyphs found in the world are also shared account-wide. Though you'll still need to grind out Renown on each new character, there are some systems in place to greatly speed up the process if you hit certain milestones on your main, reducing yet another pain point players have had in recent years.But as anyone who has played WoW knows, a great expansion launch is not the be all, end all. Thankfully, Season 1, which was released a few weeks after Dragonflight's launch, delivers. Without the need to farm for additional resources like Soul Ash or Azerite, gearing is incredibly straightforward, allowing players to spend more time doing what they want to do rather than activities they feel forced to do. Dragonflight's new arena mode, Solo Shuffle, has been a blast and a great way for PvP-focused players to gear up (even if the queue times can be rough at times). The new raid boasts some fun and frenetic encounters while setting up the rest of the expansion's story nicely, and the experiment of having the first season's Mythic dungeon roster dip into older expansions (as was the case in Shadowlands Season 4) is a nice change of pace after running every Dragonflight dungeon on Heroic multiple times in the leadup to Season 1's launch. Though there are likely some players who will feel like they've run out of content, I'm of the opinion that having less ~mandatory~ things to do isn't a bad thing. There are always more classes to level up, old content to farm for transmog, or, dare I say it, other games to play. You shouldn't feel like you have to play 12-hours a day, seven-days a week to keep up, and so far Dragonflight has been refreshing in that regard.In general, Blizzard seems to be hitting all the right notes in the weeks following the expansion's release. Balance updates have been more frequent than in the Shadowlands-era, whereas in years past it felt like players would have to wait months for a major patch to deliver balance changes. Updates have come more frequently to various in-game systems too, like improvements to Solo Shuffle to more effectively punish quitters. Blizzard overall seems quicker to respond to feedback, and that can only lead to good things. The future's looking bright too. Blizzard made the unexpected move of releasing an extensive 2023 content roadmap outlining all the updates players can expect over the course of the year, the first of which is arriving on January 24. Major updates in Shadowlands were few and far between, so to see a years-worth of updates laid out so far in advance, with new content slated to arrive every couple months, is breathtaking. If Blizzard can stick to its roadmap and continue to be as responsive to feedback as it has been so far, the next 12 months of WoW will be something special.Only time will tell where Dragonflight will rank in comparison to WoW's eight other expansions, but it makes a powerful first impression, thanks both to its refreshing systems and the quality of its content. Early on in the expansion, you'll likely find a dwarf sitting by his lonesome near the Ruby Life Pools in The Waking Shore, looking out at the landscape beyond. He has a quest to give, but it's not your typical ~go here, collect or kill that~ style of quest. Instead, it's a quest to simply sit, talk, and listen. There is a long delay between each batch of dialogue at first, almost as if the dwarf is thinking carefully about what to say. The dwarf, it turns out, is actually an ancient member of the Red Dragonflight. He's been away from his home for thousands of years and never thought he would have the chance to see it again. As you sit and stare out into the horizon, he opens up to you, sharing painful memories of times long past. He begins to spill his heart and soul, not for your benefit, but for his.Dragonflight is sprinkled with little moments like these that encourage you to take your time and smell the roses, so to speak. Though there are still plenty of collectathons and kill quests to complete, Dragonflight shines when it reminds you of the unique world you're in and invites you to slow down and immerse yourself in it. It's an expansion about remembering where you've come from, yet embracing what comes next. It's about coming home. Considering the quality on display in Dragonflight and all the changes that have been made to improve the core systems of Blizzard's iconic RPG, I have no doubt more than a few lapsed players that had grown tired of what Azeroth had to offer in recent years will be doing just that."}