{"ref": "https://www.gamespot.com/reviews/world-of-warcraft-legion-review/1900-6416527/", "date": "September 28, 2016", "game_name": "World of Warcraft", "text": "More than a decade into World of Warcraft's shelf life, it's fair to say that Blizzard has spent years spinning its wheels narratively, even as it continued to polish the MMO formula the company helped to enshrine. Mists of Pandaria introduced new races tangential to the Horde/Alliance conflict, and Warlords of Draenor was essentially an alternate-history nostalgia trip of the game's real-time strategy roots.But with Legion, Blizzard continues its streak of integrating the best of contemporary MMO mechanical design but also radically alters the balance of power in their world for the first time since 2010's Cataclysm. It's a gamble that pays off.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: World of Warcraft: Legion - Video ReviewLegion finds Azeroth's greatest existential threat making its first return since Burning Crusade. Thanks to the treacherous orc warlock Gul'dan (who lives again thanks to the events of Warlords of Draenor), the titular demonic Legion has been set loose on Azeroth once more. Although the Alliance and the Horde combine forces at the expansion's beginning to turn back the tide of this invasion, their attempts are crushed. You are then tasked with finding the Pillars of Creation--ancient devices created by the Titans, who predate mortal life on Azeroth--which are the only hope of closing the portals to the Twisting Nether.Unless you're invested in almost two decades' worth of Warcraft lore, that all may sound confusing. Although purchasing Legion gives players a free character boost to level 100--the new starting level for the expansion--it's clear that Legion exists for WoW's core player base. It's fortunate, then, that the twists and major emotional beats of Legion will mean something to those players who have been with the game since its early days.Legion starts off with a string of impactful tragedies and doesn't pull any punches from there. Characters you've known since WoW's inception aren't safe. The demonic corruption of the Legion takes major lore heroes from the series' RTS days and turns them into tragic villains. Dragonflights--which have been on the decline since Cataclysm--reach death's door. When hostilities between the Alliance and the Horde heat up again, it happens for extremely personal reasons--and, for once, it doesn't seem like one faction makes an inexplicably idiotic decision that brings new life to their war. By the end of the expansion's basic PvE content, you're given a firsthand look at the mana addiction that ruptured elven society (and invited the Legion to Azeroth in the first place).It's hard to complain about that brevity when the content that gets you there is some of the best-designed world questing that Blizzard has produced to date.Quests are focused and meaningful from the moment you choose your starting zone--Legion comprises four. You can hit the new level cap of 110 after about a week or so of moderate play, but it's hard to complain about that brevity when the content that gets you there is some of the best-designed world questing that Blizzard has produced to date.Legion also includes some of WoW's best non-heroic/non-raid dungeon design in years. Although the game doesn't meet the genre heights set by something like Final Fantasy XIV, even the first dungeons of the expansion require actual coordination and teamwork. The average boss is your simple ~tank 'n' spank,~ but Legion also offers a host of bosses with more complex movesets to manage. There are also a handful of new engagement types, such as guiding the boss between two different energy beams to mitigate attacks or finding runes on the arena floor that heal your character and give them added strength. These dungeons are tied to story progression---as well as some of the best early gear in the game--and weed out the less-competent players.Whether stemming the corruption of the Emerald Dream in Val'sharah, uniting tauren tribes in Highmountain, or battling the resurgent naga in Azsuna, the new zones are built around straightforward goals. You rarely have to question why you have to kill this or collect that, and the sense of busywork that WoW's basic quest design can often engender is thankfully absent. You get to play a part in shaping not just the fight against the Legion, but new societies you discover as well. WoW has a rich lore that isn't always integrated well (or at all) into its direct play, but Legion doesn't have that problem.Legion's new Class Hall system also finds ways to integrate WoW's lore into the game in meaningful ways. Each class (and subclass) has its own artifact weapon, acquired at the beginning of the expansion, that levels as you play. These aren't just random weapons that you get from dungeon bosses--odds are that veteran players are familiar with them from past Warcraft experiences. Players may be forced to head back to Icecrown Citadel to acquire their class weapon, and Demon Hunters get trips to Karazhan and other places of classic WoW import.Legion's new zones are positively gorgeous, working in broad-but-memorable aesthetic strokes.WoW is running on a modified engine that's 12 years old at this point, and while you can tell you're playing a game with graphics not too far removed from the PS2 era, Legion's new zones are positively gorgeous, working in broad-but-memorable aesthetic strokes. The Nordic cliffsides and towering sculptures of Stormheim bring a richness to the zone's hyperbolic Viking fantasy. Val'sharah, a sprawling, overrun forest teeming with life and corruption, is the heart of Azeroth's original World Tree. And Legion's final leveling zone, Suramar, is awash with psychedelic purples and oranges and reds that speak to its place as the heart of the plague currently consuming Azeroth.Legion's new class, the Demon Hunter, doesn't change things too much in terms of the game's traditional Holy Trinity of tank/healer/DPS. It's a melee DPS/tank hybrid, but it adds a wrinkle that almost spoils the allure of the game's other classes. Demon Hunters can double-jump and glide across landscapes, and it gives them such a degree of mobility and agility that all of the other classes feel sluggish and restrained in comparison. Few things in Legion prove to be more satisfying than avoiding a lengthy walk by just leaping off a cliff and diving to a new destination, further solidifying the Demon Hunters' status as WoW's new essential class.The biggest complaint one can make about Legion is that it does so many things so well that it serves to remind you that World of Warcraft is now a mosaic of more than a decade's worth of different design principles. Cataclysm revamped the entire vanilla WoW experience, but players who want to roll alts or start WoW for the first time (and experience it in its entirety) have to play through Burning Crusade and Lich King content, which just aren't half as smartly designed as WoW in its current incarnation. Blizzard keeps getting better at what it does; six expansions in, it shouldn't feel like a chore to get to the game's best content--but it does.With Legion, it's hard to remember when WoW's narrative and questing were ever this strong before. Time will tell if Blizzard will serve up a healthy dose of new content to keep the expansion and game alive (a la Mists or Lich King) or if it will suffer the fate of Warlords of Draenor, but right now (about a month after the expansion's release) Blizzard has proven it can still craft an MMO experience as well as--if not better--than anyone else."}