{"ref": "https://www.gamespot.com/reviews/eve-of-extinction-review/1900-2853587/", "date": "May 17, 2006", "game_name": "EOE: Eve of Extinction", "text": "Video game clichs come in waves. In the days of yore, gamers spent most of their time beating up ninjas, street thugs, and aliens. These days, it's the Big Evil Corporation--not the Insane Tyrant Warlord--that's constantly aiming for world domination. Yuke's has taken the classic beat-'em-up gameplay and mixed it with the evil corporation motif, creating Eve of Extinction, a game with lofty aspirations but only moderate means.It goes like this--the Wisdom Corporation is using a rare metal found only in the lost city of Atlantis and combining it with the souls of human beings to create powerful ~Legacy~ weapons, which it plans to use to rule the world. When Wisdom employee Josh Calloway uncovers this dastardly plot, his girlfriend's soul is stuffed into one of these Legacy weapons, and he is trained to become the ultimate wielder of Legacy weapons. It's a pretty lousy plan, and sure enough, it backfires on them. Josh escapes with his girlfriend, who is now in the form of an orange glowing sword, and takes the Wisdom Corporation head-on in a bid to restore his girlfriend to her nonsword form and stop Wisdom's nefarious plans of world domination.The gameplay in Eve of Extinction is largely derivative, though Yuke's has made some decent decisions on which gameplay elements to borrow. The core gameplay is about the same as in other 3D beat-'em-ups, like Fighting Force or Dynamite Cop. EOE even makes use of the reflex sequences from Dynamite Cop, in which you'll have to quickly respond to an onscreen command to avoid getting pummeled, shot, drowned, and so on. The majority of the weapons you'll wield seem to have been pulled directly from Soul Calibur, the most obvious example being the snake sword, which is identical to Ivy's chain sword. The most unique aspect of EOE's gameplay is the weapon-switching system, which enables you to switch your current weapon midattack, creating longer, flashier, and more damaging combos. It's a gimmick, and little more, but it's a fairly good one at that, and it does a solid job of distracting you from the fact that you're just hitting the same two attack buttons over and over again. The weapon-switching system cannot, however, distract you from the game's dull-witted AI, which greatly diminishes the challenge of EOE. Large groups of enemies will wait patiently while you beat them up one by one, and single enemies will rarely become aware of your presence until you're right on top of them. Boss battles regularly boil down to simple pattern recognition, and even the final boss can be trounced in a few tries.Eve of Extinction is made slightly more challenging, if not inadvertently, by its obtuse camera. The camera has little automation, and it's up to the player to constantly baby-sit it. This would be less of an annoyance if you were given total control over the camera, but all you can do is center the camera directly behind your character, making it a chore to locate enemies who may be standing just off to the side. Camera problems aside, the game generally looks pretty sharp, with well-detailed character models and big, sharp textures everywhere. The character animations are easily the most refined of EOE's visual facets. Every weapon at your disposal comes with a unique set of attack animations, and some of the multiweapon combos are downright stunning. It's a technically proficient game, but EOE's biggest problem is its overall lack of personality. The variety of enemies you'll fight is limited, and none of the character design feels particularly inspired. Though you'll traverse an array of environments through the course of the game, they all feel remarkably similar, and you spend most of your time either fighting generic villains in gray hallways or fighting generic villains in big gray rooms.There are a lot of things in EOE that could have used more time on the development side, but the sound is definitely the most lacking and feels downright unfinished. EOE's score is mostly absent through the course of the game, popping up anticlimactically for boss fights and certain cutscenes. Weapon sound effects and the grunts they inspire are done well enough, but they cut out at random, occasionally leaving you for seconds at a time with no sound at all. The in-game sounds may be flat and sometimes altogether absent, but EOE touts some pretty solid voice acting. Hard-core players will probably recognize a few of the voices in Eve of Extinction, most notably Josh Calloway's voice, which is provided by Cam Clarke, the same man who gave Liquid Snake his vocal chords in Metal Gear Solid. A lot of the material is pretty cheesy, but the well-seasoned cast of voice actors does a decent job of bringing the dialogue to life.With its main story mode clocking in at around five hours, there's little long-term replay value in Eve of Extinction. Once you've beaten the game, you can play around with the unlockable arena battle mode or go through the story mode again with more powerful weapons, but by that point, you'll probably already be bored of beating on the same dozen or so bad guys in the same gray hallways. Eve of Extinction does not represent the finest in 3D beat-'em-up action, nor is it Yuke's best work to date, but if you're desperate for a few hours of distraction with a decent 3D brawler, it'll do."}