{"ref": "https://www.gamespot.com/reviews/new-tales-from-the-borderlands-review-good-stories/1900-6417984/", "date": "October 20, 2022", "game_name": "New Tales from the Borderlands", "text": "New Tales from the Borderlands is a fun pit stop in the space Western of the Borderlands series. Much like its predecessor, Telltale Games' Tales from the Borderlands, this new adventure focuses on an ensemble cast of everyday people, not the superhero-like Vault Hunters of the main series. And in a very similar vein to the first game, New Tales from the Borderlands makes a solid case that the series needs more stories like this one. It's just more interesting to see normal people navigating Borderlands' capitalist hellscape of corporate wars as they approach the ludicrous antics and dystopian lawlessness from a more relatable perspective.The normal people in question are altruistic scientist Anu, her younger adopted brother Octavio, and frozen yogurt shop owner Fran. Anu wants to build a device that can end conflicts nonviolently, much to the chagrin of the weapons manufacturer she works for. Octavio desires respect and fame, seeking an idea for a get-rich start-up business. And Fran desires vengeance upon weapons manufacturer Tediore, whose invasion of the planet of Promethea results in the destruction of her shop. Upon learning the invasion is to acquire a Vault Key and open the Promethean Vault, the trio finds themselves working together to acquire the Vault's treasure before Tediore can claim it, hoping it will be something valuable enough to secure funding for Anu's research and Octavio's dreams, while also depriving Tediore of their goal and netting Fran her revenge.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: New Tales From The Borderlands - First 40 Minutes of GameplayMost of New Tales from the Borderlands has you making dialogue choices for Anu, Octavio, or Fran, or performing some feat via a quick-time event. Your choices can have a range of consequences--strengthening the relationship between two characters, for example--but their primary effect is repercussions on the story. You can't outright avoid the major narrative beats of each chapter, but you can influence how events transpire to color in your own take on the adventure. Fran is always going to be visited by the insurance agent overseeing her claim of the damage to her shop, for instance, but it's entirely up to the choices you made leading up to and during that encounter that determine whether she gets that payout, and shapes how the agent perceives her going forward. This structure does mean that New Tales from the Borderlands can occasionally feel too scripted--especially near the end of episodes when the story has to guide you towards an unavoidable outcome to set up the next story beat--but it works for the most part, injecting enough player agency into the story to create tangible change in pretty much every event.Between all the careful decision-making and timed button-pressing, New Tales from the Borderlands opens up into contained areas where you can explore. In these spaces, you can talk to certain characters, scavenge for money to pay for in-game cosmetics, and accomplish optional objectives. Additionally, as Octavio, you can hack into electronics, and as Anu, you can scan important objects or people to learn more about them. There's not much to these moments beyond solving optional puzzles (like hacking minigames) to accomplish side objectives. They do provide a nice reprieve, though, breaking up the action of the plot to give you a chance to breathe. It helps ensure there are several easily-identifiable moments within each episode where you can pause and take a break if you need or want to.New Tales from the Borderlands opens on a strong note, both in terms of storytelling and humor. It's very clear from the outset that Anu, Octavio, and Fran are not Vault Hunters and are some of the most ill-equipped people to be tackling a venture that's normally handled by women who can bend the fabric of space and time, soldiers who can summon murder mechs, or mutants who can grow stronger by setting themselves on fire. But there's a goofy appeal to each of the protagonists. You can't help but root for these underdogs to somehow, some way succeed. Octavio even grew on me. Is he a tad annoying? Absolutely. But there's a roguish charm to him--I can see why all of his far more competent friends keep him around. He's like that one idiot goofball who everyone loves to make fun of, but also keeps the group dynamic fresh with the occasional wisecrack and is ready to throw down for you at a moment's notice. He's a good guy.And it helps that he has such a strong narrative arc across New Tales from the Borderlands' five episodes, as do Fran and Anu. New Tales from the Borderlands builds its narrative around the three arcs of its main characters and how they are influencing one another. Anu, for example, abhors violence but finds herself put into more and more situations where violence can be a viable solution for dealing with a problem. Fran, meanwhile, is in the midst of mandatory anger management following a traumatic incident where her rage got the better of her, but the intoxicating feeling of succumbing to her fury regularly encourages her to deal with issues with lethal force. Octavio looks up to the two women equally at the start of the game, and how you shape Anu and Fran can impact how he views the necessity of violence, informing how his narrative arc ultimately plays out.Those arcs are full of perilous situations where your actions can result in a hefty body count, which can include the main three characters if you're not too careful. I like the risk of such a system, as it adds a nice narrative weight to every situation. Plus, it encourages me to immediately pick up a game like New Tales from the Borderlands again once the credits roll and see how different decisions can influence the outcome. There are a lot of obvious callbacks to your decisions sprinkled throughout the course of New Tales from the Borderlands' story, especially during Episodes 1, 2, and 5. A few moments in the final hour of the game made me have to pause the action and take a few seconds to think back on how I'd arrived at the current situation, cursing myself for choices I'd made hours prior.My favorite part about New Tales from the Borderlands, however, is how it also leverages mistakes for its narrative. There are some fail-state moments in the game, where making the wrong choice or messing up a quick-time event results in a game over, forcing you to go back to a checkpoint and try again. There are surprisingly few of these, though. Instead, the game largely rewards you for mistakes by injecting fun, optional storylines, keeping the story moving forward.For example, I really enjoy Anu, Octavio, and Fran's ongoing rivalry with a Tediore soldier who's a passionate fan of collecting and battling with Vaultlanders, which are miniatures of the heroes and villains from the Borderlands games. As far as I can tell, the trio can only meet this guy if, when you're going through the sewers in Episode 2, you opt for the party to go for stealth and when Octavio tries sneaking up on the guy beneath a Metal Gear-inspired cardboard box, you accidentally (or purposely) fail and get caught. Doing so draws you into a Vaultlanders battle against the soldier, and if you win he will follow you throughout the rest of the story, popping up in the most outrageous places to battle you again and again in order to reclaim his lost honor. It was my favorite ongoing joke of the entire game, even if the Vaultlander combat minigame he wants to play is repetitive and boring.Even if you don't end up battling the Vaultlander fan, you can still collect the miniatures themselves and find yourself in situations where you battle. The minigame is too simple to really enjoy though, lacking any sense of strategy to make its repetitive turn-based combat compelling. Even if every miniature has its own attack and defense stat, as well as a unique special trait, they all fight in the exact same way: Press the attack button over and over. Doing so allows you to bang your plastic figure against that of your opponents, and whoever runs out of health first, loses. It's so simplistic and easy to get through without suffering any damage or setback, I'm half-convinced that the minigame's inclusion is meant more as a passing joke than a notable part of the gameplay, but either way, it's never a good time.New Tales from the Borderlands does much better with small throwaway minigames elsewhere, like the aforementioned stealth section under a cardboard box, which also incorporates the fixed camera angles, sound effects, and minimap of the Metal Gear games. There's also a boss battle that's stylized as a pixelated turn-based JRPG that's pretty fun too. And that was the big takeaway from my time with New Tales from the Borderlands--the game features callbacks and Easter eggs, but uses them only as framing devices for its casual and silly humor rather than in place of the humor. It helps make the whole experience feel more relatable and fun, which is already a nice leg-up to the stilted and forced humor of Borderlands 3 and Tiny Tina's Wonderlands. There are moments within New Tales from the Borderlands that feel clever, and the humor starts on a fairly high note. It does dip a bit in Episodes 3 and 4, though.Episodes 3 and 4 are notably weaker than the rest of the game. They aren't bad, but both lack the narrative momentum of the other three episodes. After setting the stage for its story and kicking off the mystery surrounding an ancient artifact in the early episodes, New Tales from the Borderlands kind of grinds to a halt in the middle of its storyline, which sees Anu, Octavio, and Fran scramble to pull together a business and encounter several mishaps along the way. All this does is get in the way of setting up the big finale, however. I could have done without Borderlands' take on a Shark Tank-inspired TV show or a segment where Anu tries to acquire a dead body. Neither moment adds much to the story as a whole, besides fleshing out Episodes 3 and 4 so that they match the length of the other three. It felt like the one moment where the episodic nature of the game was actively holding the experience back.The game is saved by a strong conclusion, though. Almost every choice you have to make in that final episode is informed by choices you made in the chapters leading up to it, culminating in a battle against the big bad that can end in substantially different ways. Anu is abruptly thrust into the limelight as the main character in Episode 5, which came as a bit of a surprise to me after the first four episodes did so much to encourage me to think of all three main characters as the protagonists, but I think it works for the better. It's hard to adequately explain without going into too much detail and potentially spoiling how the game ends, but Anu's arc is all about her quest to make the galaxy a safer place and it culminates with what is essentially the trolley problem, an ethical dilemma of the many vs. the few that has existed at the heart of the Borderlands franchise since its beginning. It is a fitting way to conclude New Tales from the Borderlands, which occurs one year after the events of the Borderlands trilogy and pushes into what's presumably a new age for the series.New Tales from the Borderlands manages to accomplish many of the narrative highs of its predecessor by providing a glimpse into how normal, everyday people handle the outrageous going-ons of the Borderlands series. The story is helped along by the narrative arcs of its three main characters, each of which feeds into and builds on one another. The narrative momentum stalls mid-way through the story, but New Tales from the Borderlands manages to finish strong, delivering a charmingly fun space western adventure."}