{"ref": "https://www.gamespot.com/reviews/whirl-tour-review/1900-2898164/", "date": "November 20, 2002", "game_name": "Whirl Tour", "text": "The last game from development house Papaya Studios was Top Gear Dare Devil, a PlayStation 2 driving game that cribbed shamelessly from Sega's outrageous Crazy Taxi series, to poor effect. Whirl Tour, Papaya's sophomore effort, is similar to Top Gear Dare Devil in that it attempts to emulate the mechanics of a popular game, this time Tony Hawk's Pro Skater, and comes up short. Though, to be fair, the overall quality and playability of Whirl Tour is definitely beyond that of Top Gear Dare Devil. The premise of Whirl Tour puts you in the shoes of Wasa B., the roadie for a vaguely edgy rock band called Flipside. In the middle of a set, the band is suddenly and mysteriously sucked into an interdimensional portal, and you feel compelled to grab a nearby scooter and give chase. Beyond its bizarre premise, Whirl Tour is pure Tony Hawk's Pro Skater, or more specifically, pure Tony Hawk's Pro Skater 2. You'll start each level with a three-minute timer, during which you'll try to complete as many of the objectives as you can. Most of the objectives are pretty standard tasks--reaching a high-score goal, performing a specific trick in a specific area, destroying five objects, collecting three other objects, triggering a piece of the level that will invariably alter some of the level geometry, among other objectives--and completing enough of these objectives will unlock the next level. Each level also is the home of two resident enemies that you must seek out and defeat, which is done by running into them repeatedly while performing a trick, and completing this goal has the added bonus of unlocking a special hidden area in the level. Another unique twist in Whirl Tour is the plentiful power-ups that litter the game, which can have the short-term effect of drastically improving your jumping, balancing, or spinning abilities. With an arsenal of standard Tony Hawk grab, grind, manual, and flip tricks to aid you in completing the goals, Whirl Tour will feel incredibly familiar to action sports veterans, but there are some kinks. The game's eight different levels vary wildly in theme, from a medieval castle to a modern theme park to a mythical city in the sky, but the level objectives remain exactly the same from level to level, and this repetitive goal structure definitely detracts from the game's long-term appeal. And though your scooter is generally far more forgiving than your average skateboard, letting you land vert and grind tricks sideways without any repercussions, your ability to grind ledges can be inconsistent. When you take out one of the level's five destroyable objects, the camera lingers on the object for a few seconds, showing the results of your destruction, but the action keeps moving, which means that you're basically moving blind. Your scooter will also catch a weird, invisible edge from time to time, erratically changing your direction or knocking you off your scooter altogether. There's just a little bit too much weirdness here, and Whirl Tour most definitely could have benefited from some more fine-tuning. The graphics in Whirl Tour aren't terribly impressive. The game doesn't look bad per se; it's simply adequate. The level geometry makes each environment feel more like a themed skate park than an actual place, and though they appear relatively small at first glance, each level contains a surprising number of hidden areas. Your character is pretty modestly rendered, your different trick animations don't feel very smooth, and none of your tricks look particularly distinctive. The differences between the PlayStation 2 and GameCube versions of Whirl Tour are completely nominal--the textures in the PlayStation 2 version look a little clearer, and the GameCube version has less aliasing The in-game sound is pretty unremarkable, but the diverse and rather listenable licensed soundtrack compensates a bit for the otherwise drab sounds of wheels on concrete, grinding, and the occasional exclamation. It's got problems, but Whirl Tour is actually a fairly decent Tony Hawk's Pro Skater clone, putting a different face on a familiar game. But, unfortunately for Papaya Studios, there's really no shortage of games that pull off the action sports formula with more style and enthusiasm, making Whirl Tour somewhat irrelevant. If, for some reason, the real-world motif of the average action sports game is what's keeping you from plunging into the genre, Whirl Tour may serve as a reasonable introduction, but that's about it."}