{"ref": "https://www.gamespot.com/reviews/action-henk-review/1900-6416134/", "date": "May 14, 2015", "game_name": "Action Henk", "text": "Editor's note: Due to a discrepancy between the version of the game used for review and the full release, the original Action Henk review contained some inaccuracies. It has been updated to reflect the game as released. - KV, 5/14/2015I like to think of Action Henk as a retired action hero on the fast road to retaking the spotlight. A distended beer belly hanging far over his belt, Henk is a small action figure sporting a wide, yet determined grin separating an impressive set of 1980s sideburns. Its hard not to root for him as he slides down ramps and over obstacles at a relentless velocity. This side-scrolling, speed-running platformer has the rush of a classic Sonic the Hedgehog game, without any of the irritating sidekicks.Henk sets off on his pint-sized adventure sprinting along plastic orange ramps--like the ones for toy cars--and wooden blocks, leaping and butt-sliding toward the goal line--oh yes, butt-sliding. Holding down a button causes Henk to fly (literally) on the seat of his pants. Sliding down inclines builds up speed, and a comet-like trail of flame jets off Henks plastic-molded posterior. You burn through loops and bounce off walls while rushing past checkpoints as you complete the first group of levels, which exist entirely on the floor of a childs bedroom, complete with jumbled clothing drawers, posters, and scattered video game cartridges. But you dont stay stuck in the bedroom for long. Soon, Henk finds himself making tracks on a beach resort, and later swinging through a lush green jungle. Despite his appearance, Henk moves through each level at an energetic pace, all to the tune of a jumping soundtrack. Action Henk is a fast ride and pure speed-running bliss from start to goal. It feels like Sonic in his glory days. Though the kindly faced Henk doesnt quite parallel the blue blurs devil-may-care attitude, he nearly matches the blistering speed with his stride. Many levels last less than a minute, but as you make your way around the track, you notice other pathways and ramps just out of reach. They all lead you to the same point, and yet the promise of more even speed makes the desire to reach them all the more enticing. There are tricks that only experience can teach--for example, hopping just before a declining ramp increases the speed of your butt-slide, rewarding you with more air time than ever before. Soon those other areas become attainable, opening up steeper slides and more death-defying jumps--all of which amounts to gaining even more of that gratifying speed and fewer moments of slowdown.Completing levels nets you medals of bronze, silver, or gold, which are collected to unlock new areas. The setup is similar to that of some mobile games that require a certain number of stars or other related items to unlock gates. But the rules here are not nearly as strict. New sections open up quickly, and unlocking the final section is possible only several of hours after starting. It does make sense: this is a game whose conceit is unrelenting speed, not throwing out road blocks. Because of this playability, I felt myself running through older courses again because I actually wanted to, just for the fun, and not out of any sort of obligation. It cuts down on a lot of the undue stress usually presented by games that make it difficult to unlock new missions. If youre having trouble with any of the levels, you can race against a bronze, silver, or gold ghost, who will show you the way.Though the kindly faced Henk doesnt quite parallel the blue blurs devil-may-care attitude, he nearly matches the blistering speed with his stride.There is still some stress involved. At the end of most sections, you face a tough boss challenge. These races can require a lot of patience and restarts as they test your speed-running skills. The final section missions, however, are the most difficult, and are capped off with a boss challenge that had me wearing down my restart key. Earning a gold medal in every level of a section unlocks a touch bonus mission to collect coins. The medal also unlocks the rainbow medal ghost, as well as the ghost for the top player of the level--both of which are the hardest challenges you can face. The game doesn't suffer much from technical issues; there is minor lag in some levels, but it doesn't stay noticeable for long.Though reaching the final series of levels is possible in only a few hours, there is still a lot of extra content to experience and discover. Completing challenges such as boss battles unlocks new characters and skins--the Sonic costume for Henk with his belly bursting through the front is an easy favorite. Action Henk is a community-focused game, and includes tools to build and share your own custom level and download other users levels from its Steam page. I tried a few of the higher rated tracks, many of which are great. Some send you through enough loops to make your head spin, while others are designed for pure speed. There is also an online racing mode, where you and a group of fellow speed-runners compete for the best time in a level. You are given a time limit and as many restarts as possible to secure the best time and a chance to bop the top runner off the first-place podium. There is one problem with multiplayer, however. Having a text chat box is great, as it gives you the opportunity to talk smack or get running advice form the pros. But because of its size and position on the dark background, it covers too much of the screen. Completing Action Henk will set you back around five hours or so, and you will be at the edge of your seat for most of that time. The speed is immensely satisfying, and earning those precious gold medals after replaying levels feels good. Its a heart-pumping adventure starring action figures and toy tracks, so give yourself a break and come play."}