{"ref": "https://www.gamespot.com/reviews/wartech-senko-no-ronde-review/1900-6171675/", "date": "May 29, 2007", "game_name": "WarTech: Senko no Ronde", "text": "WarTech: Senko no Ronde attempts to straddle the line between a shooter and a fighting game. You have a top-down view of the action and fire off a lot of big shots, as if it was some sort of scrolling shooter, but you're actually shooting at another similarly armed opponent. You're also given life meters and super attacks, as if it was a fighting game. The idea is an interesting one, but it doesn't come together in a very appealing way. To add insult to injury, Ubisoft is trying to charge full price for what is, essentially, a shallow arcade port that would be more at home as a downloadable Xbox Live Arcade release. It's part fighting game, part shooter, all lackluster! There are multiple characters to choose from in Senko no Ronde, each with his or her own set of attacks, as well as basic moves. These include barriers that shield you or a dash move, and they are shared among all characters. Your attacks vary but usually break down into a normal fire and some sort of special attack, such as homing lasers. If you get up close to your opponent, you can attempt to get a melee attack in, which can be powerful. There are plenty of counters to deal with all the incoming enemy fire you'll be seeing as well, such as a barrier move or your barrage technique, which can hurt enemies if you're successful. But for most characters, these moves are also handy for swatting away enemy shots. When all else fails, you can unleash a B.O.S.S. attack, which changes your ship into a huge monstrosity with super attacks, almost as if it was the boss of a more traditional shooter. Learning how and when to use each attack is key to success because most attacks come with reload times that leave you open for attack if you're careless. There are multiple modes to play, including a story mode, which follows after fighting games in that there isn't much of a story. You can also go through the story mode in score-attack mode, which has you playing for a high score. One-on-one versus matches can be played locally or via Xbox Live, though it seems like the only players playing online are expert-level Japanese players who will break you off something rough if you aren't up to the challenge. Senko no Ronde was originally an arcade game in Japan and was released in Japan for the 360 last year, so the Japanese players have had plenty of time to practice. Though very few people seem to be playing it online, overall, as it can be tough to find an opponent. WarTech: Senko no Ronde sounds neat on paper, but in practice, it isn't much fun. Scooting around the arena and popping off shots at your opponent doesn't take much skill, which is usually enough to beat the computer-controlled opponents. The characters are fairly small, though when it zooms in to show a melee attack, you're given an underwhelming look at how plain the different floating robot suits look. The sound is similarly flat, with plenty of basic laser and explosion noises. The characters talk back and forth throughout the battle, which is kind of neat, but it's all in Japanese. Because you'll be too busy fighting to bother reading the subtitles, this makes the whole story mode sort of useless. Above all, the biggest problem facing WarTech: Senko no Ronde is its price. If this were some kind of 800 point Xbox Live Arcade download, or even a $20 retail game, this would be a reasonable though modest game that you might enjoy. But at its current asking price of $59.99, Senko no Ronde is a rip-off, plain and simple."}