{"ref": "https://www.gamespot.com/reviews/driven-review/1900-2859465/", "date": "May 17, 2006", "game_name": "Driven", "text": "Driven is a video game knockoff of the feature film with the same name. Like the motion picture, the game lands Sylvester Stallone in the role of Joe Tanto, a washed-up racing champion turned mentor for Formula One's latest rookie sensation, Jimmy Bly. Tanto's primary task is to rein in Bly's temper, which is no small undertaking thanks to a bitter rivalry with the sport's number-two hotshot, Beau Brandenburg. For the most part, this rivalry serves as an excuse to put angry men behind the wheel of Formula One automobiles and, ultimately, send them rampaging onto city streets at speeds in excess of 200 miles per hour. Although a shoddy premise for a movie--Rat Race, Zoolander, and Black Knight all fared better at the box office--Driven's plot certainly sounds like an amazing idea for a video game. And it is. On the one hand, the game's racing and blocking stages exemplify the teamwork inherent in F1 competition. Just as often as you'll be told to plow headlong into first place, you'll be asked to take second to allow a teammate the checkered flag. On the other hand, chase stages re-create the movie's reckless excitement by carrying you across busy intersections in search of rampaging teammates. Formula One crossed with Tokyo Xtreme Racer--you couldn't ask for a better video game concept. For whatever reason, however, Driven doesn't achieve the potential suggested by such a marriage. It is a playable and intricate racer, but it is perhaps too intricate for its own good. Steering is basic. The analog stick steers the car, and the R button accelerates, while the amount of overall thrust depends on how hard you press the R button. There is no manual shifting option, so gear changes are always automatic. Good driving results in a state known as ~the zone,~ where your top speed and cornering elevate to optimal levels, and the game provides handling assistance in tighter curves. In contrast to the game's user-friendly controls, however, race physics are overly complex and oftentimes unpredictable. As with any respectable F1 sim, engine braking, drift turns, and drafting are present, but their inclusion in Driven's arcade-style design is frustrating, especially since mastery over all these concepts is required for steady progress. Unless you figure out the exact speed for each specific corner, as well as draft behind front-running opponents, you won't even make it past the fourth race in story mode. Even with a Zen-like mastery of car handling, there is still no telling what will happen on the course itself. At one moment, you can smash into a wall and bounce off just fine, but at other times, a low-speed scuff on the turf will send your car spinning. To add insult to injury, CPU opponents drive an unwavering racing line and aren't hindered by crashes or spinouts. If you bump the CPU into a divider, chances are you'll lose more speed than the computer. Despite its overwhelming difficulty, the GameCube version of Driven isn't as frustrating as the earlier PlayStation 2 release. Steering is smoother, which results in fewer abrupt spinouts and scuffs. At the same time, the effects of being in ~the zone~ are more significant, to the extent that you can actually feel when the CPU is helping you around a corner or away from a potential collision. Damage also accumulates slower in the GameCube version, so you'll spend more time concentrating on the race and less time devouring your three repair opportunities.Graphically, Driven is also better on the GameCube. The overall visuals are identical, but there are a few added niceties--such as dynamic reflections and dust-filled sunbeams--and the frame rate is steady. Courses aren't particularly interesting, but the re-creations of the Arc de Triomphe in Paris and New York's Central Park are exact. Even with 12 cars onscreen at one time, the sense of speed is pervasive. The amount of motion blurring and the frequency of sharp viewpoint changes have also been reduced for the GameCube. This may diminish the game's cinematic style, but it certainly makes it much easier to play. A techno music soundtrack and standard race ambience complete the presentation. The various roaring engines, crashes, and audience clips are about what you'd expect from an average F1 game, but the prerace voice acting gives Driven a smidgen of style. Sylvester Stallone, Greg Proops, and other personalities lend their voices to the game. If you weigh the pros and cons and decide in Driven's favor, there's definitely plenty to do. There are 12 characters to choose from and eight tracks to explore. The single-player modes offer 14 movie-inspired scenarios and a time trial option, as well as three arcade championships. With a second controller, you and a friend can participate in the game's multiplayer offerings, which include competitive and cooperative championships in addition to the standard one-on-one race. Driven is an odd duck of a game--that much is certain. An inviting arcade racer patterned after a lighthearted motion picture, it is also extremely challenging and somewhat frustrating. If you're looking for a racing game that is easy to control but extremely difficult, Driven fits the bill.Graphically, Driven is also better on the GameCube. The overall visuals are identical, but there are a few added niceties--such as dynamic reflections and dust-filled sunbeams--and the frame rate is steady. Courses aren't particularly interesting, but the re-creations of the Arc de Triomphe in Paris and New York's Central Park are exact. Even with 12 cars onscreen at one time, the sense of speed is pervasive. The amount of motion blurring and the frequency of sharp viewpoint changes have also been reduced for the GameCube. This may diminish the game's cinematic style, but it certainly makes it much easier to play. A techno music soundtrack and standard race ambience complete the presentation. The various roaring engines, crashes, and audience clips are about what you'd expect from an average F1 game, but the prerace voice acting gives Driven a smidgen of style. Sylvester Stallone, Greg Proops, and other personalities lend their voices to the game. If you weigh the pros and cons and decide in Driven's favor, there's definitely plenty to do. There are 12 characters to choose from and eight tracks to explore. The single-player modes offer 14 movie-inspired scenarios and a time trial option, as well as three arcade championships. With a second controller, you and a friend can participate in the game's multiplayer offerings, which include competitive and cooperative championships in addition to the standard one-on-one race. Driven is an odd duck of a game--that much is certain. An inviting arcade racer patterned after a lighthearted motion picture, it is also extremely challenging and somewhat frustrating. If you're looking for a racing game that is easy to control but extremely difficult, Driven fits the bill."}