{"ref": "https://www.gamespot.com/reviews/driven-review/1900-2833876/", "date": "May 17, 2006", "game_name": "Driven", "text": "As implausible as the idea sounds, the Game Boy Advance version of Driven is exponentially better than the corresponding PlayStation 2 release. While adhering to the general plotline of the motion picture, Crawfish has fashioned a rather fun, arcade- style racing game around the macho antics of Jimmy Bly, Beau Brandenburg, and the rest of the Driven Championship racing teams. The only similarity between this version of Driven and the abominable PlayStation 2 game is the feature list, which includes the arcade, single race, time trial, story, multiplayer, championship, and bonus challenge modes. In all, there are 12 drivers and 12 courses, although you'll need to be successful in the championship, bonus, and story modes in order to access all 12 stock tracks, as well as unlock a stable of secret vehicles. Anyone familiar with racing games should be accustomed to the majority of these gameplay choices. The only exception is story mode, which gives you a series of movie-inspired goals to achieve--such as first-place finishes, second-place supporting roles, or head-to-head city races. The multiplayer mode also supports single- and multiple-pak link options for up to four players, although you'll need four game cartridges in order to access all the multiplayer course options.Unlike Super Mario Kart or GT Advance, Driven doesn't use sprite scaling or Mode 7 to render its courses. That leaves the game with a somewhat claustrophobic third-person overhead viewpoint that is ultimately an acquired taste. Provided you have the reflexes needed in order to acclimate, Driven's colorful vehicles and speedy track designs make it an impressive example of handheld driving. Fins, farings, and tires blow away from cars with amusing regularity, while the scenery zooms by at breakneck pace. There is minor slowdown when a pack of cars huddles together, but it's infrequent.The real fun of Driven is that it is so easy to play and yet so strategic in execution. Whether you're playing against the CPU or up to three other human opponents, you've got to exercise skillful braking and cornering in order to run along the proper racing line. At the same time, excessive caution can cause you to spin out--or get smeared by passing opponents. The cars can only absorb so much damage before they shatter, which forces you to restart from a standstill at the back of the pack. If you manage to pass a checkpoint with a minimum of deceleration and damage, your ~zone~ indicator will increase. Once it reaches peak, you're ~in the zone,~ and your car will catch fire and its speed and cornering will greatly improve. Abuse this state as much as you can, because it's merely a brief boost. Thankfully, unlike the PlayStation 2 version of Driven, the GBA release doesn't try overcomplicate itself with anything more than the above elements.Crawfish performed a service in not overdoing the simulation aspects that underlie its Game Boy Advance rendition of Driven. In rough form, the majority of blocking tactics and scenarios from the PlayStation 2 version apply to the GBA version as well. Sure, the Sylvester Stallone voice-overs and poorly drawn caricature of Burt Reynolds are missing, but the GBA definitely ended up with the better version of the game."}