{"ref": "https://www.gamespot.com/reviews/metal-gear-acid-review/1900-6120999/", "date": "March 23, 2005", "game_name": "Metal Gear Acid", "text": "Solid Snake has jumped genres for the first time in his illustrious career with Metal Gear Acid, a strategy game that's arriving just in time for the launch of the new PlayStation Portable. Acid supplants the familiar stealth action gameplay of the Metal Gear series with...tactical card-battling? Yes, strange as it may sound, Acid's satisfying turn-based strategy is a great fit for the series' trademark high presentation values and quirky narrative style. It's not an easy game to get into, and if you're just looking for a portable stealth action Metal Gear, you'll need to keep waiting. But once you get a handle on the core mechanics, you'll find in Acid a rewarding game of strategic stealth combat coupled with a quirky, intriguing storyline and some neat points of nostalgia for the longtime Metal Gear fan. Like chocolate to peanut butter, Konami got card-battling in our Metal Gear--and it's darn tasty. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Metal Gear Acid Video Review The game seems to take place outside of the main Metal Gear timeline, since almost all of the characters are new. Poor old Snake is never able to get any rest--he's once again called out of retirement to handle yet another sticky situation, this time by a commander named Roger. Mercenaries have overtaken a corporate-sponsored research facility on the African Lobito Island, demanding that a secret military project called Pythagoras be handed over to them. Their bargaining chip is a hijacked airliner currently circling the skies, which happens to contain a senator who's a front-runner in the upcoming American presidential elections. By the way, this plane has been hijacked by a couple of murderous talking dolls. What the hell is going on here? Snake is sent to infiltrate the Lobito complex to find out. With the help of Roger and a child psychic named Alice, he's tasked with recovering Pythagoras and defeating the mercenary group. In true Metal Gear fashion, this is only the beginning of the tale. The storyline wends its way all over the place throughout the game, pitting multiple factions against each other and introducing new characters at a rapid clip. Some of the players in the story may not be what they seem...even Snake himself. Metal Gear Acid tells its story with still artwork and text, rather than employing the same sort of over-the-top cutscenes and voice that helped make the series famous. At first glance, Acid looks a lot like your typical Metal Gear. You view the action from the familiar top-down perspective, and the levels are set in dimly lit military camps and greenish industrial complexes similar to those in past games. But you can't spend more than 30 seconds with Acid before you realize this is a radically different game. Missions proceed in turn-based fashion, with each level laid out in an invisible grid that you'll navigate one square at a time, killing or sneaking past the enemies that stand between you and your objective. The focus of every Metal Gear game is stealth, and despite its turn-based structure, that focus remains in Acid. This makes tactical planning highly important, as you'll need to map out your strategy in advance to either take out foes or get around them without being caught. Raising the alert doesn't always spell immediate disaster (though sometimes it does), but it will always make your life more difficult. The card-combat engine in Metal Gear Acid is thick with depth and complexity, though it will likely take you a while to figure all of it out. The basics are simple enough: You have a store of cards from which you'll build a deck before each mission, and at any given time you'll have a hand of random cards drawn from that deck that represent the actions you can take during the present turn. Some cards are designated solely as move cards, which (obviously) are used to move you a set number of squares around the board. Use cards represent items that you can use immediately during the turn, and these range from offensive weapons to stat buffs and other peripheral effects. Finally, equip cards can be attached to a finite number of equipment slots so you'll have them ready at all times. For instance, you can equip an AK-47 card and then apply any other weapon card with the same ammo type in order to fire it; meanwhile, while the gun card is equipped, you have a chance of counterattacking with it whenever an enemy hits you. Most use and equip cards can also double as move cards, so you'll never be stuck in a stationary position, waiting for another chance to move to come up in your hand. Snake's latest summons out of retirement sends him to Lobito Island to stop a group of marauding mercenaries. Beyond the basics of using all these card types, the game gets a lot more complex, and unfortunately it could do a better job of explaining its higher-order mechanics. Each card has a numeric ~cost~ that essentially describes how long it will take you to recover from using that action, so ~time~ might have been a better descriptor for this value. The game initially tells you that you fire an equipped weapon by using an ammo card of the same type on that weapon. In reality, there are no ammo cards; what it actually means is that you can apply another weapon card with the same ammo type, which isn't made very clear. The game's manual does a passable job of explaining these mechanics, but the sparse in-game tutorials could have used clearer language to make things more obvious. The saving grace of this lack of explanation is that eventually you'll get the hang of all the systems at work just by beating your head against them, if nothing else. The game is certainly unforgiving, so you'll pass through a trial by fire of sorts as you retry tough missions time and again and get a feel for the mechanics. When everything clicks, finally, you'll be pleased to find out exactly how many different options you have for surpassing obstacles and completing missions. In fact, Acid's dynamic combat model allows for a wealth of strategic possibilities. The further you progress through the game, the more techniques and abilities you'll be familiar with, and the more you'll be up against seemingly insurmountable odds. Acid reveals the depth of its gameplay slowly and evenly over the course of the game, though the basic abilities are immediately obvious. You can switch to an extreme overhead view that lets you scour the entire level and view which squares are in enemies' sight range. As in the series' action games, you can make Snake back up against a wall and knock on it in order to lure an enemy away from his post. When he arrives, he might find a hidden claymore mine waiting for him. Damage values change depending on whether you're in front of, behind, to the side of, or even above enemies, so orientation is a constant consideration to maximize your damage as well as avoid being seen. There's just a lot going on in each mission. Most importantly, a few hours into the game you'll encounter another secret operative named Teliko, and in some of the missions you'll get to control both Snake and Teliko in tandem, which gives you even more opportunities for setting up traps for enemies and getting creative in solutions to tough missions. There are plenty of familiar weapon and character cards for Metal Gear fans to collect. The game is a veritable feast for the diehard Metal Gear nostalgist. All of the weapon cards on offer are taken from past games, from the silenced SOCOM to the PSG-1 sniper rifle. Better yet, there are lots of ~character~ cards that feature the likenesses of everyone from Olga Gurlukovich to Otacon to various iterations of Snake himself. Each of these cards features a unique special ability, and when you invoke that power you get a quick little video of the character from his or her respective game. The ninja card, for instance, deals a sword-slash attack to any visible enemy in the stage, while the Revolver Ocelot card reduces the cost of your gun cards. Even Johnny Sasaki, that gastrically distressed genome soldier from Metal Gear Solid, makes an appearance; his ~diarrhea~ ability comically flushes your current hand, providing a fresh set of cards. Collecting these character cards, as well as better weapon and item cards, forms a lot of Acid's replay value. You'll be able to obtain cards in several ways. Some card packs are scattered around the mission areas, and some are dropped by enemies. Others can be unlocked through superior performance. You're rated at the end of each mission based on your speed, enemies killed, number of times spotted, and so on, and you'll receive specific card bonuses for high rankings. You'll also receive points based on your rank that you can cash in at a card store between missions to obtain still more cards. You can do pretty well simply going through the game with the cards you pick up by default, but completists will have good reason to go back and replay the missions to unlock some of the more esoteric character cards and put together the ultimate deck. The other reason to come back to Metal Gear Acid after you've finished its lengthy story campaign is a new multiplayer mode that didn't appear in the Japanese import. You won't have access to this mode initially; rather, you'll unlock it after you're a few hours into the story. Once it's unlocked, you can connect to another player wirelessly and take control of both Snake and Teliko on a large, VR mission-style level with some competitively focused game mechanics. You'll be competing with each other on several fronts. Some slain enemies drop Pythagoras discs, and the first player to collect three discs will open up four goals in the level, only one of which will grant victory when reached. You'll also subtract from a credits score each time you kill the other player's characters, and once these credits are depleted, you'll win. Finally, if the time runs out, the player with the most discs wins. There's one catch: Non-player character and player enemies are invisible unless you've got them in your sight range, leaving a lot of encounters open to chance. It's nice that the developers have gone back and added this mode to Acid, though only the most diehard fans of the single-player game will be patient enough to play it often. One reason the single-player game flows so well is that you'll spend almost all of your time strategizing and then implementing your tactics--you can fast-forward through the enemies' turns at the touch of a button. In the multiplayer mode, you'll have to wait for both the enemies and the other player to take their turns, leaving you looking at a static view of the game board until it's your turn again. This waiting is to be expected in a synchronous multiplayer mode such as this, but it still gets a little tedious when you can't take a turn for a couple of minutes at a time. Acid may not play like a typical Metal Gear game, but it sure looks like one. As mentioned, the game's battlefields look like they were ripped straight out of Metal Gear Solids 1 and 2--and so do most of the character models, for that matter, especially Snake and the common masked soldiers. The presentation is stylish as befits a Metal Gear game, with lots of snazzy menu graphics and such going on. The graphics aren't without their flaws, though. The frame rate bogs down sometimes when there are a lot of things going on, which slows down the controls and can be frustrating. We'd like to have seen a little more camera control, too. For the most part you can see everything you need to, except in a few multitiered stages where the upper levels can get in the way. On the whole, though, the game's look fits in well with the other games in the series. If it weren't for the whole card-battling thing, you might mistake Acid for the next stealth action Metal Gear. The aural presentation comes across very nicely. All of the weapon cards sound like their counterparts in past games when you use them, and the game's music has an up-tempo feel very similar to what you've heard in MGS 1 and 2. Even the bleeps and dings that accompany your menu choices have a pleasantly unique style to them, which sounds trivial but certainly doesn't hurt. Metal Gear Acid represents a compelling departure for the long-running stealth action series. This game is not for the faint of heart--you will be doing some serious strategizing as the game progresses, and if turn-and grid-based card-battling doesn't sound like your thing, turn back now. But the game has a great storyline and presents complex, rewarding combat scenarios of impressive intensity, which is a feat considering the genre's inherently slow pacing. Even if the multiplayer isn't quite as entertaining, it'll take you a good two dozen hours to get through the story mode, with strong incentive to go back and replay prior missions to uncover more cards and try for a better rank. Acid is a solid package that may not be for everyone, but for the people it's for, the game's got it where it counts. Acid reveals the depth of its gameplay slowly and evenly over the course of the game, though the basic abilities are immediately obvious. You can switch to an extreme overhead view that lets you scour the entire level and view which squares are in enemies' sight range. As in the series' action games, you can make Snake back up against a wall and knock on it in order to lure an enemy away from his post. When he arrives, he might find a hidden claymore mine waiting for him. Damage values change depending on whether you're in front of, behind, to the side of, or even above enemies, so orientation is a constant consideration to maximize your damage as well as avoid being seen. There's just a lot going on in each mission. Most importantly, a few hours into the game you'll encounter another secret operative named Teliko, and in some of the missions you'll get to control both Snake and Teliko in tandem, which gives you even more opportunities for setting up traps for enemies and getting creative in solutions to tough missions. There are plenty of familiar weapon and character cards for Metal Gear fans to collect. The game is a veritable feast for the diehard Metal Gear nostalgist. All of the weapon cards on offer are taken from past games, from the silenced SOCOM to the PSG-1 sniper rifle. Better yet, there are lots of ~character~ cards that feature the likenesses of everyone from Olga Gurlukovich to Otacon to various iterations of Snake himself. Each of these cards features a unique special ability, and when you invoke that power you get a quick little video of the character from his or her respective game. The ninja card, for instance, deals a sword-slash attack to any visible enemy in the stage, while the Revolver Ocelot card reduces the cost of your gun cards. Even Johnny Sasaki, that gastrically distressed genome soldier from Metal Gear Solid, makes an appearance; his ~diarrhea~ ability comically flushes your current hand, providing a fresh set of cards. Collecting these character cards, as well as better weapon and item cards, forms a lot of Acid's replay value. You'll be able to obtain cards in several ways. Some card packs are scattered around the mission areas, and some are dropped by enemies. Others can be unlocked through superior performance. You're rated at the end of each mission based on your speed, enemies killed, number of times spotted, and so on, and you'll receive specific card bonuses for high rankings. You'll also receive points based on your rank that you can cash in at a card store between missions to obtain still more cards. You can do pretty well simply going through the game with the cards you pick up by default, but completists will have good reason to go back and replay the missions to unlock some of the more esoteric character cards and put together the ultimate deck. The other reason to come back to Metal Gear Acid after you've finished its lengthy story campaign is a new multiplayer mode that didn't appear in the Japanese import. You won't have access to this mode initially; rather, you'll unlock it after you're a few hours into the story. Once it's unlocked, you can connect to another player wirelessly and take control of both Snake and Teliko on a large, VR mission-style level with some competitively focused game mechanics. You'll be competing with each other on several fronts. Some slain enemies drop Pythagoras discs, and the first player to collect three discs will open up four goals in the level, only one of which will grant victory when reached. You'll also subtract from a credits score each time you kill the other player's characters, and once these credits are depleted, you'll win. Finally, if the time runs out, the player with the most discs wins. There's one catch: Non-player character and player enemies are invisible unless you've got them in your sight range, leaving a lot of encounters open to chance. It's nice that the developers have gone back and added this mode to Acid, though only the most diehard fans of the single-player game will be patient enough to play it often. One reason the single-player game flows so well is that you'll spend almost all of your time strategizing and then implementing your tactics--you can fast-forward through the enemies' turns at the touch of a button. In the multiplayer mode, you'll have to wait for both the enemies and the other player to take their turns, leaving you looking at a static view of the game board until it's your turn again. This waiting is to be expected in a synchronous multiplayer mode such as this, but it still gets a little tedious when you can't take a turn for a couple of minutes at a time. Acid may not play like a typical Metal Gear game, but it sure looks like one. As mentioned, the game's battlefields look like they were ripped straight out of Metal Gear Solids 1 and 2--and so do most of the character models, for that matter, especially Snake and the common masked soldiers. The presentation is stylish as befits a Metal Gear game, with lots of snazzy menu graphics and such going on. The graphics aren't without their flaws, though. The frame rate bogs down sometimes when there are a lot of things going on, which slows down the controls and can be frustrating. We'd like to have seen a little more camera control, too. For the most part you can see everything you need to, except in a few multitiered stages where the upper levels can get in the way. On the whole, though, the game's look fits in well with the other games in the series. If it weren't for the whole card-battling thing, you might mistake Acid for the next stealth action Metal Gear. The aural presentation comes across very nicely. All of the weapon cards sound like their counterparts in past games when you use them, and the game's music has an up-tempo feel very similar to what you've heard in MGS 1 and 2. Even the bleeps and dings that accompany your menu choices have a pleasantly unique style to them, which sounds trivial but certainly doesn't hurt. Metal Gear Acid represents a compelling departure for the long-running stealth action series. This game is not for the faint of heart--you will be doing some serious strategizing as the game progresses, and if turn-and grid-based card-battling doesn't sound like your thing, turn back now. But the game has a great storyline and presents complex, rewarding combat scenarios of impressive intensity, which is a feat considering the genre's inherently slow pacing. Even if the multiplayer isn't quite as entertaining, it'll take you a good two dozen hours to get through the story mode, with strong incentive to go back and replay prior missions to uncover more cards and try for a better rank. Acid is a solid package that may not be for everyone, but for the people it's for, the game's got it where it counts."}