{"ref": "https://www.gamespot.com/reviews/streets-of-rage-2-review/1900-6171365/", "date": "May 22, 2007", "game_name": "Streets of Rage 2", "text": "While the original Streets of Rage always stood in the shadow of Final Fight, Sega's homegrown beat-'em-up series really came into its own with Streets of Rage 2. Released two years after the original, Streets of Rage 2 offered markedly refined gameplay and improved presentation, both technically and stylistically. This is the game that set the series apart from the numerous other Final Fight imitators. Streets of Rage 2 is one of the best beat-'em-ups money can buy. As with any beat-'em-up worth its salt, Streets of Rage 2 starts off with a kidnapping. The victim this time is Adam, one of the three playable characters from the original Streets of Rage, and the perpetrator is the satisfyingly named Mr. X, the same crime boss who the three of you thought you had defeated. And so, returning characters Axel and Blaze, along with newcomers Max, a wrestler, and Skate, Adam's Rollerbladed younger brother, hit the mean streets to beat their way through hundreds of increasingly bizarre thugs. While there were minor differences between the three playable characters in the original Streets of Rage, they're much more pronounced here. Most significant is that each character has a special attack that effectively replaces the ability to call in an artillery strike from the first game, though even basics like run speed, attack strength, and how grapple moves are executed look and feel unique to each of the four characters. Other additions, such as a lunging attack, improve the overall depth of the game. You certainly end up mashing on the primary attack button more often than not in Streets of Rage 2, but there's enough variety to keep the action satisfying. Part of that variety comes from the enemies you'll face in Streets of Rage 2. While they find strength in numbers, with plenty of generic hoodlums padding out the population, you'll face unique foes like Muay Thai kickboxers, XXL baseball players with a penchant for belly flops, kung fu masters, lunatics with jetpacks, spiked-shoulder-pad-wearing road warriors, and more. The constant stream of street toughs is interrupted regularly with a boss fight, usually against some imposing hulk of a man. Part of what keeps Streets of Rage 2 fresh throughout is that characters from early boss fights often show up later as little more than cannon fodder. It also helps curb some of the enemy repetition that is endemic within most beat-'em-ups. All of this action is great fun to watch as well, thanks to the large, stylishly animated characters and the variety of environments you'll fight your way through, with plenty of background detail and sharp parallax scrolling effects. As good as the game looks and plays, though, it might be the music in Streets of Rage 2 that stands as its greatest asset. Underlined with a cacophony of battle cries, death knells, and the various cracks and thumps of hand-to-hand combat, Yuzo Koshiro's poppy, synthesized soundtrack is consistently catchy and evocative, and helps provide a greater sense of drama and urgency to the action. If the version of Final Fight that was released for the Wii Virtual Console had been the arcade version rather than the hobbled SNES version, it would have been a real toss-up as to whether that or Streets of Rage 2 would be the go-to beat-'em-up. As it stands, though, Streets of Rage 2 wins, hands down. Simply put, Streets of Rage 2 stands on its own as one of the best beat-'em-up experiences you'll have, anywhere."}