{"ref": "https://www.gamespot.com/reviews/nfl-blitz-review/1900-2544917/", "date": "April 28, 2000", "game_name": "NFL Blitz", "text": "The team that brought you NBA Jam and NBA Hangtime has returned to glory with the amazing action-based football game, NFL Blitz. The N64 translation of the game may not look or sound as pretty, but the gameplay is basically the same, and the addition of a play editor can breathe new life into the game on a daily basis.NFL Blitz takes a few liberties with the rules of football. First of all, there are no penalties. You can dive into receivers long before the ball heads their way with no fear of getting called for pass interference. Secondly, it now takes 30 yards to get a first down. Given the scope and speed of this game, getting a first down every ten yards would have been far too easy. Also, the number of players on the field has been reduced to seven. There are 18 offensive plays and nine defensive plays, although the excellent play editor allows you to construct nine new plays from the ground up. Not only can you use these plays at home, but you can take your controller pack to the arcade and plug it into the new game, NFL Blitz '99, and use them there as well.The gameplay moves along very quickly once you've gotten a basic feel for things. The plays are pretty straightforward at first, though there are tons of different things you can do on each play, so as you play the game more and more, you'll figure out more and more little tricks. There are specialty moves like spins, dives, and stiff-arms, all of which will help you to gain more yardage when used appropriately. Pitting two players of the same skill level against each other turns the game into a strategic, nearly chess-like battle, while mismatched players can use the game's CPU assist, which helps people come from behind, keeping games close. Once you get reasonably good at the game, however, you'll want to disable the assistance and be judged purely on your own skill rather than rely on the cheap comebacks that the CPU assist provides.Graphically, the N64 does a good job of rendering Blitz. The game was dropped to 30 frames a second from the arcade's 60, and the field and players are a bit more blocky. The game still runs just about as fast, though, so the gameplay isn't hampered. Also, some of the zoomed-in scenes are plagued by slowdown, which also happened from time to time in the arcade, but here it is a bit more pronounced.The arcade's rampant speech has been cut way back to fit on a cartridge, although the music has remained mostly intact. Also, a lot of the grunts and screams have been cut from the game, so you hear the same scream over and over again. Most people won't notice it, but if you played the arcade version a lot, the repeated scream quickly becomes annoying.While the gameplay is mostly accurate when compared with the arcade versions, there are a few minor differences. Receivers are covered slightly differently, which sometimes results in your defender not being in the right position to break up a play. The computer plays you a bit tougher now, and the CPU assist kicks in much earlier and much harder. If it is down by a couple touchdowns, it will merely march upfield and score, leaving you little or nothing to do about it. Also, it will onside kick the ball to you if it is down late in the game. There are more dropped passes, and a few more fumbles, as well. The play editor allows you to do some pretty cool things, but the computer is easily fooled by the custom plays, and playing them against the computer isn't really an accurate way to test their effectiveness.NFL Blitz is the best football game ever made. Unless you're one of those freaks that requires hyperrealism in every facet of your football games, there's no need to buy any other football game. Even if you're only playing against the CPU, the game is still extremely engrossing and more addictive than biting your nails. Even those of us that despise traditional sports games aren't immune to Blitz's incredible performance."}