{"ref": "https://www.gamespot.com/reviews/luminous-arc-2-review/1900-6201542/", "date": "November 21, 2008", "game_name": "Luminous Arc 2", "text": "Luminous Arc 2 doesn't innovate much on the standard strategy role-playing game formula, but much like mom's home cooking, it fills a comfort niche in this turn-based genre. There's a decent level of difficulty to engage your brain, a smattering of comedy to engage your humor, and a heaping helping of content to engage your free time. While the narrative and characters can be a bit shallow, there's enough gameplay and drive to keep the momentum going throughout your adventures in this world of magic. The protagonist Roland is a mild-mannered lad training as a knight under the tutelage of his father, the legendary warrior Steven. He hones his skills alongside his brother Rasche and their friend Rina, at a time where the world is subject to increasing turmoil. Fiendish monsters are roaming the countryside and a member of the sorcerous order of witches has gone rogue and is stirring up trouble. In the midst of all this excitement, Roland unwittingly becomes the master of the Runic Engine, a device that grafts itself to his hand and enables great power. Now known as a Rune Knight, Roland must work with the witches to protect his friends and his home kingdom of Carnava against the encroaching dangers that threaten them all. Witches and their magic come in very handy, especially when they try on wedding gowns. The story follows a very familiar structure of world salvation, complete with an evil artifact sealed away by powerful sages that just so happens to be freed by a collusion of misguided folk. There's a lot of exposition in between battles and many characters to meet along your journey, each with their own motivations and personality quirks. Many of these people are genuinely amusing, though a lot of them also tend to act like caricatures rather than actual individuals. Because of that, it's a little difficult to get much emotional investment out of the storytelling, especially when coupled with voice acting of uneven quality. The framework of the tale is enough to move matters along, though, and there are numerous little touches, such as chatting with party members after battle, or reading the short stories for the cute creature Kopin, that add interest. Strategy is the real name of the game, with you pitting your party members against enemies of all sorts on a variety of terrain. Movement is grid-based, and characters gain advantages for attacking foes from the side or behind as opposed to head-on. Order of action is determined based on individual speed, and you'll be able to see the action queue on the top of the screen to figure out who is able to do what and when. Characters each bear unique abilities, from up-close melee attacks and powerful spear techniques from the knights, to long-ranged bow and gun users, to witches with their array of magical spells, and more. As you fight, you'll store up energy that can eventually be unleashed in a flash drive, which is a particularly devastating attack that will save your bacon more than once when used at appropriate times. Roland as a Rune Knight has a special ability called engage that he can use when there are witches in his party. This bizarre power is the result of a witch lending Roland a ring and some of their own magic. When you use it in battle, you are treated to an image of the witch in a flowing white wedding gown as the young knight completes his transformation. When finished, Roland gains additional abilities, additional magic, and a flash drive that corresponds to the young lady he is currently engaged to. A fire witch will grant him fire spells and flash drives, a water witch will do the same with water magic, and so on. It's pretty crazy, and is an ability you'll want to plan carefully around using to eke out its full advantage. Fights often require careful consideration, as story-driven battles in particular tend to feature one or more absurdly powerful enemies that need to be approached cautiously and with strong attacks in your arsenal ready to be unleashed. That's because much of the time these mighty foes can kill you or your friends in a single strike with a flash drive or magic, so you'll need to bait them into position and then gang up on them quickly. This mostly works out great for those who like to plan out their moves, but there are a few issues. One is the fact that many maps have scripted monster spawns, so your first time in a given battle can be cut short if you're anticipating the end only to have another three enemies scuttle onto the field. This means that a lot of times you'll have to replay a map for no other reason than you need to see all the possible monster spawns so that you can plan around them. Another issue is that frequently story battles will chain with each other, so you'll have to fight through two battles or more without a break. You can equip only two items at a time per character and can't re-equip between battles, so your resources can easily get depleted. While you can retry a battle if you fail, you cannot equip items at the start, nor can you actually change the characters you selected to bring with you to that particular fight. If you unfortunately have a badly balanced team to begin with, you can be stuck having to work through your initial poor choices in the hopes that you can pull out a victory rather than start all over. That dovetails into the final downside, which is that the careful, cautious planning can come with a price of time. If you have to spend some minutes poring over your strategy, hoarding your most powerful spells and advancing slowly across the map only to get reamed at the end, having to repeat that can really wear away at your will to live. While a number of the story battles are indeed difficult, you can intersperse them with somewhat less demanding side quest missions that you pick up at a guildhall. Many side quests are available, and this gives you a chance to level up some of your weaker characters while gathering up other vital materials like equipment, items, and money. Leveling is important because the game difficulty often advances quickly, and characters really only get appreciable experience gains from landing killing blows. These additional battles let you plan around who you need to level without having to worry about failing the main game in an epic manner. These quests and some extras like online multiplayer handily fill out the already solid narrative portion of the game and will give you lots of content to chew on. Many of the minions are monstrously mean, so creep up cautiously before you clobber them. Character art in Luminous Arc 2 has a good aesthetic, with a nice range of expression in multiple fixed character portraits and an attractive animated opening sequence. Battle maps and sprites aren't amazingly detailed but fill the eye with bright color, and the music serves a nice accompaniment. The voice work in the game features a couple nicely nuanced performances, several average ones, and a few that will have you mashing the skip button. Luminous Arc 2 doesn't break the mold of the traditional strategy RPG, but fills it nicely and offers up a good experience. If turn-based combat combined with swords, sorcery, and demonic stuffed cats is your cup of tea, definitely consider giving this game a home in your Nintendo DS."}