{"ref": "https://www.gamespot.com/reviews/zone-of-the-enders-the-fist-of-mars-review/1900-2854222/", "date": "May 17, 2006", "game_name": "Zone of the Enders: The Fist of Mars", "text": "Zone of the Enders: The Fist of Mars fleshes out the same futuristic techno world seen in the original PlayStation 2 action title. The involved narrative deals with the political and social struggles of humankind in the strange future they have created. Although tactical combat is the focus of the title, Konami has infused an element of hands-on action into this competent, story-driven strategy RPG. The story begins when fate places a boy named Cage into the cockpit of a particular giant robot. He eventually finds himself in the company of an eclectic mix of individuals who stand for freedom and equality on Mars. All the events in the game are conveyed using a massive amount of intelligently written text. The script has a lot of dramatic and philosophical moments, but it is liberally peppered with romantic tension and bits of comedy. If you become confused during the course of a conversation or simply hit the button too fast, you can scroll back and forth through the text using the L and R buttons. Because of the high volume of dialogue and interaction between characters, each of the major players is very well developed. The solid and entertaining writing makes the copious dialogue sequences enjoyable, and the story does its best to keep you interested in progressing through the game. The sound effects for doors opening and closing, footsteps, and even fainting also help to keep things from dragging as you take in the details of the situation. Rounding out the audio package is varied and well-executed music that has a futuristic flavor. Several databases are included as a supplement to help players grasp the plot and the details of the world. Aside from a glossary containing the original terminology of the game, combat unit and character files also exist. These databases can be accessed between stages and during battle, so you can be sure of who and what you're going up against. The attention to story and atmosphere are easily appreciated, but since this is a strategy title, talk will inevitably yield to action. When your group faces a battle, the characters who will participate are automatically placed on the field map, which is divided into squares. The maps themselves are a bit drab in color and detail, but you can easily distinguish friendly and enemy units based on the color and type of their icons. There are small terrain bonuses for units on the ground, but the effect is largely inconsequential. Ground units can be substantially hampered in movement by adverse terrain, so you may need to take that into account. The turn-based combat is relatively straightforward and simple, with alternating player and enemy phases. During your turn, you'll have the chance to move each of your units and choose to end the phase when your actions are complete. When an attack is made, a screen detailing the hit/evade percentage and strength of the attack is displayed, where you can toggle the animation and the IAS on and off. The animations are capable and have appropriate sound effects. The IAS, however, has much more of a bearing on the end result. IAS stands for Konami's interactive action system, which was also used in the PS2 title Ring of Red. With this option on, the player can actually determine the outcome of combat depending on his or her skill. When attacking, you have a certain time to put your targeting reticle on the enemy and hit the A button to lock on. When evading an enemy attack, you must to keep your own target icon away from the enemy's. The time you're given and the size of the targeting icon are based on statistics. Even so, if you're adept at using the system, you can overcome impossible odds to hit or evade in any situation. This hands-on aspect of the combat gets the player more involved, and while you can opt to have the game determine the outcome for you, the game will be prohibitively difficult in places if you don't employ your skilled and steady hand. Even if you barely manage to line up with your target, you'll still do full damage for the attack. If you manage to hit a specific spot on an enemy frame, you'll get a critical hit and be rewarded with a damage bonus. Unfortunately, there are no other variations in damage, and enemies always move at a uniform speed, with no flair for mind games. The basic combat mechanics are largely without frills as well. All the characters have different ranges and power for their attacks, but only one enemy can be targeted at once with any weapon. Even weapons that one would expect to have an area effect, like grenades or a barrage of rockets, can only be directed at an individual square on the map. Some weapons stun an enemy for one turn, but this happens so rarely that it can never be counted on and has no real bearing on combat. The game's customization options are kept to a minimum, restricted to improving the various statistics of your giant mechs with cash or simply leveling up for others. ~Local servers~ provide automatically equipped new attacks and parts if you can reach them during a battle, but the pace at which you acquire them is determined completely by the game. They are never located in an exceedingly inconvenient location, and each has preset contents, no matter which character does the download. Zone of the Enders: Fist of Mars contains 25 stages altogether, and it's linear in the strictest sense. While the game doesn't provide much freedom, it does provide an involving experience and a skillfully told story. While not incredibly complex, the tactical combat and unique IAS system remain compelling and fresh throughout the 20-plus hours it will take to finish the game."}