{"ref": "https://www.gamespot.com/reviews/final-fantasy-explorers-review/1900-6416339/", "date": "January 25, 2016", "game_name": "Final Fantasy Explorers", "text": "A mashup of Final Fantasy elements built with the framework of creature-tracking games such as Monster Hunter, Final Fantasy Explorers takes the best of both worlds and whips up a work of fan service so pure, it's almost saccharine. Although its exhaustive lists of quests can get repetitive and genuinely tedious at times, Final Fantasy Explorers succeeds in creating an MMO-lite that--pardon the cliche sentiment--fans of the series will take to with deep delight. Those who don't enjoy Final Fantasy may find Explorers difficult to chew on, due to a frustrating economy and lack of variety or depth in exploration. But for a longtime fan, the appeal of taking down the formidable eidolon Odin with your best friend and a level 50 Chocobo is high.Explorers takes place on an island removed in time from the Final Fantasy universe, though references to the many characters and worlds that have populated it are abundant. You get the sense that heroes like Cloud and Yuna are fighting other, more important battles elsewhere, while you fight your own on the island. At its center is a Grand Crystal, an organic structure humans use to power civilization. As an explorer, it's your job to uncover new areas of the island and a pathway to this crystal. This tale is airy and whimsical in tone, though there is brief dabbling in the ~man vs. nature~ sentiment reminiscent of Final Fantasy VII's themes. But Explorers' makes it clear from the outset that it's not here to tell a story, it's here to let you fight stuff. The watery narrative is conduit for quests, and a thick plot isn't missed. I barely paid attention to the brief story beats, as it doesn't affect your character progression.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Final Fantasy Explorers Video ReviewFor character customization, you can switch your job class and equipped abilities at any time, taking the time to explore and master them at will. The only caveat is you must change jobs while in the hub world, and can't do so mid-quest. Jobs unlock gradually through progression, with some like dragoon and sage appearing late in the main quest line. Explorers encourages you to try out each job class because each one has its own unique weapons and abilities. For example, firearms are for machinists and alchemists and only monks or ninjas can use knuckles--but all four classes have their own exclusive abilities when using them. The Darkness ability is special to dark knights, only dragoons can jump, and so on.Weapons also retain unique combat styles, with significant differences. A ninja's kunai give you an edge in hand-to-hand combat, but going bare-handed with only spiked knuckles offers a little more a challenge. Mages and sages can stand across the field from their opponents flinging spells with rods and staves, or in the game of the geomancer, special bells that rock the earth. Some enemies are weaker against magic or require you to get up close with a blade to take them down quicker, encouraging you to swap jobs frequently. And as you gain experience, you can purchase more powerful versions of your job's abilities, and eventually complete a job mastery exam in which you face a formidable creature. I spent a majority of my game as a dark knight, and when I got bored of swinging around Cloud's Buster Sword I switched to an axe, opening a whole new set of abilities. I dabbled in geomancing and black magic, but then I unlocked the dragoon and sold all my rods and tomes to afford a solid two-pronged lance. I took to the variety with gusto, because it was like getting a chance to reroll an MMO character over and over with no penalty to my progression.Once you've got a set of classes and abilities you like, Explorers make it easy to switch between them without having to rebuild from scratch. You can save preset outfits, equipment and all. Your experience level also doesn't change when you switch jobs, so starting a new class doesn't reset your strength. The ability to easily jump between jobs inspired me to take time to dabble with them all, and helped me build out a handful of very skilled presets I can quickly choose from when questing with friends.Quests and subquests are structured the same way: go to an area, fight things, get paid. Traversal and map layout are Explorers' poorest features. You walk or run everywhere, though early on you unlock an airship that will drop you directly into some locations. Running eats up Action Points--the meter of points you also expend using special abilities--and walking is painfully slow. And although Explorers offers a variety of different environments--a windswept desert, a beach under a clear crystalline sky, a dark cavern cut with veins of lava, and more--the hallway-like areas between them are dull and monotonous. Each feels similar to the last, with canopied forest corridors and rocky caves all bearing the same sparse layout. What isn't similar, though, is the type and number of enemies that spawn in these locations. It's worth putting up with the sameness and taking time to do some hunting to collect what these creatures drop.Each main quest ends in one big battle, against a formidable creature or an eidolon, a mystical being with a large health bar and a retinue of ultra-powerful attacks. The eidolons are based on summoned creatures pulled from Final Fantasy's past, with favorites like Shiva, Alexander, and Ifrit making appearances. Early-game quests don't pose much of a challenge, but the farther you progress, the more complicated these battles become. For example, when fighting lightning god Ramuh, you must first destroy a series of floating pillars that prevent him from taking damage. The battle against Fenrir changes completely when he's at half-health; he duplicates himself, presenting two targets to track.It's worth spending a few hours grinding to level up so you can contend in these more tactically interesting battles where button mashing won't do and another 1000 HP can't hurt. The grind itself may become repetitive, but the finish line brings stronger weapons and more powerful abilities to your arsenal. This is particularly true when preparing for foes like Amaterasu--a new summon made especially for Explorers--who has two layers of floating shields you must dispatch before you can do any real damage. Once these are destroyed, Amaterasu can teleport across the stage as well as send a flurry of dancing blades after you; there is no safe place on this battlefield, and these challenges are exhilarating. Completing her quest with friends brought genuine shouts of accomplishment from my team, while defeating her solo made me feel like a god.After beating each eidolon for the first time, new main quests open up in which you must defeat them again under different battle conditions. These second-timers are more difficult than the first, with eidolons sporting new, more devastating attacks and shorter ability cooldowns. The added tweaks don't add much, but because success here is rewarded with rare crafting items, it's beneficial to going back. Some weapons or armor require up to 10 rare items to forge, and if you're the kind of player that doesn't like to repeat events, things become a chore.But in another move reminiscent of Bravely Default--which allowed you to adjust the rate of random encounters--Final Fantasy Explorers lets you set the terms against your enemies by giving you tools to make fights harder. Each quest lets you tweak difficulty by selecting up to four new parameters from a list including turning off consumable items, making abilities use more AP, shortening time limits by 25 percent and granting enemies more HP. This fights the boredom of facing down Shiva alone 10 times to collect much-needed Jenova Cells, which in turn lets you craft Sephiroth's outfit for your avatar.In addition to crafting items, encounters yield gil and Crystal Points to use within Explorers' small economy. Crystal Points are used to purchase new abilities and upgrade equipment, whereas gil can buy new items, pay a fortune teller to grant a better drop rate during a quest, and buy or upgrade monster companions. You also have to pay gil to start a quest; main quests require you to have a few hundred gil the bank to embark, while subquests can ask for as much as 10,000 gil. I'm not a fan of having to pay currency to progress or take on an optional objective, especially because it depletes gil faster than I can earn it. Quest rewards include sparse amounts of gil, and for the first half of the game I had to sell equipment and items to have enough in my pocket to continue the main quest line. It's a frustrating, unbalanced design choice that strangles Explorers' economy and actively discouraged me from loading up on much-needed consumables and newer armor pieces or taking on many subquests.You can complete all of Final Fantasy Explorers solo, with or without the help of monster companions. Occasionally, upon defeat, a creature will drop an amalith, which can be traded to a shopkeeper to revive the monster and make him available as a companion. These monsters level up alongside you and can be upgraded the same as equipment. In some cases, they become stupidly powerful. Pablo, my level 47 Chocobo, pecked Ifrit to death while I got only a dozen hits in. I went after Diabolos with a pair of level 38 Cactuars that did more damage than I did. Being able to build up powerful companions on top of an already smart A.I. was the best thing about questing solo.But playing Explorers with friends is definitely fun, especially when you're all in the same room shouting at one another. You can join up to three other players, and if there are three or less you can take along one of the hosting member's monsters. Assigning party roles always has a tinge of aggravation--I'm a damager rolling a dragoon and had to bully my boyfriend into being my white mage--but having a complete set of players in complementary combat roles is beneficial for difficult eidolon fights. Players can also split up and tackle different objectives. But the best part of multiplayer is that after completing a quest, you get the same number of reward items as there are players. So if four of you beat Shiva, you each get four Jenova Cells. Everyone gets their own loot when traversing the island, making it worthwhile to pair up and score extra goods.The only downside to multiplayer is that you can only complete quests unlocked by the least accomplished player. When I played with others who hadn't progressed as far as me, I found myself repeating less interesting lower-level quests and sometimes even carrying the quest on my own. I pulled less experienced explorers through eidolon fights, which is enjoyable depending on the kind of player you are. The experience is reminiscent of Destiny, in which the more seasoned veterans lead newbies in an effort to help them level faster and get better goods sooner. Several times I ran ahead and killed a boss on my own while my companions were still hacking at roaming fiends two areas behind me--and we all still got the same loot. In one way, it's unbalanced in terms of effort, but in another, it's a good system from bringing your friends up to snuff when you've already blown through most quests.What kept me coming back to Explorers was its unabashed fan service. Equipping magicite allows you to summon the power of eidolons into combat, and some of those summons were Final Fantasy heroes like Aerith and Vaan. I loved running around as Lightning with a Bomb and a Flan at my back, beating away Fenrir or Alexander and then returning home to buy some Phoenix Downs from a sassy moogle shopkeeper. As a Final Fantasy fan, there's something inherently wonderful about being able to wield the legendary weapons of the series' heroes, like the Sword of Kings from Final Fantasy XII and Yuna's Tiny Bee pistols from Final Fantasy X-2. In this way Explorers welcomes your avatar into this world of wonder, setting you among titans like Lightning and Cecil.Final Fantasy Explorers is an homage to the series in the vein of Final Fantasy XIV; a world of reverential cameos and winking allusion glossed with the series' staple tone of wonder. The sheer number of quests and the complexity of customization will keep you busy for hours. If you like that sort of thing, that is. Even though its economy leaves a bit to be desired, it's not clunky enough to dissuade you from working hard to earn items and craft your ultimate armor. Because while Final Fantasy Explorers isn't a true Final Fantasy game, in a sense--it's more a Monster Hunter clone with a touch of Destiny than anything else--it still hits the sweet spot by sending you into a strange new world against magnificent creatures and impossible odds."}