{"ref": "https://www.gamespot.com/reviews/tetris-evolution-review/1900-6168084/", "date": "March 26, 2007", "game_name": "Tetris Evolution", "text": "Do you like Tetris? Would you be willing to pay $30 to play Tetris on the Xbox 360? This is pretty much the sole consideration when deciding if Tetris Evolution is right for you. The single-player and multiplayer options are solid yet predictable, and the game's got all the personality of a screensaver. If 22 years of Tetris have left you tired of the formula, Tetris Evolution will do very little to reignite your passion for this classic Russian mind-bender. It's not a bad package, but it's hard to get excited about. For better or for worse, it's still Tetris. Yup. That's Tetris all right. Tetris Evolution features all the trimmings that have become standard for Tetris games over the past five or six years. There are eight different modes to choose from--marathon, ultra, cascade, race, score, hotline, go low, and eraser--and they can all be played alone or with up to four players, either locally or over Xbox Live. There are no real surprises here with the different gameplay modes--most of them just stack scoring or timing rules on top of the Tetris rules. The biggest perk in Tetris Evolution's gameplay is that it addresses the infinite spin feature that has crept into Tetris canon over the years. It still happens by default, but when you're setting up a game you now have a lockdown option that you can adjust to determine how long a shape can be spun after it has touched down. It's a small but important feature that makes Tetris Evolution far more playable than any other THQ-published Tetris game. Since you're just dropping polygons down the screen, the game of Tetris isn't a whole lot to look at, something Tetris Evolution addresses with lots of ridiculous, full-motion video backgrounds that will loop while you play. The default background makes it look like you're flying through some sort of CG Tetris world, though you can also choose looping footage of fire or a giraffe eating or high-speed footage of clouds passing, flowers blooming, and city traffic at night, to name a few. They're amusingly random, and by default each comes paired with a music track. Most of the music is bland and forgettable, though a synthesized version of the Russian folk song ~Korobeiniki,~ known more commonly as ~that Tetris music,~ is featured. Unfortunately, the music sounds soft and watery and could have benefited from a more blippy, square-edged sound. The 360 achievements in Tetris Evolution are numerous and pretty well balanced. You'll bang out a few within minutes of starting up the game, but some will require hours and hours of play along with some high-level Tetris skills. Released at just $30, Tetris Evolution has the distinction of being one of the cheapest retail Xbox 360 games, but for what you're getting, it feels like it probably should and could have been a $10 Xbox Live Arcade game. Still, if you've got an itch that no amount of Bejeweled, Lumines, Hexic, Zuma, or Jewel Quest will scratch, Tetris Evolution isn't an entirely bad option."}