{"ref": "https://www.gamespot.com/reviews/tom-clancys-rainbow-six-vegas-2-review/1900-6188101/", "date": "March 19, 2008", "game_name": "Tom Clancy's Rainbow Six: Vegas 2", "text": "If the original Rainbow Six Vegas felt like the first night of a trip to Sin City, its recently released sequel feels like the second; a little worn, but still a lot of fun. There's still a casino's worth of content and the best gameplay this side of Caesar's Palace. Plus, the introduction of a sprint button not only increases your speed, but also quickens the pace of the entire game. On the other hand, the cooperative play has been pared down a little and the expanded experience gains are about as glamorous as pillow mints--even if you are grateful for them. A third night of this might be too much to handle, but if you like to place bets with bullets at all, you'll definitely want to put some money down on Rainbow Six Vegas 2. Scared civilians add gravity to some firefights, frustration to others. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tom Clancy's Rainbow Six Vegas 2 Video Review 1 Despite the name Tom Clancy in the title, the Rainbow Six games are hardly known for their ace storytelling skills. Having said that, the way the original Vegas ended on such a terrible cliffhanger ending, when all it really had to do was give you a reason to kick some terrorist butt, was especially disappointing. Fortunately, the campaign in Vegas 2 makes no such errors. You no longer play as Logan Keller. Instead, you hunt terror and save hostages as a custom character referred to as Bishop in the campaign. Although the specifics of the overarching story are pretty easy to lose track of, one thing is clear: There are terrorists and you have to get them before they get Vegas. However, there are a couple of great scenes in the campaign. For example, there is one where you're supposed to meet up with a guy to find chemical weapons, only the terrorists meet up with him first. Because he's wearing a communication device, you can hear the proceedings as you make your way through the level. First, the terrorist in charge rails angrily, then the guy pleads with him, then the terrorist rails some more, and then the guy starts screaming ~NO, NO, not THAT!~ Then there are no more words, just animal noises of pain, fear, and more than a little loathing. Other moments don't seem quite as authentic, especially those that involve civilians. While it's nice that they're in the game, you'll occasionally lose if you fail to prevent the terrorists from executing one of them. That's just plain silly because it's unlikely that a group of commandos would leave a bunch of terrorists and weapons behind because Hank the Hostage bit the dust. Also, it's so easy to die in Vegas 2 that you really don't need the extra ~game over~ screens. Just like in the previous game, you play through each stage with your two not-so-trusty sidekicks. They're like roulette wheels in the way they oscillate between deadly efficacy and utter helplessness, though the odds are actually stacked in favor of them doing the right thing. Their normally smart, super-effective behavior actually makes it even more striking when they get stuck behind the occasional box. The campaign isn't very long, but it has its share of awesome firefights and is a good way to warm up for the online play. Although many of the locales aren't the first ones that would come to mind if someone asked you to imagine a shootout in Vegas, they are inventive, nonetheless. There are a few nondescript warehouses, generic loading docks, and lame industrial areas that could just as easily be in Rainbow Six Fresno. But, then, there's also the theater level. This is a full-on replica of a decadent theater complete with stage, backstage, seats, and a balcony. The tricky thing about it is that one team has easy access to the balconies, while the other is pinned by the somewhat open stage. If a player from the latter group can make it across and exit stage left, hopefully with a close-range weapon like a shotgun, he can get all No Country for Old Men on the snipers watching the action below. How quickly the hunters become the hunted. Where theres smoke, theres about to be fire. The best way to cross any open space in Vegas 2 is to sprint, and that can now be accomplished with the push of a button, which is similar to what you've done in nearly every shooter that's come out since Gears of War. But unlike the reckless and half-blind dash in that game, Vegas 2's version is easier to control. It's also more versatile because you can sprint sideways, as well as forward. However, when you see a grenade rattle on the ground in front of you, you'll wish you could also sprint backward (you can't); realism be damned. Sprinting is a small, minor addition to a great big game like this, but it has a major impact on Vegas 2's pace and gameplay. It's obviously a good thing to be able to run a little faster when you're trying to close in on a flash-blind enemy, and it goes with the shotgun like peanut butter goes with jelly. Sprinting around a corner while pulling the trigger on a shotgun blast before the gun is even half on the screen and catching your enemy with a mouthful of buckshot is one of the sweetest kills the series has seen. Less obvious and less gory is the overall effect on the pace of the play. Sprinting provides a welcome shot of adrenaline, especially online. Speaking of the Internet, online play used to be the only place you could go to level up your soldier and unlock new gear, but that is no longer the case. You can now gain experience points, ranks, and equipment by playing through the offline content. And, it's all universal. If you become a sergeant by playing the heck out of terrorist hunt campaign, you'll still be a sergeant when you log onto your system's network. The main perk here is that by playing through the single-player campaign first, you'll enter online play with a few weapons and clothing-customization options already unlocked. This really doesn't add anything to the game as much as it fixes a minor flaw with the original--you should have been able to gain experience points offline all along, although it didn't matter to most players because the online content is such a huge part of the game. This meager expansion of the experience model is also noteworthy considering Call of Duty 4's recent strides in the developmental department. When it comes to creating your character as you play, Vegas 2 has pretty meager cards. Who knew casino rooftops were so exciting? Despite this, the options for online players have actually slimmed down a little when you compare the original with the sequel. Previously, four players used to be able to tackle the campaign cooperatively, but now, that number has been reduced to two. That may sound crazy and retroactive, but four players can still tackle terrorist hunt. And to the game's credit, it's easy to drop in or drop out of the two-player campaign. There is one co-op issue, though, that makes no sense: the fact that your two computer controlled companions are both controlled entirely by only one player. The other player feels like an awkward stepparent: You know you have good advice, but the kids just won't listen to you. It's clear that giving each player one minion would have wreaked havoc on the stacking and breaching system, but there are ways around this issue. If it were easy to transfer control of one or both minions between the two players, the tactical options would have been even broader, and both players would feel like they got to play with the nifty order giving. The other new additions are multiplayer modes: team leader, total conquest, and demolition. Team leader is the most creative because it blends a VIP-style match with elimination play. As long as your VIP is alive, your guys can respawn at will. But once he drops, every death is final. Coming back after your leader has been assassinated is possible, but not probable. Total conquest isn't a complete departure from the conquest mode featured in the original Vegas; now, you must hold three transmitters for 30 seconds. This is a fun, frantic mode because your objective is constantly changing between assault and defense. You always know where to go, and you usually have a good idea of where to find the enemy. Finally, demolition is a classic bombing mission where one side tries to blow up a target while the other tries to defend it. Though that last mode is old school, the graphics are anything but. Though there are occasional instances of texture blurring and fill-in during frantic online play, there will also be times when you'll get blasted by an unseen enemy because you were too busy admiring the walls. And what walls there are in the game. From the gritty, sweaty walls of Kill House to the deep red and dimly lit papering in the theater, Vegas 2's walls are unmatched, except perhaps by BioShock's. The characters look good too, especially when you're shooting them. Blood spurts from bullet wounds, splattering nearby walls as the gun noises pound and the controller rumbles with approval. Well, the Xbox 360 one does, but more on that later. The music and sound effects are also excellent. The audio queues are as clear as they are life-saving, and the music is rousing. The track in theater is especially epic and unusually operatic for a military shooter. Riot shields are awesome against rocks and bottles, but not so good against grenades. Though there are differences between the PlayStation 3 and Xbox 360 versions of Rainbow Six Vegas 2 that make the 360 version slimly preferable, both unequivocally capture the same excellent experience. The lack of rumble in the PS3 controller is still a drag. Also, it takes a little longer to find a good PS3 online game for three reasons: fewer people are playing, you can only see a match's latency once you've joined, and you will randomly be unable to connect to certain servers. But the graphics are comparable and the gameplay is identical, so overall, the PS3 version is easy to recommend. And that makes it better than most games because Rainbow Six Vegas 2 is the best tactical shooter on the market. It doesn't gamble as much as it should and, instead, seems to take cover behind the formidable foundation established in the first game. But to its credit, Rainbow Six Vegas 2 does make one big gameplay tweak and provides another highly playable single-player campaign. It also provides a decent suite of cooperative options and more excellent online multiplayer. Though its experience system is now clearly behind the one found in Call of Duty 4, no game has a better control scheme or more satisfying tactical play. This ace belongs in every shooter's hand. Speaking of the Internet, online play used to be the only place you could go to level up your soldier and unlock new gear, but that is no longer the case. You can now gain experience points, ranks, and equipment by playing through the offline content. And, it's all universal. If you become a sergeant by playing the heck out of terrorist hunt campaign, you'll still be a sergeant when you log onto your system's network. The main perk here is that by playing through the single-player campaign first, you'll enter online play with a few weapons and clothing-customization options already unlocked. This really doesn't add anything to the game as much as it fixes a minor flaw with the original--you should have been able to gain experience points offline all along, although it didn't matter to most players because the online content is such a huge part of the game. This meager expansion of the experience model is also noteworthy considering Call of Duty 4's recent strides in the developmental department. When it comes to creating your character as you play, Vegas 2 has pretty meager cards. Who knew casino rooftops were so exciting? Despite this, the options for online players have actually slimmed down a little when you compare the original with the sequel. Previously, four players used to be able to tackle the campaign cooperatively, but now, that number has been reduced to two. That may sound crazy and retroactive, but four players can still tackle terrorist hunt. And to the game's credit, it's easy to drop in or drop out of the two-player campaign. There is one co-op issue, though, that makes no sense: the fact that your two computer controlled companions are both controlled entirely by only one player. The other player feels like an awkward stepparent: You know you have good advice, but the kids just won't listen to you. It's clear that giving each player one minion would have wreaked havoc on the stacking and breaching system, but there are ways around this issue. If it were easy to transfer control of one or both minions between the two players, the tactical options would have been even broader, and both players would feel like they got to play with the nifty order giving. The other new additions are multiplayer modes: team leader, total conquest, and demolition. Team leader is the most creative because it blends a VIP-style match with elimination play. As long as your VIP is alive, your guys can respawn at will. But once he drops, every death is final. Coming back after your leader has been assassinated is possible, but not probable. Total conquest isn't a complete departure from the conquest mode featured in the original Vegas; now, you must hold three transmitters for 30 seconds. This is a fun, frantic mode because your objective is constantly changing between assault and defense. You always know where to go, and you usually have a good idea of where to find the enemy. Finally, demolition is a classic bombing mission where one side tries to blow up a target while the other tries to defend it. Though that last mode is old school, the graphics are anything but. Though there are occasional instances of texture blurring and fill-in during frantic online play, there will also be times when you'll get blasted by an unseen enemy because you were too busy admiring the walls. And what walls there are in the game. From the gritty, sweaty walls of Kill House to the deep red and dimly lit papering in the theater, Vegas 2's walls are unmatched, except perhaps by BioShock's. The characters look good too, especially when you're shooting them. Blood spurts from bullet wounds, splattering nearby walls as the gun noises pound and the controller rumbles with approval. Well, the Xbox 360 one does, but more on that later. The music and sound effects are also excellent. The audio queues are as clear as they are life-saving, and the music is rousing. The track in theater is especially epic and unusually operatic for a military shooter. Riot shields are awesome against rocks and bottles, but not so good against grenades. Though there are differences between the PlayStation 3 and Xbox 360 versions of Rainbow Six Vegas 2 that make the 360 version slimly preferable, both unequivocally capture the same excellent experience. The lack of rumble in the PS3 controller is still a drag. Also, it takes a little longer to find a good PS3 online game for three reasons: fewer people are playing, you can only see a match's latency once you've joined, and you will randomly be unable to connect to certain servers. But the graphics are comparable and the gameplay is identical, so overall, the PS3 version is easy to recommend. And that makes it better than most games because Rainbow Six Vegas 2 is the best tactical shooter on the market. It doesn't gamble as much as it should and, instead, seems to take cover behind the formidable foundation established in the first game. But to its credit, Rainbow Six Vegas 2 does make one big gameplay tweak and provides another highly playable single-player campaign. It also provides a decent suite of cooperative options and more excellent online multiplayer. Though its experience system is now clearly behind the one found in Call of Duty 4, no game has a better control scheme or more satisfying tactical play. This ace belongs in every shooter's hand."}