{"ref": "https://www.gamespot.com/reviews/astro-boy-the-video-game-review/1900-6239229/", "date": "November 5, 2009", "game_name": "Astro Boy: The Video Game", "text": "The ability to fire lasers from his arms, fly with rocket-propelled feet, and shoot down enemies with machine guns from his backside are all things boy-robot Astro Boy performs with the greatest of ease, as showcased in the original Astro Boy manga, as well as now featured in the recently released motion picture of the same name. All of Astro's powers are on display in the game adaptation of the film, but for all the character's superhero-like qualities, the Astro Boy game is far from super in its execution. Stiff, on-foot based stages and repetitive side-scrolling shooter levels don't capitalize on Astro's formidable skills and the generally muddy visuals do little justice to the film's clean, vibrant style. After presenting an introductory cinematic spliced together from the film, Astro's adventure begins in his father's home just before he discovers his flight capabilities (and the fact that he's a robot). Even in this brief on-foot tutorial level, some of the game's mechanical shortcomings immediately surface, most notably how Astro Boy engages in hand-to-hand combat. The issue is that Astro Boy remains stationary while punching and can't move until the punching animation is completely finished, so if you're sandwiched between two enemies, there's a good chance one of them will inflict damage while you're fighting the other, but you can't really do anything about it. It's annoying and only gets worse when you misjudge how close you are to an enemy and leave Astro punching air while an enemy gets a free shot. Granted, there's some relief when a second player joins in (he or she can pick off extra robots that might sneak up on you), and Astro has other standard attacks--such as the finger laser--that don't require close proximity to the bevy of robots out to wreck his face. But, despite the fact that you can find hidden upgrades for these attacks, they're less effective and powerful than just a good fist to the metallic gut. Also, these on-foot missions just aren't that entertaining. In fact, most of them are the standard, formulaic sessions where you move to one confined area and destroy all enemy robots before moving onto the next area to do the same thing. There are some light platforming elements involved as well, but the fear of falling down a pit is doused when you realize that Astro can simply fly back out of any potential hazard and the penalty for doing so is just a small amount of health. And platforms generally aren't that tricky to traverse when you can simply fly across them with the aid of some rocket boots, though these very same rocket boots don't let Astro hover above a massive boulder that chases him (albeit, quite slowly) through one of the later levels in the game. The side-scrolling shooter levels interspersed throughout the game fare better when it comes to controls, if only because you don't have to punch anything. Instead, you can just continually hit the button for Astro's finger laser to take down airborne enemies. Still, these levels leave much to be desired in terms of variety--most of the enemies are recycled repeatedly and follow fairly predictable attack patterns, making it easy to avoid just about anything they throw at you. Additionally, there's no interaction with background elements or, more specifically, there aren't any environmental hazards to worry about--most are just full-motion video backdrops that are similar to those found in shooters that arrived with the advent of CD-based media. Shooter stages are far easier than the on-foot sections of the game. The one aspect of the game that lends some variety to either type of level is Astro's special move system, but even that doesn't reveal anything especially impressive. Whenever he defeats an enemy, Astro absorbs a small bit of energy, which collects into a special move meter that charges up to nine special attacks. When you use a special attack, such as his rear machine guns or his healing skill, it uses energy from your meter, but you get less energy from enemies by using these skills than if you defeat them with regular attacks. You can't just sit back and continually use special attacks. Still, it's easy to recharge the meter to full before reaching a boss fight where you can, in most cases, continually use Astro's arm cannons to deal with them. Even Astro Boy's grainy and jumbled look is disappointing. It's not so bad that you can't tell the dirty scrap yard from the pristine Metro City, but there's a severe lack of detail in just about everything in the game, including the enemies, cities, and Astro himself. Likewise, the voice work (by actors who lent their voices to the film) are just there as a means to remind people that this game is indeed based on a feature film and their performances reflect that fact. On top of all that, it doesn't take much more than an hour or so to complete the entire game on normal difficulty. All of these things create a game that shoehorns Astro Boy's super abilities into a completely unremarkable experience."}