{"ref": "https://www.gamespot.com/reviews/darwinia-review/1900-6131968/", "date": "August 25, 2005", "game_name": "Darwinia+", "text": "Introversion Software brings another uniquely retro-virtual experience to the PC with Darwinia. If you follow obscure basement-budget PC games, you're probably familiar with Introversion's first title, Uplink: Hacker Elite, a computer-hacking game released in 2001. Uplink developed a bit of a cult following and provided the guys at Introversion with the funds to develop Darwinia, which maintains the same low-fi, indie feel that makes these kinds of games so endearing. Darwinia is a deceptively simple, poignant real-time strategy game wrapped in an abstract, minimalist veneer that somehow manages to make perfect sense within the context of the game. It's a brilliant and addictive experience that's unlike anything you've played before. Welcome to Darwinia, a virtual theme park inhabited by sentient, digital beings that have evolved over thousands of generations... Neat! The first thing you'll notice about Darwinia is the odd art design. The game features a mix of 2D and 3D characters moving about a fully 3D environment. There are no textures in the game, and everything has a sharp, geometric look to it. The vector graphics fit perfectly here though, since the game takes place in a virtual theme park populated by digital inhabitants. Even though everything is flat and undetailed, Introversion manages to pull off some pretty nice effects. For example, when you blow up some of the larger enemies, they'll flake apart into hundreds of small, paper-thin triangles that float away into nothingness. Another nice touch is the digital spirits that are left behind when a creature dies. These spirits are represented by tiny, colored, semitransparent squares that slowly float into the sky and fade away. It's oddly entrancing to watch a cloud of spirits rise almost indiscernibly skyward after a battle. The game is full of these ethereal moments, and it's easy to lose yourself in the landscape. Once you get past the initial novelty of the art design, you'll find that the world of Darwinia has a pretty interesting story behind it. The world of Darwinia is a virtual theme park, created by computer engineer Dr. Sepulveda. The world is inhabited by virtual life-forms known as Darwinians. These little green lemming-like creatures have lived peacefully for thousands of generations, but now a deadly virus has infected the world of Darwinia. It's up to you to eliminate all signs of infection and save the Darwinians from extinction. You'll learn everything there is to know about Darwinia from Dr. Sepulveda himself; he'll occasionally transmit helpful messages to let you know what you need to do to clear each level. He also provides a bit of context at the beginning of each level by explaining the purpose of the mission and why it's essential to the survival of the Darwinians. The story seems minimal, but it's presented clearly; and somehow, it does a great job of making you feel a certain fondness for the tiny green blips that are the Darwinians. The gameplay is solid here as well, and it offers a good mix of strategy, action, and even a bit of puzzle-solving. You can't directly control the Darwinians, but you can create different programs that you can use to fight enemies, collect spirits, or herd and transport Darwinians. By holding the Alt key, you'll bring up the task manager, which is the simple menu system that you can use to create and modify units and check the level objectives. To create a program, you simply draw a gesture with the mouse. For example, to create a squad, which you need for fighting enemies, you have to draw a triangle. The controls do take a bit of getting used to, but it's worth it to leave the play screen free of the usual clutter of RTS games. In the beginning, the task manager can only hold up to three programs at a time; but as you progress, you can ask Dr. Sepulveda to improve it to hold more programs. So, rather than being limited by resources, you're limited by space. If one of your programs is terminated, you can simply draw a quick gesture to spawn a new one. There are only a handful of different programs in the game, but each one plays an integral part in the game. Also, the lack of variety adds to the challenge, because you have to figure out how to best use each program to complete your objectives. You can't simply amass resources for an hour and then send a massive army out to crush everything in its path. This type of strategy is a bit more methodical. Make no mistake, though--there's plenty of combat in Darwinia. You fight with squads, which are small groups of fighters who fire lasers, toss grenades, and shoot rockets. Enemies include all kinds of wispy little virii, spiders, huge centipedes, and floating egg-laying creatures. Eliminating these things is pretty straightforward: You move your squad within range and hold the right mouse button to start firing. There are no target locks in Darwinia--you simply aim with the mouse. It sounds easy, but some of the enemies can get pretty challenging, especially when they start swarming by the hundreds, all the while laying eggs to keep their numbers up. Some of the level objectives require you to herd Darwinians to specific points on the map to get them out of harm's way or to operate various kinds of machinery. This is accomplished with a Lemmings-style checkpoint system, in which you elect one Darwinian to be an officer. You can select a point on a map, and any Darwinian that comes close to the officer will automatically move to that point. Darwinia looks so interesting, you'll spend as much time gawking at it as you will playing it. The mix of combat and puzzle-solving is quick and challenging at first, but later in the game, as the missions get more complex, the pace does slow down significantly. Some of the objectives in later levels can take well over an hour to complete. Most of this stems from the fact that the environments are quite large, and all the creatures move slowly. It's not too bad, though, and if you're used to complex RTS games, you won't have a problem here. The music and sound effects in Darwinia fit the theme perfectly. The soundtrack runs the gamut from catchy 8-bit tunes to subdued piano arrangements, and each song cues at just the right time. The only disappointment is that the music is only present during the intros. For the most part, there's no music to be heard while you're playing the game. It's not all quiet, though; you'll hear plenty of battle noises as lasers fly and grenades explode. You'll also hear tiny squeals from dying creatures, which is about the only discernible emotive response you'll get from any of the creatures in the game. From the unique visual style to the simple but intelligent gameplay, Darwinia will have you hooked. You can blow through the game in eight or 10 hours, but you'll want to linger a bit longer just to see what else there is to do in this virtual world. If you think you've seen everything, give Darwinia a try; at the very least, it's a nice change of pace."}