{"ref": "https://www.gamespot.com/reviews/ryse-son-of-rome-review/1900-6415913/", "date": "October 10, 2014", "game_name": "Ryse: Son of Rome", "text": "Music cognition specialist Elizabeth Hellmuth Margulis tells us that ~rituals [...] harness the power of repetition to concentrate the mind on immediate sensory details rather than broader practicalities.~ Margulis is concerned with the way our music-listening habits follow from our desire for ritual and repetition, but I suspect that her comments would apply just as well to the repetition inherent to certain video games. Ryse: Son of Rome is not a good game in most respects, but developer Crytek instinctively understands how a relentless rhythm can compel and comfort you, even when your better instincts encourage you to seek a more varied cadence. For better and for worse, Ryse's simple, slaughterous, unceasing combat focuses you on the immediate sensory details, and not on the broader practicalities.In fact, Ryse is all about sensory overload. It is an Ancient-Roman historical fantasy and a celebration of hypermasculine self-expression. As soldier-cum-commander Marius Titus, your primary directive is to lunge, block, and roll, driving your sword into every attacking barbarian's chest and back. The result is pure violence porn. Almost every death is a big deal, a chance for time to slow and the camera to zoom in for close-ups of grimacing faces, gushing blood, severed limbs, and other shows of debauchery. This is the Roman Empire as it might have been brought to you by film director Zach Snyder: every battle is an uberstylized, balletic spectacle right out of 300, but with Spartans replaced with their Roman counterparts.When every stabbing is a capital-E Event, executions lose their impact, and the rivers of blood might as well be everyday creeks, so common do they become. What was once special, Ryse has made mundane. Your interactions with the game are equally mundane: Ryse's combat splits the difference between bog-standard quick-time events and the timing-focused combat of the Batman: Arkham series. You press a couple of attack buttons until you've worn down your enemy enough for a skull to appear above his head. Then, you initiate the fatality, which involves pressing buttons in time to match the color-coded auras that appear around the soon-to-be corpse. You earn more valor, a currency used to purchase various upgrades, when quickly and properly matching your presses to the prompts, but there is no punishment for QTE failure, nor does the upgrade system ever feel necessary, given Ryse's flat difficulty curve.There are a few boss fights stirred into this mix, and you must be more observant of visual cues in such circumstances, but rather little changes between the beginning of Ryse and its concluding moments, during which Marius's exhaustion is matched by the most listless QTEs of the entire game. Doing battle typically means repeating a predictable succession of button presses, and then playing a short game of Simon Says, over and over again. It's rhythm without melody, as if you are a percussionist drumming on your keyboard or controller (and I would very much recommend a controller in this instance), but instead of having an entire musical score to read from, you only possess fifty photocopies of the first page.I can attest to the hypnotic nature of the combat, but I can't wholly condone it, especially when Ryse's other aspects are so frustratingly limited. This may be the most linear game outside of rail-shooters you are likely to play, with exploration opportunities limited to a few dead ends where you might find some unhelpful collectible. No, you can't leap over that log: Roman soldiers simply can't step that high--except for when it's another log, that one over there. You can break these vases, but these other ones that look a lot like those are just for decoration. And you can climb up that barrier because the game wishes it be so, but crossing knee-high foliage is out of the question. Invisible walls are not uncommon in games, but few games do a poorer job at making their corridors feel so arbitrarily confining.And so Ryse: Son of Rome is, as MacBeth might say, ~Full of sound and fury, signifying nothing.~ Its revenge tale is old and simple, and is comprised of a dead family, a betrayal foreshadowed long before it occurs, some mystical allusions to the gods and their squabbles, and the requisite display of bare breasts to reinforce the lechery of the ruling elite. Excellent voice acting at least sells each roar to the heavens and every call to arms. The superb acting also applies to Ryse's highly expressive faces. The CryEngine 3 used to render this explosion of innards is undoubtedly impressive. An elder's hair looks as though it grows from his scalp, rather than sits on top if it; wrinkles, scars, and crow's feet move naturally as characters speak. Ryse for the PC supports all number of ways to make your computer cry, but there is no shame in not being able to maximize every graphics option: Ryse looks photorealistic enough at even moderate settings without ever tumbling into the uncanny valley. I pray to Zeus, however, that you are not as distracted as I am by how combatants in some scenarios scuttle about as if they're brawny bodies were carried by toddlers' legs.The campaign lasts around four or five hours, and while you might presume that the simplistic Ryse couldn't possibly support more game than that, a cooperative two-player online mode hopes to prove you wrong. There are concerns here beyond shedding as much blood as possible: you level up as you play match after match, earning access to new gear and improving attributes, but the foundation is still built upon that insistent combat. It is, as always, the cavalcade of aural and visual overstimulation (Listen to the roar of the crowd! Watch how the stadium morphs and shifts as we do battle!), combined with the unremitting pattern of your button presses, upon which Ryse: Son of Rome relies.Having already lost many hours to the Xbox One version of Ryse, I understand how a mediocre game can still spark your basest instincts, causing you to tap those buttons even when you understand that the ritual has become unhealthy, and even though many superior games deserve the attention you have lavished on a lesser one. I have a complicated relationship with Ryse: Son of Rome. I could never call it good, or imaginative, or varied. I can see through its obvious attempts to appeal to my most primitive impulses. But I can also say that Ryse succeeds in tickling your brain stem even when you know your time is better spent. I don't believe, however, that it deserves congratulations for having done it."}