{"ref": "https://www.gamespot.com/reviews/naruto-uzumaki-chronicles-2-review/1900-6178432/", "date": "September 7, 2007", "game_name": "Naruto: Uzumaki Chronicles 2", "text": "Namco Bandai's unrelenting barrage of Naruto-licensed games continues with Naruto: Uzumaki Chronicles 2. It's been roughly nine months since the original Uzumaki Chronicles hit the US, and though the sequel features a few new bells and whistles, these do little to mitigate the fact that the combat's too simple and too easy to be particularly entertaining. The threat faced in Uzumaki Chronicles 2 stems from the Shirogane clan, a nearly extinct group of ninjas that specializes in puppet mastery. In an attempt to release their master puppet from an ethereal prison, the remaining clan members have been savaging the countryside with their puppet army while looking for a set of mystical orbs. It's not a bad setup for a brawler like this, given that the puppets are basically robots, and robots are some of the finest cannon fodder you'll find. However, once it's up and running, you'll be constantly tormented with cutscenes of characters standing around and talking, all of which seem to drag on forever. Nothing terribly exciting ever happens during these cutscenes, and even the voice actors sound bored. Fortunately, you can skip these sequences without much consequence. Your mission objectives are always spelled out for you, and they usually just involve beating everyone up anyway. Shouldn't ninjas fighting robots be more fun than this? Uzumaki Chronicles 2 establishes a pattern very early on in the story mode. You start out at your base of operations in the Hidden Leaf Village, where you'll be given a mission objective. Once you leave the village, you'll be shown an overworld map with paths connecting various points of interest. As you travel toward your objective on the map, your journey will be regularly interrupted by surprise attacks from puppets or bandits, and you'll have to beat up everyone before you can continue. Once you've reached your destination, you'll more likely than not have to beat up more puppets and/or bandits. Some light puzzle-solving and platforming are peppered into the missions, but they're either too straightforward or too unclear to add much to the experience. After that, it's yet more random encounters as you head back to the Hidden Leaf Village to take on a new mission and do it all over again. Occasional boss fights mix things up a little, but not much. The simple, repetitive structure of the story mode wouldn't be so oppressive if the combat itself were more interesting. You can lock on to enemies, perform a few different jump and dash maneuvers, and juggle opponents with combos, but your basic ninjitsu abilities--which include an energized dash attack and the ability to generate a quartet of aggressive if short-lived clones--prove so potent right from the start that most fights don't require your full attention. You can goose your power levels to make the fights even shorter in a few different ways. Enemies drop copious amounts of virtue orbs, which can be used to boost character attributes. They also drop money, which can be used to buy health- and chakra-restoring items, as well as chips that can be placed on the skill plate. Chips can raise attribute levels, imbue you with new abilities, and more. Like the original Uzumaki Chronicles, one of the most engaging aspects of this game is organizing the chips on the skill plate so that you can fit as many on there as possible--and when inventory management is a game's high point, look out. The game makes a few ineffective gestures to differentiate itself from its predecessor, all of them flawed. In addition to playing as Naruto, there's a rotating cast of other ninjas that you can tag in and play as on the fly, but it's a totally inessential feature, considering that it's rare to find a situation that you can't easily handle with Naruto alone. Pouring all of your virtue orbs and cash into Naruto is simply more effective than spreading it out across multiple ninjas, especially because you don't always have access to the same support characters from mission to mission. There are side missions you can take on for various rewards, but their actual content isn't different enough from what you'll be doing in the main missions, and the rewards are unnecessary. There's two-player co-op support in the story mode, as well as some self-contained, one-on-one brawling, but both are sabotaged by the game's inherently disengaging combat. You'll sleep through the cutscenes, and sleepwalk through the actual combat. If Uzumaki Chronicles 2 offered some flashy visuals, it might've made the low-impact combat more fun to watch. What you get instead are stiff and blocky characters in small, repetitive environments, and an occasionally squirrelly camera. The sound is boilerplate Naruto, with some phoned-in voice acting and background music riddled with Japanese woodwinds. With less than a year between the release of Naruto: Uzumaki Chronicles 2 and its predecessor, it shouldn't come as much of a surprise that the game hasn't changed very radically. At the same time, the proximity of the releases, and the consistently middling level of quality, make this sequel feel that much more superfluous."}