{"ref": "https://www.gamespot.com/reviews/every-extend-extra-review/1900-6162418/", "date": "November 28, 2006", "game_name": "Every Extend Extra", "text": "With the release of Lumines and Meteos, Q Entertainment quickly established itself as a developer that could deliver fresh takes on familiar puzzle-game concepts while wrapping them up in stylish visuals and synthetic sounds, both of which would evolve over the course of the game. It worked fantastically with Q Entertainment's first two games, and Every Extend Extra sees this design concept applied yet again, but the returns on the concept have started to diminish. The sights and sounds of Every Extend Extra are quite attractive and varied, and half the fun is seeing how drastically the game's look changes from level to level. The actual gameplay is novel for a while, but it lacks the depth to keep you playing. Contrary to convention, the destruction of your ship is a key gameplay element. As with most puzzle games, the core concept in Every Extend Extra is suitably abstract. You control a star-shaped cursor that must navigate a field as formations of shapes and more aggressive, projectile-spewing enemies drift onto the field. Physical contact with any of these will cost you a life, and your only means for fighting back is to blow yourself up first. Hitting any of the face buttons will cause your cursor to explode, costing you a life, but it also sends out a shockwave that will destroy nearby shapes. These shapes will then release their own shockwave, destroying other nearby shapes, and so on. Having the patience to wait and knowing when to detonate are probably the most important skills for succeeding in Every Extend Extra. You have a limited number of cursors to detonate, and the only way to replenish them is to pick up colored gems left behind by certain enemies. Still, you can't wait around for too long, as there's always a time limit to worry about, and you need to earn a number of points to advance. Each level culminates in a boss fight that, while varying wildly in appearance, usually focuses on the same discipline of waiting for shapes to drift into just the right position that is needed in the regular game. Every Extend Extra is certainly interesting as a sort of Bizarro World take on the fundamental game concept of blowing yourself up is bad, but the concept doesn't seem to go anywhere. It certainly becomes more challenging as a greater number of faster-moving shapes and enemies appear, but the action feels much the same on the first level as it does on the last. A few different gameplay modes are included to prolong your interest, such as the caravan mode where you can play any levels you've already completed in the arcade mode, as well as a similarly structured boss-attack mode. As an interesting aside, the original Every Extend is included, though the lack of the interesting sights and sounds that drive Every Extend Extra keep it from holding your attention for too long. There's a two-player versus game to be played locally as well, where you have to try to create chain reactions to push a giant, meteor-type object residing in the upper-right corner of the screen onto your opponent's screen. Again, a concept that's kind of interesting, but the novelty wears out after a couple of rounds. The look always changes, but the simple gameplay doesn't. Even if Every Extend Extra doesn't flesh out its initially interesting gameplay concept, the game still does a great job of grabbing your attention, at least for a while, with its outstanding presentation. Part of what makes it look so good is how just about everything--save for your little cursor--looks completely different as you advance to each new level. The formations of shapes that you'll spend most of your time detonating can appear as twinkling stars, oddly shaped human skulls, stylized houseflies, and a variety of simple polygonal shapes. The backgrounds that you'll be playing against can be even more different from level to level, sometimes appearing as a flat background of soothing color patterns and other times giving you the sense of full three-dimensional space as you cruise through an abstract cityscape. The boss fights provide some of the game's best visual moments, as you battle with bizarre things that recall cybernetic plants and disco-themed spaceships. Every Extend Extra features a soundtrack that changes just as often as the visuals, though it maintains a blippy, psychedelic electronic sound with some consistency. Every Extend Extra probably has more in common with Q Entertainment founder Tetsuya Mizuguchi's work on Rez for the Dreamcast and PlayStation 2, which is to say that style has been given preeminence over substance. In and of itself, this isn't a bad thing, but it means you'll probably grow tired of playing Every Extend Extra before you grow tired of looking at it."}