{"ref": "https://www.gamespot.com/reviews/ghostbusters-spirits-unleashed-review-into-the-ether/1900-6417990/", "date": "October 26, 2022", "game_name": "Ghostbusters: Spirits Unleashed", "text": "If Illfonic Entertainment set out to make an authentic Ghostbusters experience, it's done so in Ghostbusters: Spirits Unleashed. The game's look, sound, and feel is true-to-form, right down to the voices of Dan Aykroyd and Ernie Hudson as Ray Stantz and Winston Zeddemore, respectively. Manning a proton pack and PKE meter for the first time in order to track and trap ghosts is a shot of ectoplasmic adrenaline. As a video game, however, it falls into a devious trap of its own, one where excitement hastily shifts to monotonous repetition. Spirits Unleashed captures the Ghostbusters feeling well, but that authenticity belies a shallow, repetitive game that quickly wears out its welcome.Spirits Unleashed puts you in the shoes of a new Ghostbusters recruit, a nameless grunt sent in to deal with the paranormal hauntings in New York City. The repurposed firehouse from the Ghostbusters franchise serves as your base of operations, and it features a workbench for upgrading gear, lockers to customize your Ghostbuster, and a training area to work out the kinks. Across the alley from the firehouse is an oddities shop run by Ray Stantz himself, where you can talk to the Dan Aykroyd-voiced character about the current goings-on.The core gameplay loop is an asymmetrical multiplayer experience, where four Ghostbusters take on a single ghost; the Busters must trap the ghost with no chance of escape, while the Ghost must evade capture and scare NPCs through noise and possession in order to fill a ~haunt meter.~ The ghost has three rifts that act as respawn points at its disposal, and when all three are destroyed, the ghost's next trip into a trap will mark victory for the Busters.With a group of five human players, this approach is a ton of fun. Ghosts can wreak all sorts of havoc, from sliming Ghostbusters by dashing through them to summoning small AI minions to distract the team. The ghosts also have full range of motion in the 3D space, which allows the ghost player to stick to the ceilings to stay out of reach in some rooms. Conversely, Ghostbusters can tether a ghost by firing the proton pack long enough, pulling the ghost in whichever direction they choose. Furthermore, the PKE meter has a quick blast that can take out multiple minions at once.That's the beauty of the gameplay system Illfonic has designed here: Every perk for one side of the battle can be countered by the other, and vice versa. Proton packs will overheat if used continuously for too long, so if a ghost can manipulate the tether long enough, it will break free. Should a ghost find itself in a trap, there is a ~last chance~ mechanic that will allow it to escape if done well. The push and pull of momentum in the heat of a match is done very well, and it makes for a ghoulishly good time to a point.I stress ~a group of five human players~ above because should any of the slots be filled by an AI companion/ghost, the experience buckles. The AI in Spirits Unleashed--particularly that of the Ghostbusters--is incredibly dumb, which sometimes results in decisions that actively hurt the team. In one match, I had a ghost tethered and was dragging it to an AI teammate's trap, and the instant I reached it, the AI picked the trap up, as if it decided ~nope, this match has to go a little longer.~ The team eventually did capture the ghost, but I could not get over that moment. It's a good thing Podcast--that was his name, no joke--was only an AI teammate or I might have chewed him out.No matter how many players are in a match together, the main issue with Spirits Unleashed--a deadly serious issue, unfortunately--is its longevity. Sure, it's fun in the heat of the moment, but those moments are fleeting and eventually give way to a feeling of tedium and monotony. Sometimes there's a literal lack of longevity, as one match played with four human Ghostbusters and one AI ghost lasted less than four minutes, but that's just a modicum of the real issue. There's an obvious lack of depth here, with the game's main game mode not offering enough of an experience to hold my interest for more than a match or two.The main gameplay mode's loop, as fun as it can be, doesn't have much to it: Ghostbusters enter a building, hunt for the ghost, fight the ghost, and that's it. That's the only mode available right now, and as mentioned above there are times where a match can be over in a blink. This problem is exacerbated by each of the five maps--which include a museum, a microbrewery, and a cruise ship--doing very little to stand out from one another despite their drastically different themes. Because of this, after a while matches begin to feel repetitive, which in turn begins to put a strain on the novelty of being a Ghostbuster. I want to dive headfirst into this role, but the game's only letting me into the ectoplasmic kiddie pool.That's not to say there aren't other activities in each match, but the ones that exist don't add enough. Talking bystanders down takes only two button presses. The collectibles to find in each map--including news clippings of the Ghostbusters' previous adventures and fungi of different sizes--are neat, but they don't serve any impactful purpose. The clippings fill a wall with readable journal entries, while the fungi contribute to a meter that gives extra experience at certain milestones. These small extras end up being inconsequential, and it's possible to completely ignore them while playing.Speaking of inconsequential, there's an original story featuring Akroyd and Hudson that plays out as you bust ghosts. Every once in a while, you'll return to the firehouse and be greeted with a one-off challenge, which sometimes is as simple as ~go talk to Ray in the shop.~ Once the unique scenes play out, it's back to the same gameplay loop. Other than brief respites from the monotonous main game--and admittedly great voice acting from everyone involved--the story adds very little to the overall experience. What does add a lot to the game, however, is its customization system. As you bust ghosts, you'll gain experience, which will allow you to earn new upgrades for all of your gear. These upgrades allow for some interesting builds depending on the stat boosts given, which gives you a lot of wiggle room for experimentation. One of my group members preferred tethering and dragging ghosts, so they picked upgrades that focused on strengthening the tether and making it easier to pull the ghost around. I liked sniffing out hidden rifts and ghosts, so I built up the PKE meter as much as possible. Building my best Buster is very cool I just wish I were able to do more with him.Ghostbusters: Spirits Unleashed does a terrific job of capturing the feeling of being a Ghostbuster. Illfonic clearly put a lot of time, effort, and love of the IP into this game, and playing it with pals is initially very fun, whether you're playing as a Ghostbuster or a ghost. However, the game's shelf life is incredibly short, as the gameplay loop quickly becomes repetitive and stale. There are wonderful elements here--deep customization being a key one--but none of it feels impactful when the core gameplay so quickly stagnates. Ghostbusters: Spirits Unleashed may make me into a Ghostbuster, but the job has a disappointingly small shelf life."}