{"ref": "https://www.gamespot.com/reviews/duke-nukem-3d-20th-anniversary-world-tour/1900-6416543/", "date": "October 12, 2016", "game_name": "Duke Nukem 3D", "text": "The famous ~Come get some!~ line from Duke Nukem 3D served as a call to battle. This was a crewcut-sporting action hero who also wanted people to hail him as the king, so he wasn't exactly big on introspective moments. But now we've moved on to the 20th Anniversary World Tour edition of this revolutionary 1996 shooter, and I have to ask myself if I still want some of what the Duke is offering. And I'm afraid that I have to politely--and somewhat regretfully--decline.As much as the original game is one of my favorites from the golden age of PC gaming, this slightly enhanced, expanded revamp is worth little more than a brief look back to see how far we've come in the past two decades. And it's not like we havent been down this road before. Duke Nukem 3D has been re-released a number of times over the past 20 years, most recently as part of the encyclopedic Megaton Edition that hit Steam in early 2013 but has since been pulled offline to make way for this new version.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Duke Nukem 3D: 20th Anniversary - Raw Meat Gameplay20th Anniversary World Tour is slightly different from other re-releases, though. For starters, this edition contains some visual and audio refinements. The appearance of every level has been subtly improved, and new lighting gives the game a cleaner, less murky look--although everything's still very pixelated, to the point where enemies morph into chunky blobs of color when they get close. You can freely flip between the old and new visuals, which lets you see just how superior the lighting is today. Still, it's tough to pick out fine details in level architecture, which can lead to some scavenger hunts to find the way forward. This was a problem back in the day, and it remains one now. As with the graphics, the core sounds and music have been cleaned up to simply sound better while not losing the 1990s charm of the original effects. And original Duke Nukem 3D voice actor Jon St. John has re-recorded all of the Dukes iconic quips and added a few new ones, giving new life to the games action-movie-hero vibe.But the new visual features are a little understated. A more thorough visual remastering would've made the game a little easier on the eyes--and more acceptable to a modern audience. As it is, the game is ugly by today's standards, especially in close-quarters battles. Even if you like the retro-purist approach, it wouldn't have hurt to have provided more extreme graphical improvements so that gamers could make the call whether or not to go old school.Another big change is the addition of a new fifth episode titled Alien World Order. This chapter allows you to keep rolling with the Duke after the original conclusion of the game and battle the extraterrestrials in seven new levels set all over the globe. You blow up baddies in the seedy red-light district of Amsterdam, near Red Square in Moscow, through the tweedy laneways of London with Big Ben looming overhead, among the ruins of ancient Egypt in Cairo, in the quaint streets of Paris, alongside the devastated Golden Gate Bridge in San Francisco, and finally head back to Hollywood and outer space for a new boss battle (that doesn't carry anything close to the impact of the stadium battle that closed the original Duke Nukem 3D). Every level has been designed as it would've been back in 1996, with the same focus on finding your way through maze-like corridors, securing key cards to unlock doors, and, of course, blasting mobs of aliens.All of the new levels are challenging, and they slot in nicely with the originals. If you're playing the game in order--and you don't have to here, since everything is unlocked from the start of play--the new episode flows seamlessly from the old ones. But you have to really be committed to the original game (and its now-very-dated style of play) to fully appreciate these new levels. I was initially impressed by just how much the developers nailed the particular design sensibilities of the original Duke Nukem 3D--but then became annoyed by how little they sought to improve things. Level design is labyrinthine in too many places, and searching for the key cards needed to open doors just grew steadily more annoying as I plugged through Dukes world tour.Taken together, the old and new levels reminded me of how odd the original Duke Nukem 3D was. It had all the superficial trappings of a run-and-gun shooter but also intricate, maze-like level design with a ton of interactive features (including some decidedly non-politically correct moments that helped make the game such gleeful, raunchy fun).Even though theres a lot of content offered up here, it isn't as complete a package as the one offered just a couple of years ago on Steam.One final noteworthy change between the 20th Anniversary World Tour take on Duke Nukem 3D and some of its preceding re-releases is the amount of content. While the 2013 Megaton edition collected all of the original Duke Nukem 3D content, including the Duke It Out in D.C., Duke Caribbean: Life's a Beach, and Duke: Nuclear Winter expansion packs released in the late '90s, this one features just the core four episodes from the original Atomic Edition of the game from late 1996 and the new episode described above. So even though theres a lot of content here, it isn't as complete a package as the one offered just a couple of years ago on Steam.Not much else distinguishes the 20th Anniversary Duke Nukem 3D from its predecessors. A commentary option lets you get the skinny on various parts of the original levels, though there isn't much of it, and the comments seem to mostly focus on the beginning levels of each episode. The game also includes full multiplayer along with Workshop support for homemade user maps. Finally, it features the innovative replay-slider save system that lets you rewind the action to any just-played point in the level every time you die.Even though I wanted to love Duke Nukem 3D: 20th Anniversary World Tour, if even just to dig into the nostalgia evoked by replaying a game that absorbed a lot of my spare time in 1996, the only emotion aroused was a sense of amazement at just how far shooters have come in terms of graphics, immersion, and level design in 20 years. The Duke may forever be the king, but he's the king of 1996, and his game is so set in a particular time and place that it should probably be left there."}