{"ref": "https://www.gamespot.com/reviews/lords-of-the-fallen-review/1900-6415929/", "date": "October 29, 2014", "game_name": "Lords of the Fallen", "text": "His name is Harkyn. He exits conversation not with a goodbye, but with a gruff ~I don't care,~ as if he can barely be bothered to embark on the quest at hand. Harkyn may not be delighted by the adventure he's been thrust into, but I can claim no such apathy: Lords of the Fallen is a dark-fantasy pleasure, cut from the same cloth as Dark Souls, yet distinct enough to earn its own spotlight and, perhaps, to earn your affection as well. Harkyn himself is not easy to love, but ultimately, he doesn't matter as much as the world he serves and the hammers he swings.~World~ might be too generous a word, actually: You spend most of your time in corridors and combat arenas, not gazing onto spacious landscapes. Lords of the Fallen's dramatic citadel and hushed monastery are suffering from the invasion of otherworldly flesh-monsters and armored behemoths. Snowy peaks may rise in the distance, but you will not be breathing in their refreshing air. Lords of the Fallen means to choke you with smoke and poison, and to crush you between the stone slabs that line its monumental suspended bridge. The view from this bridge says more about this world than words can convey. Ahead of you lies the gaping maw of a demonic temple hungry for your flesh. The massive chains that connect your destination to the bridge must have taken hundreds of hours to forge. Two colossal soldiers are carved into the mountain on either side of the entrance, warning you of the blood that will soon be spilled. This is Lords of the Fallen: ponderous and unwelcoming. There is no hiding from its dangers.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Lords of the Fallen Video Review Unwisely, the game insists on trying to weave a coherent story into these spaces, with each of Harkyn's cohorts and various audio logs tossing up a word salad that does little to get you invested. In time, the story begins to make sense, but this cliched tale of the balance between good and evil isn't the reason to press on. Instead, it's better to let the frozen walkways and giant braziers speak for themselves. You may begin your adventure in a holy sanctuary, but this place seeks to murder you. Consider the titles of the bosses you fight. Guardian. Beast. Champion. Who needs proper names, when ~Annihilator~ gets the point across? These titans and their lesser cohorts have no other purpose than to kill.You fight several such rivals in the first few hours (out of 20 or so) alone, though it takes time to reach the most formidable ones. In the meanwhile, you roam the game's corridors from a third-person perspective, swinging an axe or sword, dodging or blocking incoming attacks, and occasionally calling on the gods of magic to give you a hand when you most need it. It's almost impossible not to draw the obvious comparisons to the Souls series here. An energy meter depletes when you block, roll, and attack, forcing you to closely manage your defenses lest you leave yourself vulnerable to damage. Different melee weapons require different approaches, but Lords of the Fallen gives each of them an authentic sense of weight. Combat requires understanding of how long it takes to swing that humongous greatsword you carry, and how much time that fire-breathing thing you're fighting takes to prepare its next blow.Lords of the Fallen's dramatic citadel and hushed monastery are suffering from the invasion of otherworldly flesh-monsters and armored behemoths.So far, so Dark Souls then. Compared head to head, Souls games are superior to Lords of the Fallen in most given areas: Dark Souls is more mysterious, more difficult, and more diverse, and Lords of the Fallen features no online connectivity. To call Lords of the Fallen a poor man's Dark Souls sells it entirely too short, however. For one, Lords of the Fallen strikes a different kind of tone. It is moody and oppressive, but rarely terrifying; it is a power fantasy, not a heart-wrenching death simulator that rolls deadly boulders at you as if you are a single, miniscule bowling pin. The art style reflects the difference: armor and architecture is less Medieval, chunkier and excessively ornate, mirroring Harkyn's strength and confidence. Lords of the Fallen has a few challenges, but it's rare for you to feel frail or afraid: the game simply isn't hard enough to make your blood boil. That's at least true in the main world; the visits you make to a shadowy and sinister otherworld are more frightening.Those visits bring great reward if you can conquer the darkness. Traversing this otherworld is like exploring a foggy dessert during the witching hour: you can barely see further than the tip of your blade, which make the occasional glimpse of light a true ray of hope. There is tribulation to undergo, however, before you reach possible treasure. Your steps into the beyond lead you first to easily-dispatched knights and mutants, which require only that you put the finicky targeting system to good use. Soon, though, you could encounter a rolling fire demon whose flaming carapace will quickly scorch your flesh. Your introduction to this dimension is a limited one, fortunately: you open a few treasure chests in the hope of finding a rune for upgrading your equipment, a new armor set, or an item that temporarily protects you from poison, and then return to the land of women and men. You reach this realm by entering portals that only unlock when you have killed some unknown beast. You will come to identify an available nearby portal by the crackles and creaks it makes as it opens, as if it's made of ancient tendons that haven't often had a chance to stretch.The grind to level up is minimal, and while death is likely, it's not frequent enough to elicit heartache. When you perish, you leave behind your ghost and (usually) revive at whichever ruby crystal you last saved at. Your ghost contains all the experience you have accumulated since the prior death, but it doesn't remain forever, so it's in your best interests to go retrieve it, and to be timely about it, at least in the early hours. Every fallen enemy will have respawned after your death, but you will be armed with the knowledge of what lies ahead of you. You will also be armed with some spells and a gauntlet that shoots out magic projectiles, spews fire, and helps open new pathways. Selecting and casting spells is a matter of pressing or holding a button: there's no need to switch from a dagger to a wand if you want to punch a demon in the groin with your quake skill. There are no bows and arrows in Lords of the Fallen: it's all swords and sorcery. You can engorge on magic when leveling up and make quick work of the three-legged freak known as the infiltrator if you play your cards right. I prefer the heaviest killing tools, however, coming close enough to my foes to smell their breath.You will probably not sob when your ghost expires and you leave behind all your experience. Experience can be regained easily, and in the last several hours, you accumulate too little experience from killing enemies to mind the loss. The bosses may parade around their ominous titles and roar with indignance, but most of them are more bark than bite: if you have Souls experience, many will go down on the first attempt. The challenge ramps up nicely during the lead-up to the final showdown, however, beginning with a double-boss encounter that signals trouble to come.The greatest challenge Lords of the Fallen provides isn't a welcome one: it's easy to lose yourself in the crypts and corridors, unsure of where the game means for you to go. Every region cleverly connects with others, and unlocking a new door often leads you to a familiar area, provoking cries of ~Eureka!~ That interconnectedness can also be a burden, however, particularly when a loading screen is there to interrupt your travels. Dark Souls has no quest log, yet smartly uses its visual diversity and clear environmental gating to direct you. Lords of the Fallen tells you what you must do, but some areas are so circuitous and same-ish, and some entrances so subtle, that the game can become aimless. Backtracking is sometimes required, so you may not know where the right path lies.Intriguing subtleties ultimately overcome any resulting tedium, however. You choose whether to save a man's life by amputating his arm--and then, whether to offer him a potion to help heal the wound you dealt him. Offering the potion diminishes your available (and replenishable) health draught count by one, but I was never sure if I had earned any reward for allowing him to live. Soon afterwards, I convinced a fellow warrior to spare a monk's life; I'm not sure there were any repercussions, but I was at least content to know that Harkyn was not always the vile executioner others insisted he was. Later, you get to make a more interesting life-or-death decision, and in at least one case, can circumvent danger entirely. Lords of the Fallen has a brief brush with mystery in these circumstances, inspiring ~what if~ quandaries. What if I ignore the order to request a group of deserters? What if I go around the monster rather than meet it head-on? Should there be a Lords of the Fallen 2, I hope for more what-ifs, and more-meaningful consequences to accompany them.The bosses may parade around their ominous titles and roar with indignance, but most of them are more bark than bite. Superficially, you could call Lords of the Fallen a Souls game for the meek and the uninitiated. But it earns more respect than such a flippant description. Lords of the Fallen isn't about the game that it isn't, but the game that it is. It's about the ghoulish blacksmith, his glowing eyes, and the long tufts of stiff hair that rise from his scalp. It's about the crunches of iron against bone when your hammer finds its mark. It's about taking in new sights and sounds, and about finding new ways to travel to old ones. It's about that suspended bridge, the monuments that guard it, and the creatures waiting within. Harkyn may have no use for these places, but there are riches inside nonetheless."}