{"ref": "https://www.gamespot.com/reviews/mickeys-speedway-usa-review/1900-2654543/", "date": "May 17, 2006", "game_name": "Mickey's Speedway USA", "text": "Rare, one of Nintendo's only creators of M-rated games, has taken some time away from the head-shot brutality of shooters like Perfect Dark and the raunchy platform action of Conker's Bad Fur Day to return to its sunny side. The first product of Rare and Nintendo's happy alliance with Disney is Mickey's Speedway USA. A happy kart racer featuring some of Disney's brightest stars, Mickey's Speedway USA is simplification personified, as it places the emphasis on high-speed kart racing with no frills. If you thought Diddy Kong Racing was on the cartoon side, wait until you get a load of Mickey's Speedway USA. The license is so restrictive that racers apologize for passing one other. Mickey, Donald, Goofy, and the crew are all playable on the game's 20 tracks, as you attempt to rescue Pluto, who has been kidnapped by weasels. The primary single-player mode consists of several series that gradually build in difficulty. There are three difficulty settings for each series. If you get gold medals in each series on the hardest difficulty, a fourth series opens up. If you find all four hidden car parts scattered throughout the tracks, a fifth series becomes available. By the third circuit, the carts become much faster and precise, and powersliding skills are required to place in the top four. For a game that is obviously targeted at children, the difficulty level is too high. For experienced players, completing each circuit with a platinum cup will result in some sweaty palms. The multiplayer mode provides all 20 tracks for racing and four arenas to battle in. The battle arenas for the contest mode are single-tiered, which eliminates one of the best attacks in all of kart racing - death from above. While it's not as fun as Mario Kart 64's battle mode, it's not as lonely as Diddy Kong's either. Like most kart racers, Mickey's has plenty of weapons and power-ups. There are paint splotches that cause karts to spin out, remote-controlled planes that seek those ahead, a weather power-up that causes it to rain on the other drivers, and baseballs that can be fired or placed in strategic places for a nice surprise, among others. While not overly original, the weapons are fun to use and well balanced. The track design, on the other hand, is too straightforward. The keys to speed are collecting the coins scattered around the tracks, which increase the kart's top speed, and hitting zips, which provide a free turbo boost. The amount of branching paths and challenging shortcuts is limited, and there aren't many raised portions of the track that give you a better view of things. Compared to Diddy Kong's tracks, which feature icy loops and hairpin turns, Speedway USA's tracks are tame. The largest obstacle to overcome is memorizing the tracks. The blinding hills that constantly hinder viewing the next turn make it difficult to succeed on skill alone. Often it's difficult to tell which direction the track is leading, especially in the multiplayer, where graphical detail is cut back. Mickey's Speedway USA has a nice look, but it's bare-bones when compared with the graphics of other titles in the genre - even Diddy Kong Racing. The draw-in distance is limited, despite the lack of off-track events, and the environments fail to come to life. Each track is supposed to take place in a specific American city, but one recognizable landmark per track isn't enough to be convincing. Why the developer limited itself with a city theme is befuddling. Considering the vast archives of animation that could have been used, the choice of subject matter shortchanges the license.The karts kick up particle effects like grass, dust, and water, while reflection routines and real-time lighting and shadows are displayed all at the same time. It makes for some excellent moments, but sometimes things are just too barren and plain. The frame rates rarely get jumpy, but this is at the expense of the level of detail and the polygon count. Texture variety has never been a problem with Rare's Nintendo 64 games, and it isn't here either. Each track has its own unique look, and despite their long length, the textures never become repetitive. Mickey's Speedway USA is one of the Nintendo 64's better looking racers, but the small touches that make you crack a smile, like driver head tracking, just haven't been included. Rare is one of the few Nintendo 64 developers that employs Dolby Surround sound in its games, and it shines in Speedway USA. Racers coming up from behind can be heard over the appropriate shoulder, and the sound effects emanating from each of the six carts keep the action intense. Each Disney character has a deep catalogue of voice samples, and they call each other by name. Taunts like, ~I thought we were friends~ and ~I knew I would win~ jump off the cart at an alarming rate. Once the taunting cheat is opened up, taunting other drivers at will is just a button press away. The musical compositions aren't especially strong, but they're fitting nevertheless, and the overall sound quality is excellent, with rich bass and piercing highs. Don't be fooled by its cuddly exterior. With 20 tracks, four battle arenas, and a plenitude of hidden characters and cheats to unlock, Mickey's Speedway USA has enough substance to keep even the most dedicated kart racing fanatics coming back for more. While young ones will find later circuits far too difficult, those who can get past the colorful exterior will find a deep racer full of things done well, but often done better in other games. While not a genre buster, Mickey's Speedway USA is one tough nut in a colorful wrapper.The karts kick up particle effects like grass, dust, and water, while reflection routines and real-time lighting and shadows are displayed all at the same time. It makes for some excellent moments, but sometimes things are just too barren and plain. The frame rates rarely get jumpy, but this is at the expense of the level of detail and the polygon count. Texture variety has never been a problem with Rare's Nintendo 64 games, and it isn't here either. Each track has its own unique look, and despite their long length, the textures never become repetitive. Mickey's Speedway USA is one of the Nintendo 64's better looking racers, but the small touches that make you crack a smile, like driver head tracking, just haven't been included. Rare is one of the few Nintendo 64 developers that employs Dolby Surround sound in its games, and it shines in Speedway USA. Racers coming up from behind can be heard over the appropriate shoulder, and the sound effects emanating from each of the six carts keep the action intense. Each Disney character has a deep catalogue of voice samples, and they call each other by name. Taunts like, ~I thought we were friends~ and ~I knew I would win~ jump off the cart at an alarming rate. Once the taunting cheat is opened up, taunting other drivers at will is just a button press away. The musical compositions aren't especially strong, but they're fitting nevertheless, and the overall sound quality is excellent, with rich bass and piercing highs. Don't be fooled by its cuddly exterior. With 20 tracks, four battle arenas, and a plenitude of hidden characters and cheats to unlock, Mickey's Speedway USA has enough substance to keep even the most dedicated kart racing fanatics coming back for more. While young ones will find later circuits far too difficult, those who can get past the colorful exterior will find a deep racer full of things done well, but often done better in other games. While not a genre buster, Mickey's Speedway USA is one tough nut in a colorful wrapper."}