{"ref": "https://www.gamespot.com/reviews/warhammer-battle-march-review/1900-6197400/", "date": "September 8, 2008", "game_name": "Warhammer: Battle March", "text": "How are the controls? That question always leads the way in any review of a real-time strategy game on a console system, given that guiding hundreds of units around battlefields with a gamepad can be about as pleasant as herding cats. And, unfortunately, the answer in regard to Warhammer: Battle March is: Not so good. This Xbox 360 take on the 2006 RTS Warhammer: Mark of Chaos is a straight rehash of the original PC game with gamepad controls tacked on--bad gamepad controls. This system doesn't even come close due to convoluted button combos and an unforgiving fast pace. Although the game mirrors its PC predecessor in bringing to life the armies of Games Workshop's tabletop miniatures phenomenon, too much gamepad fussing gets in the way of scrapping it up with the Empire, Orcs, and forces of Chaos. Storm the castle! Battle March features lots of intense battlefield action, including a fair number of Helm's Deep-style moments. It's a shame that the controls are so unwieldy, because the core game is a solid, if simplified, translation of the Warhammer universe and its rules for tabletop warfare. As with the miniatures tabletop games, the focus of Battle March is, of course, battling. Three campaigns tell the story of an invasion from the North, and you can of course play all three factions involved in that conflict: the evil Hordes of Chaos invaders, the defending troops of the Empire, and the Greenskin tribes of the orcs and goblins (a new campaign just added to the PC's Mark of Chaos in the Battle March expansion). Each side features units drawn solely from the tabletop game, from the companies of grunts that serve as shock troops to heroes that lead your armies. They aren't all depicted entirely accurately, although the attention to detail is thorough and deep enough that you won't notice unless you have a rulebook open on your desk while playing. However, the campaigns lack depth. Missions are strung along linear paths wherein you guide your army on a straight line of battles, only stopping in at encampments every so often to purchase reinforcements, heal injured units, get troops blessed at a temple, and buy gear such as magic swords and morale-raising banners for your heroes and soldiers. There aren't any serious tactical concerns to be addressed, and all you really need to do is focus on shoring up troop numbers and buying the odd accoutrement that can turn the tide of a battle. Stories aren't really developed in the campaigns, either, which makes the overarching tale of a massive invasion and insidious plots involving every race in the Warhammer world seem awfully limp. Aside from the opening cinematic of an Empire company of troops being ambushed by Chaos warriors--a spectacular clip that also kicked off the PC game back in 2006 and remains impressive today--the missions are all introduced with bland text scrolls. Objectives generally break down to easy-to-understand tasks such as ~take that hill,~ ~defend that town,~ ~besiege that castle,~ ~duel that enemy hero,~ and ~set up that artillery,~ so you don't need wordy cutscenes getting between you and the action. But the storytelling is so scaled-back that these text intros wreck any sense of dramatic tension and make the game seem like a cookie-cutter RTS when you're not actually in the field slaughtering your foes. When you get right down to it, Warhammer: Battle March is a game that's all about the battlefield. And that's exactly where this 360 game begins to seriously lose its appeal, due to the poorly implemented gamepad control scheme. Quite simply, it's just too convoluted. Basic command and movement orders are pretty much straightforward, as is the rock-paper-scissors formula that predictably dictates that spearman fare well against mounted foes, and mages should stay at the back of the formation. Conversely, many of the actions you need to employ to win battles are not so simple. Grouping units, aligning troop columns to face a particular direction, picking a hero, and activating an item all involve complicated combo button presses using the triggers and bumpers. Considering that battles are very hurried, it's all too easy to forget what to do in the heat of the moment and lose a company of units or even a hero. Maneuvering multiple columns of troops is where Battle March gets into trouble, due to the convoluted control scheme and the speedy battles. Perhaps the pace should have been slowed down in this console adaptation to better match the gamepad's capabilities. Or maybe the control system should have been simplified. At any rate, what's here doesn't entirely work. It stumbles along fine for basic maneuvers and attacks, but falls apart when things get heated and you need to look after more than a half-dozen or so regiments. You can't even get into a routine and grow accustomed to the demands of the gamepad because every mission has its share of slow moments that will lull you to sleep. By the time things rev up, you're often taken by surprise and need to spend a few moments getting back up to speed...and by the time that you do, you're toast. Shifting from the PC to the 360 has also cost the game another one of its big attractions. The ability to custom-craft armies and throw them into battle online was a highlight of Mark of Chaos and the Battle March expansion on the PC, but these features are almost worthless here because few people are playing the game via Xbox Live. It seems that most of the hardcore Mark of Chaos players have stuck with the PC, which isn't all that surprising given that the PC remains the preferred platform for RTS gaming. You can still build armies and take on the computer in solo skirmishes, though this seems tame in comparison to fighting other human players. The AI is rather predictable, too, and it generally plays every map in the same fashion. Consequently, skirmish play gets old pretty fast. Visuals and sound come with their share of troubles, though the look of the game is generally superb. Miniatures are fully detailed and as colorful as if they were tabletop figures customized by a master painter. If you're a Games Workshop aficionado, you can't help but get revved up by seeing these troops moving, hacking, and slashing for ~real.~ Battlefields are somewhat black and bleak, to the point that it can be hard to make out terrain features. Nevertheless, you can't critique the backdrops too much because they are perfectly in line with the grim Old World setting of the Warhammer universe. Audio is more problematic. Only the soaring score by acclaimed game composer Jeremy Soule is without issues. Atmospheric sound effects and voice samples drop in and out constantly during battles, which is incredibly annoying when you're trying to concentrate on slaughtering a pack of holier-than-thou Empire goons. It seems to occur in every mission; it's the kind of severe problem that normally accompanies only extremely choppy visual frame rates, but in this case the game flows along fine graphically. If you're jonesing for some Games Workshop miniatures action, stick with the PC edition of Warhammer: Mark of Chaos and the Battle March expansion. Precise controls and a superior selection of online opponents make it a much better option than this Xbox 360 port. Perhaps the pace should have been slowed down in this console adaptation to better match the gamepad's capabilities. Or maybe the control system should have been simplified. At any rate, what's here doesn't entirely work. It stumbles along fine for basic maneuvers and attacks, but falls apart when things get heated and you need to look after more than a half-dozen or so regiments. You can't even get into a routine and grow accustomed to the demands of the gamepad because every mission has its share of slow moments that will lull you to sleep. By the time things rev up, you're often taken by surprise and need to spend a few moments getting back up to speed...and by the time that you do, you're toast. Shifting from the PC to the 360 has also cost the game another one of its big attractions. The ability to custom-craft armies and throw them into battle online was a highlight of Mark of Chaos and the Battle March expansion on the PC, but these features are almost worthless here because few people are playing the game via Xbox Live. It seems that most of the hardcore Mark of Chaos players have stuck with the PC, which isn't all that surprising given that the PC remains the preferred platform for RTS gaming, and that this version of the game can now be found in bargain bins for less than $20. You can still build armies and take on the computer in solo skirmishes, though this seems tame in comparison to fighting other human players. The AI is rather predictable, too, and it generally plays every map in the same fashion. Consequently, skirmish play gets old pretty fast. Visuals and sound come with their share of troubles, though the look of the game is generally superb. Miniatures are fully detailed and as colorful as if they were tabletop figures customized by a master painter. If you're a Games Workshop aficionado, you can't help but get revved up by seeing these troops moving, hacking, and slashing for ~real.~ Battlefields are somewhat black and bleak, to the point that it can be hard to make out terrain features. Nevertheless, you can't critique the backdrops too much because they are perfectly in line with the grim Old World setting of the Warhammer universe. Audio is more problematic. Only the soaring score by acclaimed game composer Jeremy Soule is without issues. Atmospheric sound effects and voice samples drop in and out constantly during battles, which is incredibly annoying when you're trying to concentrate on slaughtering a pack of holier-than-thou Empire goons. It seems to occur in every mission; it's the kind of severe problem that normally accompanies only extremely choppy visual frame rates, but in this case the game flows along fine graphically. If you're jonesing for some Games Workshop miniatures action, stick with the PC edition of Warhammer: Mark of Chaos and the Battle March expansion. Precise controls and a superior selection of online opponents make it a much better option than this Xbox 360 port. Perhaps the pace should have been slowed down in this console adaptation to better match the gamepad's capabilities. Or maybe the control system should have been simplified. At any rate, what's here doesn't entirely work. It stumbles along fine for basic maneuvers and attacks, but falls apart when things get heated and you need to look after more than a half-dozen or so regiments. You can't even get into a routine and grow accustomed to the demands of the gamepad because every mission has its share of slow moments that will lull you to sleep. By the time things rev up, you're often taken by surprise and need to spend a few moments getting back up to speed...and by the time that you do, you're toast. Shifting from the PC to the 360 has also cost the game another one of its big attractions. The ability to custom-craft armies and throw them into battle online was a highlight of Mark of Chaos and the Battle March expansion on the PC, but these features are almost worthless here because few people are playing the game via Xbox Live. It seems that most of the hardcore Mark of Chaos players have stuck with the PC, which isn't all that surprising given that the PC remains the preferred platform for RTS gaming, and that this version of the game can now be found in bargain bins for less than $20. You can still build armies and take on the computer in solo skirmishes, though this seems tame in comparison to fighting other human players. The AI is rather predictable, too, and it generally plays every map in the same fashion. Consequently, skirmish play gets old pretty fast. Visuals and sound come with their share of troubles, though the look of the game is generally superb. Miniatures are fully detailed and as colorful as if they were tabletop figures customized by a master painter. If you're a Games Workshop aficionado, you can't help but get revved up by seeing these troops moving, hacking, and slashing for ~real.~ Battlefields are somewhat black and bleak, to the point that it can be hard to make out terrain features. Nevertheless, you can't critique the backdrops too much because they are perfectly in line with the grim Old World setting of the Warhammer universe. Audio is more problematic. Only the soaring score by acclaimed game composer Jeremy Soule is without issues. Atmospheric sound effects and voice samples drop in and out constantly during battles, which is incredibly annoying when you're trying to concentrate on slaughtering a pack of holier-than-thou Empire goons. It seems to occur in every mission; it's the kind of severe problem that normally accompanies only extremely choppy visual frame rates, but in this case the game flows along fine graphically. If you're jonesing for some Games Workshop miniatures action, stick with the PC edition of Warhammer: Mark of Chaos and the Battle March expansion. Precise controls and a superior selection of online opponents make it a much better option than this Xbox 360 port."}