{"ref": "https://www.gamespot.com/reviews/phantom-crash-review/1900-2897748/", "date": "November 15, 2002", "game_name": "Phantom Crash", "text": "The concept of humans piloting impossibly hulking and complex war machines is an idea that has permeated most every aspect of Japanese pop culture for decades. The pervasiveness of this idea has allowed for a great many different takes on it, and the giant robot take seems to be coming to a head on consoles right now, with no less than four distinctly different giant robot games appearing in the last month. One of the four is Phantom Crash, which looks like your average mech combat game at first glance, but is actually quite impressive in certain areas. When you first put in the disc, you'll probably notice a distinct dearth of options on the main screen. There's a versus mode, which lets you and a friend find out who has the better robot, and there's a quest mode, which is where you'll spend the majority of your time in Phantom Crash. The quest mode is a straightforward single-player game that sprinkles small bits of an amusing and surprisingly personal story concerning a group of catty but good-natured giant-robot pilots in between some outrageously fast-paced battles. The story itself is rather inconsequential, but the fun banter between the characters does a good job of setting the mood. Like games populated by large, frighteningly destructive robots, Phantom Crash is set in a world that is more or less a postapocalyptic wasteland, replete with a sagging, dilapidated city structure and a drab, rusted-out color palette. In contrast, the characters who populate this bombed-out dystopia are all cheery and enthusiastic, and instead of using the robots to fight an intergalactic war or whatever, the kids do battle against each other in the mechs (called scoobees here) in enclosed arenas for sport. If you look past the dilapidated veneer of Phantom Crash, you'll see that this game has more in common with Pokmon or Tecmo's Monster Rancher series than the more serious fare of MechAssault or Zone of the Enders. Actually, the general structure of Phantom Crash looks and feels remarkably similar to that of Yumekobo's Bio Motor Unitron for the NeoGeo Pocket Color. You start off as an anonymous pilot with some cash. This initial capital is just enough to buy yourself a half-decent scoobee from Club Wired, the coordinator of the battles. Once you've picked up your first robot, the game falls into a nearly endless pattern: Fight, use your winnings to repair and upgrade your current scoobee or buy another one, read some dialogue, and repeat. The ultimate goal is to become the best pilot in town, which means you'll have to work your way up through the ranks and prove yourself to the current champions of the game's four different arenas. That's not going to happen without earning a lot of cash and making lots and lots of incremental upgrades to your machine, and you'll probably split your time in Phantom Crash between tweaking your scoobee and actually piloting it. Scoobees are built by three different companies--Ventuno, American Stars, and Kojima Heavy Industries--and each manufacturer has several different models. Additionally, you can find a menagerie of aftermarket upgrades at Wild Machines, the in-game store. Any upgrade you make to your scoobee's various components--including its arms, legs, hull, shoulder-mounted weapons, and optic camouflage unit, among others--will affect the mech's balance and handling. The game also has a dedicated tune-up shop, Plustech, where you can fine-tune the weight of the individual components of your mech. There are some wonderful superfluous upgrades you can make as well, including applying some wild paint jobs and decals and visiting SonicAmp, the in-game music store, to buy different songs to listen to while battling. But one of the most important pieces of your scoobee is the CHIP, a strange, animal-based intelligence that works as a sort of interface between you and the machinery. The experience of your CHIP can affect the range of your lock-on and attack capabilities, and aside from micromanaging the scoobee for you, each CHIP has its own personality, more or less acting as your sidekick during and in between battles. The level of customization in Phantom Crash is just amazing, and it lends the game a real role-playing game feel. When you're in the actual arena, you might be surprised by how the scoobees handle. Though all the scoobees have a realistic, mechanical look to them, they're quite nimble on the ground and can launch themselves high up into the air at the drop of a hat. The pacing is just a touch faster than what you'll find in the other current giant robot game for the Xbox, MechAssault. The name Phantom Crash doesn't really make a lot of sense until you learn about the stealth capabilities of the scoobees. With the press of a button, you can turn your mech virtually invisible,  la Predator. This provides a great tactical advantage, but only for a few fleeting seconds, after which you'll have some downtime before you can activate your stealth capabilities again. The action is fast, and the AI gets incredibly devious later on, putting up a satisfying fight, but the game is hindered by a lack of variety. Each environment is structurally unique, and the abandoned subway access area is especially intriguing in a strategic sense, but you'll fight dozens upon dozens of battles in the same four arenas, against the same half dozen or so scoobee types, over and over again. The only other real gripe to be had about Phantom Crash is the scoobees' slow turning abilities. It's not detrimental to the gameplay, but a quick swivel feature of some kind would've quickened the pace and eliminated those annoying moments when you're scrambling to face an attacker who's pummeling you from behind. Phantom Crash has a look that oscillates between retro and cutting edge. When you're in the shops, the other characters and their respective CHIPs are represented with mostly static prerendered images that are so low-res and blocky it almost appears to be a purposeful design choice. However, once you head into the arena, the game shows off some technical prowess. Every scoobee is modeled with a great amount of detail, with nice, tiny, quasi-mechanical touches that lend the machines some real-world believability. The arenas skillfully convey a burned-out, dystopian future, and though they're technically well done, the drab earth tones don't make them the most interesting environments to look at. Most of the special effects, like the smoky glow of the missiles, are subtle, but the effect of activating your scoobee's stealth capabilities is just awesome, and it probably couldn't have been done without that Xbox muscle. There's some minor slowdown in Phantom Crash, and it can be annoying, but it never really becomes a major issue. The skirmishes in the arena are complemented by some sharp sound effects, but any nuances that might exist are summarily drowned out by the game's extensive and unique soundtrack. Produced largely by Japanese pop groups, the music covers a lot of different genres, like stripped-down rock music, dance music, acoustic folk music, and some really strange, high-concept stuff, but it all has a certain Asiatic feel. As mentioned earlier, you can customize exactly what music you want to listen to while in battle, making it possible to cull out those songs that don't especially appeal to you. For all that it does right, Phantom Crash comes up short in a few key areas, keeping it from attaining any sort of true greatness. Simply put, the game could've benefited from a greater number of arenas, a more diverse variety of scoobees, and more gameplay modes. Hopefully, Phantom Crash will garner enough positive attention to prompt Phantagram to release a follow-up, because there's the potential here for something incredible."}