{"ref": "https://www.gamespot.com/reviews/all-star-baseball-2003-review/1900-2855158/", "date": "March 14, 2002", "game_name": "All-Star Baseball 2003", "text": "Since there are a few gaps left to fill in the PlayStation 2's software library, buying games for the console has finally become a matter of choice vs. necessity. This aesthetic holds true when considering baseball games on the console. With EA's Triple Play 2002, 3DO's High Heat 2003, and Acclaim's All-Star Baseball 2003 all being released so close together, it's difficult to find the real winner. Despite the competition, All-Star Baseball 2003 manages to stake its claim as one of the best baseball simulations available for the PlayStation 2. Its on-field action falls short of the realistic experience supplied by 3DO's latest baseball game, but its wealth of gameplay modes makes it easier to forget its sometimes irritating deficiencies. All-Star Baseball can always be counted on to include a wealth of gameplay modes, and the 2003 version ups the ante with the inclusion of an impressive franchise mode. You can play for 20 consecutive seasons and allow the statistics to pile up while watching players retire, win the Cy Young award, get inducted into the Hall of Fame, and much more. You can also monitor your farm team and bring up prospects when they're ready for the big time, trade and release players, and manage salaries. If you're not happy with the current roster of free agents, you can always create your own with a simplistic player-creation tool. One issue concerning the franchise mode is that the schedule for each season is always the same, so it would have been nice if Acclaim had included a schedule randomizer to avoid this. Even so, the franchise mode in All-Star Baseball 2003 is the most thorough and realistic you'll find in any current baseball game. For those who enjoy a less arduous experience, there are plenty of other gameplay modes. The exhibition mode is available for up to four players if you have a Multitap, and you can choose from any of the 30 MLB teams, both all-star teams, and a legends team composed of all-time favorites such as Willie Stargell, Robin Yount, and Rod Carew. If you like to play with only the best, you can cut to the chase and jump straight to the All-Star game or World Series. The franchise mode may be a bit too much to follow for some, but the single season mode is a nice substitute. It includes all the same features as the franchise mode except statistics, and players do not roll over into the next season; plus, there's no need to scout prospects. As you perform certain objectives in the franchise or season mode, you are awarded points that can be spent to buy collectible cards. These cards can then be used to unlock hidden stadiums and teams. The home run derby may seem like nothing more than a fun diversion, but it really helps in coming to grips with the most difficult part of playing the game: batting.All-Star Baseball 2003 retains the same batting interface as last year's game, and while it's incredibly deep, it's not easy to master. Like in most baseball games, a cursor system is used for pitching and hitting. Pitching is quite easy--you simply choose a pitch from the pitcher's real repertoire, adjust the pitch location with the analog stick, and press the X button to let it fly. The ball can be slightly manipulated while it's in the air, which can help fool the batter. However, batting is a bit more complex and much more difficult. Your batter's cursor is sized in relation to his batting average and his abilities against the particular pitcher on the mound. If you feel like you have a good handle on lining up your cursor, you can press the square button to swing for a home run. This makes the size of the batting cursor significantly smaller, but if you make contact with the ball, it's destined for the outfield fence. If you'd like to tailor your hitting to take advantage of holes in the defense, you can adjust your swing accordingly with the right analog stick or attempt to guess the pitch or location, which increases the size of your batter's sweet spot or cursor respectively. While the options available to you when you're inside the batter's box are impressive, actually hitting the ball is far too difficult. Pitches come in way too fast, and to make contact with the ball, you have to swing a split second after the ball leaves the pitcher's hand. It doesn't leave much time to adjust the batting cursor before swinging, and it often results in balls going past the batter before he's had time to get the lumber off his shoulder. You'll eventually adjust to the speed of the pitches, but it can take several days of playing the game.Much like the pitching and batting interface, the remainder of the gameplay is quite deep. Before each pitch, you can adjust both your infielders and outfielders to nine different settings to accommodate for a hitter's tendencies, and you can attempt to pick off runners leading off the bag either before or during the windup. Running the bases works well unless you attempt to move just one base runner. The mechanics for doing so requires that you hold one button and press another at the same time. The response from the base runner is so lagged that you'll think the command wasn't entered and end up sending your runner back to the same base. Fielding is fairly easy and intuitive, but the dive function is awkward, so your player will often leap the wrong direction or let the ball roll underneath him. Another issue is that there's a slight delay between fielding a ball and throwing it to a base. When you're trying to throw out a fast base runner or turn a tight double play, it can become irritating. Pop flies are no problem to get underneath, and you can even enter commands into a buffer that lets your fielder perform moves in succession without touching a button. This comes in especially handy when you're trying to field a ball off the wall. However, the game is not without its bugs. It sometimes cuts away from the action before the play is even finished and leaves you wondering what happened. The gameplay in All-Star Baseball 2003 still falls short of the excellence attained in the Nintendo 64 versions of the game, but despite the few hiccups, it's strong enough that it can be mastered with some dedication. The PlayStation 2 version of All-Star Baseball 2002 looks quite good, but it fails to eclipse the graphical feats accomplished by EA's Triple Play franchise. Player models are basically the same, other than their height and facial textures, and it's impossible to recognize the body shape of players who would normally stand out in a crowd, like David Wells. It appears that the PlayStation 2 was the lead console for the game's development, because the facial textures are clearer than those found in the Xbox and GameCube versions of the game. Many players come adorned in the special equipment they wear in real life, so you'll see Barry Bonds decked out in his signature arm protector. The stadiums feature some nice details, such as K's that the fans display as the pitcher strikes out batters, as well as mascots that cause mischief on the roofs of the dugouts. The 2D bitmaps used for the backgrounds are pixilated, blurry, and generally inaccurate, and they detract from the overall look of the game. When large portions of the stadium are shown onscreen, most of the textures shimmer. While present in the versions of the game for other consoles, this problem is most noticeable on the PlayStation 2. Other problems include players who run right through each other, balls that amazingly teleport into players' gloves, and a lack of any sort of particle effects to show dirt being kicked up while sliding into base. Real-time shadows chase players around the field, but you won't see the shadow of the top of the stadium gradually creep across the field like in other sports games. Pointing out these issues, however, is really being nitpicky, because there really are some nice touches to the graphics. The dugouts are filled with polygonal players who react to the events on the field, and when you select a pitcher to start warming up in the bullpen, you can actually see him doing so. The animation is also quite good. Base coaches run out of the way of players or smack the ground, telling them to slide into base, and players look natural while turning the double play or diving for a ground ball. The crowd is also done quite well--it features more frames of animation than the average sports game. All-Star Baseball 2003's visuals easily eclipse those of High Heat 2003 but fail to impress in the same way that the graphics from EA's Triple Play franchise do. With that said, it can hold its own against the Xbox and GameCube versions of the game, and it features a crisp, clean look with some nice details. The audio in All-Star Baseball 2003 is one of the game's strongest traits. The play-by-play is excellent. The announcers manage to keep up with the action while supplying historical commentary and anecdotes at the same time. As each player comes to bat, the announcers will remark on his past at-bats and mention the player's stats from the previous year. If you let the game idle for a while, the players begin talking about experiences they've had in particular cities or offer commentary on recent world events. The stadium sound effects are quite good, but you'll constantly hear the same fans making the same comments. The organ kicks in during the seventh inning stretch or during lulls in the action, which provides a great deal of atmosphere to the game. There are no sound effects for the umpire, which gives the presentation a TV flair, but it takes away some of the excitement of close plays and strikeouts. Deciding between All-Star Baseball 2003 and High Heat Baseball 2003 is a matter of preference. Both games are great at what they do, but All-Star Baseball 2003 provides a more hands-on gameplay experience, whereas High Heat 2003 is more realistic but less interactive. But All-Star Baseball 2003 has High Heat 2003 licked where graphics are concerned, and the inclusion of the franchise mode makes Acclaim's hardball simulation all the more enticing--so you can't go wrong buying either one. All-Star Baseball 2003 comes highly recommended for serious fans of America's pastime.Much like the pitching and batting interface, the remainder of the gameplay is quite deep. Before each pitch, you can adjust both your infielders and outfielders to nine different settings to accommodate for a hitter's tendencies, and you can attempt to pick off runners leading off the bag either before or during the windup. Running the bases works well unless you attempt to move just one base runner. The mechanics for doing so requires that you hold one button and press another at the same time. The response from the base runner is so lagged that you'll think the command wasn't entered and end up sending your runner back to the same base. Fielding is fairly easy and intuitive, but the dive function is awkward, so your player will often leap the wrong direction or let the ball roll underneath him. Another issue is that there's a slight delay between fielding a ball and throwing it to a base. When you're trying to throw out a fast base runner or turn a tight double play, it can become irritating. Pop flies are no problem to get underneath, and you can even enter commands into a buffer that lets your fielder perform moves in succession without touching a button. This comes in especially handy when you're trying to field a ball off the wall. However, the game is not without its bugs. It sometimes cuts away from the action before the play is even finished and leaves you wondering what happened. The gameplay in All-Star Baseball 2003 still falls short of the excellence attained in the Nintendo 64 versions of the game, but despite the few hiccups, it's strong enough that it can be mastered with some dedication.The PlayStation 2 version of All-Star Baseball 2002 looks quite good, but it fails to eclipse the graphical feats accomplished by EA's Triple Play franchise. Player models are basically the same, other than their height and facial textures, and it's impossible to recognize the body shape of players who would normally stand out in a crowd, like David Wells. It appears that the PlayStation 2 was the lead console for the game's development, because the facial textures are clearer than those found in the Xbox and GameCube versions of the game. Many players come adorned in the special equipment they wear in real life, so you'll see Barry Bonds decked out in his signature arm protector. The stadiums feature some nice details, such as K's that the fans display as the pitcher strikes out batters, as well as mascots that cause mischief on the roofs of the dugouts. The 2D bitmaps used for the backgrounds are pixilated, blurry, and generally inaccurate, and they detract from the overall look of the game. When large portions of the stadium are shown onscreen, most of the textures shimmer. While present in the versions of the game for other consoles, this problem is most noticeable on the PlayStation 2. Other problems include players who run right through each other, balls that amazingly teleport into players' gloves, and a lack of any sort of particle effects to show dirt being kicked up while sliding into base. Real-time shadows chase players around the field, but you won't see the shadow of the top of the stadium gradually creep across the field like in other sports games. Pointing out these issues, however, is really being nitpicky, because there really are some nice touches to the graphics. The dugouts are filled with polygonal players who react to the events on the field, and when you select a pitcher to start warming up in the bullpen, you can actually see him doing so. The animation is also quite good. Base coaches run out of the way of players or smack the ground, telling them to slide into base, and players look natural while turning the double play or diving for a ground ball. The crowd is also done quite well--it features more frames of animation than the average sports game. All-Star Baseball 2003's visuals easily eclipse those of High Heat 2003 but fail to impress in the same way that the graphics from EA's Triple Play franchise do. With that said, it can hold its own against the Xbox and GameCube versions of the game, and it features a crisp, clean look with some nice details.The audio in All-Star Baseball 2003 is one of the game's strongest traits. The play-by-play is excellent. The announcers manage to keep up with the action while supplying historical commentary and anecdotes at the same time. As each player comes to bat, the announcers will remark on his past at-bats and mention the player's stats from the previous year. If you let the game idle for a while, the players begin talking about experiences they've had in particular cities or offer commentary on recent world events. The stadium sound effects are quite good, but you'll constantly hear the same fans making the same comments. The organ kicks in during the seventh inning stretch or during lulls in the action, which provides a great deal of atmosphere to the game. There are no sound effects for the umpire, which gives the presentation a TV flair, but it takes away some of the excitement of close plays and strikeouts.Deciding between All-Star Baseball 2003 and High Heat Baseball 2003 is a matter of preference. Both games are great at what they do, but All-Star Baseball 2003 provides a more hands-on gameplay experience, whereas High Heat 2003 is more realistic but less interactive. But All-Star Baseball 2003 has High Heat 2003 licked where graphics are concerned, and the inclusion of the franchise mode makes Acclaim's hardball simulation all the more enticing--so you can't go wrong buying either one. All-Star Baseball 2003 comes highly recommended for serious fans of America's pastime."}