{"ref": "https://www.gamespot.com/reviews/turok-review/1900-6190449/", "date": "May 6, 2008", "game_name": "Turok", "text": "It's impressive how far slitting a dinosaur's neck can go toward saving an otherwise mediocre game from becoming immediate bargain-bin fodder. Without the lumbering lizards, Turok's middling artificial intelligence, spotty difficulty, and average production values would make it a merely functional first-person shooter, and the shoddiness with which it's been ported to the PC would be a mark of shame on any developer's record. Yet shooting and stabbing dinos is amusing enough to keep Turok from sinking into the abyss of mediocrity--but just barely. Dinosaurs are cool. The story bears no resemblance to the Turok games of yore. It's the spacefaring future, and as Joseph Turok, you join a military team called Whiskey Company that is tasked with capturing your former mentor, Kane. While orbiting the planet that functions as Kane's home base, the company's ship is shot down, and you and your distrustful comrades must fight off all manner of prehistoric beasts while searching for Kane and developing an escape plan. The plot itself is entirely uninteresting, but Turok's mysterious flashbacks and the tension that builds between him and Whiskey teammate Slade keep things flowing. Unsurprisingly, you spend a big chunk of time shooting at dinosaurs, and they are indeed the stars of the extraterrestrial jungle. A few of them, such as the towering Tyrannosaurus rex, are appropriately imposing and shake the ground as they lumber toward their meaty morsels. The garden-variety reptiles are more common but provide a fair number of exciting moments due to their remarkable speed and agility. The most interesting of these dinos will scurry toward you for a quick clawing and then scamper away, possibly to flit up into a tree and survey the situation before again galloping in your direction. When shot, your scaled foes will flop around and try to get their bearings, make clumsy attempts to get back on their feet, and thrash around in a flurry of limbs and teeth. It's entertaining to watch, and though there's no way to know if real dinosaurs would react in similar fashion, it still seems remarkably authentic. Dinosaurs had tiny brains, so you wouldn't expect them to act with any degree of intellectual cunning. In Turok, however, humans seem to have developed within the same evolutionary tree as the raptors, considering that they exhibit approximately the same level of intelligence. At times, enemy soldiers will take cover behind a block of debris or a dividing wall, but more commonly, they will hang out in the open, even when they or nearby comrades are under fire. Foes often don't react when buddies standing a few feet from them are filled with bullets, or will blindly charge through a bottleneck without regard for the stream of lead you're firing in that direction. You'll usually be accompanied by a buddy or two, but they don't fare any better than your adversaries. They often stand around doing nothing while you engage the enemy, and they don't hesitate to shoot you in the back if you get in their way. It's an annoying issue that gets even more frustrating in a few late-game levels, in which a friend with a chaingun can do as much damage to you as an enemy with a rocket launcher. As if to compensate for the dull artificial intelligence and resulting lack of legitimate challenge, developer Propaganda Games chose instead to implement a difficulty level based not on keen AI or legions of enemies, but instead on player disorientation. Most dinosaurs will knock you back when they attack you, and though it takes only a second or two to get back on your feet, these knockdowns can be chained together into inescapable cycles of damage. Rockets and grenades not only knock you down and thrust you backward, but also result in a good deal of smoke. Additionally, damage is represented by the level of blurry redness that closes in on your viewing area, rather than a traditional health bar. This is not an original method of indicating damage, but as implemented in Turok, it makes it almost impossible to see what's going on at the moments when you need the clearest view. These factors all conspire to take events out of your control and leave you to the mercy of annoying design quirks. Turok isn't challenging; it's cheap. To help ease one of the more common complaints with the PlayStation 3 and Xbox 360 versions of the game, the PC release supplements the checkpoint saves with a quicksave and quickload feature. Sadly, quicksaves are broken, and using them can disrupt scripted events and cause other noticeable and inexcusable issues. Should you load a quicksave, you may find that all enemies have disappeared and downed teammates have sprung back to full health. In two cases, loading a quicksave kept an event necessary to continue to the next level from occurring, which forced us to restart the level from the beginning. These events could all be re-created on a second play-through, which is a sure sign of a busted feature. In spite of these issues, Turok still shines whenever dinosaurs take center stage, particularly when you put aside the conventional weapons and rely on your trusty blade. Knife kills are the most satisfying method of spilling a leaping lizard's blood, not just because of the cool and bloody animation that showcases the kill, but also because the swift dinos can be tough to catch. The shotgun's flare ammo is also a terrific way of handling a crowd of carnivores. If you hit one with a flare, the others will voraciously descend on it like condors to carrion, which gives you room to breathe. The rest of your arsenal is a traditional mix of weaponry: sniper rifle, SMG, rocket launcher, flamethrower, and so on. You can dual-wield many of these firearms, though you won't need to very often, given that the ability to aim a weapon is usually more desirable than the additional power of a second firearm. You can take your extermination skills online, but two weeks after release, there is practically no one playing. Although the largest maps support up to 16 players, we never found that many people playing at one time, so your deathmatches may end up being one-versus-one games that end before the target kill count is reached. Two Capture the Flag options and a team mode called Wargames round out the competitive online modes, though it's impossible to get the most out of them when you can't find a full contingent of players. There are also a few cooperative missions, though it's painful to find a player to enjoy them with. The tiny online population means that the multiplayer's claim to fame-- computer-controlled dinosaurs that periodically respawn to create havoc--will go unnoticed. It's too bad, because the maps are designed well and set the stage for massive battles that sadly never occur. Human beings are less cool. Turok was built using the Unreal 3 engine, yet it pales in comparison to many other games that use the same technology. Environments are bland and look nothing like the lush jungles featured in other shooters. Foliage is underwhelming and textures are dull, and the linear levels never give you a sense that you're making your way through a tangled tropical paradise. It seems that most of the attention was given to the dinosaurs themselves; their animations are outstanding, and they look daunting and ferocious. Regardless, the price you pay for middling visuals is rather severe. On two computers that both greatly exceeded the minimum requirements, the frame rate suffered from noticeable dips. Protracted loading times between missions and a long installation process that involves two DVDs are both unseemly drawbacks for an ordinary-looking game that takes only eight hours to finish. PC-specific issues and glitches keep this version of Turok from being the one you want to pick up if you are in the market for a dino-killing extravaganza. Those roaring reptiles pack a punch, and patient players may find enough pleasure in decimating the dilophosaurus to overlook the flaws. Sadly, aside from the dinosaurs, there's nothing particularly memorable or exciting about Turok, and it certainly doesn't meet the high standards set by other modern shooters."}