{"ref": "https://www.gamespot.com/reviews/athens-2004-review/1900-6103490/", "date": "July 26, 2004", "game_name": "Athens 2004", "text": "When speaking about video games based on the Olympic Games, the game that most often springs to mind is Konami's seminal 1983 button masher, Track & Field. That game covered a fair variety of Olympic events by subscribing to the notion that the mechanics of most of them could be reduced to simply hitting two buttons really, really fast. And, in a way, this formula worked pretty well. It has been a long, long time since Track & Field, but 989's latest Olympic offering, Athens 2004, is still operating from much the same playbook. Although you could play Track & Field one quarter at a time, Athens 2004 will demand a bit more of your money up front, and, ultimately, what it's offering isn't that much better. Fans of Track & Field will get a sense of dj vu playing Athens 2004. Athens 2004 is, in essence, a collection of athletically inclined minigames. There are 24 different events for you to compete in, and there are a variety of different ways for you to do so. There's a handy practice mode, which is absolutely essential for understanding the somewhat cryptic nuances of a few of the games. You can choose to compete in a one-off event or in a series of events, such as a decathlon or a heptathlon. If the prefabricated competitions don't suit your liking, you can also generate your own custom competition by cherry-picking the events that you enjoy the most. The game also features a party mode that includes a handful of different events. This mode is designed to be played with a dance mat--the kind more regularly used for rhythm games like Dance Dance Revolution--giving elder gamers the opportunity to relive their NES Power Pad memories. Athens 2004 also offers four-player competitive play, which, as with most sports games, proves to be one of the more compelling features in the game, because it's more fun to compete with your friends than against computer-controlled opponents. The events themselves include a pretty good cross section of competitions from the summer Olympic Games, including dashes of various lengths, hurdles, the long jump, the high jump, the triple jump, the pole vault, the discus throw, the javelin throw, the shot put, aquatic races of various lengths, gymnastic floor exercises, rings, gymnastic vaulting, equestrian jumping, weight lifting, archery, and skeet shooting. The mechanics of most of the games in Athens 2004 are fairly straightforward and intuitive, but there are events where the gameplay is anything but self-explanatory. The rings event in the gymnastics section of the game is easily the most egregious example, because it revolves around no fewer than four distinctly different gameplay mechanics, all of which are packed into a single, fairly abstract ring interface. Once you understand the significance of each of the different bits of the action, it's not that hard to successfully pull off the event. However, it's for events like these that the practice mode comes in handy. When the gameplay in Athens 2004 isn't weirdly archaic, it errs toward simple or derivative. The dashes and the swimming races all require you to alternate between the X and circle buttons at high speeds. The hurdles, long jump, triple jump, and pole vault events also depend on this button-mashing proficiency, though they also throw a few well-timed taps of the L1 button in for good measure. In fact, almost all of the events in Athens 2004 boil down to hitting buttons fast. So although what you're seeing on screen changes, you don't get much sense of variety in the actual gameplay between these events. On top of this, constantly attacking the X and circle buttons can be an absolute nightmare on the fingers; few other games these days are so demanding of continuous, rapid-fire button pressing, so if you're not used to this type of mechanic, you may well find yourself with sore fingers after playing Athens 2004. There are a few exceptions, such as the high jump, floor exercises, and archery, which instead rely more on timing and nuanced controller manipulation. On the whole, the gameplay in Athens 2004 is pretty accessible, but it also doesn't inspire the urge to revisit a lot of the events. Athens 2004 happens to be the best-looking Olympic video game to be seen, though this is largely by virtue of the fact that it's the first Olympic video game to be released on consoles in nearly four years. And even then, its advantage over titles like ESPN International Track & Field or Sydney 2000 isn't that spectacular. To its credit, the game has a tidy look to it, and though it's fairly economic with the polygons, there are a few nice touches, such as the wobble in the high-jump bar as you pass over it, or the long-distance runners that continue to run laps in the background during various other track-and-field events. The game helps cement a TV-broadcast feel by constantly switching to different camera angles over the course of an event, and it makes liberal use of instant replays. The biggest problem with the graphics in Athens 2004 lies in the athlete models. Though the game lets you play as nameless, young athletes from literally dozens and dozens of countries around the world, the athletes all have exactly the same build, and they alternate between a few different facial types and skin tones. This leaves you with a lot of really generic-looking athletes who often don't really look like they're from the country that they're supposed to be representing. Athens 2004 will likely appeal most to casual gamers or nongamers. The sound is fairly subdued, with a few, occasionally silly sounding, athletic grunts playing over some simple crowd noise. You'll also hear the crack of the starting gun, and you can hear the field announcer echoing through the park. Additionally, you're treated to an English-accented TV-style commentator. The commentator doesn't have a huge number of clips to draw from, but he manages to mostly remain contextual and relevant, if a little repetitive. There are a few short clips of rock and funk that play during the instant replays, and there's a sort of regal-sounding tune that plays over the main menus. Unfortunately, this is about the extent of the music that you can expect to hear in the game. Athens 2004 certainly looks better than past Olympic Games, but the gameplay itself honestly doesn't improve much on the button mashing and timing-based gameplay that Konami built Track & Field on more than 20 years ago. The mostly simple, accessible gameplay can make it an appealing offering for the casual player, thus making it a decent option for a weekend. However, a lack of any real depth, along with the repetitive nature of many of the game's events, prevents Athens 2004 from having much lasting appeal."}