{"ref": "https://www.gamespot.com/reviews/eternal-sonata-review/1900-6199900/", "date": "October 23, 2008", "game_name": "Eternal Sonata", "text": "In 2007, Eternal Sonata served up an unexpected treat to Xbox 360 owners, and was one of the most magical role-playing games to be released in recent years on any platform. Now, PlayStation 3 owners get their chance to roam through the game's beautiful, enchanting dream world, with some extra benefits thrown in for good measure: New dungeons, cutscenes, and tunes, as well as two new party members. These additions are lovely, though they don't change the game in any significant way. But that's absolutely fine. Eternal Sonata is full of joy and old-fashioned romance, and it's set in a gorgeous, fully realized fantasy world. Even better, that soft, chewy center is complemented by an action-packed battle system that continually keeps you on your toes. It will make you feel consistently warm and fuzzy, thanks to its big heart and total commitment to its subject matter. Eternal Sonata's environments glow--and so will you. If that makes the game sound sickeningly sweet, rest assured that it also possesses a good deal of maturity. Composer Frederic Chopin lays sleeping on his death bad as the clock slowly counts down to his last moments on earth. But the real story is in his mind, where he joins an alternate reality already in progress and multiple stories that eventually converge. His first friend is Polka, a loveable girl with awesome pigtails that can wield magic, but like other magic users in this world, she is destined to die young. Along the way, they are joined by other adventurers, such as street urchins Alegretto and Beat, and goat herder Viola. Two other characters, previously unplayable, also join the party: Prince Crescendo and Princess Serenade. Together, they unite against the rule of the evil Count Waltz, who is turning the populace of Forte into mindless slaves, thanks to an untaxed, addictive mineral powder. It's not the grandest, most epic tale ever told in an RPG, but it's a highly personal one. Chopin must discover what he is searching for in this moving, thoughtful journey. His travel companions are charming, multifaceted characters who develop strong bonds, including Alegretto's touching affection for ever-sweet Polka. You will care for these characters, and if their initial quest doesn't seem all that breathtaking, the passion with which they undertake it will win you over. The story also touches on topics that tie lessons of the past to current events. Blind devotion to the government, the separation of fact from fiction, social persecution, and other themes parallel our own world's political climate. The only problem with the narrative is the pace, which is broken up by narrated segments about Chopin's life and the politics of his own time. These interruptions feature photo stills of such cities as Paris and Warsaw, accompanied by Chopin's famous piano works. But the history lessons, as well intentioned as they are, just don't fit because they force us back into a reality the game does such a good job of letting us escape. Developer Tri-Crescendo has created a beautiful world here. It's easy to get swept up in the French Impressionist color palaette and gorgeous lighting, but incredible artistry gushes from every aspect of the visual design. The clothing of your party members is richly drawn, with intricate stitching and other fine details. The interiors of cottages are filled with meticulously designed decor, from textured linens to finely crafted plates hanging on the walls. Environments are spectacular, even such traditionally clich locations as swamps or forests, which use shadows and mild light bloom to create scenes you would expect to see in a Monet painting. In fact, they look even better on the PlayStation 3 than on the Xbox 360, because the colors seem to pop even more. But all of this 2D art does come at the expense of 3D exploration. You can't freely explore every nook and cranny, nor can you rotate the camera. So there are times you wish you could head off into the rolling hills to check out every valley and crevasse but are fixed to your narrow pathway. The PS3 version does suffer from some odd, occasional frame rate hitches, but make no mistake: Eternal Sonata is a visual triumph and a beautiful artistic achievement. Even this brightly- lit universe has a dark side. As you might imagine, music plays an important role in the game's production values as well, though Chopin's music is usually limited to the edutainment portions previously mentioned. But that's fine because Motoi Sakuraba's score (which features several new wonderful tracks exclusive to this version) is as exquisite as the visuals, using Chopin's romanticism as a starting point for a subtle but sweeping musical journey. The voice acting doesn't reach for the stars, but it is solid enough. Chopin and Salsa in particular come to life vividly, thanks to strong acting, though other voices get too syrupy after a while. Sadly, there are some scenes of extended dialogue that, for whatever reason, feature no music and minimal ambient noise. In a musical score, rests are as important as notes, but these extended silences are jarring. Thankfully, the gameplay is able to match the glittering production values, offering a satisfying combat system that moves at a slick tempo. There are no random encounters, so you can see every monster. Oftentimes, you can simply go around them, though you will be forced into some battles (and some terrific, challenging boss fights too). Combat isn't a typical series of turns with infinite time in between, though: Eternal Sonata's system is an inventive mix of turn-based and real-time warfare that gets trickier as the game progresses. First up is your action bar. Each character has a limited amount of time to complete his or her turn before it ends. But within that turn, you can move freely about the battlefield. Each action, whether it is an attack, a spell, or a simple movement depletes the bar even more. As your party level increases, the planning time you have decreases, special attacks deplete more of your meter, and other changes are made until battles are frenetic, tactical scherzos. Battles are an enjoyable mix of turn-based movement and real-time combat. Then you have a whole other can of worms: light and dark. If you're standing in the light, you have a different set of skills available to you than if you are standing in shadows. For example, newcomer Serenade can execute a party heal when she is standing in the shadows but a spectacular-looking ranged attack when in the light. Furthermore, these abilities may change depending on how close you are to your enemy. And if that wasn't enough, your enemies can take advantage of the light and dark as well, going so far as to shape-shift when moving from one to the other. Eventually, this system gets complex because enemies may cast spells on you that envelop you in darkness, or you might use items that surround you in a glow of light. And some weapons are more effective in the shadows than in the sun. There's also a real-time blocking mechanic, where a well-timed button press can block an enemy attacking from the front or even execute a counter attack. In the later portions of the game, blocking can make the difference between success and failure. But it's not easy to block, so don't expect to mash the block button when you're on the defensive. You have a tiny smidgen of time, so you are constantly on your toes, even when it isn't your turn. All of these dynamics result in a constant tactical repositioning of each character depending on where you stand, where your enemy stands, whether you're attacking it from the front or rear, and other factors. It's literally the best of both worlds, combining the strategy of turn-based battles with the frantic immediacy of real-time combat. Most of the time, the system is terrific, and the challenge ramps up considerably as the game progresses. But there are some small issues with it. Creatures cast their own shadows, so if you are in one of them, you obviously only have access to your shadow skills. This is usually a great strategic element, but because monster animations cause the shadow to move as well, you could be caught on the fringe of a swaying foe, watching your available actions jitter back and forth. You could end up using a different skill than you intended or wasting some of your precious action bar on moving to another location, thereby getting less time to attack the enemy. It's also worth noting that the enemy artificial intelligence is inconsistent. On the one hand, monsters are quick to figure out which party member is casting the healing spells and will focus their attacks there. On the other hand, they don't quite know how to handle objects on the battlefield, sometimes charging right into a boulder and doing the hokey pokey before turning themselves around. Serenade gives thanks for her experience points. Other frustrations are minor, but they still come up from time to time. Your journey is highly linear, so don't expect to spend any time doing side quests or gallivanting about the countryside to check out the sights. Another odd element is Beat's photography skills, which allow you to take pictures during battle and sell them for a tidy profit. The problem with it isn't the concept--because it's a great way to allow the party to earn some money--but that you can make a serious load of gold this way. So if you take the initially powerful Viola and Allegretto into battle with Beat, they can mop up enemies while Beat snaps countless photos. It won't take long to accumulate more funds than you know what to do with, and it eases the challenge considerably because you can load up on floral powder or healing cookies. And interestingly, for a game featuring a famous composer, music isn't integrated into the gameplay itself, aside from a minigame that lets you play bits of music with various friendly townsfolk. It's nice that you can listen to music clips that you unlock, and characters and towns are all named after musical terms. But it's always subtext and doesn't often come to the forefront. The new dungeons are quite good and help extend the length a bit, though you should be aware that one of them is only available to you once you complete the game, which clocks in at under 35 hours. Even with the new content, though, Eternal Sonata is much the same game as before--which makes it one that you should play, if you haven't already. Its lovely, gentle story and fun combat make for a heartwarming journey that will both draw you in and make you wish you didn't have to leave. Thankfully, the gameplay is able to match the glittering production values, offering a satisfying combat system that moves at a slick tempo. There are no random encounters, so you can see every monster. Oftentimes, you can simply go around them, though you will be forced into some battles (and some terrific, challenging boss fights too). Combat isn't a typical series of turns with infinite time in between, though: Eternal Sonata's system is an inventive mix of turn-based and real-time warfare that gets trickier as the game progresses. First up is your action bar. Each character has a limited amount of time to complete his or her turn before it ends. But within that turn, you can move freely about the battlefield. Each action, whether it is an attack, a spell, or a simple movement depletes the bar even more. As your party level increases, the planning time you have decreases, special attacks deplete more of your meter, and other changes are made until battles are frenetic, tactical scherzos. Battles are an enjoyable mix of turn-based movement and real-time combat. Then you have a whole other can of worms: light and dark. If you're standing in the light, you have a different set of skills available to you than if you are standing in shadows. For example, newcomer Serenade can execute a party heal when she is standing in the shadows but a spectacular-looking ranged attack when in the light. Furthermore, these abilities may change depending on how close you are to your enemy. And if that wasn't enough, your enemies can take advantage of the light and dark as well, going so far as to shape-shift when moving from one to the other. Eventually, this system gets complex because enemies may cast spells on you that envelop you in darkness, or you might use items that surround you in a glow of light. And some weapons are more effective in the shadows than in the sun. There's also a real-time blocking mechanic, where a well-timed button press can block an enemy attacking from the front or even execute a counter attack. In the later portions of the game, blocking can make the difference between success and failure. But it's not easy to block, so don't expect to mash the block button when you're on the defensive. You have a tiny smidgen of time, so you are constantly on your toes, even when it isn't your turn. All of these dynamics result in a constant tactical repositioning of each character depending on where you stand, where your enemy stands, whether you're attacking it from the front or rear, and other factors. It's literally the best of both worlds, combining the strategy of turn-based battles with the frantic immediacy of real-time combat. Most of the time, the system is terrific, and the challenge ramps up considerably as the game progresses. But there are some small issues with it. Creatures cast their own shadows, so if you are in one of them, you obviously only have access to your shadow skills. This is usually a great strategic element, but because monster animations cause the shadow to move as well, you could be caught on the fringe of a swaying foe, watching your available actions jitter back and forth. You could end up using a different skill than you intended or wasting some of your precious action bar on moving to another location, thereby getting less time to attack the enemy. It's also worth noting that the enemy artificial intelligence is inconsistent. On the one hand, monsters are quick to figure out which party member is casting the healing spells and will focus their attacks there. On the other hand, they don't quite know how to handle objects on the battlefield, sometimes charging right into a boulder and doing the hokey pokey before turning themselves around. Serenade gives thanks for her experience points. Other frustrations are minor, but they still come up from time to time. Your journey is highly linear, so don't expect to spend any time doing side quests or gallivanting about the countryside to check out the sights. Another odd element is Beat's photography skills, which allow you to take pictures during battle and sell them for a tidy profit. The problem with it isn't the concept--because it's a great way to allow the party to earn some money--but that you can make a serious load of gold this way. So if you take the initially powerful Viola and Allegretto into battle with Beat, they can mop up enemies while Beat snaps countless photos. It won't take long to accumulate more funds than you know what to do with, and it eases the challenge considerably because you can load up on floral powder or healing cookies. And interestingly, for a game featuring a famous composer, music isn't integrated into the gameplay itself, aside from a minigame that lets you play bits of music with various friendly townsfolk. It's nice that you can listen to music clips that you unlock, and characters and towns are all named after musical terms. But it's always subtext and doesn't often come to the forefront. The new dungeons are quite good and help extend the length a bit, though you should be aware that one of them is only available to you once you complete the game, which clocks in at under 35 hours. Even with the new content, though, Eternal Sonata is much the same game as before--which makes it one that you should play, if you haven't already. Its lovely, gentle story and fun combat make for a heartwarming journey that will both draw you in and make you wish you didn't have to leave."}