{"ref": "https://www.gamespot.com/reviews/super-monkey-ball-adventure-review/1900-6155468/", "date": "August 8, 2006", "game_name": "Super Monkey Ball Adventure", "text": "Super Monkey Ball has proven itself to be a singularly bizarre, unique game series. You could draw some flimsy comparisons to Marble Madness, but even then you're not giving Sega credit for SMB's potent cocktail of three-dimensional puzzle-solving and harrowing platform action. Combined with its distinctly Japanese style, which was like equal parts Sonic the Hedgehog and Hello Kitty, Super Monkey Ball felt like it was developed with little concern for market forces or key demographics. It's kind of depressing, then, to watch the series degenerate into a frustrating, haphazard mush with Super Monkey Ball Adventure. Super Monkey Ball gets a new developer and a new direction, and it's not a good thing. The setup is appropriate enough, with the adorable Super Monkey Ball team of AiAi, MeeMee, GonGon, and Baby being called upon to investigate an enigmatic sadness that seems to be bumming out everyone in the five kingdoms on Monearth. Keeping with the tone of the series, the narrative is played pretty light and breezy, though it's also kind of bland. The garden-variety storytelling is excusable, but it's the clumsy, repetitious game design that really sinks Super Monkey Ball Adventure. Super Monkey Ball has previously maintained an ant-burning level of focus on providing a series of independent puzzles that challenged you to roll your cute little monkey in its cute little gerbil ball all the way to the finish line--a simple premise made absolutely diabolical by level designs that required serious three-dimensional thinking and that tested even the steadiest of hands. Such puzzle levels still exist within the story mode, and there's a dedicated puzzle mode as well, but Super Monkey Ball Adventure pads out the experience with way too many tedious fetch quests and confusing, indistinct puzzles. While the basic ball-rolling controls remain unchanged, Super Monkey Ball Adventure introduces magical chants, which can imbue your ball with special powers. There are chants that will attach a giant spring-mounted boxing glove to your ball, turn you invisible, give you the ability to increase the size of your ball at will, make your ball stick to certain surfaces, or even teleport you to a new location. These abilities are meted out over the course of the game, and they are often key to solving puzzles and advancing to new areas, though the implementation is often awkward. The game's structure is such that you will hop from location to location, taking on missions as you see fit. Because of this kind of open-world structure, you'll regularly be presented with puzzles that you have no way of solving without a specific power. This fact is rarely made explicit, so it's easy to futilely bang away at puzzles and paths that you have simply no way of overcoming. That's not to say the game is completely without its clever and inspired moments--such as an up-is-down sequence inside an amusement park where you use the sticky chant to roll your way along pipes and platforms in order to reach the top of a tower--but they're few and far between and usually separated by miles of tedium. The game is also littered with minor annoyances, such as the way you can only take on one mission at a time. There's no way to automatically retry a mission if you fail, so you have to backtrack to the quest-giver, which would be a petty complaint if the mission structures weren't so often about trial and error. Discrete areas on each island are often separated by special turnstiles that you'll have to rotate 10 times before you're allowed into the next area. This seems like a cheap trick used to mask load times, though if that is the case, then Traveller's Tales should just let you put down the controller and sit through the load times, as these turnstiles are very tiresome. A lot of the game just feels clunky, and ultimately, this attempt to shoehorn the Super Monkey Ball gameplay style into an action adventure game simply does not work. The main story mode in Super Monkey Ball Adventure is ultimately disappointing, though there are still some saving graces. There's a puzzle mode that recalls the original Super Monkey Ball, and these puzzles are almost as challenging as what Sega has offered up before, though the number of puzzles isn't as great. There's also a suite of four-player minigames that fans will recognize, such as Monkey Fight and Monkey Target, as well as a handful of new minigames like Monkey Cannon, where each player builds a castle and then proceeds to launch monkey balls at the other castles in order to break them down and steal their building blocks. The stuff that's ancillary to the main story mode in Super Monkey Ball Adventure is actually alright, though it's still not enough to redeem the whole package. From the basic structure to the visual style, Adventure just feels inauthentic. The Super Monkey Ball series has never been a real technical powerhouse, though it has always had an extremely specific style, with lots of checkered surfaces, colorful backgrounds, and monkeys with ears that look like cinnamon buns. There are hints of this bubbly aesthetic still to be found here, but it's been dulled significantly. The color palette is literally less vibrant, and most of the environments seem generic enough to have come out of any of a hundred different cartoony platformers. The sound design is a bit more authentic, but that's because it recycles lots of sound effects and tunes from previous games, though the gibbering chatter of the monkeys during dialogue sequences wears thin after a few hours. There are still remnants of Sega's challenging action puzzle concoction left in Super Monkey Ball Adventure, but most of it has been homogenized into something that is simultaneously more accessible and less appealing. Super Monkey Ball fans should avoid Adventure because it takes what was great about those games and buries it under several layers of unimaginative video game convention. Newcomers are better off checking out any of the other Super Monkey Ball games, because this one just doesn't feel right."}