{"ref": "https://www.gamespot.com/reviews/linelight-review/1900-6416609/", "date": "February 1, 2017", "game_name": "Linelight", "text": "In a period when so many games vie for our attention with bombastic action scenes and deeply involving stories, finding a game like Linelight feels like a blessing. There's no excess, nothing to distract you from the mechanics and obstacles at play. As intended, its presentation is minimalistic, bordering on stark, with merely a few lines and colorful highlights against a lightly blushed backdrop. And as you ponder and test possible solutions to Linelight's puzzles, featherlight musical accents dance in your head. Come to it with a troubled mind and Linelight will sort you out in no time.While its atmosphere is no doubt tranquil, Linelight's puzzles vacillate between straightforward and perplexing. The goal is simple: guide a beam of light on a path from one end of a puzzle to the other. At the start, you may only need to guide your light down a branching path to activate a gate that triggers another piece of the path to reconfigure itself. This becomes far more difficult over time, however, when other beams of light--enemies--patrol paths and trap you into inescapable corners. This is to say nothing of puzzles that incorporate multiple moving paths, treadmills, and magnet-like controls over enemies, to name a few of the challenges that await.Despite how complex its puzzles become, Linelight's simple controls should allow the average player to dive right in. The game also does a great job of teaching you how to play and manage the ever-expanding ruleset through measured escalation. For each new world and mechanic that's introduced, a series of simple puzzles show you, step by step, what to watch out for and how to manage your options moving forward. You never feel like you're thrust into a tutorial, and yet your options are always clear.Prodigies aside, youll likely tread water at times to monitor all of the elements at play before cracking your knuckles and getting down to business on a particular puzzle. Red herrings in sprawling sections can occasionally trip you up, but the puzzles that inspire true consternation are those that look deceptively simple, but have no tolerance for mistaken movements or nervous hesitations. Of course, you can always charge ahead and try to brute-force your way into a solution--when you execute the correct series of actions, puzzles are resolved in a few seconds--but this rarely works in practice. Thankfully, should you fail, youre only one button press away from restarting the puzzle.Within Linelight's six worlds of interconnected puzzles are collectible gems, some that you find organically as you move from one puzzle to the next and others that live along hidden paths. You can find these secret trails by pushing past perceived boundaries, which can sometimes occur due to blind luck as you rush to move your light around a given puzzle. Rather than coming to a stop at the end of a line, you'll unexpectedly continue onward and meet a new, far more challenging test. Successfully complete these trials, and youll gain a different-colored gem and maybe even a newfound level of pride.Linelight can be a short game, but with dozens of optional puzzles and gems, it doesn't have to be. Ultimately, if you neglect to search for hidden avenues, you could theoretically complete Linelight in a couple of sittings. But even if it only lasts a few hours, its presentation and crafty puzzles will make those hours feel well spent. Just don't be surprised when your desire for more pulls you back into the game, and you subsequently realize that old puzzles aren't as captivating the second time around.Linelight is easy to recommend, but perhaps more as a deviation than a destination. It's a game worth savoring, and one so effective at instilling you with both curiosity and relaxation that it ought not to be spoiled by binge playing. To be sure, some of its potency is lost during repeat playthroughs--another reasons to consider it a salve for a stressful day. Linelight's aims and scope could be considered modest, but it manages to do more with what little it wields compared to many games that mask their inadequacies with blaring effects and overambitious promises."}