{"ref": "https://www.gamespot.com/reviews/pro-race-driver-review/1900-6025338/", "date": "April 18, 2003", "game_name": "Pro Race Driver", "text": "Most racing games put the emphasis solely on the cars and tracks. But racing fans know that it's also the men behind the machines that make the sport so intriguing. After all, racing isn't just about horsepower, it's also about heroes--larger-than-life figures like Michael Schumacher or Dale Earnhardt, not to mention the unsung experts behind the scenes who build the cars and keep them running. With Pro Race Driver (known as TOCA Race Driver in Europe), Codemasters has created a racing game that puts drivers in the spotlight without sacrificing exciting on-track action. Pro Race Driver puts an unusual but effective focus on storytelling. Pro Race Driver is a survey game that features an impressively wide variety of cars and tracks. It blends fast-paced arcade action with enough realism to keep things interesting and challenging. The game was released on the PlayStation 2 last December and more recently on the PC. Xbox owners will be happy to learn that this latest version is arguably the best of the three. The graphics are better than those of the PS2 version, and the AI seems better than that of the PC version. It's true that the Xbox version doesn't feature Xbox Live support, so multiplayer is limited to split-screen action for up to four players. If you want to play online, you'll need the PC version--though, frankly, the online gameplay there is underwhelming. One thing all three versions of Pro Race Driver have in common is an unusual focus on storytelling. Most racing games offer little if anything in the way of plot or characters. Not so with Pro Race Driver, where a generally entertaining career mode focuses on a single fictional driver, Ryan McKane. Pro Race Driver uses the cinematic touches found in other game genres to let you take part in McKane's life in racing. The game opens with a flashback sequence that shows McKane's father, a legendary driver, barely winning a race, only to have his car intentionally clipped by a young upstart driver right after crossing the finish line. Young Ryan McKane and his brother look on in horror as their father dies in a fiery wreck. As you progress through Pro Race Driver's career mode, you'll lead Ryan McKane in the footsteps of his father and brother, who's also grown up to be a pro race driver. Through occasional cutscenes, you'll see Ryan join his first team with some help from his brother and then try to live up to the family name. Some of the cutscenes also tie directly into the races, instead of just serving as a general framework for the action. If you viciously slam into an opponent during a race, you'll get to watch a nasty (and funny) exchange of words between the two drivers when the race is finished. While all this could easily have ended up feeling gimmicky, it usually works pretty well. The cutscenes are mostly well written and directed, which makes all the difference. Pro Race Driver does a great job establishing McKane's character early on, showing a man brimming with the surly arrogance of youth. Other characters, like his seasoned crew chief and brash manager, also seem unusually realistic for game characters, thanks to their smart and well-delivered dialogue. The tendency for AI-controlled cars to frequently bash into you and each other seems to have been somewhat toned down for the Xbox version. The continuing story of McKane's career helps set Pro Race Driver apart, but the story alone is hardly worth buying the game for. You obviously want to have solid racing action, too. Fortunately, Pro Race Driver generally delivers on that front. You get to drive 42 different real-world cars (after unlocking them all), including the Chevrolet Monte Carlo, the MG Lola Le Mans, the Audi TT-R, the Lotus Elise, and the Dodge Viper GTS-R. You get to race on 38 real-world circuits, like Sears Point, Bristol, Monza, and Silverstone. This means you'll get to try your hand on tiny NASCAR ovals, dense and twisty road courses, and everything in between, including multiple configurations of the same venue, like at England's exciting Brands Hatch. Diversity is definitely a strong suit of this game. In addition to the career mode, which takes you through tiers of varied racing series, you can test yourself in time trials and enter free races. While some of the free-race tracks are initially locked, a surprisingly large number are open for playing right from the start--a very welcome change from the way some games handle unlocking ~extras.~ Unlike in the career mode, there's a difficulty option for the free races, as well as options to set the number of laps, select the weather, and more. Whichever mode you play, you can expect fast-paced action and fairly tough competition. The AI-controlled drivers don't always seem to play fairly, sometimes catching up and passing you improbably fast. But at least they keep you on your toes and will take advantage of your mistakes. Fortunately, the tendency for AI-controlled cars to frequently bash into you and each other seems to have been somewhat toned down for the Xbox version of the game, particularly when compared with the PC version. With up to 20 cars--more than in the PS2 version--battling on tight tracks, that's a welcome improvement. The game's soundtrack is an improbable mixture of Iggy & The Stooges, Thin Lizzy, Al Green, and Lynyrd Skynyrd, among others. Whatever the quirks of its AI, Pro Racer Driver offers a solid sensation of speed, something a surprising number of racing games don't get right. It can be a lot of fun to go roaring over a blind rise or brake at the last moment to overtake another car as you come barreling into a turn. On the other hand, the physics modeling certainly isn't going to please gamers looking for sophistication and hard-core realism in their racing games. The cars seem to float across the track, and their handling tends to feel too inconsistent. In keeping with this relaxed realism, you'll also find relatively simple car setup options. The default car setups sometimes leave a lot to be desired, too, suffering from improper gear ratios for the track at hand or too much oversteer or understeer. Still, the cars feel easier to control smoothly with a standard Xbox controller than with the PS2 controller or a wheel-pedal setup on the PC. (The Xbox version also supports a wheel if you have one.) Pro Race Driver's tendency to simplify things affects the basic structure of the races, too. You won't get to race qualifying laps to determine your starting position, which is frustrating since it's an essential part of racing. You won't encounter yellow or black flags in races, either. The game just ignores major wrecks and lets you drive off the track to cut past other cars in the turns. While you won't get black flagged for intentionally running an opponent off the track, your car will suffer the consequences. Not only will you see the damage to your vehicle, in the form of flying glass or mangled bumpers left on the road, but you'll also feel the effects on the car's performance if you bash it particularly hard and frequently enough. Eventually, you might end up limping across the finish line, though you have to be especially hard on your car to reach that point. In fact, the damage modeling is so relaxed that your car can flip a few times, land upright, and keep on driving as if nothing happened. Pro Race Driver usually does a good job combining storytelling with exciting racing. Visually, the Xbox version of Pro Race Driver is a real improvement on the PS2 version, which suffered from a severe case of the ~jaggies~ in most scenes. Now, you'll see crisper, cleaner textures for the most part, though the text can sometimes be too small to read easily on a standard-size TV. The audio is certainly as vivid as it is in previous versions. Whining engines, screeching brakes, and crunching metal in collisions usually sound convincing. Many of the voice-overs in the game are superb, which really helps bring the characters to life. The game's soundtrack is an improbable mixture of Iggy & The Stooges, Thin Lizzy, Al Green, and Lynyrd Skynyrd, among others. Pro Race Driver certainly has its quirks and weaknesses, especially if you're looking for hard-core realism. But despite its problems, Pro Race Driver usually does a good job of combining storytelling with exciting racing, putting the spotlight on men and machines alike. Whichever mode you play, you can expect fast-paced action and fairly tough competition. The AI-controlled drivers don't always seem to play fairly, sometimes catching up and passing you improbably fast. But at least they keep you on your toes and will take advantage of your mistakes. Fortunately, the tendency for AI-controlled cars to frequently bash into you and each other seems to have been somewhat toned down for the Xbox version of the game, particularly when compared with the PC version. With up to 20 cars--more than in the PS2 version--battling on tight tracks, that's a welcome improvement. The game's soundtrack is an improbable mixture of Iggy & The Stooges, Thin Lizzy, Al Green, and Lynyrd Skynyrd, among others. Whatever the quirks of its AI, Pro Racer Driver offers a solid sensation of speed, something a surprising number of racing games don't get right. It can be a lot of fun to go roaring over a blind rise or brake at the last moment to overtake another car as you come barreling into a turn. On the other hand, the physics modeling certainly isn't going to please gamers looking for sophistication and hard-core realism in their racing games. The cars seem to float across the track, and their handling tends to feel too inconsistent. In keeping with this relaxed realism, you'll also find relatively simple car setup options. The default car setups sometimes leave a lot to be desired, too, suffering from improper gear ratios for the track at hand or too much oversteer or understeer. Still, the cars feel easier to control smoothly with a standard Xbox controller than with the PS2 controller or a wheel-pedal setup on the PC. (The Xbox version also supports a wheel if you have one.) Pro Race Driver's tendency to simplify things affects the basic structure of the races, too. You won't get to race qualifying laps to determine your starting position, which is frustrating since it's an essential part of racing. You won't encounter yellow or black flags in races, either. The game just ignores major wrecks and lets you drive off the track to cut past other cars in the turns. While you won't get black flagged for intentionally running an opponent off the track, your car will suffer the consequences. Not only will you see the damage to your vehicle, in the form of flying glass or mangled bumpers left on the road, but you'll also feel the effects on the car's performance if you bash it particularly hard and frequently enough. Eventually, you might end up limping across the finish line, though you have to be especially hard on your car to reach that point. In fact, the damage modeling is so relaxed that your car can flip a few times, land upright, and keep on driving as if nothing happened. Pro Race Driver usually does a good job combining storytelling with exciting racing. Visually, the Xbox version of Pro Race Driver is a real improvement on the PS2 version, which suffered from a severe case of the ~jaggies~ in most scenes. Now, you'll see crisper, cleaner textures for the most part, though the text can sometimes be too small to read easily on a standard-size TV. The audio is certainly as vivid as it is in previous versions. Whining engines, screeching brakes, and crunching metal in collisions usually sound convincing. Many of the voice-overs in the game are superb, which really helps bring the characters to life. The game's soundtrack is an improbable mixture of Iggy & The Stooges, Thin Lizzy, Al Green, and Lynyrd Skynyrd, among others. Pro Race Driver certainly has its quirks and weaknesses, especially if you're looking for hard-core realism. But despite its problems, Pro Race Driver usually does a good job of combining storytelling with exciting racing, putting the spotlight on men and machines alike."}