{"ref": "https://www.gamespot.com/reviews/nhl-08-review/1900-6179018/", "date": "September 19, 2007", "game_name": "NHL 08", "text": "If you've been following EA's sports game releases on older consoles and the PC over the last couple of years, the following sentence should be of absolutely no surprise to you: NHL 08 on the PS2 and PC is a lot like NHL 07. Once again, EA has phoned it in on these versions, adjusting the control scheme a bit, adding minor league management to the dynasty mode, and calling it a day. Apart from that, the game still plays the same lightning-fast and patently unrealistic game of hockey it has since NHL 2005, and unless you're devoid of any current-gen consoles, there's little reason to take the plunge on this year's game. NHL 07 returns to the PS2 in NHL 08. The most significant change to NHL 08 on the PS2 and PC is the addition of the skill stick, the excellent control feature from the Xbox 360 and PS3 game that lets you deke and shoot using the right analog stick (PC owners can still use keyboard buttons, if that floats your particular brand of boat). Unfortunately, this version of the skill stick isn't all that great. It's certainly an improvement, but it lacks the precision of the stick movements found in the 360 and PS3 versions. Dekes feel a bit stiff, and slap shots are a pain to pull off. Half the time you wind up for the shot, your player won't slap it forward, no matter how hard you push the stick forward to shoot. Wristers, at least, seem to work without a hitch. There's no arguing that the addition of the skill stick is a nice bonus. It's just that this skill stick isn't dynamic enough to really make a significant difference, especially when you're playing the equivalent of speed hockey. NHL 08 still feels way, way too fast to be remotely realistic. Checking is still too frequent and too heavy, and scoring is only slightly less out of control. Once you get a handle on the stick, you can still average seven or eight goals a game just by hammering slap shots (when they work) and constantly crashing the net up the middle, periodically faking out the goalie with some of your fancy new dekes. Defensive artificial intelligence is weak enough to where you can pretty much do this over and over and guarantee a win on practically every difficulty level--especially when the defense decides to start getting tangled-up opposing players in front of the net in a gigantic bunching formation, making it easy for you to move to the wing and snap one in while the goalie is screened. The ridiculous speed and high-scoring nature of the game make it relatively fun if viewed purely as an arcade hockey game, but it's not really any more or less fun than last year's game, or the year before that, for that matter. The only other gameplay addition to be found is a goofy ~buddy buzz~ feature that lets players in two-player team matches tap their sticks on the ice and, as a result, send a quick bit of vibration to their puck-handling friend to let them know they're open. And the PC version doesn't even have this feature--just the PS2 does. In terms of modes, NHL 08 includes all the same ones from last year, including European elite leagues, tournaments, the free-4-all minigame, and the dynasty mode. Unfortunately, none of the negotiation aspects of the 360 and PS3 versions' dynasty mode have made it into the PS2 or PC game, and you can basically sign free agents until there are no free agents left. The salary cap doesn't appear on the free agent signing screen, so you won't know if you're over the cap until you go into the contracts menu and take a look. On top of that, the fantasy draft option is totally busted. You can draft up to 40 players, but draft never tells you how much each player costs, and the computer-controlled teams seem oblivious to the cap. So once the draft is over, you start seeing players like Joe Thornton and Dany Heatley sitting on the free agent market because teams couldn't afford them. It's just silly. The new skill stick finally lets you shoot with the right analog stick, though it doesn't feel nearly as good as it does on the 360 and PS3. Online play is utterly untouched from last year. Head-to-head play, leaderboards, lobbies, it's all there. PC owners can access the EA Sports Online features, like clubs, tournaments, and head-to-head matchmaking, provided they register the game online and figure out how to make the EASO installer work (it doesn't install to the game by default). The online experience is relatively smooth on both platforms, at least. Beyond these meager distinctions, NHL 08 really just is another coat of paint over the same basic game EA has been releasing for years. Graphics have seen next to no improvement beyond a few improved goalie animations and slightly better player faces, and the audio hasn't changed a lick, right down to the same repetitive commentary from Jim Hughson and Craig Simpson that's been recycled to death at this point. While it's certainly no shock that the PS2 version would get this treatment, since it is an aging platform, the PC version's neglect is both surprising and irritating. There's no reason why EA couldn't port the 360 or PS3 version of the game to the PC at this point, and that it hasn't yet is just kind of disgusting. Either way, neither the PS2 nor PC versions of NHL 08 should be your first, or even second, choice for a hockey game this year."}