{"ref": "https://www.gamespot.com/reviews/bleach-shattered-blade-review/1900-6182905/", "date": "November 14, 2007", "game_name": "Bleach: Shattered Blade", "text": "Bleach whitens, so it's a good title for a manga about ethereal ninjas who cleanse evil spirits. It's also toxic, making it an apt name for a game you should avoid at all costs, which, in this case, is Bleach: Shattered Blade. Based on the anime adaptation of the aforementioned manga, Shattered Blade is a dim-witted 3D fighting game that squanders its source with idiot controls, chintzy production values, long loading times, and a lame plot. This is not even a good game for rabid fans, as they are the ones most likely to be offended by Polygon Magic's horrible whitewashing of their favorite fantasy. If you aren't familiar with the series, Bleach tells the story of a young man who can see dead people and one day inadvertently absorbs all the powers of a young-looking spirit ninja dispatched by heaven to hunt hollows. The hollows are corrupted souls that live in a stark desert and prey on lost spirits they find on Earth. If you can't already tell, Bleach's three worlds are insanely intricate and detailed. They have all sorts of rules, symbols, and random exceptions, but you wouldn't know any of that from Shattered Blade. There are many stories at work in this game, but most follow this formula: Hero X is told by character Y that they need to collect shards to meet pressing objective Z. Upon collecting the shards by beating up a handful of opponents, character Y turns out to be Arturo Plateado, an evil hollow you then defeat. After that, everyone makes fun of your character for being fooled so easily and the credits roll. Rochambeau no! Pardon the algebra above, but when you first begin Shattered Blade, you can play through what's called the episode mode with one of three different characters, and the story for each follows the formula above. There is an exception, but for the most part, it's the rule. As you complete episodes with each character, new ones are unlocked for play in episode mode. This might be cool if it weren't for four major factors: the cutscenes, the dialogue, the gameplay, and the loading. Some cutscenes are actually just single, unanimated frames with voice-over. They're cut-pictures. Others have the in-game character models posing while dialogue is read. Here is a pretty good example of the kinds of things people say in Shattered Blade: ~I can feel power coming from my body. It's not a bad feeling.~ And I think every character at some point says ~You're after the Sokyoku shards too?!~ even though it quickly becomes clear that everyone in the Bleach universe is after the shards. Despite this minimalist approach to storytelling, every cutscene is preceded and followed by a loading screen. These are cute the first couple of times you see them, drawn as they are in Rukia's erratic style. But they're soul crushing to see the 500th time, especially when you consider the fact that the loading screens take longer than most of the matches. This is especially true in episode mode, where matches are one round long. Wherever you play, the controls are simple: You move with the Nunchuk and execute three types of basic attacks by waving or poking with the Wii Remote. If you hold the B button and wave, you execute your character's special attacks (Orihime, for instance, heals herself). By holding A and waving, you execute the dreaded critical attack. The critical attack is amazing. It cannot be blocked, it's as fast as a regular attack, and it actually blocks incoming strikes. All you have to do is hold A, swing the Wii Remote, and constantly push the analog stick toward your opponent (to keep him or her in range); then, you are effectively a master of Shattered Blade. This tactic has only two counters: another critical strike and bankai mode. If you and your opponent perform a critical strike at the same time, you'll enter a best of five game of rochambeau, where a vertical slice beats a horizontal one, which in turn beats a poke, which in turn beats a vertical slice. In this mode, a white bar travels down a line, and when it enters a certain window, you must enter your choice. If you end up winning the most rounds out of five, you can hit your opponent for a decent amount of health. As you climb into higher difficulty levels or face human opponents, this becomes the whole game. At least, it is until one of you fills up your power gauge, at which point bankai mode becomes an option. In bankai mode, your character becomes much more powerful and can execute devastating attacks that sometimes fill the entire screen. Nothing in the world is more frustrating than losing three rounds of rochambeau to the computer, only to have it bankai and obliterate you in three cut-sequenced superattacks. Bleach is not as fun as it looks. As you critical strike and bankai your way through episodes, you'll gain points that can be spent on various unlockables, such as the single frames associated with a character's episode mode campaign. If you thought they were lame the first time you saw them, wait until the game tries to sell them to you. You can also play through arcade mode (a sequence of eight matches) or versus mode with a friend. Then again, you could just skip the video game and jump right into an old-fashioned game of rock-paper-scissors for the same effect. Perhaps one of the worst things about Shattered Blade is its graphical quality. This is not because it's bad, but rather, because it's pretty good. The characters are reasonable approximations of their counterparts, and some of the bankai stuff looks pretty intense. If you saw this game at a Wal-Mart and were a fan of the series, you might think it looked pretty cool. You'd be horribly wrong, but it wouldn't be your fault. The voice acting isn't that bad either, although Arturo sounds a lot like Antonio Banderas' Puss in Boots from the Shrek movies, making him even harder to take seriously. The last issue with Bleach: Shattered Blade is the fact that it costs $50 but isn't worth $1. Its fighting model is rochambeau at best, broken at worst. The story is irrelevant, the cutscenes aren't even scenes, and the dialogue is garbage. There is no reason to play this game, other than to marvel with your friends at how bad it is, until one of you bankais and slaughters the other. This might be fun for small children, but everyone else--especially fans of the anime--should leave Bleach in its bottle."}