{"ref": "https://www.gamespot.com/reviews/mario-kart-double-dash-review/1900-6083532/", "date": "November 13, 2003", "game_name": "Mario Kart: Double Dash!!", "text": "Nintendo's mustached mascot can be thanked for defining many a video game trend over the years--platformers (both two- and three-dimensional), party games, and, of course, kart racers. The bar was set for kart racers in 1992 when Super Mario Kart hit the SNES--it was a game that blended breakneck arcade-style racing with simple combat and a cute aesthetic to create an almost-endlessly enjoyable multiplayer game. There have been some decent imitators in the following 11 years, including the 1996 sequel to Super Mario Kart, Mario Kart 64, and the 2001 Game Boy Advance game, Mario Kart Super Circuit, but no other kart racer has appreciably improved upon that original formula. Mario Kart: Double Dash!!, the latest installment in the series, refines that formula a bit, but it's careful not to compromise what people expect from a Mario Kart game. What this leaves you with is essentially the same game you were playing in 1992, updated for 2003. Double Dash!! offers more of the same Mario Kart action you've come to expect. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Mario Kart: Double Dash!! Video Review The racing options in Mario Kart: Double Dash!! should be pretty familiar to those who have played any of the previous Mario Kart games. If you're flying solo, you can choose between three speed classes--50cc, 100cc, or 150cc--and participate in one of the three initially available grand prix cups, or you can go into the time trial mode and try to beat your own best time. As you win gold cups in the different grand prix cup tournaments, you'll unlock hidden characters and karts, as well as additional grand prix cups and courses for the game's battle modes. All told, there are 16 unique tracks in Double Dash, as well as mirrored versions of those tracks. The track designs are generally pretty tight, but they're by and large pretty predictable, too, aping the track archetypes originally laid down by past Mario Kart games. There's a generic trimmed-lawn go-kart track, an ice track, a track set in Bowser's castle, and a Rainbow Road track. There are a few exceptions, such as the Donkey Kong Mountain track, where you're launched by a cannon to the top of a volcanic mountain, then come careening down the rocky mountain face, but mostly there's a creeping familiarity to the track designs in Double Dash. For all that's familiar, the most obvious change that Double Dash makes to the Mario Kart formula is the inclusion of two riders on every cart. The logic is that while one character drives, the other handles all the firepower, though the characters are able to switch spots at a moment's notice with a quick tap of the Z button. In practice, this basically gives you two different slots to carry power-ups in. It also allows for co-op play where two players control a single kart, one handling the driving and the other manning the guns. It's a good idea, but there just isn't enough for each player to do to make the co-op experience terribly compelling. Different characters have different special attacks, which can be picked up at random from regular item boxes--the Mario brothers are able to throw fireballs, Donkey and Diddy Kong can drop a giant banana, and Wario and Waluigi toss out an explosive bob-omb, for example. Each character also corresponds to a certain weight class--light, medium, or heavy--so the characters you choose will also affect which karts you'll be able to choose from, and each kart has its own rating in terms of weight, speed, and acceleration. All of these different variables add a little bit of strategy to the prerace preparations, and they also accommodate different play styles. If you like to throw your weight around the track, bumping players out of position and grabbing their power-ups with brute force, Bowser and Donkey Kong are a winning combo. If you prefer a more nimble racing style and value acceleration over heft, Baby Mario and the Paratroopa are probably a better fit for you. The game looks great, but its rather limited scope is a bit disappointing. The powerslide has been a key mechanic in all Mario Kart games, but Double Dash relies on it even more. The hopping business that preceded a powerslide in past Mario Kart games has been stripped out, so you can now go straight into a powerslide by pulling either of the shoulder triggers while midway through a turn. As you slide, you'll see little sparks shooting off your tires. If you jiggle the analog stick while sliding, the sparks will turn from yellow to red, and then from red to blue. Once you're sparking blue, you can let go of the shoulder trigger for a momentary speed boost. Regardless of which characters or which kart you've picked, powersliding is absolutely fundamental to success in Double Dash, and virtually any corner that you turn can be cornered better by powersliding. It also adds a certain sense of controlled chaos as you come hurling sideways around corners. The appeal of Double Dash will wear out quickly if you're just playing by yourself, as the real value here lies in multiplayer action. Aside from engaging in straightforward races, you can take part in three different arena-based battle modes--balloon battle, shine thief, and bob-omb blast. In balloon battle, the objective is to pop your opponents' balloons with traps and offensive attacks, while keeping yours intact. Shine thief has all the players jockeying to retain possession of a single ~shine~ (those crazy little stars from Super Mario Sunshine) on the track for the longest cumulative amount of time. Bob-omb blast is pretty much the same as balloon battle, though the only weapons you'll pick up are bob-ombs. These deathmatch-style modes are pretty fun and offer a more-aggressive alternative to the generally civil racing modes. It's among the first first-party Nintendo games to make use of the broadband adapter, though the implementation is a bit half-baked. You can have up to four players on a single GameCube in any of these multiplayer modes, and in Double Dash's most unique gesture, you can play with up to eight players using the GameCube's broadband adapter. Those who are truly committed to multiplayer Mario Kart but who carry a deep-seated loathing for the split-screen presentation will probably appreciate the LAN mode the most. The LAN mode is ridiculously easy to set up, requiring virtually no configuration, though it does come with some caveats. The most irksome restriction is that you're unable to pick which characters or kart you'll be using in the game--they are instead assigned to you randomly. It's nice to see Nintendo using the broadband adapter in any sort of capacity, but the way it's implemented reduces the LAN play to little more than a novelty. There's something rather specific about the visual language of the Mario universe, with its intensely cheery color palette and the almost creepy placement of eyes and noses on inanimate objects, and Double Dash does good by that aesthetic, with most tracks feeling like a direct homage to levels found in past Mario games. The characters are rendered beautifully, and the subtlety of their animations lends a lot of personality to characters that you're generally only seeing from the back. The karts themselves each have a unique look, adding just a bit more character to the proceedings. There are lots of small touches that really make the visuals in Double Dash work, such as the focus effect that gives a blur to objects in the distance, the sparks that fly off the wheels as you powerslide, the heat wash in the desert level, and the clouds of dust that you kick up when going across off-road terrain. The game is quite sound technically, and the only time the frame rate in Double Dash takes a hit is when you go into four-player split-screen mode. Aside from that, it's rock-solid. Ever since Mario first said ~It's-a me, Mario!~ everyone in the Mushroom Kingdom has decided to start chatting it up, and all of the drivers in Double Dash certainly have plenty to say--actually, they only have a handful of things to say apiece, but they sure do say them a lot, over and over again. The quality of the voice work is fine, but the repetition is unrelenting, and eventually you'll just tune it out or go crazy. The background music that accompanies the action is uniformly upbeat, occasionally taking on some ska, swing, and big band flavor but always retaining that distinct Mario style. A lot of the in-game sound effects are pulled directly from old Mario games, and they work perfectly fine and really help entrench the game in the Mario universe. Some of the new sounds, such as the engine noise and the different track texture sounds, are nicely executed as well. Your nostalgia for past Mario Kart games will likely determine how strongly you take to Double Dash. Despite the fact that it's still essentially the same game as Super Mario Kart, there is no denying the innate quality of the production of Double Dash. The game looks and moves great, the controls are responsive, and there's a nice variety of gameplay modes available. Still, considering the seven-year gap since Mario Kart 64 was released, it's hard not to be a little disappointed with the limited scope of the game. All of the items on the ~things you need to make a Mario Kart game~ checklist have been marked off, but the envelope hasn't been pushed, and in some respects, it feels as though Nintendo is just going through the motions. While this might trigger a nice little fit of nostalgia for players who had a blast playing Super Mario Kart in its heyday, it probably won't do much to seduce newer generations of gamers who have more exciting, inventive racing fare to choose from. The appeal of Double Dash will wear out quickly if you're just playing by yourself, as the real value here lies in multiplayer action. Aside from engaging in straightforward races, you can take part in three different arena-based battle modes--balloon battle, shine thief, and bob-omb blast. In balloon battle, the objective is to pop your opponents' balloons with traps and offensive attacks, while keeping yours intact. Shine thief has all the players jockeying to retain possession of a single ~shine~ (those crazy little stars from Super Mario Sunshine) on the track for the longest cumulative amount of time. Bob-omb blast is pretty much the same as balloon battle, though the only weapons you'll pick up are bob-ombs. These deathmatch-style modes are pretty fun and offer a more-aggressive alternative to the generally civil racing modes. It's among the first first-party Nintendo games to make use of the broadband adapter, though the implementation is a bit half-baked. You can have up to four players on a single GameCube in any of these multiplayer modes, and in Double Dash's most unique gesture, you can play with up to eight players using the GameCube's broadband adapter. Those who are truly committed to multiplayer Mario Kart but who carry a deep-seated loathing for the split-screen presentation will probably appreciate the LAN mode the most. The LAN mode is ridiculously easy to set up, requiring virtually no configuration, though it does come with some caveats. The most irksome restriction is that you're unable to pick which characters or kart you'll be using in the game--they are instead assigned to you randomly. It's nice to see Nintendo using the broadband adapter in any sort of capacity, but the way it's implemented reduces the LAN play to little more than a novelty. There's something rather specific about the visual language of the Mario universe, with its intensely cheery color palette and the almost creepy placement of eyes and noses on inanimate objects, and Double Dash does good by that aesthetic, with most tracks feeling like a direct homage to levels found in past Mario games. The characters are rendered beautifully, and the subtlety of their animations lends a lot of personality to characters that you're generally only seeing from the back. The karts themselves each have a unique look, adding just a bit more character to the proceedings. There are lots of small touches that really make the visuals in Double Dash work, such as the focus effect that gives a blur to objects in the distance, the sparks that fly off the wheels as you powerslide, the heat wash in the desert level, and the clouds of dust that you kick up when going across off-road terrain. The game is quite sound technically, and the only time the frame rate in Double Dash takes a hit is when you go into four-player split-screen mode. Aside from that, it's rock-solid. Ever since Mario first said ~It's-a me, Mario!~ everyone in the Mushroom Kingdom has decided to start chatting it up, and all of the drivers in Double Dash certainly have plenty to say--actually, they only have a handful of things to say apiece, but they sure do say them a lot, over and over again. The quality of the voice work is fine, but the repetition is unrelenting, and eventually you'll just tune it out or go crazy. The background music that accompanies the action is uniformly upbeat, occasionally taking on some ska, swing, and big band flavor but always retaining that distinct Mario style. A lot of the in-game sound effects are pulled directly from old Mario games, and they work perfectly fine and really help entrench the game in the Mario universe. Some of the new sounds, such as the engine noise and the different track texture sounds, are nicely executed as well. Your nostalgia for past Mario Kart games will likely determine how strongly you take to Double Dash. Despite the fact that it's still essentially the same game as Super Mario Kart, there is no denying the innate quality of the production of Double Dash. The game looks and moves great, the controls are responsive, and there's a nice variety of gameplay modes available. Still, considering the seven-year gap since Mario Kart 64 was released, it's hard not to be a little disappointed with the limited scope of the game. All of the items on the ~things you need to make a Mario Kart game~ checklist have been marked off, but the envelope hasn't been pushed, and in some respects, it feels as though Nintendo is just going through the motions. While this might trigger a nice little fit of nostalgia for players who had a blast playing Super Mario Kart in its heyday, it probably won't do much to seduce newer generations of gamers who have more exciting, inventive racing fare to choose from."}