{"ref": "https://www.gamespot.com/reviews/othercide-review/1900-6417541/", "date": "September 11, 2020", "game_name": "Othercide", "text": "Despite its gothic horror visuals and heavy metal-inspired soundtrack, Othercide is, at its core, a heartfelt story about having empathy and compassion for someone who has suffered intense trauma. It's a game about sacrifice and hard choices, of accepting failure with the knowledge that you'll rise again stronger. Othercide's turn-based combat can be brutal, but at its best, it's also intensely rewarding to master. Though it suffers from some repetitive maps and technical issues, Othercide is an impressive strategy game with an otherworldly atmosphere and rich underlying story worth diving into.From the very start, Othercide pulls you into a grim world on the brink of collapse. A city, already devastated by plague, has now been overrun with nightmare creatures called Others and becomes the site of an apocalyptic event that shatters time and space, resulting in an in-between place called the ~Dark Corner.~ Together with a ghost-like being known as the Red Mother, you must command her army of Daughters in a battle against the Suffering Other and its monstrous creations. With names like Peace, Joy, and Harmony, these wide-eyed, white-haired Daughters cast a stark contrast to the forces of Suffering they face on the battlefield. Othercide does a fantastic job of establishing its horror atmosphere and introducing its main characters--the Red Mother and a Child that has merged with Suffering--in a way that immediately grabs you, compelling you to unravel its secrets.Memory plays a major role in Othercide, and it's your greatest weapon. If all of your Daughters die, you'll begin a new ~recollection,~ or run, that starts you on Day 1 with a brand-new set of Daughters at full HP. Thankfully, you're not starting from scratch every time; in fact, the game is designed to help you improve with every failure and help you grow stronger. As you complete missions, you earn shards that can be used to unlock ~remembrances,~ which are team-wide advantages that give you a little more of an edge in battle, such as boosting damage against certain enemies or experience earned from missions. Specific ability bonuses, called ~memories,~ can also be directly applied to your Daughters to provide buffs or add certain effects to their attacks. Though memories dont roll over from one recollection to the next like remembrances do, you earn them quickly through missions. The similar verbiage here can be confusing on your first few runs, but it doesn't take too long to grasp how recollections, remembrances, and memories play a key role in overcoming the challenging combat encounters in Othercide. Early on, because you start with a new set of low-level Daughters in each run, it can feel like youre progressing too slowly, but the introduction of more and more buffs ensures youre never truly starting from scratch past your first recollection. And eventually, reaching certain checkpoints unlocks remembrances that allow you to start a new run with Daughters at higher levels.Othercides sacrifice system also helps maintain this balance, though it may seem punishing at first. There are no healing items in the game, nor will your Daughters' HP be replenished between encounters. The only way to heal a Daughter is to sacrifice another of equal or higher level, and once a Daughter has gone to the cemetery, you can only bring her back by using a Resurrection Token. There are strategic reasons for sacrificing a Daughter beyond simply healing another, however. As a Daughter fights through battles, shell earn certain traits based on her behavior (such as Precise, which boosts critical damage by 25%), and if she is sacrificed, some of those traits will pass on to the receiving Daughter. While uncommon, some traits do have negative effects (Arrogant, for example, lowers experience earned by 10%), and these can transfer as well, so its important to check whats passing on. Traits are permanently added to the Daughters stats, so while you may be losing a Daughter in the short-term, sacrifices can help your entire team grow stronger. They become even easier to utilize as you gain more Resurrection Tokens, but you wont have access to many of those at the beginning of the game. The sacrifice mechanic adds yet another interesting layer to your overall strategy and is integral to powering up your team.In this ~Dark Corner~ the game takes place in, the Daughters are the only remaining hope, and though they may fail repeatedly, those brilliant flashes of red are reminders they'll always rise again stronger, resisting the darkness.Unlocking all of these stat bonuses are a must if you hope to survive Othercide's bloody battles; these fights can be painful if you aren't careful. Enemies will deal major damage to your Daughters if you let them, and with HP at a premium, you really don't want any hit to slip through. At the center of Othercide's combat is a dynamic timeline system that tracks initiative, or turn order, for your Daughters as well as enemies. Turn order can shift at any moment due to whatever actions or buffs are in play, and you only have a certain amount of action points for each Daughter's turn. As a result, combat becomes a delicate dance between controlled actions that allow you to attack again sooner and burst actions that allow you to unleash more attacks but move you to the end of the timeline, which may leave you vulnerable to enemy actions. Burst actions tend to be the riskier option, especially because some of the games most powerful moves actually drain your precious HP, but bursting can also give those moves a longer period of effect, which can prove more valuable in certain situations. I found myself leaning on burst actions quite often, preferring to ensure an enemy's death rather than giving them one more turn and the chance to pull something sneaky.Your strategy largely depends on the type of Daughters youve brought into battle, though, and each Daughter can be assigned to one of three main classes. The Blademaster excels in melee combat, while the Shieldbearer is your tank, designed to take heavy hits. The Soulslinger, a ranged unit, is the most interesting class from a tactical perspective. She rains down bullets on enemies from afar but also provides cover for her allies, with abilities that allow her to interrupt enemy attacks and perform powerful combos. These classes work together like a well-oiled machine, shielding each other from attacks, casting initiative boosts, and setting up combos that allow one Daughter's attack to trigger follow-up attacks from her allies.Othercide's interruption, reaction, and delayed moves elevate this to the next level and are where the combat really shines. Interruptions can block an enemy attack on one of your Daughters and trigger a counterattack instead. Reactions will trigger an attack when certain conditions are met, such as an enemy taking damage or an ally receiving a boost. Meanwhile, delayed actions will take place after a certain number of turns pass. The best part is that these actions can all build on each other--an interruption attack can trigger a reaction attack, which can trigger another reaction attack, and so forth--resulting in some deadly combos that really show off the game's stylish action. The Soulslinger class is particularly adept at this, and I tried to have at least a couple of Soulslingers around for major fights to help me execute powerful ranged combos.However, Othercide allows for a variety of strategies with its different class abilities, and youll have several opportunities to add one of two abilities to your Daughters moveset as she levels up. Once an ability is chosen, the other option is lost to you forever for that specific Daughter, adding even more weight to the choices you make. These abilities open up many possibilities for how you can approach a combat encounter. For example, you could choose to lean more on your Shieldbearers to absorb heavy hits and delay enemy initiatives using their Slam ability, keeping foes from ever having a chance to attack. Blademasters, on the other hand, can lure enemies into range and methodically attack each one that gets close with their Immovable Stance ability.Othercide covers only the basics of the timeline system and combat in its brief prologue-tutorial--once you get past that section, there's zero hand-holding, and I found myself learning how its systems work the hard way: by failing miserably. Even if you play turn-based tactics games all the time and grasp Othercide's combat quickly, chances are your team simply won't be strong enough to overcome the first boss you encounter. The bosses in Othercide are on a completely different level from the game's regular enemies, and they seem designed to showcase the full capabilities of its combat, with deadly area-of-effect attacks, delayed moves, interruptions, and reactions that can--and likely will--send your entire team of Daughters to the graveyard. The first few bosses come with massive difficulty spikes, but considering you can immediately re-fight a boss after your first clash with them, I didn't find this too unreasonable; instead, it motivated me to spend more time training up my Daughters and unlocking new remembrances that would boost their stats.Unfortunately, the complex and immensely rewarding boss fights only emphasize the lack of variety in the regular missions, of which there are only four types: hunt (kill all the enemies), ritual (destroy a specific enemy), rescue (escort a unit to freedom), and survive (stay alive until an escape route appears). These four main mission objectives would not feel so repetitive if they weren't accompanied by the same small batch of maps on which enemies appear in the same locations every time. The same lines of dialogue also repeat themselves constantly in each section of the game; sometimes, you'll hear the same phrase three or four times back to back, inexplicably. This may be a technical issue that could be patched eventually, but the repetitive nature of these missions can make level-grinding increasingly tedious.Particularly in the second half of the game, when more experience points are needed to level up, it really set in just how repetitive these maps and enemy formations are when you've done a dozen of them in a row, and you'll have to complete a lot of missions if you hope to max out your Daughters and unlock their most powerful abilities. Eventually, I turned down the game's volume and turned on a podcast as I grinded out later missions. I was still having fun, but they no longer required 100% of my attention, and it felt like a missed opportunity to introduce more challenging enemies and movesets outside of the boss fights.The first few bosses come with massive difficulty spikes, but considering you can immediately re-fight a boss after your first clash with them, I didn't find this too unreasonable; instead, it motivated me to spend more time training up my Daughters and unlocking new remembrances that would boost their stats.Boss encounters in Othercide aren't just interesting for their combat maneuvers; they're an integral part of the game's story and lore, which is contained in a section of the battle preparation menu called the codex. Here, you can find key information about a boss' moves and behavior after your first battle with them as well as character info alluding to their relationship with the Child. The codex compiles details on every enemy and character in the game as you encounter them; more importantly, it also contains the entire backstory of Othercide involving the Mother, the Child, and the Others. This information is filled out slowly as you progress through the game, and it's key to understanding what the heck is going on. The codex is beautifully written, and it's easy to get lost in its ~pages,~ which read like an incredible dark fantasy novel--one I'd definitely like to buy. If you have even an ounce of appreciation for storytelling in games, Othercide's codex is a treasure trove containing a story I haven't stopped thinking about since I finished the game.Othercide's themes and lore are interwoven through nearly every aspect of the game, including its visuals and music. Its striking art style depicts the world in grayscale, a perfect backdrop for the game's horrific nightmare creatures and bosses, but it's contrasted by the bright red scarves Daughters wear into battle--and, of course, the Red Mother herself. In this ~Dark Corner~ the game takes place in, the Daughters are the only remaining hope, and though they may fail repeatedly, those brilliant flashes of red are reminders they'll always rise again stronger, resisting the darkness. The otherworldly maps, though repetitive, are fascinating to observe and filled with small story details alluding to the Childs past, such as an ominous painting on the wall of his abuser. The dark, heavy metal-inspired soundtrack is also a fitting backdrop, with suitably emo lyrics that fit in perfectly with the games story. The boss battle songs, in particular, include some real bangers.It's a shame that Othercide is hampered by some significant technical issues on PS4. One particularly annoying bug consistently wouldn't allow me to sort my Daughters in the cemetery unless I tabbed in and out of that menu several times, when clicking the left joystick should have done the trick. I also experienced overlapping lines of dialogue and some cut-off lines at the end of missions along with several game crashes while attempting the final boss. But the bug that truly upset me was one that erased most of the files in my codex after I rolled credits on the game. Lost progress is never fun, but losing the story I'd worked so hard to assemble was a punch in the gut.Despite those unfortunate technical issues, Othercide is still a great tactics game. The variety of classes and abilities make for a wide range of strategies, but no matter your team composition, the Daughters work together beautifully to take down their enemies. Boss fights are by far the most memorable and really showcase the reaction and combo system, but they also feed into the game's unique and engrossing story. While Othercide's maps and missions leave something to be desired, it's still a blast to cut your way through hordes of Others and pull off deadly combos that look cool as hell. With an exceptional story, atmospheric horror visuals, and tense, rewarding combat, Othercide offers a challenge you'll want to rise to, again and again."}