{"ref": "https://www.gamespot.com/reviews/touch-the-dead-review/1900-6171242/", "date": "May 21, 2007", "game_name": "Touch the Dead", "text": "In an apparent attempt to create a little brand confusion, Eidos has released Touch the Dead for the Nintendo DS, an on-rails shooter that evokes Sega's campy light gun series The House of the Dead. The key differences between the two are that Touch the Dead replaces the light gun with touch-screen controls and that Touch the Dead isn't very fun. While the generally responsive touch-screen controls do suffer from an awkward reloading mechanic, Touch the Dead's big failing is its flat atmosphere and the inherently repetitive nature of the action. No, Touch the Dead is not a dating sim, you sicko. Or, at least, not a very good one. The game opens with Rob Steiner, a prisoner at Ashdown Hole State Penitentiary, being suddenly and mysteriously released from his cell. It's even more mysterious that the prison appears completely empty. Yet, even more mysterious is the handgun that he finds sitting unattended on the floor of the bathroom, which comes in handy for dealing with the seemingly endless waves of zombies that start literally popping out of nowhere and impeding upon his plan of escape. Aside from his apparent toughness and penchant for using clunky one-liners at the end of chapters in the game, you don't really get to know much more about Rob Steiner or exactly what is going on in Touch the Dead. All you do is shoot zombies; hundreds and hundreds of zombies. Still, this is not a bad proposition, at least in theory. You play Touch the Dead from a first-person perspective, but the game handles all your movement throughout it, allowing you to focus entirely on the righteous dispensation of zombie death. You shoot the zombies by tapping them with the stylus as they appear on the DS touch screen. You can hold the stylus on the screen to unload multiple shots, though your firing rate is much faster if you tap repeatedly. The zombies have different damage areas, with headshots usually proving to be the most effective form of dead touching. While some zombies will sway back and forth erratically, making headshots a little more challenging, shooting zombies isn't particularly difficult in Touch the Dead. Much of the challenge here is manufactured, with the game's awkward reload mechanic as a significant culprit. Every time you empty a clip, you have to manually reload by dragging the stylus from the ammo icon on the lower right-hand part of the screen to the clip icon on the lower left-hand part of the screen. While it certainly injects a little tension into the game, you quickly get to the point where you have to reload your clip after every zombie you take down, so you actually end up spending more time reloading your weapon than you do shooting zombies. It feels unnatural and can be difficult to consistently reload fast enough when you have a swarm of zombies bearing down on you. As you progress through the four main chapters of Touch the Dead, each of which is punctuated with a boss fight against some larger-sized monstrosity, you'll pick up a shotgun, a crowbar, and a submachine gun. The crowbar, which you use by dragging the stylus left or right across the screen, is useless, though the shotgun and submachine gun are potent. But unlike your starting pistol, these weapons have limited ammo, which you can replenish by shooting open random crates and cabinets that you'll find conspicuously scattered throughout the game. Ammo conservation can be a key tactic at certain points in the game, though at other times, it seems like you have more ammo than you know what to do with in Touch the Dead. The reloading nonsense is a bummer, but what's worse is how little the game surprises you. For example, the zombies have a knack for materializing out of thin air. After leaving a room you've just cleared of zombies, you'll walk down an empty hallway, only to turn around and find that there's a troupe of gray-matter gourmands coming at you. Sometimes zombies will just step into frame from the sides of the screen, even if you're in a closed room that is apparently totally devoid of zombie activity. Also, your predetermined path is completely ridiculous at times. You'll run around in circles in one room, giving all these zombies a chance to teleport in from the zombie dimension, or wherever, when the exit door is right in front of you. Why wouldn't you just make a beeline for the exit door? You know you're doing something wrong when wanton zombie death isn't entertaining. The lack of zombie variety also makes the experience all the more tedious. While you'll occasionally be faced with non-zombie threats, such as rats, bats, and alligators (crocodiles?), you'll usually face skinny zombie or fat zombie. Though the game cycles through a few different textures for these two zombie types, you rarely see more than one type of skinny zombie or fat zombie at once. The crude 3D visuals keep the zombies from looking particularly threatening, and the environments tend to consist largely of nondescript corridors. The weapon reports sound weak and tinny, while the various moans or groans of the zombies are repetitive and unconvincing. The crazy heavy metal loops that play over the menu and during boss fights are about the only worthwhile part of the game's sound design. Touch the Dead is just a few hours long, though you can choose to play through it cooperatively, which is perhaps the most contrived part of the game because both players will see from the exact same perspective. There are some very good reasons that light gun games have fallen out of favor. The decline in popularity of arcades and the need for a specialized piece of hardware for home versions are certainly two big ones, but the most significant one is perhaps that the formula just got worn out. Touch the Dead's folly lies in the fact that it banks on this worn-out formula and does a passionless job of doing it. Switching the action from pulling a trigger to tapping a stylus doesn't make up for that folly."}