{"ref": "https://www.gamespot.com/reviews/maelstrom-review/1900-6166139/", "date": "February 20, 2007", "game_name": "Maelstrom: The Battle For Earth Begins", "text": "It's a shame that the makers of 2004's excellent and inventive real-time strategy game Perimeter couldn't maintain their momentum. Maelstrom is a frustrating mess that showcases meaningless tacked-on features in lieu of functional RTS gameplay. It's hard not to walk away with the feeling that KD Visions spent more of its time making pretty water graphics than it did making the game fun to play. You can take direct control of your hero units. And it serves no purpose whatsoever. The gist of Maelstrom's single-player campaign is that a global catastrophe has left most of Earth underwater, and the human freedom fighters that call themselves the Remnants are fighting the stoic Ascension for control over the leftovers. But wait--you guessed it--a third force, the alien Hai-Genti, needs the deluged planet for its own devices. It's all laid out in a total of four campaigns that start poorly and never veer from the low standard set by the Remnant story. To the game's credit, each faction plays differently from the others. The Remnants are the most familiar to play, using farms to harvest sunlight and collecting scrap from the environment. The Ascension gather DNA from the Remnant compounds, as well as the rays of the sun, while the Hai-Genti produce biomass. All three factions use water pumps scattered throughout the maps to their advantage, either for collection as a resource or, in the case of the Hai-Genti, for the conversion of water into poisonous mutagen. The human factions can terraform land, and the Ascension can transform mobile units into other structures. But the campaigns don't do the differences justice, alternating between mind-numbingly boring and just plain stupid. The game almost always boils down to moving units en masse from one mission point to the next and destroying enemies, which is completely devoid of strategy. The campaigns are also really easy. Well, with the exception of surprise deaths--falling meteors destroy your hero units and force a reload of your most recent saved game. And, no, there is nothing you can do to escape those moments, aside from trial and error. But what could make this more fun? Why, giving your hero units special abilities and letting you jump into their shoes as if Maelstrom is a third-person action game, of course! This isn't a completely new feature, because last year's Rise & Fall: Civilizations at War used a similar mechanic. Yet while Rise & Fall valiantly attempted to make the action element meaningful in the context of the gameplay, Maelstrom sticks it in and does absolutely nothing with it. What was the purpose? Controlling a hero this way is jerky and annoying, as well as a complete waste of time. You can activate your hero's special abilities from the traditional RTS view, but many of those abilities are pointless. For example, the Remnant can research the ability to convert survivors into mercenaries, but at no point were there any survivors to find, nor did activating the ability do anything. In another insane case, if you want to use a unit's healing abilities, you have to find and click on the unit that needs healing right on the main screen because you can't do it on the unit card in the heads-up display. You'll also need luck finding it because it will either be clustered in a tight hair ball of units or halfway across the screen and away from the control group for no apparent reason. Maelstrom's pathfinding and artificial intelligence are appalling. The results of a simple movement order would feel more at home in an interpretive dance recital than in a strategy game. When ordering a control group just a short distance, individual units wander off like amnesiacs, sometimes jittering against the geometry and sometimes making their way to the destination like drunks hobbling home after last call. Even when a control group is at rest, a lone unit will circle around the others as if they're playing a game of ~duck duck goose.~ It makes battles infuriating because individual units meander into danger, and there's simply nothing you can do to stop it. The AI also requires the enemy to be directly on top of your units before the enemy fights back. The resulting micromanagement makes playing Maelstrom a lot like babysitting, except that the Ascension won't hand you $20 at the end of the night. And like an unruly toddler, the units do whatever they want anyway, so after a while, you won't want to bother. They'll even try to shoot through objects without repositioning themselves to do damage. But at least you won't need to worry about that semitrailer attacking you. The most interesting faction is the Zerg. Er, the Hai-Genti. To make matters worse, Maelstrom is an excruciating assault on the ears. The subtle soundtrack is the only point of respite because the minute you select a unit, it will bombard you with possibly the most horrific voice acting you'll hear in a game all year. You will turn down your speakers to avoid aural injury. And that's OK because some units are weirdly silent. Aren't giant mechs supposed to make some kind of noise when they walk? The visuals are a little better, and it's easy to get initially caught up in the beautiful water and terraforming effects. But gorgeous water can't save Maelstrom from poor textures, bland environments, and mediocre unit animations. Multiplayer is at least functional and features a good number of maps for up to six players. Even a poor RTS game can be moderately enjoyable against other players, and the factions are balanced well enough. You can also play a skirmish against the computer, but you'll need to turn the AI up a notch because the normal setting doesn't offer any challenge. Even if you somehow manage to find Maelstrom's bright spots, there are too many ridiculous design elements to make it worth a purchase--unless you've always wanted to play a sci-fi RTS game with a ~duck duck goose~ minigame, of course."}