{"ref": "https://www.gamespot.com/reviews/beyond-divinity-review/1900-6095202/", "date": "May 4, 2004", "game_name": "Beyond Divinity", "text": "Call it Diviner Divinity. The sequel to 2002's surprisingly good old-school role-playing game from Belgian developer Larian Studios isn't a huge departure from its predecessor, but it won't seem as surprisingly good if you've had the pleasure of playing the previous game. However, it does offer a lengthy, brand-new quest and party-based gameplay, whereas the previous game was a single-character affair. Beyond Divinity, like its strangely-named predecessor Divine Divinity (which incidentally is included with the new game as a free bonus), combines the hack-and-slash action and open-ended character building of the Diablo games with the detailed, open-ended world and quest-heavy single-player gameplay of the classic Ultima games, or more recent hits like The Elder Scrolls III: Morrowind. The result may be a little too overwhelming or simply too difficult for the role-playing neophyte, though fans of Divine Divinity and other games like it should certainly give the new sequel a shot. It promises many hours of addictive adventuring, all with a tone that succeeds at being self-consciously humorous in the face of some fairly conventional fantasy trappings. Diablo-style action crossed with Ultima-style questing and detail characterized 2002's Divine Divinity as well as its new sequel. Though Beyond Divinity has a lot in common with its predecessor, you don't need to be familiar with that game's story to dive right into this one. The premise of Beyond Divinity is just like one of those movies where two guys who would hate each other under normal circumstances instead have to join forces. You, the hero, awaken in a dungeon and are confronted with a death knight--a creature who lives for evil. A conversation transpires to this effect: ~Look, man. I don't like you, and you don't like me. But if we're gonna get out of this mess alive, we're gonna have to work together.~ You and the death knight have been bound together by a sadistic demon. So you're trying to escape from his dungeon and, eventually, find a way to break the bond between the two of you. In gameplay terms, what this means is that you'll usually be controlling a pair of characters in Beyond Divinity. When you first begin play, you're able to define the starting characteristics of the hero character as well as the death knight. As in Divine Divinity, the three basic templates are for a warrior, a mage, and a survivalist, who's basically a Dungeons & Dragons-style rogue. As you gain experience levels in the game, you can apply attribute points to a number of key stats, and you can also apply skill points to specialize your character in different ways. This system is completely open ended, inviting you to play the game however you see fit. In practice, though, it pays to take advantage of the two-character dynamic by specializing one character (probably the surly death knight) as a close-combat fighter and the other character (probably the diplomatic hero) as a ranged attacker and/or magic user. Such combinations are ideal for fending off the game's legions of powerful, but typically none-too-intelligent, foes. Beyond Divinity also offers four different difficulty settings, presented only when you first begin play. The game itself doesn't tell you what the specific differences between these settings are, but suffice it to say that less experienced players should gravitate toward the easier-sounding settings without feeling guilty, because Beyond Divinity is a hard game. The initial escape sequence, which is a lengthy dungeon crawl through a decidedly perilous dungeon, will introduce you to this game's unabashed tendency to kill you suddenly, often by the inopportune springing of traps, but also at the hands of numerous strong, hardy foes. This is one of those games where even the loading screens encourage you to save your progress often. There's a convenient quick-save option, but it's not as convenient as it could be since saving your progress in Beyond Divinity takes a few disruptive seconds. Yet, if you don't routinely save your game, you'll get that much more frustrated when you eventually get killed. It's ~game over~ if either the hero or the death knight runs out of hit points. Thankfully, you can pause the action instantly and at any time by pressing the space bar, and while paused, you can designate new targets, quaff potions that instantly restore your health or magic power, and so on. You can also set your characters to auto-attack any hostiles in the vicinity. Without the pause feature the game would have been pretty much unmanageable; with the pause feature, the game is tactical and often challenging without being sluggish. The pacing can take some getting used to, but considering how much ground there is to cover in this game, you'll ultimately appreciate that the combat is nice and fast. Get used to having the death knight around. He may have a foul temper, but he's your lifeline, and you're his. Questing in Beyond Divinity is fairly conventional. Characters will ask you to perform various errands for them, which are sometimes simple two-step processes, but other times they are a lot more elaborate. There's a fairly decent quest log to help you keep track of all of what you're supposed to be doing, and there's also an onscreen minimap and a full-screen map that's annotated with places of interest to keep you from getting too lost. The interface generally works well, though one aspect of it that's quite cumbersome is the inventory, which is a big mishmash of all the junk you've amassed on your journey. Good luck looking for smaller items like magic rings in there. Granted, this is probably an appropriate simulation of what it must be like trying to find a small trinket in a huge backpack full of crossbows, potions, spears, helmets, fruit, and books and such. What's impressive about Beyond Divinity, like its predecessor, is the sheer volume of stuff in the game--from the physical items you'll find and equip to all the places you'll go, things you'll fight, and people you'll meet. Like Divine Divinity, this game has some very large, multilevel areas for you to explore, and important details can be hidden anywhere, demanding you to be observant. Fortunately, among the interface features retained from the previous game are the abilities to highlight any onscreen items that can be picked up by holding the Alt key and to automatically target the enemy closest to your cursor by holding Ctrl when left-clicking. These helpful interface features prevent Beyond Divinity from devolving into a game that's all about fishing for places to click. Beyond Divinity's open-ended structure means it's possible to run into enemies that are much too powerful for you. Since your characters do become appreciably stronger as they level up, you'll always be on the lookout for the easier things to fight so that you can gain and maintain an edge in combat. One new option to achieve this is the battlefields--areas that become instantly accessible from each of the game's main acts--once you find the appropriate magic artifact that lets you teleport there, that is. The battlefields contain merchants who'll buy or sell stuff as well as send you on fetch quests or kill quests into yonder wilderness, or specifically, into yonder dungeons in yonder wilderness. These battlefield sequences are optional and are much more transparent as a pure hack-and-slash grind than most of the game's other sequences. But since Beyond Divinity works well from a mechanical standpoint, and since it is addictive to play between all the fighting, leveling up, and finding new stuff, the battlefields can be a good diversion. They're also there just to help prevent you from ever getting too stuck. Being a hero (or death knight) isn't easy. Beyond Divinity caters to experienced role-playing gamers with its huge areas to explore and numerous, tough foes to fight. As mentioned, it's not necessarily just you and the death knight doing all the damage. In Beyond Divinity, you'll be able to find and use summoning dolls, which are another new addition since the previous game. Summoning dolls become temporary party members, each with its own customizable stats and abilities. They can give you an edge in battle, and they can also make the combat considerably more complex. Some of the optional skills you may specialize in revolve all around boosting the powers of these summoned creatures, but in the end you needn't depend on them unless you so choose. Just because it's open-ended doesn't mean all the options in Beyond Divinity are viable. A downloadable patch issued soon after the release of the game makes numerous tweaks and changes to the game's skill system and some of the game's other aspects. Some of the play balancing remains questionable, though the game's lack of linearity works well both ways, since it means you can always try something different if what you're trying to do isn't working. Be that as it may, Beyond Divinity is generally lacking a desirable layer of polish. For instance, whenever you die, the screen prompts you to press Escape, though you really should be quick-loading your last saved game. There are also minor typographical errors throughout the game's textual dialogue. You'll also notice that the death knight's voice sounds noticeably different in the cutscenes between the game's acts versus during the actual gameplay. The game's noninteractive story sequences also leave something to be desired. You'll stumble upon these sequences only to completely lose control of your characters as some triggered, scripted sequence pans out--which is normally fine, but sometimes it means you'll be helpless at the hands of nearby foes. The cumbersome inventory and somewhat clunky interface for trading with non-player characters also contribute to Beyond Divinity's rather rustic feel, if computer role-playing games are even capable of being rustic. Granted, the presentation is much the same as 2002's Divine Divinity, but the intervening months haven't been too kind. This is still an attractive-looking game, featuring a fine level of detail and some good-looking special effects. The main difference in the presentation is that this game, unlike its predecessor, has fully 3D characters running around on the prerendered backdrops, which is certainly a change but not necessarily a marked improvement. In fact, the 3D characters seem to have lost a bit of sharpness since the last game, though they certainly don't look bad. If there's an issue with the visuals, it's that they look flat. The backgrounds are rather static, and the lighting tends to be pretty drab, so if you've gotten used to the rich and colorful 3D graphics of today's cutting-edge PC games, then Beyond Divinity's modest good looks won't impress you. Beyond Divinity is well suited for hardcore fans of role-playing games, including fans of the previous game. The game's audio ultimately deserves a lot of credit, though one way to describe it is that it's inconsistent. There's a lot of voice-over to go with the dialogue, but the voice-acting performances are spotty and often quite silly. Were it not for the fairly lighthearted dialogue, the effects of this would have been disastrous, but in the end, the goofy voice acting fits well with the often equally goofy conversations. Sound effects are all quite good, though in many cases they are lifted directly from the previous game. Much like in Divine Divinity, the music here is what steals the show as far as audio is concerned. A wide selection of moody, moving classical-styled tunes, often laced with choir vocals, do much to set the fantasy role-playing mood. Some other, more ambient tracks are good for suspense, though on some occasions the music is cut off, which is unfortunate since you'll want to keep listening to it. Then again, you'll have plenty of time to listen to the music during this game's lengthy journey. Beyond Divinity, like its predecessor, is a sprawling adventure that gives you the freedom to play as you wish. It's actually somewhat more focused than the first game, and it gives you clear-cut objectives that you're free to accomplish using your own devices. The game's core elements--the combat, the questing, and the exploration--are all effectively implemented, and the two-character dynamic and open-ended skill system introduced in Beyond Divinity should be enough to make the action seem just different enough to those who have already poured dozens of hours into the first game. This is a good, solid choice either for fans of Larian's last game or for anyone up for a deep computer role-playing experience, especially given the small drought the genre has experienced in these past few months. Beyond Divinity's open-ended structure means it's possible to run into enemies that are much too powerful for you. Since your characters do become appreciably stronger as they level up, you'll always be on the lookout for the easier things to fight so that you can gain and maintain an edge in combat. One new option to achieve this is the battlefields--areas that become instantly accessible from each of the game's main acts--once you find the appropriate magic artifact that lets you teleport there, that is. The battlefields contain merchants who'll buy or sell stuff as well as send you on fetch quests or kill quests into yonder wilderness, or specifically, into yonder dungeons in yonder wilderness. These battlefield sequences are optional and are much more transparent as a pure hack-and-slash grind than most of the game's other sequences. But since Beyond Divinity works well from a mechanical standpoint, and since it is addictive to play between all the fighting, leveling up, and finding new stuff, the battlefields can be a good diversion. They're also there just to help prevent you from ever getting too stuck. Being a hero (or death knight) isn't easy. Beyond Divinity caters to experienced role-playing gamers with its huge areas to explore and numerous, tough foes to fight. As mentioned, it's not necessarily just you and the death knight doing all the damage. In Beyond Divinity, you'll be able to find and use summoning dolls, which are another new addition since the previous game. Summoning dolls become temporary party members, each with its own customizable stats and abilities. They can give you an edge in battle, and they can also make the combat considerably more complex. Some of the optional skills you may specialize in revolve all around boosting the powers of these summoned creatures, but in the end you needn't depend on them unless you so choose. Just because it's open-ended doesn't mean all the options in Beyond Divinity are viable. A downloadable patch issued soon after the release of the game makes numerous tweaks and changes to the game's skill system and some of the game's other aspects. Some of the play balancing remains questionable, though the game's lack of linearity works well both ways, since it means you can always try something different if what you're trying to do isn't working. Be that as it may, Beyond Divinity is generally lacking a desirable layer of polish. For instance, whenever you die, the screen prompts you to press Escape, though you really should be quick-loading your last saved game. There are also minor typographical errors throughout the game's textual dialogue. You'll also notice that the death knight's voice sounds noticeably different in the cutscenes between the game's acts versus during the actual gameplay. The game's noninteractive story sequences also leave something to be desired. You'll stumble upon these sequences only to completely lose control of your characters as some triggered, scripted sequence pans out--which is normally fine, but sometimes it means you'll be helpless at the hands of nearby foes. The cumbersome inventory and somewhat clunky interface for trading with non-player characters also contribute to Beyond Divinity's rather rustic feel, if computer role-playing games are even capable of being rustic. Granted, the presentation is much the same as 2002's Divine Divinity, but the intervening months haven't been too kind. This is still an attractive-looking game, featuring a fine level of detail and some good-looking special effects. The main difference in the presentation is that this game, unlike its predecessor, has fully 3D characters running around on the prerendered backdrops, which is certainly a change but not necessarily a marked improvement. In fact, the 3D characters seem to have lost a bit of sharpness since the last game, though they certainly don't look bad. If there's an issue with the visuals, it's that they look flat. The backgrounds are rather static, and the lighting tends to be pretty drab, so if you've gotten used to the rich and colorful 3D graphics of today's cutting-edge PC games, then Beyond Divinity's modest good looks won't impress you. Beyond Divinity is well suited for hardcore fans of role-playing games, including fans of the previous game. The game's audio ultimately deserves a lot of credit, though one way to describe it is that it's inconsistent. There's a lot of voice-over to go with the dialogue, but the voice-acting performances are spotty and often quite silly. Were it not for the fairly lighthearted dialogue, the effects of this would have been disastrous, but in the end, the goofy voice acting fits well with the often equally goofy conversations. Sound effects are all quite good, though in many cases they are lifted directly from the previous game. Much like in Divine Divinity, the music here is what steals the show as far as audio is concerned. A wide selection of moody, moving classical-styled tunes, often laced with choir vocals, do much to set the fantasy role-playing mood. Some other, more ambient tracks are good for suspense, though on some occasions the music is cut off, which is unfortunate since you'll want to keep listening to it. Then again, you'll have plenty of time to listen to the music during this game's lengthy journey. Beyond Divinity, like its predecessor, is a sprawling adventure that gives you the freedom to play as you wish. It's actually somewhat more focused than the first game, and it gives you clear-cut objectives that you're free to accomplish using your own devices. The game's core elements--the combat, the questing, and the exploration--are all effectively implemented, and the two-character dynamic and open-ended skill system introduced in Beyond Divinity should be enough to make the action seem just different enough to those who have already poured dozens of hours into the first game. This is a good, solid choice either for fans of Larian's last game or for anyone up for a deep computer role-playing experience, especially given the small drought the genre has experienced in these past few months."}