{"ref": "https://www.gamespot.com/reviews/spectrobes-origins-review/1900-6216556/", "date": "August 31, 2009", "game_name": "Spectrobes: Origins", "text": "Spectrobes: Origins is an action role-playing game that pits you and your team of powerful spectrobes against a dark force that devours whole galaxies. It marks the first time that the series has made the leap from handheld to console and features a healthy variety of spectrobes and a promising battle system, but its core mechanics never mature enough to create a truly gripping adventure. It's also quite repetitive and beset by numerous annoying faults that make this a charming but unrefined button masher. Pummel vicious krawl monsters with the help of your powerful spectrobes. The plot is unexciting and predictable with flat characters and obvious twists, but it provides a sufficient backdrop that is nicely accentuated by spectrobes: creatures that fight alongside human masters. You're cast as Rallen and Jeena who are spectrobe masters. They are also members of the Nanairo Planetary Patrol, which is an organization dedicated to the eradication of vicious krawl monsters roaming the universe. After being sucked through a portal to the planet Wyterra, you must save the world from the krawl. Similar to other monster-battling games, you'll lead a team of spectrobe creatures that span various elemental properties and types, such as fire and flying, to best foes and access new areas. Spectrobes awakened from fossils begin in child form and are easily managed via a virtual incubator room, where you feed them items you've collected to increase their health or experience. You can also evolve them to combat-ready adult form or train them via attack dummies, but otherwise, your interaction is fairly limited. Once on the field, child spectrobes are handy for unlocking doors and fetching items, and they're especially useful for solving puzzles as you explore open environments and robust temple ruins. These brainteasers are easy for the most party, but they're specifically tailored to each temple, so they at least keep the exploration vaguely interesting. The real-time battle system is fast-paced and, at times, it's also fun. Combat actively incorporates the motion technology of the controllers in a refreshing twist where a simple swing of the remote commands your adult spectrobe to attack, while a tilt of the nunchuk dodges with your character. Spectrobes also employ devastating special attacks you initiate by holding the remote and nunchuk in a set pose, which is mildly entertaining. You can also perform basic combos by attacking the same monster with both a spectrobe and your character. Elemental attributes provide some depth by encouraging you to capitalize on a krawl's weakness, such as a plant-type krawl's susceptibility to fire. Weapon variety continues this theme and boasts several weapon types for your character--such as swords and axes that have elemental attributes--but these features are undermined by easy foes and dull button mashing. You'll also encounter some targeting difficulty when backed into corners or crowded because the camera swings and bounces the reticle, which reduces most boss battles to annoying tests of luck rather than skill. Spectrobe AI also irritates because the creatures will occasionally get caught on environmental objects or stand there as you're being thrashed, forcing you to reissue attack commands. The tedious gameplay is worsened by the fact that you have to engage in excessive experience grinding. This additional leveling is needed to keep your full adult spectrobe team competitive with the krawl, who make significant level leaps, and because of the general difficulty in designing a well-balanced team that spans elemental types. Exacerbating this problem is a complete lack of spectrobe skill customization, because there's no way to tailor creatures to suit your play style or strategy. There's also little reward for leveling your spectrobes past a certain point, which makes grinding for experience even more of a chore later on. Excavate spectrobe fossils with a variety of tools in a cute but simplistic minigame. A few minigames offer some fun, even though they're limited in scope. For example, one in which you excavate fossils determines the level of your spectrobes based on how carefully and quickly you free them from ancient rock. You can also resurrect spectrobes in a simplistic minigame by swinging the remote to mimic a brief musical tune. Spectrobes: Origins also boasts a two-player cooperative feature, which lets you instantly switch a friend into or out of the action. Your partner is limited to controlling your spectrobes instead of his or her own team, which works, but is a little disappointing. You'll also encounter additional camera oddities during co-op, because the camera closely follows your character but frequently obscures or abandons your partner. The game's brightly colored and open areas are visually appealing and feature sun-scorching deserts and crystal-clear flowing streams. However, jagged edges appear on the otherwise smoothly detailed environmental objects and character models. There's a healthy variety of spectrobes, and child spectrobes are adorably designed and modeled after animals, though some--including flying onions and pink bunny slippers--are a bit zanier. Adult spectrobe design is sufficiently intimidating, and they are all accompanied by flamboyant attack effects, though those occasionally cause slowdown. The musical backdrop is quite soothing and subtle and appropriately matches exploration locales and soft ambient noises, such as rushing water, but it is slightly marred by a cheesy rock battle theme and grating attack cries. You can complete the main story in around 25 hours, and this includes a fair amount of time spent leveling various spectrobes in your quest to design the ultimate team. The game does make use of some minor backtracking and sports very few side quests, though there are several unlockable bonus missions and a new side story rewarded upon completion. Spectrobes: Origins has a decent, if extremely primitive, foundation with fast-paced combat, two-player co-op, and a cute excavating minigame, but it fails to evolve into a more compelling and sophisticated monster battler."}