{"ref": "https://www.gamespot.com/reviews/dead-to-rights-retribution-review/1900-6260606/", "date": "April 29, 2010", "game_name": "Dead to Rights: Retribution", "text": "When you're a cop in the gang-infested metropolis of Grant City, you need to know a thing or two about violence. And when you start to unravel a conspiracy that exponentially increases the number of people that want to kill you, you'd better be ready to get your hands bloody. Enter Jack Slate, a burly, bullet-resistant cop who has no problem punching, kicking, and shooting his way through legions of bad guys in the name of justice. Jack's brutal move set is varied yet uncomplicated, making it fairly easy to dish out pain in a number of enjoyable and satisfying ways. His canine companion, Shadow, is more than happy to lend his teeth and claws to the cause, and playing as Shadow affords you a first row seat for some of the most ruthless maulings this side of Cujo. Yet the combat is not without its problems; animation issues and other limitations take some of the shine off, and the murky visuals give the game a rough feel. Thankfully, these drawbacks don't ruin the fun, and even the cliche storyline has some powerful moments. Dead to Rights: Retribution may not be pretty, but there's enough brutal, vigorous action to entertain anyone willing to get their hands dirty. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Dead to Rights: Retribution Video Review The seedy story of crime, corruption, and a cop who plays by his own rules is unabashedly cliche. Though it feels very familiar, the plot is backed up by solid writing and some good voice acting, which help it live up to its not-so-lofty ambitions. Jack's snarling attitude comes across well through his dialogue, but the lip-synching is lackluster across the board, and many of the faces you see look waxy. While the game may not be pretty and the plot may elicit a few unintended chuckles, there are some impressive moments here and there. There is also a consistent sense of energy and dedication to the narrative that keeps things moving along nicely. To progress through the story, you're going to become very familiar with Jack's martial repertoire. Simple light and heavy strikes combine into brutal combos, while blocks and counters help you deal with Jack's quick-fisted foes. Get close to an enemy and you can clinch up, a move that can result in repeated strikes, a throw, or even a hostage situation. Grabbing an enemy and using him as a moving shield can come in very handy, and kicking him over a nearby ledge when you're through is immensely satisfying. In addition to knocking an enemy out or throwing him to his doom, you can beat him to within an inch of his life and perform a brutal slow-motion takedown. Savage kicks and snapped necks are just some of the finishers in your arsenal, and Jack's feral grimace lets you know that you're not the only one enjoying the carnage. All of these hand-to-hand strikes and maneuvers are easy to perform, and the great variety means you always have plenty of ways to beat somebody down. While close-quarters combat is definitely enjoyable, it's also where many of Dead to Rights: Retribution's flaws make themselves apparent. Jack is often swarmed by multiple enemies. The game tries to keep up with hit detection, and you will chuckle as you see enemies absorb bullets or fists that were meant for Jack. But you'll also see strikes that should hit but actually miss, and vice versa. Clinches can be finicky, and takedown animations are often plagued by environmental clipping and strange disconnects. These animations can also begin to feel repetitive after a while, though they never really lose their brutal appeal. Jack's pugilistic powers defy reality, so it seems perversely fitting that they sometimes defy video game physics. Still, while these issues occur often enough to hamper your immersion, they won't stop you from having a good time. Here we see Shadow muzzle-deep in a man's neck. Good boy. Even though Jack's body armor is remarkably effective, he will still succumb to gunfire if you run around trying to melee kill everyone, so it's best to pick up a gun. You can occasionally find them lying around or in crates, but the most fun way to strap up is to disarm an opponent. If you tap a button when the prompt appears, you will proceed to wrench the gun free from your enemy and slowly target his head. All headshots register with a splash of blood and a spurt of slow motion, and this stylish little reward is even more enjoyable when you are shooting from the hip or blind-firing from behind cover. Disarms, headshots, takedowns (yes, you can do them with guns too), and other slick moves fill up a meter that allows you to enter Focus mode (read: bullet time). This mode slows down time while cranking up your power and damage resistance, making it a great way to get out of a tight spot or just to put an exclamation point on a particular kill. You do run into some tough situations from time to time, and though it is occasionally uneven, Dead to Rights: Retribution moves along at a good pace with a solid difficulty curve that provides a decent challenge throughout. There are some mounted-gun and hostage-rescue sequences that spice up the action nicely, but the real variety comes when you get to play as Shadow, Jack's beastly dog. Normally, Shadow accompanies Jack and you can issue simple commands like ~maul that guy,~ ~come over here,~ or ~fetch me some ammo.~ Shadow is pretty good at keeping up, and though he does sometimes get stuck on obstacles or lose his way, he invariably catches up or warps ahead to join you, so you usually aren't alone. Sic Shadow on a weak enemy (or one that you've softened up) and you'll get to see his teeth in action. But for in-your-face brutality, nothing compares to controlling Shadow yourself while he tears out a man's jugular vein or savages his groin. Despite his beastly power, Shadow does not share his master's Kevlar outfit, so you have to be stealthy. Crouching low while moving enables you to see enemy heartbeats through walls, and if you can't get the drop on your foes, you can bark to lure them to you. Shadow can also sprint through enemies to knock them down, which is pretty darn fun, but it's good that Shadow's sections aren't very frequent. His shocking kill animations get a bit repetitive and his missions are very straightforward. Playing as a murderous canine is novel and enjoyable, but you'll be glad to get back to Jack's broader repertoire. The headshot that follows a successful disarm is particularly satisfying. Your campaign of violence takes you through alleys, warehouses, docks, and industrial yards, most of which are gloomy and gritty. There are some nice details, including fake ads and movie posters alongside actual ads and movie posters. The dark face of Freddy Krueger in the posters for A Nightmare on Elm Street blends in fairly well with the grimy Grant City aesthetic, but the stark white rectangles with the publisher's logo (NAMCO) emblazoned across them stick out like so many sore thumbs. These distractions don't last long, fortunately, because soon enough, someone will be shooting at you or trying to punch your head. Despite the animation problems and other sundry issues, Dead to Rights: Retribution's combat is diverse and satisfying. Jack's move set gives you a great array of ways to inflict punishment, and having Shadow along for the trip is the gory icing on the cake. This vengeful quest through a crime-ridden city may not be pretty, but it's vigorously brutal and fun to boot."}