{"ref": "https://www.gamespot.com/reviews/sound-shapes-review/1900-6415535/", "date": "November 13, 2013", "game_name": "Sound Shapes", "text": "The flames are maracas. Listen to their rhythmic shakes, but don't dwell for too long; the composition is just getting started. Roll toward the notes that lie flush against the nearby buildings. One, two, and then three drum beats layer on top, and your foot starts to tap. Missiles provide bass, pounding out a catchy riff as they fly across the screen, while the smokestack twangs a guitar melody. As the world awakens, the music begins to swell. Cities is a song that has stayed with me for more than a year, and whenever I revisit it, I'm transported once more by the infectious rhythm. The beat is so enthralling that I sit idly on rooftops, just letting it soak in. But it's the lyrics that cement this as one of my favorite stages. A platform hovers in the sky, flashing words such as ~move,~ ~twist,~ ~hurt,~ and ~lose~ while Beck belts out the accompanying lyrics. I could listen to this for hours.I often feel hesitant to revisit a beloved game. How could reality possibly live up to the memories I have constructed? And yet, returning to Sound Shapes so long after reviewing it for the PlayStation 3 and Vita was like curling up in my cozy bed, free from the worries that dominate my waking hours. There's a cohesion to this experience that's uncommon in games. The music is everywhere. Trees chime, saw blades tick, and janitors sigh. Such sounds aren't music on their own, merely a backdrop beat, and it reminds me of how melodic life can be. Listen to the white noise of distant conversations while sitting in a park; hear the birds chirping overhead while the waves from a nearby lake roll in. It's the music of life--the rhythm that provides the foundation of every moment--that's always around if your ears are open. Sound Shapes harnesses this energy, and the results are magnificent.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Sound Shapes PS4 Video ReviewWorlds are alive. They breathe like sentient organisms, ignoring your existence as they let time carry on. But you're not just a bystander. As an amorphous blob, your abstraction allows you to blend into any environment. From the brisk outdoors to a bustling office and a bursting volcano, the environments feel like home to your nondescript character no matter how strange they become. And there are notes to collect, a way for you to contribute to the building score. So you roll along the ground, up walls and across ceilings, listening to the environment sing as you add instruments of your own. A piano is slowly added to the mix, along with a drum beat that wouldn't be out of place in a dance hall. In another land, a harp adds an ethereal quality that conjures images of angels smiling from above. The notes are all optional. You could skip them all if you merely want to reach the end. But why would you hinder your enjoyment? Every note further enriches the soundtrack, and it's a reward in itself to hear the songs evolve as you venture forth.Listen to the white noise of distant conversations while sitting in a park; hear the birds chirping overhead while the waves from a nearby pond roll in. Music is everywhere--everything--but the beauty of Sound Shapes goes beyond the auditory pleasures. You scout the two-dimensional environments for notes, not only because you want to add color to the songs, but because there is joy in movement. Your blob sticks to some surfaces, is repelled by others, and dies from anything that glows red. And as you learn your limitations, you appreciate how intricately designed the levels are. Maybe you ride across the treacherous pit on the tail of a missile, dropping onto an alien creature before you meet your end on a spiky trap. When you venture through D-Cade--an album whose music was created by Deadmau5--you dodge lasers being shot from the eyes of robots, moving quickly and precisely to clear each room before you vanish in a puff of smoke. By ensuring the action is every bit as fascinating as the music, Sound Shapes reaches you on both an emotional and a physical level. All of your senses tingle as you discover what lies ahead.When I first reviewed Sound Shapes in August of 2012, I evaluated the creation tools based on how accessible and robust they were. Laying down tracks and shaping environments is so easy that even I, an admittedly unimaginative designer, could craft something that at least approached competency. But I could only guess at how a talented community would handle those tools. Revisiting Sound Shapes gave me a chance to see how the user-created library has grown, and it has cemented this game as something truly exceptional.The core levels of Sound Shapes use a combination of music and difficulty to steer emotions. My sense of discovery was piqued in Corporeal as I chased cats to trigger platforms while viewing the corporate world through an abstract lens. Beyonder removes the shackles of gravity by placing me in a spacecraft, whereas D-Cade's amped-up challenge makes my heart race. The wide spectrum that the albums encompass is riveting, so much so that I have played through these tracks a half-dozen times just to feel those emotions again. But it's in the user-made levels that I now understand how much can be communicated through these simple tools.Melancholia stands out from other stages in the greatest hits library of user-created stages. A crying child serves as the thumbnail, and there's a puddle of blood near his feet. The first section is ominous, making my breath catch in my throat. Half of the screen is filled with a red, pulsing gravestone. Etched on the face of it are the words ~In Memory of My Beloved Son, Tom, 2009-2012~ and ~My Dear Wife, Liz, 1980-2012.~ Tombs dot the rest of your view, with white crosses marking each burial plot. Tom passed away when he was only 3 years old, and Liz was only a year older than me. How utterly heartbreaking. As you move onward, you learn the horrible events that have defined the last year for user jool2306: a lonely hospital room, a woman perched on a rooftop, and the depressing thoughts that must swirl in the mind of anyone who has suffered such losses. Was it possible that Sound Shapes provided an outlet for a grieving father and husband?Revisiting Sound Shapes gave me a chance to see how the user-created library has grown, and it has cemented this game as something truly exceptional.Community-made levels encompass a vast array of emotions, and many stand proud next to the developer levels. In A Walk in the Park, I rolled past snapshots of the quiet moments that I too often take for granted. A mother duck and her duckling ignore those around them as the mother passes on the secrets to survival to her hungry kin. In another scene, someone happily flies a kite, content to be alone in nature doing an activity that he loves. A couple walks hand in hand, off the beaten path into the trees where serenity thrives. In another level, Bastion, two robots wait for you to move, and they fire crisscrossing lasers if you try to sneak by them. These are just three of many incredible stages I discovered, and the range of emotions they deliver and the quality of the construction were impressive. So many games have amazing creation tools that are interesting to use but rarely result in anything worthwhile to play, but in Sound Shapes, you experience excitement or grief or any other of a wide range of emotions that makes you eager to see what else is out there.Sound Shapes is a remarkable convergence of music and platforming. Because I've played through the main albums so many times, the levels didn't hit me as powerfully as they once did. But the community levels hammered home just how singular and enthralling this game is. There is so much personality infused in these stages that I felt as if I understood the people who designed them, at least a little. And that's what great tools, and a great community, can do. Sound Shapes is a transcendent experience in so many ways. Maybe its most important contribution is giving a voice to the world through music and action."}