{"ref": "https://www.gamespot.com/reviews/mutant-storm-reloaded-review/1900-6140405/", "date": "November 23, 2005", "game_name": "Mutant Storm Reloaded", "text": "It has been on shelves (or flying off of them) for only a couple of days now, but already the Xbox 360 has cemented its status as the console of choice for fans of dual-joystick arcade-style action. Xbox Live Arcade is a digital distribution point that publishers--some major and some independent--are able to use to put out small, inexpensive games. So far, the lineup contains two games that pray at the altar of Robotron: 2084, a 1982 arcade game from Midway that put you in the shoes of a little guy that materialized in levels surrounded by angry robots. Like that game, Mutant Storm Reloaded uses one joystick for moving around the screen and the other for firing in any direction. It's not the most immediately compelling arcade-style shooter in the world, but this top-down shooter has enough additional difficulty settings to make it entertaining, especially if you're into online score tracking. Bust the beasties with your superior firepower, but make sure you don't get surrounded. Mutant Storm Reloaded is broken up into 89 different rooms. Each level places your tiny ship inside one of the rooms and then proceeds to spawn a large gang of enemies for you to shoot at. The enemies warp into the room in different spots, forcing you to move around and take care of each threat as it appears. A lot of different enemies pop up along the way, starting with little, easy-to-kill mutants, but you'll eventually see large, tentacled creatures plop their way onto the playfield as well as turrets that regenerate themselves until you can slip around them and blow up a generator. The action never gets too complex. Really, the only strategy beyond ~shoot everything that moves, focusing first on the things that can shoot back~ is that you can pull the right trigger to set off a quick bomb that clears the immediate vicinity when the action gets too hectic. In addition to the basic action of shooting things as soon as they appear, you have a bonus timer to think about, which gives you an incentive to clear each room as quickly as possible. You also build up a multiplier bar as you play, which is another way to build your score, but the bar loses a multiplier every time you die. Also, the game has a scaling difficulty to it that works by raising you through martial-arts-style belts as you do better. Once you've earned a belt, you can start subsequent games at that difficulty setting. All of these considerations make the game more than just a Robotron clone. You can play the game in two modes. Adventure mode takes you through all 89 rooms with a set number of lives. Your overall score is tracked. Tally mode stops after each level. Your best score for each level is combined with the others to form your tally mode score. You can play the game with a second player as well, but only locally, not over Xbox Live. Xbox Live is used for scoreboards for both game types, though, giving you a goal to strive for. The game's achievements list also provides some replay value, as beating all 89 rooms in one sitting on the game's most difficult black belt level is a pretty severe challenge. Graphically, the game has a psychedelic look to it, complete with frequent color cycling. The game runs at a constantly smooth frame rate, which isn't too much of a surprise, because the game's enemies are all rendered in a deliberately blocky style that looks pretty good overall. When you're running in HD, the game has a sharper, more-defined look to it. Mutant Storm's music is functional and fits the theme of the action, but it probably isn't something that will stand out in your mind after the fact. The sound effects are quite good, with loud, thumpy sounds for the different weapons and various explosions. While the shooting action of Mutant Storm Reloaded is certainly appealing, it isn't the only game in town. Currently, it's listed nose to nose on the Xbox 360's Live Arcade menus with the other Robotron-like launch game, Geometry Wars: Retro Evolved. Considering that Geometry Wars is currently available for half price and offers a much more frantic experience, Mutant Storm Reloaded is a little tough to recommend wholeheartedly, but if you're after an action-filled shooter, Mutant Storm is definitely worth looking at."}