{"ref": "https://www.gamespot.com/reviews/touch-detective-2-1-2-review/1900-6181572/", "date": "March 8, 2008", "game_name": "Touch Detective 2 1/2", "text": "Less than a year has passed since the release of the first Touch Detective. In that time, the dearth of good point-and-click adventure games hasn't exactly improved, which is a shame because that genre seems so well suited to the DS. Touch Detective 2 1/2, whose name is clearly inspired by the Naked Gun series of spy spoof films, has arrived to attempt to fill this void, but unfortunately, it doesn't do a very good job. Suffering from the same frustratingly incoherent puzzle design as its predecessor, it also manages to reuse a great deal of artwork and music, making it seem much more like Touch Detective 1 1/2 than a true sequel. Fans of the first game will be pleased to know that virtually every character makes a return. Mackenzie is a young detective with an obsessive-compulsive disorder that requires she touch everything and record her reactions in a journal. She also specializes in investigating generally straightforward cases in entirely incomprehensible ways. Her friends Chloe and Penelope always seem to be involved, for better or worse, as does her creepy manservant-slash-parental authority-slash-personal MacGyver Cromwell. Together, they fight crime and have adventures! Unlike their original outing, the five cases in Touch Detective 2 1/2 bear some resemblance of continuity and are connected by the poorly named Cornstalker, your self-proclaimed nemesis. He is apparently on a mission to steal all of the local treasures but not without politely sending you a notice of intent beforehand. Helping out--or more often not--is Inspector Daria, a bumbling police officer who has dedicated her career to capturing the dastardly thief. Unfortunately, the combination of her penchant for stylized poses and severe back problems tends to land her on the bench. Thus, the Cornstalker's deus ex machina abilities to appear as anyone and disappear at will don't make things any easier for her. Once again, Mackenzie's inner thoughts are portrayed on the top screen and the action unfolds below. To solve her cases, Mackenzie must wander around the town's various locations to investigate them for clues or question possible witnesses and suspects. She begins with three familiar settings to search: her detective agency, the shopping plaza, and the condominium, but throughout the course of the game, she will unlock four new locations. Once more, the stylus is your primary instrument of inquiry because you will touch it to the screen to examine specific objects, manipulate the items in your inventory, and control Mackenzie. Your cases will range from the theft of the entire town's supply of colored noodles to the disappearance of a silver homunculus' voice. Each one of these cases is chock-full of wonderfully insane dialogue and non sequiturs. The problem, which was coincidentally one of the biggest issues the original game suffered from, is that the solutions to the puzzles themselves are also highly antilogical and counterintuitive. For example, one minicase you are presented with by Cromwell is to procure a hotcake for him, which you must create by microwaving a slice of shortcake. Even if you are comfortable with ~thinking outside the box~ and occasionally folding said box into a hat that you wear on your feet, prepare to be frustrated to the point of rage by some of the more obscure puzzles, which somehow manage to cease making sense even in the context of Touch Detective's nonsensical world. To further complicate things, Touch Detective is an entirely linear game. While this is a problem systemic of the adventure game genre itself, when combined with the completely bizarre puzzles and their equally peculiar solutions, it creates a nearly unforgivably ridiculous game experience. Often, something as simple as selecting a specific dialogue choice or examining a 10-pixel-squared object is all that's needed to trigger the next story-progressing event in an entirely different location. This leads to occasions where you will go around to every available location tapping on everyone and everything sometimes multiple times before you figure out that you were actually supposed to build a crown out of a flower patch to give to the vertically challenged food vendor. While the expanded list of locations provides a nice degree of variety to test your sleuthing skills, it actually compounds this problem by casting a progressively larger net in which you must search for clues as the game progresses. Furthermore, each of Mackenzie's five cases is of varying difficulty that essentially depends entirely on your luck. Your sidekick Funghi sometimes helps out by alerting you when important clues are nearby, but he only seems to do this a couple of times. Ultimately, the best parts of the game occur when you are actually confined to a relatively small location because they tend to focus more on actual detective skills and legitimate clue-hunting techniques rather than random chance. Interrogating the eclectic cast is something that will surely take up a great deal of your time. If there's one area where Touch Detective stands out, it's in the characteristic art direction that seems to borrow one part from anime and two parts from Tim Burton's The Nightmare Before Christmas. Every character is stylistically rendered in a way that's simultaneously cutely endearing but also disturbingly creepy, with thick black outlines, pale palettes, and dead eyes. The ~normal~ main characters are joined by a cast of truly abnormal skeletal townsfolk (their mouths locked in what appears to be a perpetually silent scream), a shark-man, a duck-woman, aliens...the list goes on. These characters are all lively, animated, highly detailed, and as mad as a March hare, serving as the one-stop location of the game's charm, as well as the story's impetus. Overall, fans of the original game will be pleased to discover more of the same quirky gameplay and will not be disappointed by how closely Touch Detective 2 1/2 sticks to its guns. The witty dialogue and fantastic art style go a long way toward making it an enjoyable experience. However, the entirely linear story and insanely esoteric puzzle design takes out most of the fun. These reduce it to a mindless pixel hunt with little-to-no replay value and make it an ordeal best left to diehard fans or adventure game aficionados."}