{"ref": "https://www.gamespot.com/reviews/unreal-tournament-review/1900-2531737/", "date": "November 9, 2000", "game_name": "Unreal Tournament (1999)", "text": "When Unreal was released back in May of 1998, it turned a lot of heads. But while the game delivered the most immersive and interesting single-player shooter for its time, the multiplayer game was very weak in comparison. The weapons never really seemed to pack a punch. The deathmatch maps were hit and miss. The performance of Internet games took months of patching before it was acceptable, but by the time that happened, most people had already moved on to bigger and better games. In contrast, Unreal Tournament goes in a new direction for the first-person shooter genre by stripping away anything that resembles a single-player adventure mode, and instead, it strictly focuses on the more popular multiplayer aspects of the genre.Rather than spend development time working on a cohesive single-player scenario that most players will only play through once or twice, Epic Games used that same time to refine the multiplayer game. Consequently, the only single-player mode available serves as training for multiplayer matches by pitting you against computer-controlled bots. The bots have good, adjustable artificial-intelligence settings, which let you tailor the game's difficulty to your own personal skill level. On the lowest setting, anyone should be able to defeat the bots with little or no hassle, but once you bump up the difficulty, you'll have an actual challenge on your hands.The single-player mode will also teach you the basics about each different type of game contained in Unreal Tournament. Of course, deathmatch is the old standard free-for-all battle. Capture the flag, the quintessential first-person-shooter team game, is also included. Domination is a different type of team game. Each Domination level has three control points; when you touch a control point, you claim it for your team. The longer you hold a control point, the more points your team scores. So you duke it out to see who can hold the control points the longest. Assault is yet another new team game in which one team plays offense, and the other defends a base. Each map has a different set of offensive objectives (push the button at the front of the train, destroy four computers, and so forth). If the offensive team completes its mission, the two teams switch sides, and the new offensive team must complete the same objectives in the same amount of time it took the first team to succeed.The selection of weapons in Unreal Tournament is mostly taken from Unreal, but the weapons have all been redesigned to look and sound much better. The new weapons include the impact hammer, which is more or less a portable pneumatic piston that you can use as a last resort when the rest of your weapons are empty. The pulse gun fires small energy shots in its primary mode, but the secondary fire spits out a rail of energy that you can sweep around, like Quake's lightning gun. The redeemer is essentially a portable nuclear missile; the primary fire mode shoots it in a straight line, but the secondary mode switches to a really great-looking guided-missile view that lets you target foes from across the level. The nice thing about the game's weapons is that they seem really well balanced. There isn't a single weapon that causes you to run away in fear when you see it in your opponent's hands. The weapons may seem a little alien to players used to other first-person shooters, but once you get a feel for how each weapon operates, using them becomes second nature.As good as the original Unreal looked, Unreal Tournament looks even better. The character models and skins look excellent, and there are quite a few choices to make when designing your character. First, you'll choose a model, then a skin, and then you'll have a choice of which face to put on the model. The textures throughout the game look great, and the levels that have backgrounds look especially amazing. HyperBlast, the final level in the single-player game, is a good example: It takes place on a speeding starship. Stop to look out a window and you'll see stars zooming by. Hop out of the ship and run around on its roof and you'll be able to see other nearby ships keeping pace with you as you fly through space. Unreal Tournament has consistently ambitious level design throughout, and the entire game benefits from it. The levels feel less like simple first-person shooter maps and more like actual locations, such as starships, old mining facilities, and temples. The game's music lends some atmosphere to the proceedings, but it never overshadows the crucial sound effects you'll need to hear to keep tabs on what items your opponents are picking up.The first-person shooter genre is fiercely competitive. But Unreal Tournament rises above the rest with its solid multiplayer performance, from its good weapon balance to its great level design. The numerous game types and mini-mods that ship with the game give you plenty of options right out of the box, and the large variety of great maps ensure a fast-paced and exciting game, no matter how many players you've got. Even considering its lack of a solid single-player adventure, Unreal Tournament is the most complete first-person shooter available."}