{"ref": "https://www.gamespot.com/reviews/dragon-ball-z-sagas-review/1900-6121807/", "date": "April 6, 2005", "game_name": "Dragon Ball Z: Sagas", "text": "And things seemed to be going so well for Goku. Last year's Dragon Ball Z: Budokai 3 for the PlayStation 2 seemed like it could be the herald of a new era for games bearing the Dragon Ball Z license. No longer would the license carry the weight for shoddy gameplay and slapdash presentation! In fact, the games would be good enough that you wouldn't even have to like Dragon Ball Z to enjoy the games. But alas, Atari has quickly turned around and churned out Dragon Ball Z: Sagas, a short, ugly, slightly buggy, and brain-dead beat-'em-up that all but nullifies the good work of the Budokai games. Sagas has the look and feel of a quick cash-in. Hopefully, those same fans are ready for yet another rendition of the same Dragon Ball Z stories, starting with Raditz and ending with the Cell Games. These stories have been done to death, but this particular retelling is especially limp, relying on 30-second montages cut together from the DBZ cartoon to relay a whole season's worth of story. The last episode of Dragon Ball Z was aired in Japan almost a decade ago, and even most American Dragon Ball fans have moved on to Dragon Ball GT. It's time that Atari did the same. The game couches the story in a series of arrow-straight beat-'em-up levels populated with enemies that even the game itself cannot avoid referring to as mindless. It's really a blessing in disguise that their patterns are so predictable, since your own attacks are pretty limited. You start off with basic punch, kick, and energy attacks, though you can eventually earn more combos and abilities by picking up coins found throughout the game. But, even once you've purchased all of the additional abilities, the gameplay still just feels sloppy and unresponsive, with bad collision detection and animation that regularly forces you to wait several seconds while a futile piece of animation plays out before you can continue fighting. Even the energy wave attack, which is a Dragon Ball Z signature that brings a sense of incredible power to the fights, feels hollow here. You'll spend the lion's share of your time fighting saibamen, faceless Ginyu thugs, low-rent androids, and other fairly generic enemies before squaring off against characters you might actually recognize, like Vegeta, members of the Ginyu Force, and the Androids. These boss fights are definitely more challenging than the bulk of the game. However, simplistic movement and attack patterns and overly large life bars turn these fights into lengthy, joyless grinds. It's not a matter of if you'll beat the boss, but rather how long you'll have to suffer through the same basic tactics over and over again. Like any classic beat-'em-up worth its salt, Dragon Ball Z: Sagas includes a co-op mode for two players, which is a nice gesture, but one that is completely undercut by the fact that the game itself simply isn't any fun. That the gameplay isn't very engaging actually makes the fact that you can finish the game in just a few hours somewhat of a blessing in disguise. To its credit, Sagas does a pretty serviceable job of creating environments and enemies that are evocative of the series. But that's as much praise as can be given here. Make no mistake--this is not an attractive-looking game. The levels are small, the character models are simple and rather bland, and the animation is jerky and repetitive. And, even though the graphics are fairly modest in design, the frame rate is completely erratic. The icing on it all is an automated camera that does a poor job of framing the action, and it almost seems intent on obscuring as much as it possibly can. Any differences between the PlayStation 2, Xbox, and GameCube versions of Dragon Ball Z are purely superficial, with the Xbox version simply looking a little bit cleaner. It seems like no enthusiasm went into Sagas, and it's unlikely much will come out. Though the sound design is technically fitting for a Dragon Ball Z game, complete with boastful voice clips and squealing rock guitars, like the rest of the game, there's no excitement behind any of it. The voice acting, while being provided by the American voice cast for the DBZ cartoon, is so unenthusiastic that it sounds like the work of novice understudies. The music, which will fade in and out with the action, also feels flat, and consistently fails to heighten the drama. If Dragon Ball Z: Sagas weren't so patently ill-conceived, it would probably stand as another piece of evidence that you just can't do beat-'em-ups in this day and age. But it doesn't seem that quality or relevance were high priorities during the game's production, and the fact that it's being sold at full price only makes Sagas that much easier to pass up. Hardcore fans might be able to rationalize the purchase, but they'll still be out $50."}