{"ref": "https://www.gamespot.com/reviews/classic-nes-series-bomberman-review/1900-6100198/", "date": "June 8, 2004", "game_name": "Bomberman", "text": "These days, Bomberman is everywhere. The chubby little boom fiend is most famous for starring in a string of pretty amazing five-player multiplayer games for the TurboGrafx-16 back in the early 90s. But Bomberman's origins are actually on the NES, where he appeared back in 1987. Now, that original NES game has been rereleased as part of the Classic NES Series, which repackages old NES games for the Game Boy Advance. However, a Bomberman game without multiplayer is hardly a Bomberman game at all. So while this may be a nearly perfect port of the original NES game, that game really wasn't very good to begin with. Bomberman didn't cement his spot in the hall of fame until he came to the TurboGrafx-16. Bomberman for the NES is essentially identical to the single-player component found in Bomberman games for the first decade or so of his existence. You're dropped into an arena full of monsters, and you must destroy those monsters with bombs. You'll then have to bomb around the level, blowing up blocks that obscure your exit. You'll also uncover power-ups. This is before Bomberman started riding around on little anime dinosaurs and things like that, so your power-ups are limited to finding more bombs to drop, making your explosions longer, having remote detonation abilities, and running faster. Once you finish a level, you move onto the next (there are 50 levels in all). The enemies get faster and more devious as you go, but the game doesn't really go anywhere. In the original game, passwords were used to let you continue your game. However, those passwords were long and unwieldy. Thankfully, this rerelease has a save ability that lets you save your most recent password--this makes continuing the game significantly easier. Sure, it's a nearly perfect port of the NES original, but do you really want to pay $20 for an exact port of a pretty poor game? Graphically, Bomberman isn't really much to look at, but considering it was originally made in the 80s, that's hardly a surprise. Still, there were certainly better looking games coming out back in that segment of the 8-bit era, so the game doesn't really hold up very well. The sound side of things is decent enough, with satisfying explosion rumbles and passable NES-style music. If there were a classic TurboGrafx-16 series, Bomberman would be at the top of the list. But it's an odd choice for a collection of classic NES games. The Bomberman series didn't come into its own until it added its addictive multiplayer mode. So this single-player edition really falls flat today. The fact that you can get a few other Bomberman games for the Game Boy Advance that do contain multiplayer certainly doesn't help matters. Pass on this one unless you're the sort of person that feels the need to collect the entire series of rereleases."}