{"ref": "https://www.gamespot.com/reviews/evidence-the-last-ritual-review/1900-6161677/", "date": "November 14, 2006", "game_name": "Evidence: The Last Ritual", "text": "Serial killing is all the rage these days. You can't channel surf without landing on some Bill Curtis special on the BTK killer or a gruesome CSI episode referencing John Wayne Gacy. Not surprisingly, the Bundy bandwagon has gotten a little tiresome, so it's tough to get worked up about a serial-killer adventure game like Lexis Numerique's Evidence: The Last Ritual. But even though the plot about a stereotypically brilliant Hollywood-style mass murderer called the Phoenix isn't innovative, original gameplay moves the killer's machinations out of the traditional game format and into your head. Yet while the gameplay makes Evidence unique and captivating, at least in the early stages, it's also maddeningly impenetrable due to absolutely grueling puzzles. What would a serial-killer game be without a 'put the lotion in the basket' moment with a female victim? If you played last year's Missing: Since January, you'll already be familiar with the gimmick at work here. Rather than setting Evidence up as a traditional murder mystery adventure and placing you in the shoes of a world-weary detective or a grizzled cop, you play yourself. This illusion, which is nicely kicked off by distributing the game in a sealed plastic evidence bag, sees you working to find out what the Phoenix did to Jack Lorski, one of the vanished characters you had to find in Missing, and also determine what role the killer played in the disappearance of Adrian and his sister Jessica. The twin stories don't make a great deal of sense for much of the game, so the only way to untangle the Phoenix's twists and turns is by examining the ~game~ CDs that the taunting killer has sent to the FBI, which they have kindly forwarded on to you. It's all remarkably effective at raising goose bumps, if spectacularly mind boggling. Gameplay is split between action that takes place with the game running and components that take place in the real world, or at least the part of the real world connected to your Web browser and e-mail client. In the game, you examine logic puzzles that the Phoenix has put together while he taunts you with elliptical comments. Generally, there is some kind of abstract setup, like symbols flying around an open mouth, eyes blinking in a pattern, or even a map with a starred boulevard you have to locate via an online service like MapQuest (lots of luck with that one), and you have to figure out how to arrange items or figure out a code based on what you either see on the screen or can research on the Net. Most are inventive and feature bizarre backdrops that involve mashes of text, hacked-up photographs, and eerie, artistic doodles like something produced by a sociopathic William Blake. Plug the right information into a puzzle and it melts to blackness and you usually get rewarded with a video clip that the Phoenix either took from the video diaries of Jack or Jessica. Most of these clips are well acted to the point that they seem like movies taken on somebody's dull vacation to Europe or New York, but many also feature shocking moments like skulls drawn over the face of the Phoenix or bloody smears on the screen. Toss in sparse, creepy music that makes you look over your shoulder every now and then, and you've got a game guaranteed to send shivers up your spine. Well, that is when it's not making you feel like smashing your head into your monitor. Evidence features some of the most incredibly obscure puzzles ever included in an adventure game. Many, if not most, are so fantastically difficult that you can't solve them without looking up loads of hints online or referring to a Web walkthrough, and the clunky interface is so reliant on tiny video clips and whirling icons that it takes forever to figure out how to work the game mechanics, let alone figure out what to do with them. Help is available, however, as the game features an online component where you register with the International Committee for the Phoenix Arrest (ICPA) Web site. There you can check into tips about the killer's motives and influences, which seem to range from ancient Christian texts to medieval secret societies, and maybe even UFOs. In addition to this, the game regularly sends reams of advice (along with ~Where did you go?~ prompts if you stop playing for a few hours) from fictional investigators also working on the case to an e-mail address of your choice. Both of these elements add appreciable dimensions to sleuthing not normally seen in adventures. They can be effective, too, as there's certainly something engrossing about this fake serial-catching-team atmosphere and getting taunted by a killer who calls you his ~little friend.~ But turning the ambiguous hints in these e-mails and puzzles into actual leads is awfully tough. They often take you on a scavenger hunt around the Net and lead to dead-end Web sites that waste a lot of mental energy. The difficulty is so extreme that you spend far more time surfing the Web trying to round up clues than you do actually solving puzzles in the game itself. Unfortunately, this is about as clear as clues get in Evidence. Here's an example from early on. After wrapping your brain around a puzzle where you listen to sounds to sort disclike tears into a bowl, you are then shuffled off to a second part with numbers flying around the screen atop what looks to be Renaissance-era sketches. Your only clue here is the name Alessandro Mariano. A quick trip to Google reveals that Mariano is better known to history as Botticelli. And then you're stuck...unless you realize that previous clues about Dante Alighieri are connected here and add him to the search. Then, eventually, you might stumble upon a Web site filled with the famous numbered Botticelli illustrations from Dante's Divine Comedy, which of course match the pictures and numbers from the puzzle. So, nothing here is particularly easy. And this is far from the game's toughest challenge, which means that only Mensa members and astronauts will be solving puzzles here without resorting to the Net for help. Going to the Net so often quickly becomes a pain, too. It makes the game feel contrived and also lessens the gritty, realistic feel that Lexis Numerique was obviously going for, courtesy of the videos. It's also tough to stay the course and just look up clues, as every time you fire up Google you're tempted to end all of the Internet rummaging once and for all and head to a walkthrough or a forum where players are posting solutions. Yet even with its flaws, Evidence: The Last Ritual is a fascinating experiment in game design. Fans of murder mysteries or serial-killer potboilers who want to try something completely different should find a lot to like about this one, as long as they've got plenty of patience and lots of time to prowl the Net for clues. Also, all of the gameplay innovations found within, along with the chills that the Phoenix sends up your spine, make it a better bet than yet another CSI repeat."}