{"ref": "https://www.gamespot.com/reviews/mount-and-blade-review/1900-6198044/", "date": "September 22, 2008", "game_name": "Mount & Blade", "text": "If all you had to do was fight, Mount & Blade might have been a winner. TaleWorlds Entertainment has come up with one of the most innovative and user-friendly re-creations of combat ever seen in a first/third-person RPG, with exciting battles on foot, mounted on horseback, and at the head of a private army. Unfortunately, this derring-do is only one part of a cheaply stitched-together, single-player-only role-playing game that replaces plot with a sandbox world that leaves you without a clue of what to do or where to go. There is something positive to be said for wide-open RPGs that leave the storytelling up to you, but this game is so incomplete that it'll feel as if you're being asked to script a heroic saga without the benefit of pen and paper. A strong battle engine isn't enough to offset all of the problems with Mount & Blade's fit, finish, and near-total lack of RPG structure. At its center, Mount & Blade isnt so much a structured RPG as an exploration of being stranded in a medieval world. Even though the game gets underway with a detailed character creation process loaded with a D&D level of rigmarole regarding the stats, skills, and personality-establishing questions about your childhood last heard from your shrink, there is no shape to the game beyond that. You roll up as a hero, then head off adventuring in the realistic (meaning no magic or monsters) medieval land of Calradia. There is no story arc whatsoever, so the game begins without a strong sense of purpose to help get you immersed. This isn't to say that there isn't anything to do in Calradia. There is, but you have to do a great deal of wandering around to find it. Removing any sort of story hook from Mount & Blade makes it only appropriate for the hardcore role-playing gamer who plays RPGs just to explore a fantasy land, not to accomplish anything or become an epic-level druid or whatever. When the game starts you're plopped down on the back of a horse in the middle of a vast medieval realm dotted by towns, castles, and the odd river and mountain range. Traveling across this land is easily accomplished on a tactical map of sorts, where you click on the location you want to visit to gallop off toward it. There isn't any guidance provided as to which place you should visit first, so you're left cruising around on a piebald nag with no particular place to go. A lot of background details are present in the game, as Calradia is divided up between four kingdoms and a Middle Eastern-style khanate (a region under the jurisdiction of a khan), and every lord and king has a listing in an encyclopedia that you can bring up on demand. But these entries aren't entirely thorough, giving you only a brief rundown of the major players in the land. The backdrop is always busy with various wars, villages being looted, and castles being besieged, although you feel more like a hapless spectator than a wannabe hero with anything at stake during all of this conflict. You tend to have to research your possible destinations through bland text write-ups, or to search around in the documentation in the menus to find out why the king of Swadia is attacking the khanate of Kergit. Even then, you generally don't receive a lot of solid answers. You could walk out of your house and trip over a more attractive game than Mount & Blade. Interaction with Calradia is seriously lacking. Quests are available in towns and castles, although their number and location is spotty. Villagers only respond to a canned set of questions about local rumors and what sort of goods are produced locally. Answers are generic listings of local features, so it feels more like you're consulting a travel guidebook for Calradia than actually speaking to a human being. You talk to one peasant, you've pretty much talked to them all. Many times, too, you'll ride over to a nearby village and discover that the locals don't need any assistance. You can easily run into this ~Thanks, but no thanks~ response in three or four towns in succession, particularly at the start of the game when you're trotting around trying to get the lay of the land. Needless to say, this doesn't exactly whet your appetite to see what else this sandbox world has to offer. What quests are on hand are generally boring. A town elder may ask you to train a few residents so that they can better fight off bandits, or run across the land in search of a certain amount of wheat or butter. A guild merchant may want you to run a cattle drive. Castle lords and kings are also undemanding. In the early stages of the game, all they seem to require are delivery services involving running letters from one nobleman to another and collecting overdue taxes or other debts. Some of these quests involve utilizing character stats and special skills, such as trying to persuade a lord to pony up the cash he owes one of his fellow noblemen. This adds to the game's RPG flavor, although the conversation options are so limited that you'll feel like you're just going through the motions most of the time. More dramatic tasks like ridding regions of outlaws are eventually offered up, but these assignments are so simplistic that all you have to do is ride to a specific location and kill everybody there. It's far more intriguing to skip the scripted quests and go off on your own, as you can actually recruit a whole army of troops to raze towns and besiege castles. You can eventually sign up with a king and start a-conquering on his behalf, then go on to try to take over or destroy pretty much the entire map. Villages give you the option of seeking recruits to ride with you if you can throw down some gold denars to outfit them, which allows the accumulation of a mercenary army in short order. This aspect of the game isn't totally fleshed out, though. Your retinue of troops is only noted on the map screen as a number under your horse. Even if you've got a hundred men in your employ, you never see them unless you're involved in an engagement on the battlefield--which makes sense, as you wouldn't want a hundred hired goons following you around like those guys in the Verizon ads. Still, it's disappointing that your growing military might is often hidden from view. You can't really control them like an army, either. Orders on the fly are just about nonexistent, which leaves you to simply tell your troops to charge into the fray and help out by cracking a few skulls yourself. Sieges are also scrambly, Keystone Cops-like affairs with too much running around and not enough options for making your way onto castle walls (there's just one ladder, which is absolutely absurd when you've got dozens of men in your army). While the map screen may make it easy to find your way around Calradia, the lack of a storyline means that much of the time you're wandering aimlessly. Which brings us back to combat. One-on-one fighting is the one place where Mount & Blade truly shines. Instead of the clickfest-centered battles in traditional RPGs, here you actually duel with enemies through interactive attacks and blocks. Battles are all about anticipating enemy assaults and hitting the right mouse button at the right time to fend them off. Then, and only then, you sneak in with counterattacks with the left mouse button. Finer control is available through mouse movement. If you need to block a high attack, you just move the mouse up when clicking the right mouse button. Attacks work in the same way. When a foe leaves himself open to the left, you can direct a thrust there by simply clicking the left button and pushing the mouse to the left at the same time. If you find this level of control too arcadelike, you can switch on auto-targeting and the game anticipates the direction of enemy attacks. This isn't nearly as fulfilling as going it alone, though it does offer more involved combat than that in most other RPGs. All of this lends a realistic block-attack flow to combat that requires you to think before committing to any action. Swinging wildly just winds up leaving you wide open to enemies. Baddies know how to take advantage of poor moves, too. End up off-balance and they hammer the hell out of you, whaling away with three or four attacks in a row that you are helpless to defend against. So there is no way to cheat the system and forgo blocking. Not that you will want to. Fighting here never gets old. It's really easy to get hooked on all of the back-and-forth dueling, and you soon come to wish that you could ditch all of the RPG stuff for nothing but nonstop battles like those in the town arenas where you can hone your skills and make a few bucks. The only drawback to the combat system is how hard it is on the wrist. Enemies circle you at numerous times during battles, forcing you to swivel around a lot to avoid getting stabbed in the back. Such continual side-to-side movement is murder on your mouse wrist. Large-scale battles during major engagements can quickly go from intense and entertaining to carpal tunnel throbbing. Take regular breathers. Just don't use these breaks to play tourist and check out the Calradian countryside. Much of this realm is very, very ugly. There are few details and even fewer geographical features, aside from the ever-present bland rolling hills. One medieval architect seems to have planned the entire land, as castles and towns tend to have the same layout. Just a few basic facial types are spread among the hundreds of non-player characters in the game, so you soon develop a sense of deja vu when speaking to what look to be the same town elders in every settlement on the map. Everything is very, very dark, a problem that cannot be fully corrected by turning up the gamma in the game settings screen. That said, you can still encounter some gorgeous, atmospheric scenes during your adventures. Days progress from morning through afternoon and night during play, which open up stunning vistas where you're surrounded by sunlight and shadow. Sunsets are beautiful, especially when viewed from atop a castle wall, and galloping across the countryside at night under a full moon is drenched in gothic atmosphere. It's too bad that you can't just skip the RPG stuff and go straight to the fighting. But these scenes are too often overwhelmed by buggy quirks. Faces and torsos are often completely different colors, so it can look like characters are wearing masks. Towns are sometimes invisible. You can enter them and listen to all of the usual town sounds like dogs barking and people busily working, but it will appear as if you're still walking through empty countryside. Leaving a town for the map screen occasionally causes a bug that transports you outside a castle, only the walls are now paper-thin and floating in midair. TaleWorlds is continually updating the game with patches, although right now the most stable aspect of the presentation is the haunting musical score centered around harp and violin. Most of the tunes here would be the perfect accompaniment for wandering through a Renaissance fair. Those are a lot of negatives, although Mount & Blade really feels more underdeveloped than it does flat-out bad. There are some really promising innovations and design ideas here. It would be intriguing to see what TaleWorlds could do with an Oblivion-sized budget. As it is, though, this RPG provides a lot of sizzle and little steak. It is still worth keeping an eye on, as the developers and an ever-growing mod community are continually enhancing the game. Just don't expect too much right now if you're coming to this indie from more professional games with higher production values. It's far more intriguing to skip the scripted quests and go off on your own, as you can actually recruit a whole army of troops to raze towns and besiege castles. You can eventually sign up with a king and start a-conquering on his behalf, then go on to try to take over or destroy pretty much the entire map. Villages give you the option of seeking recruits to ride with you if you can throw down some gold denars to outfit them, which allows the accumulation of a mercenary army in short order. This aspect of the game isn't totally fleshed out, though. Your retinue of troops is only noted on the map screen as a number under your horse. Even if you've got a hundred men in your employ, you never see them unless you're involved in an engagement on the battlefield--which makes sense, as you wouldn't want a hundred hired goons following you around like those guys in the Verizon ads. Still, it's disappointing that your growing military might is often hidden from view. You can't really control them like an army, either. Orders on the fly are just about nonexistent, which leaves you to simply tell your troops to charge into the fray and help out by cracking a few skulls yourself. Sieges are also scrambly, Keystone Cops-like affairs with too much running around and not enough options for making your way onto castle walls (there's just one ladder, which is absolutely absurd when you've got dozens of men in your army). While the map screen may make it easy to find your way around Calradia, the lack of a storyline means that much of the time you're wandering aimlessly. Which brings us back to combat. One-on-one fighting is the one place where Mount & Blade truly shines. Instead of the clickfest-centered battles in traditional RPGs, here you actually duel with enemies through interactive attacks and blocks. Battles are all about anticipating enemy assaults and hitting the right mouse button at the right time to fend them off. Then, and only then, you sneak in with counterattacks with the left mouse button. Finer control is available through mouse movement. If you need to block a high attack, you just move the mouse up when clicking the right mouse button. Attacks work in the same way. When a foe leaves himself open to the left, you can direct a thrust there by simply clicking the left button and pushing the mouse to the left at the same time. If you find this level of control too arcadelike, you can switch on auto-targeting and the game anticipates the direction of enemy attacks. This isn't nearly as fulfilling as going it alone, though it does offer more involved combat than that in most other RPGs. All of this lends a realistic block-attack flow to combat that requires you to think before committing to any action. Swinging wildly just winds up leaving you wide open to enemies. Baddies know how to take advantage of poor moves, too. End up off-balance and they hammer the hell out of you, whaling away with three or four attacks in a row that you are helpless to defend against. So there is no way to cheat the system and forgo blocking. Not that you will want to. Fighting here never gets old. It's really easy to get hooked on all of the back-and-forth dueling, and you soon come to wish that you could ditch all of the RPG stuff for nothing but nonstop battles like those in the town arenas where you can hone your skills and make a few bucks. The only drawback to the combat system is how hard it is on the wrist. Enemies circle you at numerous times during battles, forcing you to swivel around a lot to avoid getting stabbed in the back. Such continual side-to-side movement is murder on your mouse wrist. Large-scale battles during major engagements can quickly go from intense and entertaining to carpal tunnel throbbing. Take regular breathers. Just don't use these breaks to play tourist and check out the Calradian countryside. Much of this realm is very, very ugly. There are few details and even fewer geographical features, aside from the ever-present bland rolling hills. One medieval architect seems to have planned the entire land, as castles and towns tend to have the same layout. Just a few basic facial types are spread among the hundreds of non-player characters in the game, so you soon develop a sense of deja vu when speaking to what look to be the same town elders in every settlement on the map. Everything is very, very dark, a problem that cannot be fully corrected by turning up the gamma in the game settings screen. That said, you can still encounter some gorgeous, atmospheric scenes during your adventures. Days progress from morning through afternoon and night during play, which open up stunning vistas where you're surrounded by sunlight and shadow. Sunsets are beautiful, especially when viewed from atop a castle wall, and galloping across the countryside at night under a full moon is drenched in gothic atmosphere. It's too bad that you can't just skip the RPG stuff and go straight to the fighting. But these scenes are too often overwhelmed by buggy quirks. Faces and torsos are often completely different colors, so it can look like characters are wearing masks. Towns are sometimes invisible. You can enter them and listen to all of the usual town sounds like dogs barking and people busily working, but it will appear as if you're still walking through empty countryside. Leaving a town for the map screen occasionally causes a bug that transports you outside a castle, only the walls are now paper-thin and floating in midair. TaleWorlds is continually updating the game with patches, although right now the most stable aspect of the presentation is the haunting musical score centered around harp and violin. Most of the tunes here would be the perfect accompaniment for wandering through a Renaissance fair. Those are a lot of negatives, although Mount & Blade really feels more underdeveloped than it does flat-out bad. There are some really promising innovations and design ideas here. It would be intriguing to see what TaleWorlds could do with an Oblivion-sized budget. As it is, though, this RPG provides a lot of sizzle and little steak. It is still worth keeping an eye on, as the developers and an ever-growing mod community are continually enhancing the game. Just don't expect too much right now if you're coming to this indie from more professional games with higher production values."}