{"ref": "https://www.gamespot.com/reviews/game-of-thrones-episode-two-the-lost-lords-review/1900-6416020/", "date": "February 2, 2015", "game_name": "Game of Thrones: A Telltale Games Series", "text": "Author George R. R. Martin's A Song of Ice and Fire opens with a densely packed prologue. He gives you a taste of the world and its simmering dangers, a glimpse of attitudes in Westeros, and just enough information to get you wondering. It's a slow build-up to a dramatic payoff, and it takes a lot of patience and faith that things will get interesting before you get there. Telltale Games has taken this approach with its Game of Thrones video game, in that its second episode is where the story really begins. Having dedicated the entire first episode to setting the stage for the Forrester family's troubles, Telltale gets the ball rolling in Episode Two, The Lost Lords. The Forresters and their companions continue to be the most interesting characters on screen, and their ups and downs echo the flow of Martin's storytelling to great effect.The Lost Lords opens on one of Episode One's more enigmatic lost ones, Asher Forrester, second-eldest son of the house and currently exiled in Yunkai. Yunkai, as you know, is Daenerys Targaryen's current pit-stop on her march to reclaim the Iron Throne. Meanwhile, Mira is still trying to leverage the favors of Margaery Tyrell and Tyrion Lannister in her family's favor, as well as balancing her strained friendship with another handmaiden. Gared Tuttle has just reached the Wall and is preparing to take the Black, joining the ranks of the Watchers that guard Westeros's northern border. And the situation at Ironrath continues to worsen, with the death of one lord and the unexpected arrival of another.The first episode focuses entirely on the Forrester family, while The Lost Lords introduces others connected to them. We see two young women from other Northern houses come to comfort the grieving clan. In King's Landing, Mira's fellow handmaiden, Sera, is revealed as more than just an airheaded girl with dreams of marrying up. And in Yunkai, Asher hunts former slave-lords with his best friend, a female sellsword named Beskha.Beskha is the most vivid of the new original characters, a boisterous, dirty-talking gal clad in leather who easily jokes about whores and who bounties with Asher. She's a strong addition to an already strong cast and is somewhat reminiscent of canon character Brienne of Tarth-- tall, muscular, brave, but with her own pack of secrets. During my time with The Lost Lords I latched onto Beskha, who felt like she had been hiding in dark corners of Westeros all along as we watched Daenerys and her retinue march on Yunkai.Some of Episode Twos best moments take place at the beginning, and it's hard to describe how profoundly they affect the overall plot without giving too much away. If you're familiar with Martin's literary tricks--such as writing deaths of those gone for good, only from another character's perspective--you may have picked up their presence in Episode One, but in this episode they're more pronounced. The events in this episode's first two scenes feel like they were pulled directly out of the books or television show.That's not where the familiarity stops, either. The Lost Lords feels like a piece straight from the source material and more intimately connected to the Game of Thrones universe than Iron from Ice. Granted, Iron from Ice was mostly scene-setting: who's dead, who's alive, whos unaccounted for but still not out of the game. Iron from Ice was the vehicle that got every character where they needed to be. Now, things become interesting. The Lost Lords is your reward for this long set-up, and not only is it well worth the wait, but it's worth several replays if you're the kind of person who needs to know the outcome of all choices on the table.As with the previous episode and other Telltale titles, combat requires the same string of quicktime prompts in order to dodge swords, stab opponents, and duck under flying furniture. The first combat sequence in The Lost Lords one-ups the intro to Iron from Ice, presenting a close-quarters scuffle bloodier and more acrobatic than anything thus far. It's intimate, violent and just so Game of Thrones, it sent a chill down my spine. This episode's action sequences also move a little more quickly, which can cause you to die more quickly. However, the game autosaves every few moves and plunks you into the action with little progress lost, forgiving mistakes more easily and minimizing grievances.There are a few light sequences in which you have Gared training for a spot on the Night's Watch. You have to carry barrels across a yard, perform some basic sword moves against another trainee, and shoot straw dummies with arrows. It's a brief string of moments that bring you into the fold of black cloaks and justify Jon Snow's presence, and, while it's pleasant within Gared's story arc, it feels shoehorned in when you look at the broader scope of things. It's not as dire as choosing whether or not to dispose of a murder weapon or bully someone into marrying you, and creates a bit of a lull in the middle of an otherwise high-energy episode.Telltale's games present the possibility of your choosing your own route through a story, with each choice impacting events further out. In Game of Thrones, you don't just have one way to steer; there are nearly half a dozen wheels spinning at once that need to be accounted for. And each spinning wheel affects the other without knowing the others' situation. Playing as the Forresters is a long game of telephone in which no one actually talks and all parties must consider each other at all times. The politics in Game of Thrones is incredibly stressful, and the scenarios produce the same feeling as episodes from the HBO show like ~The Mountain and the Viper~ and ~Blackwater.~ Things have also started getting really scummy. The game nails the idea of backstabbing lords and unsuspecting servants in King's Landing, capturing the same urgency and dismay we've come to expect from something carrying ~Game of Thrones~ in the title.Normally, having so many things to keep track of in a video game is somewhat irritating, such as having to keep track of too many sidequests and remembering what NPCs need what item and when. Yet, Game of Thrones makes the act of forgetting what you did with one character not frustrating, but agonizing in the most entertaining way. Early on in the episode, I had an opportunity to forge a letter to someone that would greatly affect an outside union with House Forrester. I chose to write the letter, but by an hour later had completely forgotten about it, until someone suddenly brought it up. The letter-receiver and the member of my house they spoke to didn't know I had written the letter, taking the forged signature at face value. My first thought was how clever I had been. The second was that, oh my God, that act will probably destroy me later--both me and my house.In Game of Thrones you're thinking for four people who, in turn, have to consider a dozen others in every decision they make. On a handful of occasions you have to choose whom to trust and whether or not to keep someone's confidence. Banking secrets may help you later, but breaking someone's faith may mean they throw you, literally, to the lions. Navigating conversations with some of the franchise's biggest characters like Tyrion and Jon Snow can be nerve-wracking, as these are the people in power you need to endear yourself to. But they are just the garnish on the proverbial cocktail Telltale has created with Game of Thrones' original characters.The Lost Lords offers no respite from the anguish of Iron from Ice, and keeps the energy and intrigue up in surprising ways. It's evident every choice you make affects members of your far-flung family, and while it's strenuous to keep track of who is doing what so you don't screw over one of your relatives, it's the fact that your entire family's honor is hanging in the balance that really keeps you on your toes. And with very few opportunities to breathe and survey the damage in Episode Two, you often forget just how strongly your choices ripple out to your loved ones. It's genuinely tough trying to decide the best way out. Or the safest way. This is the real Game of Thrones."}