{"ref": "https://www.gamespot.com/reviews/project-justice-review/1900-2716408/", "date": "May 7, 2001", "game_name": "Project Justice", "text": "Capcom's Rival Schools was an arcade fighting game that became a PlayStation sleeper hit. The unique game had a nice, fun fighting system, and the character designs were unlike anything else on the market. These things came together to make the original game a success, and it's these same things that make the oft-delayed Dreamcast sequel worth picking up.The game's story takes place one year after the first game. Just as things in the Japanese high school scene have become quiet again, strange things start happening. A fight breaks out at an interschool athletic event, and there's someone dressed up as Batsu wreaking havoc in town. So it's up to you--regardless of which school you choose to fight as--to get to the bottom of the mystery. While the paths of the different schools are different, they all eventually lead to a showdown with the same boss. Also, it's worth noting that none of the speech has been translated in the game, right down to the title screen. All the game's text has been translated into English, but some of the English is sloppy and looks rushed. Also, presumably because of all the text involved, the board game mode and character edit mode from the Japanese version of the game have been removed, as has the online network mode. Included are the arcade mode, which comes in both story and free select flavors; a tournament battle; practice and versus modes; and an extra options menu, where you can do things like watch endings you've already seen and view some other little tidbits.The fighting in Project Justice uses the same four-button system found in the previous game, and you can still team up with your offscreen partner for dual attacks. However, now you choose three characters. This gives you two options for your team-up supers, and it also adds a method to cancel team-up moves. When someone lands a team-up, the prospective victim can launch a team-up of his or her own, which puts the third character into play against one of the other player's backup fighters. This fight is a quick one, lasting five seconds at most and requiring only one hit. If the initiating player lands the first strike or lasts until the timer runs out, then his or her team-up move continues as planned. If the countering player lands a strike, then the team-up is cancelled. Also, there is a new three-fighter attack called a party-up attack, which takes five levels of your super meter but usually takes around half of your enemy's life bar.Rival Schools looked good for a PlayStation game, and Project Justice makes for a good-looking Dreamcast game. Originally designed for the Naomi hardware in arcades, the Dreamcast version looks virtually identical to its coin-op counterpart. The characters look great, and they're animated well enough. The game's soundtrack consists of wah-heavy guitar rock, and the game's sound effects are typical fighting game fare.For a game that was pushed back as often as Project Justice has been, you'd think it would have all the Japanese modes and a nice, polished translation. However, this isn't the case. Luckily, the game stands on its gameplay alone, making it a must-own for fans of the series and a game worth looking at if you're looking for a fun, stylish fighter."}