{"ref": "https://www.gamespot.com/reviews/x-files-resist-or-serve-review/1900-6092295/", "date": "March 25, 2004", "game_name": "The X-Files: Resist or Serve", "text": "Although The X-Files saw its last original episode air in 2002, the popular series that followed a pair of federal agents who investigated the paranormal is still held very dearly by its legion of faithful fans, who still believe that the truth is out there. X-Files: Resist or Serve is one of those rare games based on a television license that successfully transitions the spirit and soul of its source material into a new medium. While the game is marred by some graphical and gameplay issues, it still crafts an intriguing and engaging set of ~episodes~ that will please fans--as well as survival horror aficionados--with the taste of some good, old-fashioned alien conspiracy. Mulder and Scully--together again. You'll play the role of either Special Agent Fox Mulder or Special Agent Dana Scully as the pair descends on the sleepy, little town of Red Falls, Colorado, to investigate a series of bizarre, gruesome murders. While the focus of the case initially centers around two teenage twin girls and their penchant for witchcraft, there's, of course, something far more sinister operating under the surface. This intrigue gradually draws the FBI agents deeper into the case until they're fully well-snared. There are familiar faces to be met along the way, including friends like Assistant Director Walter Skinner and the indomitable Lone Gunmen, as well as foes, like the unpredictable Alex Krycek and his superior, the enigmatic Cigarette-Smoking Man. The story of Resist or Serve was penned by writers from the original television series, and it really shows, because the game is tightly, richly, and intelligently scripted. As Mulder and Scully progress through the game's events, each will jot detailed notes that serve to provide clues on how to proceed as well as fill in backstory for X-Files neophytes and those who might need a refresher on the mythos. Exactly how you progress through events will differ, depending on which agent you've chosen to play. Mulder, who has (in the past) been subject to strange surgeries and experiments, is often the target of enemy manipulations and scheming, so his scenario frequently borders on the surreal. Scully relies on logic and her medical training, so her scenario is full of autopsies and mixing antidotes for various toxins, which serve as interesting diversions from the usual sorts of puzzles. Most of the puzzles in Resist or Serve are very straightforward, though you'll want to make sure you've checked every corner of every room and every pocket of every fallen foe to ensure that you haven't missed a crucial item. The camera sometimes conspires against you in this regard, however. All areas of the game are viewed with fixed ~cinematic~ angles that can often hide certain parts of rooms (in addition to hiding enemies) if you don't travel the right way. You'll frequently end up running toward the camera, completely blinded as to what might be in front of you down the hallway. The analog controls won't help when you're in an area that changes camera angles multiple times in short spaces, either. As a result, you'll end up having to jiggle the analog stick to realign yourself, which is disorienting. These problems can be compounded by your characters' sometimes clunky movement, because it's possible to ~catch~ yourself on the corner of a door or a piece of furniture. Dispatching baddies is mainly achieved through the use of firearms, and there's a number of these that you can collect in any given area. Enemies are generally easily avoided, especially in open areas, but the game does have a nasty habit of sometimes throwing a mob of creatures at you in a confined space. If there are enough of them, you will occasionally suffer the misfortune of being trapped in an endless loop of physical assaults until your character falls down. What's especially wretched is that there are certain areas of the game where zombies endlessly respawn. Unless you know what to do and where to go beforehand, you can waste lots of ammunition in spots like these, and since you often don't know what to do and where to go beforehand, you'll end up participating in some needless trial and error drills. Visually, the game is decent. It's obvious that time went into tweaking the models for the main characters so that they would all closely resemble their actual counterparts, and on the whole, they're very acceptable likenesses. However, the models are stiff and a bit wooden, even when conversing with one another, and they don't move very fluidly. (Scully's run, in particular, looks especially awkward.) You'll find yourself clipping a bit through walls, doors, and furniture, especially when manipulating switches or running with your gun drawn. Rooms with infinitely-spawning enemies also inexplicably always spawn the same zombie with the same flannel shirt. (Apparently, flannel is the new black for the discerning undead.) The environments themselves feel a little flat and dull--especially in wide, outdoor spaces--with muted colors and rather stark, generic-looking buildings. The game's sound is where it truly shines, due mostly to the fact that the original TV show cast members all reprised their roles here, from David Duchovny and Gillian Anderson on down. Dialogue in the game flows extremely naturally, keeping all of Mulder's quick wit and Scully's dry forbearance, and the main cast all sounds great. Much of the music in the game is recycled from the show, so you'll be hearing a few key pieces most often. While it couldn't be called original, it's still atmospheric and appropriate for the game. Some of the sound effects themselves are also very nice. Specifically, the deep crunching sound of a rib cage being cut during an autopsy is always good for a shudder. Aliens, artifacts, and autopsies are alliterative articles! Completing the various episodes and acts with Mulder and Scully will gradually unlock a number of extras, including artwork, storyboards, trailers, and ~B-rolls,~ which are movie excerpts from the voice-recording sessions for various actors. The story for each agent can be finished in fewer than 10 hours, but each scenario is a very distinct, worthwhile experience. The game bills itself as an original ~lost episode,~ and it certainly realizes this promise with the richness of its talented cast and writers. Fans of The X-Files who've been missing their old friends should consider giving X-Files: Resist or Serve a try."}