{"ref": "https://www.gamespot.com/reviews/stronghold-review/1900-2822114/", "date": "November 2, 2001", "game_name": "Stronghold", "text": "Stronghold is both a real-time combat game that focuses entirely on castle sieges and a village-management simulation in the vein of Zeus or The Settlers. The subject matter alone gives Stronghold a leg up. It's been years since a game let you pour boiling oil on invading hordes, and Stronghold simulates castle sieges well enough to recommend it to those who are interested in the premise. But it's a hesitant recommendation, due to a poor interface and mediocre campaigns. There are two campaigns, one military and one economic. The economic campaign is made up of a handful of timed missions in which you must acquire a certain target amount of goods or gold. Occasional threats in the form of bandits and animals will require you to maintain a basic militia, but the mission goals are always economic. This campaign only serves to highlight the fact that as a management simulation, the game is pretty shallow. You build woodcutters, farmers, and miners, and the goods are brought to your storehouse. You build secondary producers, who use these goods to produce weapons and food. You must also ensure you have enough food to keep your people happy and enough gold to hire soldiers. Since taxing your people makes them unhappy, and unhappy people will leave your kingdom, you must also find ways to keep your popularity high. This can be done by providing them with extra food, churches, or alehouses. Keeping your people happy is relatively unchallenging, although it seems complicated in theory. Most of the time, providing more food will be all you need to do, and the rest is unnecessary. The economic and management elements of Stronghold are simple, but they are just the setup for the military game. The military campaign lets you defend against sieges, and siege other castles, as well as incorporate the economic elements. In the military campaign, you play the son of a king who was betrayed and murdered. His land was divided among four men: The Snake, The Pig, The Rat, and The Wolf. You must take back your father's land piece by piece. Massive sieges are Stronghold's high point. The early stages of the campaign act as a tutorial, and a much better one than the game's actual tutorial option. In the beginning you will have only archers to defend your castles, and that will be all you need. Later, you'll have access to pikemen. Much later, you'll get the more advanced units such as swordsmen, engineers, and macemen. Part of the problem with the campaign is that you are stuck with the lowliest of units for the first half, and then things start to escalate rapidly. Your first castle siege is also your first time using engineers, who make your siege weapons, and the trial-by-fire element comes out of nowhere. Not only have you not had practice using the units, but it will take you some time to learn how to use them. This suggests one of Stronghold's biggest problems: The interface makes little sense. There is a series of tabs on the bottom of the screen, each of which shows you different types of structures you can build. There's a farm tab, a food-production tab, a weapons-building tab, and so forth. Then there is a castle tab that lets you build walls. To build towers, you need to go to the castle tab and then click on the tower button, which opens the tower screen. Same for gatehouses. Moats are on the gatehouse screen. Or possibly the tower screen. There's no real rhyme or reason for where some things are located. Your barracks and armory are under the castle tab, but weapons manufacturers have their own tab.Units pose their own set of interface problems. You can group units together with the standard Ctrl+number, but if you individually select any member of that group after that, he is removed from his group. If you select your entire army in order to move it, all of your groupings are lost. This system makes little sense and renders any sort of intelligent attack strategy almost impossible in the heat of battle. Buildings outside your castle are especially vulnerable to attack. Building castle walls is another issue. You aren't allowed to place buildings or objects in areas you can't see, and the low isometric viewpoint means that any area blocked by a building or another piece of wall is off-limits. You can rotate the map to view the field from a different angle, but towers and gatehouses can often block your view so that you never see a gap in your defenses. You can lower all buildings on the screen so that you can build without interference, but it's a crude solution to a serious problem. Moreover, certain types of buildings aren't allowed in every mission, which can cause confusion. One mission lets you build moats but not drawbridges. This can catch you off guard, as your villagers will have no way of bringing goods to the stockpile if they can't get over your moat. Not that you'll be building moats often. Perhaps because of the problems above, very few of the campaign missions actually require you to build a decent castle. Usually, you'll start with a castle and only be required to defend and repair it as necessary. Defending a castle isn't very difficult, because the artificial intelligence of your enemies is terrible. Enemies will always enter from the same point and always make a beeline for the closest structure. You are told where the enemy will enter by way of signposts on the map, so you rarely need to defend more than one side of your castle. For most of the campaign, a large group of archers and crossbowmen will take down an entire approaching army as it marches in a straight line toward your keep. Enemies will always enter from the same point, which can make them easy targets. Once you get to the latter half of the campaign, the game picks up. Having access to the advanced units makes things more interesting, as engineers pour boiling oil on enemies wielding battering rams, incoming units die in pit traps, pikemen try to fill moats as archers rain arrows down on them, macemen knock encroaching soldiers off ladders, and walls crumble under the bombardment of siege weapons and tunnelers, who burrow under walls to damage their foundations. The action can be exciting enough to watch that you forget all of the game's problems and just enjoy watching your opponent's--or your own--castle fall. Visually, the game is reminiscent of Age of Empires II. The buildings look good, but not great, and the same can be said of the units. The animations are well done, especially the motion blur on the arrows and projectiles as they fly through the air. The soundtrack is dramatic, while the sound effects consist of fairly typical funny comments from units and ambient building sounds. Campaign play isn't your only option, and if nothing else, Stronghold provides a great deal of variety. There are a number of individual combat and economic scenarios, as well as a variety of stand-alone modes, both peaceful and combat-oriented, that let you build your castle at will. The multiplayer options include a number of different games, and it's a better challenge to defend a castle against more intelligent opponents. Stronghold has some rather serious problems. But if you can get past them, or learn to work with them, the game gives you enough options that you'll have dozens of hours of sieges and defenses ahead of you.Units pose their own set of interface problems. You can group units together with the standard Ctrl+number, but if you individually select any member of that group after that, he is removed from his group. If you select your entire army in order to move it, all of your groupings are lost. This system makes little sense and renders any sort of intelligent attack strategy almost impossible in the heat of battle. Buildings outside your castle are especially vulnerable to attack. Building castle walls is another issue. You aren't allowed to place buildings or objects in areas you can't see, and the low isometric viewpoint means that any area blocked by a building or another piece of wall is off-limits. You can rotate the map to view the field from a different angle, but towers and gatehouses can often block your view so that you never see a gap in your defenses. You can lower all buildings on the screen so that you can build without interference, but it's a crude solution to a serious problem. Moreover, certain types of buildings aren't allowed in every mission, which can cause confusion. One mission lets you build moats but not drawbridges. This can catch you off guard, as your villagers will have no way of bringing goods to the stockpile if they can't get over your moat. Not that you'll be building moats often. Perhaps because of the problems above, very few of the campaign missions actually require you to build a decent castle. Usually, you'll start with a castle and only be required to defend and repair it as necessary. Defending a castle isn't very difficult, because the artificial intelligence of your enemies is terrible. Enemies will always enter from the same point and always make a beeline for the closest structure. You are told where the enemy will enter by way of signposts on the map, so you rarely need to defend more than one side of your castle. For most of the campaign, a large group of archers and crossbowmen will take down an entire approaching army as it marches in a straight line toward your keep. Enemies will always enter from the same point, which can make them easy targets. Once you get to the latter half of the campaign, the game picks up. Having access to the advanced units makes things more interesting, as engineers pour boiling oil on enemies wielding battering rams, incoming units die in pit traps, pikemen try to fill moats as archers rain arrows down on them, macemen knock encroaching soldiers off ladders, and walls crumble under the bombardment of siege weapons and tunnelers, who burrow under walls to damage their foundations. The action can be exciting enough to watch that you forget all of the game's problems and just enjoy watching your opponent's--or your own--castle fall. Visually, the game is reminiscent of Age of Empires II. The buildings look good, but not great, and the same can be said of the units. The animations are well done, especially the motion blur on the arrows and projectiles as they fly through the air. The soundtrack is dramatic, while the sound effects consist of fairly typical funny comments from units and ambient building sounds. Campaign play isn't your only option, and if nothing else, Stronghold provides a great deal of variety. There are a number of individual combat and economic scenarios, as well as a variety of stand-alone modes, both peaceful and combat-oriented, that let you build your castle at will. The multiplayer options include a number of different games, and it's a better challenge to defend a castle against more intelligent opponents. Stronghold has some rather serious problems. But if you can get past them, or learn to work with them, the game gives you enough options that you'll have dozens of hours of sieges and defenses ahead of you."}