{"ref": "https://www.gamespot.com/reviews/yager-review/1900-6110907/", "date": "October 19, 2004", "game_name": "Yager", "text": "Yager, the new dogfighting action game for the Xbox from the eponymous Yager development team out of Germany and Kemco, has only recently arrived on American shores after a year's delay. First glances of the Yager project became available all the way back in 2002, when then-publisher THQ released a few tantalizing bits of information about the game. At that time, Yager caused a stir with its visual resplendence and omnidirectional, high-G combat. Of course, a year in distribution limbo will make mincemeat of almost any video game's high profile, and the game that some once believed to be 2003's definitive aerial action extravaganza has limped into 2004 priced at a discount and without much in the way of fanfare. Delays aside, Yager provides a fair amount of entertaining, highly kinetic, action adventure gameplay at a very affordable price. But it's also a game that probably would have looked a lot more impressive if it had been released a year ago. Yager's 22 levels require a lot of exploration. Your protagonist in Yager is one Magnus Tide, a bed-headed ex-Marine who balances the chip on his shoulder with a carefully honed aura of insouciance. Tide lives in a future world where the nation-state has faded away entirely. This world has been divided up politically by large corporate entities that maintain their own military wings in order to wage war for territory, technology, and resources. It's helpful to consider Yager's narrative scope as a gigantic space opera--only conducted near the surface of the planet with a myriad of futuristic fighter jets, frigates, submarines, and other vehicles, in place of spaceships and UFOs. Tide is a scrappy mercenary pilot, known as a ~freelancer,~ who contracts out his wits, assault jet, and itchy trigger finger to whichever corporation can write him the biggest check. The lucky company in this case is Proteus, which is sort of akin to NATO and Vault City rolled up into a single, verdant island mass. As you learn in the game's opening sequences, Tide has been hired by Proteus before, to ill effect. In fact, a past mission failure under Proteus' employ destroyed the freelancer's reputation, as well as his ship. Yager's story arc represents Tide's last-ditch attempt to salvage his career--and to patch up his relationship with Sarah, a lovely but icy Proteus commandant. In the brutal, turbulent world of Yager, you'll have to do more than root for the underdog to help Magnus Tide to come out on top. Over the course of the game's 22 missions, Tide will gradually unravel the grand conspiracy that has let loose the dogs of war over Proteus' tropical shores. The plot's a little on the ludicrous side, jerking you from lush islands to Teutonic forests to Chernobyl-like industrial wastelands and back again with very little regard for logic or narrative continuity. This isn't a big problem, however, because you'll always know what to do when waves of Cockney-accented sky pirates or harsh pseudo-Imperial German fighter aces approach: blast them out of the sky using the Sagittarius, your state-of-the-art jetcraft. Your ship is a fantastic confection of JATO jets, turboprops, and weapons, and it is both extremely maneuverable and extremely deadly. It's capable of two flight modes. There's hover mode, which provides a slow, stable, helicopter-like feel for the purposes of stealth, careful maneuver, and wide-area weapons targeting. And then there's jet mode, which doubles your throttle and allows you to perform dogfighting techniques like barrel rolls, flips, and sharp turns. In order to make much progress in Yager, you must learn how to transition seamlessly from one mode to the other so that you can jet into a location, stop on a dime, start strafing, and then beat a hasty retreat. The standard controls for each mode are a little different, so gaining this level of mastery is no easy feat; fortunately, the game does a great job of building your skills slowly through its mission structure. Some levels may frustrate you by requiring quantum leaps in your skill level, but when you finally get the Sagittarius to respond intuitively, your achievement will feel worth the trouble. Thankfully, the game simplifies matters with a liberal auto-aiming system, which functions in either flight mode. Provided you have an appropriate weapon selected, pointing your cursor near an enemy that is close enough to your ship will engage your targeting computer, which will then begin to follow the hostile. Furthermore, you can ~lock on~ to a single bandit at a time, which provides you with a red targeting reticule that shows up on your radar screen and keeps tabs on your opponent as it goes through obstacles. Yager's auto-aim is generally a boon, although it can be inordinately difficult to manage in swarms of enemies or in situations where you need to switch targets rapidly. For example, heat-seeking missiles seem to pose a particular problem for your supposedly defensive machine guns, which will often fail to lock on in time. Learn how to manage the terrain, or you're toast. On the plus side, the Sagittarius has plenty of hardware to deal with threats, from standard lasers and missiles to a sniper rail gun. Most of these guns require ammunition packs, which are strewn throughout each expansive level. If you want to maximize your combat effectiveness (and level score), it's a good idea to search every bit of territory for power-ups. Many of your weapons have secondary functions that can prove useful in certain situations, too. All told, the game's weapons are generally well-balanced and fun to use--especially the sniper gun, which can save you a lot of trouble if properly used, and it is absolutely vital to some missions. However, it does seem as though your ship's basic laser, which will be your most frequently used weapon, runs out of juice entirely too quickly. Your enemies range from simple pirate rigs and air mines to stationary turrets to heavily armored droids and huge battleships, which must be dismantled sequentially. You can pretty much give your enemies the bum's rush through the first 10 levels or so, but after that, you must start implementing hit-and-run tactics and looking ahead to survive. Indeed, the last several levels of the game will pit you against large odds, forcing you to resort to guerilla tactics. You'll run up against a couple of big ships fairly early on, which will make for a few interesting boss battles. Unfortunately, you will also need to wade through many, many entry-level jets, drones, and ground guns before you start getting to the really interesting bits. If you're looking for variety, this business will test your patience. Another strange choice in Yager's design involves the interspersion of special robot-repair platforms throughout each level. Land on these puppies, and you'll refill your health to full, even while your ship is taking heavy damage from a multitude of sources; wait a minute or so, and you can refill again. On some levels, this allows you to camp more or less indefinitely by a healing point and waste enemies as they go by. Yager's levels are definitely on the huge side. The largest of them require up to two minutes of sustained jet time to transit entirely. You receive your primary instructions at the beginning of each level, and more commands and objectives arrive from headquarters on a consistent basis. Most of these objectives are appropriately marked on your overhead map, but some are unnecessarily confusing and will require a good deal of frantic flying and several wasted lives to identify. There are also auxiliary tasks to perform in most of the levels, and if you complete them you can gain extra ammo and props from the locals. If you do everything right, you'll rack up bonus points and unlock a ship library as well. A lot of these special tasks are silly non sequiturs; their inclusion feels like a stab at making Yager seem less like the straightforward adventure that it is. This game makes a lot of pretensions toward being nonlinear, but you'll still turn around automatically if you try to take an unauthorized shortcut through a level. That said, one of Yager's best features is its varied terrain, which consists of many valleys, peaks, rivers, and hiding spots. It's a lot of fun to duck in and out of canyons and gullies at will, seeking cover when necessary. The turret levels probably should have been omitted. There are also a few obligatory, stationary- and moving-turret levels that are intended to break up the core gameplay. But their inclusion in this game was a mistake. These boring, slipshod sequences are set up by lame plot contrivances, and the turret mechanics themselves range from jittery to almost broken. If Yager's creators had defied convention and eschewed this garbage time for more flight and fight, it would have improved the game. Yager's graphics and sound are serviceable, but they're not likely to turn any heads right now. The game's textures are just a little too grainy to qualify as modern day, and many of the game's special effects just don't look that great. For example, Yager's water, whether flowing or still, doesn't look realistic at all. Also, you can fly right through the obviously bitmapped trees and telephone poles with no collision or sound at all--it's literally holographic. Some level of persistent damage effects, like scorch marks, would be pretty much standard issue at this point, but Yager doesn't have any of those effects. On the other hand, the game does run at a brisk clip most of the time, although it will slow down noticeably when rendering mist effects and the like. Yager's graphics aren't bad, but they show the game's age. Yager's audio withstands the test of time a little better. The game uses bursts of music very effectively to increase dramatic tension or to indicate a firefight, and the sound effects, while not remarkable, are crisp enough. Voice acting is a very important feature for a game like Yager, which relies heavily upon in-engine cutscenes for narration. The voice actor playing Magnus Tide is generally pretty strong, especially in sustained monologues; he doesn't do as well when delivering Tide's trademark deluge of one-liners, however, as they begin to sound kind of stilted after a while. The other voices are a mishmash of strange accents that can amuse and annoy by turns. A Clockwork Orange-style sneering of the pirates is great, but listening to your querulous Russian comrade whine incessantly on one level will make you want to tear your hair out. Overall, Yager is a somewhat cool game that hasn't aged very gracefully. In 2003, it still would have been a very strong competitor. In late 2004, however, this game's aging aesthetics are no longer capable of overriding the holes in its gameplay. Yager is priced to move, and fans of aerial dogfighting games will find 15 to 20 hours of pretty decent action here. Other players may be better served sticking with a rental. Yager's levels are definitely on the huge side. The largest of them require up to two minutes of sustained jet time to transit entirely. You receive your primary instructions at the beginning of each level, and more commands and objectives arrive from headquarters on a consistent basis. Most of these objectives are appropriately marked on your overhead map, but some are unnecessarily confusing and will require a good deal of frantic flying and several wasted lives to identify. There are also auxiliary tasks to perform in most of the levels, and if you complete them you can gain extra ammo and props from the locals. If you do everything right, you'll rack up bonus points and unlock a ship library as well. A lot of these special tasks are silly non sequiturs; their inclusion feels like a stab at making Yager seem less like the straightforward adventure that it is. This game makes a lot of pretensions toward being nonlinear, but you'll still turn around automatically if you try to take an unauthorized shortcut through a level. That said, one of Yager's best features is its varied terrain, which consists of many valleys, peaks, rivers, and hiding spots. It's a lot of fun to duck in and out of canyons and gullies at will, seeking cover when necessary. The turret levels probably should have been omitted. There are also a few obligatory, stationary- and moving-turret levels that are intended to break up the core gameplay. But their inclusion in this game was a mistake. These boring, slipshod sequences are set up by lame plot contrivances, and the turret mechanics themselves range from jittery to almost broken. If Yager's creators had defied convention and eschewed this garbage time for more flight and fight, it would have improved the game. Yager's graphics and sound are serviceable, but they're not likely to turn any heads right now. The game's textures are just a little too grainy to qualify as modern day, and many of the game's special effects just don't look that great. For example, Yager's water, whether flowing or still, doesn't look realistic at all. Also, you can fly right through the obviously bitmapped trees and telephone poles with no collision or sound at all--it's literally holographic. Some level of persistent damage effects, like scorch marks, would be pretty much standard issue at this point, but Yager doesn't have any of those effects. On the other hand, the game does run at a brisk clip most of the time, although it will slow down noticeably when rendering mist effects and the like. Yager's graphics aren't bad, but they show the game's age. Yager's audio withstands the test of time a little better. The game uses bursts of music very effectively to increase dramatic tension or to indicate a firefight, and the sound effects, while not remarkable, are crisp enough. Voice acting is a very important feature for a game like Yager, which relies heavily upon in-engine cutscenes for narration. The voice actor playing Magnus Tide is generally pretty strong, especially in sustained monologues; he doesn't do as well when delivering Tide's trademark deluge of one-liners, however, as they begin to sound kind of stilted after a while. The other voices are a mishmash of strange accents that can amuse and annoy by turns. A Clockwork Orange-style sneering of the pirates is great, but listening to your querulous Russian comrade whine incessantly on one level will make you want to tear your hair out. Overall, Yager is a somewhat cool game that hasn't aged very gracefully. In 2003, it still would have been a very strong competitor. In late 2004, however, this game's aging aesthetics are no longer capable of overriding the holes in its gameplay. Yager is priced to move, and fans of aerial dogfighting games will find 15 to 20 hours of pretty decent action here. Other players may be better served sticking with a rental."}