{"ref": "https://www.gamespot.com/reviews/fantasy-life-review/1900-6415904/", "date": "November 6, 2014", "game_name": "Fantasy Life", "text": "The residents of Reveria are a diverse bunch. Strolling out your front door and down the main street of its central hub Castele, you pass by Pam the real estate agent and Amy the small-time business owner, moments before paying a visit to Daemon the Dark Sultan or Ahab the Fisherman slash Pirate King. On the way, you might spy Terry the fry cook chatting to Derek from accounts, who likes nothing better than to share a jar or two down the local tavern with his best mate, Paul the Wizard. Just like the game itself, Fantasy Life's inhabitants are a playful mix of the magical and the mundane.You see, while Fantasy Life can have you spin the tale of a brave Paladin, a wizened Magician, or a resourceful Hunter, it also allows you to follow the paths of lesser-renowned, everyday heroes. For where would those gallant glory-hunters be without the tailors to dress them in the kingdoms most exquisite finery? Or the miners and smithies to provide them gleaming weapons with which to dispense steely justice? There are twelve occupations, or lives, for you to choose from, and while you'll invariably be drawn to those that promise the shiniest armor and the grandest accolades at first, you may also find, in time, that there's a quiet dignity in dedicating your life to darning.Fantasy Life combines the gently paced, pastoral role-playing from the likes of the Animal Crossing series with the pomp, spectacle and narrative tropes of JRPGs like Final Fantasy and, more recently, Bravely Default. You start off as a beginner in your designated field, renting a tiny attic room in the centre of town, but after befriending an incessantly cheery talking butterfly and bow-tie impersonator named Flutter, your deeds soon earn you the attention of the royal family, who require your aid in saving the kingdom from certain destruction--something about a vague prophecy involving the moon, a goddess, and a couple of big, glowing rocks. It's your typical run-of-the-mill, end-of-the-world hokum just barely saved by charmingly childish characters and the occasional slice of witty dialogue. Luckily, you can see to it at your own pace, though doing so sooner will open up access to new worlds and challenges with which to enrich your repertoire of skills.There are three types of resource to earn; Dosh, the general currency with which you can buy and sell items; Bliss, earned by carrying out requests from Flutter or hitting certain personal milestones; and Stars, which are accrued through performing notable feats and serve to increase your proficiency in the Life you're currently focusing on. Leveling up, from novice to master, unlocks new skills--sword attacks for Paladins and recipes for Cooks, for example--which are used to increase your renown and bank balance, and better serve the citizens of Reveria.While you can quite comfortably pick one class and stick with it for the entire game, Fantasy Life allows you to change your Life at almost any time, and encourages you to try out the different callings and experiment with how different learned skills might mesh together later on down the line. Some Special Skills are only be useable for your current Life, but others naturally feed into other roles, allowing you to, for example, craft your own armor to wear into battle against the ferocious Napdragon, or pack a heartier picnic to take with you on your next mineral-mining adventure.The key conceit here, of course, is that the Life of a Miner or an Angler can be just as compelling as that of a fierce Mercenary or a Magician--except that, unfortunately, they really aren't. A Life that doesn't centre around combat typically involves either crafting items or gathering them. Foraging for firewood or for ingredients to cook on it have you exploring the great outdoors looking for specific spots to till, whilst crafting usually takes the form of minigames instructing you to mash buttons in time to on-screen prompts. Neither are particularly engaging, especially after planing your thirtieth or fortieth plank of wood in a single sitting. Then again, the combat isn't all that taxing either. Holding or tapping Y, A and X performs either regular or special attacks, and that's as complicated as it ever gets.When you aren't busy furthering your career, you can spend your time undertaking random requests from the inhabitants of Reveria. Some of these are skill dependant--a hungry cat may ask you to catch it a batch of fresh fish or a castle guard may ask you to craft him a better shield, for example--but most are simple fetch and collect quests that you can absent-mindedly chip away at while focusing on other, more important tasks. Earn enough dosh from these odd jobs and eventually you're able to move out of your attic room and into plusher accommodations more befitting a burgeoning hero.You can also, if you wish, push the boat out and further customise your home with decor and fine furnishings collected from your travels, but this is never as in-depth or involving as the similar system found in Animal Crossing; on the whole, it's a fairly uninteresting distraction. Bonuses awarded for collecting Bliss vary from being given your own noble steed to keeping pets to the ability to change your hairstyle at will, though again these all feel rather inconsequential in the grand scheme of things and end up getting lost amidst the game's many other occupations.Fantasy Life is smartly presented and considered, which is exactly what youd expect from developer Level-5 whose past titles include the Professor Layton series and Studio Ghibli collaboration Ni No Kuni. It was also co-developed by the recently restructured studio Brownie Brown, and features artwork and music from Final Fantasy alumni Yoshitaka Amano and Nobuo Uematsu.Despite the star-studded lineage, however, Fantasy Lifes protracted development and muddled focus can be keenly felt throughout. Somewhat ironically, it feels like a jack of all trades and a master of none. Individually, each activity you embark on adequately entertains for a short while, but they never quite add up to a compelling and cohesive experience you want to keep coming back to. Without a strong narrative hook to drive the action, your life will amount to little more than a daily grind of menial tasks, resource collection and buying things you dont really need. And thats a bit close to boring old real life for my tastes.The multiple inspirations it has drawn from, not to mention the stand-out games its developers have produced in the past, means that the most Fantasy Life ever does is remind you of other titles that do each of its individual facets better, without ever quite surpassing any of them. After an ambitious start and far too much repetition, the magic is drained from Reveria and, in the end, all youre left with is the mundane. Perhaps theres a reason most of us have never heard of Paul the wizard. Sorry, Paul."}