{"ref": "https://www.gamespot.com/reviews/twin-sector-review/1900-6246334/", "date": "January 13, 2010", "game_name": "Twin Sector", "text": "Picture this: You're trapped in a sterile environment loaded with obstacles and traps to overcome. The halting voice of a computer outlines the task ahead of you. You have no weapon to keep yourself protected--just a couple of devices that you use to manipulate the environment. If you've played Portal, this is a familiar setup, and it's difficult not to notice Twin Sector's similarities to that modern classic. However, the comparisons are only skin-deep, and the two games differ in a very important way: Twin Sector isn't fun. Its first-person, physics-based gameplay premise is initially intriguing, but the game's total lack of personality, poor visuals, and abysmal sound design suck all the energy out of it. Furthermore, unpredictable physics and infuriating design gaffes make playing it a chore rather than a joy. Twin Sector displays a few gusts of creativity, but they barely lift the game from the gutter, let alone cause it to soar. What valuables, exactly, are these lasers protecting? You play as Ashley, one of many individuals frozen in a cryogenic stupor after environmental contamination rendered Earth's surface uninhabitable. The time has come for the slumbering residents of the underground cryostation to reanimate and head back to the surface, but for some reason, you're the only person the station's AI can revive, which makes you humankind's last hope. Well, you and your artificial guide, O.S.C.A.R., whose stale, droning monotone guides you through the facility's dreary innards and provides you with occasional updates. If Portal's GlaDOS is puzzle gaming's charmingly sociopathic matron, O.S.C.A.R. is her boring second cousin. He's voiced with all the appeal and adeptness of a fourth grader reciting his paper on what he did over summer vacation, and he wears out his welcome just as quickly. Ashley is faintly more interesting, though the actress's attempts at occasional exasperation and fear are amateurish. To be fair, however, few actors could break out of a yawn over Twin Sector's plain dialogue, which does just the bare minimum to keep the plot moving forward. If you came for the puzzles and not for the story, you'll at least like the concept behind the gameplay. Ashley wears two special telekinetic gloves: one that pushes and one that pulls. Using the pulling glove, you can yank objects like barrels and boxes toward you, or pull yourself toward walls and walkways. With the pushing glove, you can fling those same barrels away from you, or even propel yourself off the ground. You can perform a number of different feats using these gloves, such as leaping across wide chasms, throwing barrels to hit unreachable buttons, and breaking through busted doors by throwing flaming canisters at them or rolling big balls of trash into them. A few multistage puzzles are complex enough to seem clever, such as one in which you must maneuver a garbage ball through a number of corridors, up and down ramps, and through an antigravity room. Brief moments like this showcase Twin Sector's notable potential. Unfortunately, Twin Sector is characterized more by its lifeless production values and irritating design flaws. The physics are frustratingly uneven, so a simple leap onto a pipe above you may not work as you intended. Or you might try to set one barrel on top of another, only to topple the tiny tower when you attempt to carefully set the barrel in place and instead fling it forward. The presence of seekers--aggressive, hovering balls buzzing with lethal electricity--make certain levels even more exasperating, because you must overcome the imprecise physics while under pressure. In other cases, basic defects can bring the game to a dead halt. For example, the inexact physics may cause you to extinguish your limited supply of exploding canisters or insanely fragile water cylinders before you've accomplished the task you needed them for. This leads to a stalemate in which you cannot progress and the game does not fail you--a fundamental design flaw. In another case, a dispenser will eternally provide an additional canister if you should use up the last one (it somehow magically knows), but in this circumstance, it's possible to lose a canister without causing it to explode. No explosion means no newly dispensed canister. This could have been avoided had Twin Sector allowed you to summon a canister of your own accord, but the game lacks this kind of common sense design. Grammar and spelling mistakes may lead to some inadvertent entertainment. Twin Sector also lacks a strong sense of place. The cryogenic facility is an aimless maze of gray hallways and large empty rooms inexplicably protected by lasers and turrets. Any object you encounter is meant to help you solve a puzzle or to hinder your progression; otherwise, the environments are flat and empty. Every room looks more or less the same, with few changes in color palette, lighting, or architecture. There are no creepy crevasses, no flickering bulbs, no looming shadows--no sense of tension, or joy, or sorrow, or anything at all. The sound design is even more dismally sparse, which becomes more noticeable when the musical score goes silent. You hear Ashley's footsteps as you trod down the endless hallways, but she makes no sound whatsoever when she jumps. Industrial fans spin behind grates, but they don't hum or whir--they make no sound at all. The effects that do exist, such as the miserable crackle of fire, sound as if they were pilfered from a public domain database. You'd expect that breaking open a huge metal door would result in a raucous din of clinging and clanging, not a simple dreary thump. Twin Sector has an interesting idea that deserved a better game to bring it to life. A few competent puzzles hint at what could have been, but the game has no character and no drive; like that poor door punctured by rolling rubbish, it makes a dull thud rather than a raucous roar. Some games feel like labors of love. Twin Sector is pure labor."}