{"ref": "https://www.gamespot.com/reviews/final-fantasy-xiv-online-a-realm-reborn-review/1900-6415747/", "date": "May 5, 2014", "game_name": "Final Fantasy XIV Online: A Realm Reborn", "text": "Final Fantasy XIV found itself languishing back during its original release only weeks after its inception. The juggernaut Final Fantasy XI grew into was a tough act to follow, but no one predicted such a spectacular failure. Square Enix took note and responsibility and made a resolution to learn from its past mistakes, releasing Final Fantasy XIV: A Realm Reborn as a ~rebirth~ of sorts for the massively multiplayer online role-playing game that could. It has used its own personal Phoenix Down to come back fully revitalized, and the gorgeous new MMORPG is now a bustling world filled with curious players ready to get lost in it.Where previously version 1.0 of Final Fantasy XIV suffered from a dearth of content, A Realm Reborn flourishes with a brand-new graphics engine, revised gameplay, and the ability to handle a much heavier server load than ever before. Though the PlayStation 3 edition was a serviceable test run for the new and improved Final Fantasy XIV, it was still plagued with usability issues and interface problems that made it an exercise in frustration, especially when it came to presentation and aesthetic quality.The PlayStation 4 edition has solved nearly all the existing issues with previous versions and can hold its own as a companion to the PC edition, running at a smooth 1080p and rivaling even top-tier graphics on PC editions at the highest video settings. Noticeably improved draw distance is one major reason to upgrade to the PS4 edition, because it resolves previous frustrations with keeping up with your combatants onscreen as well as what's coming up in the overworld. A markedly improved UI makes it simpler to track the action onscreen, and only minor frame rate drops mar the overall experience. When large groups of players are gathered in one area at the same time, there is a bit of slowdown, but it's barely noticeable when it does happen.The PS4's controller feels fantastic, with functional control mapping and the crossbar, which allows you to use L2, R2, the D-pad, and face buttons to issue commands similar to how you do in the PS3 version. The touchpad has been smartly implemented as well; you can use it as though it were a mouse cursor to toggle between menus and choices. Possibly the most notable and useful addition to the PS4 version of A Realm Reborn, however, is the ability to use Remote Play with your Vita. Taking your Vita to bed to cuddle up with it and get some grinding in feels spectacular, like a history-defining moment. How joyous of an occasion would it have been to be able to play Final Fantasy XI in such a fashion? Remote Play works beautifully for FFXIV, so well that it's hard to imagine any future PS4 MMOGs not including the option.And what of Eorzea itself? The world of Final Fantasy XIV is humongous and rife with treasures, terrifying bosses, and surprises at every turn. A gorgeous expository cutscene sets the stage for the advanced Garlean Empire to invade the realm of Eorzea from the north, while city-states known as grand companies band together to combat the new threat. Crooked Garlean Imperial has other ideas about settling the score, however, and plans out Project Meteor to summon the moon Dalamud, which wipes out all traces of life outside of those on Eorzea.As Dalamud falls to Eorzea, Bahamut escapes from thousands of years of imprisonment and is finally sealed away by a powerful scholar. The scholar sends all available survivors to a rift in time, and that's where you come in--waiting for the time to arise when you can return to your home and restore it to its former glory. While it's not a narrative that brings any feeling of immediacy to the table, it's meaty enough to make you feel as though your actions can and do matter.A Realm Reborn flourishes with a brand-new graphics engine, revised gameplay, and the ability to handle a much heavier server load than ever before.Deep character customization is a boon right off the bat, with new races to experiment with, classes to align yourself with, and options to settle on. There's so much to choose from, in fact, that it can become intimidating. It's prudent to spend a good 15 to 20 minutes studying which race and class best fit your play style before taking the plunge.There are five races to choose from: the Hyur are similar to the Hume from Final Fantasy XI, while the Elezen are an elf-like race. You've got the Miqo'te, who resemble Mithra, and the Roegadyn are the orc analogue, though they're much better looking than your typical orc. Last but not least are the Lalafell, who are tiny adorable dwarven folk, clearly channeling some Tarutaru for the sake of cuteness. All these races begin with varying attributes, but by the endgame, those variances don't tend to matter, when you've got hundreds of points in each stat. Race is mostly cosmetic in this game--choosing a class and eventual job are more important tasks, and doing so can be difficult if you jump into it blind.While it's easy to recognize MMO mainstays such as the tank, DPS, and healer, there are other varieties of classes to settle into if you're looking for something a little different. Classes are divided into subsets known as ~disciples,~ which are further broken down into specific classes. For instance, you may choose to play a Hyur who fits into the ~disciples of war~ subset. Disciples of war are primarily melee and ranged classes such as marauders, gladiators, and archers, while disciples of magic feature conjurers or arcanists.It's a bit obtuse and a far cry from the job-selection screen of any typical RPG, especially when you sprinkle the distinctively Final Fantasy jobs into the mix. You can select a job such as warrior, dragoon, or white mage, but they require having specific classes leveled up sufficiently. In this, it's a different system than Final Fantasy diehards may be used to, but it's a refreshing change, even if it does take some time to work out on your own if you don't enlist the help of a guide. Luckily, each class is tied to an individual experience level, which allows you to pursue class-centric quests and level up characters independently of each other.You may find the first 20 to 30 levels easy to breeze through, hitting your stride at 40 or 50. Things fall into place quickly when you're facing off against fantastic bosses and collecting new gear. The dungeons themselves are varied in that some incorporate puzzles, some require the designated tank of the party to take control while leading the boss away from more vulnerable players, and many are middle-of-the-road affairs you can conquer with little more than your best spells, buffs, and melee. There's little more rewarding than overcoming, for example, the level 50 Leviathan trial (new to this update) deep underwater as you're bombarded by aquatic armaments and enormous tidal waves. Final Fantasy mainstays make appearances as well, such as Ifrit, Titan, and the Ultima Weapon, all massive events that require cunning and planning on your part, as well as competent party members who aren't above a little support when the game dips beyond typical tank-and-spank measures.The dungeons themselves are varied in that some incorporate puzzles, some require the designated tank of the party to take control while leading the boss away from more vulnerable players, and many are middle-of-the-road affairs you can conquer with little more than your best spells, buffs, and melee.There's more to Final Fantasy XIV beyond dungeon exploration, though, and that's a good thing, since grinding to attain the proper level for boss X or quest Y can become tiresome, especially if you're playing solo through story quests and events. You aren't relegated to slashing through bunnies and worms like in the olden days of Final Fantasy XI, but you need patience and a party to quest with if you want to quickly rise through the ranks.Take a break to craft items if your class allows it, gather materials, or tackle the quest lines and repeatable levequests of your chosen profession for daily growth and monetary gain. You need the in-game cash flow if you wish to take advantage of one of the many boons, such as player housing, which can become exorbitantly expensive.Housing is an interesting new addition that's quite a bit of a gil sink, but it's a rewarding system that you and your guild members will want to invest in when the money is rolling in. Much like in real life, it can take time to find an affordable plot of land to build your house on, but once it's completed and bonuses to experience points and attributes start rolling in for you and your free company (that is, guild), you'll be thankful for the investment. It's much more than an aesthetic update; it's an entirely new venue that serves to enhance the feeling that you're not just playing a game--you're playing a role. Gardening is an adjunct to player housing, and is the only way some items can be obtained. You can also add your own crafting station and place your very own merchant shop on your property. There has never been a better time for honest-to-goodness role-playing in A Realm Reborn, especially given that you can become a homeowner now.The wealth of content from prior releases is only scratching the surface, with patches 2.1 and 2.2 adding a plethora of adjustments to current content as well as additional quests for the main storyline. The main quest line is extended and provides a hearty amount of endgame play for those currently at the level cap. Also available are new endgame side quests specific to player disciplines, and a high number of item drop adjustments throughout the game as well.There's no traditional PVP, and at times the grind can grow tedious, but if you press on, you find a vast and charming supporting cast, complex classes with plenty of interesting augmentations along the way, and a reworked MMORPG that combines new and old elements to weave together a satisfying and modern Final Fantasy that does its part to cater to longtime franchise fans and MMO enthusiasts alike. This is an admirable redesign, especially on the PlayStation 4, which very well may be considered the best venue to experience the staggering world and cornucopia of additional content. Even if you're still trekking through Vana'diel, consider making yourself a new home in Eorzea--we'd love to have you."}