{"ref": "https://www.gamespot.com/reviews/grand-theft-auto-double-pack-review/1900-6085579/", "date": "November 4, 2003", "game_name": "Grand Theft Auto Double Pack", "text": "October 22, 2001, was the day that Rockstar Games fired off the shot heard round the video-game world. It was the day that Grand Theft Auto III was released in North America. The freestyle crime-themed game absolutely exploded onto the scene, and the game industry simply hasn't been the same since. A little over a year later, Rockstar followed up on its runaway success with the release of another game from the same universe, Grand Theft Auto: Vice City, which took the criminal antics from GTAIII, expanded upon them, and set the whole thing in a highly stylized version of 1986. Vice City delivered more of what made GTAIII so impressive, and the series became even more successful. The effects of these two releases are still being felt today. The developers pulled no punches and made the M rating more meaningful than ever, but what really set the games apart from the pack was the feeling of being in a real, living world. Your actions have meaning here, and there are tons of intricate interactions that make the game feel larger and freer than the games that came before it. And now both games have come to the Xbox in one incredible package. It's taken a while to come to the Xbox, but it was definitely worth the wait. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Grand Theft Auto Double Pack Video Review Due to the extreme mainstream media attention that the games have received over the past two years, it's safe to assume that you've at least heard of the Grand Theft Auto series. For those of you familiar with it, let's cover the main points of this Xbox release right off the bat. For starters, it must be said up front that the Xbox versions of GTAIII and Vice City are the best versions of the game so far. The PlayStation 2 versions looked fantastic, given the relatively underpowered PS2 hardware, and the ports that appeared on the PC did a nice job of cleaning up and improving upon the original PS2 games. But the Xbox versions of the games go one step further than that. You'll immediately notice reflections coming off the cars, and the lighting in general is better. The texture quality and character models have been improved. The draw distance seems a little further out. And the frame rate remains pretty stable throughout. The games take advantage of the Xbox's audio prowess by playing in Dolby Digital 5.1 sound and offering support for the custom soundtrack feature. The games' video will stretch to the 16:9 aspect ratio and will also play in 480p. The control in both games remains largely unchanged, using the same auto-lock-on feature found in the PlayStation 2 version rather than going with the standard third-person shooter setup found on the PC. The driving control has been revamped to use the Xbox's analog triggers, which works well. Overall, GTAIII and Vice City are the same games they were when they came out on other platforms--but the Xbox versions simply look and sound better while still playing just as well now as they did back when they were first released, and if you're itching to play either game again, do yourself a favor and play it on the Xbox this time through. But if you're new to the series, read on, and we'll dig a little deeper into some of the other aspects of the games. The Grand Theft Auto series started out as a quaint 2D series seen from an overhead perspective. Many of the gameplay elements found in the 3D games, such as the free-roaming attitude and mission-based gameplay, were formulated and improved upon back in the first two GTA games. The older GTA games were certainly fantastic in their day but were easily shuffled under the rug in favor of more graphically impressive fare. GTAIII solved that problem by taking the series to 3D. Now you have a huge, realistic-looking city to drive around in, causing as much chaos as you see fit. Both games follow roughly the same format, though Vice City does it with a little more pizzazz. Missions show up on your map, and you can head over to those locations to start a mission at almost any time. These missions, which are usually assigned by your friendly neighborhood crime boss, might be as simple as giving a prostitute a ride across town. But some of the more complex missions--more of which surface in Vice City than in III--might have you manning the turret on or driving a speedboat, on the way to pick up some drugs, while taking fire from helicopters, or using a sniper rifle to cover a friend while he attempts to plant a bomb on a boat. Completing missions gives you cash and, in most cases, opens up the next mission in the story. Since most of what you're doing involves crime, various types of law enforcement will attempt to take you down along the way. If you get bored with the missions, you can drive around the city and attempt to find cash another way, such as by driving a taxi or a fire truck. Or maybe you might just want to beat up prostitutes and steal their money. It's your call, and you can play as neatly or as messily as you like. The graphical improvements help what would otherwise be a two-year-old game stand up to modern releases. That sort of freedom is really what sets these games apart from the pack. Sure, the games continue down a linear path, so you'll eventually have to complete specific missions to advance the plot. And other games may offer large worlds to play in. But the Grand Theft Auto games actually give you something to do in their large spaces. With plenty of optional missions and other things to do, you never feel like you're being forced down one story path. It's easy to spend hours just driving around and getting into trouble, then seeing how long you can avoid capture. The games' physics also have a lot to do with making them great. The driving in the game is nicely done, and the collisions are appropriately dramatic. The control takes some getting used to, especially if you're comfortable with another version of the game, but once you've warmed up to it, it works just as well as any other version of the game, which is to say, well enough to get the job done. GTAIII places you in the role of a nameless, voiceless thug and takes place in a fictional metropolis known as Liberty City. Liberty City is a largely corrupt place, with several warring criminal factions spread throughout its boroughs. You're a small-time crook who gets set up by his girlfriend during a heist. You take the fall for the crime but manage to escape when a posse of thugs overtakes the paddy wagon that you, along with a few other prisoners, are traveling in. This is where you hook up with the demolitions expert known as 8-Ball, who takes you to meet a friend in the early portion of the game, which also serves as a tutorial of sorts to help you get acclimated to the rules of the world. That friend is involved with the Mafia, of course, and he gives you tasks of increasing difficulty. As you proceed by completing these tasks, you'll bounce from crime boss to crime boss and play on various sides of a war between organized-crime families. Two of the most value-packed games released this generation for the price of one? Sign us up. In a stark contrast to GTAIII's dingy, New York-like setting, Vice City, based in Miami, has a much brighter and more colorful setting. The year is 1986, and Tommy Vercetti, who talks up a storm throughout the game, has just been released from prison after doing a 15-year stretch for the mob. The mob--more specifically, the Forelli family--appreciates Tommy's refusal to squeal in exchange for a lesser sentence, so they send him down to Vice City to establish some new operations. Tommy's first order of business in Vice City is to score a large amount of cocaine to work with. But Tommy's first drug deal goes sour, leaving him with no money, no cocaine, and no idea who wronged him. The mob is, of course, angry over the whole situation, and now Tommy has to make up for the loss before the gangsters come down from Liberty City to clean up the mess. As Tommy, you'll start the investigation, figure out who ripped you off, take care of business, and set up shop in Vice City in a big, big way. Oh, and you'll also purchase your own taxi company, get involved in a turf war between the Cubans and the Haitians, befriend a Scottish rock group named Love Fist, become a pizza delivery boy, smash up the local mall, demolish a building to lower real estate prices, hook up with a biker gang, run an adult film studio, take down a bank, and much, much more. By comparison, Vice City certainly has a lot more depth than its predecessor, though both games hold up very well. The gameplay in the two games is nearly identical, though a few things were added to Vice City that made it even more dynamic. For example, in Vice City, you can shoot out the tires of cars or even just nail the car's driver in the head through the window of the car. Tommy Vercetti can also duck, though to be honest, this doesn't come in handy as often as Tommy's ability to dive out of moving vehicles. Vice City lets you enter certain buildings and also contains fun-to-drive motorcycles and mopeds, while GTAIII only contains cars and trucks for ground transport. GTAIII's weapon system lets you carry just about anything you want to, but Vice City breaks weapons up into classes, offering multiple types of assault rifles, submachine guns, and so on. But even with these differences, the games both boil down to the same sort of structured, mission-based plot advancement. Graphically, there are a few better-looking games on the Xbox than these two games. The characters' faces aren't as defined as they could be, for example. But the game makes up for its few downfalls by maintaining a good frame rate while displaying a positively huge world. Vice City also ups the ante by offering tons of graphical style. From the costumes to the neon lights of the Vice City streets, the game really does justice to its exaggerated '80s theme. The car designs are well done, and, as previously mentioned, the cars break up in a very satisfying way. Above all, the visual style of the games really separates them from other similar products, and they work together with the music and sound to create a very atmospheric universe. The addition of 480p support cleans the game up even further, which is a good addition for owners of higher-end screens. GTAIII and Vice City also do a fantastic job on the audio side of things. The city streets sound alive with traffic, and the sounds of your squealing tires, gunfire, and explosions all sound authentic. The game is playable in Dolby Digital 5.1, and the game uses surround effects a bit better than the PS2 installments did, though some of the mixing seems to be a bit off, as the radio sounds very quiet by default. Considering how much the radio adds to the game, it's worth it to pump the music all the way up. The game also has support for custom soundtracks. A cavalcade of star voice talent appears in both games, including Frank Vincent, Joe Pantoliano, Michael Madsen, and Kyle MacLachlan in GTAIII and Ray Liotta, Tom Sizemore, Dennis Hopper, Burt Reynolds, Luis Guzman, and Phillip Michael Thomas in Vice City. The game contains stars, but it doesn't lean on their familiar voices for a cheap thrill. All the voice acting in the game is top-notch, and the script they're working with is a fantastic one that manages to maintain a dark sense of humor while still delivering the gritty crime themes that you'd expect from a game about being all the criminal that you can be. Some control changes had to be made to fit the game onto the Xbox controller, but it still controls just as well as the PS2 version did. The music is another story entirely. Music is worked into the game by way of your car radio. You'll be spending a lot of time in vehicles, and there are a lot of different radio stations to choose from. The GTA series has always done this, but GTAIII takes it to a new extreme, mainly by adding a hilarious talk-radio station to the mix. Other stations play rap, licensed from Game Records, and the soundtrack to the movie Scarface. Vice City takes this concept one step further and tosses a ton of great '80s music onto its radio stations. Two talk-radio stations can be found here, though they aren't quite as laugh-out-loud funny as Chatterbox was in GTAIII. The acts in Vice City include Quiet Riot, Michael Jackson, David Lee Roth, Herbie Hancock, Judas Priest, Human League, and Frankie Goes to Hollywood. Lots of different genres are represented, and the music really plays a key role in making the '80s atmosphere very, very thick. While these two games are one and two years old, respectively, they hold up extremely well. They're also unique due to the fact that there simply isn't anything else quite like Grand Theft Auto on the Xbox. Sure, other recent releases have attempted to duplicate specific portions of the GTA formula, but the real deal is still far better than any of the pretenders to follow in its wake. If you're an Xbox owner who either hasn't played these games or is looking to play them again, the Xbox versions of GTAIII and Vice City are the best ones available, and they're just as amazing now as they were when they were first released on the PlayStation 2. GTAIII places you in the role of a nameless, voiceless thug and takes place in a fictional metropolis known as Liberty City. Liberty City is a largely corrupt place, with several warring criminal factions spread throughout its boroughs. You're a small-time crook who gets set up by his girlfriend during a heist. You take the fall for the crime but manage to escape when a posse of thugs overtakes the paddy wagon that you, along with a few other prisoners, are traveling in. This is where you hook up with the demolitions expert known as 8-Ball, who takes you to meet a friend in the early portion of the game, which also serves as a tutorial of sorts to help you get acclimated to the rules of the world. That friend is involved with the Mafia, of course, and he gives you tasks of increasing difficulty. As you proceed by completing these tasks, you'll bounce from crime boss to crime boss and play on various sides of a war between organized-crime families. Two of the most value-packed games released this generation for the price of one? Sign us up. In a stark contrast to GTAIII's dingy, New York-like setting, Vice City, based in Miami, has a much brighter and more colorful setting. The year is 1986, and Tommy Vercetti, who talks up a storm throughout the game, has just been released from prison after doing a 15-year stretch for the mob. The mob--more specifically, the Forelli family--appreciates Tommy's refusal to squeal in exchange for a lesser sentence, so they send him down to Vice City to establish some new operations. Tommy's first order of business in Vice City is to score a large amount of cocaine to work with. But Tommy's first drug deal goes sour, leaving him with no money, no cocaine, and no idea who wronged him. The mob is, of course, angry over the whole situation, and now Tommy has to make up for the loss before the gangsters come down from Liberty City to clean up the mess. As Tommy, you'll start the investigation, figure out who ripped you off, take care of business, and set up shop in Vice City in a big, big way. Oh, and you'll also purchase your own taxi company, get involved in a turf war between the Cubans and the Haitians, befriend a Scottish rock group named Love Fist, become a pizza delivery boy, smash up the local mall, demolish a building to lower real estate prices, hook up with a biker gang, run an adult film studio, take down a bank, and much, much more. By comparison, Vice City certainly has a lot more depth than its predecessor, though both games hold up very well. The gameplay in the two games is nearly identical, though a few things were added to Vice City that made it even more dynamic. For example, in Vice City, you can shoot out the tires of cars or even just nail the car's driver in the head through the window of the car. Tommy Vercetti can also duck, though to be honest, this doesn't come in handy as often as Tommy's ability to dive out of moving vehicles. Vice City lets you enter certain buildings and also contains fun-to-drive motorcycles and mopeds, while GTAIII only contains cars and trucks for ground transport. GTAIII's weapon system lets you carry just about anything you want to, but Vice City breaks weapons up into classes, offering multiple types of assault rifles, submachine guns, and so on. But even with these differences, the games both boil down to the same sort of structured, mission-based plot advancement. Graphically, there are a few better-looking games on the Xbox than these two games. The characters' faces aren't as defined as they could be, for example. But the game makes up for its few downfalls by maintaining a good frame rate while displaying a positively huge world. Vice City also ups the ante by offering tons of graphical style. From the costumes to the neon lights of the Vice City streets, the game really does justice to its exaggerated '80s theme. The car designs are well done, and, as previously mentioned, the cars break up in a very satisfying way. Above all, the visual style of the games really separates them from other similar products, and they work together with the music and sound to create a very atmospheric universe. The addition of 480p support cleans the game up even further, which is a good addition for owners of higher-end screens. GTAIII and Vice City also do a fantastic job on the audio side of things. The city streets sound alive with traffic, and the sounds of your squealing tires, gunfire, and explosions all sound authentic. The game is playable in Dolby Digital 5.1, and the game uses surround effects a bit better than the PS2 installments did, though some of the mixing seems to be a bit off, as the radio sounds very quiet by default. Considering how much the radio adds to the game, it's worth it to pump the music all the way up. The game also has support for custom soundtracks. A cavalcade of star voice talent appears in both games, including Frank Vincent, Joe Pantoliano, Michael Madsen, and Kyle MacLachlan in GTAIII and Ray Liotta, Tom Sizemore, Dennis Hopper, Burt Reynolds, Luis Guzman, and Phillip Michael Thomas in Vice City. The game contains stars, but it doesn't lean on their familiar voices for a cheap thrill. All the voice acting in the game is top-notch, and the script they're working with is a fantastic one that manages to maintain a dark sense of humor while still delivering the gritty crime themes that you'd expect from a game about being all the criminal that you can be. Some control changes had to be made to fit the game onto the Xbox controller, but it still controls just as well as the PS2 version did. The music is another story entirely. Music is worked into the game by way of your car radio. You'll be spending a lot of time in vehicles, and there are a lot of different radio stations to choose from. The GTA series has always done this, but GTAIII takes it to a new extreme, mainly by adding a hilarious talk-radio station to the mix. Other stations play rap, licensed from Game Records, and the soundtrack to the movie Scarface. Vice City takes this concept one step further and tosses a ton of great '80s music onto its radio stations. Two talk-radio stations can be found here, though they aren't quite as laugh-out-loud funny as Chatterbox was in GTAIII. The acts in Vice City include Quiet Riot, Michael Jackson, David Lee Roth, Herbie Hancock, Judas Priest, Human League, and Frankie Goes to Hollywood. Lots of different genres are represented, and the music really plays a key role in making the '80s atmosphere very, very thick. While these two games are one and two years old, respectively, they hold up extremely well. They're also unique due to the fact that there simply isn't anything else quite like Grand Theft Auto on the Xbox. Sure, other recent releases have attempted to duplicate specific portions of the GTA formula, but the real deal is still far better than any of the pretenders to follow in its wake. If you're an Xbox owner who either hasn't played these games or is looking to play them again, the Xbox versions of GTAIII and Vice City are the best ones available, and they're just as amazing now as they were when they were first released on the PlayStation 2."}