{"ref": "https://www.gamespot.com/reviews/silent-hill-shattered-memories-review/1900-6242751/", "date": "December 10, 2009", "game_name": "Silent Hill: Shattered Memories", "text": "From the moment you turn on Silent Hill: Shattered Memories and are informed that the game ~plays you as much as you play it,~ it's evident that you're in for something quite different. Indeed, this is not the Silent Hill you may have come to expect. The fog, rust, and awkward combat of the past have been replaced by snow, ice, and lots of terrified running. Developer Climax Studios has reinvented the aging franchise for the better by removing the tedium, as well as going back to the basics of strong, psychological storytelling and intense, chilling atmosphere. Regardless of how you feel about previous Silent Hill games, Shattered Memories is a fresh and welcome new beginning that's good for a scare. When loving father Harry Mason loses control of his car on the icy streets of a town called Silent Hill and crashes, everything begins to unravel for him. Awaking in the snow, Harry is horrified to discover that he can't find his seven-year-old daughter, Cheryl, and sets off into the darkness to find her armed with little more than a flashlight. As he traverses the dangerously snowed-in town, Harry meets and interacts with several of its residents, from a local cop to an overly familiar party girl, struggling to come to grips with the fragments of memory the accident left him with, as well as his constantly shifting reality. There's a dark side to Silent Hill, and every so often, the world freezes over before your eyes as supernatural glaciers rise from the earth to consume almost everything. Trapped within the mazes of ice formed in these frozen nightmares, Harry must run, jump, climb, and crawl his way out as he is stalked relentlessly by the pale-skinned, shrieking ghouls that emerge to hunt. They are many and cannot be harmed, so Harry has no choice but to run for his life as these hideous monsters give chase. Each nightmare is its own self-contained maze of twists and turns, but without any sort of useful map to guide you to freedom, you need quick thinking, a strong sense of direction, and a little bit of luck to find the way out. If the monsters succeed in bringing you down, you're returned to the beginning of the maze to try again, but while they can sometimes take several tries, these mazes are rarely frustrating. Though these nightmares represent the only moments in the game in which you're actually threatened, you're constantly vigilant because of the fantastic and haunting atmosphere of every area in Silent Hill, from Midwich High School to Lakeside Amusement Park. Power is out across most of the town because of the snowstorm, and with everything bathed in darkness, only your flashlight--guided by where you point your Wii Remote--can light the way. Similarly, nearly every major action you perform, from opening up cabinets to casting off the monsters that pounce on you in a nightmare requires some sort of gesture, which produces an almost tactile sense of immersion. The simple puzzles you encounter also require motions, such as twisting a radio dial to the proper station or adjusting a planetarium projector. These motion controls not only work without a hiccup, but they're also extremely forgiving and intuitive, which helps to pull you into the haunted town almost immediately. And haunted it is, for Silent Hill is a swirling vortex of paranormal activity with something new lurking around almost every corner. Paranormal phenomena is hidden all over for you to find. As you travel throughout the town, you'll encounter everyday objects with strong emotions attached to them. When in the presence of such an item, Harry's flashlight will begin to flicker and a burst of static will emerge from the Wii Remote speaker. Finding the source of this disturbance will lead to a spooky moment and the receipt of an eerie voicemail or text message on your cell phone, which helps to explain the significance of that particular localized haunting. Occasionally, you may also catch a glimpse of a ghostly flickering image just out of focus to the naked eye but not to the digital sensors in your camera phone--snapping a photo reveals the hidden truth and also triggers the delivery of a voicemail or text. In Shattered Memories, the town itself is a main character, and everything from the haunted objects to the kitschy mementos you find lying around help to establish it. You can even call up the phone numbers seen on billboards and wanted ads all over the city for hidden messages. At regular intervals throughout Shattered Memories, you're temporarily pulled out of the action to interact with an extremely unconventional psychologist in first-person sequences. During each of these sessions, your therapist asks you to complete simple exercises or answer uncomfortable personal questions about fear and sexuality. Your performance and answers to these questions can have wide-ranging effects on your gameplay experience. Characters, dialogue, and ghostly messages can drastically change; the forms of the monsters you flee from are customized to your personal fears; and even the areas you visit, as well as the ending, can differ, which makes this a great game to replay in different ways. For example, in one game, you might encounter a friendly country cop, but in another she's a frigid, shoot-first-ask-questions-later type. There are many possible permutations of story elements, but no matter how much the world changes from one play-through to the next, the nightmares you experience and each of the puzzles you solve remain identical. Thus, an experienced player can easily complete Shattered Memories in six hours or less, though your first time will usually last around seven hours. Shattered Memories is very dark and moody, and from its impressive use of lighting and shadows to the creepy, real-time freezing effects of the nightmares, the titular town on display is at its finest--except when running through doors. For whatever reason, there is some graphical stuttering that frequently occurs when opening up doors, particularly in nightmares. It's not a game-ruining problem, but it does negatively affect your immersion in a game that is all about getting immersed. Fans will be pleased to know that series' maestro Akira Yamaoka returns to score Shattered Memories and produces one of his most distinctive soundtracks yet, but whether you're familiar with his work or not, this Silent Hill features an engrossing sound design that keeps you on your toes at all times. No matter how fast you run or how well you hide, these things will always find you. Throughout the years, the Silent Hill franchise has gradually lost focus of its psychological roots and moved instead toward an ultimately subpar, more action-oriented experience. Shattered Memories is a fantastic return to the core concept of personal fear, and though its developers made some unorthodox decisions--such as removing combat entirely--those decisions have paid off handsomely. This is not the Silent Hill that may have terrified you more than a decade ago but an entirely new experience that is truer to it than any other game bearing the name since Silent Hill 3. Despite a few issues, including its surprising brevity, Silent Hill: Shattered Memories is a great game for anyone looking for a scare, whether you've been to the haunted town before or not."}