{"ref": "https://www.gamespot.com/reviews/wild-guns-reloaded-review/1900-6416600/", "date": "January 2, 2017", "game_name": "Wild Guns Reloaded", "text": "Theres a particular genre of arcade action game that has truly fallen off the radar in recent times--games where you control a character from a third-person view on a 2D plane, shooting objects and enemies in the background with a reticle while dodging shots and obstacles in the foreground.Ive heard this odd genre called many names: shooting gallery, Cabal-like (after the game that popularized it), but perhaps most commonly crosshair shooter. But while traditional platformers, run-and-guns, and even scrolling shooters have experienced something of a recent resurgence in popularity, the crosshair shooter has all but vanished from modern gaming--which is why the release of Wild Guns Reloaded is so exciting to retro-minded players.Wild Guns Reloaded welcomes back Clint and Annie, the dynamic shooting duo from the 1994 original game, as they prepare to blast their way through several levels of gangsters and big, bad biomechanical bosses while collecting loot and dodging gunshots and the occasional creeper with an old-fashioned knife. This time around, theyre joined by a pair of surprising new heroes: Bullet, an adorable long-haired dachshund who fights foes with a special robot drone, and Doris, a large gal whose expertise with explosives ensures that she isnt going to be taking any crap from anyone.Similarly to many games of its ilk, Wild Guns Reloaded has a control scheme built around aiming when youre shooting and dodging when youre not. Pressing the fire button once also lets you melee attack close-range enemies and pick up sticks of dynamite thrown at your feet (which you can then lob back for a sweet, sweet payback explosion). By shooting objects and power-ups that appear, you can change your weapon briefly and collect bonuses. You can move and jump (and double-jump) when youre not shooting, but when youre in the middle of firing, you can only roll. Knowing when to roll--and when to just put the gun away to get the hell out of enemy firing range--is crucial to survival, because in Wild Guns, a single hit means a life lost.Youll be using all your skills to battle a rogues gallery of weird and wacky enemies: lanky gunslinging robots, divers with rocket launchers, jetpack jockeys, and creepy-crawly monsters. The humorous atmosphere of the game gives Wild Guns Reloaded a distinct personality quite unlike anything else, and the new characters, Bullet and Doris, also add a lot both in terms of style and gameplay, since they control very differently from Clint and Annie.New stages, like the Underground area, fit in perfectly with the rest of the game and even add interesting visual quirks like pixel fog that obscures visibility.Bullet has the unique ability to move freely (rather than being limited to dodging) when attacking, though his range when holding down the fire button is extremely limited. He can also hover using his robot drone, which makes him the most maneuverable of the bunch. Doris lacks traditional rapid-fire shots; Instead, she charges up a grenade attack when the fire button is held down, with the attacks power (and the score multiplier) increasing the longer the button is pressed. While shes slower in normal movements, she has a very fast, multi-part dodge attack, as well as a special jumping melee strike. Both characters offer new, distinct, fun ways to play through the game.Visually, Wild Guns Reloaded is every bit as beautiful as it was in 1994. Theres a tremendous amount of artistry and care poured into these hand-drawn pixel visuals, and little touches--like the fact that many objects in the background take visible damage from all the gunplay going on around them--give the games world an exciting, lively feel. Compared to the original SNES version, many of the games backgrounds and objects have been retouched while keeping true to the visual style and limitations of the 16-bit era. In some cases, this was done to accommodate the widescreen HD format, while in other cases, it feels like it was done just because the developers wanted to go the extra mile to really make things shine. New stages, like the Underground area, fit in perfectly with the rest of the game and even add interesting visual quirks like pixel fog that obscures visibility.Being an old-school styled arcade game, Wild Guns doesnt offer much in the way of tutorials or even warmups: Youre thrust straight into the action and expected to learn the ropes as you play more and more. Increasing difficulty levels offer new and different stage arrays, as well as limit your amount of lives and emergency smart bombs. Make no mistake: Even on Easy difficulty, Wild Guns Reloaded is one tough game. True to the genres arcade roots, if youre going to try and clear the game in a single credit or go for high scores, youre going to have to put in a lot of practice learning enemy patterns, movement timing, and locations of hidden goodies.And thats where the fun in this game lies: growing from a bumbling would-be marksman to an expert gunslinger as you invest the time and effort to learn the games intricacies. Given the amount of hidden secrets scattered in every environment, as well as the differences in play styles between the characters, theres a lot to learn and uncover. Many of the unlockable rewards are behind skill walls, tool: For example, you cant access the original SNES soundtrack unless you manage to beat the game without continues, which is no small feat.Wild Guns is a fantastic representative of an underappreciated genre with an adorable pup riding a robot. Whats not to love?But if you feel like you need a helping hand--or paw, as the case may be--you can bring along three friends for some four-player action. Things get awfully chaotic in this mode with four characters zipping around the screen, but working together with friends to take down waves of enemies is a rollicking good time. Unfortunately, there's no online multiplayer option, so youll need to have your partners all on the same couch to enjoy the frenetic fun.Between the fine-tuned gameplay, the enhanced visuals and sound, the four-player fun, and the new gameplay-changing character additions, Wild Guns Reloaded is one of the best retro reissues weve yet seen on the PS4. Its also fantastic representative of an underappreciated genre with an adorable pup riding a robot. Whats not to love?"}