{"ref": "https://www.gamespot.com/reviews/fugitive-hunter-war-on-terror-review/1900-6084346/", "date": "November 21, 2003", "game_name": "Fugitive Hunter: War on Terror", "text": "Fugitive Hunter is a first-person shooter for the PlayStation 2 that, as the name implies, lets you hunt fugitives from the law. There's nothing at all unique or novel about the game, other than the fact that the most-wanted fugitive topping your list--and consequently, the last boss of the game--is Osama Bin Laden. It might have been fun if the concept had been executed entirely differently, but Fugitive Hunter's lousy execution makes it impossible to recommend, especially when there are better shooters available on the PS2. If you think a street fight against Osama Bin Laden sounds like a good time, Fugitive Hunter is your game. Fugitive Hunter drops you into the role of Jake Seaver, a former Navy SEAL who's joined CIFR (Criminal Interdiction and Fugitive Recovery) in the hopes of tracking down the world's most infamous fugitives from justice. There's really no more storyline than that--you go on a series of missions in pursuit of the most-wanted criminals on your list, then once you've caught them, you smack them around a little bit for good measure. Fugitive Hunter is definitely a ~shoot first, ask questions later~ sort of game. You'll spend about 95 percent of your time in Fugitive Hunter engaged in completely run-of-the-mill FPS gameplay. Don't expect any gameplay innovations at all here--you just point your weapon at the bad guys and shoot. The loadout is pretty bland by FPS standards, since we've all seen the pistol, shotgun, assault rifle, RPG, and sniper rifle plenty of times before, and they all feel pretty flimsy here. Each mission has a number of objectives you have to complete before you'll find your target, such as finding evidence of wrongdoing or disabling important equipment. You have a radar in your HUD that contains a white dot indicating the location of your next goal, so completing each objective is reduced to mindlessly running toward the next white dot, killing everything in your way, and picking up/shooting/interacting with the relevant item at the end. The shooting gameplay isn't glaringly flawed in any way aside from the occasional ugly problem with collision detection or disappearing enemies, but it gets awfully repetitive since there's never any variety in what you're doing whatsoever. The other 5 percent of Fugitive Hunter consists of actually apprehending your suspects. This is where the game gets incredibly silly. When you find one of the bad guys, you have to shoot him once to disable him, then the game switches to a one-on-one fighting mode. The fighting in Fugitive Hunter is the very definition of button mashing, as the easiest way to win is to hit your punch and kick buttons as fast as you can. There are a few ~super combo~ attacks you can pull off by hitting two buttons at the same time, but these are barely noticeable and don't add any depth at all to the fighting. What's worse, all of the fugitives--who come from a pretty wide array of cultures--have the exact same kung fu-style moves to use on you. From the ghetto to a Caribbean villa, all of the criminals will fight you in exactly the same way, and they all look equally dumb doing it. That's basically all there is to Fugitive Hunter. The game can be finished in just a few hours, and there's no incentive to play through it again. You can unlock a few videos to watch, but they aren't particularly worth working for. There's no multiplayer mode or other peripheral components to give the game extra value. Granted, Fugitive Hunter is debuting with a fairly budget price, but even then it just doesn't have much to offer. The nicest thing that can be said about the game's graphics is that they run at a consistently smooth frame rate. The environments are extremely basic, without much detail, and the character models are serviceable but not the slightest bit memorable. At least the guns look OK, but that's small consolation. The sound effects aren't quite so bad--they get the job done, but that's about it. Thankfully, the voice acting isn't too offensive. Finally, there's an interesting mix of music that's sometimes tolerable and sometimes completely ridiculous--the mission set in some unnamed 'hood features a rap song in which the lyrics ~Fugitive Hunter~ and ~PS2~ are clearly discernible. There's nothing at all remarkable about the gameplay, but there are plenty of things not to like. There's just not much you can say in Fugitive Hunter's defense. It's a short game with bland mechanics, repetitive levels, and almost zero replay value, and that's not even taking into account the total absurdity of getting into a fistfight with Osama Bin Laden. This one might be good for a rental if you want to see what a goofy spectacle it is, but if you're looking for a good first-person shooter on the PlayStation 2, stay far away."}