{"ref": "https://www.gamespot.com/reviews/super-paper-mario-review/1900-6168805/", "date": "April 9, 2007", "game_name": "Super Paper Mario", "text": "While Mario's proper 3D Wii adventure is still a ways off, Nintendo and developer Intelligent Systems have cooked up an engaging adventure to tide the plumber's fans over--Super Paper Mario. Although originally slated to be a GameCube release, Super Paper Mario has been shifted to the Wii to good effect. The unique game is a hybrid of platforming and role-playing that feels both new and familiar at the same time. The game has many of the aesthetics of the previous Paper Mario games and features an inventive story, eccentric characters, rock-solid gameplay, and genuinely funny dialogue. While the whole package isn't quite refined enough to attain classic status, Super Paper Mario is still a great game that stands among the Wii's best. Mario is back to save the day yet again. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Super Paper Mario Video Review The game's story revolves around Mario's attempt to stop the dastardly Count Bleck, a new villain to add to the plumber's rogues' gallery, who has set out to destroy all worlds. Oddly enough, Bleck's plot of destruction is fueled by the forced marriage of Princess Peach and Bowser, which he has arranged and which creates a ~chaos heart~ the count then uses to get his destruction on. In the ensuing chaos, Mario is transported to the interdimensional town of Flipside and asked to help stop Bleck. To halt the destruction of all worlds, Mario must collect eight objects called ~pure hearts~ to form the purity heart, which is an ancient artifact of great power and the only thing that can stop Bleck's plans. To find the hearts, Mario must venture to various worlds through dimensional doors conveniently located in Flipside. Each door can be opened only by using a pure heart, which sets up the game's linear structure. Each dimension comprises a chapter in the game and is broken up into four parts. The fourth part of each chapter ends in a boss fight and yields a heart if you win. As you collect the pure hearts, you'll meet up with the game's colorful cast of characters, which include a number of familiar faces and some new, helpful friends. The story is told through a hefty chunk of text, and despite the volume of content to read through, there's a sparkling sense of humor that is on par with the previous games in the series. Though Mario is the star of the game, you'll come to have four members in your party that you can switch between on the fly, though you can be in control of only one of them at any given time. Each playable character will feature a unique ability you'll need to use to progress. Mario gains the power to ~flip~ the 2D world around him into 3D, which lets him access new areas, avoid enemies, or see hidden items. The only limit to using the ability is an onscreen meter that counts down. If you stay flipped for too long, you'll lose one point of health, and the meter will begin counting down again. Princess Peach brings her mighty parasol into the mix. Besides allowing her to float during a jump, it can be used to defend against enemy attacks. The mighty Bowser is also along for the adventure and offers double the attack power of the other characters, as well as a fiery blast you can use to take out enemies or light things on fire. Finally, Luigi rounds out the party with his ability to leap to massive heights. Besides the unique abilities of your party members, you'll need to make use of new companions known as pixls. You'll collect the creatures as you explore the various dimensions in search of pure hearts. Each pixl will have a unique ability that is often key to progressing in the game. For example, Boomer the bomb pixl will let you take out obstacles that impede your progress, while Dottie shrinks you down to the size of an ant, which allows you to gain access to new areas or slip past foes who are oblivious to you. As with the playable characters in your party, you can have only one active pixl out at a time, but you can change them on the fly. The exception to this rule is Tippi, who is always around. Tippi is a butterfly-like pixl who serves as your guide in the game much like Navi in the Zelda games or Goombella in 2004's Thousand Year Door for the GameCube. Though the adventure is new, the gameplay is familiar. As mentioned, the action in Super Paper Mario blends elements of a platformer and a role-playing game into a unique package. The framework of the game is like a standard RPG. Though you have the set goal of collecting the pure hearts, you can talk to locals in Flipside and in other towns in the different chapters. These conversations lead to side quests or simply offer useful information you'll need later. You'll also find various shops where you can purchase items, get your fortune told, or even learn to cook. Though the town of Flipside appears to be fairly basic, once you gain Mario's ability to flip and start adding more pixls to your party, you'll find there's quite a bit to explore. When you set out to collect pure hearts and go through the various dimensional doors, Super Paper Mario feels more like a platformer. You'll go through levels on a 2D plane, whether it's running from one side of the screen to another or ascending straight up into the clouds. The levels even feature various power-ups that offer new twists on familiar items. Megastars transform you into a giant retro pixilated version of whichever character picks it up, while various colored flowers will speed you up or slow you down. Mario's flipping ability and the various pixls add a great deal of depth to the levels and make for some smartly designed and challenging puzzles. Seemingly dead ends become paths to new areas when you look at them flipped or use a pixl's ability. Combat takes place in real time, and you earn points by defeating enemies. Though your primary attack is the time-honored head stomp, you'll be able to use pixls or Bowser's flame attack as well. Your score doubles as your experience, so you can level up as you progress. Leveling up yields a specific bonus to your maximum hit points or attack power. Stats and experience are shared across your quartet, although Bowser has double the attack power of Mario, Luigi, and Peach. Items you can buy in shops can help take out enemies, restore your health, or temporarily increase your attack or defense in battle. One thing to call out about the game's combat is the inventive elements of boss battles. Whether it's an old-school Final Fantasy-style turn-based interface or a clever rip-off of a Japanese dating sim, Super Paper Mario's boss battles are funny and lively. The characters and pixls in your party all have unique abilities to help you progress. Moving around and attacking is a breeze thanks to the game's simple control scheme, which has you holding the Wii Remote sideways. You'll use the D pad to move your selected character, while the 1 button will trigger your active pixl's ability and 2 will let you jump. Hitting 1 and 2 at the same time calls up a quick menu that lets you switch characters, pixls, and use items. The A button triggers Mario's flipping ability, which you'll use often. The plus button calls up a more detailed menu that lets you check out various stats and inventory. Though the control scheme is decidedly old school, Super Paper Mario works in some unobtrusive support for the Wii Remote. You'll follow onscreen prompts when using some items in combat, such as shaking the remote up and down or holding it in specific positions. When jumping on enemies, if you shake the controller at the right moment you'll earn some bonus points. Pointing the controller at the screen when you have Tippi along will let you highlight items or objects. When your onscreen cursor turns red, you can hit any button to get useful information out of her. You'll also use the controller in simple minigames you'll come across. One thing to note is that, above and beyond the core story content, Super Paper Mario features a good assortment of side quests to undertake. You can collect recipes and character cards, visit a local arcade, and even get three additional pixls. While you can do some of this before finishing the game, you'll have the option to go back once you've finished the quest. Revisiting areas will let you continue some side quests you didn't finish and even take on some new ones. From a presentation standpoint, Super Paper Mario is a solid game all around, although its audio is a bit too low-key. The graphics have a simple charm and are big on little details and flair. The characters are eclectic and showcase a variety of art styles: The Mushroom Kingdom characters are a traditional-looking bunch that animate smoothly, while the interdimensional crew, which are new to the game, all have unique looks. The same holds true of the various dimensions you'll visit. Whether it's the surreal algebra equations written in the sky, the colored pixels of the Bitlands level, or the various places you see Nintendo hardware pop up in the game, the game has a unique style that works well. While the flipped locales come across a bit spare, their look fits with the game's modernized spin on 2D. At its heart, Paper Mario is a 2D game dressed, quite fetchingly, in some 3D. For videophiles looking for the optimal experience, Super Paper Mario supports 16x9 widescreen and 480p, though it looks fine on standard-definition televisions as well. The weakest element is the game's audio, which is a little too retro. Although the soundtrack is solid, there are no standout tracks. The sound effects are effective, albeit a bit too familiar. Voice is used too sparingly, though what's there fits the archetype set by the previous games. The unique flipping mechanic makes for some inventive puzzle designs. While Super Paper Mario is quite good, there are a few things that trip it up. The camera can sometimes be problematic when you use Mario's flipping ability. Besides making it difficult to see, the flipped view can make attacking enemies difficult because it's tough to line up for a jump. The game's pacing is also slightly offsome of the later levels rely a bit too much on navigating mazes or facing waves of minibosses. Though none of the shortcomings break the game, they certainly bog down the engaging experience some. In the end, while it's not quite on par with some of the other entries in the series, Super Paper Mario stands as an engaging and fun Wii game that's well worth your time. Though the minor camera and pacing issues as well as the underwhelming audio keep the game from being a totally polished experience, there's plenty to appreciate. Super Paper Mario's humorous story, accessible gameplay, inventive design, cool visual style, and impressive amount of content give it an undeniable charm. Anyone with a Wii should check it out. Combat takes place in real time, and you earn points by defeating enemies. Though your primary attack is the time-honored head stomp, you'll be able to use pixls or Bowser's flame attack as well. Your score doubles as your experience, so you can level up as you progress. Leveling up yields a specific bonus to your maximum hit points or attack power. Stats and experience are shared across your quartet, although Bowser has double the attack power of Mario, Luigi, and Peach. Items you can buy in shops can help take out enemies, restore your health, or temporarily increase your attack or defense in battle. One thing to call out about the game's combat is the inventive elements of boss battles. Whether it's an old-school Final Fantasy-style turn-based interface or a clever rip-off of a Japanese dating sim, Super Paper Mario's boss battles are funny and lively. The characters and pixls in your party all have unique abilities to help you progress. Moving around and attacking is a breeze thanks to the game's simple control scheme, which has you holding the Wii Remote sideways. You'll use the D pad to move your selected character, while the 1 button will trigger your active pixl's ability and 2 will let you jump. Hitting 1 and 2 at the same time calls up a quick menu that lets you switch characters, pixls, and use items. The A button triggers Mario's flipping ability, which you'll use often. The plus button calls up a more detailed menu that lets you check out various stats and inventory. Though the control scheme is decidedly old school, Super Paper Mario works in some unobtrusive support for the Wii Remote. You'll follow onscreen prompts when using some items in combat, such as shaking the remote up and down or holding it in specific positions. When jumping on enemies, if you shake the controller at the right moment you'll earn some bonus points. Pointing the controller at the screen when you have Tippi along will let you highlight items or objects. When your onscreen cursor turns red, you can hit any button to get useful information out of her. You'll also use the controller in simple minigames you'll come across. One thing to note is that, above and beyond the core story content, Super Paper Mario features a good assortment of side quests to undertake. You can collect recipes and character cards, visit a local arcade, and even get three additional pixls. While you can do some of this before finishing the game, you'll have the option to go back once you've finished the quest. Revisiting areas will let you continue some side quests you didn't finish and even take on some new ones. From a presentation standpoint, Super Paper Mario is a solid game all around, although its audio is a bit too low-key. The graphics have a simple charm and are big on little details and flair. The characters are eclectic and showcase a variety of art styles: The Mushroom Kingdom characters are a traditional-looking bunch that animate smoothly, while the interdimensional crew, which are new to the game, all have unique looks. The same holds true of the various dimensions you'll visit. Whether it's the surreal algebra equations written in the sky, the colored pixels of the Bitlands level, or the various places you see Nintendo hardware pop up in the game, the game has a unique style that works well. While the flipped locales come across a bit spare, their look fits with the game's modernized spin on 2D. At its heart, Paper Mario is a 2D game dressed, quite fetchingly, in some 3D. For videophiles looking for the optimal experience, Super Paper Mario supports 16x9 widescreen and 480p, though it looks fine on standard-definition televisions as well. The weakest element is the game's audio, which is a little too retro. Although the soundtrack is solid, there are no standout tracks. The sound effects are effective, albeit a bit too familiar. Voice is used too sparingly, though what's there fits the archetype set by the previous games. The unique flipping mechanic makes for some inventive puzzle designs. While Super Paper Mario is quite good, there are a few things that trip it up. The camera can sometimes be problematic when you use Mario's flipping ability. Besides making it difficult to see, the flipped view can make attacking enemies difficult because it's tough to line up for a jump. The game's pacing is also slightly offsome of the later levels rely a bit too much on navigating mazes or facing waves of minibosses. Though none of the shortcomings break the game, they certainly bog down the engaging experience some. In the end, while it's not quite on par with some of the other entries in the series, Super Paper Mario stands as an engaging and fun Wii game that's well worth your time. Though the minor camera and pacing issues as well as the underwhelming audio keep the game from being a totally polished experience, there's plenty to appreciate. Super Paper Mario's humorous story, accessible gameplay, inventive design, cool visual style, and impressive amount of content give it an undeniable charm. Anyone with a Wii should check it out."}