{"ref": "https://www.gamespot.com/reviews/fading-shadows-review/1900-6197670/", "date": "September 12, 2008", "game_name": "Fading Shadows", "text": "Somewhere between Marble Madness and Myst there is Fading Shadows. In it, you must roll a sphere through a fantasy world, solving puzzles and avoiding hazards all the while. It's a fresh combination of tried-and-true gaming elements that, when it works, is very absorbing. Unfortunately, a few significant issues prevent Fading Shadows from being the magical adventure it could have been. The game tells its tale through a series of images unaccompanied by any text or narration. The admittedly lovely artwork isn't capable of telling the story on its own, so if understanding why you're rolling an orb through a fantastical world is important to you, you'd best read the manual. Fortunately, understanding that the kingdom is on the brink of ruin and that all hope rests on a young boy whose coming was foretold ages ago isn't necessary to enjoy the game. Nor is wrapping your head around the idea that said boy's soul has been encased in a protective sphere that you must guide to the Castle of Heaven to save the land. A tightly focused beam will help you maintain control of the orb in dangerous locations such as this one. Don't expect to encounter Master Gardal or any of his vile minions on your journey, though. There are no enemies to contend with, nor friends to aid you on your quest. This is a pleasantly solitary adventure--just you, the orb, and the environmental puzzles and hazards provided by each of the game's levels. In navigating those hazards, you don't actually control the orb itself. Instead, you control a pillar of light that the orb follows around. You can focus the light into a beam of scorching intensity or diffuse it to a gentle glow. The more focused the beam, the stronger its pull on the orb will be; if the beam is fully focused, the orb will follow it directly and rapidly, while a less intense beam will exert a gentler pull on the orb, or no pull at all. It's an unusual control scheme that takes a little time to get used to, but it soon starts to feel natural. It comes into play in many of the game's puzzles and hazards, and it works well, most of the time. There's a kind of rock-paper-scissors aspect to the game in that the orb can assume three different states. The orb begins in a metallic state, in which it can withstand even the most focused beam and can be made to jump with a blast from the beam. However, it rusts quickly in water. At any time, you can push the triangle button to turn the orb to glass. A glass orb will not rust in water but will be quickly shattered by a focused beam or a long fall. Lastly, there are platforms in many levels that will transmute the orb into wood, in which state it can float in water but will be burned if the beam of light is too focused. These simple elements provide the building blocks for the bulk of the game's puzzles, which are usually intricate enough to make you stop and think, but reasonable enough so as not to utterly frustrate you. It's about figuring out how the pieces fit together, and you can take as much time as you want to work out what needs to be done in a given level. When all of Fading Shadows' best elements click, it becomes an adventure you can really lose yourself in. Unfortunately, the game doesn't always play to its strengths, and the frustrations pile on until they all but destroy the serene, compelling spell the game casts when it's at its best. Many of the game's levels involve a bit of tricky maneuvering, which is usually fine. It can be fun to roll the orb along a precarious precipice or make a daring leap. But on occasion the game presents you with diabolical platform-jumping sequences that require more speed and precision than the unorthodox control scheme allows for. These terrible sections feel out of place and are totally contrary to the relaxing vibe the game sometimes manages to establish. In the later stages, the game also starts placing more of an emphasis on timed elements--gates that stay open only for a brief period, platforms that quickly retract--and this, too, ruins the magic. This game works best when you can relax and lose yourself in it, so it's unfortunate that the pressure created by the timed aspects pulls you right out of it. Perhaps worst of all, the game's camera is a near-constant source of difficulty. You'll frequently have to wrestle with it to get it into a decent position, and there are times when, try as you might, you just can't get a good angle on the action, which can prevent you from spotting a vital environmental clue or send your orb plummeting to its demise. Fading Shadows is no technical showpiece, but the visuals nonetheless have a certain beauty to them. The game's varied environments, ranging from crumbling villages to elegant castle interiors, create a melancholy mood of a fantasy world on the brink of ruin. The ethereal music suits the overall tone of the game quite well, but there are only a scant few tunes that repeat endlessly, so what starts out as soothing winds up being maddening. What clever fiend could have come up with this diabolical pattern? The game's 40 levels will take most players around five hours or so to complete. There's not much replay value here; there are hidden puzzle pieces to collect as you progress, but you can easily grab most of those on your first play-through, and all you get for collecting them is the ability to view three pieces of artwork. There's also a wireless multiplayer mode in which you and your opponent race through a level to see who can complete it first, but it's not very interesting. Perhaps if you could interact directly with your opponent, colliding your orb into your opponent's to slow it down, there may have been some excitement to it, but as it is, your opponent's orb appears only as a transparent ghost, so it's rather dull. There's a good deal to appreciate in Fading Shadows. It's an unusual concept that, at its best, is compelling. Unfortunately, camera issues and poor level design choices pop up too frequently, upsetting the delicate balance of simple yet absorbing puzzle adventure gameplay that the game occasionally manages to achieve."}