{"ref": "https://www.gamespot.com/reviews/tony-hawks-pro-skater-3-review/1900-2853588/", "date": "March 7, 2002", "game_name": "Tony Hawk's Pro Skater 3", "text": "As far as skateboarding games are concerned, Xbox owners can now consider themselves fully up to speed. Last year's release of Tony Hawk's Pro Skater 2X seemed almost silly in light of Tony Hawk's Pro Skater 3 already being available on other consoles, but after only a few short months, the latest and greatest that the Tony Hawk series has to offer is now available on Microsoft's console. Anyone who hasn't already played THPS3 on another console is in for a treat. For those of you new to the series, the Tony Hawk's Pro Skater games put you on a skateboard and in a level with goals to accomplish. As you accomplish these goals, which range from simple score targets to more difficult skateboard trickery of the ~How the heck am I supposed to get all the way up there?~ variety, more levels are opened up. The game isn't exactly the most accurate simulation of skateboarding in the world, as it has some pretty outrageous physics and lets you get away with things that make Tony Hawk's much-lauded 900-degree spin look commonplace by comparison. As the series has progressed, it has gotten more and more combo-friendly, conceivably letting you continually do one string of tricks around the entire level, lasting the entire length of your two-minute run. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tony Hawk's Pro Skater 3 Video Review Like the previous Tony Hawk game, THPS3 features a collection of professional skaters. The roster hasn't changed much this time around--still on board are Steve Caballero, Kareen Campbell, Rune Glifberg, Eric Koston, Bucky Lasek, Rodney Mullen, Chad Muska, Andrew Reynolds, Geoff Rowley, Elissa Steamer, Jamie Thomas, and of course, Tony Hawk. Bob Burnquist, who was in Tony Hawk 2X, is not in Tony Hawk 3, as he has jumped ship over to Konami's ESPN-licensed skateboarding game. Replacing Bob is Bam Margera, perhaps most famous for his dad-beating antics on MTV's ~Jackass~ and his self-produced CKY videos. The create-a-skater and create-a-skate park modes have also been expanded quite a bit this time around. In create-a-skater, you can select different faces, skin tones, hairstyles, heights, and weights. Once you've got the base down, you can decorate your skater with different shirts, pants, shorts, shoes, socks, helmets, pads, glasses, hats, tattoos, watches, bracelets, and more. The pro skaters can be edited to a certain extent, so you can add hats and remove or change shirts if you so desire. You can also create female skaters. Rounding out the skater lineup is a collection of wild and, in some cases, completely unexpected hidden skaters, each of whom has a few new special tricks. Additionally, the Xbox version of Tony 3 contains a new hidden skater not found in other versions of the game. While the skaters may look different and start with different stats and tricks, you can configure their tricks (both normal and special) and stat points in any way you see fit. The level editor is more varied and lets you be far more productive. In Tony Hawk's Pro Skater 2X, you could combine grinds and other street-style tricks by manualing (in essence, popping a wheelie on your board) just as you touched ground. But there was no way to work vert ramps into the middle of a combo, only the end. As a result, the game became a little one-dimensional, as everyone simply looked for the longest grind lines and ignored ramps almost entirely. Tony Hawk 3 remedies this imbalance by adding a trick called the revert. The revert is a quick 180 spin that is done just as your skateboard touches the ramp when you're coming down from vert or lip tricks. Doing the revert lets you pop up into a manual, after which you can roll over to something else to do more tricks. Just as the manual revolutionized the Tony Hawk world back in Tony Hawk 2, the revert does the same here in Tony Hawk 3. The combo potential of other moves has also been increased. You can now move from one grind to another without actually leaving the rail. Lip tricks also work the same way. Some kick tricks can be doubled or tripled by quickly doing the trick two or three times--holding left and tapping the x button three times, for example, does a triple kickflip. Other less-noticeable combos are also included. Doing a kickflip and immediately hitting right and grab afterward gives you a new trick--in the eyes of scoring, anyway--called ~kickflip to indy.~In addition to all the new trick enhancements, the game's levels have improved. Some of the levels are based on actual locations, like Skater Island, an indoor skate park in Rhode Island, which serves as the game's second competition level. Most of the levels are rather large and significantly more interactive. The most dramatic example is the Los Angeles level, where you'll start an earthquake that rattles a freeway apart, giving you new places to skate. The game is packed with tiny cutscenes that play with the completion of some goals, showing you dumping snow onto a bully, making a car fall off a freeway onto the surface streets below, causing a cruise ship to deploy its safety nets, or activating a satellite dish by clearing away branches from its power lines. The Xbox version contains an exclusive oil rig level that isn't in other versions of the game, but it can be used only in the game's noncareer modes. The goal structure in the game remains largely the same, with each noncompetition level containing nine goals. Three of those goals are score based, one involves finding a hidden videotape stashed somewhere on the level, and the rest involve collecting items, breaking items, and doing specific tasks. For example, in the Canada level, you have to ~get Chuck unstuck.~ Poor Chuck has his tongue stuck to a frozen pole, and skating into him is the only way to rip his tongue off the pole. Some goals have two parts: In the airport, you have to deliver plane tickets from the counter to the gate. So first you have to grab the tickets; then you have to make it all the way down to the gate to deliver the tickets. Two goals change depending on your chosen skater. Each level has a trick-specific goal. So with a vert skater, you might have to do a cannonball over a half-pipe, but a street skater will have to find a specific rail and do a 50-50 grind on it. The letters that spell the word ~skate~ also must be collected in each level, and there are a handful of different configurations for these letters in each level, which change depending on the skater you're currently using. In addition to the standard goal-based levels, Tony Hawk 3 has three competition levels that score you based on how well you can do on a one-minute run. Doing well here gives you a gold medal and opens up the next level. Every level has a few optional items in it as well. Five stat points and a new deck are in every level, and their placement changes from skater to skater. Earning stat points is crucial, because certain level goals later in the game will be significantly more difficult if you haven't become powerful enough. Stat points can be placed in any category and can be rearranged at any time. Stat categories include rail, lip, and manual balance, as well as ratings for your ollie, air, hang time, spin, switch-skating ability, and speed. Each time you complete the game, you're given some new things to play with. Earning three gold medals gives you a new video to watch. Most of the videos are standard biographical stuff for the pro skaters, combined with footage of them skating. Like in the previous games, the hidden and created skaters unlock other videos, such as footage of the pros bailing and lots and lots of footage of the Neversoft team goofing around. Needless to say, the mammoth storage capacity of the DVD format doesn't go to waste here. Aside from the main career mode, you can skate around any level with no time limit or skate a single two-minute session on any level in an attempt to set one of the many records that the game keeps track of for every course. The nicest mode addition is a brief tutorial that shows you the basics of the game--something that Tony Hawk 2 definitely could have used. The tutorial takes you through a step-by-step guide to the game, narrated by Tony himself. Here, you'll learn how to manual, how to revert properly, how to determine what makes good combos, and how to wall-ride effectively. It's brief, but it goes a long way toward making the game friendlier to first-time players.In addition to all the new trick enhancements, the game's levels have improved. Some of the levels are based on actual locations, like Skater Island, an indoor skate park in Rhode Island, which serves as the game's second competition level. Most of the levels are rather large and significantly more interactive. The most dramatic example is the Los Angeles level, where you'll start an earthquake that rattles a freeway apart, giving you new places to skate. The game is packed with tiny cutscenes that play with the completion of some goals, showing you dumping snow onto a bully, making a car fall off a freeway onto the surface streets below, causing a cruise ship to deploy its safety nets, or activating a satellite dish by clearing away branches from its power lines. The Xbox version contains an exclusive oil rig level that isn't in other versions of the game, but it can be used only in the game's noncareer modes. The goal structure in the game remains largely the same, with each noncompetition level containing nine goals. Three of those goals are score based, one involves finding a hidden videotape stashed somewhere on the level, and the rest involve collecting items, breaking items, and doing specific tasks. For example, in the Canada level, you have to ~get Chuck unstuck.~ Poor Chuck has his tongue stuck to a frozen pole, and skating into him is the only way to rip his tongue off the pole. Some goals have two parts: In the airport, you have to deliver plane tickets from the counter to the gate. So first you have to grab the tickets; then you have to make it all the way down to the gate to deliver the tickets. Two goals change depending on your chosen skater. Each level has a trick-specific goal. So with a vert skater, you might have to do a cannonball over a half-pipe, but a street skater will have to find a specific rail and do a 50-50 grind on it. The letters that spell the word ~skate~ also must be collected in each level, and there are a handful of different configurations for these letters in each level, which change depending on the skater you're currently using. In addition to the standard goal-based levels, Tony Hawk 3 has three competition levels that score you based on how well you can do on a one-minute run. Doing well here gives you a gold medal and opens up the next level. Every level has a few optional items in it as well. Five stat points and a new deck are in every level, and their placement changes from skater to skater. Earning stat points is crucial, because certain level goals later in the game will be significantly more difficult if you haven't become powerful enough. Stat points can be placed in any category and can be rearranged at any time. Stat categories include rail, lip, and manual balance, as well as ratings for your ollie, air, hang time, spin, switch-skating ability, and speed. Each time you complete the game, you're given some new things to play with. Earning three gold medals gives you a new video to watch. Most of the videos are standard biographical stuff for the pro skaters, combined with footage of them skating. Like in the previous games, the hidden and created skaters unlock other videos, such as footage of the pros bailing and lots and lots of footage of the Neversoft team goofing around. Needless to say, the mammoth storage capacity of the DVD format doesn't go to waste here. Aside from the main career mode, you can skate around any level with no time limit or skate a single two-minute session on any level in an attempt to set one of the many records that the game keeps track of for every course. The nicest mode addition is a brief tutorial that shows you the basics of the game--something that Tony Hawk 2 definitely could have used. The tutorial takes you through a step-by-step guide to the game, narrated by Tony himself. Here, you'll learn how to manual, how to revert properly, how to determine what makes good combos, and how to wall-ride effectively. It's brief, but it goes a long way toward making the game friendlier to first-time players.Completing every goal in the game with one skater unlocks something else, like a hidden skater, hidden level, or cheat mode. Once you've gotten the hang of the game and figured out all the goals a few times, beating the game should take around an hour, but the lure of hidden stuff combined with the varied placement of certain level items from skater to skater makes the game very replayable. The Xbox version of THPS3 duplicates the LAN play of the PlayStation 2 version, but not its online, Internet-based component. So if you happen to have your Xbox hooked up to a LAN full of other Xbox users, you'll be able to enjoy some fantastic four-player multiplayer. The game uses a standard PC-like model for finding games. When you select the system link option, you'll be taken to a list of active games on your network and have the option to host a game of your own. Hosting your own server means you call the shots when it comes to game and level selection, as well as banning unruly players. In addition to skating, you can chat by using an onscreen keyboard. Aside from free skate, there are a handful of games you can play in system link mode. Trick attack is a simple score-based battle. Graffiti was in previous Tony Hawk games, and it challenges you to mark more territory than your opponents by doing tricks on them. The pieces of the level you use for your trick are changed to your color. Anyone doing a higher-scoring trick on that object can steal the piece from you. King of the hill is a slight reworking of tag from THPS2, and it forces players to fight for a crown that changes hands whenever the king is bumped by another player. Whoever can hold the crown for two minutes (or more if the server operator decides to choose a longer time period) first wins. Slap! is the game's answer to Quake-style deathmatch. When two skaters collide, the faster skater knocks the other one down and earns one point. Whoever has the most points at the end wins. All these modes can also be played in a split-screen two-player mode. Horse, a multiplayer game that has been in all the Tony Hawk games, can be played only in this offline two-player mode. The multiplayer element of the game gives it a nearly infinite amount of replay value--provided you're on a LAN populated by other Tony Hawk players. In addition to playing amazingly well, Tony Hawk 3 looks terrific. Most of the jaggy edges found in the PlayStation 2 and GameCube versions have been smoothed out. The game is designed to run at 60 frames per second, and with few exceptions--such as anytime you skate near or through fog or smoke, causing the speed to take a serious hit--it does just that. The huge levels look great up close or at a distance, with nice-looking, colorful textures that look much sharper than their PS2 and GameCube counterparts. While some of the standard trick animations from the previous games in the series seem to be reused here, the tricks transition very well from one to the next, and the animation is both smooth and full of little nuances. For instance, spinning in the air while doing tricks looks way more realistic now, as the skaters' torsos actually twist separately from their legs. Even grinding and lip tricks look better now, as the skaters get a little twitchy as they try to keep their balance. A ton of new wreck animations have been added as well. These situational animations make bailing look a lot more realistic--and a lot more painful. Blood that streaks the sides of walls and ramps when you wipe out and remain in that spot for quite some time afterward definitely adds to the painful effect. This streaking blood and other decal-like features wreak havoc with the shadows, though, as the game seems to place the blood (or small scrape textures on the side of a quarterpipe and so on) over the shadow instead of under it. Another nice feature is the ability to look around at will by moving the right analog stick. You can even lock the camera in any position you wish, though it's obviously pretty difficult to skate while you're staring directly at the front side of your skater.Completing every goal in the game with one skater unlocks something else, like a hidden skater, hidden level, or cheat mode. Once you've gotten the hang of the game and figured out all the goals a few times, beating the game should take around an hour, but the lure of hidden stuff combined with the varied placement of certain level items from skater to skater makes the game very replayable. The Xbox version of THPS3 duplicates the LAN play of the PlayStation 2 version, but not its online, Internet-based component. So if you happen to have your Xbox hooked up to a LAN full of other Xbox users, you'll be able to enjoy some fantastic four-player multiplayer. The game uses a standard PC-like model for finding games. When you select the system link option, you'll be taken to a list of active games on your network and have the option to host a game of your own. Hosting your own server means you call the shots when it comes to game and level selection, as well as banning unruly players. In addition to skating, you can chat by using an onscreen keyboard. Aside from free skate, there are a handful of games you can play in system link mode. Trick attack is a simple score-based battle. Graffiti was in previous Tony Hawk games, and it challenges you to mark more territory than your opponents by doing tricks on them. The pieces of the level you use for your trick are changed to your color. Anyone doing a higher-scoring trick on that object can steal the piece from you. King of the hill is a slight reworking of tag from THPS2, and it forces players to fight for a crown that changes hands whenever the king is bumped by another player. Whoever can hold the crown for two minutes (or more if the server operator decides to choose a longer time period) first wins. Slap! is the game's answer to Quake-style deathmatch. When two skaters collide, the faster skater knocks the other one down and earns one point. Whoever has the most points at the end wins. All these modes can also be played in a split-screen two-player mode. Horse, a multiplayer game that has been in all the Tony Hawk games, can be played only in this offline two-player mode. The multiplayer element of the game gives it a nearly infinite amount of replay value--provided you're on a LAN populated by other Tony Hawk players. In addition to playing amazingly well, Tony Hawk 3 looks terrific. Most of the jaggy edges found in the PlayStation 2 and GameCube versions have been smoothed out. The game is designed to run at 60 frames per second, and with few exceptions--such as anytime you skate near or through fog or smoke, causing the speed to take a serious hit--it does just that. The huge levels look great up close or at a distance, with nice-looking, colorful textures that look much sharper than their PS2 and GameCube counterparts. While some of the standard trick animations from the previous games in the series seem to be reused here, the tricks transition very well from one to the next, and the animation is both smooth and full of little nuances. For instance, spinning in the air while doing tricks looks way more realistic now, as the skaters' torsos actually twist separately from their legs. Even grinding and lip tricks look better now, as the skaters get a little twitchy as they try to keep their balance. A ton of new wreck animations have been added as well. These situational animations make bailing look a lot more realistic--and a lot more painful. Blood that streaks the sides of walls and ramps when you wipe out and remain in that spot for quite some time afterward definitely adds to the painful effect. This streaking blood and other decal-like features wreak havoc with the shadows, though, as the game seems to place the blood (or small scrape textures on the side of a quarterpipe and so on) over the shadow instead of under it. Another nice feature is the ability to look around at will by moving the right analog stick. You can even lock the camera in any position you wish, though it's obviously pretty difficult to skate while you're staring directly at the front side of your skater.The soundtrack is a perfect mix of old and new material that crosses many genres. Bands on the soundtrack include CKY, Motorhead, AFI, Alien Ant Farm, Xzibit, KRS-One, Rollins Band, Redman, Del the Funky Homosapien, Ozomatli, and more. A playlist function lets you turn off tracks that don't fit your tastes, but the long soundtrack will almost certainly contain something you can skate to. In the event that it doesn't, you can select custom soundtracks from the sound options menu. It would have been nice to be able to mix the existing soundtrack with your own tunes, like Rallisport Challenge does, but you're forced to select either the standard music or one of your custom soundtracks. Like the previous Tony Hawk games, Tony 3 gets the sounds of skating down perfectly. You can hear the cracks in the sidewalk as you skate over them, different surfaces make different noises when you skate on them, and there is a seemingly unlimited number of cool little voice clips and other minor sound effects that really make the game come alive. Pedestrians throughout the levels will talk, some of them having funny conversations amongst themselves, while others will call out to you, telling you to ~bust something out~ and proclaiming that your tricks are ~dope~ when you do something nice right in front of them. The voicework is also absolutely hilarious. The kids in the Canada level talk with a Canadian accent, and their dialogue is peppered with the word ~eh.~ Security guards in the airport level and some of the people in the Los Angeles level tend to talk with a funny sort of ~Eddie Murphy doing an impression of an uptight white guy~ flavor, speaking very deliberately when they proclaim your tricks to be ~sick.~ The Tony Hawk series has always had style. The first game reinvented a genre and set off a series of clones and pretenders that still flood the market today. The second game refined the formula, but its higher level of difficulty and steeper learning curve turned off casual players. Tony Hawk's Pro Skater 3 brings it all together in one package that makes everything before it almost unplayable by comparison. The game has a lower level of difficulty at the beginning and some basic tutoring to appeal to new players but has enough hidden items and harder goals later on to keep the Tony Hawk experts interested as well. Add to that the greatly expanded and balanced trick system and, if you happen to be lucky enough to have the proper components nearby, a heavy dose of addictive system link play, and you've got a game that you'll be playing right up until the day that Tony Hawk's Pro Skater 4 is released, if not longer. Any Xbox owner who doesn't already own another version of the game would be crazy to not pick this one up.The soundtrack is a perfect mix of old and new material that crosses many genres. Bands on the soundtrack include CKY, Motorhead, AFI, Alien Ant Farm, Xzibit, KRS-One, Rollins Band, Redman, Del the Funky Homosapien, Ozomatli, and more. A playlist function lets you turn off tracks that don't fit your tastes, but the long soundtrack will almost certainly contain something you can skate to. In the event that it doesn't, you can select custom soundtracks from the sound options menu. It would have been nice to be able to mix the existing soundtrack with your own tunes, like Rallisport Challenge does, but you're forced to select either the standard music or one of your custom soundtracks. Like the previous Tony Hawk games, Tony 3 gets the sounds of skating down perfectly. You can hear the cracks in the sidewalk as you skate over them, different surfaces make different noises when you skate on them, and there is a seemingly unlimited number of cool little voice clips and other minor sound effects that really make the game come alive. Pedestrians throughout the levels will talk, some of them having funny conversations amongst themselves, while others will call out to you, telling you to ~bust something out~ and proclaiming that your tricks are ~dope~ when you do something nice right in front of them. The voicework is also absolutely hilarious. The kids in the Canada level talk with a Canadian accent, and their dialogue is peppered with the word ~eh.~ Security guards in the airport level and some of the people in the Los Angeles level tend to talk with a funny sort of ~Eddie Murphy doing an impression of an uptight white guy~ flavor, speaking very deliberately when they proclaim your tricks to be ~sick.~ The Tony Hawk series has always had style. The first game reinvented a genre and set off a series of clones and pretenders that still flood the market today. The second game refined the formula, but its higher level of difficulty and steeper learning curve turned off casual players. Tony Hawk's Pro Skater 3 brings it all together in one package that makes everything before it almost unplayable by comparison. The game has a lower level of difficulty at the beginning and some basic tutoring to appeal to new players but has enough hidden items and harder goals later on to keep the Tony Hawk experts interested as well. Add to that the greatly expanded and balanced trick system and, if you happen to be lucky enough to have the proper components nearby, a heavy dose of addictive system link play, and you've got a game that you'll be playing right up until the day that Tony Hawk's Pro Skater 4 is released, if not longer. Any Xbox owner who doesn't already own another version of the game would be crazy to not pick this one up."}