{"ref": "https://www.gamespot.com/reviews/tony-hawks-pro-skater-3-review/1900-2880523/", "date": "October 18, 2002", "game_name": "Tony Hawk's Pro Skater 3", "text": "It's been just shy of a year since developer Neversoft first unleashed the third installment in its superb and popular Tony Hawk's Pro Skater series on the PlayStation 2. The game went on to appear on literally every current gaming platform, from the Game Boy Color to the Xbox. Now, six months after the release of the last version of Tony Hawk 3, Activision has finally brought the game to the Nintendo 64. While some might puzzle at the motivation or logic behind this release, N64 die-hards will be pleased to find that their console's swan song is affording them one more high-quality game to enjoy. Edge of Reality, the team responsible for the N64 port of Tony Hawk's Pro Skater 2, took on the duties of bringing Tony Hawk 3 to Nintendo's last cartridge-based console. The developer again has done a serviceable job of working around the more rustic hardware of the N64, using the same modified Tony Hawk 2 engine and alternate course designs of the PlayStation port of Tony Hawk 3. The Tony Hawk games have essentially been using the same formula since 1999, and Tony Hawk 3 does little to deviate from that trend. The formula is simple: You skate around levels, executing tricks for points, collecting items, and completing level-specific goals in order to progress to the next level. The gameplay options remain the same as in previous entries: Single-player modes include career, single session, and free skate, while multiplayer options include graffiti, where players attempt to mark the most sections of the level by doing high-scoring tricks on them; trick attack, a score-based competition; horse, a one-on-one best-trick contest; and tag, where players chase each other around the level, and the player who is ~it~ the longest amount of time at the end of the round loses. Tony Hawk 3 on the N64 introduces one important gameplay mechanic not found in its predecessor--a landing trick called the revert--but the game unfortunately does not include the dynamic handplants and grinds or the multiple kickflips found in the current-generation versions of Tony Hawk 3. However, this single addition alone has a profound effect on how the game is played. Just as the manual trick facilitated chaining together independent grind tricks in Tony Hawk 2, the revert makes it possible to chain multiple vert tricks into a single combo. This works by pressing the right shoulder button as soon as you land a vert trick, after which you can change into a manual and move on to your next trick. It's a bit disappointing that some of the gameplay changes included in other versions of Tony Hawk 3 didn't make it in, but truthfully, the revert is by far the most significant of these changes, and it's been reproduced faithfully in the N64 version of the game. Unfortunately, many of the other big changes that the Tony Hawk games have made since Tony Hawk 2, like the destructible environments, pedestrian and automobile traffic, and extensive create-a-skater options, have been stripped out of Tony Hawk 3 for the N64, leaving few core differences between it and its immediate predecessor. The absence of these features has dictated a lot of changes to the general level designs in Tony Hawk 3. They do remain technically sound and fun to skate, but much of the atmosphere of the different settings, such as the streets of Los Angeles or an international airport terminal, is lost in the process, leaving a lot of the levels feeling less like actual locations and more like themed skate parks. The lack of foot or street traffic in these larger levels can make them seem like ghost towns. This is sure to be the last version of Tony Hawk 3 to hit the market, but it's by no means the most graphically impressive of the bunch, and it remains on a par with the N64 rendition of Tony Hawk 2. As you might expect from an N64 game, the whole affair looks very last-generation, with the limited polygon-pushing capabilities of the hardware, the noticeable draw-in distances, and the telltale fuzziness of an N64 game. But, these limitations aside, the game does a sufficient job of bringing the Tony Hawk 3 experience to the platform, retaining a steady-enough frame rate and much of the same high-quality animation. Tony Hawk has generally made his home on disc-based consoles, where generous storage capacity allows for an abundance of high-quality digital audio, so a lot of sacrifices have been made to the sound design in bringing Tony Hawk 3 to the N64, though it still manages to keep the feel of a Tony Hawk game. The soundtrack has been pared down to six songs, including tracks by Motorhead and The Ramones, and the songs themselves have been cut up into a couple of sections and subsequently looped. The different skating sounds, like clinking off a rail or grinding a curb, are sufficient, but the ambient environmental sounds are very sparse, and the audio in general had to be compressed pretty severely to fit everything onto the N64 cartridge, leaving the game sounding dull and muddled. If you've already moved on to the current generation of gaming hardware, as most avid gamers have, you'll likely have a hard time coping with the technical shortcomings of this particular version of Tony Hawk 3, despite its underlying playability. So if you have the option of playing it on a newer console, you should take it. It's true that consoles don't age well, and on several levels this game simply cannot compete with the action-packed sports games coming out on other consoles right now. But stubborn N64 owners out there should take notice of Tony Hawk's Pro Skater 3, as it represents one of the best skateboarding games the platform has to offer and is quite possibly the last game the platform will offer, period."}