{"ref": "https://www.gamespot.com/reviews/raven-squad-review/1900-6216622/", "date": "September 1, 2009", "game_name": "Raven Squad: Operation Hidden Dagger", "text": "Plenty of games feature mediocre voice acting, but few approximate the pain of driving a railroad spike into your ear canal. If you value sonic comfort, it's best to overlook Raven Squad when you see it in the bargain bin, which is where you'll find this embarrassing squad-based shooter in a few months' time. And yes, it's really just a shooter. Though Raven Squad has been touted as a hybrid of real-time strategy and first-person shooting, it's simply a bad FPS in which you can issue a few commands to your two squads from a top-down view. An overhead camera view isn't enough to claim that your game possesses strategic elements, and Raven Squad is so incredibly linear, and so easy, that you could never mistake your actions as ~strategic~ or ~tactical.~ In addition, it is hard to look at and boring to play, so unless you're researching misleading advertising or offensive ethnic accents, you should stay far away from Raven Squad, lest it cause spontaneous aural bleeding. The idea of an RTS/FPS fusion is intriguing, but the ~new and unique genre~ advertised on the game's box is a complete misnomer. In spite of an overhead camera view from which you can issue some basic commands to your two three-man teams, Raven Squad is a squad shooter--and boy, is it a bad one. You can take control of any of your six men, and each has a standard weapon (like a boring SMG) as well as a specialized weapon (like a boring sniper rifle) in his arsenal. You've seen these weapons before, and none of them are satisfying to shoot, mostly due to the nonreaction of your Amazonian enemies as you riddle them with bullets. Your thickheaded foes generally stand there absorbing gunfire, showing no signs that they are bothered in the slightest until they drop down dead. There is no bloodshed, and there are no animations indicating the impact of bullets, so you have no idea whether or not you're even doing damage. This issue further exacerbated by the fact that some weapons don't seem to hurt your adversaries if you're far enough away, though you'd think that the SMGs and rifles in question would more than cover the distance. How thickheaded are these bad guys? They are so dumb that they don't try to take cover while getting shot, they run straight toward you while shooting, they ignore you as you walk right up to them, and they stay glued to the ground when you throw a grenade at their feet. Not that your squadmates will be receiving any diplomas, since they're equally dimwitted, wandering about aimlessly and trying to shoot enemies through walls. Yet as dense as your teammates are, you won't run into any challenges: Raven Squad, even on its highest difficulty settings, is remarkably easy. Your standard strategy works thusly: You rush directly at enemies and shoot them until they die. The mission design occasionally strays from this recipe, but you won't need to apply any thoughtful new tactics when this occurs. For example, you may need to defend civilians from enemy attacks for a period of time. To accomplish this objective, you can just park yourself at a turret and blast the small groups of enemies as they appear. In this circumstance, you spend more time waiting for enemies to emerge than you do shooting them. The ~real-time strategy~ part of the game is wholly marginalized. You command just these two units and usually need to move into the top-down strategic view only to see where enemies are hiding or to quickly move your squads from one location to another. You can issue an attack order, pick up ammo and health packs, and throw grenades from this view, but an overhead view does not an RTS make. The jungle maps you traverse are exceptionally linear, so each level is paced in much the same way. You shoot up some enemies, move into the overhead view to move your two squads to the next location, and zoom back into first-person view and shoot some more. You can try to make things more strategic by flanking your foes, but Raven Squad is such a cakewalk that you'll never need to do so. At least the transition between modes has been implemented extremely well. Zooming into first-person view and back to the top-down view is slick and simple, and the frame rate holds steady during the shift. In this cutscene, squad members turn their backs on you and shoot directly into that wall. Sadly, that transition is the only glossy element in an otherwise rough-looking, rough-sounding game. There's no overlooking the appalling voice acting. What with the dreadful deadpan of the assault team leader and an archaeologist's odious accent, Raven Squad's voice-overs may be the worst you will hear all year, and you'll want to head to the option menu to turn it down a few minutes in. Don't worry that you'll be missing out on any storytelling or deep characterization. A game in which the bad guys are called ~bad guys~ is clearly not interested in telling a story. There is no reason to care about any of your squad members and only the barest thread of a plot to keep you pushing forward, and the dialogue (~It's quiet. Too quiet.~) is the kind of tripe that was cliche decades ago. The ugly cutscenes don't veil these sins--they just shine a spotlight on the awful character models, atrocious facial animations, and ugly textures. Environments don't look as horrendous and the lighting is decent enough, but Raven Squad's visuals would have looked old four or five years ago. You could finish Raven Squad in around four hours. If you want to share the pain, you can ask a friend to join you in missions online, in which case each player controls a single squad. Cooperative play doesn't improve the action, but it all but removes the shallow RTS elements, since you only need to worry about your own squad when playing with others. Misery loves company, as they say, but it's better just to avoid misery altogether. To this end, don't bother with Raven Squad."}