{"ref": "https://www.gamespot.com/reviews/disgaea-5-alliance-of-vengeance-review/1900-6416255/", "date": "September 22, 2015", "game_name": "Disgaea 5: Alliance of Vengeance", "text": "Disgaea: Hour of Darkness is old enough by now to be considered an SRPG classic. Still the most famous game in Nippon Ichi Software's growing catalog, the title introduced players to the Netherworld and Celestia, two mystical realms populated by fallible angels and loveable demons. But that was twelve years and two console generations ago. It's easy to look at screenshots of the newest title in the series--still sporting grid-based combat and the same general art style on the PlayStation 4 as ever--and wonder if the franchise has anything worthwhile left to say.With Disgaea 5: Alliance of Vengeance, the development team proves it hasn't run out of new ideas. Numerous elements from past installments return, from general narrative themes to time-worn mechanics, and the ability to design your own maps to challenge friends and strangers online, mostly without ever feeling like a copy-paste job. The usual elements are all still here, but they're augmented by numerous new systems that should surprise even franchise veterans. In fact, the game's primary weakness is that there's now more to see and do than feels practical.In general, the game progresses the same way Disgaea games always have: players meet a group of semi-heroic demons and guide them through battles, with heaps of anime-influenced dialogue filling in the plot between each strategic skirmish. A series of five or so battles serves as an episode, and then there's a preview of coming events before the process repeats. What made the routine feel so special in the past was the customization between each fight, when you were tweaking your characters and purchasing equipment and diving into optional battles in the rewarding ~Item World.~With Disgaea 5: Alliance of Vengeance, the development team proves it hasn't run out of new ideas.Disgaea 5 tweaks all of that to make it feel the slightest bit more epic. The adjustments start with the ambitious story arc, which revolves around a strong demon named Killia who reluctantly falls in with Seraphina, a beautiful vixen--and also overlord--who fixates on her new friend because he somehow is able to resist her coquettish charms. Their ranks soon swell with the introduction of additional overlords, many dragging along some emotional baggage that is explored fully in due time. Together, the unlikely group of companions forms an alliance and seeks to defeat Lord Void Dark, a villain who apparently won't rest until he has obliterated every netherworld in existence.Most episodes introduce new netherworlds instead of new regions within a given world, which seems like a small thing, but still manages to raise the stakes compared to past games within the series. Rather than returning to a castle after each battle, the heroes jet about the universe in a huge craft that serves as the level hub. Between stages, you'll wander that vessel, purchasing equipment or talking to NPCs or your friends. Often, the latter will appear with a red ~!~ over their heads, indicating you should expect a brief comedic skit. There's no voice work here, and no animation, but the artwork and clean translation do an effective job of conveying everything and reinforcing character traits in a way that pre-battle chatter cannot. The result is a crew of characters that's more likely to stick with you than any the series has introduced since the PlayStation 2 era.A lot of the game's other enhancements are more specific. Many of them concern the Item World, which isn't accessible until you've cleared several episodes. All of a sudden, you have a compelling reason--and the means--to venture into that endless dungeon. You'll battle monsters on randomly generated floors until you conquer an ~item general,~ and whether you continue afterward is up to you. Returning fans will recall that the Item World is the single best way to level up characters and overcome roadblocks in the game's proper story campaign. That's truer now than ever before.Every few floors, especially as you venture deeper into a given item's world, or after talking to a certain character and revising your path, you'll encounter random events. A goddess might fly by and drop an egg, which produces one of several characters. A Level Fish boosts your items when you clear floors, but only if one of your team members gets to it before enemies do, and protects it for a couple of turns before you ascend to the next floor. Or you might encounter a Stout Bottle that runs around on the map. You can obtain ~Evilty~ scrolls if you beat him, which in more peaceful times allow you to teach skills or passive abilities to one of your party members. There are other characters, as well, including an overpowered foe that can kill you in one hit if you don't find a way to escape within the first turn or two.The Item World also plays host to invasions, where you can destroy a hostile to eliminate an area effect it casts on the field. You also gain parts that you can attach to your own vessel, and you can summon it to battle to aid you as you journey further into an item. Naturally, there are also plenty of random rooms, and these offer the chance to obtain precious loot, face a challenging battle, or even just take a breather. It's possible to spend dozens of hours within the various Item World stages and still not see everything.Returning fans will recall that the Item World is the single best way to level up characters and overcome roadblocks in the game's proper story campaign. That's truer now than ever before.There's another new feature called Squads. As you progress through the campaign, you'll eventually meet certain requirements and divide your characters into specialized groups. Doing so doesn't mean you have to rely on a particular squad in battle, but each team member gains different perks. For example, members in one unit will gain experience points without battling, as long as their leader is out in the field and doing damage. Another can learn the ability to capture weakened enemies, which another squad can then interrogate back at base. From there, it's possible to recruit a former enemy to serve as your ally.Even after you clear the main campaign, you can keep playing and continue unlocking new squads and characters and maps and episodes. Well ahead of that, there also are side quests to keep you busy. Talk to a particular character and he will reward you when you defeat enough of a certain enemy, or gather certain rare items, for example. Then there's the ~Character World,~ which sounds like the Item World but actually plays more like Mario Party, complete with items you can use to get the drop on enemies while you try to avoid landing on spaces that will impose a penalty.The game and its numerous systems are a complete time sink that allows you to spend dozens of hours building your perfect character, and then tempt you to do it again a few more dozen times. Disgaea 5 is the biggest and most satisfying installment in the series to date, and It could easily be the last one you ever need to buy."}