{"ref": "https://www.gamespot.com/reviews/randal-s-monday-review/1900-6415957/", "date": "November 15, 2014", "game_name": "Randal's Monday", "text": "We love point-and-click adventure games because of their uncanny ability to subvert both the written word and the interactivity inherent in games. They can tell stories using stimuli that books just dont have, be they tragedy or comedy. And they can tickle our brains even as they spin a narrative featuring hilarious, strong, memorable characters that stick with us for years. But we also hate these games because of how obtuse progressing through them can be, causing us to spend hours wandering around and using every last item we have on every last interactive element on every last screen. We give ourselves migraines as we attempt to decipher the broken logic of the developers. Yet even with all these fatal flaws, we still hold a rosy view of classic adventure games. Nexus Game Studio loves them, too. In fact, their latest game, Randal's Monday, oozes with love for this genre. Too bad that actually playing it will make you hate not only the genre but also games in general.Oh, the game seems appealing enough at first. The world of Randal's Monday is a nice-looking cartoony world that's still grounded in reality, something akin to any number of adult cartoons you see on late-night TV. And when you're set loose in this world, it doesn't take long for it to open up, giving you access to a city of respectable size to explore. It helps that all kinds of geek references litter the game. It's kind of neat to see references to Portal, The Twilight Zone, Super Ghouls 'n Ghosts, and Fraggle Rock all in the same game. Running around from place to place (made easier thanks to subway-based fast travel) makes for a downright pleasant experience  at least at first.Its love for the heyday of adventure games is immediately apparent from the get-go. The different-colored lines of dialogue and emphasis on humor feel like classic Lucasarts games out of SCUMM VM, and the way you progress through the game using a pile of seemingly random items is a direct analogue to King's Quest and its ilk. But for all its affection for this bygone era, Randal's Monday lacks the perspective to realize the deep flaws in this style of game, instead mindlessly charging ahead and aping their formulas wholesale while fixing hardly any of them.A great number of the solutions in the game make no logical sense unless you happen to be in the developers' heads. For instance, to bypass a certain lock, you don't have to find a key or even a lockpick. You need to take a small spring out of a broken radio and use a hammer on it to squash it lengthwise. Then, you need to take a clothes hanger and put it into a blender to cut the hanger to a bit of wire, which you can then combine with the squashed spring to make a lockpick to unlock the lock. Convoluted nonsense like this permeates the game even in its simplest solutions, like when you're supposed to use a baseball you just found to throw against the wall for ~hours~ to finally wear it down to reveal a pipe, something you wouldn't think of unless you tried using the ball on everything in the room, which seems to be what the game expects of its player: Try everything until it works. It's no wonder that the ~hint system~ in this game is just an explicit walkthrough.For all its affection for this bygone era, Randal's Monday lacks the perspective to realize the deep flaws in this style of game, instead mindlessly charging ahead and aping their formulas wholesale while fixing hardly any of them.At least the concept behind the game is somewhat original. The titular character comes into contact with a cursed ring that causes him to live the same Monday over and over again, much like Bill Murrays character in the movie Groundhog Day. Here, though, the things that Randal does each Monday persist, and reality bends to make the timeline make sense every new day. This makes for some bizarre situations, like a city infested with koala bears, but the game fails to make much interesting use of this conceit except as a framing device for wacky situations.The influence of Groundhog Day goes beyond the game's premise, though. Randal is a cynical, borderline sociopathic delivery man who has an arsenal of sarcastic comments ready to hurl at people laced with insults and geek references aplenty. In other words, he's an edgier Phil Connors for the gamer generation. But that's all there is to the character, which gives you very little to laugh at when each conversation he wanders into becomes abuse after abuse. And he barely grows as a person by the end, staying exactly as unlikable as he started. Worse, the supporting characters in this story are just like him, giving him cynical lip right back with a low hum of misanthropy. Watching everyone in the game be the same brand of terrible to each other isn't even remotely entertaining.As we know by now, adventure games are not doomed to be mere fossils. Telltale and many other devs have reimagined the genre in many new and exciting directions that honor the legacy of those that came before but without the design baggage that so plagued them in the first place. Randal's Monday is blind hero worship that ignores decades of design theory and leaves an unpleasant aftertaste thanks to its thoroughly unlikable, homogenous cast."}