{"ref": "https://www.gamespot.com/reviews/capcom-puzzle-world-review/1900-6165479/", "date": "February 6, 2007", "game_name": "Capcom Puzzle World", "text": "Capcom should have called Capcom Puzzle World ~Super Puzzle Fighter II Turbo and Friends.~ Even with just five games to its name, Capcom Puzzle World feels padded out by the inclusion of three mildly different Buster Bros. games, as much fun as popping bubbles can be. There's no doubt that Super Puzzle Fighter II Turbo, arguably one of the best competitive puzzle games ever, is the main draw here. This 10-year-old-plus puzzle game with its fighting game attitude and playful sense of style holds up beautifully. It has also been smartly modified to fit the widescreen aspect ratio of the PSP screen. Conversely, the other games in Capcom Puzzle World suffer by varying degrees in their translation to the PSP. However, most of these faults will likely only matter to hardcore purists, and this remains a highly playable and attractive puzzle package. They're not arcade perfect, but the Buster Bros. games are still fun and unique. In addition to Super Puzzle Fighter II Turbo, Capcom Puzzle World includes versions of Buster Bros., Super Buster Bros., Buster Buddies, and Block Block. Block Block is basically Capcom's take on the Breakout/Arkanoid/Alleyway style of puzzle game. You move a paddle at the bottom of the screen from side to side to bounce a ball into a formation of blocks on the upper portion of the screen, breaking them on contact. This is the one game in Capcom Puzzle World that hasn't been reformatted for the PSP, and because of its vertically oriented screen, the game appears pretty small on the PSP. In its original form, Block Block was a playable, if derivative, game, but bad controls kill it in Capcom Puzzle World. The problem lies in the fact that the arcade version included an analog rotary paddle controller, which gave you subtle, precise control over the horizontal movement of the onscreen paddle. On the PSP, the purely digital controls make the paddle excessively touchy and make the game essentially unplayable. The three Buster Bros. games included have a few problems of their own, but they're significantly less damaging. The Buster Bros. games have always been unique as far as puzzle games go. The games put you in control of a character that runs back and forth along the bottom of the screen while shooting a harpoon gun. This gun points straight up into the air and pops gigantic bubbles that bounce around the screen all willy-nilly. If you let a bubble touch your guy, it will cost you a life. What's more, every time you pop one of the giant bubbles, it splits into two smaller bubbles. This process continues until all the bubble spawn have been eliminated and you can move on to the next stage. You'll find power-ups that let you fire off multiple harpoons or turn your harpoon gun into a more traditional gun, as well as power-ups that stop time or provide you with a protective, one-use shield. The conceit remains unchanged among Buster Bros., Super Buster Bros., and Buster Buddies, though there are still some key differences. Super Buster Bros. introduces the panic mode, which does away with different levels, and makes simply surviving for as long as you can while being bombarded with wave after wave of bubbles your goal. Buster Buddies introduces unique characters that, in addition to having a crummy digitized appearance, have unique abilities, such as the ability to shoot harpoons at 45-degree angles or immunity to certain types of enemies. It seems redundant to have three Buster Bros. games in the collection, but these are fun games regardless. Yet, changes have been made to these games that will undoubtedly get under the skin of those who insist on arcade-perfect ports. Though the games are still quite challenging, the playfields have been stretched a little to fit the PSP screen more comfortably, which lets you maneuver in just a bit more horizontal room. The music, while still totally upbeat and catchy, uses different instrumentation. Again, these points will only matter to those who have invested hours and hours in the arcade originals. Super Puzzle Fighter II Turbo, the crowning jewel of Capcom Puzzle World, comes through with the gameplay unscathed and presentation that's actually enhanced. The core gameplay will be immediately familiar to fans of Tetris, Columns, Puyo Pop, or any other similarly styled puzzle game. You'll move and turn pairs of different-colored gems as they descend through the rectangular playfield, with the intention of positioning like-colored gems next to each other, using special, like-colored orbs to create chain reactions and clear them out. It's a solid, if derivative, system on its own, but what really makes it interesting is its competitive nature. Whether computer-controlled or a live player, you'll always be playing against an opponent. Whenever someone clears out gems from his or her field, it causes counter gems, which cannot be cleared for a number of turns, to drop into the opposing player's field. Players can do some damage control by trying to clear a number of gems before the counter gems have a chance to drop, which creates a wonderful back-and-forth dynamic that makes Super Puzzle Fighter II Turbo one of the most satisfying two-player puzzle games out there. The gameplay is rock-solid, but part of what makes Super Puzzle Fighter II Turbo so striking is how much it looks like a superdeformed Capcom fighting game, with two cutesy-looking fighters slugging it out in the middle of the screen. The roster includes Street Fighter favorites Ryu, Ken, Chun Li, and Sakura, as well as Morrigan, Hsien-Ko, Donovan, and Felicia from the Darkstalkers games. Although you never have direct control over the fighters, they sort of interpret the puzzle action, throwing fireballs and landing massive attacks whenever a player clears a number of gems. Because the game has been reformatted for the PSP's screen, there's more room in the middle for the fighters to do their little interpretive dance, which makes looking at the game much more enjoyable. The fighter you choose before a match also impacts the color pattern in which the counter gems will fall in the opposing player's field, but if you want to be especially diabolical, the game offers a counter gem edit mode. Super Puzzle Fighter II Turbo delivers a sublime combination of puzzle action and fighting game attitude. American fans of Super Puzzle Fighter II Turbo will especially appreciate the version included in Capcom Puzzle World because it is basically the Matching Service version that was released only on the Sega Dreamcast in Japan. This version includes alternate gameplay modes--one that doesn't rely on the special orbs to clear gems and another that causes the counter gems to rise up from the bottom. About the only disappointment to be had with Super Puzzle Fighter II Turbo here is that setting up an ad hoc wireless multiplayer game is a little counterintuitive, and there's no actual Internet play. As a totally random addition, there's an option in Super Puzzle Fighter II Turbo, as well as in the Buster Bros. games, to pause the action and take a screenshot that gets saved to your memory stick as a JPEG file and makes it suitable for use as wallpaper. There are plenty of valid faults to level against Capcom Puzzle World, but the inclusion of a really good version of Super Puzzle Fighter II Turbo more than makes up for those faults. The Buster Bros. games, while compromised, are still good fun as well, but if the Buster Bros. games are all you're interested in, you'll probably be a little disappointed. It might not deliver on the advertised world of puzzles, but Capcom Puzzle World is still one of the better choices for PSP puzzle fans."}