{"ref": "https://www.gamespot.com/reviews/outlaw-volleyball-review/1900-6071776/", "date": "July 16, 2003", "game_name": "Outlaw Volleyball", "text": "Though Simon & Schuster is a relatively new player in the field of console games, the publisher has already made a name for itself with Outlaw Golf, a surprisingly well-done golf simulation with some sleazy humor and a ham-fisted fighting system tacked onto it. In hopes of expanding the Outlaw name into a full-on brand, S&S has now brought Outlaw Volleyball to the Xbox, complete with online play via Xbox Live. Beach volleyball definitely seems like a more appropriate sport for the brand of tawdry high jinks that Outlaw Golf was aiming for, though much like in that game, the 'attitude' here isn't nearly as well executed as the actual meat of the game. This may be the cause of some annoyance among players simply looking for a good game of volleyball, but it will be less important to the particular crowd that Outlaw Volleyball is targeting. Outlaw Volleyball gives you a wealth of gameplay options right from the start, and there's a fair amount of unlockable content to keep you going as well. Outlaw Volleyball gives you a wealth of gameplay options right from the start, and there's a fair amount of unlockable content to keep you going as well. For a quick, straightforward game of volleyball, there's the exhibition mode, which allows one to four players to set a variety of play variables, including scoring conditions and the number of points needed to win, and play a game. For an even quicker game, there's the random play mode, which is identical to the exhibition mode, except that your characters are randomly selected for you. When you first get into Outlaw Volleyball, the selection of characters is limited to a meager four, though you can gain access to many more by playing through the game's lengthy single-player tour mode, which puts you through a series of five different competitions on each of the game's 10 courts. The new characters you'll unlock have better stats than the starting four, though you can enhance the skills of any of the available players by going through the drill mode. This mode is essentially a series of minigames designed to test specific skills, such as serving, spiking, bumping, and blocking, and though it sounds a bit like a boring tutorial mode, the minigames can be both challenging and entertaining. The game actually has a dedicated boring tutorial mode, which gives you a noninteractive overview of the game's basic mechanics. It's fairly informative, though it would've been nice if the game had allowed you to test out the mechanics before jumping into an actual game, and you'll likely get what you need faster by opening up the manual. The game's laserlike focus on the pubescent male demographic may deter players outside that specific age range. Also, unlike any of the other volleyball games on the market, Outlaw Volleyball features online play and downloadable content via Xbox Live. Our experience with Outlaw Volleyball online was fair, though there aren't an incredible number of people playing the game as yet, and we regularly experienced some stutters and pauses. Even still, the game deserves credit for being the only game of its type that's currently playable online. Outlaw Volleyball also gives you a fair number of options when it comes to the actual gameplay. There are a half-dozen options for the camera placement, though we found that the following camera, which rests behind the team that currently has possession of the ball and rotates dynamically from side to side, gave the best overall vantage point, despite the fact that it occasionally lags behind the action, creating a nauseating effect as it plays catch-up. Though the default is for one player on your team to always be controlled by the CPU, you can choose to alternate control between the two characters depending on who has possession of the ball, and under either setting you can change the character you're controlling while on defense with a quick tug on the L trigger. The core mechanics of the volleyball are pretty cut-and-dried, using an oscillating power meter to gauge your serves, using targets on the court surface to show where the ball is currently headed, and giving your spikes more power the longer you hold the button. In all, the gameplay is responsive, if a touch forgiving. Hard spikes are too easy to bump, and it's rare that you'll be unable to recover from a shot that ends up beyond the back line of the court, which makes for exceedingly lengthy volleys. The game mercifully gives you the option to kill the commentary and skip the characters' speaking parts. In keeping with the game's ~extreme~ presentation, there are a few specific mechanics in Outlaw Volleyball that set it apart from the other volleyball games on the market. Holding the R trigger will give you a short burst of speed, which is a helpful crutch early on, and downright necessary when you start playing against some of your tougher opponents. Your players have momentum meters that increase as you score points and can be tapped to perform high-powered spikes and serves, though the visual flourish given to these special attacks far outweighs their actual usefulness on the court. As you play, you'll regularly be given fight tokens, which can be activated just before a serve and put you and an opponent of your choice in a 2D fighting-game-style match. The player who wins the fight is given all of the other player's momentum. The fighting system is simple and clunky, consisting of a simple punch, a simple kick, and a simple block. Ultimately, all the gameplay mechanics that are used to set Outlaw Volleyball apart from other volleyball games, from the special attacks to the fighting system, feel like afterthoughts and don't really make the proceedings any more fun. If anything, they disrupt the pacing of the game and detract somewhat from the overall experience. At least you can toggle the fighting portion on or off. Outlaw Volleyball looks great, featuring highly detailed, well-animated character models and varied environment designs. The frame rate can chug a little bit from time to time, but not so severely that it really hurts the gameplay--it's usually very smooth. The characters have been one of the big selling points of the game, which features almost toxic levels of naughty, Maxim-style sex appeal. The female characters are voluptuous to an idealized extreme and clad in the minimum amount of skintight Lycra that the law will allow, and they jiggle in a way that probably isn't even possible in normal Earth gravity. You cannot deny the technical merits of Outlaw Volleyball, but the game's laserlike focus on the pubescent male demographic may deter players outside that specific age range. The problem with Outlaw Volleyball is that it's not really that bad at all, but there's potential here for a better game. The sound design in Outlaw Volleyball is dominated by the game's announcer, who is voiced by Steve Carell from Comedy Central's The Daily Show. Though Carell brings more than enough enthusiasm to the job, the lines he's forced to read are riddled with lame sophomoric comedy that falls flat more often than not and becomes annoying quickly. The sharp wit Carell has displayed on The Daily Show makes the humorless jokes that much more disappointing. The game's characters also contribute their fair share of lame one-liners--usually having something to do with the broad stereotype upon which that particular character is based--though the game mercifully gives you the option to kill the commentary and skip the characters' speaking parts. Aside from all the chitchat, Outlaw Volleyball sounds OK, with good ambient sound from the crowd and a serviceable soundtrack predictably made up of licensed pop-punk, techno, and hip-hop. You can also rip your own custom soundtrack if you want. Outlaw Volleyball is a pretty good game, though it could have been much better. The visuals are well done, the game mechanics work fairly well, and there are enough features and variety to keep someone engaged for a while. On the other hand, the game is filled with bad jokes and unnecessary frills, and the time spent on these elements could have probably been spent refining the game's more important qualities. At any rate, if you're looking for an online game of volleyball, it's nice to know that the only available option isn't a bad one. The core mechanics of the volleyball are pretty cut-and-dried, using an oscillating power meter to gauge your serves, using targets on the court surface to show where the ball is currently headed, and giving your spikes more power the longer you hold the button. In all, the gameplay is responsive, if a touch forgiving. Hard spikes are too easy to bump, and it's rare that you'll be unable to recover from a shot that ends up beyond the back line of the court, which makes for exceedingly lengthy volleys. The game mercifully gives you the option to kill the commentary and skip the characters' speaking parts. In keeping with the game's ~extreme~ presentation, there are a few specific mechanics in Outlaw Volleyball that set it apart from the other volleyball games on the market. Holding the R trigger will give you a short burst of speed, which is a helpful crutch early on, and downright necessary when you start playing against some of your tougher opponents. Your players have momentum meters that increase as you score points and can be tapped to perform high-powered spikes and serves, though the visual flourish given to these special attacks far outweighs their actual usefulness on the court. As you play, you'll regularly be given fight tokens, which can be activated just before a serve and put you and an opponent of your choice in a 2D fighting-game-style match. The player who wins the fight is given all of the other player's momentum. The fighting system is simple and clunky, consisting of a simple punch, a simple kick, and a simple block. Ultimately, all the gameplay mechanics that are used to set Outlaw Volleyball apart from other volleyball games, from the special attacks to the fighting system, feel like afterthoughts and don't really make the proceedings any more fun. If anything, they disrupt the pacing of the game and detract somewhat from the overall experience. At least you can toggle the fighting portion on or off. Outlaw Volleyball looks great, featuring highly detailed, well-animated character models and varied environment designs. The frame rate can chug a little bit from time to time, but not so severely that it really hurts the gameplay--it's usually very smooth. The characters have been one of the big selling points of the game, which features almost toxic levels of naughty, Maxim-style sex appeal. The female characters are voluptuous to an idealized extreme and clad in the minimum amount of skintight Lycra that the law will allow, and they jiggle in a way that probably isn't even possible in normal Earth gravity. You cannot deny the technical merits of Outlaw Volleyball, but the game's laserlike focus on the pubescent male demographic may deter players outside that specific age range. The problem with Outlaw Volleyball is that it's not really that bad at all, but there's potential here for a better game. The sound design in Outlaw Volleyball is dominated by the game's announcer, who is voiced by Steve Carell from Comedy Central's The Daily Show. Though Carell brings more than enough enthusiasm to the job, the lines he's forced to read are riddled with lame sophomoric comedy that falls flat more often than not and becomes annoying quickly. The sharp wit Carell has displayed on The Daily Show makes the humorless jokes that much more disappointing. The game's characters also contribute their fair share of lame one-liners--usually having something to do with the broad stereotype upon which that particular character is based--though the game mercifully gives you the option to kill the commentary and skip the characters' speaking parts. Aside from all the chitchat, Outlaw Volleyball sounds OK, with good ambient sound from the crowd and a serviceable soundtrack predictably made up of licensed pop-punk, techno, and hip-hop. You can also rip your own custom soundtrack if you want. Outlaw Volleyball is a pretty good game, though it could have been much better. The visuals are well done, the game mechanics work fairly well, and there are enough features and variety to keep someone engaged for a while. On the other hand, the game is filled with bad jokes and unnecessary frills, and the time spent on these elements could have probably been spent refining the game's more important qualities. At any rate, if you're looking for an online game of volleyball, it's nice to know that the only available option isn't a bad one."}