{"ref": "https://www.gamespot.com/reviews/dyscourse-review/1900-6416088/", "date": "April 3, 2015", "game_name": "Dyscourse", "text": "In the world of Dyscourse, I have a Bachelor of Fine Arts which has taken my career no further than the coffee shop. And while I might be an internationally renowned barista, I don't have the skill set to ensure surviving a plane crash on a remote island. Just a couple months past my 25th birthday, I certainly don't have the life experiences needed to manage a group of mentally unraveling survivors. But that's where the no-longer-proverbial tailspin of life has jettisoned me. I hold not only my survival in my hands as I fend off starvation, dehydration, wild animals, and the basest human survival instincts; I've become responsible for five other lost souls, and I don't know if I can handle this responsibility.It's raining, and we've been on this island for three days now. Teddy makes me uncomfortable. His paranoid delusions get worse every day. He's convinced that Garrett--the chubby, sad, and lonely gamer--conspired with the government to crash our plane. He insists that we build a signal to escape the island, but we have to take care of food and water first. We found water yesterday, but in his excitement, Garrett found himself covered in leeches, and he ran into a rock as he tore the bloodsuckers from his body. It will be a while before I forget the image of those parasites squirming on his body. But now, he won't stop babbling incoherently. He seems to think he's in a massively multiplayer game. I hope he isn't concussed.And Steve nearly died today. I think on some level he wanted to. His cigarette lit the jet fuel around the fuselage, and if he hadn't jumped at the last second, the rain would have put his fire out, but lightning struck the exact spot where he'd been standing. Steve looks like he needs a hug, though I wish he would stop pouting and do something productive. Not that Louise was any more helpful. I don't know where we'd be if it weren't for her husband, George. I think he's the only sane person left--besides me. Maybe I'll talk to him tonight before we go to bed. Wellwe'll talk if our shelter at the beach holds up. This storm is getting bad.That is just one of many stories that unfold in survival-adventure game Dyscourse. Imagine Lost as a cartoon in which Jack was a girl and all of the psychological issues of everyone else on the island were amplified to eleven, and you'll get a feel for the tone and style of Dyscourse. After crash landing on a remote island, you play as Rita--a girl whose personality and leadership style you're free to shape however you choose--and it's up to you to lead you and your fellow survivors to rescueif you can avoid being eaten by jaguars or dying of hunger first.Dyscourse is a game about choice and light environmental exploration. Although you're free to roam the island and engage in a handful of basic adventure-game staples--finding tools, solving simple puzzles--Dyscourse's best moments are of the ~choose your own adventure~ kind. For anyone frustrated by many of the false choices in Telltale's Walking Dead series, Dyscourse takes branching paths to nearly ludicrous lengths--though enough playthroughs will reveal the limitations of even this game's systems. You make difficult decisions at every turn. Do you search for water, or food? Do you rescue the flares that could signal rescue, or save a beloved survivor's life? Do you try to save a woman attacked by jaguars, or let her die to ensure your own survival? Dyscourse lets the consequences range from immediately apparent to long-term mercies and cruelties. The endings are limited to three major scenarios, but the details surrounding them feel nearly infinite.Beyond offering consistently anxiety-riddled conundrums for how you live on this island, Dyscourse succeeds on the back of charming and clever writing. Although every Dyscourse playthrough invariably takes a turn towards darkness--particularly the one where I intentionally made the worst decisions I could--the game's style is lighter than most survival fare, and I lost track of the number of times when the game made me laugh out loud. Although all the characters but Rita and kindly farmer George seem irreparably broken, you grow to care about your troupe of island-dwellers through the sincerity of the game's writing. It's unfortunate that Dyscourse takes cheap shots at Teddy's clear schizophrenia and plays it for the wrong sorts of laughs.The game's storybook visuals, where characters and environments feel like they were lifted from a felt-crafted stop-motion cartoon, may not initially appeal to you, but they work well within their context. In one playthrough, a character had his arm ripped off by a jaguar, and anything resembling realism would have destroyed the tone. The moment made me audibly gasp, and the severity of the game's situation hit home very quickly, but it wasn't unnecessarily and graphically violent.Dyscourse's writing and sense of place is so strong that when the game ends as suddenly as it does, it's natural to want even more. Any individual playthrough shouldn't take more than an hour or so. And though the game offers you many options on how to play, there's little reason to return after having seen all three major endings because you'll learn how to game the system to your favorthough in Dyscourse's defense, I never had a successful playthrough in which every survivors was rescued. My best playthrough still experienced two casualties.Dyscourse has charm and personality to spare, and though you can peel back the layers of its systems if you spend enough time replaying it, few games make your choices feel as meaningful and impactful as this one does. Throw in an excellent musical score, and it's not difficult to mark it as one of the most aesthetically pleasing titles of 2015 thus far. It's rare that I would want to spend more time on a desert island, but Dyscourse left me craving slightly more of those agonizing days and nights."}