{"ref": "https://www.gamespot.com/reviews/lego-star-wars-ii-the-original-trilogy-review/1900-6157750/", "date": "September 15, 2006", "game_name": "Lego Star Wars II: The Original Trilogy", "text": "Just like the umpteen other versions of Lego Star Wars, Lego Star Wars II: The Original Trilogy for the Nintendo DS is a kid-friendly action adventure game that depicts the exploits of Luke Skywalker and Han Solo out of plastic Lego bricks and people. The DS game retains much of the irreverent charm and play variety that its console and PC counterparts have, and it also flaunts some of the most detailed 3D objects we've yet seen out of the handheld. Fans and nonfans alike will appreciate that there are plenty of blaster fights and lightsaber battles to take part in, and there are even levels devoted to controlling Lego-constructed renditions of the Millennium Falcon and other familiar vehicles. Some rather unfortunate glitches do crop up now and again, but, thankfully, the game is designed so that these issues don't get in the way of completing missions. The Nintendo DS version of Lego Star Wars II: The Original Trilogy manages to surmount its flaws and provide a fun, satisfying experience. Scenes from the original Star Wars trilogy are rendered as plastic Lego toys. True to its title, the game lets you experience firsthand a number of key scenes from Star Wars, The Empire Strikes Back, and Return of the Jedi. In all, there are 16 missions. Approximately two-thirds of them involve running around on foot, shooting or hacking away at Imperial forces, and solving whatever puzzles you happen to come across. The rest involve piloting vehicles such as X-wing fighters and snowspeeders to re-create pivotal scenes such as the Death Star trench run and the battle of Hoth. Missions can be played as part of the story mode, which limits you to specific characters based on what took place in the corresponding film scene, or can be played in the free-play mode, which lets you change characters on the fly and generally gives you the freedom to explore each area at your own pace. Multiplayer features allow co-op play in the story and free-play modes, and there's a battle arena that lets as many as four players compete in a variety of game types. As you go through the game, you'll unlock dozens of playable characters, either by encountering them within the levels or by collecting the required number of minikits. When all is said and done, the full roster includes 65 characters and 14 different vehicles. Major characters like Luke, Chewie, and Darth Vader are present, as are numerous lesser characters, such as stormtroopers, Rebel troopers, and ewoks. Some characters, such as Dengar and Wuher, are so obscure that only diehard fans will recognize them. As if that weren't enough, you can create your own custom characters by mixing and matching a huge assortment of standard and Star Wars-inspired Lego parts. The gameplay itself is fairly standard for this type of action game, but the variety of things to do, coupled with the Star Wars subject matter and Lego-inspired nuances, prevents it from ever feeling too cookie-cutter or monotonous. Foot-based levels have you shooting or slicing dozens of sluggish stormtroopers while searching for a key that will let you open doors or use whatever objects are necessary to eventually leave the area. Vehicle-oriented levels, meanwhile, place you atop a speeder bike or in the cockpit of a fighter and let you roam 3D battlefields shooting away at obstacles and enemy craft such as AT-STs and TIE fighters. The 3D environments of the foot-based levels are large and designed to encourage exploration and experimentation with different characters. Switches, secret characters, and minikits tend to be placed in side rooms and atop ledges that can be reached only by alternating the use of specific characters' abilities. Although you can control only one character at a time, there are usually one or two other characters following you around that you can assume control of as the need arises. Different characters have unique abilities that come in handy in certain situations. Blaster characters, like Han Solo and Chewie, can shoot enemies from a distance and use their grappling guns to reach lofty spots. Jedi characters, such as Obi-Wan and Yoda, must use their lightsaber weapons at close range, but they can reflect enemies' blaster shots back at them and employ their force powers to stun enemies and to activate switches that non-Jedi can't. Droid characters can access computer panels or fly for short periods, small characters can shimmy into tiny crawl spaces, bounty hunters can open restricted areas, and so on. You don't have to worry about dying if you make a mistake, since losing all your life hearts only results in your character falling apart temporarily and the loss of a few Lego studs, which function as in-game currency. You can assemble Lego parts to create useful objects such as computer panels and gun turrets. Besides contributing to the game's overall look, the Lego concept has been integrated into the game in a practical way. The piles of Lego parts strewn around each level become computer panels and gun turrets once you assemble them (by holding the A button). You can then use these panels to unlock doors, or you can take control of the gun turrets to mow down entire groups of hapless stormtroopers. In some spots, Jedi characters can use the Force to move Lego objects around and create makeshift steps and bridges. It certainly doesn't hurt that each level does a wonderful job of re-creating its specific scene from the movie trilogy, and in a Lego-tinged manner no less. While working through the A New Hope missions, you can roam the corridors of Leia's Corellian Corvette, visit the cantina on Mos Eisley, and participate in the Death Star trench run. The Empire Strikes Back collection of missions includes a corridor-filled Echo Base, a battle scene on the surface of Hoth involving a snowspeeder and numerous AT-ATs, and a particularly striking rendition of Cloud City complete with dining room and carbon-freeze chamber. Wrapping up the trilogy, the Return of the Jedi episode lets you wander Jabba's palace and his sail barge, pilot a speederbike on the ewok-populated moon of Endor, and reenact the lengthy confrontation between Luke, Darth Vader, and the emperor aboard the second Death Star. Of course, the amusing twist is that everything looks like it was put together with LEGO bricks and people. LEGO tabs and panels are obvious on most walls and objects, and vehicles closely resemble the Star Wars-themed LEGO kits that you'll find on store shelves. When you blow a doorway to bits, it crumples into individual LEGO pieces. The same happens when characters die. There's no blood. Instead, stormtroopers and Rebels just fall apart. Crisp 3D graphics and a good use of transparency and reflection effects make this one of the nicer-looking DS games out there. The 3D graphics in the DS game aren't as slick as those found in the console versions, but they're impressive for a DS game. Objects and environments are highly detailed, characters are sharp and well defined, and the camera view shows a healthy chunk of the environment at any given moment. There are some eye-catching transparency and reflection effects to admire too, which are particularly evident in the mirrored floors of Cloud City. Noninteractive cinematic scenes help keep the story moving, though certain scenes, such as the confrontation between Luke and Darth Vader at Cloud City, have a very different emotional impact due to the whimsical look of the LEGO characters. High-quality music and sound effects--which sound just like John Williams' score and the effects used in the Star Wars movies--back up the action. There's no voice acting to speak of, unfortunately. The game's biggest shortcoming is that it shipped with a bunch of flaws and glitches that shouldn't have made it into the final product. Friendly characters controlled by the CPU will occasionally shoot you in the back for no reason. Poor camera angles can obscure enemies and make it difficult to judge the proper angle to successfully leap across a gap. Sometimes, the camera forgets to follow your character and lets you walk into the distant background without switching to a closer view of the action. That can make sequences requiring precision-jumping a chore. Clipping issues can cause objects and enemies to outright turn invisible in busier levels and make it possible to fall through the scenery in spots, although things generally pop back into view within a few seconds. There is a section outside Jabba's sail barge, however, where CPU allies can fall through walkways and skid to their deaths, and depending on their respawn location, they may get stuck in an infinite loop of death and revival. Thankfully, while these glitches are unseemly, they're intermittent and never get in the way of completing a mission. Between the infinite number of lives and the ability to swap characters on the fly, you can generally inch your way out of whatever unfortunate predicament the camera or clipping problems cause. Multiplayer features include co-op play in the story mode and a four-player battle arena. Those that can take advantage of the game's multiplayer features should definitely make it a point to do so. The co-op feature lets a second player accompany you during story and free-play levels. Not only is exploring levels with a friend more enjoyable than doing so with predictable CPU allies, but your friends are less likely to stand around and eat blaster fire, get caught in infinite respawn glitches, or shoot you in the back for no reason. The second player can join or leave your game at any time, which makes the whole process remarkably painless. Both players must have their own copy of the game to take advantage of the co-op feature, though. In addition to co-op play, there's a battle arena mode that as many as four players can take part in. There are a number of arenas to pick from, and you can select various game types, such as deathmatch and capture the flag. The arenas are set up like smaller versions of the regular levels, complete with grapple pads and gun turrets that you can assemble to gain an edge over your opponents. Unlike the co-op mode, the battle arena mode supports single and multicard link-ups, although the selection of characters and arenas is limited when only a single game card is used to initiate the link. LEGO Star Wars II: The Original Trilogy for the Nintendo DS is a rousing action adventure game that's packed with enough variety to satisfy fans and nonfans alike. The glitches are unfortunate, and they do make the game feel sloppy in spots, but not to the point that they take away from the game's fun or its wacky LEGO-inspired charm. Of course, the amusing twist is that everything looks like it was put together with LEGO bricks and people. LEGO tabs and panels are obvious on most walls and objects, and vehicles closely resemble the Star Wars-themed LEGO kits that you'll find on store shelves. When you blow a doorway to bits, it crumples into individual LEGO pieces. The same happens when characters die. There's no blood. Instead, stormtroopers and Rebels just fall apart. Crisp 3D graphics and a good use of transparency and reflection effects make this one of the nicer-looking DS games out there. The 3D graphics in the DS game aren't as slick as those found in the console versions, but they're impressive for a DS game. Objects and environments are highly detailed, characters are sharp and well defined, and the camera view shows a healthy chunk of the environment at any given moment. There are some eye-catching transparency and reflection effects to admire too, which are particularly evident in the mirrored floors of Cloud City. Noninteractive cinematic scenes help keep the story moving, though certain scenes, such as the confrontation between Luke and Darth Vader at Cloud City, have a very different emotional impact due to the whimsical look of the LEGO characters. High-quality music and sound effects--which sound just like John Williams' score and the effects used in the Star Wars movies--back up the action. There's no voice acting to speak of, unfortunately. The game's biggest shortcoming is that it shipped with a bunch of flaws and glitches that shouldn't have made it into the final product. Friendly characters controlled by the CPU will occasionally shoot you in the back for no reason. Poor camera angles can obscure enemies and make it difficult to judge the proper angle to successfully leap across a gap. Sometimes, the camera forgets to follow your character and lets you walk into the distant background without switching to a closer view of the action. That can make sequences requiring precision-jumping a chore. Clipping issues can cause objects and enemies to outright turn invisible in busier levels and make it possible to fall through the scenery in spots, although things generally pop back into view within a few seconds. There is a section outside Jabba's sail barge, however, where CPU allies can fall through walkways and skid to their deaths, and depending on their respawn location, they may get stuck in an infinite loop of death and revival. Thankfully, while these glitches are unseemly, they're intermittent and never get in the way of completing a mission. Between the infinite number of lives and the ability to swap characters on the fly, you can generally inch your way out of whatever unfortunate predicament the camera or clipping problems cause. Multiplayer features include co-op play in the story mode and a four-player battle arena. Those that can take advantage of the game's multiplayer features should definitely make it a point to do so. The co-op feature lets a second player accompany you during story and free-play levels. Not only is exploring levels with a friend more enjoyable than doing so with predictable CPU allies, but your friends are less likely to stand around and eat blaster fire, get caught in infinite respawn glitches, or shoot you in the back for no reason. The second player can join or leave your game at any time, which makes the whole process remarkably painless. Both players must have their own copy of the game to take advantage of the co-op feature, though. In addition to co-op play, there's a battle arena mode that as many as four players can take part in. There are a number of arenas to pick from, and you can select various game types, such as deathmatch and capture the flag. The arenas are set up like smaller versions of the regular levels, complete with grapple pads and gun turrets that you can assemble to gain an edge over your opponents. Unlike the co-op mode, the battle arena mode supports single and multicard link-ups, although the selection of characters and arenas is limited when only a single game card is used to initiate the link. LEGO Star Wars II: The Original Trilogy for the Nintendo DS is a rousing action adventure game that's packed with enough variety to satisfy fans and nonfans alike. The glitches are unfortunate, and they do make the game feel sloppy in spots, but not to the point that they take away from the game's fun or its wacky LEGO-inspired charm."}