{"ref": "https://www.gamespot.com/reviews/condemned-criminal-origins-review/1900-6140028/", "date": "November 18, 2005", "game_name": "Condemned: Criminal Origins", "text": "Raw, savage beatings are the order of the day in Condemned: Criminal Origins, an original first-person action game developed exclusively for the Xbox 360. You play as an investigator tailing a serial killer while struggling to keep your own sanity as you face off against what seems like an army of depraved sociopaths. Condemned's impressive graphics and bone-crushing hand-to-hand combat sequences make for a visceral, highly atmospheric experience that's quite unlike anything you've ever played before. But as great as that may sound, Condemned is also something of a one-trick pony, whose monotonous gameplay doesn't quite live up to the quality of the presentation and underlying concept. Don't you dare let that stop you from making this one of the first Xbox 360 games you play if the concept intrigues you, though. Despite its shortcomings, Condemned offers a compelling sneak peek at some of the incredible potential of the next generation of games. The next time you think you're having a bad day, just think of Agent Ethan Thomas here. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Condemned: Criminal Origins Video Review FBI Agent Ethan Thomas is a sullen man who's part of the Serial Crimes Unit, so it's little wonder he isn't more cheerful. The game begins with Agent Thomas on a routine assignment: Someone's been brutally murdered in a bad part of town, and he's there with the police to figure out what happened and to clean up any remaining mess. Without spoiling anything, let's just say that things don't quite go according to plan. Thomas winds up implicated in some serious crimes, but not before he has a run-in with some sort of a madman who spares his life--just barely. But why? Bent on finding the truth, his assailant, and his missing pistol, Thomas goes off on his own, with nothing but a cell phone, a Taser-style stun gun, and his forensic tools to aid him. The only other person he can depend on, save himself, seems to be a colleague of his who's willing to stay in touch by phone, helping Thomas to analyze evidence so he can slowly connect the dots that lead to some disturbing discoveries. The dark, engrossing story of Condemned starts out strong and has its moments along the way, but unfortunately, it doesn't take center stage during what's mostly just a straight-up action game with an intriguing premise. As Thomas begins to question his own sanity when faced with unbelievable evidence, the narrative purposely takes some incoherent turns, causing you to wonder if there's any hope of a satisfying resolution. It's too bad the story hadn't been more developed. As it stands, answers to some of the most important questions raised by the game (for example, what the hell is wrong with everybody?) are relegated to loading screens in between chapters rather than to contextual exposition. So instead, what Condemned boils down to is cautiously exploring dark, dilapidated buildings--they're condemned, get it?--while confronting and ruthlessly beating down violent thugs bent on smashing your face in. Except it's not quite as great as that makes it sound, because the dark, dilapidated buildings and, somehow, even the ruthless beatings start to get old some time before the nine or 10 hours it takes to finish the game. And optionally collecting bird carcasses and metal pieces hidden throughout each level (don't ask) doesn't add much intrigue. You'll keep waiting for Condemned to throw you a major curveball, since it feels like that sort of game. And it sure comes close, but it never quite goes beyond a threat, merely teasing you with potential while inundating you with repetition. Condemned is kind of like a first-person shooter, except instead of shooting, there's mostly just a lot of pure, bloody brawling. For some strange reason, there's no real bare-handed combat, but improvised weapons are everywhere. You've got everything from metal pipes, to nail-covered two-by-fours, to fire axes, to sledgehammers, to signposts. Each weapon is rated differently for speed, range, power, and defense, though the differences can be pretty subtle. So it'll often come down to a subjective choice: How does that metal conduit strike you? How about that nice concrete-crusted rebar over there? Take your pick, and hang on to it, because you can only carry one weapon at a time. All our gushing praise still won't quite prepare you for how awesome the fighting looks in this game. You'll get the impression that the vast majority of effort that went into this game was invested in the interaction between you and your deranged enemies. There's some striking artificial intelligence at work, combined with some amazingly, frighteningly lifelike animations that will make you wince as if in pain or in anticipation of it. Your foes cannot be reasoned with, as they're lunatics with a thirst for blood who'll rush out at you from the shadows, flailing anything they can get their hands on while trying to kill you. They'll scream obscenities and smash things in freakish anger. They'll lie in ambush, and they'll gladly hurt one another--as well as you--just as long as somebody gets hurt. And they won't just stand there and take it as you lash out at them with weapons of your own. As they recoil in pain from your attacks, they'll lurch forward for their next strikes, as if guided by momentum and adrenaline. The best thing to be said about Condemned is that it captures hand-to-hand combat with intense, lifelike brutality like no other game before it. No other first-person-perspective game even comes close, with the notable exception of last year's The Chronicles of Riddick: Escape From Butcher Bay. The problem with Condemned is that it can be safely described in generalities, since there aren't enough specific moments that stick out. The nerve-racking, unpredictable behavior of your enemies will have you on your toes, holding your breath for several hours. But eventually, the bad guys just seem to run out of new tricks. Similarly, you have few tricks of your own: The left trigger makes you block, while the right trigger makes you attack. There's no combo system, so Agent Thomas is mostly limited to just some slow, powerful strikes. Meanwhile, enemies' attacks can be very damaging (as well they should be, judging by how painful they look), so you'll find it's foolish to just slug it out with them. Instead, you'll find yourself stepping in for the strike when your opponent leaves himself open, and you'll find yourself stepping back or blocking when he attacks. At least blocking is an active process, meaning you need to time your blocks to deflect the enemy's attack--but watch out, since he'll sometimes throw fake swings at you. That's pretty much what the action boils down to. Sometimes enemies will be staggered to their knees, near death, at which point you may execute some sort of finishing move just by pressing one of four directions on the D pad. These moves look great (especially the head-butt and the knock-out punch), but they're only for show, reinforcing that Condemned's spectacular appearance is rather superficial. As great as the combat seems at first, Condemned definitely could have used some more depth. You've got that stun gun, and you can also kick those fools if you like. The stun gun feels pretty overpowered, though it's necessary later on in the game when you're dealing with more than just one or two enemies at a time. It's easy to aim, and it immobilizes the unfortunate target, giving you a free shot as well as a chance to rip his weapon from his grip. After each use, the stun gun automatically recharges its battery for your next shot. And, yes, there are some conventional firearms in Condemned, but the gunplay isn't particularly satisfying, and it's quite scarce. The weapon models for guns don't look nearly as realistic or detailed as the game's much broader assortment of makeshift melee weapons. Any guns you find will never have more than a few rounds of ammunition in them, so you'll need to make these shots count and then throw the weapon away in favor of something a little more solid. Your enemies have no fear of guns (or seemingly anything), and since all the action takes place in very close quarters, the long-range advantage you'd expect from a pistol or rifle is made nearly irrelevant. Since it's going for chills and creepy atmosphere, Condemned doesn't just stoop to throwing enemies at you around every corner. That's the good news. But the bad news is that this means you'll often walk through long stretches of terribly dark, dreary corridors without much of anything happening. The level design in Condemned is pretty disappointing overall, since it's chock-full of grimy, depressing locales that definitely get the ~grimy, depressing~ part down pat, but fail to come up with much of interest for you to do or look at. Sometimes you need to find a fire axe or a sledgehammer to bash through a locked door (inexplicably, only the fire axe breaks down wooden doors, as the sledge is only for padlocks). But these types of cases are just too common. It all starts to blend together after a while, no thanks to the repetition of textures and lack of any distinguishing reference points in most areas, and no thanks to the thick darkness that permeates most of the game. Unless you chicken out and crank up the brightness on your television above where you'd normally have it, you'll find that many sequences of Condemned are nearly pitch black, save for your weak little flashlight's reassuring glow. All that said, it probably won't be long before you find yourself wishing you had some kind of a map to help guide you through each area, since you don't. It's fairly easy to get lost, disoriented, and then frustrated as you stumble around looking for the one door you're supposed to open or the one little corner concealing the next hallway. Besides braining crazy freaks, you'll get to sniff out hidden clues using some high-tech gadgets. Occasionally you get to stop to gather some forensic evidence, which helps break up the action a little, though there's really not much to this process. Your ~instincts,~ which come in the form of an onscreen prompt, will indicate to you when you're supposed to ready one of your handy gadgets instead of that club you've been cracking skulls with. For the most part, you can't use your forensic tools unless a mission-critical objective is nearby. Once you've got your equipment on the ready (you automatically bring out the right item for the job), it's just a matter of slowly walking around until you find what you're looking for. Certainly it's a cool effect, seeing trails of violence materialize under a black light and so forth. These bits also tie in to the plot, so they're more than welcomed, but there's just not much challenge involved since the game does almost all the work. You end up feeling about as actively involved in the investigation as you would be just sitting there soaking up an episode of CSI. Luckily, some of the later evidence-gathering sequences are more interesting since they take place in more-dangerous areas, so you might have to quickly swap that digital camera for a two-by-four if you run into bad company. The problem with Condemned is that it can be safely described in generalities, since there aren't enough specific moments that stick out. The nerve-racking, unpredictable behavior of your enemies will have you on your toes, holding your breath for several hours. But eventually, the bad guys just seem to run out of new tricks. Similarly, you have few tricks of your own: The left trigger makes you block, while the right trigger makes you attack. There's no combo system, so Agent Thomas is mostly limited to just some slow, powerful strikes. Meanwhile, enemies' attacks can be very damaging (as well they should be, judging by how painful they look), so you'll find it's foolish to just slug it out with them. Instead, you'll find yourself stepping in for the strike when your opponent leaves himself open, and you'll find yourself stepping back or blocking when he attacks. At least blocking is an active process, meaning you need to time your blocks to deflect the enemy's attack--but watch out, since he'll sometimes throw fake swings at you. That's pretty much what the action boils down to. Sometimes enemies will be staggered to their knees, near death, at which point you may execute some sort of finishing move just by pressing one of four directions on the D pad. These moves look great (especially the head-butt and the knock-out punch), but they're only for show, reinforcing that Condemned's spectacular appearance is rather superficial. As great as the combat seems at first, Condemned definitely could have used some more depth. You've got that stun gun, and you can also kick those fools if you like. The stun gun feels pretty overpowered, though it's necessary later on in the game when you're dealing with more than just one or two enemies at a time. It's easy to aim, and it immobilizes the unfortunate target, giving you a free shot as well as a chance to rip his weapon from his grip. After each use, the stun gun automatically recharges its battery for your next shot. And, yes, there are some conventional firearms in Condemned, but the gunplay isn't particularly satisfying, and it's quite scarce. The weapon models for guns don't look nearly as realistic or detailed as the game's much broader assortment of makeshift melee weapons. Any guns you find will never have more than a few rounds of ammunition in them, so you'll need to make these shots count and then throw the weapon away in favor of something a little more solid. Your enemies have no fear of guns (or seemingly anything), and since all the action takes place in very close quarters, the long-range advantage you'd expect from a pistol or rifle is made nearly irrelevant. Since it's going for chills and creepy atmosphere, Condemned doesn't just stoop to throwing enemies at you around every corner. That's the good news. But the bad news is that this means you'll often walk through long stretches of terribly dark, dreary corridors without much of anything happening. The level design in Condemned is pretty disappointing overall, since it's chock-full of grimy, depressing locales that definitely get the ~grimy, depressing~ part down pat, but fail to come up with much of interest for you to do or look at. Sometimes you need to find a fire axe or a sledgehammer to bash through a locked door (inexplicably, only the fire axe breaks down wooden doors, as the sledge is only for padlocks). But these types of cases are just too common. It all starts to blend together after a while, no thanks to the repetition of textures and lack of any distinguishing reference points in most areas, and no thanks to the thick darkness that permeates most of the game. Unless you chicken out and crank up the brightness on your television above where you'd normally have it, you'll find that many sequences of Condemned are nearly pitch black, save for your weak little flashlight's reassuring glow. All that said, it probably won't be long before you find yourself wishing you had some kind of a map to help guide you through each area, since you don't. It's fairly easy to get lost, disoriented, and then frustrated as you stumble around looking for the one door you're supposed to open or the one little corner concealing the next hallway. Besides braining crazy freaks, you'll get to sniff out hidden clues using some high-tech gadgets. Occasionally you get to stop to gather some forensic evidence, which helps break up the action a little, though there's really not much to this process. Your ~instincts,~ which come in the form of an onscreen prompt, will indicate to you when you're supposed to ready one of your handy gadgets instead of that club you've been cracking skulls with. For the most part, you can't use your forensic tools unless a mission-critical objective is nearby. Once you've got your equipment on the ready (you automatically bring out the right item for the job), it's just a matter of slowly walking around until you find what you're looking for. Certainly it's a cool effect, seeing trails of violence materialize under a black light and so forth. These bits also tie in to the plot, so they're more than welcomed, but there's just not much challenge involved since the game does almost all the work. You end up feeling about as actively involved in the investigation as you would be just sitting there soaking up an episode of CSI. Luckily, some of the later evidence-gathering sequences are more interesting since they take place in more-dangerous areas, so you might have to quickly swap that digital camera for a two-by-four if you run into bad company. The quality of the presentation in Condemned goes a long way toward keeping you riveted, even when the action starts to grow stale. We can't overstate just how good a lot of the hand-to-hand combat looks. There's some meticulous attention to detail that might make you squirm--such as when you rake your crowbar across an enemy's jaw and then watch him spit blood (and what looks like teeth) as he whirls about violently, face red from more than just anger. And while the game doesn't go into too much detail about exactly what's wrong with all the people you're fighting, it doesn't really need to, because just one good look at them is enough to tell you they're far gone. Better yet, the further you go, seemingly the more inhuman and misshapen your foes will become--as though their deteriorating condition represents Agent Thomas' own psyche. To make things more believable, the game does a good job of presenting some of its noninteractive cutscenes from a first-person perspective in the context of the game itself. Ever been thrown down an escalator? You'll get a feel for what that might be like in Condemned. It's hard to get a good look at what you're up against in Condemned, but you'll see enough to know this is one great-looking game. The graphics do have a few minor problems, mostly centering around the relatively bland environments. Granted, it's not like filthy rundown buildings are inherently interesting to look at, but the main issue with the environments in Condemned is that there's too little contrast in them. In the very first setting, you'll see the breaking dawn piercing through shuttered windows into dust-filled rooms. It's a beautiful effect, but the game almost never does anything of the kind again, instead pushing you through one lifeless corridor after another. The last sequences of the game look distinctive, and another part that's set in an old, rundown department store stands out, but it's too bad the settings of Condemned aren't as inspired as their fearsome inhabitants. Also, despite how vicious the combat looks, the act of getting killed in this game (which will happen often, since it's pretty tough on normal difficulty) is a little underwhelming. The action just freezes the instant the deathblow connects, all too mercifully preventing you from witnessing Agent Thomas' collapse--and whatever might happen next. For that matter, considering how much care clearly went into the animation, it's sort of unfortunate to see Condemned making liberal use of rag-doll physics. Killed enemies all collapse in what look like the same lifeless heaps found in just about every action game these days, thanks to the ubiquitous rag-doll effect. But this is just nit-picking over what's a graphically amazing game. As with most any Xbox 360 game, for best results you should view Condemned at the highest possible resolution on a nice big high-definition display. Even when you do, you'll find that the game's frame rate holds quite steady, smoothly rendering some highly detailed scenes. But even when you don't, you'll find that Condemned still looks really impressive running on a standard television (the game is presented in a letterbox even if you don't have a widescreen TV, though). Older video game systems just can't pull off these kinds of good looks. In addition to an HDTV, you'll want a surround-sound system to get the most out of Condemned's excellent atmospheric audio. There's very little music in the game, apart from some subtle ambient tracks that play here and there, and the sparse voice acting is of good quality. So it's really the sound effects that deserve most of the credit, since they're essential to fulfilling the gut-wrenching intentions of the graphics. Suffice it to say you'll hear every thud, crunch, and spatter in alarming detail. Even relatively mild acts, like breaking the glass on a first-aid kit, might well cause you to flinch from how piercingly loud and clear they are. Some aggravating repetition in the audio drags things down a bit, specifically in how the shrieks from enemies struck by your stun gun always sound exactly the same, ruining some of the suspension of disbelief. But overall, Condemned is by far one of the better-sounding games this year. Given all the potential on display in Condemned, we can't help but hope for a sequel. Condemned's success in delivering the best-looking first-person melee combat of any game to date is truly admirable, along with its unusual premise. It's just that the longer you play, the more you'll wish that there were more substance to the experience. Fortunately, the game's main area of focus is executed on incomparably well, and it's thrilling for a good while if not all the way to the bitter end. If you do manage to fight your way through to the conclusion, there's not much reason to keep coming back, unless you want to brave certain arbitrary challenges (such as never using guns) to unlock some modest extras--like concept art galleries and such. But when it comes to showcasing just how shockingly up close and personal the act of fighting for your life can get in a game, Condemned has become one to beat...preferably over and over with a lead pipe. The quality of the presentation in Condemned goes a long way toward keeping you riveted, even when the action starts to grow stale. We can't overstate just how good a lot of the hand-to-hand combat looks. There's some meticulous attention to detail that might make you squirm--such as when you rake your crowbar across an enemy's jaw and then watch him spit blood (and what looks like teeth) as he whirls about violently, face red from more than just anger. And while the game doesn't go into too much detail about exactly what's wrong with all the people you're fighting, it doesn't really need to, because just one good look at them is enough to tell you they're far gone. Better yet, the further you go, seemingly the more inhuman and misshapen your foes will become--as though their deteriorating condition represents Agent Thomas' own psyche. To make things more believable, the game does a good job of presenting some of its noninteractive cutscenes from a first-person perspective in the context of the game itself. Ever been thrown down an escalator? You'll get a feel for what that might be like in Condemned. It's hard to get a good look at what you're up against in Condemned, but you'll see enough to know this is one great-looking game. The graphics do have a few minor problems, mostly centering around the relatively bland environments. Granted, it's not like filthy rundown buildings are inherently interesting to look at, but the main issue with the environments in Condemned is that there's too little contrast in them. In the very first setting, you'll see the breaking dawn piercing through shuttered windows into dust-filled rooms. It's a beautiful effect, but the game almost never does anything of the kind again, instead pushing you through one lifeless corridor after another. The last sequences of the game look distinctive, and another part that's set in an old, rundown department store stands out, but it's too bad the settings of Condemned aren't as inspired as their fearsome inhabitants. Also, despite how vicious the combat looks, the act of getting killed in this game (which will happen often, since it's pretty tough on normal difficulty) is a little underwhelming. The action just freezes the instant the deathblow connects, all too mercifully preventing you from witnessing Agent Thomas' collapse--and whatever might happen next. For that matter, considering how much care clearly went into the animation, it's sort of unfortunate to see Condemned making liberal use of rag-doll physics. Killed enemies all collapse in what look like the same lifeless heaps found in just about every action game these days, thanks to the ubiquitous rag-doll effect. But this is just nit-picking over what's a graphically amazing game. As with most any Xbox 360 game, for best results you should view Condemned at the highest possible resolution on a nice big high-definition display. Even when you do, you'll find that the game's frame rate holds quite steady, smoothly rendering some highly detailed scenes. But even when you don't, you'll find that Condemned still looks really impressive running on a standard television (the game is presented in a letterbox even if you don't have a widescreen TV, though). Older video game systems just can't pull off these kinds of good looks. In addition to an HDTV, you'll want a surround-sound system to get the most out of Condemned's excellent atmospheric audio. There's very little music in the game, apart from some subtle ambient tracks that play here and there, and the sparse voice acting is of good quality. So it's really the sound effects that deserve most of the credit, since they're essential to fulfilling the gut-wrenching intentions of the graphics. Suffice it to say you'll hear every thud, crunch, and spatter in alarming detail. Even relatively mild acts, like breaking the glass on a first-aid kit, might well cause you to flinch from how piercingly loud and clear they are. Some aggravating repetition in the audio drags things down a bit, specifically in how the shrieks from enemies struck by your stun gun always sound exactly the same, ruining some of the suspension of disbelief. But overall, Condemned is by far one of the better-sounding games this year. Given all the potential on display in Condemned, we can't help but hope for a sequel. Condemned's success in delivering the best-looking first-person melee combat of any game to date is truly admirable, along with its unusual premise. It's just that the longer you play, the more you'll wish that there were more substance to the experience. Fortunately, the game's main area of focus is executed on incomparably well, and it's thrilling for a good while if not all the way to the bitter end. If you do manage to fight your way through to the conclusion, there's not much reason to keep coming back, unless you want to brave certain arbitrary challenges (such as never using guns) to unlock some modest extras--like concept art galleries and such. But when it comes to showcasing just how shockingly up close and personal the act of fighting for your life can get in a game, Condemned has become one to beat...preferably over and over with a lead pipe."}