{"ref": "https://www.gamespot.com/reviews/genshin-impact-review-%E2%80%93-direct-hit/1900-6417583/", "date": "October 16, 2020", "game_name": "Genshin Impact", "text": "When you hear the words ~free-to-play,~ you probably think of very specific kinds of games: mobile time-killers, first-person shooters with loot boxes, MMORPGs. However, a story-driven, open-world action-RPG in a similar vein to Zelda: Breath of the Wild is probably not what springs to mind. But that's exactly what Genshin Impact aims to be. It delivers a large, lore-filled, graphically lush world with nuanced combat, character-building, exploration mechanics, and co-op crossplay across multiple platforms at the most appealing price point possible--free! And while it succeeds admirably for the most part, it stumbles in a few key ways that remind you that there's no such thing as a fully free-to-play game.Genshin Impact makes a great first impression. The anime-inspired visuals are inviting and colorful, and the fully voiced, nicely choreographed cutscenes give the game the feel of a premium product. It also gets you going with the gameplay very quickly; thanks to solid control design, you'll be running, swimming, climbing, dodging, gliding, fighting slimes, and slinging spells just a few minutes after the intro cutscenes wrap up. And once your first additional party member officially joins your posse, things start to get very interesting, as you'll start to learn the ins and outs of the elemental interactions that make Genshin Impact unique.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Genshin Impact Video ReviewEach character in Genshin Impact has one of seven elemental properties tied to them, which greatly affects what they can do for combat and exploration. While systems of strong and weak elements are extremely common in games, Genshin Impact takes things a step further, introducing unique and interesting ways for multiple elements to interact with objects and enemies. It starts with simple interactions: an object aligned with Dendro (nature) like a wood shield or structure burns with damaging flames when exposed to Pyro attacks, while pools of water can be frozen with Cryo element skills or used as a conduit for causing Electro damage in an area. Experimenting with other elemental combinations will yield more interesting results; setting an enemy on fire and following up with an Electro attack overloads them with energy and causes area damage, while using a windstorm can blow another source of elemental damage like Pyro or Hydro elsewhere while augmenting its strength.You can swap between four active characters with a tap of the D-pad, giving you the ability to strategically chain attacks to great effect. The system makes party formation interesting: Do you double up on elements for bonuses or field a team of different elements, just in case you run across unexpected challenges and puzzles where they could be useful? It's a fun and creative system that adds a lot of enjoyment to exploring Genshin Impact's world, Teyvat.And there's plenty to do here, too. Even though many areas of Teyvat haven't been made available to explore yet, there's still plenty to do and see. There are chests to find, teleportation spots to activate, all kinds of raw materials to accumulate, side quests to complete, and big baddies to try and slay. If you want to stop exploring and relax a little, you can try your hand at cooking food, forging weapons, and even conjuring up rare items through alchemy. If you're feeling particularly adventurous, you can even explore certain dungeons with others online using co-op play--and, thanks to cross-platform compatibility, it's easy to join up with others no matter what they're playing on. Setting up elemental combos with a team of players is very satisfying indeed.You'll get more party characters, weapons, and loot as you play through the game normally, but there is a way to get some extra goodies: by opening up your wallet. [Editor's note: Everything written here refers to version 1.0 of the game. As Genshin Impact is an ongoing games-as-a-service title, monetization methods and drop rates can change as the game evolves.] Genshin Impact's monetization revolves primarily around ~gacha,~ a Japanese term referring to a loot box-style system. You spend in-game currency on a ~wish~ that will get you either a weapon or a new character, and buying 10 wishes at once guarantees a character or weapon of four-star or better rarity. While you can obtain said currency in-game for free in various ways, you can also buy it directly with real money. You can also use real money to buy upgrades like item sets or a Battle Pass that yields better rewards for your questing endeavors.Besides utilizing a confusing currency conversion system (you buy Genesis Crystals, which you can convert to Primogems, which you then convert to Fates to spend on Wishes), the gacha can be very punishing. If you're going for the top-tier gacha rewards, you're either going to need to be really lucky or prepared to spend a lot of time and/or money. The drop rate for the coveted five-star characters is a mere 0.6%. Fortunately, every 10-wish roll comes with at least one four-star weapon or character, and these are more than sufficient to take on the game's tougher challenges. It's also possible to not spend at all--if you carefully save the Fate and Primogems you acquire in-game, you can still assemble a formidable team. With a 10-wish costing about $20-$30 (depending on how many Genesis Crystals you buy at once), opening your wallet to try for the best stuff can get very pricey very fast.Despite this, Genshin Impact generally manages to dodge a lot of ~pay-to-win~ issues. Even if you get good characters and weapons, you still have to learn to use them well and gather materials to improve their abilities, which can only be achieved through gameplay, and the items you can buy aren't an immediate gateway to becoming overpowered.However, like many free-to-play titles, Genshin Impact is built around getting you to invest time in the game every day. You'll need to explore to find hunting and harvesting spots for materials needed not only for crafting and cooking, but also upgrading your characters and weaponry and increasing your Adventurer's Rank. The Adventurer's Rank in particular can be rather frustrating, particularly early on. Many features like co-op play, certain regions of the map, special dungeons, and even the ability to start crucial story quests are gated behind certain rank numbers, which restricts your play in an otherwise open-world adventure. While plenty of activities in the game yield experience points for the Adventurer's Rank, it can be tedious to spend time doing side quests and exploring areas you're not particularly interested in to open up parts of the game that you do want to see.Another major issue is that, while Genshin Impact is certainly a very nice-looking game, its world doesn't offer much that's all that interesting to see. The landscapes, dungeons, and enemies are generic and samey, with little in the way of interesting areas or architecture to make the world feel distinct from many other anime-inspired fantasy environments. The character design has a similar problem; while the characters certainly aren't unappealing, most of their designs don't really stand out as being particularly striking or memorable.One more important factor that might turn players off is that, because developer MiHoYo is located in mainland China, Genshin Impact is subject to rules imposed by the Chinese government regarding online chat, which means certain politically sensitive terms (like ~Taiwan~ and ~Hong Kong~) are censored in conversation during co-op play. While this is an issue that affects all games from China, some players will understandably not be comfortable playing a game that's subjected to such heavy government censorship.Overall, Genshin Impact is a solid game hampered a bit by the restrictions its free-to-play model imposes. The overall production values are high, and the core gameplay is solid. In particular, the elemental interaction system is a ton of fun and gives the game a distinct personality. But while there's a lot to do, having several chunks of Genshin Impact gated off until you've reached a higher rank is an obnoxious restriction for an open-world game to have--and once you finally do see what lies in those unexplored areas, it's often a bit underwhelming. Still, it's a solid start, and I'll certainly be interested in seeing how Genshin Impact continues to evolve in future updates."}