{"ref": "https://www.gamespot.com/reviews/men-in-black-ii-alien-escape-review/1900-6025330/", "date": "April 18, 2003", "game_name": "Men in Black II: Alien Escape", "text": "While the conventional wisdom states that movie games are little more than another cog in the movie-marketing machine, that hasn't really been the case lately. More and more often, games with movie tie-ins are competently done, and some of them are pretty good games in their own right. Men in Black II: Alien Escape is such a game. While it doesn't directly follow the plot of the movie, it does what most arcadelike shooters (and most summer movies) should do. It shows up, it's fun from beginning to end, and then it gets out of the way so you can move on to something else. Men in Black II features plenty of nonstop action. The game's plot has agents J and K (Will Smith's and Tommy Lee Jones' characters, respectively) chasing down a group of aliens who have crashed to Earth on a prison ship and escaped. The game gives you the option to play as either agent, the main difference between the two being a slightly different arsenal. Once the menus are out of the way, the game itself is a very standard and easy-to-pick-up third-person shooter. You have basic controls that let you move around, roll out of the way of incoming fire, and strafe left and right. Both agents have three weapons, each of which can be boosted several times by collecting power-ups. Getting hit not only lowers your life meter, but it also lowers your weapon power. Alien Escape is very good at constantly tossing enemies at you. Around every corner, enemies will materialize and begin taking aim at you. This makes the game a constant firefight with terrific pacing. More often than not, you'll be confined to your current area until you destroy all the nearby enemies, at which time a door will open or an obstacle will explode, giving you access to the next area. This is pretty much consistent throughout the entire game, but occasionally the levels stray from the formula and send you on a quest to find switches or other door-opening devices. Big, powerful weapons let you clean up lots of alien scum fast. The game's music is a weird mix of styles that at times has a sort of ~alien techno~ feel, and its upbeat nature fits the action quite well. The voice work is designed to sound like Will Smith, Tommy Lee Jones, and Rip Torn, and it comes reasonably close. The characters at least convey the same attitude that their counterparts in the movie do, even if they don't sound perfect. Graphically, the character design is roughly the same story as the voice-overs--not identical to the movie characters, but close enough. The aliens look pretty good, though there are usually only a few different types of aliens in each level, so the action can seem pretty repetitive on occasion. Outside of some very rare slowdown related to the game's very cool weapon effects, the frame rate remains solid and smooth throughout. In the end, the main issue that keeps Men in Black II: Alien Escape from being a better game is its length. The story mode provides five missions that can be completed in 20-30 minutes each, and the unlockable training and boss modes don't provide too much more entertainment. Due to its short length and relative ease, Men in Black II: Alien Escape is a game you'd probably want to rent rather than purchase, but it's fun while it lasts."}