{"ref": "https://www.gamespot.com/reviews/fifa-street-2-review/1900-6145718/", "date": "March 9, 2006", "game_name": "FIFA Street 2", "text": "When FIFA Street was released in February of 2005, the game boasted far more style than it did substance and offered a gameplay experience that was as flawed as it was flashy. Nevertheless, when we reviewed FIFA Street we alluded to the fact that we'd very much like to see its problems addressed in a sequel at some point, and now, one year later, EA Sports Big has done just that. The PlayStation 2, Xbox, and GameCube versions of FIFA Street 2 represent a significant improvement over the lackluster original, but the same can't be said for the PlayStation Portable and Nintendo DS games unfortunately. If this game looks more like the original FIFA Street than it's much-improved sequel, it's because that's what it is. The fact is, the PSP and DS versions of FIFA Street 2 aren't handheld versions of EA Sports Big's street soccer sequel at all but are essentially handheld versions of last year's game with a couple of new features bolted on. You won't find any taunts, ball-juggling mechanics, or risk-versus-reward gamebreakers on the PSP or the DS, nor will you find an end-to-end camera unless you're playing the PSP version's new one-on-one striker and sharpshooter minigames--which task you with beating a goalkeeper without the use of any tricks and are fun for about two minutes. Regular matches in FIFA Street 2 are played from the perspective of a sideline camera and challenge your team of four players either to score more goals than the opposition within a set time or simply to be the first to score a set number of goals. Regardless of which game type you're playing, you'll spend the majority of your time performing tricks, not only to get past opposing players, but also to increase your chances of scoring by stringing together combos and activating gamebreaker shots. Unlike the home console versions of FIFA Street 2, the PSP and DS games will award you bonuses for every single trick you perform, even if the opponent closest to you at the time is at the other end of the pitch. The upshot of this is that one of the easiest ways to play isn't to beat opponents with tricks at all, but simply to stay as far away from them as possible and mash the random trick button until you're able to unleash a gamebreaker shot--which is only good for one point but is far more likely to beat the keeper than a regular shot. The absence of a right analog stick for performing tricks on the PSP means that using the random trick button is your only option. The random trick system works reasonably well, but beating opponents with it definitely isn't as satisfying as it is when you use the ~trick stick~ in other versions of the game. On the Nintendo DS, the touch screen is used to display a picture of an analog stick that--with practice--you can use to exert some control over which tricks you perform. This system is far from perfect--particularly since using it means moving your right thumb away from the face buttons used for passing the ball, taking shots, and defending--and although experimenting with it can be fun for a short time, it's unlikely that you'll choose to use it over the far less unwieldy random trick button. Another difference in the control setups of the two games is that the PSP version gives you an opportunity to counteract opponents' trick moves by hitting the correct face button when it flashes up on the screen. You'll have only about a second to defend against the move successfully, but it's a great system that makes FIFA Street 2's defensive duties feel less like guesswork and, as a result, more gratifying. In addition to quick play game-on matches against the CPU and wireless head-to-head games, FIFA Street 2 boasts a rule-the-street career mode. The first thing you'll need to do when starting a career game is to create a player for yourself by customizing his physical appearance, clothing, and attributes. The customization options available in the PSP game are reasonably comprehensive, but the DS game's editing tools are extremely limited. You'll then get to pick out seven players for your squad, although given that substitutions aren't permitted at any point during the game, it's unlikely that four of them will ever spend much time playing. When you tire of the career mode, the PSP-exclusive minigames will extend the longevity of FIFA Street 2 by at least two minutes. Once your career gets under way, you'll need to play in ~kick about~ games to earn skill bills that can be spent on improving players, and then once your team reaches the required skill level, you'll be able to enter tournaments and unlock new locations to play at all over the world. Your only other gameplay option is to attempt to add new players to your squad by beating their teams in special matches that you'll often have to pay for the privilege of playing. The career mode is incredibly repetitive, and frankly there are any number of better ways for you to spend quality time with your handheld of choice. If you have the PSP version of FIFA Street 2, for example, you might choose to listen to the game's excellent 38-song soundtrack using the ~pocket trax~ option. If you've ended up with the DS version of FIFA Street 2, though, your best bet would be to play something else instead. With its poor visuals, poor ball physics, and poor artificial intelligence, the Nintendo DS version of FIFA Street 2 is undoubtedly the worst game to bear the FIFA Street name thus far. The PSP game, on the other hand, plays about as well as the PS2 version of FIFA Street on which it's based, so if you're one of the people who (unlike us) enjoyed that game, you'd probably be able to derive some kind of pleasure from it should you feel the need to add it to your collection."}