{"ref": "https://www.gamespot.com/reviews/driver-2-advance-review/1900-2895730/", "date": "October 24, 2002", "game_name": "Driver 2 Advance", "text": "It's astonishing just how much Driver 2 Advance looks, feels, and plays like the PlayStation version of Driver 2. When Infogrames handed the project to Sennari Interactive, the company no doubt specified that the game should follow the same basic plot and mission setup of the popular PlayStation car crime simulator. The coders at Sennari have far exceeded expectations, however, and delivered a handheld driving game with a 3D perspective that is just as satisfying as its console counterpart. The gist of Driver 2 is that you're a cop named Tanner who has to infiltrate a crime syndicate in order to stop the smuggling of illegal weapons into the United States. Rather quickly, you get a lead when the body of a small-time Brazilian thug turns up in Chicago full of holes. Since Chicago is the territory of crime boss Solomon Caine, it is his outfit that you must join with the purpose of sniffing out the overseas connection. The unique twist here is that you don't use Tanner's detective or marksmanship skills to accomplish your mission--you drive. Driver 2 Advance is a mission-based driving game. To earn each successive piece of evidence, you need to drive stolen vehicles from point A to point B and accomplish the tasks Caine sets out for you. There are a variety of mission types, the majority of which involve snaking your way through the city, escaping the cops, and reaching a destination on time. Not all of them are so cut and dried, however--there are a few missions that involve tailing a target from a distance or ferrying passengers to multiple destinations within the city. The first half of the game is set in Chicago, with the later portions taking place in Rio de Janeiro, Brazil. Although the Game Boy Advance version of Driver 2 is missing the Vegas and Havana locations from the PlayStation version, the two included cities are still fairly large. One of the coolest features of the game is that you can climb out of your car at any time and just steal another one right off the road. The cops get a little more suspicious each time you crash into something, so changing cars is a good way to lessen the heat. Another bonus from jacking a new ride is that you get a fresh car to drive, which helps in the missions where rival gangsters are trying to smash into you left and right. Another nice feature is the take a ride mode, which lets you wander both cities unfettered by objectives. Compared to the controls in other handheld driving games, the controls in Driver 2 are basic. Nonetheless, they're more than adequate for this kind of game. The A and B buttons let you move forward or in reverse, while the R button enables you to enter or leave an idle vehicle. Most cars are of the heavy muscle variety, which means you have to swerve and skid through turns just as you would in an arcade-style racing game. Although there are only about 10 different vehicles copied repeatedly throughout both cities, they vary with respect to speed, handling, and toughness. Vans and large sedans can take a lot of punishment, but they're not very fast. Conversely, roadsters and police cars can cross five city blocks in mere seconds, but their turn radius and damage capacity are pathetic. The simplicity of Driver 2 is one of its best assets. Weaving through traffic and avoiding the police is a basic game design that works really well on the Game Boy Advance. There are some missions that involve tense time limits or driving badly damaged vehicles full of explosives, but the game never strays too far from its pedal-to-the-metal roots. The real challenge comes from trying to discover the best path for each mission, which isn't always easy considering you're free to roam just about anywhere within the city. If you own the PlayStation version, you'll be surprised at just how closely Driver 2 Advance re-creates its console cousin. There are 30 missions, most of which are identical to those from the PlayStation game. Some missions, namely those involving a moving locomotive or a bridge jump, have been replaced with less graphically intensive alternatives, but by and large the same strategies that held true on the console also hold true on the handheld. Yes! You can even steal the cop cars. Besides the undercover mode, Driver 2 Advance also contains the same driving minigames that were in the PlayStation version, in addition to a few new multiplayer games that are exclusive to the Game Boy Advance. The five single-player games include quick chase, getaway, checkpoint, and survival, as well as a trailblazer challenge where you have to knock over cones strewn throughout the city. The multiplayer games are much better than the dull tag game included with Driver 2 on the PlayStation. Checkpoint and cross-town race modes let you and four friends race one another to the finish line, while the free-for-all and cops-n-robbers modes let you play a survival match solo or in teams. Regardless of how well it plays and regardless of how many minigames are included, the most eye-catching and notable aspect of Driver 2 Advance is its visuals. Instead of the action being viewed from the pathetic top-down viewpoint in the Game Boy Color release of Driver, the action in Driver 2 occurs from a behind-the-car perspective in cities that are fully three-dimensional. Certainly the game doesn't look quite as nice as the PlayStation version, but the ability to smash into trash cans and lawn furniture, as well as assault fleeing pedestrians, lends some vibrancy to the scenery. Unfortunately, due to the storage constraints of the cartridge medium, there isn't much variation between the two cities in terms of architecture. Furthermore, a lot of the buildings just seem to repeat forever. Still, the action is smooth, and the roadways are packed with commuter cars at nearly every intersection. Still-frame cutscenes advance the story. The game's audio is similarly noteworthy. When you're doing well, all you'll hear is some '70s-style background music and the roar of the engine. But when the cops are on your tail, the sound of sirens fills the air along with bullhorn announcements such as ~You are under arrest~ and ~Pull over the vehicle!~ The speech samples for these vocals are remarkably crisp. About the only real gripes you'll have with the soundtrack are that there isn't enough variety to the music and that there aren't enough sound effects to convey the different crashes and engines with realistic resonance. It's really not that big of a problem though. Driver 2 Advance is both impressive and enjoyable. Sure, the cities could look more realistic and the gameplay could be more diverse, but you'd be hard pressed to direct any real criticism toward any aspect of the game. Driver 2 Advance is simply great, not just for fans of the series, but for most any GBA owner who can handle the subject matter. If you own the PlayStation version, you'll be surprised at just how closely Driver 2 Advance re-creates its console cousin. There are 30 missions, most of which are identical to those from the PlayStation game. Some missions, namely those involving a moving locomotive or a bridge jump, have been replaced with less graphically intensive alternatives, but by and large the same strategies that held true on the console also hold true on the handheld. Besides the undercover mode, Driver 2 Advance also contains the same driving minigames that were in the PlayStation version, in addition to a few new multiplayer games that are exclusive to the Game Boy Advance. The five single-player games include quick chase, getaway, checkpoint, and survival, as well as a trailblazer challenge where you have to knock over cones strewn throughout the city. The multiplayer games are much better than the dull tag game included with Driver 2 on the PlayStation. Checkpoint and cross-town race modes let you and four friends race one another to the finish line, while the free-for-all and cops-n-robbers modes let you play a survival match solo or in teams. Regardless of how well it plays and regardless of how many minigames are included, the most eye-catching and notable aspect of Driver 2 Advance is its visuals. Instead of the action being viewed from the pathetic top-down viewpoint in the Game Boy Color release of Driver, the action in Driver 2 occurs from a behind-the-car perspective in cities that are fully three-dimensional. Certainly the game doesn't look quite as nice as the PlayStation version, but the ability to smash into trash cans and lawn furniture, as well as assault fleeing pedestrians, lends some vibrancy to the scenery. Unfortunately, due to the storage constraints of the cartridge medium, there isn't much variation between the two cities in terms of architecture. Furthermore, a lot of the buildings just seem to repeat forever. Still, the action is smooth, and the roadways are packed with commuter cars at nearly every intersection. The game's audio is similarly noteworthy. When you're doing well, all you'll hear is some '70s-style background music and the roar of the engine. But when the cops are on your tail, the sound of sirens fills the air along with bullhorn announcements such as ~You are under arrest~ and ~Pull over the vehicle!~ The speech samples for these vocals are remarkably crisp. About the only real gripes you'll have with the soundtrack are that there isn't enough variety to the music and that there aren't enough sound effects to convey the different crashes and engines with realistic resonance. It's really not that big of a problem though. Driver 2 Advance is both impressive and enjoyable. Sure, the cities could look more realistic and the gameplay could be more diverse, but you'd be hard pressed to direct any real criticism toward any aspect of the game. Driver 2 Advance is simply great, not just for fans of the series, but for most any GBA owner who can handle the subject matter."}