{"ref": "https://www.gamespot.com/reviews/infamous-review/1900-6210038/", "date": "May 22, 2009", "game_name": "inFamous", "text": "Imagine waking up one day and finding yourself in the middle of a burning crater, destroyed buildings and dead people everywhere. You soon learn that you are no longer like other humans. Electricity courses through your body, endowing you with superpowers and, by extension, the power to control the fates of those around you. Will you become a noble hero, striving to bring peace to a city in ruins? Or will you lash out in anger, crushing the weak humans who are no longer your equals? In Infamous, the choice is yours. These moral dilemmas intertwine your fate with that of the city, but it's the amazing freedom that makes this experience so incredible. From unleashing electrical blasts to corral your enemies, to scaling the highest skyscrapers with finesse and ease, Infamous lets you seamlessly control the powered-up hero you've always wanted to be. The buggy visuals and gameplay glitches can't quite live up to the excellent action, but the overall experience crushes these small problems like so many petty criminals. It's not easy being a superhero, but it is an absolute blast. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Infamous Video Review A powerful bomb has exploded in Empire City, bringing the thriving island metropolis to its knees. Gangs now rule the streets, causing cops and citizens alike to cower in fear, and a deadly pandemic has forced the government to quarantine the whole area. At the center of the cataclysmic blast is Cole, an ordinary bicycle messenger. Of course, he isn't so ordinary anymore. The explosion killed thousands and leveled buildings like they were fragile card houses, but it gave him superpowers. Cole can shoot lightning bolts from his fingertips and withstand an inordinate amount of punishment, so he is the one who must track down the bombers and bring order to the city. The story is rooted firmly in typical comic-book struggles, but the characters are so well developed, the problems so believable, that the deeper you plunge into the conspiracy the more fascinating it gets. As the story pushes you toward the chilling conclusion, you'll become completely immersed in this universe. The cutscenes add to this impact, employing stylish, animated illustrations that would be equally at home in a comic-book. However, the story is not just a static tale of vengeance and betrayal. You have a choice in how it plays out, which gives you a strong connection to the events, sucking you further into the world. Whenever Cole is faced with a moral decision, the action pauses and Cole spells out his thoughts to you. Should he let the hungry citizens eat the government-delivered food, or scare them off and take it all for his friends? The abrupt stop in the action lacks the immediate impact that a more organic choice would have given, but it makes you face the consequences head on, forcing you to consider both sides of the coin before brashly rushing in. The problems are often black and white, presenting a clear path toward being a superhero or villain, but there are a few twists to the classic formula that make the problems feel much more authentic. There isn't always an obvious good or evil route, so you'll have to put yourself in Cole's shoes, decide how you want the situation to play out, and live with the consequences--both in how the story plays out and in the look of the city itself. Don't mess with the guy with superpowers. Lesson learned. Empire City is split into three large islands, and by the end of the game, you'll be able to travel across the whole city, jumping into missions or on top of buildings without restrictions. Moving around the city feels almost perfect, given that the ease of climbing and leaping makes the whole world burst with possibilities. You can easily grab on to windows, pipes, and other fixtures on the outside of buildings, which makes climbs from the dirty streets to the breezy rooftop quick and painless. There's a slight stickiness to Cole's leaps, so when you jump close to objects that you can grab, you'll be pulled into their path. This simple mechanic makes sliding along thin wires or bouncing across tiny posts incredibly fun, letting you worry more about where you want to go rather than how you're going to get there. As you progress through the game, you unlock the ability to glide through the air and grind railroad tracks, which makes the already dynamic movement even more freeing. The whole system is so immediately satisfying that it's possible to get lost in this huge metropolis for hours, joyfully dashing across towering buildings, skating along railroad tracks, and shimmying up lampposts. Although leaping from building to building is a blast on its own, there are worthwhile goodies hidden around the city that give you a tangible reason to explore every nook and cranny. There are 350 blast shards scattered in all sorts of odd places, and collecting them gives you the ability to store more electricity, which means that you have even more power with which to zap enemies and innocent bystanders. There are also drop points scattered across the three islands that give important details about the events that unfolded before the bomb changed everything. To find these hidden items, you need only tap L3 and they will appear on your radar, eliminating the frustration of having to hunt down hundreds of collectables. However, it's when you start tracking down these items that a slight problem with the movement crops up. The stickiness of your jumps is great when you're sprinting across rooftops, but it makes landing in precise locations rather tricky. Cole latches on to everything near him, so trying to drop down a story to nab a tucked-away shard can be trying at times. The benefit of being pulled into every climbable object far outweighs this slight annoyance, but it can be grating when you just want to grab a tiny ledge and Cole's sticky fingers won't obey. The combat is as seamless and enjoyable as the exploration, which keeps the action consistently thrilling. You start with a standard electrical blast that subdues citizens and criminals rather quickly, but you unlock even more powerful tricks throughout the game, which keeps the combat varied and intense. Sticky grenades, high-powered rockets, and an impressive shockwave blast can all be integrated into your normal fight routine with ease, which makes it possible to exterminate your foes in creative and sadistic ways. The controls for the combat are spot-on, ensuring that you can never blame the game if you miss a headshot or accidentally zap a friendly doctor instead of a crazed gunman. As you complete missions and kill enemies, you earn experience points, which are used to upgrade your already impressive abilities. Although the core moves don't differ drastically between good and evil characters, the upgrades throw in some interesting twists. For instance, as a good guy, Cole can use his grenades to handcuff weaker enemies to the ground, whereas his evil side can split grenades into multiple parts, creating more potent blasts. Cole always travels in style, even in cutscenes. Though you have superstrength and the ability to conduct electricity, this game isn't a cakewalk. Whether you're good or evil, the city is overflowing with enemies, which forces you to be alert even when walking casually down the street. Bad guys perch atop buildings armed with high-powered sniper rifles and rocket launchers, and they are crack shots with plenty of ammunition. If you're not careful, you will die often, but the difficulty never seems unfair. The versatile combat system lets you attack the hostiles in a number of unique ways. For instance, in one mission, you must bombard a specific building. You can move in slowly, taking out the surrounding villains as meticulously as possible and clearing an open path to unleash your destructive power. Or if you're feeling adventurous, you can grind a nearby railroad track, toss handfuls of grenades and missiles as you glide by, and destroy your mark without bothering with the surrounding humans. The versatility of the fights combined with a forgiving checkpoint system ensure that, even when the odds are stacked against you, there is always a way to weather the storm. The missions are as varied as the ways in which you can approach them. There are quests that focus on exploration, pure combat, careful tracking, deft platforming, escorting important people, and various combinations thereof. The most rousing is an intense battle in a prison courtyard. Powerful enemies swarm from all sides, filling the screen with fire and explosions. You toss grenades and missiles into the fray, conjure shockwaves to slow down the onslaught, and then slink behind cover to take a breather. It's intense and thrilling, cleverly mixing every element of the game into a superb blend of chaos and fun. The side missions provide an interesting respite from the exhilarating main missions, giving you bite-sized tasks that clean up sections of the city when you finish them. Certain side missions force you to choose between two morally aligned tasks. Completing the good one will make the evil one unavailable, and vice versa. Not only are these missions satisfying, but they further reinforce your moral standing and make the two sides of the karmic coin feel unique. Cole's good guy act of the day: making sewers enjoyable. The visuals cannot quite match the thrilling combat and amazing exploration, but they do a fine job of bringing this chaotic city to life. Cole is nicely detailed and impressively animated; he leaps and climbs with silky-smooth moves. The lighting is also quite well done. During some missions, Cole must enter the sewers to power up darkened districts of the city, and these sections are stunning. The light dances against the murky water and dank walls, creating an eerie yet inviting view of the slinkiest place in the city. Fire is also brilliantly realized, which makes it a joy to cause cars and toxic barrels to combust. Not everything looks so good, though. The other characters don't have the same believable animation as Cole, which makes the in-game cutscenes feel pretty sloppy. The buildings and roads have a hazy look, and textures jarringly pop in as you quickly leap across the city. There are also a number of graphical glitches. Cole will walk through railings and other solid objects all too often, the frame rate struggles when the screen is brimming with effects, and there are far too many jagged edges. Empire City may not be the prettiest place, but what it lacks in stunning beauty it makes up for in pure entertainment. One of the most remarkable aspects of Infamous is how it continually improves throughout the quest. The pacing is excellent. It doles out new abilities, introduces powerful story twists, and concocts exhilarating missions at a steady rate, which means the game never loses steam during the course of the lengthy adventure. And when the credits finally roll, you'll just want to keep playing, to see what the other morality choices reveal and to squeeze every ounce of entertainment from this amazing world. Infamous is an exhilarating and incredibly fun open-world game. The combat is as seamless and enjoyable as the exploration, which keeps the action consistently thrilling. You start with a standard electrical blast that subdues citizens and criminals rather quickly, but you unlock even more powerful tricks throughout the game, which keeps the combat varied and intense. Sticky grenades, high-powered rockets, and an impressive shockwave blast can all be integrated into your normal fight routine with ease, which makes it possible to exterminate your foes in creative and sadistic ways. The controls for the combat are spot-on, ensuring that you can never blame the game if you miss a headshot or accidentally zap a friendly doctor instead of a crazed gunman. As you complete missions and kill enemies, you earn experience points, which are used to upgrade your already impressive abilities. Although the core moves don't differ drastically between good and evil characters, the upgrades throw in some interesting twists. For instance, as a good guy, Cole can use his grenades to handcuff weaker enemies to the ground, whereas his evil side can split grenades into multiple parts, creating more potent blasts. Cole always travels in style, even in cutscenes. Though you have superstrength and the ability to conduct electricity, this game isn't a cakewalk. Whether you're good or evil, the city is overflowing with enemies, which forces you to be alert even when walking casually down the street. Bad guys perch atop buildings armed with high-powered sniper rifles and rocket launchers, and they are crack shots with plenty of ammunition. If you're not careful, you will die often, but the difficulty never seems unfair. The versatile combat system lets you attack the hostiles in a number of unique ways. For instance, in one mission, you must bombard a specific building. You can move in slowly, taking out the surrounding villains as meticulously as possible and clearing an open path to unleash your destructive power. Or if you're feeling adventurous, you can grind a nearby railroad track, toss handfuls of grenades and missiles as you glide by, and destroy your mark without bothering with the surrounding humans. The versatility of the fights combined with a forgiving checkpoint system ensure that, even when the odds are stacked against you, there is always a way to weather the storm. The missions are as varied as the ways in which you can approach them. There are quests that focus on exploration, pure combat, careful tracking, deft platforming, escorting important people, and various combinations thereof. The most rousing is an intense battle in a prison courtyard. Powerful enemies swarm from all sides, filling the screen with fire and explosions. You toss grenades and missiles into the fray, conjure shockwaves to slow down the onslaught, and then slink behind cover to take a breather. It's intense and thrilling, cleverly mixing every element of the game into a superb blend of chaos and fun. The side missions provide an interesting respite from the exhilarating main missions, giving you bite-sized tasks that clean up sections of the city when you finish them. Certain side missions force you to choose between two morally aligned tasks. Completing the good one will make the evil one unavailable, and vice versa. Not only are these missions satisfying, but they further reinforce your moral standing and make the two sides of the karmic coin feel unique. Cole's good guy act of the day: making sewers enjoyable. The visuals cannot quite match the thrilling combat and amazing exploration, but they do a fine job of bringing this chaotic city to life. Cole is nicely detailed and impressively animated; he leaps and climbs with silky-smooth moves. The lighting is also quite well done. During some missions, Cole must enter the sewers to power up darkened districts of the city, and these sections are stunning. The light dances against the murky water and dank walls, creating an eerie yet inviting view of the slinkiest place in the city. Fire is also brilliantly realized, which makes it a joy to cause cars and toxic barrels to combust. Not everything looks so good, though. The other characters don't have the same believable animation as Cole, which makes the in-game cutscenes feel pretty sloppy. The buildings and roads have a hazy look, and textures jarringly pop in as you quickly leap across the city. There are also a number of graphical glitches. Cole will walk through railings and other solid objects all too often, the frame rate struggles when the screen is brimming with effects, and there are far too many jagged edges. Empire City may not be the prettiest place, but what it lacks in stunning beauty it makes up for in pure entertainment. One of the most remarkable aspects of Infamous is how it continually improves throughout the quest. The pacing is excellent. It doles out new abilities, introduces powerful story twists, and concocts exhilarating missions at a steady rate, which means the game never loses steam during the course of the lengthy adventure. And when the credits finally roll, you'll just want to keep playing, to see what the other morality choices reveal and to squeeze every ounce of entertainment from this amazing world. Infamous is an exhilarating and incredibly fun open-world game."}