{"ref": "https://www.gamespot.com/reviews/blue-dragon-plus-review/1900-6206196/", "date": "March 16, 2009", "game_name": "Blue Dragon Plus", "text": "Blue Dragon's mouthy Marumaro is one of the most annoying characters to ever appear in a role-playing game. He returns in Blue Dragon Plus, though his squeals have been tamed, which makes his noisy enthusiasm more charming than grating. In fact, this sequel to the Xbox 360 RPG offers a much better narrative in general, warmed with heartfelt character interactions and a few honest surprises. Sadly, the half-baked blend of RPG and real-time strategy elements is just as frustrating as it is fun, and though the game gets off to a good start, it eventually becomes bland and tedious. Like its predecessor, Blue Dragon Plus gets the job done, in a generic sort of way. Shu and his can-do attitude are back, but less annoying than before. Marumaro isn't the only returning personality. Blue Dragon Plus throws every main and bit character into a blender, which ultimately works to the game's benefit. You'll spend less time with the ever-zealous Shu and his nondescript pals, and more time exploring other relationships, old and new alike. There are some new additions, but the most emotional and unexpected moments involve familiar faces, a fact that lends gravity to the game's ending sequences. The plot itself is less spectacular; it sends this motley crew through a cube world as they chase after an evil dragon called Balaur. However, it is brought to life in a series of lovely cinematics and sweeping orchestral cues. Unfortunately, one of Blue Dragon Plus's primary contrivances doesn't work so well from a story perspective: Almost everybody and their brothers can now summon a shadow. These shadows are the titular blue creatures, and in the Xbox 360 original, the ability to control one was an extraordinary talent. In Blue Dragon Plus, practically every character possesses one, yet Shu and company seem perpetually surprised when they encounter yet another shadow user. Their ubiquitous presence doesn't just make shadows old hat, but is practically a mockery of one of the original's few unique qualities. This surplus of shadows may annoy Blue Dragon fans, but it serves the gameplay. You control up to four parties of four characters each as you slowly make your way across the cube and fight the various enemies that you encounter there. Yet though Blue Dragon featured rather traditional turn-based battles, combat in Blue Dragon Plus functions like a real-time strategy game in which you lead your units by selecting them and then choosing a target to attack or a spot to occupy. Other games on the DS, such as Heroes of Mana and Final Fantasy XII: Revenant Wings, have embraced similar mechanics to varying degrees of success. Unlike in those games, however, you control only up to four units at a time in Blue Dragon Plus, and you micromanage each character's skills and items during the course of the battle. On one hand, this smaller group of characters diminishes some of the frustrations those other games have wrought. Blue Dragon Plus's pathfinding works like that of Heroes of Mana: The map consists of an invisible grid of squares that character sprites must navigate as they move from one point to another, rather than freely moving from one location to another. This can make moving your heroes into the desired position occasionally frustrating, and the mediocre pathfinding means you have to keep a close eye on every character because party members can't always be trusted to follow your movement orders efficiently. Luckily, the limited party size keeps these frustrations at a minimum, and most maps are large enough to allow you room to maneuver. On the other hand, the small party size and large maps lead to tedium over time. You lead your party across the level, unleashing various special attacks and buffs, most of which involve summoning an impressive-looking blue shadow. The shadows look terrific, and they are easily the visual highlight of this generally attractive game. At first, it's fun to manage skills and items and watch shadows in action, but over time, the repetitive nature of battle wears thin. Small groups of foes may be scattered across the map, and once you defeat one cluster, you make your way to the next, a pace-breaking design element that's made all the more dull by the slow movement speed of even your fastest units. Furthermore, some battles are interrupted over and over again by story exposition, which breaks any sense of flow that may have accumulated. The best levels avoid these pitfalls by pitting you against boss characters, which are fun to fight because you must be more conscious of unit position and proper use of spells and items, especially if the boss is immune to one type of attack while susceptible to another. Most of the time, you move from one small pocket of enemies to the next with only the occasional additional objective to mix things up. It's a shallow and predictable framework, and it grows old long before the game comes to an end. Leading your party around is simple enough using the stylus, and though the touch controls generally work well enough, a few interface improvements could have made it a whole lot better. Whenever you issue an order, the units that you had selected are then deselected, an avoidable issue that serves as one of Blue Dragon Plus's chief aggravations. If you lead your entire party to a location and want to issue another order once they arrive, you'll need to select them all again before you can issue that order. This is a break from standard RTS control methods, and it comes with absolutely no benefit. Thanks to crisp unit sprites, selecting an individual unit is usually simple, and it won't take you long to remember which one possesses which skills. However, choosing a unit when the screen gets cluttered with enemies, or when facing a large boss, can be more difficult. You can use a selection icon to scroll through your four characters easily, but icons representing each unit would have been even more welcome. You know you want to summon a shadow. All the cool kids are doing it. Even with the limited variety in basic combat design and scattered design issues, the array of skills and items at your disposal can make for some enjoyable battles. Eventually, you will have four different parties exploring the cube simultaneously, and though parties have some mandatory members, you can mix and match for some fun combinations. As each character levels, he or she will earn new spells, and the items that you find or purchase are equipped on an individual basis, so you'll need to put thought into how each character is equipped. The role-playing elements are light, but each party member's distinctive abilities make it fun to swap characters around, and the various accessories and items that you can find and equip make the time you spend within menus more enjoyable than the time spent during battle. It has its ups and downs, but Blue Dragon Plus is ultimately a game that you will neither love nor hate. Although its gameplay is quite different from that of its console predecessor, it is equally unimaginative, doing nothing to stand out on a platform overflowing with quality games. Blue Dragon enthusiasts will welcome the opportunity to spend time with some old friends, and even newcomers will garner a few hours of enjoyment from the simple combat. Nevertheless, it's too shallow to remain novel for long, and though the story is good, it simply can't support the weight of a 25-hour game alone."}