{"ref": "https://www.gamespot.com/reviews/high-on-life-review-talking-heads/1900-6418014/", "date": "December 16, 2022", "game_name": "High on Life", "text": "When I booted up High On Life for the first time, I knew what I was getting myself into. I'm familiar with the work of not only Justin Roiland (Rick and Morty, Solar Opposites) but also of his game studio Squanch Games (Trover Saves The Universe, Accounting+), so I had an idea of the sort of comedy that was coming my way. What I did not expect, however, was a 3D shooter with Metroidvania vibes that echo some of the best games of my youth, and more importantly does them justice.High On Life tells the story of an unnamed protagonist--whom everyone calls ~Bounty Hunter,~ even their own sister--fighting against an alien drug cartel that's invaded Earth. The cartel wishes to round up every human on the planet and sell them as the drug, which other aliens can consume via elaborate machines. Our bounty hunter hero is armed with Gatlians, a race of talking guns, and each Gatlian possesses its own attacks and abilities. The concept is admittedly very weird, but it's a well-told story that kept me guessing until the end.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: High On Life Video ReviewAt this point, it bears acknowledging that this is 100% a Justin Roiland project, complete with all the hallmarks of his comedic philosophy. Rapid-fire monologues, fart jokes, demolition of the fourth wall, ad-libs, dark comedy--it's all intertwined within the game's narrative and presentation. If things like Rick and Morty, Trover Saves The Universe, or Solar Opposites aren't your cup of tea, this won't be either. That said, I have a very high tolerance for this sort of goofiness and I found myself laughing throughout the 10-hour adventure.I got a kick out of the fact that Squanch Games licensed four full-length schlocky B-movies for players to ~enjoy~ simply because it could. Every time a voice actor in clear ad-lib mode would laugh in the middle of a diatribe, I would also laugh. The referential humor always got a reaction out of me--particularly mentions of other video games, like the full-throated endorsement of indie darling Donut County by Kenny the pistol.There's a genuine charm in all of it. Sure, some of the jokes don't land, and the ramblings of the gun in my hand can sometimes go on too long, but it's clear in every attempt that the development team was having fun making High On Life. I never knew what was going to happen as scenes progressed, and that lack of predictability enhances the experience. Honestly, this unruly approach is the only way certain jokes work--which includes, for example, an entire scene that plays out in ~Space Applebee's,~ complete with waiter interruptions as you order food.However, Squanch Games also knows this brand of humor isn't for everyone, and it provides the option to tone down banter so those turned off by constant chatter can still enjoy the game. I left my settings to ~Frequent~ banter and didn't think it was too much--in comparison, I didnt find the banter to be as egregious as what earned Horizon: Forbidden West criticism earlier this year. This could be because the characters weren't speaking out loud about the puzzles in front of me, which made the dialogue feel more natural for the setting.Once you get past the goofiness and focus on the game itself, High On Life delivers a solid 3D shooter experience that emulates the exploits of Samus Aran. Each of the different biomes I explored were brimming with secrets, from living chests filled with gold to random NPCs offering a quick zinger or brief side quest. As the game progresses, vertical movement is introduced thanks to finding a jetpack, and that opens up exploration even more.These worlds are large, as well, which the game tries to counter with a waypoint system that allows me to see in which direction my objective lies and how far away it sits. Sometimes this system gets its wires crossed, and reaching one waypoint somehow turns into me returning to the waypoint I just came from, but more often than not, a simple tap of the D-Pad points me in the right direction. The waypoints also became something of a crutch in the later parts of the game, as not using them sometimes led to me traveling to the wrong part of the map and getting lost. Its not a perfect system, but the waypoints are helpful more often than not.The Gatlians each stand out from one another, both in their quips and how theyre used in combat. Kenny is the resident pistol, Gus is a shotgun, Knifey is the uh, knife, and Sweezy acts like the Needler from Halo. The most interesting of the weapons is Creature, which acts as a sort of Pikmin device, launching small creatures at enemies for damage over time. All four are potent in combat, as they possess advantages over certain foes and make it essential to switch through guns during a fight.Each gun has a second power that aids with traveling and environmental puzzles, which slowly opens more of the world to me as I progress. Kenny shoots blasts of thick slime which will hit designated obstacles and allow you to pass. Sweezy can fire a shot that slows time in the area around where it lands, making her the perfect choice to get past fast-spinning fans that would otherwise cause damage. These special shots can in a fight as well--Kennys slime shots will launch opponents in the air for extra hits, for example--which gives me even more options.Using the Gatlians in battle is a lot of fun, and the enemies I'm facing fit right into the weird and silly aesthetic of the rest of the game. The bad guys are each covered in a sort of yellow goo--the origin of which I will not spoil--and as you deal damage, the goo wears off, exposing their gray bodies underneath. While strange, it serves as an easy visual aid for how much damage you've done to a certain enemy, and it also allows you to create your own weak points. If an enemy is hiding behind cover, but there's a patch of gray skin exposed on its arm, target that spot and the enemy will fall quickly. It's an ingenious idea of showing combat damage on enemies without giving them health bars or something similar.That said, most of the enemies I encountered are dumb as rocks. I could run up to any one of the normal grunts and either shoot or melee them to death without taking a lot of damage. There were times Id be overwhelmed and have to retry a battle, but those were more due to my being overzealous rather than enemies outsmarting me.Sure, some of the jokes don't land, and the ramblings of the gun in my hand can sometimes go on too long, but it's clear in every attempt that the development team was having fun making High On LifeBoss fights arent much better, as the majority of them boil down to simply shooting and dodging. Some of them shake things up a bit, whether they implement the special shot of the Gatlian youre about to rescue--Krubis fires large discs you can reflect back at him, which it turns out is the power of Gus the shotgun--or give you multiple bosses to fight at once. At their core, however, its more of the same combat you get from grunts, just with bigger baddies.While overall combat is fun, where it becomes tedious is the length of some skirmishes. Each encounter tends to play out in waves, with two or three sets of enemies coming out before the battle is over. Some of them stretch far longer than that, to the point where Kenny the pistol says, ~Oh my god, MORE?!~ and I'm feeling exactly the same. These fights become a test of patience as much as a test of skill. Boss fights don't have this issue for the most part, but some of them fall into their own issues--one fight in particular still makes me angry just thinking about how difficult it became in its final stage.Ultimately, High On Life is, in its own weird way, a take on what a modern Metroid Prime game could be, through the lens of Justin Roiland's comedy antics. There's a similar sense of exploration mixed with fast-paced moments of combat, only here it's also swelling with expletive-laden jokes and sometimes incoherent rambling. The story, off-beat as it may be, is told incredibly well, with characters and moments I'll be referencing for a while. Even if you're not a fan of the kind of humor High On Life presents, the game that's here is worth the trip."}