{"ref": "https://www.gamespot.com/reviews/bubble-bobble-revolution-review/1900-6159689/", "date": "October 11, 2006", "game_name": "Bubble Bobble Revolution", "text": "The only redeeming aspect of Bubble Bobble Revolution for the Nintendo DS is that it includes the classic Bubble Bobble arcade game from 1986. There are actually two games included on the cartridge, but the classic is the only one worth playing. The accompanying new age remake, despite all of its enhancements, isn't as fun as its predecessor. Worse, it's plagued by glitches, one of which makes it impossible to access more than two-thirds of the available levels. Apart from not being that much fun, the remake is so plagued with glitches that it can't even be finished. Both games share key aspects in common. Each has 100 levels populated by monsters. In both games, you control a cute little dinosaur that can jump and spit bubbles. Bubbles can be popped by running into them, or you can use them as makeshift trampolines by jumping on top of them. The goal is to clear the monsters out of all 100 levels by first trapping them inside of bubbles and then popping those bubbles. Monsters tend to walk or float in one direction until they run into a wall or fall through an opening in the floor, whereupon they will turn around and continue on their merry way. If a monster falls into a hole at the bottom of the screen, it will reappear from a corresponding opening in the ceiling. You can also take advantage of these miraculous floor-to-ceiling warps. In some levels, there are water, fire, and lightning bubbles that can be popped to send a long-range elemental attack toward your enemies. The challenge is to figure out the best way to ensnare the monsters without running into them or having them fall on top of you. Dispatched enemies leave behind food items and power-ups, which are, of course, very beneficial. Fans of the classic arcade game will be pleased to see that it's here in all its 8-bit glory. Each level is a single room, roughly one screen in size, with a pitch-black background and colorful platforms and walls in the foreground. The platforms are often organized so that a level's layout will resemble a familiar object, such as a heart or a puppy dog. Bub, the dinosaur, and all of his monster enemies have tiny animated feet and mouths, and they're drawn using bright primary colors that make them seem cute rather than frightening. The accompanying theme music and bleep-bloop sound effects are charming too, inasmuch as 8-bit audio can be described as charming. Classic Bubble Bobble is generally enjoyable, in part because it's rewarding to figure out how to solve each room, but mostly because it's fun to see what high scores you can rack up. Just getting to the monsters in some levels can be a test, and, like in so many games of that era, you only get three lives to finish the whole game. There's also quite a bit of strategy buried in the scoring system. For example, you get better items and higher score bonuses when you group multiple monsters together and bump them off as a group. This version of the classic looks and sounds identical to the original arcade game. The developers even managed to implement the two-player cooperative mode using the system's wireless link capability. Less glorious is the new age remake, which incorporates a number of changes and so-called enhancements that complicate the core game without really improving it, along with some bugs that cause very bizarre things to happen. The graphics and audio are better in the technical sense, but the Roman-styled backdrops and larger plasticine characters lack the personality of the classic backgrounds and sprites. They're also way behind the curve in terms of the DS's capabilities. The levels are larger too, with each level spilling sideways and filling both of the system's screens. You'd think that larger levels and bigger characters would be beneficial, but they actually make the screen feel cramped and give you less time to react to any unseen surprises that may be situated just a few steps ahead of you. Enemies in the remake are faster, and their projectiles move more quickly too. You also have to watch out for spikes in the environment, as well as fans that you can make spin by blowing into the system's microphone. If all that weren't enough, there's a boss waiting for you on every 10th level. To compensate for the upswing in difficulty, Bub and the other main characters can now take three hits before losing a life. They can also take advantage of a couple of new bubble types. Power-ups and score boosters have been thrown out the window, but now you can conjure up a ~charge~ bubble that captures four enemies at once. Or you can switch places with a misty doppelganger that you create by popping ~ghost~ bubbles. These new bubbles don't add a whole lot to the game because they take too much time to produce, but they do come in handy on the rare occasions when you absolutely need them. The charge bubble, for instance, is the only way to get enemies to drop the keys required to unlock certain levels. For whatever reason, the developers didn't implement a co-op mode in the remake. Instead, there's a competitive four-player mode that lets you duke it out to see who can earn the most points in any of 10 different prefab levels. It's a decent multiplayer mode, but not nearly as nice as the co-op mode that's available in the classic game. At least they included the original arcade game. What ultimately kills the remake are all of the glitches that cause various strange things to happen, including one that makes it impossible for anyone to get through more than two-thirds of the game. Enemies sometimes won't appear in a level. After a few seconds alone, you'll be whisked off to the next level, which may or may not have enemies on it. Even on the levels that do have enemies, there are times when they'll pop away as if you'd shot them, when it's clear that you did not. The worst glitch, by far, happens on level 30. The boss for that level simply doesn't appear. Fire bubbles drift up from the bottom of the screen, suggesting that you'll need to toast the boss when it eventually does appear, but it never does. Because you can't move on to the next batch of stages without defeating that boss, you're effectively stuck. Unfortunately, this glitch isn't random--it occurs 100 percent of the time. Because the remake is so buggy that it can't even be finished, it's impossible to recommend Bubble Bobble Revolution to anyone other than diehard Bubble Bobble fans who want to play the original classic version on their Nintendo DS systems. But even that is a stretch, seeing as how there are numerous cheaper alternatives available to anyone seeking a Bubble Bobble fix."}