{"ref": "https://www.gamespot.com/reviews/uno-review/1900-6132094/", "date": "August 26, 2005", "game_name": "Uno", "text": "There's no question that the quality level of mobile games has skyrocketed in the last 18 months or so. Production values are rising along with consumer expectations, and there's now a solid foundation of high-profile franchises to build upon. However, every so often, we run into a mobile game that hearkens back to the medium's dark ages, when the notion of quality control was still a pipe dream. Nuvo's mobile version of Uno fits this description exactly. We don't know how this game made it onto the download deck of the LG VX8000, and frankly, we don't want to know. All we can do is advise you to avoid this lazy, unfinished train wreck of a game. This game is broken, broken, broken. Uno is a card game for two to four players that uses a four-colored deck of cards. Each player takes a turn playing a card, and the next player has to try to follow suit, either by playing a card of a matching color, or an identical card of a different color. In addition to the number cards, which run from 0 to 9, there are special cards and wild cards that perform different functions. For instance, the ~skip~ card hops over the next player in the circle; ~draw two~ makes him or her draw two additional cards; and wild cards allow you to change the color to whatever you like, while also forcing the next player to add to their hand. If you're unable to play a card, you have to draw one from the pile--and if you can't play that one, you lose your turn. When you're down to your last card, you have to call ~Uno!~ before one of the other players catches you. The object of the classic game is to be the first to run out of cards. If you win, you'll get points for all the cards the other players are still holding. This version of Uno contains the classic card game, as well as several variations, such as elimination and low score. It's a nice variety...but it doesn't matter much, given that the game is phenomenally ugly, has no sound or multiplayer, and is fundamentally broken. The interface and menus are mostly plain Jane text, but even that looks better than the in-game graphics. The cards, while legible, are small and cramped together--plus, they're played on a hideous green board. Although an arrow indicates the direction of play, it's generally very difficult to tell what's going on. A sound toggle is missing altogether, and although Uno lets you play against one to three CPU opponents, it lacks any type of multiplayer option, which has become standard in these types of games. Finally, one of the most important parts of the game of Uno doesn't seem to work correctly. You can call out a computer opponent with one card, but your own ~Uno~ command is erratic. You're always able to call ~Uno~ before playing your next-to-last card, but you're not allowed to do this in a real-life game of Uno, because it would prevent the other players from intercepting you. Occasionally, you'll be able to call Uno correctly, but the game will freeze. Also, despite the game's simplicity, the CPU sometimes takes far too long to formulate its move, often giving you the impression that the game's crashed. Fortunately, your phone's ~delete application~ function should still work, no matter what Uno's status may be. If you set out to lay down textbook cases of all the things that could go wrong in a mobile game, you'd end up with Uno. This game is rotten to the core, and you wouldn't want to download it even if it were freeware. Consider yourself warned."}