{"ref": "https://www.gamespot.com/reviews/total-war-warhammer-3-review-bed-of-chaos/1900-6417839/", "date": "March 2, 2022", "game_name": "Total War: WARHAMMER III", "text": "Large-scale strategy games tend to struggle with their endgames. Boiling down decisions made over hundreds of turns into a satisfying win-state is no simple task. Victory conditions often feel arbitrary, even disconnected--as if the competing factions are not merely pursuing different strategies, but playing different games. Even if that's not the case, winning a game typically happens hours before the game recognizes it, and the rest is just a matter of slogging your way to the inevitable conclusion. Total War: Warhammer 3 is no exception. It may be the series' most spectacular, varied, and tactically rich entry yet, but its endgame problems reverberate throughout the whole campaign, undermining a strategic layer that deserves better.Warhammer 3 makes an excellent first impression. The prologue is a mini-campaign that feels almost like an RPG in the way it zooms in on one major character and offers a strong throughline as you gradually explore the map. Short cinematic scenes present your army's strategic decisions in ways that lend narrative purpose to the choices you make. Ultimately, it serves as a terrific introduction to the game's basic mechanics, while also drawing you into its world. After all that scene-setting, however, much of that flavor and the character-driven goals are lost.Developer Creative Assembly has rethought the series' traditional approach to winning a Total War campaign in deeply unsatisfying fashion. Painting the map--the common euphemism for how conquering territories changes them to your faction's color--isn't the end goal here, although it may still inform the journey. Instead, no matter which faction you choose to play, your objective is to send an army into the Chaos Realm, a dimension of pure magic in Warhammer lore represented here as a discrete section of the map, and secure a set of MacGuffins. Collect all four and you unlock the final battle. You're still marching armies around a great big map, besieging towns and capturing provinces, as you would in any other Total War, but your success in the campaign is measured only through how quickly you can collect those MacGuffins.The structural issue here is that the two aspects of the campaign--the regular campaign map and the brief excursions into the Chaos Realm--don't really talk to each other or interact in any particularly interesting ways. In fact, because the latter assumes primacy (since it is the way to win the game), much of what you do on the regular map feels redundant. Conquering neighboring towns, cutting deals with your allies, and building up your infrastructure is as enjoyable as it has ever been, but it often feels disconnected from your primary goal of gearing up one army lead by one lord on its excursions into the Chaos Realm.Every few dozen turns, portals open up on the map that connect to the Chaos Realm. You can send an army through a portal--just the one army, and it has to be led by your faction leader lord--and enter one of the four Chaos Realm locations, each of which underwhelms with a slight gimmick as to how it is completed. One is an annoying maze of linked portals where you end up playing an awkward game of Concentration to work out which portals take you where. Another is a series of gates, each offering a nice piece of gear in exchange for exiting the realm and not doing what you went there to do. It's meant to be a temptation--an offer you can't refuse--but all it really reveals is that accepting the gift is a waste of time.There are battles to fight here, of course, and they're as good in the Chaos Realm as elsewhere. Few strategy games rival Total War for large-scale spectacle, and Warhammer 3's battles benefit from the over-the-top nature of its fantasy where demons fly above improbably jagged terrain while fire and ice flood the field as you send your ravenous war beasts to outflank the enemy's poison-spewing serpents. But outside of a handful of battles, the Chaos Realm offers nothing you'll want to participate in after you've seen it once--and even that initial encounter will leave you wondering, ~Is that it?~ The problem is further compounded by how the realms are the same every time you play, and completing them is compulsory.By separating the Chaos Realm from the regular campaign map, and by only allowing one army to enter it, you end up prioritizing one big, well-stocked army commanded by your faction leader over all your other forces. This is the solitary war machine that's going to win you the game and, well, maybe you've got a few other lesser lords leading some sort of ragtag divisions that you probably don't need to worry about much. It's true that the portals to the Chaos Realm shake up regular gameplay by letting Chaos armies through to raid and pillage your territories, but you can easily send a lord or hero to close them at a fairly trivial cost. And you will need some sort of standing army in place to defend your homeland should another faction choose to invade while your main army is off tracking down the next MacGuffin. But once you have that primary army up and running and are able to recruit all the most powerful military units, there's little incentive to continue expanding your territory. Indeed, counter to Total War tradition, I found it advantageous to simply turtle up and wait for the next opportunity to visit the Chaos Realm. Less territory meant fewer portals to close, which meant fewer unexpected guests running loose, and fewer positions I needed to defend. I focused all my attention on that one army and that was enough.That is, it was enough to win the campaign. But not enough to make the experience anything more than a perfunctory, and even boring, slog. This is a shame, because Total War: Warhammer 3 actually offers a lot of strategic depth and some welcome additions that make for a much more enjoyable experience if you're not trying to achieve the campaign objectives at all costs.For a start, all the factions feel incredibly different. From the fixed starting positions of each one and their broader abilities that affect how they employ strategies on the campaign map, to the unique makeup of their armies and individual lords and heroes, there's considerable incentive to replay the campaign as each of the eight factions--and presumably more to come with post-launch support. They're also loaded with personality in a way that somehow manages to be outrageously campy while taking itself incredibly seriously. ~The bondage will be legendary!~ bellowed one of my lords, the perfectly chef's kiss-named Soulscreamer Witherslash, every time I ordered them to do something. I'm not a Warhammer obsessive in the slightest, so it all comes across as impossibly silly. But when you recruit a demon hero with the name E'ddi'e, you can't help but get on board with the ridiculousness of it all.Elsewhere, there are some excellent additions to an already very solid strategic base. Diplomacy is greatly improved through new features that let you see at a glance which of the hundred or so factions are interested in trading resources or forming an alliance. The ability to construct outposts in allied settlements, and then recruit their unique units to your army, provides even more flexibility to the composition of your forces and allows you to further refine specific tactics in battle. Sieges have been tweaked to embellish strategic considerations with every turn you spend hoping to wait out the enemy or strike before reinforcements arrive. Even the terrain itself comes into play, as the native winds of magic blow favor one way or another while Chaos itself can creep across the lands if left unchecked. These and a host of other minor tweaks combine to deliver a campaign map that is--endgame objectives aside--the best the series has been.Overall, the battles don't feel terribly different to what we've seen in recent Total War games--which is not intended as a criticism. There's enough variety to units and heroes, each bringing a range of abilities, that discovering the best tactical approaches takes time and plenty of experimentation, adding opportunities to strategize and see your efforts pay off in fulfilling ways. Of the new battle features, I particularly liked the implementation of deployable structures like barricades and towers during settlement battles. When combined with the neat layouts of these maps, with a healthy eye towards varying terrain heights, the new structures make settlements a lot of fun to defend and quite the challenge to attack. Generally speaking, though, when it comes to Warhammer 3's tactical battles, it's very much a case of if it ain't broke, don't fix it.Warhammer 3 opens strongly. The narrative hook of the prologue sinks deep and the raft of tweaks to the strategic layer and tactical battles are all welcome. But it can't sustain the early momentum. The endgame objectives feel like a distraction, even though they're the main point, and serve only to diminish the entire campaign. The factions all have different reasons for wanting the endgame MacGuffin, but none of those motivations make a difference to how the campaign plays out. They're all trapped in the same Chaos Realm, going through the same motions, in pursuit of the same unsatisfying win conditions. In the end, Total War: Warhammer 3 is a good game--there just isn't a good reason to see it through to the bitter end."}