{"ref": "https://www.gamespot.com/reviews/myst-iii-exile-review/1900-2884876/", "date": "October 8, 2002", "game_name": "Myst III: Exile", "text": "When you think of adventure games, you probably think of games that actually make you feel adventurous, games that let you charge through exotic environments, sword or gun in hand, as ready to blast or hack at an enemy as to solve some puzzles. In the world of PC gaming, ~adventure game~ usually has a very different connotation, thanks in good part to the Myst series. PC adventure games have long tended to be slow-paced, cerebral affairs with little action or even interaction. When Myst was released in 1993, it brought the adventure game experience to a near standstill. Through a simple interface, you navigated a surrealistic island composed of beautiful but static prerendered scenes. Playing Myst was like wandering into an enchanted art gallery--or a tedious slide show, depending on your disposition. You couldn't die in the game, and there was no combat of any kind. Myst and its sequel, Riven, went on to become the all-time best-selling PC game series, and they were only recently dethroned by The Sims. The latest entry in the Myst saga, Myst III: Exile, was released last year on the PC to good reviews, and now it makes its way to the Xbox. The game certainly isn't for everyone, but if you give it a chance, it can offer many rewards. Myst III: Exile builds on the mythology of Myst and Riven. Central to the stories of those earlier games are the D'ni, a race with the ability to write magical books that create links to the worlds, or ~ages,~ described in them. In Myst, you learned that Atrus, a part-D'ni scribe, imprisoned his malevolent sons, Sirrus and Achenar, in distant ages and then destroyed the books linking to those worlds, trapping the sons there forever. These very sons give rise to the story behind Myst III. One of their misdeeds resulted in the destruction of the homeworld of Saavedro, who has since given his life over to bitterness and the pursuit of revenge against Atrus and his family. It's your job to uncover Saavedro's plots and thwart his plans. It's not a particularly deep story, but it serves its purpose as a framework that lets you visit wildly different-looking ~ages~ while you and Saavedro play a game of cat and mouse across time and space. While the Myst games are most closely associated with the PC, their interfaces have always been more reminiscent of console-game interfaces in their streamlined simplicity. That's certainly true of Myst III: Exile. From a first-person view, you examine discrete areas composed of largely static backdrops. You can pan the camera fluidly in any direction with the left stick or the D pad, though, which creates a reasonable simulation of exploring a living 3D world. To move to a new area, you simply align the camera with the area and press the A button to instantly ~jump~ there. Manipulating objects is equally simple. Myst III's gameplay revolves solely around exploration and puzzle solving as you try to catch the ever-elusive Saavedro by figuring out how to manipulate the strange devices found in the game's various ages. The exploration and puzzle solving can be very satisfying in their own right, but taken together they can be a bit dull at times. Some puzzles will require you to manipulate multiple objects in different locations, so even if you figure out how they should be operated, you might still need to traipse back and forth to get the job done. Seeing a colorful locale the first or second time can be a real treat, but having to walk through it repeatedly just to solve puzzles that let you proceed to a locked area gets tedious in a hurry. There's a ~zip~ feature that lets you quickly move between places you've already visited, but it's available only a fraction of the time. Movement through the world of Myst III poses some other problems. You often don't know for sure whether you can move to a new area or whether it's just part of the noninteractive scenery until you actually press the A button. Sometimes, the difference is pretty clear--on a narrow bridge, you know you can move in one direction or the other, and that's it. But when you're on the rocky island of J'Nanin, for example, with its winding rock steps, sand dunes, and hills, it can be difficult to discern at first where you're allowed to walk. Things are even less clear on the confusingly twisty paths in the age of Edanna. Along with wandering about Myst's strange worlds, you'll be solving the aforementioned puzzles. These sometimes reveal parts of the plot or are at least tangentially related to it. At the same time, the puzzles' existence can seem pretty arbitrary or artificial. It can feel as if the designers just came up with a list of strange puzzles and then figured out how they could build a game around them, instead of the other way around. You'll have to think hard to figure out many of Myst III's puzzles. The puzzles usually involve pattern recognition or the manipulation of convoluted Rube Goldberg machinery (or machinelike plants). You might have to rotate a series of reflectors in the proper order to focus the sun's rays on a door to help open it. Or, you might have to figure out how to get a power generator to work by manipulating its circuitry. Many of the puzzles are challenging to the point of being downright frustrating. Myst III often literally feels as much like an IQ test as a game. To aid you in uncovering the story and solving the puzzles, you'll find journals and papers throughout the gameworld containing hints, and the game manual also features a useful hint section. The way the puzzles are set up can pose some other problems. You can find multiple puzzles to work on at once, which can make it difficult to discern which objects and manipulations are related to each other. Also, if you get stuck on certain puzzles, you won't be able to explore any further areas or advance the story, which means there's basically nothing to do in the game for the time being. Of course, that's a strong motivation to solve the puzzles, and ~running up against a wall~ can be part of the fun in an adventure game, but it can also lead to boredom or frustration. When you do solve the puzzles, though, you can get a real feeling of satisfaction. Since there's only one way to solve each puzzle, the game's replay value is somewhat limited, though the game itself is pretty large and should keep you occupied for quite a while. Plus, there are multiple endings, and you get a ~making of~ documentary as a bonus. This documentary is much longer and more interesting than the one included with the PS2 version of the game. Then again, the Xbox version of the game also retails for more than the PS2 version. One of the greatest appeals of the Myst series has always been its ability to immerse you in visually memorable fantasy worlds. That's certainly true of Myst III, a game with the rare capacity to evoke a real sense of wonder as you explore its surreal locations. The rocky island of J'Nanin lets you visit rooms carved out of gigantic tusks that gracefully arch high above the ground. The age of Amateria looks some sort of Chinese amusement park set on an alien world, complete with a bizarre ~ride~ that offers one of the visual highlights of the game. In Voltaic, you'll wander among alien machinery and across narrow, rusting catwalks suspended between imposing sandstone walls. In Edanna, you'll clamber over, under, and through enormous intertwined plants, twisting stone walkways, and driftwood arches. What makes Edanna particularly strange is the way the plants mimic machinery, unfolding to create spindly living escalators, or twisting to focus the sun's rays as if through a lens. Impressive visual details abound throughout Myst III. The game's machines feature elegant, archaic-looking gears and spindles, its winding stairways are adorned with embossed decorations, its eerie seaside grottos glow green in the sunset, and its gigantic plant life looks alien but is still reminiscent of real flora. The occasional animations are well rendered, and some of them look quite amazing in their oddity and colorfulness. With a few minor exceptions, all this is rendered beautifully by the Xbox. Myst III also does a decent job integrating live actors into the prerendered backgrounds, though the video can look a tad grainy at times. Another problem is the fact that the journal texts are a bit small and blurry--you might find a few of them hard to read on a standard TV. The imaginative worlds of Myst III aren't for everyone. The game's music and sound effects add to the vividness of the worlds you explore. The impressionist, ambient score quietly and effectively sets a melancholy mood with distant percussion and chimes and weeping strings. The sound effects are equally reserved. You hear just enough to make the worlds feel alive, but not so much as to spoil their sense of otherworldly solitude and loneliness. In the end, much of Myst III's appeal depends on how much you like puzzle solving, since that's the focus of and key to progression in the game. If the mere existence of a problem fires your determination to solve it, then the game can be highly entertaining. Because Myst III progresses at the pace at which you solve the puzzles, it lacks any sense of sustained drama or tension, let alone action. Some players will surely find it all rather dull or frustrating. Still, this relaxed pace can be refreshing. Ultimately, what's most impressive about Myst III: Exile is that it combines intellectual challenge with scene after scene of enchanting beauty. Along with wandering about Myst's strange worlds, you'll be solving the aforementioned puzzles. These sometimes reveal parts of the plot or are at least tangentially related to it. At the same time, the puzzles' existence can seem pretty arbitrary or artificial. It can feel as if the designers just came up with a list of strange puzzles and then figured out how they could build a game around them, instead of the other way around. The puzzles usually involve pattern recognition or the manipulation of convoluted Rube Goldberg machinery (or machinelike plants). You might have to rotate a series of reflectors in the proper order to focus the sun's rays on a door to help open it. Or, you might have to figure out how to get a power generator to work by manipulating its circuitry. Many of the puzzles are challenging to the point of being downright frustrating. Myst III often literally feels as much like an IQ test as a game. To aid you in uncovering the story and solving the puzzles, you'll find journals and papers throughout the gameworld containing hints, and the game manual also features a useful hint section. The way the puzzles are set up can pose some other problems. You can find multiple puzzles to work on at once, which can make it difficult to discern which objects and manipulations are related to each other. Also, if you get stuck on certain puzzles, you won't be able to explore any further areas or advance the story, which means there's basically nothing to do in the game for the time being. Of course, that's a strong motivation to solve the puzzles, and ~running up against a wall~ can be part of the fun in an adventure game, but it can also lead to boredom or frustration. When you do solve the puzzles, though, you can get a real feeling of satisfaction. Since there's only one way to solve each puzzle, the game's replay value is somewhat limited, though the game itself is pretty large and should keep you occupied for quite a while. Plus, there are multiple endings, and you get a ~making of~ documentary as a bonus. This documentary is much longer and more interesting than the one included with the PS2 version of the game. Then again, the Xbox version of the game also retails for more than the PS2 version. One of the greatest appeals of the Myst series has always been its ability to immerse you in visually memorable fantasy worlds. That's certainly true of Myst III, a game with the rare capacity to evoke a real sense of wonder as you explore its surreal locations. The rocky island of J'Nanin lets you visit rooms carved out of gigantic tusks that gracefully arch high above the ground. The age of Amateria looks some sort of Chinese amusement park set on an alien world, complete with a bizarre ~ride~ that offers one of the visual highlights of the game. In Voltaic, you'll wander among alien machinery and across narrow, rusting catwalks suspended between imposing sandstone walls. In Edanna, you'll clamber over, under, and through enormous intertwined plants, twisting stone walkways, and driftwood arches. What makes Edanna particularly strange is the way the plants mimic machinery, unfolding to create spindly living escalators, or twisting to focus the sun's rays as if through a lens. Impressive visual details abound throughout Myst III. The game's machines feature elegant, archaic-looking gears and spindles, its winding stairways are adorned with embossed decorations, its eerie seaside grottos glow green in the sunset, and its gigantic plant life looks alien but is still reminiscent of real flora. The occasional animations are well rendered, and some of them look quite amazing in their oddity and colorfulness. With a few minor exceptions, all this is rendered beautifully by the Xbox. Myst III also does a decent job integrating live actors into the prerendered backgrounds, though the video can look a tad grainy at times. Another problem is the fact that the journal texts are a bit small and blurry--you might find a few of them hard to read on a standard TV. The game's music and sound effects add to the vividness of the worlds you explore. The impressionist, ambient score quietly and effectively sets a melancholy mood with distant percussion and chimes and weeping strings. The sound effects are equally reserved. You hear just enough to make the worlds feel alive, but not so much as to spoil their sense of otherworldly solitude and loneliness. In the end, much of Myst III's appeal depends on how much you like puzzle solving, since that's the focus of and key to progression in the game. If the mere existence of a problem fires your determination to solve it, then the game can be highly entertaining. Because Myst III progresses at the pace at which you solve the puzzles, it lacks any sense of sustained drama or tension, let alone action. Some players will surely find it all rather dull or frustrating. Still, this relaxed pace can be refreshing. Ultimately, what's most impressive about Myst III: Exile is that it combines intellectual challenge with scene after scene of enchanting beauty."}