{"ref": "https://www.gamespot.com/reviews/half-life-opposing-force-review/1900-2543541/", "date": "November 24, 1999", "game_name": "Half-Life", "text": "First-person-shooter mission packs are usually mediocre: Throw together a few new levels, put in some more guns, add a spider, and you've got a commercial add-on for your aging product. As such, it's appropriate that Gearbox Software's Opposing Force, the official expansion for the genre-redefining Half-Life, in turn sets a new standard of quality for future action-game mission packs.Opposing Force's story recounts the events of Half-Life, but from the opposing side's perspective as implied by the title. You are Marine Corporal Adrian Shephard. You've been sent to the Black Mesa Research Facility to locate and eliminate Gordon Freeman. As in the original, things immediately go awry, mistakes are made, people die, and your initial plan is replaced with a complicated fight for survival. It's a testament to the success of Half-Life that its story actually warrants retelling. The developers know that while Adrian Shephard has no idea what Freeman is doing, you do, and they pack the game with clues as to where you are in relation to Half-Life's hero. Your path initially converges with Freeman's, then takes some unexpected detours. Many of the original settings and incidents are referred to or revisited from a slightly altered perspective, and it's a ringing endorsement of their effectiveness that to give any of them away would lessen your enjoyment of the game.Like Half-Life, Opposing Force's greatest strength is its success at consistently delivering surprises. You can sense the designers' enthusiasm as one memorable scene unfolds after another, and it compels you to keep playing. Although Opposing Force is only about one third as long as its predecessor, it's packed with original content. There isn't much filler in the game, so while you may finish it in just over ten hours or so, the experience feels much more complete and satisfying than many longer games, which tend to be padded with hours of drearily similar firefights.Despite its relatively short length, there's plenty of shooting in Opposing Force. Instead of limiting you to fighting alongside no more than two of Half-Life's weakling scientists or security guards, you can now recruit a squad of up to eight marines. The marines have the same advanced artificial intelligence as when they were your enemies in Half-Life, so that some of the large-scale battles staged in Opposing Force are simply phenomenal. Even though the game doesn't require you to do so, you'll want to replay such combat sequences just to try out different strategies in an effort to reduce friendly casualties.However, although the game lets you lead so many companions, you'll likely never have more than four at a time thanks to the AI's finicky following behavior. Opposing Force's only significant flaw is that it's often difficult to keep your followers in line. In some instances they simply appear to become confused, and at other times there is an invisible line they will not cross. It's usually unclear which of these two reasons keeps your squad from moving forward, so you'll spend too much time trying in vain to keep it assembled. This is a shame, as the rest of the game is of such high quality.Opposing Force adds nine new weapons to Half-Life's arsenal. There are a few additions to each original category - standard guns, experimental guns, and alien artifacts - and each is useful for the most part. An especially clever version of a grappling hook is put to good use in many of Opposing Force's action sequences and puzzles. The new experimental weapon's secondary firing mode transports you to a small section of the alien world Xen, where you can gather some extra health and ammo in the heat of battle.Most of the aliens in Half-Life weren't nearly as crafty as the enemy soldiers. Opposing Force introduces a new breed of alien warrior that is the marine's tactical equal, along with about ten other new allies and adversaries, including a few impressive boss monsters. Some of the new 3D models are merely window dressing but add to the game's rich atmosphere. A great number of scripted sequences have also been created for Opposing Force, which are often darkly humorous - the designers at Gearbox seem to harbor a real grudge against Half-Life's hapless scientists and dispatch them with sadistic ingenuity.Opposing Force doesn't include any new multiplayer game modes but is packaged with a set of multiplayer maps designed by a team of ~all-stars~ assembled by Gearbox, including such level design luminaries as Tom ~Paradox~ Mustaine and the Levelord. As you'd expect, these map designs are all at least competent. Most of the new weapons and character models are also available in the multiplayer game. However, the excellent single-player experience remains the best reason to get Opposing Force.While it doesn't add anything new to the graphics or technology of Half-Life, Opposing Force still manages to thrill through the impassioned application of creative design. It's the interactive equivalent of a page-turner; you'll finish it in a marathon sitting just trying to see what surprise lies around the next corner. Quite simply, the best first-person shooter ever released is now bolstered by the finest mission pack yet created."}