{"ref": "https://www.gamespot.com/reviews/virtua-tennis-world-tour-review/1900-6136321/", "date": "October 21, 2005", "game_name": "Virtua Tennis: World Tour", "text": "If the sole objective of a game for a handheld system like the PSP were to emulate an existing console video game, then Virtua Tennis: World Tour would be a smashing success. Everything found in Tennis 2K2 for the Dreamcast (which became Sega Sports Tennis upon its arrival on the PlayStation 2) can be found in World Tour. Despite the relative age of the source material and the number of times Sega has trotted it out already, the gameplay is still zippy and fun, and the whole package generally feels pretty fresh, thanks to some subtle tweaks. It may not be particularly new, but Virtua Tennis is still a ton of fun. It can be taken for granted that World Tour will be instantly accessible for those with prior Virtua Tennis experience, though even first-timers will find the controls to be both intuitive and responsive. You can use either the D pad or the analog stick for player movement, and when you're charging up for a swing, the direction you hold will influence the trajectory of the ball. The X, square, and circle buttons on the PSP correspond to three different swing types, though beginners can just use the standard topspin shot to get by for a while. Sooner or later, though, you'll meet an opponent who will clean the court with you if you don't also learn how to take advantage of the lob and slice shots. This is actually very indicative of how Virtua Tennis handles the learning curve on the whole. Basically, even if you don't know what you're doing, you can pick up the fundamentals and have fun for a while, though the game never stops gently nudging you to improve your overall play. The gameplay generally values visceral, fast-paced action over accuracy of simulation, but that's never stopped the Virtua Tennis series from loading up with real-life tennis pros. The 14 pros found in World Tour include current tennis stars Andy Roddick and Maria Sharapova, who are both making their first Virtua Tennis appearances, as well as old hands like Tommy Haas and Lindsay Davenport. And you can play as any of the 14 pros right off the bat in the tournament and exhibition modes, both of which do what their names imply. Tournament mode lets you choose either a five-stage singles tournament or a three-stage doubles tournament, while exhibition mode puts you in a single game against the player of your choice on the court of your choice. But, really, the tournament and exhibition modes are just warm-up for the world tour mode, which is where you'll likely be spending most of your non-multiplayer time. Here, given a handful of faces, skin colors, hairstyles, and some limited control over height and body weight, you create both a male and a female avatar before proceeding to take both to the top of the world tennis ranks. When you first start out, your players are scrubs. So even if you're the best Virtua Tennis player on this little blue planet, you wouldn't be able to compensate for these players' slow foot speeds and weak swings. The only way to get better is to repeatedly play through the eight different minigames scattered across the globe, each of which helps you improve very specific skills. There's a role-playing-game element at work, and almost every time you hit the court in one of these minigames, you'll gain a little more skill in an area of focus, even if you don't meet the requirements for ~success.~ It doesn't hurt that the minigames themselves are actually quite unique and fun, with challenges like dodging a barrage of big red balls or crushing a number of soda cans with your feet while keeping a volley going. Of course, the minigames are there to help prepare you for the full tournaments you'll compete in, where victory will net you a higher ranking, as well as some cash, which can be spent on a wide array of clothing and tennis gear. The world tour mode maybe isn't as engrossing as it was the first time we saw it in Tennis 2K2 for the Dreamcast, but it still serves as a great stage for the gameplay. New to the Virtua Tennis package is the ball games mode, a collection of four skill-testing minigames that have much the same spirit as the minigames found in the world tour mode. It would have been nice if you were provided with some kind of motivation other than a high score, though the Tetris-inspired blockbuster minigame is good enough to stand on its own. Virtua Tennis: World Tour also includes ad hoc Wi-Fi multiplayer support for up to four players. You can engage in regular singles, doubles, and mixed doubles matches here, and the gameplay generally seems just as snappy as in the single-player game, though we did notice some slight lag during the serve sequence. Perhaps it's because the game is being played on the small PSP screen rather than a standard television, but Virtua Tennis: World Tour almost looks better than the full console game it's derived from. Since Virtua Tennis lives in the vacuum of the tennis court, it's able to build out all the different courts with clean-looking textures and smooth geometry. The tennis players themselves, while not always capturing the countenance of their real-life counterparts, feature a good amount of detail and some animation that is preternaturally fluid and realistic. There are other nice, minor touches, like marks left on the courts by the ball and by players' sneakers, or the way the court will darken slightly as the shadows of clouds occasionally pass over the court. The new ball game mode represents one of the more prominent additions to World Tour. There may be a lot of old content in here, but the only piece of it that really feels dated is the sound design--or, more specifically, the music. Though it only surfaces erratically, it has a real specifically dated sound to it, and its combination of breakbeats and rock guitars sounds like it traveled in to the future from 1998. The actual in-game effects, such as player grunts and racquet reports, while recycled from prior Virtua Tennis games, still sound sharp and realistic. It's ultimately still more of the same old Virtua Tennis, and players who have had their fill of Tennis 2K2/Sega Sports Tennis might be reluctant to revisit what is essentially the same game one more time. This familiarity, though, is only a hindrance to a select few, and it certainly doesn't prevent Virtua Tennis: World Tour from ranking up there with the best tennis games on any platform."}