{"ref": "https://www.gamespot.com/reviews/skully-review/1900-6417525/", "date": "August 18, 2020", "game_name": "Skully", "text": "It's hard to make a platformer stand out in 2020. Skully, a 3D platformer about a reanimated rolling skull imbued with magic clay that can create and control mud golems, can't shake the baggage of its genre's history. Though it has some distinctive details--like a surprisingly cute, bouncing skull-ball for a protagonist--Skully's mild platforming, item collecting, and puzzle-solving often elicits the feeling that you're just going through the motions. While it isn't without charm or challenge, there isn't enough of it to make a profound impression.Skully the bouncing skull-ball is actually an elemental avatar created by the earth deity of an isolated island. In his natural form, Skully is a small, quick ball that can roll and hop across forest streams, wind-swept mountains, and lava-filled caves. There's a satisfying kinetic feeling to rolling down a path and picking up speed, which makes gracefully jumping through platforming challenges feel good.Skully isn't always rolling, though. He also has the power to use pools of mud to create humanoid golems that trade speed for additional abilities. Each of the three golem forms has two skills, most of which are used in very specific ways to get past obstacles Skully can't. For example, the big golem has a punch that can be used to break through walls and a steam attack that can temporarily dispel some enemies.Though Skully is a puzzle-platformer, the two types of gameplay feel very separate. There are ball-form sequences that focus on tricky jumps that require finesse and/or forethought, and there are others that require you to use your golems' abilities to uncover and arrange platforms so you can move forward. While the puzzles often involve jumping, but that isn't what makes the puzzles interesting or difficult to solve.Both types of sequences suffer as a result. Once you have a handle on how to jump precisely and keep Skully from rolling off of moving platforms, most technical platforming sequences feel more like exercises in mindfulness than technical skill. It's always possible to make a mistake, but it rarely feels as if your precision and timing are truly tested.It doesn't help that most of the game's tougher platforming challenges are entirely optional. Each level is stuffed with collectible leaves for Skully to grab. Like many of the later Mario games, the main path is relatively straightforward, but many sequences become longer and more challenging if you're diligent about collecting every leaf.For completionists, the act of gathering leaves is meant to be motivation unto itself, but it's a hollow pursuit. They aren't tied to the story in any way, nor do they give you health, unlock levels, or confer any other gameplay benefits. As your cumulative leaf total rises, you'll unlock character art, but that's it. I often tried to grab out-of-the-way leaves because I wanted a more challenging experience, but the extra effort wasn't especially satisfying without any kind of meaningful reward. And Skully's rolly movement, while novel, isn't satisfying enough to be its own reward.And Skully's pleasant but monotonous-looking levels don't compel you to find their hidden nooks and crannies. While there's a decent variety in the types of areas you'll find, many of the individual levels lack the level of visual detail to make a strong impression. You'll see the same types of trees and rock formations used multiple times and across multiple levels in the same biome.Likewise, as a puzzle game, Skully often fails to push you and your skills. The golem's abilities are always used in very specific ways, so puzzle set-pieces simply come down to figuring out how to combine those skills and in what order. With such a limited set of abilities, rotating through the possibilities doesn't take very long. By the end, the puzzles do gain a measure of complexity and begin to feel like genuine brain teasers, rather than themed obstacles, but only in the game's final stretch.Simple or complex, though, the process of working through and solving puzzles gets tedious quickly. To switch between golem shells, you must manually eject Skully and roll him to another body or clay pool to make a new one. The process makes completing puzzles take longer than it should, even after you've solved it, sucking the energy out that crucial eureka moment when you put all the pieces together.But there are also times when Skully aspires to provide something more complex or even profound. Its story, a tale of feuding elemental god-siblings, conveys a heavy-handed but insightful allegory about the effects of grief on our closest relationships. Unfortunately, the power of the story is undercut by jarring storybook-style cutscenes, which pair conversations between characters--not narration--over static images of characters. The pace at which the pages turn changes, sometimes to sync up with cues in the dialogue, other times to create a light stop-motion effect. The changing pace was distracting; I couldn't shake the feeling that something was technically off.Across the board, Skully occasionally shows signs of strong, creative design, but often in isolated, incomplete forms. A cutscene's well-written dialogue gets hamstrung by its animation. A strong platforming sequence feels hollow because its challenge offers little reward. A puzzle takes more time to complete than to solve. Even with those flaws, Skully isn't altogether unpleasant. It lacks the depth and attention to detail to make the act of rolling, running and jumping an act of joy unto itself."}