{"ref": "https://www.gamespot.com/reviews/burnout-review/1900-2822099/", "date": "May 17, 2006", "game_name": "Burnout", "text": "If reckless driving citations were handed out to virtual drivers, then the racers in Burnout would find themselves restricted to the cozy confines of the local precinct. But in the traffic-filled streets of Burnout, there is hardly a police officer to be found. So, left to their own devices, the racers in the game weave through oncoming traffic, run red lights, play chicken with massive 18-wheelers, find themselves involved in a wide variety of crashes, and otherwise run rampant on streets and highways cluttered with hundreds of cars, vans, trucks, and other assorted vehicles.With its checkpoint-based racing, Burnout is a fast-paced arcade racer that will challenge the resilience of anyone's nerves. In the game, players are thrust into a variety of environments that are based on, but not actual replicas of, US and European cities. The objective, for the most part, is to avoid crashes in order to stay ahead of three AI racers who are competing with you for a first-place finish. In practice, this translates to a fun gameplay experience and a game that is easy to pick up and play. Although Burnout's primary single-player modes can be completed in four to six hours, like most racing games of this sort, you will find yourself coming back to the game intermittently for the twitch-based racing and the rush of driving at speeds of over 100 miles per hour through rush-hour-style traffic.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Burnout Video ReviewBurnout has five primary modes of play: championship, single race, time attack, head-to-head, and a specials area where you can face off against a single AI driver or try the survival mode, where you have to complete a course without crashing. The meat of the gameplay is naturally in the championship mode. Here players must compete in a six different grand prix events. Most of the events have three races, in three different environments, and much like in so many previous arcade racers, the objective is to achieve a required finish position. For example, in the game's first Journeyman GP event, the game requires third- and second-place finishes to advance, while one of the latter events, the Twilight GP, requires three first-place finishes to move on. The competition also gets tougher in some of the later events, as you'll be racing against high-power muscle cars and GT cars. In this way, the level of difficulty in the game achieves a nice balance. The championship is easy to get into, and the first four events are relatively painless, but the last two events can take quite a bit of persistence to complete, require a bit of luck, and will challenge even the most skilled arcade racing fans. Aside from the championship mode, the game's head-to-head mode is also quite entertaining. However, because of the inherent gameplay style of Burnout, one specific issue tends to arise in most head-to-head games. Although the game's AI is quite serviceable, after some play time with the game, it can also become very predictable. Driving into oncoming traffic, you'll soon realize that the AI drivers will almost always swerve out of your way, so the best method of attack is to simply drive in a direct line. Also, there are several scripted traffic situations in each of the game's levels, and after playing the game for a while, you begin to recognize, and avoid, these events. All this can lead to an unbalanced two-player game, particularly when playing against a friend who is picking the game up for the first time. Burnout should have been all about chaos and unpredictability in these head-to-head games, but in general, a player who recognizes the game's AI tendencies and scripted events will be able to win, even if the opposing player is more skilled. Still, even the most astute racer will get into some pretty horrific crashes, and these wrecks are one of the game's major selling points.Every accident in Burnout is highlighted and replayed for the player. Drive into the back of a semi, for example, and you will be treated to three different replays from a variety of camera angles. You can also activate the game's replay mode and watch the crash in slow motion, with 360-degree control of a rotating camera. These replays can even be saved and played back at will. Some of the crashes can be pretty insane and entertaining to watch, but they can also be quite jarring to the general game flow. As mentioned, the game moves at a breakneck pace, and you'll often find yourself totally immersed in the act of surviving rush hour traffic, but the crash replay suddenly removes you from this experience. They last just long enough to make you frustrated and anxious to return to the action to catch up with the opposing racers. Perhaps only one replay, rather than three different camera angles, during the course of the game would have worked more effectively. The multiple-angle replays could have been saved for the game's replay mode. In terms of visuals, Criterion has put its own Renderware tool to good use. Many of the street tracks in Burnout are quite expansive, and most are littered with lots and lots of ambient geometry, such as skyscrapers, smaller buildings, houses, trees, traffic lights, and more. Even with all this detail in the environments, the game's draw distance, when not being limited by buildings and plazas in the foreground, goes out to the horizon. There is hardly a hint of pop-up in the game, and, in spite of all the detail, the frame rate is always silky smooth. Still, there are some problems with aliasing, as the traffic and environments seem to blend together in the most distant points of the player's field of vision. Overall though, the game's environments are some of the most stunning yet seen on the PlayStation 2. The cars in Burnout are almost equally impressive. The models are based on real-life cars, but they don't carry the manufacturers' licenses. So, for example, you'll find cars that look like the Dodge Viper and the Toyota MR-2, but in the game they are simply included under a generic list of muscle cars and roadsters, respectively. The amount of detail in the cars, although not nearly approaching the level found in games such as Gran Turismo 3, is on par with that of games like Ridge Racer V for the PlayStation 2. Perhaps the weakest link in Burnout is the game's soundtrack. The game features 10 songs, most of which are of the techno variety. Aside from a couple of catchy tunes, the music can become repetitive quite quickly. The car's engine sounds are just as unassuming. A lot of the cars sound the same, and the ones that don't, like the muscle cars, don't growl when revved like similar real-life models. Burnout is one part Ridge Racer, one part Tokyo Xtreme Racing, and one part Crazy Taxi. In typical Ridge Racer style, it is quite easy to get sideways and powerslide through sharp turns--controlling these powerslides just right and at the same time avoiding traffic can be challenging and entertaining. Like in Genki's Tokyo Xtreme Racing, you'll find yourself racing against intelligent AI racers through traffic. They will jockey for position and otherwise try to run you into other cars. Finally, as with the so-called crazy throughs in Sega's Crazy Taxi, the game rewards the player for driving into oncoming traffic and for near misses. Burnout has a heart rate meter that increases with every near miss, and once full, it can be used to turbo. Here the screen goes into a blur and the game's speed doubles. The first time through Burnout doesn't last very long, especially after you learn to recognize the AI tendencies and some of the game's scripted traffic. However, anytime you feel the need for a nerve-racking racing experience, it is the type of game that you can come back to and play from time to time and enjoy thoroughly. Burnout is one of the most intense and entertaining racing games on the PlayStation 2, complete with tight controls and impressive graphics.Every accident in Burnout is highlighted and replayed for the player. Drive into the back of a semi, for example, and you will be treated to three different replays from a variety of camera angles. You can also activate the game's replay mode and watch the crash in slow motion, with 360-degree control of a rotating camera. These replays can even be saved and played back at will. Some of the crashes can be pretty insane and entertaining to watch, but they can also be quite jarring to the general game flow. As mentioned, the game moves at a breakneck pace, and you'll often find yourself totally immersed in the act of surviving rush hour traffic, but the crash replay suddenly removes you from this experience. They last just long enough to make you frustrated and anxious to return to the action to catch up with the opposing racers. Perhaps only one replay, rather than three different camera angles, during the course of the game would have worked more effectively. The multiple-angle replays could have been saved for the game's replay mode.In terms of visuals, Criterion has put its own Renderware tool to good use. Many of the street tracks in Burnout are quite expansive, and most are littered with lots and lots of ambient geometry, such as skyscrapers, smaller buildings, houses, trees, traffic lights, and more. Even with all this detail in the environments, the game's draw distance, when not being limited by buildings and plazas in the foreground, goes out to the horizon. There is hardly a hint of pop-up in the game, and, in spite of all the detail, the frame rate is always silky smooth. Still, there are some problems with aliasing, as the traffic and environments seem to blend together in the most distant points of the player's field of vision. Overall though, the game's environments are some of the most stunning yet seen on the PlayStation 2. The cars in Burnout are almost equally impressive. The models are based on real-life cars, but they don't carry the manufacturers' licenses. So, for example, you'll find cars that look like the Dodge Viper and the Toyota MR-2, but in the game they are simply included under a generic list of muscle cars and roadsters, respectively. The amount of detail in the cars, although not nearly approaching the level found in games such as Gran Turismo 3, is on par with that of games like Ridge Racer V for the PlayStation 2.Perhaps the weakest link in Burnout is the game's soundtrack. The game features 10 songs, most of which are of the techno variety. Aside from a couple of catchy tunes, the music can become repetitive quite quickly. The car's engine sounds are just as unassuming. A lot of the cars sound the same, and the ones that don't, like the muscle cars, don't growl when revved like similar real-life models. Burnout is one part Ridge Racer, one part Tokyo Xtreme Racing, and one part Crazy Taxi. In typical Ridge Racer style, it is quite easy to get sideways and powerslide through sharp turns--controlling these powerslides just right and at the same time avoiding traffic can be challenging and entertaining. Like in Genki's Tokyo Xtreme Racing, you'll find yourself racing against intelligent AI racers through traffic. They will jockey for position and otherwise try to run you into other cars. Finally, as with the so-called crazy throughs in Sega's Crazy Taxi, the game rewards the player for driving into oncoming traffic and for near misses. Burnout has a heart rate meter that increases with every near miss, and once full, it can be used to turbo. Here the screen goes into a blur and the game's speed doubles.The first time through Burnout doesn't last very long, especially after you learn to recognize the AI tendencies and some of the game's scripted traffic. However, anytime you feel the need for a nerve-racking racing experience, it is the type of game that you can come back to and play from time to time and enjoy thoroughly. Burnout is one of the most intense and entertaining racing games on the PlayStation 2, complete with tight controls and impressive graphics."}