{"ref": "https://www.gamespot.com/reviews/stacked-with-daniel-negreanu-review/1900-6152254/", "date": "June 2, 2006", "game_name": "Stacked with Daniel Negreanu", "text": "For the average person, it would be pretty easy to dismiss the vast majority of console and PC poker games available at retail price as hackneyed cash-ins on a trend that, as of now, is kind of falling by the wayside. For serious poker enthusiasts, it's even easier to dismiss most of these games, since they all tend to suffer from the same silly issues. The presentation always sucks, the opponent artificial intelligence is frequently exploitable, the list of features is never deep enough, and so on and so forth. Stacked with Daniel Negreanu is the first poker title from developer 5000 Ft., and a quickly hacked together poker game this is not. Stacked takes a laserlike focus to the game of Texas hold 'em, exclusively building its multifaceted artificial-intelligence routines around the workings of that specific variation of the game and then building a video game around it that functions pretty well as a learning tool for would-be hold 'em players. By no means is the system perfect, but compared with the dregs of what else is out there, Stacked stands out as the most engaging and smartest game of poker currently available. Stacked's AI knows when you've played bad or good, so be good for goodness sake! The basic premise for Stacked is that the game's artificial-intelligence model is built off of a system called Poki. It's some kind of superscientific computer system that doesn't just react to your play style using a few different canned reactions--it's actually built to learn what you do as you play and react based on what it learns from you. For example, if you throw in a bet with nothing, the AI comes back over the top with a big raise, and you bow out, it'll learn that you're not necessarily the type to throw down when you don't have a made hand. Conversely, if you play things a little bit recklessly, throwing out big bets on lousy hands to try and make a bluff, the AI will start to challenge you more and more to the point where it simply won't buy your load of malarkey. There are purportedly eight different AI bots in the game, each of which plays a little bit differently, though you'll have a hard time discerning all but the most extreme personalities. There's always at least one guy at the table who plays superaggressively and one who plays a Dan Harrington-esque tight game. Everyone else is somewhere in between and tough to pick apart. Though Stacked includes both cash game and tournament-style play, the AI seems built more specifically for tournament games. Low-stakes cash games with small blinds yield the type of cautious play seen more often in high-stakes tournaments with frequently increasing blinds. Of course, that also means that the AI plays those tournaments superrealistically, but if you're the type that just wants to play a leisurely cash game for little money, you might be a little flustered by the AI's frequent tendency to fold out before the flop even comes down. There are also some ways to exploit the AI's learning tendencies by basically playing like a complete jerk for long stretches, going all-in constantly, raising like a lunatic, and so on. But even then, the AI will only react improperly if you're magically successful at this methodology. If you start getting called on your nonsense and lose frequently, no exploits present themselves. So if you play the game like your chips actually matter, you won't run into any such troubles. All told, despite a few quirks, Stacked's AI is the best currently available in a console or PC poker game. It plays a smart and varied game that can be pretty challenging if your game isn't tight. Fortunately, after enough time spent with the game, it will almost certainly teach you a thing or two, both through its basic gameplay and through the helpful hints provided by cover boy Daniel Negreanu. Negreanu's presence is felt throughout much of the game. There's a poker-school feature with pretaped educational segments hosted by Negreanu, as well as a number of in-game hints that advise you on what you ought to do for a hand. For the most part, this advice is great. Negreanu gets fairly detailed on what kinds of actions you should take. For instance, if you get a small pair dealt down, he'll tell you to take a stab at the pot with a bet, without building you up too high on your hand. After the flop, if someone else comes over the top with a sizable bet, he'll advise you differently depending on whether you hit the flop or missed it entirely. The advice doesn't get terribly granular, in that he doesn't go out of his way to explain why you should take a specific action, but for the most part he's usually right--emphasis on usually. There are moments where he'll inexplicably tell you to go all in with nothing but rags at totally random times, and others still where he'll fail to recognize someone trying to push you all in and simply tell you to call on the hope that you'll get something on the turn or the river. But these incidents aren't necessarily the norm when it comes to getting advice from the pro, and usually it's good information. The other ancillary elements of the game are mostly pretty good, if a bit slow and clunky in spots. The general interface is a good one, with a one-button pop-up to show you your hole cards at any time and a quickly accessible bar menu that lets you access Negreanu's tips, as well as display a couple of different emotional reactions when you want to. These smiles and frowns are basically an extremely rudimentary tell system that really has next to no impact on the game, and they're just not worth using. One nice feature the game includes is the ability to see a percentage meter that measures your hand strength against the general card odds and the number of people still in the hand. It's not like it tells you what everybody else has, or anything, but it gives you a sense of where you likely stand in the hand. Getting through a hand that you've folded out of quickly simply involves pressing a button to quickplay through it (although you might miss out on some key intel by doing this). However, as a whole, Stacked is a very slowly paced game. Tournaments can sometimes take in upward of a couple of hours to complete, which is a little taxing given the lack of any real background music or useful banter to keep you entertained while you're sitting around. The player dialogue only pops up in short bursts at random intervals, and it's all pretty mindless, terrible stuff. The Xbox version doesn't even support custom soundtracks, making the audio experience largely worthless and the game itself a little duller than it would be otherwise. Stacked's tight focus on making a realistic offline game of Texas hold 'em is entirely admirable and mostly successful. However, those who have come to expect much in the way of features in their poker games might be a little disappointed with Stacked's package. The requisite career mode and online play are available, with the career spanning a whole host of tournaments and cash games against no-name players and a few licensed pros, and the online play includes similar types of games to be played against real-life opponents, as well as a number of hosted tournaments. The career mode and online play are sure to keep players busy for a good long while, but beyond them, there's just not much here in the way of variety. The character-customization element of the game is pretty underwhelming, only letting you change the basic hairstyles and clothing-color schemes of a little over a dozen different character models. There are also no variations of poker available apart from Texas hold 'em. Yes, it is the Cadillac of poker, but even having a few draw or stud variants would have been nice. Perhaps Poki hasn't learned those games yet. Negreanu's influence is stamped all over Stacked, and that stamp helps make Stacked a better than average learning tool. Graphically, Stacked isn't much better or worse than any of the other poker games on the market. The character models found in the game are a little more detailed than you tend to find in poker titles, but the animation is still kind of stiff. There also aren't an awful lot of casinos or different environments to play in, so you tend to see a lot of the same poker rooms over and over, and they're not really that great looking. Worst of all, the chip stacks are awful looking. You'd think a game called Stacked would at least get the chip stacks right, wouldn't you? The game has a couple of available camera angles, but the frame rate does occasionally bog down, especially on the PlayStation 2 version of the game. The Xbox version looks slightly better than the PS2 one, and the PC version predictably looks the best. It's also the easiest to play, as the interface seems a little more geared toward mouse-and-keyboard controls than a controller setup. Not to mention that the game defaults to a windowed mode method of play; this actually works best for this type of game. What it ultimately comes down to with Stacked is just how much you want to play a realistic, offline game of Texas hold 'em. There's certainly no shortage of ways to play this game for free on the internet, but playing against random online players doesn't always provide you with much tangible feedback on how your game stacks up in a real cash game or tournament environment. Admittedly, Stacked's AI system doesn't always pull this off either, and there are holes in Stacked's game, but far fewer than most other poker titles, and it's the best measuring stick for your personal poker skills available in the realm of entertainment software."}