{"ref": "https://www.gamespot.com/reviews/unreal-ii-the-awakening-review/1900-6089390/", "date": "February 13, 2004", "game_name": "Unreal II: The Awakening", "text": "Unreal II: The Awakening has finally made its debut on the Xbox, about a year after it was originally released on the PC. As one of the most well-recognized franchises in the first-person shooter genre, fans waited for Unreal II with much anticipation, only to be disappointed by a short, uninspired single-player campaign and a lack of multiplayer options. Though the latter problem has ultimately been addressed by an add-on for the PC version, Xbox owners will be underwhelmed with this version of Unreal II because it plays and feels like a watered-down port. Textures suffer from a notable lack of detail. The first thing you'll notice is that the game looks pretty average, by Xbox standards. This is particularly galling, given that one of Unreal II's few strengths on the PC was its first-rate graphics, which still hold up well today. On the Xbox, textures are noticeably blurrier than on the PC, and many of the pretty normal-mapping effects seem to have been stripped out. Armor doesn't glint and glisten in the light, and exposed skin looks rather flat. Polygonal detail in the enemy and character models also seems to be compromised. Even color depth in the game is lacking, which is most noticeable in shadowy caves, where you'll see ugly banding in the darker areas. The game's animation suffers from jerkiness, especially during cutscenes. Additionally, the frame rate is uneven and will often take a dive during intense firefights or in large areas. Not everything about the presentation is bad, though. Unreal II still offers scenic views of the terrain and presents an interesting variety of environments, both indoor and outdoor. Fire that comes from the flamethrower also looks pretty good, and it's still satisfying to ignite enemies to watch them run around while trying to put out the flames. The sound effects and music also work well, but they aren't exceptional. The voice acting is also pretty decent, with the voice actors doing their best to make lemonade out of a lemon of a script and story. The single-player campaign in Unreal II is mostly unchanged from the PC version. You'll assume the role of John Dalton, a former space marine who's been demoted to the Colonial Authority (basically a transgalactic police force) along with a few other marine rejects. You eventually find yourself mixed up in a quest to find seven mysterious and powerful artifacts. With several hostile races and power-hungry corporations vying for control of these relics, you'll fight your way through 12 varied and mostly well-designed missions trying to retrieve all the artifacts. Some will have you working with a team of marines to defend an area against enemy attack by using deployable turrets and force field generators. Others include your basic infiltration and retrieval missions, which often culminate in boss fights. The actual combat in the game is pretty standard fare. Enemy AI is passable, but it's nothing special. The arsenal, at least, is pretty interesting and varied, and each of your weapons has an ~alt-fire.~ Guns range from standard assault rifles and rocket launchers to laser rifles, flamethrowers, and grenade launchers (with a variety of grenade types). The game includes two difficulty levels, labeled normal and hard. In practice, these options actually mean ridiculously easy and normal. At the ~normal~ difficulty level, enemy fire hardly scratches your shields, thus allowing you to play in a sloppy manner so that you can still make it through the entire game without dying. The ~hard~ level is a closer approximation to the PC version's difficulty level. However, experienced shooter fans still won't have too much difficulty making it through the six-hour campaign. You can no longer save the game at any point, but the developers have thoughtfully included a few checkpoints at logical junctures in each mission. You'll still want to avoid dying, though, because the load times are pretty long. A few minor changes to the campaign have been made. For instance, some of the missions have had sections stripped out of them. For example, you won't have to ~exfiltrate~ from the target area in the Severnaya dam mission, thus cutting a few minutes of filler out of one of the game's less-inspired levels. A more notable change is that the annoying interludes on the Atlantis ship have been streamlined. You no longer have to explicitly walk from character to character to move the plot along, and the useless dialogue trees have been axed as well. Instead, all the talking sequences have been compiled together and are played back for you in a logical order. The method ends up looking about as sloppy as it sounds, but the most important thing is that you are able to quickly skip through all of the talking points to get straight to the action. Another plus worth noting is that two-player split-screen cooperative multiplayer has been added. The value of this feature is suspect, given the brevity and difficulty level of the campaign, but it's there nonetheless. The Xbox version of Unreal II ships with the XMP multiplayer mode that was just released as a free patch for PC players. On the Xbox, this mode is playable for up to 12 players over Xbox Live or via System Link. The game is a variation on capture the flag. Two teams vie for control of four artifacts in each map, with each team starting off with two of the artifacts. The match ends when one team controls all four artifacts. If the timer runs out without one team in possession of all four artifacts, the team with the most points wins. Three different classes of varying abilities and weapon loadouts are available, and players can also use a few different types of land vehicles to traverse the maps. XMP borrows some gameplay conventions from other popular shooters. So, like in Battlefield 1942, there are scattered spawn points that can be captured throughout the map. These can allow one team to reinforce forward areas more quickly. Teams can also deploy automated defenses, such as land mines, turrets, and force fields, but all these items require a steady source of power. This power can be gained by controlling generators that are scattered around the map. The game's scoring system is pretty well designed and awards a generous number of points for performing key tasks. You can gain tons of points by defending the artifact room, escorting artifact carriers, and capturing generators and spawn points. The fact that kills are not explicitly counted (instead, you just get points for them) helps in fostering a teamplay mentality. At least the terrain still looks pretty. On the PC, the struggle for power, spawn points, and artifacts results in a tangible flow from one area to another as the two teams probe each other for weaknesses and move to exploit them. Unfortunately, the multiplayer on the Xbox often feels more like a frustrating game of musical chairs than it does a true test of strategy. The problem stems from the fact that the maps are optimized for more than just 12 players. Even though Unreal II includes the three smallest maps from the PC version of XMP (and a fourth map that was reduced in size), there simply aren't enough players in a match to properly populate a match. The problem is exacerbated online, because the game tends to suffer from noticeable lag when more than eight players are in a match. Consequently, most users set their servers to accept only eight players. The fact that only four maps are currently available reduces the value of multiplayer as well. In summary, Unreal II: The Awakening for the Xbox takes the best aspects of the PC version (namely the graphics and the multiplayer mode) and weakens them, thus leaving a product that's still competent but not nearly as appealing as it should be. If you're already playing Unreal II for the PC, there's really no reason to pick it up on the Xbox. The reduced player limit in matches more than cancels out the benefit of voice communication on Xbox Live. Xbox owners looking for a good shooter should probably consider the other, better alternatives already available."}