{"ref": "https://www.gamespot.com/reviews/saw-review/1900-6232574/", "date": "October 9, 2009", "game_name": "Saw", "text": "If you're the squeamish sort, it's best to stay far away from Saw--but then again, if you're familiar with the popular films upon which this horror adventure is based, you already knew that. In Saw, you'll witness (and cause) a number of gruesome, blood-spattering deaths as you make your way through the kind of elaborate puzzles that murderous maniacs often spend large amounts of free time concocting. The complex setups are a franchise staple, so they come as no surprise. The real surprise here, depending on your point of view, is that Saw actually turned out to be somewhat enjoyable. It's got a number of issues: the combat is atrocious, and the game wears out its welcome a few hours before it limps across the finish line. Yet for all its clunkiness, Saw makes an impression. ~Fun~ may not be quite the word to describe the tense and anxious emotion that hovers over you as you play, but that's as it should be. The Saw films inspire loathing and dismay, and the fact that the game inspires the same sensations is no small feat. As expected, villain/antihero Jigsaw is Saw's guiding force, and he has a simple but loaded question for you: ~Would you like to play a game?~ You're David Tapp, the first film's unrelenting detective and the newest kidnapped subject in Jigsaw's remorseless tests. Jigsaw has removed the bullet Zep Kindle blasted into your chest and replaced it with a key--the key every other player in Jigsaw's murderous game needs to escape from the mental asylum in which you're held captive. The enigmatic psychopath leads you through a series of trials in which you must help other victims wriggle free of their complicated traps, though these victims aren't just random citizens plucked from the streets. Rather, they figure in Tapp's life, and some will be familiar to fans of the films. Jigsaw's pop-psychology rationalization for his behavior (you can't appreciate life until you're forced to savor every individual breath) plays a huge role in the story. But even if you never quite buy into his topsy-turvy view of personal responsibility, actor Tobin Bell's raspy wheeze convinces you that Jigsaw himself believes in his own ramblings. In fact, the voice acting is great across the board, and when character dialogue overlaps, you won't run into the awkward pauses that so often plague vocal exchanges in other games. You'll spend the majority of your time skulking about the dark, gritty hallways of the mental asylum Jigsaw has appropriated for his sundry evils. Most of your obstacles come in the form of puzzles--some simple, and some not. Picking a lock requires you to rotate discs to match a sequence of shapes, using an age-old mechanism familiar to adventure fans everywhere. Opening certain doors or shutting down the surge of poisonous gases involves turning fuses to direct the flow of electricity to the necessary nodes, another age-old standby. Other recurring puzzles are somewhat more original, such as those in which you must connect a line of pipes from the outside of a multi-ringed disc to the center. The most interesting puzzles, however, are those used when freeing your victims. One plays like the old card game concentration, but with a twist. In another, you redirect streams of poison and antidote to the correct receptacles. Considering the high-intensity situations, many of the puzzles seem too pedestrian--ordinary puzzles in an extraordinary setting. But Saw keeps you on your toes by placing a time limit on your puzzle solving. An impending explosion might be poised to take you down unless you can enter the correct code on a lock and hightail it out of there. The room will fill with noxious fumes that will continually deplete your health until you can align fuses and get the place ventilated. The time limit keeps the pressure on, which usually works out well, given that it provides the sense of urgency needed to keep tensions high. In a few sequences, however, the game goes a bit too far. In one late-game sequence, you have to search a bunch of lockers for necessary puzzle-solving items, turn off the flow of hot steam, solve three rotate-the-fuse puzzles, and deal with poisonous emissions--all while under the threat of a timer. Right after that, you have to do much the same thing, but also defeat an attacker for good measure. Sequences like these will have you cursing up a storm. Don't move--you've got something on your face. The combat is a much more frequent source of frustration. It's just terrible. There are a number of items you can use as weapons, such as baseball bats, crowbars, and even pistols, and they can be used only a few times before they break or become useless. Unfortunately, battles feel like slow-motion slap fights. Swings seem to take forever to gather momentum and the melee controls are highly unresponsive, so it's impossible to develop any kind of combat rhythm. Furthermore, the collision detection is flat-out broken, so weapons only need to be sort of close to their target to do damage. You can counter attacks and pull off finishing moves, but the timing of counters is inexact, and poor animations and unimpressive sound effects diminish the sense of impact you would expect from such brutal moves. Fortunately, you won't need to rely on fisticuffs often. Saw is, first and foremost, a puzzle adventure; you won't hate the combat portions as much as you'll try to get them over with as quickly as possible. Luckily, you have a few other offensive tricks up your sleeve besides boards with nails in them. Using items you find in cupboards and desks, you can put together a few different types of traps, such as gas traps or explosive traps. You can also rig preset locations with wired traps that will kill most combatants instantly when they cross them. If there are stray electric wires strung through a puddle, you can even electrocute enemies with a little fuse box manipulation. Bonking your foes on the head with a bat is perfectly effective, but there's a greater sense of glee when you manage an environmental kill. If you prefer to avoid combat when possible, you can be more defensive, locking adversaries out and bolting the door shut or moving a big crate in front of it, but encounters are easy enough that you'll probably never need to do so. Sure, buddy, I can give you a light. In spite of Saw's combat struggles, tensions often run high. As you navigate the dark corridors, you use a lighter or flashlight to help guide you (you can also use a camera's flash, though it's all but useless). At various points, you'll avoid chopping blades while sliding through tight spaces and try to gain access to a door before freezing to death, and these moments are tense and disturbing. In contrast, sections where you must balance your way across narrow boards suffer from unresponsive controls, thus inspiring the wrong kind of tension every time you have to cross a chasm lined with spikes. You also need to keep your eyes peeled for trip wires rigged by enemies and be ready to jab a button for the occasional quick-time event. Speaking of which, such timed button presses are implemented particularly well in Saw. The button in question isn't flashed in a gaudy fashion in the middle of the screen as it is in so many other games; instead, it appears on the object you are interacting with, which makes the event feel less contrived. After a while, the adventure begins to wear out its welcome. In the final few hours, the repeated puzzle types, the backtracking, and the sameness of the dank visuals and cramped hallways dull Saw's edge. Nevertheless, the game faithfully captures the heavy sense of dread that pervades the films, so it's a natural extension of the movie-going experience. Franchise fans will likely lap it up, though Jigsaw's latest scheme is unfortunately missing some important puzzle pieces."}