{"ref": "https://www.gamespot.com/reviews/clutch-review/1900-6214696/", "date": "August 3, 2009", "game_name": "Armageddon Riders", "text": "Any number of games feature their share of zombies, mutants, and other humanoid horrors--but how often do you use them as literal fuel for destruction? Well, you can do it in Clutch. This car combat game attempts to bring the joyful violence of the Carmageddon series to a modern audience, encouraging you to take to the streets and fill up your boost meter by running over as many mutants as possible. Clutch has numerous flaws; presentational issues and monotony throw a monkey wrench into the engine. And multiplayer racing--a feature the game practically screams for--was apparently disintegrated by the same radiation that gave rise to the grotesque goons you're squishing. Nevertheless, a variety of events, a bizarre paranoid storyline, and the endless delight of staining the streets with mutant blood make Clutch an entertaining (if overpriced) look at modern technophobia. Considering the simplicity of its racing action, Clutch is more of a story-focused game than you might expect. The setting is near-future Europe, where an unexpected quantum catastrophe at the Large Hadron Collider (a gigantic particle accelerator due to open in late 2009) has turned most of the region's population into mush-brained mutants. As a racer named Clutch, you join a band of hoodlums called the Harvesters and attempt to discover the secrets of the Collider. There are no cutscenes or spoken dialogue; the tale is doled out entirely within journal entries displayed before story challenges. This isn't an engaging way of delivering a narrative (and some weird translation issues don't help), but you shouldn't take the game up on its offers to turn off journal entries. The images they conjure--a blind cult leader, human sacrifices--are bizarre and disturbing, and they create a vivid picture of a society driven mad by fear. Under the weight of these grave circumstances, you take to the streets on and around the accelerator campus, participating in challenges and earning funds to spend on new vehicles and vehicle upgrades. It's an open world, albeit not a very large one, but it provides plenty of opportunity for standard racing and other events. In some cases, winning is just a matter of beating competitors to the finish line; in others, you need to crash into opponents as they speed about trying to collect artifacts. Some of these events go on for too long and have you retreading the same ground over and over again, which leads to monotony. But among arena face-offs, mutant killing sprees, and other challenges, you're given plenty of ways to experience the enjoyable, nuclear-charged mayhem. The highlights come within the Collider itself, where winding tubes and side passages add some sci-fi oomph to the action. Rushing around the streets and corridors is fine, but the driving, on its own, doesn't feel very fast or furious. Fortunately, the mutated meanies are there to spice things up. Squashing them fills up your boost meter, which allows you to zoom along at a faster clip for a short period of time. It's also consistently funny, in a slightly horrific kind of way. Your hood will be covered with blood, bodies will fly everywhere, and mutants will emit bloodcurdling shrieks as you slam into them. Upgrading your vehicle with spikes and other melee equipment (sadly, there aren't any guns to attach) makes the slaughter even more gruesome--and more fulfilling. It's a sick and wonderful thing. Yet, as fun as it is to mow down mutants while battling other drivers, it's impossible to overlook Clutch's numerous flaws because they're so easy to spot. This is clearly a budget game, evidenced not just by its slightly discounted price (it currently sells on the Steam digital download service for $29.99), but also by its production values. It looks fine but dated by modern standards, so don't expect fancy reflections, complex damage modeling, or detailed textures. Nevertheless, Clutch is easier on the eyes than it is on the ears. Engine noises are dull, and the soundtrack features artists you've probably never heard of performing grating tunes you never wanted to hear. Clutch doesn't just feature blood. It also has sparks. More notable is the jarring lack of transitions at the end of events. There is no visual indication of the finish line during races, and when you do cross it, the results screen immediately pulls up without warning. If you were tapping the boost button at the same time, you may end up restarting the event inadvertently because the boost button and the restart button are the same in some cases. This is a small but annoying issue that makes you realize how such a small element can make such a big difference. If you prefer a close-following third-person camera (there are a few camera views from which to choose), you may also get occasionally annoyed by camera jitters and positions that obstruct your view in the more confined areas. It's a pity that you can't play the game with others, either locally or online; chasing after artifacts with real players on your tail would have been a riot and would have made the price tag more bearable. But even with this gaping maw unfilled, and in spite of a number of obvious flaws, Clutch is good fun and the first game in some time to cater to Carmageddon's ~chemically imbalanced~ crowd. It's also the only game to take place in the world's largest particle accelerator, which puts it in a class all its own."}