{"ref": "https://www.gamespot.com/reviews/commandos-strike-force-review/1900-6147729/", "date": "April 14, 2006", "game_name": "Commandos Strike Force", "text": "The Commandos series dates back to 1998, and it was always a whole lot easier to like than it was to describe. While the Commandos trilogy looked and played like real-time strategy games, they combined tactical action and puzzlelike situations from an isometric perspective. The result was some tense, open-ended, and highly challenging scenarios. Now Commandos is back in--wait for it--a World War II-themed first-person shooter. This latest entry in the series attempts to integrate some of the distinguishing features of the previous Commandos into a fast-paced WWII action game, but it just doesn't execute on its ideas as well as a lot of other similar games do. The strategy roots of Commandos Strike Force are well hidden beneath the guise of a generic WWII shooter. The transition from strategy game to shooter has also served to limit the scope of Commandos Strike Force. In the previous games, you'd get to control a squad of specialized soldiers who could spread out to assault and sabotage huge Nazi compounds. In Strike Force, there are just three characters forming the squad (and they're nobody Commandos fans will recognize): a Green Beret, a sniper, and a spy. These guys combine some of the abilities of the other Commandos characters. For example, the sniper is also an expert with deadly throwing knives and happens to be a great swimmer, so he's like a cross between a sniper and a Marine. However, the game loses its predecessors' sense of you having to coordinate a complex invasion. Here you just tend to control one or two of these soldiers in a given mission, sneaking your way past Nazis or killing them in droves. The missions themselves still sometimes have an open-ended feel, such that you may have multiple objectives you can tackle in any order. But larger missions are divided up into multiple smaller zones, which diminishes the sense that you're deep behind enemy lines. The presentation isn't particularly compelling either, especially on the console versions, which look really bland. These missions feel like your average first-person shooter levels. Commandos Strike Force isn't particularly successful at telling you a compelling story, either, though it seems to try. The three soldiers have their own distinct personalities, from the wisecracking Lieutenant Hawkins (the sniper) to the slightly aloof Colonel Brown (the spy). But their interactions during between-mission cutscenes often seem disjointed and awkward (not to mention surprisingly filled with profanity for a T-rated game), and the missions themselves aren't always clearly related, so you really aren't drawn in from any of these respects. At least the characters play fairly distinctly. The Green Beret is a pretty generic gunner, the sniper's long-range rifle and throwing knives make him quite different, and the spy is able to take uniforms from dead enemies and infiltrate their ranks--he just needs to watch out for the piercing gaze of high-ranking enemy officers. This stuff may be conceptually interesting, but the quality of the underlying action isn't particularly impressive. The game's modeling of stealth is fairly simplistic, as you can just walk right up to an unsuspecting enemy as long as he's not looking your way. Keep a low profile by crouching, and even enemies looking straight at you will have a hard time seeing you. Enemies may be alarmed to find the dead bodies of their comrades, but since bodies simply disappear after a little while, this isn't much of a concern--just another knock against its sense of realism. Meanwhile, a highly convenient radar reveals all foes in the vicinity and often the direction they're looking in. This is useful while sneaking, but it feels almost like cheating when you're running and gunning, since you'll always know when there's an enemy around the next corner. Combine that with lousy, slow-on-the-draw enemy artificial intelligence, and you'll find that brute force rather than tactical prowess tends to be the path of least resistance through Commandos Strike Force. However, some missions force you to avoid detection, requiring you to slowly inch your way through a level you know you could probably just blast your way through if only the game let you. You can save anywhere, which will compel you to take a trial-and-error approach in each new situation. Why sneak your way through a Nazi compound when you could just smoke everybody? In addition to the single-player campaign, Commandos Strike Force offers an online multiplayer mode that's roughly the same on the PC, Xbox, and the PlayStation 2. You can theoretically get up to 16 players going on the PC or in a system link match on the Xbox, though the console versions are normally limited to an eight-player limit. But good luck finding people to play with. During a week's worth of attempts, we found only small handfuls of players on any of the given versions of the game. The matches we did get into felt laggy, meandering, and unfocused, lending themselves to lots of sniping. Playable modes include the typical deathmatch and team deathmatch, as well as a mode called sabotage, in which spies may attempt to interrogate fallen foes for a code to sabotage the enemy base. Of the small numbers of people that were playing Commandos Strike Force online, next to no one seemed to be bothering to try to get a grip on this team-based mode. Commandos Strike Force isn't a bad game...it's just similar to but worse than a large number of other World War II shooters. Its main distinguishing features--the ability to control a couple of soldiers through open-ended levels--aren't all that remarkable, and the core action doesn't cut it either. Consider this one a casualty."}