{"ref": "https://www.gamespot.com/reviews/brave-the-search-for-spirit-dancer-review/1900-6168827/", "date": "April 10, 2007", "game_name": "Brave: The Search for Spirit Dancer", "text": "It's a little ironic that the swan song from now-defunct Scottish developer Vis Entertainment, which made a name for itself with the deliciously antisocial State of Emergency in 2002, may end up being Brave: The Search for Spirit Dancer, a kid-friendly action adventure game that takes a superficial level of inspiration from Native American culture. It's a pretty harmless game with a very linear through-line, an eagerness to hold the player's hand, and a general desire to make the experience as low-impact as possible. It's not bad--it's just very disposable entertainment. Brave's use of Native American culture is pretty generic, but at least it generally avoids being offensive. Playing as young shaman-in-training Brave--not a brave, or the brave, just ~Brave~--your quest begins as you embark on the titular search for Spirit Dancer, a legendary shaman who vanished many moons ago. Spirit Dancer is said to be the only one capable of defeating Wendigo, the massive, demonic force that's terrorizing your village. As might be expected from the likes of a Saturday-morning cartoon, Brave learns secrets about himself and makes friends with a menagerie of woodland creatures (both anthropomorphic and realistic), eccentric shamans, and stoic spirit guides, all while under the guidance of the disembodied voice of a wise old shaman named Grey Bear. Not since Turok--wait, strike that--not since Prey has a broad pastiche of Native American culture been used for such ho-hum results as it has in Brave. It's a by-the-numbers narrative, but what helps keep Brave interesting is the way it mixes up the gameplay. Things start out pretty slow, and the game takes its sweet time introducing Brave's various powers, which grow to include a pretty eclectic catalog of proficiencies. He's got the basic third-person action hero abilities of running, jumping, swimming, scaling walls, flailing away at enemies in hand-to-hand combat, or locking onto and circle-strafing them with ranged weapons. He's also got plenty of abilities that play into the whole Native American angle, such as spear fishing, animal tracking, and animal mimicry, though the animal mimicry ends up playing the most central role to the gameplay. It starts off with Brave's ability to make convincing-sounding calls to beckon helpful animals or distract antagonistic ones, though on several specific occasions he's able to transform into a bear during combat, or into smaller woodland creatures in order to pass through tight spaces. Brave uses these abilities to add some spice to the otherwise unremarkable platforming and combat sequences that comprise the majority of the gameplay, along with the injection of unique set pieces that have you barreling down white-water rivers in a canoe or dive-bombing zombies on the back of a giant eagle. None of it's too daring, but it does a good job of staving off a sense of repetition. Once you get past the early introductory areas, the pacing in Brave is pretty upbeat. You move from one environment to another in pretty rapid succession, and though they're all thematically predictable (forest, desert, fire, ice, and the like), at least they're diverse. Part of what makes this whirlwind tour so speedy is that very little time is spent wandering around. Most of the levels feel narrow with just one point-A-to-point-B objective at a time, designed with the apparent intent of funneling you into the next area with minimal fuss. Your next objective is also always clearly marked on the onscreen minimap, and you can hit the select button at any time for even more explicit direction from Grey Bear. All of this in-game assistance compounds the fact that Brave just isn't very difficult. The platforming never gets too involved, the combat is stripped down, the lives are infinite, and the checkpoints are numerous. The story's bland, but at least there's a little diversity to the action. While a game's lack of challenge isn't an inherently bad thing, there's some out-of-the-blue bugginess that hurts the experience in Brave. On several occasions we experienced what looked like bizarre polygonal noise that would appear sporadically and block our perspective on the action, and it would eventually culminate in the game freezing altogether. This weirdness notwithstanding, Brave is still a pretty mediocre-looking game. There are occasionally some inspired art direction moments where you're faced with some uncharacteristically wide-open spaces, but most of the time the environments are pretty small in scope and short on detail. Brave and the other characters you'll encounter have been built with simple shapes in mind, which keeps them looking OK, but the whole chunky, faux-mystic vibe just makes the whole thing feel like a knockoff of Avalanche Software's Tak and the Power of Juju. The inconsistency of the voice work is a little bothersome too, with some characters playing it like they're supposed to be Cigar Store Indians, and others sounding like they got pulled from Anime Central Casting. The biggest issue a game like Brave faces is relevance. The PlayStation 2, which will probably continue to see new releases for a while to come but has definitely already peaked in terms of quality games, is a console absolutely rife with games that do exactly what Brave does, and across the board, they do it better."}