{"ref": "https://www.gamespot.com/reviews/anarchy-online-review/1900-2784822/", "date": "May 17, 2006", "game_name": "Anarchy Online", "text": "It's safe to say that Funcom's online role-playing game, Anarchy Online, has been one of the most widely and eagerly anticipated games this year. After all, it's the first so-called next-generation online role-playing game and the first to be released after its groundbreaking predecessors--EverQuest, Asheron's Call, and Ultima Online--and it should be the first to improve upon them. Up until Anarchy Online's release, press coverage of the game discussed its unique science-fiction setting, its intriguing playable characters, its innovative solutions to common gameplay problems, and its enormous and colorful gameworld. But when the game was released, it caused an uproar. Unsatisfied customers flooded the game's official Internet message board with angry complaints about severe problems, such as insecure registration, CD key errors, and in-game bugs and stability issues. So is Anarchy Online actually the outstanding game that all of its prerelease coverage has made it out to be? Yes, it is. In addition to the game's innovative and extremely enjoyable gameplay elements, Anarchy Online has a tremendous amount of personality; you can find it in the game's distinctive-looking environments, hear it in the game's excellent music, read it in the game's humorous, tongue-in-cheek manual, and see it in the game's characters, whether they're gesticulating to emphasize a point or modeling a new set of clothes. But isn't it a buggy game with real problems? Yes, it's that too. If you're familiar with Anarchy Online, you'll know that it's a massively multiplayer online role-playing game; that is, it's a game that lets you create a character from a set of different races and character classes and then go out and explore a huge online world with thousands of other players, improving your character by gaining experience levels and training various skills. Though it's certainly not the first game of its kind, Anarchy Online is the first to use a futuristic science-fiction setting. The game takes place on a remote mining planet called Rubi-Ka, some 20,000 years in the future, in the middle of a conflict between a huge megacorporation and the planet's rebel insurgents. You can choose to ally yourself with the Omni-Tek corporation or the rebel clans, or play as an independent character; and you can change sides in the conflict up to a certain level of experience, provided you can make it across enemy lines. In addition, the game lets you hunt the planet's various indigent animals and monsters for experience and money and also lets you undertake dynamically generated quests, or ~missions,~ for similar rewards. At the game's release on June 27, 2001, Anarchy Online's many early adopters encountered a number of serious problems. First, like all other online role-playing games, the game requires registration for a monthly fee--and credit-card registration initially wasn't handled on a secure server. What's more, many users had (and several continue to have, as of the time of this writing) problems registering the game's CD key and couldn't (and in some cases, continue to be unable to) even log into the game. Furthermore, at release, the game's login server simply didn't have the capacity to deal with the thousands of login requests that it would constantly receive from users trying to connect; so many players weren't able to play, because their client would repeatedly ~time out.~ And even when players were able to log into the game, they had to first download postrelease patches to play and would have great difficulty playing the game because of spontaneous crashes. What's more, the game suffered from (and continues to suffer from) some serious lag and frame rate problems, due in part to a lack of bandwidth on Funcom's servers and the game's own memory-intensive code, which tends to monopolize the RAM on its host computer. And users with ATI-based video cards have reported serious problems getting into the game and playing for any prolonged period of time. These are all serious problems that have made playing the game in its first few weeks of release extremely frustrating for many users, since many have either had a hard time staying connected to the game or simply haven't been able to get in. So is Anarchy Online nothing more than a thoroughly unplayable mess? No, it's not. For starters, Funcom made a secure registration server available two days after the game's launch and instituted a fix for one of the game's major CD key problems two days after that. The development team has also released over the past two weeks a steady stream of small client- and server-side patches that have required brief downloads for users and one-to-two-hour blackout periods for server maintenance. These updates have improved the game's performance and stability noticeably and have greatly increased the login server's ability to bring players into the game. [Ed. Note: Funcom released a patch the evening of 07/13/01 that has improved Anarchy Online's performance with ATI cards.]Funcom has also sent a second version of the game's code to production so that new users won't have to download the first set of postrelease patches. Unfortunately, at the time of this writing, the game's current set of updates haven't fixed the game's lag problems--which can cause the game to lag for several seconds to a few minutes--or the game's frame rate problems, especially in its crowded city areas during peak hours. And several users still can't log into the game because of a separate CD key issue. Still, these problems haven't stopped many regular players from logging in lots and lots of hours of play and advancing their characters to significant experience levels. In fact, it could be said that the worst thing about the game's technical and registration problems--and the reason why so many angry, frustrated posts have been made to the game's message boards--is simply the fact that they're keeping people from playing the game. Because these people really and truly want to play. The wilderness areas in Rubi-Ka are impressively detailed. And if you can get around the game's significant--and sometimes showstopping--technical and registration problems, you'll come to understand why so many people who paid the game's substantial release price of $50 want to play so badly. All technical problems aside, Anarchy Online is one of the most genuinely enjoyable online role-playing games ever made--if not the most enjoyable. It's truly a shame that the game's technical and registration issues have compromised what's otherwise an excellent game in practically all other respects. For starters, Anarchy Online looks fantastic. In fact, it's hands-down the very best-looking massively multiplayer online game currently available; no other such game's graphics even come close. Though the game's system requirements are steeper than those of other games that preceded it, Anarchy Online looks good even at the lowest resolution of 640x480 in 16-bit color and looks superb in high resolutions. As mentioned, Anarchy Online is the first online role-playing game to use a science-fiction setting, rather than a medieval fantasy setting, and the game's graphics reflect this setting well. Nearly every one of the Rubi-Ka's futuristic environments is detailed, attractive, and well designed enough to truly make you feel as though your character is exploring an entirely different world. But Anarchy Online's characters look even better than the game's environments; you can create a character from four different races, different genders (three of the game's races have male and female varieties; the fourth is neuter), different heights, different builds, and a great variety of extremely interesting character faces. What's more, you can thoroughly distinguish and customize your characters' appearances with the game's many futuristic and conventional weapons and armor, as well as clothe your characters with any of the game's hundreds of fashion accessories, including leather trench coats, sunglasses, dress shoes, high-heeled boots, medical uniforms, swimsuits, and much, much more. As if that weren't enough, Anarchy Online features a whole slew of expressive motion-captured gesture animations that truly help you bring your character to life. Mutants such as this populate the countryside. You can choose your character's profession from the game's 12 classes, and although some character races are better suited to certain classes than others, Anarchy Online allows you a tremendous amount of freedom in the way you design your character and its development, thanks to its open-ended skill system, which includes physical attributes, secondary abilities, and trade skills. What's more, all characters of all classes and races may use nanoformulas, which are the game's equivalent of magic spells. As such, any and every character in the game can choose to be a spellcaster; study martial arts to fight enemies barehanded; use a noisy, hard-hitting heavy assault rifle; craft high-quality weapons; be adept at using first aid kits to treat injuries; or can choose some combination of all of these. Naturally, the game balances these skills by limiting the number of skill points your character can access at each level, but it still affords you a tremendous amount of freedom in customizing and developing a distinctive character. What's more, unlike in other online RPGs, just about every kind of character can productively adventure alone without fear of certain death in Anarchy Online. That's not to say that the game rewards solo players more than team players, because it doesn't; the most efficient way to increase your character's strengths, abilities, and levels is to find a good group, but if you can't, or don't wish to, you can certainly go it alone. And regardless of whether you explore Rubi-Ka in groups or by yourself, you won't spend hours, or even minutes, sitting and waiting to recover from your injuries or spent nano-energy (the game's equivalent of spell power), since the game also features treatment kits that can replenish either or both instantaneously. What's more, Anarchy Online not only lets you create custom hotkeys for simple actions, it also lets you write custom scripts to make shortcuts for multiple actions so that you can create a script that'll let you stop, heal yourself, and stand up again; fire off a barrage of nanoformulas in sequence; or perform a set of dancing animations in succession.Funcom has also sent a second version of the game's code to production so that new users won't have to download the first set of postrelease patches. Unfortunately, at the time of this writing, the game's current set of updates haven't fixed the game's lag problems--which can cause the game to lag for several seconds to a few minutes--or the game's frame rate problems, especially in its crowded city areas during peak hours. And several users still can't log into the game because of a separate CD key issue. Still, these problems haven't stopped many regular players from logging in lots and lots of hours of play and advancing their characters to significant experience levels. In fact, it could be said that the worst thing about the game's technical and registration problems--and the reason why so many angry, frustrated posts have been made to the game's message boards--is simply the fact that they're keeping people from playing the game. Because these people really and truly want to play. And if you can get around the game's significant--and sometimes showstopping--technical and registration problems, you'll come to understand why so many people who paid the game's substantial release price of $50 want to play so badly. All technical problems aside, Anarchy Online is one of the most genuinely enjoyable online role-playing games ever made--if not the most enjoyable. It's truly a shame that the game's technical and registration issues have compromised what's otherwise an excellent game in practically all other respects. For starters, Anarchy Online looks fantastic. In fact, it's hands-down the very best-looking massively multiplayer online game currently available; no other such game's graphics even come close. Though the game's system requirements are steeper than those of other games that preceded it, Anarchy Online looks good even at the lowest resolution of 640x480 in 16-bit color and looks superb in high resolutions. As mentioned, Anarchy Online is the first online role-playing game to use a science-fiction setting, rather than a medieval fantasy setting, and the game's graphics reflect this setting well. Nearly every one of the Rubi-Ka's futuristic environments is detailed, attractive, and well designed enough to truly make you feel as though your character is exploring an entirely different world. But Anarchy Online's characters look even better than the game's environments; you can create a character from four different races, different genders (three of the game's races have male and female varieties; the fourth is neuter), different heights, different builds, and a great variety of extremely interesting character faces. What's more, you can thoroughly distinguish and customize your characters' appearances with the game's many futuristic and conventional weapons and armor, as well as clothe your characters with any of the game's hundreds of fashion accessories, including leather trench coats, sunglasses, dress shoes, high-heeled boots, medical uniforms, swimsuits, and much, much more. As if that weren't enough, Anarchy Online features a whole slew of expressive motion-captured gesture animations that truly help you bring your character to life. You can choose your character's profession from the game's 12 classes, and although some character races are better suited to certain classes than others, Anarchy Online allows you a tremendous amount of freedom in the way you design your character and its development, thanks to its open-ended skill system, which includes physical attributes, secondary abilities, and trade skills. What's more, all characters of all classes and races may use nanoformulas, which are the game's equivalent of magic spells. As such, any and every character in the game can choose to be a spellcaster; study martial arts to fight enemies barehanded; use a noisy, hard-hitting heavy assault rifle; craft high-quality weapons; be adept at using first aid kits to treat injuries; or can choose some combination of all of these. Naturally, the game balances these skills by limiting the number of skill points your character can access at each level, but it still affords you a tremendous amount of freedom in customizing and developing a distinctive character. What's more, unlike in other online RPGs, just about every kind of character can productively adventure alone without fear of certain death in Anarchy Online. That's not to say that the game rewards solo players more than team players, because it doesn't; the most efficient way to increase your character's strengths, abilities, and levels is to find a good group, but if you can't, or don't wish to, you can certainly go it alone. And regardless of whether you explore Rubi-Ka in groups or by yourself, you won't spend hours, or even minutes, sitting and waiting to recover from your injuries or spent nano-energy (the game's equivalent of spell power), since the game also features treatment kits that can replenish either or both instantaneously. What's more, Anarchy Online not only lets you create custom hotkeys for simple actions, it also lets you write custom scripts to make shortcuts for multiple actions so that you can create a script that'll let you stop, heal yourself, and stand up again; fire off a barrage of nanoformulas in sequence; or perform a set of dancing animations in succession.Thanks to features like Anarchy Online's mission system, you'll never, ever find yourself at a loss for something to do. Your character can accept a randomly generated mission from any of the mission kiosks located all over Rubi-Ka at any point in time. Once you've accepted a mission, you must locate the mission area (which may be in a house, a cave, or a secret passage), enter it, and accomplish your objective to obtain your reward, which may consist of either lots of experience points or lots of money--plus weapons, armor, nanoformulas, and more. Currently, the game features a number of simplistic mission types that might require you to meet with or assassinate a character, recover an item, or use an item on a fixture. You can customize the difficulty, types of enemies, and type of reward you'll receive from any mission and perform them alone or with friends by having your character purchase a mission key duplicator for a few credits. Once you enter a mission, you'll find enemies that may be easy or difficult to defeat (depending on the difficulty level you selected). You'll also find treasure chests and doors that may be unlocked, locked, or trapped, as well as secret doors. These insurance terminals let you save your character's state at any time. At their very best, Anarchy Online's missions are fun (and profitable) dungeon hacks that can be enjoyed without having to deal with the overcrowding that plagues the highly trafficked dungeons of other online RPGs. The game's missions recall the dungeons of classic node-based first-person role-playing games such as The Bard's Tale and Wizardry. Unfortunately, the game's missions aren't polished; some walls and doorways in some missions can sometimes create a strange and blurry ~hall of mirrors~ visual effect onscreen. In addition, some enemies may actually attack you through walls out of your line of sight--though you can retaliate through walls, which can make for a strange-looking fight indeed. But neither of these problems changes the fact that, when you can get past the game's technical issues and get into a mission, they're a perfect way for solo players or small groups to adventure gainfully without having to worry about competing with other players to find monsters to fight for experience and loot, or having to wait in line to hunt rare monsters that leave specific items behind when defeated. And many missions that are set on easier difficulty settings can be completed within 30 minutes to an hour, which--lag and connectivity problems notwithstanding--makes a brief session of Anarchy Online easy to fit into your schedule, in contrast to the endless hunting and ~camping~ (remaining in one place to fight the same monsters) of other online RPGs. Thousands of colorful characters are already at home in Rubi-Ka. Anarchy Online also offers a completely unprecedented amount of content geared specifically toward players who don't just want to fight and loot all the time. It's even open-ended enough to let creative players stage all sorts of social events, including fashion shows, rave dance parties, arts-and-crafts trade shows, and more. And these social elements--and player interaction and conflict, along with missions and faction affiliations--will become even more important and useful when the game's four-year story begins this fall. Anarchy Online's story was devised by Funcom designer Ragnar Tornquist, who previously created the story for the superb graphical adventure game The Longest Journey, and it will change dynamically depending entirely on players' actions. So is Anarchy Online a truly great game? Yes. It's the best-looking online role-playing game out there, and it offers a truly enjoyable and varied play experience that in many ways is far more sophisticated than other online RPGs and much easier to fit into your schedule. But is it also still really buggy and unstable? Yes, unfortunately, it's that as well. Buy the game now, and you'll most likely encounter lag and frame rate problems, and you may not even be able to register properly. But given the game's significant progress after release, its already extremely enjoyable content, and its upcoming four-year story, Anarchy Online will clearly only get better and better in the coming weeks; and if it can conquer its technical problems, Anarchy Online will be the very best online role-playing game around. [Ed. Note: GameSpot previously erroneously attributed the ~hall of mirrors~ graphical glitch to polygonal clipping, when in fact the glitch is unrelated. GameSpot regrets the error.]Thanks to features like Anarchy Online's mission system, you'll never, ever find yourself at a loss for something to do. Your character can accept a randomly generated mission from any of the mission kiosks located all over Rubi-Ka at any point in time. Once you've accepted a mission, you must locate the mission area (which may be in a house, a cave, or a secret passage), enter it, and accomplish your objective to obtain your reward, which may consist of either lots of experience points or lots of money--plus weapons, armor, nanoformulas, and more. Currently, the game features a number of simplistic mission types that might require you to meet with or assassinate a character, recover an item, or use an item on a fixture. You can customize the difficulty, types of enemies, and type of reward you'll receive from any mission and perform them alone or with friends by having your character purchase a mission key duplicator for a few credits. Once you enter a mission, you'll find enemies that may be easy or difficult to defeat (depending on the difficulty level you selected). You'll also find treasure chests and doors that may be unlocked, locked, or trapped, as well as secret doors. At their very best, Anarchy Online's missions are fun (and profitable) dungeon hacks that can be enjoyed without having to deal with the overcrowding that plagues the highly trafficked dungeons of other online RPGs. The game's missions recall the dungeons of classic node-based first-person role-playing games such as The Bard's Tale and Wizardry. Unfortunately, the game's missions aren't polished; some walls and doorways in some missions can sometimes create a strange and blurry ~hall of mirrors~ visual effect onscreen. In addition, some enemies may actually attack you through walls out of your line of sight--though you can retaliate through walls, which can make for a strange-looking fight indeed. But neither of these problems changes the fact that, when you can get past the game's technical issues and get into a mission, they're a perfect way for solo players or small groups to adventure gainfully without having to worry about competing with other players to find monsters to fight for experience and loot, or having to wait in line to hunt rare monsters that leave specific items behind when defeated. And many missions that are set on easier difficulty settings can be completed within 30 minutes to an hour, which--lag and connectivity problems notwithstanding--makes a brief session of Anarchy Online easy to fit into your schedule, in contrast to the endless hunting and ~camping~ (remaining in one place to fight the same monsters) of other online RPGs. Anarchy Online also offers a completely unprecedented amount of content geared specifically toward players who don't just want to fight and loot all the time. It's even open-ended enough to let creative players stage all sorts of social events, including fashion shows, rave dance parties, arts-and-crafts trade shows, and more. And these social elements--and player interaction and conflict, along with missions and faction affiliations--will become even more important and useful when the game's four-year story begins this fall. Anarchy Online's story was devised by Funcom designer Ragnar Tornquist, who previously created the story for the superb graphical adventure game The Longest Journey, and it will change dynamically depending entirely on players' actions. So is Anarchy Online a truly great game? Yes. It's the best-looking online role-playing game out there, and it offers a truly enjoyable and varied play experience that in many ways is far more sophisticated than other online RPGs and much easier to fit into your schedule. But is it also still really buggy and unstable? Yes, unfortunately, it's that as well. Buy the game now, and you'll most likely encounter lag and frame rate problems, and you may not even be able to register properly. But given the game's significant progress after release, its already extremely enjoyable content, and its upcoming four-year story, Anarchy Online will clearly only get better and better in the coming weeks; and if it can conquer its technical problems, Anarchy Online will be the very best online role-playing game around. [Ed. Note: GameSpot previously erroneously attributed the ~hall of mirrors~ graphical glitch to polygonal clipping, when in fact the glitch is unrelated. GameSpot regrets the error.]"}