{"ref": "https://www.gamespot.com/reviews/resident-evil-revelations-2-episode-three-review/1900-6416057/", "date": "March 10, 2015", "game_name": "Resident Evil: Revelations 2", "text": "Resident Evil: Revelations 2 has had some great moments over the course of two episodes, but not consistently so. In Episode One, Barry and Natalia stole the show with an eerie trip through the woods, but only after you suffered through fetch quests and awful dialogue as Claire and Moira. However, when those two were confronted by mobs of enemies and had to fight their way out of a logging village in Episode Two, their side of the story was suddenly the interesting half, as Barry and Natalia did little more than retrace their counterparts' steps.Coming off of Episode Two's dull second half, Episode Three is pure delight, if you can apply that word to the trials and horrors that lie within. It kicks off when Claire and Moira wander through a derelict meat processing plant, a location that's rife with ghastly sights left over from the factory's final days. Blood is in steady supply, and you eventually find yourself waist deep in pools of the red stuff as pig carcasses dangle overhead, a cheerful sight if there ever was one. You get a strong sense of dread as you work your way through the plant, all the while contending with puzzles and mutants. This is par for the course in Resident Evil, but for the first time in Revelations 2, the puzzles are actually interesting, which is more than can be said for those in episodes One and Two.At one point, an eye scanner prevents you from progressing, and if Hollywood is anything to go by, you know what you must do: steal someone's eye! That's technically the case here, but it's a little more complicated than that, with smaller puzzles to tackle along the way. When you enter a room with red security lasers crisscrossed about, you might expect that you need to contort your body and slip through the gaps, and while that would be an interesting feat, this scenario is actually a good chance for Moira to prove her worth, using her flashlight to highlight a path that will take her safely through. Of course, Claire's perfectly capable of using a flashlight, so it's still weird that only Moira can take advantage of her torch, but given that, using her in this way is far better than simply using her as a second set of hands to pull a lever. That's not to say this doesn't happen in Episode Three; it does. However, at least it's not the only thing she's good for.As in so many Resident Evil games, you rely on conveniently but unexplainably placed objects or features to resolve puzzles in Episode Three--a clear reminder that you're playing a video game--but this habit has a certain charm to it when handled properly. I don't know why there's a room with spikes on the ceiling that slowly drop towards the floor, but here, it's an opportunity to use your intellect in a way that's different than simply managing ammo and working on your aim, so you embrace its existence rather than question it. It's not immediately apparent what you need to do, but you ultimately need to put yourself in harms way and take advantage of the spikes. It's only by the powers of deduction that you arrive at this conclusion, and the risk involved adds an appreciable layer of tension, which makes it easy to forgive and forget the unrealistic and contrived nature of these scenarios.Moira has been a thorn in my side for most of Revelations 2, mostly due to her annoying dialogue, but also because you're forced to use her in uninteresting ways. However, a chaotic scene towards the end of her act in Episode Three gives credence to her presence and her partnership with Claire, at least from a game design perspective. A difficult situation sends the two characters on different paths within the same room, which is built to kill, and kill it will, unless you manage to persevere under pressure by executing commands with careful timing and accuracy. It's easier said than done, primarily because the environment is so volatile, and while one character is trying to diminish that particular threat, the other is going toe-to-toe with incoming enemies.Switching between Claire and Moira is a high-stakes juggling act, and you finally get the sense that they're relying on one another to survive. Sure, Moira's always been able to assist Claire during battle by blinding enemies with her flashlight or whacking them with her crowbar, but it's not until now that you feel like Claire truly needs Moira, which is an important element of any sidekick. If the main character doesn't need their sidekick to swoop in and save them from time to time, her presence will ultimately feel like a burden. Finally, Revelations 2 bucks that trend when it comes to Moira.Like Claire, Barry relies on his partner, Natalia, far more than he's had to before. Section by section, the duo works together to clear a path through a sewer, but also to safely and efficiently take out large groups of enemies. Primarily, Barry needs Natalia to run along a catwalk in order to open gates that stand in his way, but she can also make Barry's life easier by pushing explosive tanks into the water below.This setup lets Barry lure enemies into a trap that can be triggered with a single bullet, efficiently clearing a path instead of exhausting your precious resources on individual enemies. There are deterrents, such as a dormant monster next to a tank that will wake up if Natalia gets too close, but this is a chance for Barry to give Natalia backup by picking off the threat from below. After an initial pause, you remember that teamwork's an option and send her into the path of danger for the greater good of the team. These kinds of moments are the best examples of how it can be interesting for an individual to control two characters, which Revelations 2 has struggled with thus far.Before episode three wraps, you need to complete a mundane puzzle with Barry, who must repeatedly and slowly move a large object from one location to another. After a couple of great hours of solid tension and fulfilling teamwork, this filler comes as a bit of a letdown. A few enemy encounters along the way prevent it from being completely boring, but regardless, you get the feeling that Episode Three would have been served better if it went out with a bang instead of a whimper, even at the cost of its overall length.As the final chapter in Revelations 2 nears, it's a relief to see the story progress in leaps and bounds during Episode Three. Such moments are long overdue. You learn a great deal about hidden motives, and witness the consequences of certain characters' actions, which stirs up complex emotions among other cast members. Given that there's only one more episode to go, it feels a bit like it's too little too late, but that will ultimately depend on where the story goes in the final episode. Thankfully, there are still some unanswered questions to explore in next week's episode, but as far as Episode Three is concerned, the events at hand are an excellent compliment to the overall great gameplay.Even though Barry's final stint is a letdown, with payoff after payoff, Episode Three is easily the best episode of Revelations 2 yet. It no longer feels like it was designed in such a way that forcefully attempts to justify having a partner. Instead, your appreciation for your sidekicks comes organically as you work together to solve interesting puzzles and protect each other from danger. Controlling Moira and Natalia no longer feels like a chore; now, it's a privilege, and Episode Three's greatest feat overall."}