{"ref": "https://www.gamespot.com/reviews/alone-in-the-dark-the-new-nightmare-review/1900-2780234/", "date": "May 2, 2003", "game_name": "Alone in the Dark: The New Nightmare", "text": "While Capcom's Resident Evil is known as the series that brought the survival-horror genre to the mainstream, Alone in the Dark is the series that invented it. While there have been no less than three iterations of the game for the PC, to date, only one game out of the entire series has ever been seen on the PlayStation: 1996's Alone in the Dark: One Eyed Jack's Revenge. Now, close to six years later, the Alone in the Dark series graces the PlayStation once again, and it does so with some fairly decent results.The story of the game once again follows the exploits of the mysterious Edward Carnby, but it also introduces a new sidekick, Aline Cedrac. When Edward's best friend, Charles Fiske, is found dead on the shores of an island, Carnby vows to not only get to the bottom of his friend's death, but also to seek revenge. Carnby and Cedrac travel to the island where Fiske was found dead, only to have a brush with death themselves when their chartered helicopter crashes. Carnby safely falls to the earth using a parachute, while Cedrac narrowly misses a grim fate by landing on the roof of a dark mansion. From here on out, you can choose from either of the two characters and play out their intertwining storylines, very similar in practice to Resident Evil 2. The two sides of the story do play like night and day, however. Carnby tends to pack a little more firepower than his counterpart, so his side of the story is more action-oriented. Cedrac, on the other hand, begins the game armed only with a flashlight, and she finds fewer weapons throughout the game. As a result, her game is more puzzle-oriented and subsequently more challenging. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Alone in the Dark: The New Nightmare Video ReviewAlone in the Dark: The New Nightmare borrows heavily from the Resident Evil series, complete with all of the trappings involved in this style of game. This game tries very hard to innovate with a lighting technology known as meshing, or in layman's terms, simulated real-time lighting. Carnby and Cedrac both come equipped with a flashlight as standard equipment, and as you make your way through the dark recesses of the mansion, you can illuminate darkened areas with your flashlight, which serves to add to the dark and gloomy feel of the game. While the visual trickery is quite a sight to see on the PlayStation, the effect soon begins to wear thin after you realize that it does not necessarily play a key role in the overall scheme of the game. Also making use of the meshing system is the lighting of prerendered backgrounds when lightning strikes. In several areas of the game, you might catch a glimpse of a dark figure standing right next to your character, only to have it disappear moments later. In all, it does make for some suspenseful gameplay, but when you get down to it, it's nothing more than eye candy.The core gameplay of The New Nightmare is something that anyone who has played a survival-horror game will instantly be familiar with: limited ammunition and health packs, vague puzzles and clues, endless locked doors, dramatic cutscenes, and, of course, a sluggish character who steers like a tank. The bulk of the game is spent searching the mansion for ways to open doors, either by way of key or hidden switches. One of the most annoying things about the game is the fact that the keys do not indicate which door they can be used to open, so every time you find a key, you have to backtrack to every locked door in order to find the one it opens. Add this to the short supply of ammunition and health and the fact that enemies instantly respawn when you leave a room, and you'll soon find yourself frustrated at having to revisit the same areas over and over again.The puzzles in the game are similarly vague, and they often require you to look through the many documents that you find lying around the mansion. In one instance where you find yourself out of keys, the only remaining clue you are given is a worn photograph of a room in the mansion. You visit this room and find something missing from the picture. After finding an item to make the room match the picture, a switch is activated. It comes as no surprise that you then have to visit every locked door you've come across to find out which one was opened. For the most part, this game is all about solving overly ambiguous puzzles in order to progress. Graphically, Alone in the Dark squeezes every ounce of power out of this aging console. The customary prerendered backgrounds are beautifully drawn and ornate, but on the other hand, many of the game's textures seem bland and washed out. This game is about as dark and gloomy as they come, and the meshing technique, while slightly gimmicky, is one of the most interesting graphical innovations seen in a long while. It's a shame that it's been implemented so late in this console's life. The game's ambient music and sounds are also fittingly gloomy and suspenseful, and on the whole, they fit well in the game. The voice acting is par for the course for this genre--at times it's overacted, and at others the lines are delivered lifelessly.Fans of survival-horror games who have not upgraded to a newer console will find this game to be one of the better new titles available on the PlayStation, despite its flaws. With versions in the works for both the PlayStation 2 and the Dreamcast, though, owners of multiple consoles are probably better off waiting for the graphical enhancement that will come with a more powerful console."}