{"ref": "https://www.gamespot.com/reviews/lego-jurassic-world-review/1900-6416184/", "date": "September 1, 2015", "game_name": "LEGO Jurassic World", "text": "When we think of high-budget games, we may think of the cinematic experiences that drag you along a roller coaster-like ride through scripted set pieces and quick time events, like Call of Duty or Uncharted. Or we may think of the glut of open world games we've seen flood the market, all complete with minimaps covered in dots of things to do or collect, compelling you to comb the landscape and visit every single one. The Lego series of games by Traveller's Tales has perfectly embodied these conflicting design philosophies across the many franchises it's taken on and put them in a kid-friendly package. That's why setting a Lego game in the Jurassic Park world is such an enticing prospect: it's a series that naturally combines the cinematic with the sprawling. Lego Jurassic World encompasses just that with style and undeniable charm that will melt your cynical heart, but the boring things the game makes you do hamper the joy.If you've played any of the recent Lego games, you know exactly what you're getting into: solidly designed platforming amidst a world made of bricks. Combat takes a back seat to simple problem solving as you find ways to clear environmental obstacles, which often takes the form of building new things out of loose bricks that are lying around. Cooperation is also encouraged thanks to hop-in multiplayer and a cavalcade of characters to take control of, each of which has special abilities you need to use to progress through the game. Tying everything together are hub worlds that you can wander around in and collect red bricks (which unlock the ability to buy certain perks) and gold ones (which unlock certain optional sections once you have enough of them), so you get a little bit of structural variety as you progress, which is a nice counterpoint to the very linear levels proper.A big part of the appeal of the Lego games is the fact that you can switch between characters at will and play around with them. The characters' special powers also go with their personalities quite well and in unexpectedly hilarious ways. Ellie, for instance, can water sprouts to make them grow (because she's a paleobotanist, you see) and jump into giant piles of dino poop to find useful things (because other characters can't stand the smell). And the open world bits fit right into the theme park conceit perfectly, though it doesn't work quite as well in The Lost World and Jurassic Park III since the settings are just more wilderness. But the big draw with Lego Jurassic World is the fact that you can play as the dinosaurs themselves. Here, you get to embody the famous dinos we all found so fascinating as kids, like the velociraptor and, of course, the star of the franchise, the T-Rex. It's great to be given go many options to play, especially once you get through the main game and just want to unravel as much of what's still out there as you can.The problem is that you can't actually experiment with anything in any real sense. The different abilities are simply keys to unlock progress or secrets. You never get the chance to noodle around with the mechanics or improvise since there's always just one solution to every obstacle the game puts in your way. Another unfortunate side effect of this approach is the fact that the things you're doing in-game aren't nearly as interesting as the things your in-game avatar is doing. She might be performing a high-pitched scream to break some glass in your way or building a giant replica of a hot dog to distract a rampaging dino. In reality, you're moving from one spot in a level to another, where you activate a thing that lets you move on to the next thing, and so on. Granted, this is the baseline for how game levels are built at their core, but Traveller's Tales does nothing to hide this pattern, nor does it add any complexity to how scenarios play out. It's all focused on throwing exactly one obstacle at you at a time with very little stopping you in between.This makes for adventuring that is bereft of tension and friction, leading to a game you just stroll through with very little resistance. Iconic scenes are replicated as Lego-built levels, like when Lex and Tim try to evade hungry velociraptors in a kitchen or a T-Rex stampeding through San Diego as Jeff Goldblum speeds in front of it. While it's quite pleasing to stroll through these set pieces as you progress through the game, you never feel like you're in danger in the slightest. The reason the velociraptor scene is timeless is the ever-present danger of the kids being found, the unsettling purring noise the raptors make, approaching closer and closer until the children are right under their noses. In Lego Jurassic World, no such tension exists. Again, you have to find the right thing to fiddle with to move on to the next section to find the next thing and repeat the process until you make it to the end. In the meantime, the two raptors are looking for you, but they never actually move from their pre-determined spots except to pace uselessly until you trigger their next movement. If you attempt to move close to them, the kids back away looking cautious and frightened--an inelegant cover for the dreaded invisible wall. Suddenly, you're not playing Lego versions of your favorite scenes but instead find yourself as the cast of a badly-acted Lego play where you can see the stagehands changing the scenery.The only potential source of tension that the game tries to throw at you is when it occasionally sends a swarm of tiny dinos (or occasionally other Lego people) to attack you, but even this is hollow. Your punch attack is a pathetic wiggle that you have to be right next to an enemy to use. But everything goes down in one hit, so when things swarm at you, you merely have to mash the button as you move around and try not to get hit--and even that doesn't work, as an enemy might land a lucky shot on you as you're moving. The tepid combat makes any enemy encounter annoying, especially when they start pouring infinitely out of a hole until you plug it up. Notably, only the first movie's set of stages is completely bereft of combat segments, and it's all the better for it.Don't get me wrong, though: Lego Jurassic World absolutely has its heart in the right place. Every scene is injected with the now-trademark Lego sense of humor. Events like seeing Chris Pratt gleefully play with toy dinosaurs during a tense scene or seeing someone's hair fall off and land on a raptor's head always produce a chuckle at worst. It helps that you have the very serious lines from the original movies juxtaposed with your silly Lego people doing ridiculous things. Unfortunately, the audio from the movies wasn't mixed very well with the game audio, which sounds jarring next to the pristine, polished sounds and voices recorded for the game. Luckily, the funniest aspect of the game requires no voice acting at all: the dinosaurs. They don't talk, so all their humor is relayed in pantomime, a trick not seen in Traveller's Tales Lego games since their earliest efforts. Since so much of the Lego multimedia experience relies on visual humor, the dinosaurs make up the lion's share of funny moments, like raptors chasing a tiny ice cream truck or the hybrid T-Rex from Jurassic World forming emoticons with bones from its pen. It really speaks to the strength of the game's charm and humor that the non-speaking dinosaurs steal the show, but then again, they are the stars of the Jurassic Park franchise, so it's appropriate.The Lego games set out to create an accessible, joy-filled romp through our favorite pieces of popular media with as few barriers stopping the fun as possible. They are part of one of the few franchises that can get by on charm alone. But Traveller's Tales take this approach to extremes, focusing on the visual and thematic experience almost entirely while letting the actual gameplay languish. Jurassic Park in particular doesn't suit this design because flattening the mechanics removes all notions of tension from the game, an essential part of the film series. Lego Jurassic Park is a nice, pleasant nostalgia trip, but it won't be long before you're asking to leave."}