{"ref": "https://www.gamespot.com/reviews/air-traffic-chaos-review/1900-6199765/", "date": "October 21, 2008", "game_name": "Air Traffic Chaos", "text": "Air traffic controllers work in notoriously stressful conditions. At major airports, they are responsible for the flow of hundreds of planes (and thousands of passengers) per day. So is there fun to be found in a game devoted to a profession that's noted as much for its allegedly high suicide rate as its sedentary nature? In the case of Majesco's Air Traffic Chaos, the answer is a resounding yes. It's sometimes stressful and often diabolically difficult, but Air Traffic Chaos also happens to be one of the surprise Nintendo DS games of the year, as well as a must-buy for fans of brain-bending puzzles. Air Traffic Chaos is a charming, challenging puzzle game centered around one of the toughest jobs imaginable. As an air traffic controller, you're responsible for guiding the incoming and outgoing traffic at one of the five Japanese airports that are included in the game. Each airport has three progressively more difficult challenges associated with it. At the easiest levels, your job is simple: Make sure the incoming and outgoing planes don't come in contact. And while that most basic of rules is obviously still the goal at the higher difficulty levels, the number of variables that look to complicate your job in the ATC tower increase dramatically. The primary variable in the game is the individual layouts for each of the airport levels. Your most powerful tool for success in Air Traffic Chaos is your understanding of how each unique airport is organized. For example, the opening level, Fukuoka, is a simple one-runway airport with four gates into which any plane can taxi. By the time you get to the advanced levels, such as Tokyo International or New Chitose, you're dealing with multiple runways that split between civilian and military air traffic. You'll also be dealing with gates that differentiate between domestic and international travel, as well as complicated plane taxi lanes. If you toss wind speed and direction (which affect the runways an incoming pilot will choose to land on) into the mix, as well as a stress meter that fills up as you leave pilots unattended in the air or on the ground for too long, Air Traffic Chaos quickly blossoms from a run of the mill ~profession~ game into a challenging, addictive puzzler. You control traffic on the ground and in the air by issuing commands. You'll use either the D pad with the buttons or, preferably, the stylus with the touch screen. To issue a command, you simply tap on the plane you wish to communicate with and then choose from the list of available commands. For planes in the air, commands can range from changing speed to determining which runway to choose for a landing. For planes at the gate, you'll need to run through a list of pre-takeoff rituals, which includes confirming the flight plan, determining the takeoff runway, pushing back from the gate, clearing a plane for taxi, and, eventually, clearing for takeoff. Timing is most delicate in Air Traffic Chaos. For example, you don't want to bring in a plane too early, only to leave it clogging up the runway while you wait to finish the pre-takeoff routine for a gated plane. Eventually, you'll figure out that you can more or less start a plane's landing routine when you begin another plane's takeoff routine, though, as things ramp up in difficulty, it's rarely that simple for long. It's in that complexity and, thanks to a relatively smooth learning curve, your always-increasing understanding of how a particular airport works that the fun is found. Yes, it's fun and undeniably addictive, but there is some frustration in ATC, primarily with the finality of the commands you issue. Only one command in the game is reversible--~clear for landing~--which gives a pilot final confirmation to make a landing attempt. Aborting a landing will return that plane into a circling pattern, which itself can be problematic if you've got a lot of traffic in the air. None of the other commands can be taken back, and as a result, you can often see your mistakes far in advance of their eventual consequences. For example, if you decide to push a plane back from the gate before an incoming plane has finished its taxi routine, you can often count on those two planes colliding. There's no artificial intelligence on the pilot side that will assist you in avoiding these types of hazards. Instead, you are solely responsible for keeping every plane on the ground and in the air away from trouble. There's also a good deal of rote memorization to the challenges in the game. If you attempt a scenario enough times, you'll know exactly when the wind speed and direction changes, then anticipate when additional planes are incoming. That said, the game's expert challenges can be incredibly difficult with windows of opportunity that seem better measured in seconds rather than minutes and where a single ill-conceived command can result in disaster later on in the scenario. There's lots of trial and error in Air Traffic Chaos, with a particular emphasis on the ~error.~ No time for flop sweat; you've got to keep that traffic moving! Air Traffic Chaos would have benefited from a more varied set of modes. The game's anime-inspired character designs are just begging for a story mode that could flesh them out, but unfortunately, the 15 challenges are all that's available. There's no multiplayer either, though you can wirelessly share high scores with your fellow ATC players. Finally, budding pilots might get a kick out of the terminology glossary, which breaks down some of the realistic pilot/tower lingo used in the game. At its most challenging moments, Air Traffic Chaos is a real test of your time-management skills, but only rarely does the game ever feel like a chore. More often, you'll be sucked in by the game's deceptively simple gameplay, compelled over and over to give a scenario another try. When you add in cute, SimCity DS-like graphics and a catchy soundtrack, you've got one of 2008's more surprising finds on the Nintendo DS. It might be flying under your radar, but Air Traffic Chaos deserves a look."}