{"ref": "https://www.gamespot.com/reviews/madden-nfl-2005-review/1900-6104311/", "date": "August 6, 2004", "game_name": "Madden NFL 2005", "text": "As the best-selling football franchise on the market for an umpteen number of years, Madden NFL is a name that is known by the masses as representative of some of the best football you can get on a video game console. Last year's Madden NFL 2004, in particular, is revered as one of the best installments EA has ever brought out--which ultimately makes it a tough act to follow. For this year's edition, Madden NFL 2005, defense is the name of the game. Nearly all of the additions and tweaks made to this year's game fall squarely into the realm of defensive football, and they're all great new features. The downside to this high emphasis on one particular area of the game seems to be that the remaining aspects of the game (of which there are many) are generally only slightly improved or altered, if at all. In many ways, Madden 2005 is just a bit too much like last year's Madden for comfort--but it's still a truly excellent game of football all around. Madden NFL 2005 is finally here, and it absolutely does the Madden name proud. If you've ever felt that Madden was simply a one-sided piece of pigskin in favor of offensive play, Madden 2005 changes all of that. The additions made to the defensive side of the ball are plentiful and all superb. The first and most entertaining addition is the new ~hit stick.~ Essentially, when on defense, tapping the right control stick in the direction of your opponent will lay a nasty hit on him. What the hit stick translates into is context-sensitive tackling that you can control. If you're just running alongside your opponent and tap it without getting much of a head of steam, then you'll just kind of shove him. Get up a good bout of speed, and you will absolutely waylay the poor ball carrier. Using the hit stick properly will also result in more fumbles and dropped passes for the offense. However, you have to be careful, because missing with the stick leads to a supremely missed tackle, which consequently gives your opponent an easy way to dodge past you. While this sounds like it could be a little over-complicated if not done right, in this case it is done right. As a result, using the stick becomes an immensely fun way to play the defensive side of the ball. Another big-time addition is the new defensive hot route system. Similar to the offensive hot routes, you can now redesign a defensive player's assignment at the touch of a button. Want to push a linebacker into deeper zone coverage or bring a safety in for the blitz? Simply highlight the player, and tap the right analog stick in the desired direction. You can also give better pre-snap assignments to your defensive backs now. Individual presses and pullbacks on receivers can be performed, and you can also lock a corner on to a specific receiver, thus preventing mismatches. Finally, you can now also adjust how a defensive lineman attacks the offensive line without actually having to shift your whole line. What all of this amounts to is a far more user-configurable defense that actually makes playing defense much more enjoyable and strategic. The strategy works beautifully, since the defensive artificial intelligence is generally very, very good, and it performs your changes perfectly. If you're adept at defensive playcalling and are able to make good reads, you should be able to dominate on defense--at least against the CPU. On the flip side of things, Madden NFL 2005's offensive game isn't really all that different from Madden NFL 2004, save for a few, small changes. For one, you can now make formation shifts on the line. Formation shifts are essentially audibles that don't change the play. You can move your running back out of the backfield and into a better position for the reception, or you can overload one side of the field with receivers. You'll also notice some new option routes for receivers in this year's game. Option routes are typically highlighted on the playcalling screen and feature dotted lines coming off of a curl route, for example. These lines indicate possible directions that a receiver may run, depending on that receiver's assessment of the current coverage scheme. The intelligence of the receivers who are running these routes seems to vary depending on the quality of the player, but, as a whole, the feature seemed to work well. However, aside from these few offensive changes, which ultimately don't amount to a whole lot more than nice, little touches, the offensive game feels almost exactly the same as last year's Madden. This isn't a bad thing, by any means, but what it does mean is that anyone who played last year's version of the game shouldn't have a lick of trouble simply blowing up the game offensively on the default difficulty. All-pro and All-Madden difficulties are something of another story, but in actuality, experienced Madden fans still shouldn't have a ton of trouble with either of them. Some of the old Madden money plays are still just as effective as ever, and there really isn't a whole lot of new ~stuff~ to get used to this time around. Granted, the AI defense has more tricks up its sleeve now, what with all the new defensive hot routes and shifts and such, so there is that to be taken into consideration. The changes made to defense, which include the defensive hot routes and the new hit stick, are absolutely phenomenal. On the features side of things, Madden NFL 2005 is as robust as it has ever been, though not all of the preexisting modes have seen too much in the way of changes. We'll start with the franchise mode, which has easily seen the most work. The big, new presentational change to the mode is the addition of sports radio host Tony Bruno. Billed as EA Sports Radio, the Bruno-hosted show actually plays at the start of each week, and by listening to the show, you'll hear interviews with players and coaches, hear Tony take calls from irate and occasionally idiotic fans, and hear little tidbits about things happening in the NFL. For example, we encountered one scenario where quarterback Mark Brunell was benched early on in the season in favor of Patrick Ramsey. Of course, Brunell was not pleased with the decision, which Tony was quick to report. The dialogue is occasionally a little jittery when Bruno discusses specific stuff related to your league scenarios, but the more generalized bits, like the phone calls, are pretty entertaining. The Tony Bruno stuff is actually tied in to a larger franchise feature called storyline central. Storyline central is essentially your way of keeping track of media coverage of the NFL and the morale-based grumblings of your players. There's a newspaper feature where you can look at both the national and local papers to see what the big stories are. The local papers are actually licensed after real, big city papers. So, for example, if you're the New England Patriots, you'll be reading the Boston Globe. There is also a new e-mail system that lets you read e-mails from your staff, players, and agents. Players will usually thank you for opportunities or complain when things aren't going their ways. Agents will basically do the same. Sports radio host Tony Bruno makes an appearance in this year's franchise mode. Your players' morale is centered primarily around playing time versus rating, it seems. If you've got a good player who is riding the bench, he'll quickly become despondent. Doing things like shifting player positions around can also adversely affect morale if a player doesn't want to be moved from his current position. Furthermore, losses of big-star players will pretty much bring your entire team into a funk if you aren't able to find a suitable replacement. Some players also just seem to have a natural tendency to become problem children, such as the always entertaining Terrell Owens and the periodically whiny Ty Law. Player personalities also play into contract negotiations, because sometimes teams will have certain intangibles that simply appeal more to a certain player, like preferable weather or a level of prestige that is just that much more attractive. All told, the storyline features seem to fairly accurately represent the sort of media hoopla and personality-driven drama that surrounds the NFL year after year, and though not everything it has to offer is super-useful, it's very cool nonetheless. The draft is another area that has been overhauled. You'll get offers for trades during the draft itself, and you'll be able to scout up to 15 different prospects during the combine, with varying degrees of scouting report quality depending on how much time you spend with each prospect. The one nice thing about the draft is that your players' morale will actually be affected based on who you draft. So if you've got a quarterback who isn't performing wonderfully as a starter, and you draft a top rated QB, his morale will go to the dumps. Aside from these changes and the addition of a basic practice mode, there really isn't much else new in the franchise mode. Owner mode is back, and, aside from a few, little tweaks--like more graphs and adjustable options--it is largely the same feature it was last year. Trade and free-agent-signing logic throughout the CPU-controlled league is a little better, and player development seems to be about as accurate as it's ever been. All told, this year's franchise mode isn't a gigantic step forward, but it is excellent enough to provide you with hours of team management bliss. Another mode addition to Madden NFL 2005 is actually sort of an offshoot of the minicamp mode. Essentially, EA Tiburon has added a pair of minigames, one of which is actually a score-based version of the running back minicamp game. This is a competition for one to two players where you will each have a turn at playing offense and defense. The goal on offense is to score as many rushing touchdowns as possible within a certain amount of time, while on defense, you must prevent touchdowns and try to lay down some big hits that force fumbles for bonus points. The team at the end with the most points wins. The other minigame is called two-minute drill. Here, you have two minutes on offense to score as many points as you can. Once that's done, the other team will conversely have two minutes of its own, and it's up to you to stop them on defense. You earn points offensively through big completions, runs, and scores, while on defense, you earn points by dishing out some big hits and by breaking up passes. While these games don't amount to much more than a simple distraction, they're pretty fun. Player morale is something you'll have to monitor in your franchise, because too many troublemakers can lead to a team-wide plunge in motivation. The last mode addition made to Madden NFL 2005 is an equally unnecessary, but still cool, little inclusion. This new feature is the create-a-fan mode, where you can create and design fans that will show up during in-game cutscenes. There is a fairly wide variety of options to choose from, so you can create fans that range from the mildly obsessive to the out and out crazy--like those lunatics who don Viking helmets and big, old Legion of Doom spiked shoulder pads. The one downside to the mode is that, aside from the cool design stuff, you can't really do anything else with your fans. They always pretty much just run through the same scant few cutscene animations each time, and you can't do anything to make them particularly stand out beyond their visual appearances. Still, if you're one of those people with a special place in the heart for the truly insane football fans who paint their bare chests the colors of a team and stand out in 20-below-zero weather to support it, this is a nice feature. In terms of online features, Madden NFL 2005 marks the debut of Madden on Xbox Live. For anyone who has immediate concerns about the online issues found in last month's NCAA Football 2005, we're pleased to report that we ran into none of the same problems while playing Madden. In fact, both the PS2 and Xbox versions performed just fine under normal playing conditions, and we barely even ran into any lag. All stats and records seemed to track perfectly. As far as features go, most of the same stuff you'd expect from online football is front and center here. You can join EA's setup lobbies on both systems (or just do the quick match, optimatch thing on Xbox Live), and you can create and join various matches and tournaments. New to the online mode is the rushing attack minigame, which works just as it does offline, so your point scores make up the leaderboard statistics. You'll also be able to track your online career in your EA profile, which is a little like ESPN NFL 2K5's VIP profile system, except that you can't download other people's profiles. The Tony Bruno stuff is actually tied in to a larger franchise feature called storyline central. Storyline central is essentially your way of keeping track of media coverage of the NFL and the morale-based grumblings of your players. There's a newspaper feature where you can look at both the national and local papers to see what the big stories are. The local papers are actually licensed after real, big city papers. So, for example, if you're the New England Patriots, you'll be reading the Boston Globe. There is also a new e-mail system that lets you read e-mails from your staff, players, and agents. Players will usually thank you for opportunities or complain when things aren't going their ways. Agents will basically do the same. Sports radio host Tony Bruno makes an appearance in this year's franchise mode. Your players' morale is centered primarily around playing time versus rating, it seems. If you've got a good player who is riding the bench, he'll quickly become despondent. Doing things like shifting player positions around can also adversely affect morale if a player doesn't want to be moved from his current position. Furthermore, losses of big-star players will pretty much bring your entire team into a funk if you aren't able to find a suitable replacement. Some players also just seem to have a natural tendency to become problem children, such as the always entertaining Terrell Owens and the periodically whiny Ty Law. Player personalities also play into contract negotiations, because sometimes teams will have certain intangibles that simply appeal more to a certain player, like preferable weather or a level of prestige that is just that much more attractive. All told, the storyline features seem to fairly accurately represent the sort of media hoopla and personality-driven drama that surrounds the NFL year after year, and though not everything it has to offer is super-useful, it's very cool nonetheless. The draft is another area that has been overhauled. You'll get offers for trades during the draft itself, and you'll be able to scout up to 15 different prospects during the combine, with varying degrees of scouting report quality depending on how much time you spend with each prospect. The one nice thing about the draft is that your players' morale will actually be affected based on who you draft. So if you've got a quarterback who isn't performing wonderfully as a starter, and you draft a top rated QB, his morale will go to the dumps. Aside from these changes and the addition of a basic practice mode, there really isn't much else new in the franchise mode. Owner mode is back, and, aside from a few, little tweaks--like more graphs and adjustable options--it is largely the same feature it was last year. Trade and free-agent-signing logic throughout the CPU-controlled league is a little better, and player development seems to be about as accurate as it's ever been. All told, this year's franchise mode isn't a gigantic step forward, but it is excellent enough to provide you with hours of team management bliss. Another mode addition to Madden NFL 2005 is actually sort of an offshoot of the minicamp mode. Essentially, EA Tiburon has added a pair of minigames, one of which is actually a score-based version of the running back minicamp game. This is a competition for one to two players where you will each have a turn at playing offense and defense. The goal on offense is to score as many rushing touchdowns as possible within a certain amount of time, while on defense, you must prevent touchdowns and try to lay down some big hits that force fumbles for bonus points. The team at the end with the most points wins. The other minigame is called two-minute drill. Here, you have two minutes on offense to score as many points as you can. Once that's done, the other team will conversely have two minutes of its own, and it's up to you to stop them on defense. You earn points offensively through big completions, runs, and scores, while on defense, you earn points by dishing out some big hits and by breaking up passes. While these games don't amount to much more than a simple distraction, they're pretty fun. Player morale is something you'll have to monitor in your franchise, because too many troublemakers can lead to a team-wide plunge in motivation. The last mode addition made to Madden NFL 2005 is an equally unnecessary, but still cool, little inclusion. This new feature is the create-a-fan mode, where you can create and design fans that will show up during in-game cutscenes. There is a fairly wide variety of options to choose from, so you can create fans that range from the mildly obsessive to the out and out crazy--like those lunatics who don Viking helmets and big, old Legion of Doom spiked shoulder pads. The one downside to the mode is that, aside from the cool design stuff, you can't really do anything else with your fans. They always pretty much just run through the same scant few cutscene animations each time, and you can't do anything to make them particularly stand out beyond their visual appearances. Still, if you're one of those people with a special place in the heart for the truly insane football fans who paint their bare chests the colors of a team and stand out in 20-below-zero weather to support it, this is a nice feature. In terms of online features, Madden NFL 2005 marks the debut of Madden on Xbox Live. For anyone who has immediate concerns about the online issues found in last month's NCAA Football 2005, we're pleased to report that we ran into none of the same problems while playing Madden. In fact, both the PS2 and Xbox versions performed just fine under normal playing conditions, and we barely even ran into any lag. All stats and records seemed to track perfectly. As far as features go, most of the same stuff you'd expect from online football is front and center here. You can join EA's setup lobbies on both systems (or just do the quick match, optimatch thing on Xbox Live), and you can create and join various matches and tournaments. New to the online mode is the rushing attack minigame, which works just as it does offline, so your point scores make up the leaderboard statistics. You'll also be able to track your online career in your EA profile, which is a little like ESPN NFL 2K5's VIP profile system, except that you can't download other people's profiles. The other addition to Madden's online component is one that came, quite literally, at the 11th hour. Madden NFL 2005 will support league play. These leagues are tied in to a new Premium Pass service EA is touting, of which members of said service can also take part in specialized tournaments, exclusive leaderboards, and message boards. Additionally, members can actually gain special medals. While Madden's leagues won't have the live rosters that are present in ESPN's football offering for this year, you'll still be able to use up to 32 teams in a league, and you can design your own teams and playoff schedules. Of course, none of this is up and running yet, but if all goes according to plan, it should make an already enjoyable online system a whole lot better. Madden NFL 2005 is online for both the PS2 and Xbox, and league play will be included on both. While that's pretty much it for the Xbox and GameCube versions of Madden--as far as features go--the PlayStation 2 version does have a little something extra; that is, it does if you happen to pick up the special Collector's Edition of the game. The PS2-exclusive Collector's Edition of Madden 2005 boasts a number of additional features, including three classic Madden games, a trivia challenge mode, and a few bonus video features. The three classic games consist of a pair of PlayStation-era titles (from different ends of the console's life span) and one 16-bit-era game. We don't identify these games specifically, because the game itself doesn't identify them by name. Rather, they're opaquely titled Madden Vintage, Madden Retro, and Madden Classic, respectively. Each of the games has up-to-date rosters, and the PlayStation games even include the modern commentary. While the addition of the classic games and the trivia mode are nice and all, they aren't so remarkable that you'll simply have to run out to get the Collector's Edition or anything. The classic games are the sort of thing that you're likely to pick up and play once or twice, enjoy for exactly that amount of time, and then never touch again. The same goes for the trivia, because, while there are more than plenty of different questions, it is, after all, just trivia. None of the video stuff is especially engaging, and unless you're an absolutely diehard Madden enthusiast, you really won't want to watch it. In fact, that last statement really sums up the whole Collector's Edition: If you're a diehard Madden fan, you'll like it. If you aren't, you don't need it. Graphically, Madden NFL 2005 looks pretty much like, well, Madden. The Madden series hasn't really made any significant leaps forward in visual design in recent years, and 2005 isn't much different. Yes, things are improved. Some of the new tackling animations are especially awesome and give you a pretty incredible sensation of how hard the hit is actually being delivered. Other animations, however, don't really look all that different from last year's game. In fact, a few animation glitches do rear their ugly heads from time to time, such as when some rather nasty clipping presents itself during between-play cutscenes and when runners occasionally get hung up on offensive linemen when trying to hit holes, thus causing themselves to vibrate a bit. The player models have basically the same sort of generic look that they've always had. Little details, like player jerseys and body builds, have been improved quite a bit, but the faces all sort of have the same glassy-eyed look. Some of the more marquee players definitely look like their real-life counterparts, facially, but a lot of other players could have stood for a bit more detail in this area. On a more positive note, the different arenas, playing fields, and such all look fantastic. Each arena is spectacularly detailed, from the many ads and banners that line the walls, right down to the turf or grass. Madden NFL 2005 also delivers a presentational improvement over last year's game. Everything, in terms of menus and stat screens and so on, all looks great and is extremely easy to navigate. The in-game stuff isn't quite as impressive, because the replays aren't typically all that exciting. Furthermore, there isn't much to the various cutscenes that present themselves from time to time, save for a bit of cheering and gallivanting here and there. The commentary is still a weak spot for the series, because neither John Madden nor Al Michaels is especially enjoyable to listen to. All around, their dialogue is pretty wooden and repetitive. As mentioned before, the Tony Bruno stuff is quite cool, though it isn't quite up to the level of ESPN NFL 2K5's TV-styled presentation. It still holds its own, though. The remaining portions of Madden NFL 2005's audio are similarly unspectacular. Most of the in-game sound effects are quite solid, though if you were to listen to Madden NFL 2004 and Madden NFL 2005 side by side, it's unlikely you'd take note of any major differences between the two. Once again, EA has trotted out a number of licensed artists as part of its EA Trax service, which includes the likes of Green Day, Franz Ferdinand, Midtown, The Hives, and Faith No More. While the songs themselves are all perfectly fine, they don't always feel quite right within the scope of a football game. The graphical differences between this year's Madden and last year's are pretty subtle--and there aren't a whole lot of them. Between the three console versions of Madden NFL 2005, this year's iteration manages to bridge the gap a bit more between the PS2 and Xbox versions, and, subsequently, it also manages to leave the GameCube version a little more out in the cold. Control-wise, the PS2 and Xbox versions are probably the most natural feeling. While the GameCube controller might feel a little strange to anyone who doesn't typically play sports games on the Cube, if you are used to playing sports games on the Cube, you shouldn't have any problem with it. Graphically, the three versions are pretty predictable in that the GameCube version looks a tad better than the PS2 version, and the Xbox version looks a bit better than the GameCube version. With the addition of online play in the Xbox version of the game--coupled with the slightly better graphics than its console counterparts--the Xbox offering is definitely the one to get, unless you're really jonesing for the features included in the PS2 Collector's Edition, in which case you'll need to go with the PS2 version of the game. When all is said and done, Madden NFL 2005 is still Madden. That is to say, it's another superb game of football that continues Madden's long legacy as one of the best in the business. The defensive changes made to the gameplay are likely going to set the standard for football games in the years to come, and the additions to the franchise mode easily make the mode the best of its kind. It's unfortunate that the other portions of Madden NFL 2005 aren't quite as improved over last year's installment in the series as these key areas are, but that small quibble shouldn't stop any Madden fan from running out to purchase yet another highly accomplished game of football in Madden NFL 2005. The other addition to Madden's online component is one that came, quite literally, at the 11th hour. Madden NFL 2005 will support league play. These leagues are tied in to a new Premium Pass service EA is touting, of which members of said service can also take part in specialized tournaments, exclusive leaderboards, and message boards. Additionally, members can actually gain special medals. While Madden's leagues won't have the live rosters that are present in ESPN's football offering for this year, you'll still be able to use up to 32 teams in a league, and you can design your own teams and playoff schedules. Of course, none of this is up and running yet, but if all goes according to plan, it should make an already enjoyable online system a whole lot better. Madden NFL 2005 is online for both the PS2 and Xbox, and league play will be included on both. While that's pretty much it for the Xbox and GameCube versions of Madden--as far as features go--the PlayStation 2 version does have a little something extra; that is, it does if you happen to pick up the special Collector's Edition of the game. The PS2-exclusive Collector's Edition of Madden 2005 boasts a number of additional features, including three classic Madden games, a trivia challenge mode, and a few bonus video features. The three classic games consist of a pair of PlayStation-era titles (from different ends of the console's life span) and one 16-bit-era game. We don't identify these games specifically, because the game itself doesn't identify them by name. Rather, they're opaquely titled Madden Vintage, Madden Retro, and Madden Classic, respectively. Each of the games has up-to-date rosters, and the PlayStation games even include the modern commentary. While the addition of the classic games and the trivia mode are nice and all, they aren't so remarkable that you'll simply have to run out to get the Collector's Edition or anything. The classic games are the sort of thing that you're likely to pick up and play once or twice, enjoy for exactly that amount of time, and then never touch again. The same goes for the trivia, because, while there are more than plenty of different questions, it is, after all, just trivia. None of the video stuff is especially engaging, and unless you're an absolutely diehard Madden enthusiast, you really won't want to watch it. In fact, that last statement really sums up the whole Collector's Edition: If you're a diehard Madden fan, you'll like it. If you aren't, you don't need it. Graphically, Madden NFL 2005 looks pretty much like, well, Madden. The Madden series hasn't really made any significant leaps forward in visual design in recent years, and 2005 isn't much different. Yes, things are improved. Some of the new tackling animations are especially awesome and give you a pretty incredible sensation of how hard the hit is actually being delivered. Other animations, however, don't really look all that different from last year's game. In fact, a few animation glitches do rear their ugly heads from time to time, such as when some rather nasty clipping presents itself during between-play cutscenes and when runners occasionally get hung up on offensive linemen when trying to hit holes, thus causing themselves to vibrate a bit. The player models have basically the same sort of generic look that they've always had. Little details, like player jerseys and body builds, have been improved quite a bit, but the faces all sort of have the same glassy-eyed look. Some of the more marquee players definitely look like their real-life counterparts, facially, but a lot of other players could have stood for a bit more detail in this area. On a more positive note, the different arenas, playing fields, and such all look fantastic. Each arena is spectacularly detailed, from the many ads and banners that line the walls, right down to the turf or grass. Madden NFL 2005 also delivers a presentational improvement over last year's game. Everything, in terms of menus and stat screens and so on, all looks great and is extremely easy to navigate. The in-game stuff isn't quite as impressive, because the replays aren't typically all that exciting. Furthermore, there isn't much to the various cutscenes that present themselves from time to time, save for a bit of cheering and gallivanting here and there. The commentary is still a weak spot for the series, because neither John Madden nor Al Michaels is especially enjoyable to listen to. All around, their dialogue is pretty wooden and repetitive. As mentioned before, the Tony Bruno stuff is quite cool, though it isn't quite up to the level of ESPN NFL 2K5's TV-styled presentation. It still holds its own, though. The remaining portions of Madden NFL 2005's audio are similarly unspectacular. Most of the in-game sound effects are quite solid, though if you were to listen to Madden NFL 2004 and Madden NFL 2005 side by side, it's unlikely you'd take note of any major differences between the two. Once again, EA has trotted out a number of licensed artists as part of its EA Trax service, which includes the likes of Green Day, Franz Ferdinand, Midtown, The Hives, and Faith No More. While the songs themselves are all perfectly fine, they don't always feel quite right within the scope of a football game. The graphical differences between this year's Madden and last year's are pretty subtle--and there aren't a whole lot of them. Between the three console versions of Madden NFL 2005, this year's iteration manages to bridge the gap a bit more between the PS2 and Xbox versions, and, subsequently, it also manages to leave the GameCube version a little more out in the cold. Control-wise, the PS2 and Xbox versions are probably the most natural feeling. While the GameCube controller might feel a little strange to anyone who doesn't typically play sports games on the Cube, if you are used to playing sports games on the Cube, you shouldn't have any problem with it. Graphically, the three versions are pretty predictable in that the GameCube version looks a tad better than the PS2 version, and the Xbox version looks a bit better than the GameCube version. With the addition of online play in the Xbox version of the game--coupled with the slightly better graphics than its console counterparts--the Xbox offering is definitely the one to get, unless you're really jonesing for the features included in the PS2 Collector's Edition, in which case you'll need to go with the PS2 version of the game. When all is said and done, Madden NFL 2005 is still Madden. That is to say, it's another superb game of football that continues Madden's long legacy as one of the best in the business. The defensive changes made to the gameplay are likely going to set the standard for football games in the years to come, and the additions to the franchise mode easily make the mode the best of its kind. It's unfortunate that the other portions of Madden NFL 2005 aren't quite as improved over last year's installment in the series as these key areas are, but that small quibble shouldn't stop any Madden fan from running out to purchase yet another highly accomplished game of football in Madden NFL 2005."}