{"ref": "https://www.gamespot.com/reviews/mass-effect-legendary-edition-review/1900-6417679/", "date": "May 25, 2021", "game_name": "Mass Effect Legendary Edition", "text": "It's been a whole console generation since we last saw Shepard, Tali, Garrus, and the rest of the Normandy crew. Mass Effect: Legendary Edition remasters BioWare's space opera RPG trilogy for the new generation of consoles, enhancing the visuals, implementing quality of life improvements, and making welcome adjustments to certain content for all three games. In those adjustments, Legendary Edition occasionally draws unwanted attention to parts of the trilogy that haven't aged gracefully, but as a whole, this remaster is a good way to see what all the fuss is about if you missed out on the first three Mass Effect games the first time around, or are just looking for a reason to dive into them again.The core of Mass Effect is its choice- and consequence-driven narrative. As Commander Shepard, the first human to be given the role of a Spectre (basically a space cop) in the interspecies Milky Way government, you are put into many situations where you have the final say on how things go down. Your choices in the first game can influence how characters perceive you or how events transpire in the second, which then can domino effect into the third. It's up to you to decide whether you wish to be a paragon of virtue or a results-oriented renegade in your mission to defend the entire Milky Way's galactic society from a large number of conflicts, while an even greater threat looms on the horizon.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Mass Effect Legendary Edition ReviewWhile this consequence-driven system seems to allow a great deal of agency in how you resolve certain conflicts, it's rigid in its design, basing the entirety of Shepard's morality on a binary system of Paragon and Renegade choices. Its simplicity does make the system fairly approachable, reducing the complexity of every decision to a ~morally good~ and ~morally bad~ choice for those looking to play through the trilogy entirely Paragon or Renegade. Additionally, from an accessibility standpoint, splitting Shepard's choices into a rigid binary helps with better understanding the underlying nuance to certain dialogue choices before picking them.But in sticking to this rigid binary, the Mass Effect trilogy strips the tension from certain situations. Mass Effect 2 possesses one of the most egregious examples, where one of the later missions finishes with asking you whether you want to brainwash an entire group of people to think the same way that you do or simply kill them all. Up to that point, your squadmates provide pros and cons for committing to either option, but the game then regulates the former as the Paragon choice while the latter is Renegade. This undermines the implied tension of the choice--this should be an impossibly difficult decision to make: When it comes down to it, do you think that it is better to deal with those who disagree with you via indoctrination or genocide? But the trilogy's binary choice system removes that nuance, telling the player that, in this instance at least, remaking someone without their knowledge is morally better than killing them. Regardless of whether you agree or disagree with that conclusion, the game strips that agency from you by reducing the conflict to a question of whether you want to resolve the issue as a Paragon or Renegade.This can make the Mass Effect trilogy feel unrewarding at times--at certain points across all three games, special Paragon and Renegade dialogue options will pop up that allow you to resolve the situation and achieve an ideal outcome, but you can only pick these choices if you have enough Paragon or Renegade points, which are earned by picking Paragon or Renegade dialogue options. So to get the best outcomes for certain situations, you need to make a lot of Paragon or Renegade choices, encouraging you to lean one way or the other. And it's not very satisfying to see how your choices play out across three games if you're being funneled down to one of two predetermined paths.But the Mass Effect trilogy's strength has always existed in the story around those choices, not the choices themselves. And Legendary Edition holds true to that. The trilogy's most memorable moments have been preserved. Mass Effect 2's loyalty missions are still some of the best storytelling that BioWare has ever done, with those for Mordin Solus, Legion, Samara, and Tali'Zorah standing out as highlights. And although Mass Effect 1 still doesn't deliver a compelling reason to really romance anyone, its two follow-ups better utilize the romance feature, adding replayability as you explore all possible relationships. The 13 possible romances (plus the handful of one night stands and flirty relationships you can pursue) can have substantial impacts on the story and your understanding of who your crewmates are, encouraging you to replay the trilogy in order to gain additional insight into certain characters.And, on top of that, Legendary Edition's content adjustments and visual enhancements do add new memorable moments for returning fans to enjoy. So even if you've replayed the trilogy a half dozen times, there are still new ways to appreciate the games in this remaster.I love what Legendary Edition does for Eden Prime, Mass Effect 1's opening level, for example. In the original game, the sky was blanketed in murky red clouds, with lightning flashing. It looked like the end of the world had already occurred and you were coming in on the tailend of an invasion, not during it. In the remaster, Mass Effect 1 now opens on a sunny day, which I find to be far more eerie. This change shifts Mass Effect 1 to better align with the openings of Mass Effect 2 and Mass Effect 3, both of which also begin with an unforeseen, unknowable force interrupting business as usual, mirroring the greater framework of how these games are composed of simple, seemingly everyday decisions being interrupted by brutal consequence.Most of the scenes and character models in Legendary Edition are enhanced with more detailed graphics and improved lighting. This has done wonders for many of the alien characters, especially your squadmates. The individual scales across Liara's back and Thane's face and Garrus and Wrex's deep scars are much more detailed, for example. Some of the human characters, however, aren't as lucky, especially for folks who are darker skinned, like Anderson and Samesh Bhatia. In locations where there are a lot of reflective surfaces, like the Citadel, the remaster's Mass Effect 1 brightens up their faces in a way that creates blotches of white on their skin, almost like the characters were in the midst of applying shiny paint to their faces when Shepard came along. It's never a great look, though it occurs far less in Legendary Edition's Mass Effect 2 and even less so in Mass Effect 3.And to that end, not all of Legendary Edition's enhancements are good. For example, increasing the lighting in the previously dark scene in Mass Effect 1 where we see Saren and Benezia together for the first time reveals the lack of detail in the background, a fact that the player was likely never supposed to notice. Additionally, the models for some characters, like Kelly Chambers, lose a bit of their original charm in this remaster. In Legendary Edition, Kelly's features are muted for example, subduing the redhead with bright green eyes into a brunette with brownish green eyes--her new design isn't as unique and doesn't stand out as easily as it did before. But these are all minor complaints--for the most part, the Mass Effect trilogy's original vision has been preserved in this remaster.The exceptions largely exist in Legendary Edition's Mass Effect 1, which sees the most substantial changes in this remastered trilogy. The most noteworthy is Mass Effect 1's combat, which has been improved to be less temperamental than the original release. Shepard snaps to cover more seamlessly in the remaster, for instance. In the original, players needed to push an additional button to crouch while ducking behind a short wall. However, in the remaster, simply pushing the analogue stick towards cover will make Shepard duck behind it.There are a couple of other small adjustments too, like improved aim assist so it's easier to strafe targets and a dedicated melee button so you can decide whether to shoot or punch out an enemy rushing your position (in the original game, you just automatically melee attacked when you fired your gun at point-blank range). The overall effect is that it no longer feels like you're fighting the enemy and the controls in the midst of a firefight. Dying in Legendary Edition's Mass Effect 1 is a far less frustrating affair as a result; when it happens it's more likely due to a mistake on your part, as opposed to the mechanics or controls not playing nice.Granted, there are still issues. Certain biotic and tech abilities can uselessly collide into a wall if your target side-steps out of your line of sight, as powers don't curve around cover like their Mass Effect 2 and Mass Effect 3 counterparts. It doesn't happen all the time--most of Mass Effect 1's battlefields are located in fairly open areas full of straight-shot sightlines--but it happens enough times to be noticeable and annoying, especially in the enclosed spaces found in all the bases you'll uncover across Mass Effect 1's many optional side missions.It's notably still a bit janky, lacking the polished improvements that made Mass Effect 3's combat good enough to warrant the addition of a multiplayer horde mode (which is sadly absent in this remaster). The Mako in Legendary Edition's Mass Effect 1 is also a bit janky, lacking the vehicular control seen in Mass Effect 2's Hammerhead, but it thankfully at least handles better than it did in the original game. The explorable planets in Legendary Edition's Mass Effect 1 are still bare of sights to see and a bit of a slog in their repetitive collectibles and missions, but at least it's now a bit easier to drive on them.Legendary Edition makes a few other changes to the original trilogy's content too. Some are big, like the aforementioned adjustments to Mass Effect 1's combat and driving mechanics. Others are minor but no less welcome, like changing Mass Effect 1's Elanos Haliat from a human to a turian to better fit his backstory, removing the gratuitous shots of Miranda's ass while she discusses her personal trauma in Mass Effect 2, and adjusting the picture you get of Tali's face in Mass Effect 3 so it doesn't look like a poorly photoshopped stock photo. So even though Legendary Edition isn't a full-blown remake, it goes beyond a traditional remaster, adjusting the very content of the game so that it's an improved experience. But as I mentioned in the intro, the one major downside to these improvements is that it further highlights the original drawbacks of the Mass Effect trilogy that were not changed for the remaster, like the games' poor depiction of mental disabilities and autism. There are small examples, like Mass Effect 1's Dr. Warren noting that ~genius and madness are two sides of the same coin,~ and larger ones such as Mass Effect 2's David Archer--a man who's autistic--being used as a prop, the misunderstood ~monster~ in the Overlord DLC, which is a story that largely focuses on the Dr. Frankenstein-like abuser Dr. Gavin Archer, instead of the victim.Neither of those instances have been changed in Legendary Edition. They were problematic when these games first released, and continue to remain so now. And there are other examples of problematic content across the trilogy, pieces of BioWare's original games that have not aged gracefully years later. As a result, Legendary Edition can feel strange to play through during certain moments; it feels like the remaster only takes a half-step toward improvement in certain aspects.For some of the content, the issue is not the nature of what it is, but how it's delivered to the player. Legendary Edition launches with pretty much all of the trilogy's DLC. But these expansions are implemented in a way that makes them more difficult to enjoy for newcomers. For example, Mass Effect 2's The Lair of the Shadow Broker is unlocked as soon as you finish Act 1 of the game, when you're allowed to travel to Illium for the first time. So you know you have information for Liara before you know it's even possible to meet up with her, and you have information to help her track down the Shadow Broker prior to completing errands for her and learning that she's hit a deadend in her search for the Shadow Broker. Returning players will know to hold off and let the story play out in a way that makes sense, but newcomers can easily just stumble into that DLC without knowing they should do other stuff first. Legendary Edition fails to seamlessly integrate all of its expansions into the trilogy's overall story (post-launch add-ons Omega and Citadel in Mass Effect 3 are also notable standouts for their poor integration), which can lead to an annoyingly inconsistent narrative.The remaining changes in Legendary Edition are small but still worth shouting out. First off, I'm disappointed that the trilogy does not have a truly unified character creator. As Shepard's morality in Mass Effect 2 and Mass Effect 3 plays a hand in whether they have scars, the option to add scars is only in Mass Effect 1's character creator. It's a bit weird to see my Shepard somehow lose her badass scars in between the events of Mass Effect 1 and Mass Effect 2. Also, I can understand why, but I'm still sad that Mass Effect 3's multiplayer didn't make the cut. Mass Effect 3's combat is still amazingly solid, nearly 10 years later. On the more positive side, Legendary Edition's improved load times are wonderful, removing much of the frustrating waiting in getting lost on the Citadel or dying to the same enemy over and over. Additionally, it's awesome to finally see a default female Shepard across all three games.All in all, Mass Effect: Legendary Edition isn't this huge transformation for the original trilogy. The remastered Mass Effect 1 is a more enjoyable experience than playing the original game today, and makes for a far more palatable entry point to the series. And Mass Effect 2 and Mass Effect 3 look far better than they did before, with minor but welcome changes to specific pieces of content. But otherwise this remaster delivers the same experience the original trilogy did. In some respects, that's not a wholly good thing--time has reinforced and made clearer certain underlying issues of the trilogy. But there's a reason the Mass Effect trilogy is beloved by so many: Its strength resides in the wonderful journey that it sends you on, one that's preserved in this remaster."}