{"ref": "https://www.gamespot.com/reviews/il-2-sturmovik-birds-of-prey-review/1900-6227721/", "date": "September 16, 2009", "game_name": "IL-2 Sturmovik: Birds of Prey", "text": "IL-2 Sturmovik was one of the finest flight sims ever created for the PC, and with Birds of Prey, the series finally makes the jump to consoles. Thankfully, it makes concessions to its new audience with a very accessible arcade difficulty level while also offering the full-on simulator experience from the PC. Crucially, the intense thrill of airborne dogfighting is accessible at every difficulty level in both the exciting single-player campaign and the enjoyable 16-player multiplayer mode. There are problems--frame rate issues and a lack of variety in the campaign--but if you have any interest in historic air combat, then Birds of Prey is worth checking out. With Birds of Prey, IL-2 Sturmovik has finally been made accessible to a console audience. Before you can get into the single-player campaign, you have to play through three tutorial missions. They're short and help you get used to basic flight and combat. Once completed, you unlock the arcade difficulty level for the main campaign, which is geared toward accessibility and ease of use. You can fly your plane around without any risk of stalling and the ammo is unlimited. You even have weapon assists that show you where to fire in order to take in the distance to your target. It's clearly designed for people who've never experienced a flight sim before, and while it does make the game incredibly easy, it offers all of the game's thrills without requiring you to learn any of the advanced flight mechanics. Thankfully, if you continue to play through the tutorials, you unlock the realistic and simulation difficulty levels, which make things a lot more challenging. The realistic option turns off the majority of the assists, restricts your ammo supply, and makes the handling much more authentic, so you'll stall the plane if you bank too quickly. The result is that you have to be much lighter on the controls, but it makes the dogfighting even more satisfying as you fight not only against your enemy, but also your plane. The simulation mode is even further removed from arcade and turns Birds of Prey into a very different experience. You're forced to play from the cockpit or gunner's viewpoint, and there's no radar or heads-up display to differentiate between enemies and friendlies. The screen will also turn red when you pull too many Gs during an extreme maneuver. All this means that simulation is the domain of flight sim veterans only, but this is a good thing to see on a console. No matter what difficulty level you're playing on, Birds of Prey does a fantastic job of re-creating the thrill of dogfighting in World War II-era planes. Flying these machines is very satisfying; the way they move in the air just feels right. The mixture of planes--from the light Hurricane Mk 2 to the behemoth of the IL-2 itself--allows you to experience plenty of different vehicles, but the combat is even more satisfying. By holding the left trigger, the camera moves to automatically track your target, helping you to keep an eye on them even if they're employing evasive maneuvers. It also gives a really dramatic view of the action, as you can see the damage inflicted on your bird, and it adds to the thrill of the dogfight. If you've ever wanted to experience the airborne combat of World War II, Birds of Prey has what you're looking for. IL-2's single-player campaign spans 20 missions, which are spread across six different World War II battles. They cover a good portion of the conflict, from the German invasion of Britain over the white cliffs of Dover to the Battle of Berlin over the war-torn German capital. It's welcome to see some more unfamiliar battles covered too, such as the Invasion of Sicily, and you have the chance to play as many Allied forces, including British, American, and Russian. There's plenty of variation in terms of location in the campaign, but the same can't be said for the mission types, which nearly all revolve around dogfighting or bombing runs. Though those are the primary actions performed by fighter pilots in WWII, the mission structures and pacing could have benefited from more variety. You can finish the campaign quickly if you're playing on the arcade difficulty level, but you can reduce your allocation of lives to make things more difficult. The result is that you'll have to repeat missions more often, and you can extend each level (and improve your score) by taking on secondary objectives as well. Birds of Prey also offers plenty of rewards for playing through the main campaign. The cinematics that introduce each of the six battles do a good job of setting the scene, with documentary footage and voice-overs that mix historical information with personal anecdotes from the war. You also unlock loads of extras in each level, from 3D models of the Allied and Axis planes to encyclopedia articles on the history of the war. There's plenty of information on stunts and tactics that you can employ in the game, and while these might more effectively have been incorporated into tutorial missions, the 3D models showing different rolls certainly look cool. The multiplayer package is well rounded, and although it's a shame there's no co-op play, the competitive offering has 16 players and four different game modes. These are based on familiar multiplayer concepts--Dogfight and Team Battle modes are just Deathmatch and Team Deathmatch, respectively. Capture Airfields is a Domination mode where you have to physically land your plane on airfields to capture them. Finally, Strike mode sees you destroying enemy ground units while protecting your own. These games are fun, especially Capture Airfields, because you're much more vulnerable on the ground when capturing runways. That said, the game modes are too segregated because they're split into ranked and unranked matches, the four game types, and the three difficulty levels. As a result, getting into games with the maximum 16 players is difficult unless you set them up yourself. Dogfights are intense--there's nothing like taking out an enemy and seeing them parachute down to earth. IL-2 Sturmovik is a good-looking game, with pleasingly detailed plane models and environments. The game throws up a mixture of locations, including snow-covered villages, bustling cities, and nighttime battles. While things don't look quite as impressive upon close inspection, it's enough to impress from the air. The plane models are also very realistic, and they become riddled with bullet holes and snap in different places depending on where you're hit. The impact of all this is deadened by some dramatic frame rate problems, though, with some very intrusive slowdown during combat. There are also some screen tearing issues that arise when you turn the plane quickly in the air. This slowdown is not the only sign of a game that feels unfinished in places either. If you change the controls, the tutorials don't update; and if you complete certain mission objectives out of order, they won't be recognized and so you're unable to complete the mission without restarting it. The audio fares a lot better, with radio chatter that's delivered in the native language of whichever army you're fighting for, and translated into English text on the HUD. The orchestral score fits the serious mood of the game perfectly, although the one track that loops on the menu screen soon becomes tiresome. IL-2 Sturmovik's dogfights and bombing runs are exciting enough to satisfy anyone with an interest in air combat. It successfully caters to both novices and veterans, and it's good to see such a faithful sim appear on a console. The campaign is a little short and would've benefitted from more mission variety, but if you want to experience some great World War II dogfighting on your console, Birds of Prey fits the bill."}