{"ref": "https://www.gamespot.com/reviews/sega-arcade-gallery-review/1900-6029497/", "date": "June 4, 2003", "game_name": "Sega Arcade Gallery", "text": "THQ's Sega Arcade Gallery brings together four classic arcade games on a single Game Boy Advance cartridge. The collection includes Space Harrier, OutRun, Super Hang-On, and After Burner, all of which were originally released between 1985 and 1987. For the most part, the games come across well on the Game Boy Advance. All four employ traditional two-dimensional sprite-based graphics and use basric scaling and rotation effects to suggest the appearance of three-dimensional environments--a technique that's perfectly suited to the capabilities of Nintendo's popular handheld. While these games would seem dated on a more powerful console, they fit right in on the GBA. Even today, OutRun is a truly enjoyable racing game. Space Harrier is the oldest game in the compilation, and it's also the most unique. Set in a world known as the fantasy zone, the game puts you in control of a warrior who soars through the air on a jetpack and battles monstrous creatures using a powerful blaster rifle. Thanks to the forward thrust produced by the jetpack, enemies and terrain are constantly racing toward you. It's your job to dodge these hazards and use your blaster rifle to defeat the bosses waiting at the end of each stage. Space Harrier was just the second project for a 27-year-old producer and programmer named Yu Suzuki, who would later go on to design many recent hits such as Virtua Fighter 4, F355 Challenge, and Shenmue. Bits Studios did a nice job of bringing Suzuki's second undertaking to the GBA. The psychedelic color schemes and fast shooting action are just as addictive on the smaller screen. The only major deviation from the arcade game is the removal of the specific theme music for each of the bosses. Eagle-eyed fans of the original will also notice that the enemies don't aim as accurately in the GBA version, but the game is still plenty challenging. The next game in the collection is OutRun, which places you behind the wheel of a snazzy red sports car. Your goal is to beat the clock while traveling from one course segment to the next. Although there aren't any opponents to speak of, commuter traffic can slow you down or nudge you off the highway--where a collision with the various signs and boulders along the roadside will lead to a time-consuming rollover accident. A gearshift toggle lets you select between high and low gears, giving you better control through hairpin turns. The most distinctive feature of OutRun is that it allows you to choose between two different pathways at the end of each course segment. In this fashion, the scenery changes with each successive segment, giving you control over how the environment looks every time you play the game. In total, the game contains 15 unique courses. Except for a few minor differences, the version of OutRun included in this compilation is a tiny doppelganger of the original arcade game. The most noteworthy change involves the tendency of the car to pull more quickly toward the side of the road at higher speeds. This is a difference some purists may scoff at, but it literally takes less than 30 seconds to adjust to. Devoted fans often point to the game's music as its most outstanding aspect, and the GBA duplicates all three music selections with remarkable accuracy, even if the bass volume seems a little loud at times. Cosmetically speaking, there are fewer boulders and signs lining the side of the road, and the signs announcing the names of upcoming course segments are absent. All the other graphical features from the arcade game are present, however. Super Hang-On, the third game on the cartridge, has a lot in common with OutRun. The underlying goal of both games is the same: to reach the end of a lengthy course as quickly as possible. Here, though, all the vehicles are motorcycles as opposed to cars and trucks. There are a few other differences as well. The gearshift has been replaced with a nitrous boost that you can trigger at top speed, and you no longer have the option to pick and choose course segments during a race. Instead, you choose one of four different premade route maps before the race begins. In all, the game contains a grand total of 48 different course segments. Those of you who remember Super Hang-On for the Sega Genesis may be disappointed to learn that the GBA version doesn't allow you to collect parts or hire different mechanics. Those features were unique to the Sega Genesis version and not included in the original arcade game, which the GBA conversion is based on. Rounding out the collection is After Burner, an aircraft-based shooter in which you have to work your way through roughly 20 stages of oncoming fighter planes. Even though this pint-sized conversion of After Burner looks and sounds like the original arcade game, it doesn't play nearly as well. The controls are slow to respond, and you can avoid most--if not all--incoming fire by performing barrel rolls. The game is also just flat-out missing a few major aspects from the original arcade version, such as the ability to attack ground targets during bonus stages or the need to escape chase planes using the onscreen radar. This version of After Burner is missing a few aspects from the original arcade game, such as the ability to hit ground targets in the bonus stages. The only other low point for the compilation is the absence of a save feature for recording high scores or pausing games in progress. This isn't a huge complaint by any means, but it's still annoying to make progress in a game or to input your name onto the high score list and have all your hard work disappear once you turn the system off. Despite the omissions and deficiencies in After Burner and the unfortunate absence of a save feature, Sega Arcade Gallery is one retro collection that's worth owning. The ports of Space Harrier, OutRun, and Super Hang-On are remarkably close to the original arcade versions, and all the games in the compilation compare well with what's already available for the Game Boy Advance."}