{"ref": "https://www.gamespot.com/reviews/undead-knights-review/1900-6237615/", "date": "October 22, 2009", "game_name": "Undead Knights", "text": "These days, if you want to create instant fun, it seems as if the solution is to ~just add zombies.~ Undead Knights for the PSP, from publisher Tecmo, takes this philosophy and runs with it by injecting a healthy dose of reanimated rotting corpses into mundane, screen-filling hack-and-slash action. The idea of transforming hordes of enemies into your own personal army of shambling doom is an intriguing one, but in the case of Undead Knights, the end result is little more than a Dynasty Warriors-style game sauteed in extra zombies. You play as one of three pallid, undead warriors hell-bent on revenge. They were once loyal knights serving under King Gradis in the kingdom of Cavalier, but because the knights suspected the king's beautiful (and overly buxom) new queen of foul play and witchery, they are murdered at the behest of the king. After their deaths, a mysterious being known as ~The Beast~ offers to revive them as undead and grant them the power to turn their enemies into zombies under their control. Though there's a twist or two thrown in for good measure, the plot mostly serves as a straightforward excuse to make a soldier-slaying and zombie-making mess. Yes, you can turn this big lug into your very own pet zombie. Undead Knights attempts to play up the drama with cutscenes, but a few strange elements make it difficult to take the presentation seriously. The major enemy characters in the game are voiced-over with dramatic acting that is appropriate for the game's fantasy medieval setting, but your characters sound like rejects from heavy metal and punk rock bands. The dialogue is scripted to match the voices; thus, your enemies speak lines that are--again--appropriate for the setting, but your own characters will throw in vulgarities for no other purpose than to titillate the player (or perhaps the writers), and no one's mouth moves at all during spoken lines. The only explanation for this odd mixture is perhaps that the game is going for unintentional humor. Thankfully, none of these odd decisions get in the way of the gameplay. On the field, your characters can slash, jump, evade, and grab. Grabbing an enemy turns him into a zombie; grabbing a zombie allows you to either throw it or smash it into the ground for an explosive attack. There's a delay--determined by how strong he is--from when you grab an enemy to when he's fully converted into a zombie. This encourages you to weaken said enemy enough to the point where you can instantly convert him. With each successful conversion, you fill up a meter under your health bar that, when full, allows you to unleash a devastating combo attack that renders all victims zombies. Beyond this, though, there's little technique you'll actually need to employ. Because you're likely to be crowded by a mass of soldiers at most points during combat, you'll be just fine if you mash on the weak attack button for a few swings and then repeatedly hit the grab button. Having the zombies on your side is advantageous because they'll keep lesser enemies distracted, but their most notable use comes when you have to overcome obstacles. You can command your zombies to destroy archery towers, as well as siege machines and barricades. Comically, you can also throw them onto spiked wrecking balls so that they roll into enemy forces, and you can command them to form a bridge across chasms. If you've ever craved a game in which you can walk across the backs of undead minions, then this is it. Once the initial glee of controlling an undead army dies down, however, the game's tedious pattern becomes painfully clear. Most of the level design boils down to fenced-off kill rooms, so more often than not, you'll simply enter an arena-style environment, slash at soldiers, convert as many zombies as you can, and then hold down the R button to command them to wreck something. Occasionally, larger and more powerful enemies will visit to make things interesting (at which point you'd best employ your special attack), but it's not until the last one-third or so of your playing time that things get really challenging and the whole repertoire of enemies comes at you supplemented by multiple traps, such as land mines, cannons, and spike traps. You're encouraged to slaughter as many enemies as possible while completing each chapter as quickly as possible because the game ranks your performance and awards you dark energy with which you can upgrade your characters' abilities. Sadly, the list of upgrades isn't exciting: All you have to look forward to is maximum health, increased attack power, two combination attacks, and a few peripheral abilities and buffs. There aren't any new weapons to discover. There aren't any magical abilities or new special attacks to learn. What's most disappointing is that the possibilities for powerful, inventive, or even amusing new zombie techniques are never explored. You'll be hard-pressed to find another game that lets you walk across the backs of your zombie servants. The zombies themselves are almost all the same--shirtless blue-bodied detritus--which makes sense because a great majority of the enemies are the same armored soldiers differentiated only by the colors of their smocks. With a few of the larger executioners and monsters thrown into the mix, combined with some of the more detailed fortress environments, Undead Knights looks decent enough. The frame rate never bogs down to unplayable levels, so some of the flatter character models can be excused, given that you might see dozens of enemies on the screen at once. Again, though, it's not until much later into the game that you'll see anything more interesting than rocky paths, dirt trenches, or the inside of a stone fortress. (One embarrassing note: Enemies will spawn out of thin air, sometimes right in front of your face.) The music fares slightly worse because it consists almost entirely of wailing electric guitars churning out angry yet generic riffs that all start to sound the same by the third hour. All told, the presentation is almost as tedious as the gameplay. Undead Knights offers you three difficulty levels from the start, allowing you to go through any of its 20 chapters on ~Hell~ difficulty if they get too boring. It also has its own list of achievements (dubbed Revenge Titles) that unlock for such things as throwing a certain number of zombies, turning a certain number of soldiers or larger characters into zombies, destroying a certain number of structures, and the like. They've been given amusing names, too, with some favorites being ~Boom Goes the Dynamite~, ~Tenacious Z~ and ~World's Greatest Boss~ among others. The game allows you to revisit any chapter to improve your rankings and throws in three multiplayer modes for good measure as well. These are actually more interesting than the main game: One mode has you throwing zombies at a second player to see who can score the most hits; another has you racing through several areas before fighting to the death; and the last one is a token Survival mode. The amusement of chucking corpses at each other or pummeling each other after a race isn't necessarily worth playing through six hours of the single-player game just to unlock every multiplayer map, but it's nice to have these options. There's nothing entirely terrible about Undead Knights, except for maybe the soldiers that infinitely spawn out of nowhere. It's just disappointing that the action remains so simple and unremarkable when many similar games exist for the PSP. This is especially true when you consider that creating a zombie army--its one leg up on such games as Dynasty Warriors and Warriors Orochi--doesn't let you do anything much more exciting than demolish an iron gate."}