{"ref": "https://www.gamespot.com/reviews/4x4-evolution-review/1900-2645550/", "date": "May 17, 2006", "game_name": "4x4 Evolution", "text": "One of the ironies of the craze over sport-utility vehicles is that nine out of ten people who own one never take advantage of what they're made for - traversing rugged terrain that would shred sedans, coupes, and vans in a matter of minutes. When you see a Mercedes-Benz SUV heading down the highway, you can't help but think that the only jostling the driver will ever experience in it is hitting speed bumps at the mall. It's the SUV paradox: Who wants to take a chance on smashing up an off-road vehicle that costs $40,000 by taking it... off road? Now, there's a fun way to experience cross-country SUV racing without worrying about destroying the vehicle it took a second mortgage to buy. Thanks to Terminal Reality - the same developer responsible for the exciting Monster Truck Madness games - SUV lovers (and haters) now have the chance to strap themselves into 4-wheel-drive vehicles and explore some of the best-looking terrain ever created for a racing simulation. Actually, ~simulation~ might not be the right word to describe a game where you can sail 20 feet above the ground and land with hardly a scratch or nick to show for it. But while 4x4 Evolution opts for fun over realism, it's a trade-off that you'll probably appreciate as soon as you take the game for a spin. 4x4 Evolution features 66 licensed trucks and sport-utility vehicles divided into three classes based on horsepower and racing modifications. Though you'll see many of the same vehicles in all three classes, there's still a huge number of rides to choose from: Chevy, Ford, Nissan, Dodge, Mitsubishi, Lexus, GMC, and Toyota are represented; Jeep and Subaru are the only substantial omissions. The cars are nicely rendered, but the lack of a true cockpit view is slightly disappointing - there's no optional dashboard in the first-person view. The quick-race mode lets you tear across any of the game's 16 tracks in the car of your choice, while the time-attack mode's ~ghost car~ option lets you race against a phantom truck that matches your own best times on any track. But the meat of 4x4 Evolution is the career mode, which forces you to start off in a relatively lowly off-the-lot car (2WD or 4WD, your choice) and earn dough to upgrade it by winning races. The competition is pretty weak in the early races, but as you move up into higher classes and onto tougher tracks, you'll find that the computer is surprisingly good. The bot racers - unfortunately, every computer-controlled car is named ~bot racer~ - aggressively seek shortcuts and engage in slam-and-ram tactics whenever they get the chance. In fact, it's a good idea to keep an eye on the computer-controlled car in front of you to learn shortcuts, though sometimes you can find better ones on your own. Once you see the stunning scenery and terrain graphics, you'll probably wish there were some sort of explore mode that lets you drive around the countryside without having to worry about lap times or prize money. Even on a midrange system with a decent video card, the frame rates tend to be very smooth even with all the graphics options turned on. The terrain is very lifelike whether you're slinging mud in a swamp or stirring up a cloud of dust in the desert, and you'll be impressed as all sorts of other vehicles like hang gliders, jets, big rigs, back hoes, and more go about their business as you fight to keep your car on the road and in the race. These other vehicles aren't just there for show, as you'll learn if you happen to go head-on with a 16-wheeler (don't worry, you don't get crushed - it just pushes you back) or if you slam into a bulldozer crossing the racetrack.As in the Monster Truck Madness series, the tracks in 4x4 Evolution are filled with shortcuts and numerous other surprises. You could probably spend hours finding all the goodies packed into each track, which would make the game a good value even if there weren't any multiplayer support. Fortunately, there is. However, the multiplayer mode could have had more options: Although 4x4 Evolution is playable over a LAN or the Internet, unfortunately it doesn't include support for modem, serial-cable, or split-screen racing. But the good news is that the GameSpy player-matching program has been fully integrated into the game, which makes it relatively simple to chat, find races, and even download new add-ons. The interface is rather plain, but it gets the job done - and that's good enough since the multiplayer racing itself is so much fun. Several sessions of online play proved to be relatively smooth and stable on a fast connection. Even though 4x4 Evolution is very fun either as a single- or multiplayer game, it lacks a few features that keep it from reaching its full potential. Most notably, the absence of force-feedback support will frustrate some players, especially since the force-feedback effects in the Monster Truck Madness games were so good. If Terminal Reality did such a great job with force-feedback effects in those games, why aren't they in this one? Terminal Reality claims that the time spent on creating a brand-new game engine put force-feedback support relatively low on the priority list of features. In addition, the game's multiplatform multiplayer compatibility (that is, players who own the game for the PC, Macintosh, and Dreamcast console can all compete against each other over the Internet) meant that players who had access to force feedback might have an advantage over the others. Whether or not that's true, there's still hope if you have a force-feedback controller, since there's a good chance that force-feedback support will be featured in a future downloadable add-on scheduled for release in November. Terminal Reality plans to release tools for editing existing trucks and tracks and also for creating new ones. Both features were meant to be included in the release version but were cut, presumably in order to make the scheduled ship date. While it's too bad that the editing tools were promised before the game shipped, at least they will eventually be made available for the game's many fans. At any rate, whether or not you like SUVs, there's simply too much fun to be missed if you pass up 4x4 Evolution. The bottom line is that if you like racing for the sheer thrill of it and don't need to have all the realism, then 4x4 Evolution is definitely recommended.As in the Monster Truck Madness series, the tracks in 4x4 Evolution are filled with shortcuts and numerous other surprises. You could probably spend hours finding all the goodies packed into each track, which would make the game a good value even if there weren't any multiplayer support. Fortunately, there is. However, the multiplayer mode could have had more options: Although 4x4 Evolution is playable over a LAN or the Internet, unfortunately it doesn't include support for modem, serial-cable, or split-screen racing. But the good news is that the GameSpy player-matching program has been fully integrated into the game, which makes it relatively simple to chat, find races, and even download new add-ons. The interface is rather plain, but it gets the job done - and that's good enough since the multiplayer racing itself is so much fun. Several sessions of online play proved to be relatively smooth and stable on a fast connection. Even though 4x4 Evolution is very fun either as a single- or multiplayer game, it lacks a few features that keep it from reaching its full potential. Most notably, the absence of force-feedback support will frustrate some players, especially since the force-feedback effects in the Monster Truck Madness games were so good. If Terminal Reality did such a great job with force-feedback effects in those games, why aren't they in this one? Terminal Reality claims that the time spent on creating a brand-new game engine put force-feedback support relatively low on the priority list of features. In addition, the game's multiplatform multiplayer compatibility (that is, players who own the game for the PC, Macintosh, and Dreamcast console can all compete against each other over the Internet) meant that players who had access to force feedback might have an advantage over the others. Whether or not that's true, there's still hope if you have a force-feedback controller, since there's a good chance that force-feedback support will be featured in a future downloadable add-on scheduled for release in November. Terminal Reality plans to release tools for editing existing trucks and tracks and also for creating new ones. Both features were meant to be included in the release version but were cut, presumably in order to make the scheduled ship date. While it's too bad that the editing tools were promised before the game shipped, at least they will eventually be made available for the game's many fans. At any rate, whether or not you like SUVs, there's simply too much fun to be missed if you pass up 4x4 Evolution. The bottom line is that if you like racing for the sheer thrill of it and don't need to have all the realism, then 4x4 Evolution is definitely recommended."}