{"ref": "https://www.gamespot.com/reviews/eagle-flight-review/1900-6416556/", "date": "October 18, 2016", "game_name": "Eagle Flight", "text": "Eagle Flight is a first-person VR shooter set in a dilapidated version of Paris where you pilot an eagle using your head. If that isnt quirky enough for you, its also a multiplayer-centric game where you shoot other eagles with supersonic screeches.Im susceptible to virtual reality motion sickness and can gladly say that I felt completely comfortable playing Eagle Flight. There are a few tricks that Ubisoft implemented in the game to mitigate nausea. For instance, you turn using only your head, rather than a joystick. It feels pretty intuitive, too. The only thing that takes a little getting used to is tilting your head to make sharp turns, since this is not a movement that youre likely to do in every-day life. Luckily, it took me less than an hour before it became second-nature. While the game requires a controller, youll only use it to slow down, speed up, attack, and shield yourself.While the main draw of the game is multiplayer, there is a single-player story mode. Eagle Flight takes place sometime in the future when Paris has inexplicably been abandoned by humans. Animals and vegetation have overrun the city. Youll learn a little more about your environment from the games narrator, who is well-acted and takes on a nature documentary-esque tone.There are dozens of short, simple missions. Some will make you fly through consecutive floating rings scattered throughout the city, while others will have you racing against the clock through treacherous underground parts of Paris, like obstacle course-laden subways and catacombs. The game can get challenging because you cant stop flying forward, and if you crash, you die and have to start missions over. As you progress through the game, youll be introduced to the aforementioned eagle screech attack, which youll use against other birds in escort-type missions. These levels can feel a bit unfair at times, as you quickly have to dispatch of numerous predators within a relatively short period of time.The campaign is pretty pedestrian overall and can be beaten in under four hours.The campaign is pretty pedestrian overall and can be beaten in under four hours. It ultimately feels like an elaborate training ground for the multiplayer, which is where the game is really able to spread its wings. Eagle Flight is a capture-the-flag game at its core. Two teams of up to three players must grab the carcass of a rabbit and bring it back to a nest. There is a surprising amount of depth. Because your screech attacks move slowly through the air, youll have to learn how to lead your shots. Diving down from above gives you a temporary speed boost. You can also fly into jet streams and between buildings to avoid enemy screeches. The environment can be just as dangerous as your enemies. Carelessly flying around may cause you to crash into a wall and drop the prey. You can also activate a temporary barrier to block attacks. Its a silly and unrealistic mechanic, but its a fun and useful tool that adds a layer of strategy.Teamwork is also essential in Eagle Flight. When an ally has the flag, its important to fly close to your carcass-carrying ally to kill nearby enemies. Multiplayer can be thrilling, and as odd as it sounds, weaving between buildings at high speed while dodging enemy fire made me feel like Luke Skywalker piloting an X-Wing through trenches of the Death Star.Weaving between buildings at high speed while dodging enemy fire made me feel like Luke Skywalker piloting an X-Wing through trenches of the Death Star.The multiplayer isnt perfect, however. Despite being modeled after Paris, the trees and buildings dont feel very distinct. Eagle Flights multiplayer also lacks voice support, which is an odd omission given how important it is to work together. Finally, while Eagle Flights multiplayer is really fun, theres only one mode to sink your talons into.Eagle Flight initially sounded like a kooky concept to me, but I cant remember the last time I had this much fun playing capture-the-flag. The game has a surprising amount of depth, and its highly competitive as a result. There were multiple occasions when I couldnt help but scream when an enemy eagle killed me as I was a beaks length away from victory. And while the graphics arent amazing, just being able to quickly zip around Paris can be breathtaking. If youre looking for a really fun multiplayer VR game, you should fly like an eagle."}