{"ref": "https://www.gamespot.com/reviews/toem-review-look-at-this-photograph/1900-6417733/", "date": "September 15, 2021", "game_name": "TOEM", "text": "Toem begins when your nana gifts you a camera as you head off to see the ~Toem~ phenomenon. She nearly shows you her own photo from when she did the same thing at your age, but hastily hides it. Seeing the Toem phenomenon is presented as a rite of passage, and something you really just need to experience for yourself. She never describes exactly what Toem is, just that it's spectacular and life-changing. But maybe what she's really remembering is the journey to see it.Most of Toem is essentially a series of photo puzzles. When you first journey away from home, you learn that you can collect stamps on your community card by performing acts of kindness for townspeople (which almost always involve a camera, somehow) or fulfilling photo challenges. You might be asked to find a cartoonishly shady character hanging around town, or to point a lighthouse keeper in the direction of boats that need help using your zoom lens. Collecting enough stamps gets you a free bus pass to the next area. It's a simple, clever construct that creates a broad space for different types of puzzle challenges.All of this is presented in a stark black-and-white style that feels boldly minimalist. The view is isometric in a way that often limits your ability to see all of your surroundings, so you'll look from behind the camera lens to get a better view of things. The interplay between these views is constant, and despite a sparse visual style and monochrome presentation, it never feels confusing. Everything is perfectly readable in both views, which is a testament to the strength of the art design.With a concept like this it would be easy for puzzles to become over-reliant on forced perspective, making two pieces of the background join together in some way to make them look like one object. That isn't the case. This is first and foremost a cozy game, so the challenges are never outrageously tricky. Usually they're more like visual riddles requiring you to suss out what a person means by their request and how the surrounding environment can help you find it for them.Occasionally, though, a puzzle will be obscure or poorly explained. The worst is when you're certain you know what the answer is, but not how to complete it in the way the game wants. Sometimes a piece of dialogue explaining the puzzle, which may have given a clue, cannot be repeated and isn't marked the same way in your logbook. And while Toem is very open-ended--you can pretty much collect the all-important stamps in whatever order you wish--there are occasional times when one task is obviously acting as a gatekeeper for others. Getting stuck on one of these, however temporarily, can be frustrating.When you first arrive in a new area, you'll be absolutely inundated with new requests. The environments are designed with a natural circular flow, so as you get the lay of the land you'll find more people, unlock new areas, and fulfill requests. There's a natural rhythm to walking around town, spotting new things you hadn't spotted before and grabbing photos, and then repeating the loop to do it again. Often you'll find yourself getting a new request and having a ~eureka!~ moment, remembering something conspicuous you had seen on your last trip around. I made a habit of taking photos of anything that seemed out of place or visually interesting, just to be prepared.Exploring the different areas also gives you an ever-growing collection of cassette tapes you can play on your Hikelady. Toem cycles through these by itself, but you can pick one to play as well. The soundtrack is soothing and inviting, with a variety of musical and instrumental styles to represent the various areas. You have limited control over playback, though, and will have to manually select one track at a time instead of creating any kind of playlist or blacklisting songs that aren't your fancy. The catchy tunes usually fit the mood well enough on their own without fussing with the controls.There's a light equipment system at play in Toem. Sometimes you'll need to wear a particular hat to gain access to an area, or wear a certain type of footwear to use a special ability. Most of the equipment is purely cosmetic and the game clearly signals when it has an actual gameplay function. Fiddling with your equipment is only slightly and occasionally tedious, since it doesn't come up often. It's not much of a hassle, but it does slightly interrupt the soothing experience when you're in an area that requires costume changes.The story themes in Toem are delivered with the lightest of light touches. You're encouraged to go out and see the world, and in an abstract way, it seems to resemble a gentle coming-of-age story about a kid's first trip away from home. While it's ostensibly about seeing the beauty of the world through a camera lens, it's open-minded about the forms that beauty can take. You're not limited to nature or wildlife--though both of those play a part. You'll find something worthwhile in the way kids play in the woods, a salty old fisherman on a dock, or graffiti along the sides of buildings in a cityscape. It's a very silly and whimsical game on the whole, but those moments make it feel like it has something to say about appreciating your surroundings, whatever they might be.Toem is a slight game--just around three to four hours--which keeps it from overstaying its welcome. Going back through every area to collect every last photo for your collection will extend its playtime, but on the whole it's just short and sweet.When you reach Toem, the event itself, it really does feel spectacular in the context of the game. More important, though, is what it represents. Toem is a simple, cute fable about growing up and engaging with the world. And like the phenomenon, it's really best if you see it for yourself."}