{"ref": "https://www.gamespot.com/reviews/sheep-raider-review/1900-2816273/", "date": "October 3, 2001", "game_name": "Looney Tunes: Sheep Raider", "text": "Die-hard Looney Tunes fans and young children will enjoy Looney Tunes: Sheep Raider, as it definitely captures the essence of the Warner Bros. ~Sheep, Dog, and Wolf~ animated shorts. Sam Sheepdog, playing himself, fits wonderfully into the role he was born to play, while Wile E. Coyote turns in an almost Shakespearean performance as the lovable sheep-stealing brigand, Ralph Wolf. However, as video games go, Sheep Raider is neither spectacular, nor challenging, nor interesting.Much like in the cartoon, each of the game's 17 levels (and two bonus stages) has Sam watching over a herd of docile sheep. Assuming the role of Ralph, your job is to swipe these sheep--one per level--in order to prove yourself as a competent sheep stealer. Since there is an infinite number of continues and the game automatically saves your progress, there really isn't that much pressure to take risks or conserve health. As such, the joy of Sheep Raider lies in playing with the various Acme inventions scattered throughout each level and in watching Ralph receive a knuckle sandwich from Sam every time you make a mistake.Since it is obviously geared toward younger players, Looney Tunes: Sheep Raider is fairly straightforward. For his main actions, Ralph can jump, double jump, tiptoe, and run, as well as carry, use, or drop objects, Acme items, and sheep. Puzzles come in the form of traps and geological obstacles, as well as the ever-vigilant Sam Sheepdog. Onscreen indicators tell you where Sam is facing, in addition to whether you're in range for luring sheep or using particular items. For the most part, each area will make you hide behind rocks, tiptoe past Sam, lure sheep with lettuce, push boulders onto seesaws, swim past sharks, and defuse landmines--all in order to bring a solitary sheep back to the goal area. It's pretty standard 3D adventure fare, but there is fun to be had trying out Ralph's Acme toys, such as rocket packs, full-body slingshots, catapults, dynamite, fake shrubbery, rafts, and so on. Fans of Sam and Ralph will also find particular amusement in the time clocks present in each area, each of which represents another bonus point to use to purchase character art or hidden stages.The best thing about Sheep Raider is its visual presentation, which is colorful and surreal and often pushes the PlayStation to its limits in order to convey a very animated and whimsical setting. Sure, the game has the requisite texture warping and blurriness you'd expect from a typically rushed third-party product, but it also has an abundance of flowing rivers, crashing waterfalls, fluttering birds, falling leaves, and other such natural atmospheric elements that totally balance the equation. The map/hints menu is even drawn like one of Wile E. Coyote's famed blueprints! By the same token, Sam, Ralph, and the other cameo characters, such as Farmer Porky and Foghorn Leghorn, are also rendered exquisitely and do adequate justice to the original designs. Between each level or after every mishap, hilarious game-engine cinema scenes re-create the frequent demise of Ralph Wolf with cartoon-faithful brutality. In that alone, you could literally spend hours just finding new ways to watch Ralph fall, crash, splatter, or be pummeled to a pulpy end.The audio is similarly agreeable, although is taken down a notch by the second-rate voice acting and jazzy hip-hop music. Jazz remixes of Digital Underground and Mellow Man Ace aren't the most fitting music for a Looney Tunes game, but at least the sound effects are loud and painful. The game also scores major cool points for adjusting the pitch of sound effects depending on Ralph's proximity to the action, such as when approaching a waterfall or nearing a bleating sheep.Looney Tunes: Sheep Raider is probably best left for those who will truly enjoy it: children. Despite the game's inability to keep pace with the competition, the overall presentation is so charming and lighthearted that you'd be hard-pressed to bemoan its unfortunate shortcomings."}