{"ref": "https://www.gamespot.com/reviews/hitman-blood-money-review/1900-6152030/", "date": "May 30, 2006", "game_name": "Hitman: Blood Money", "text": "The bald-headed contract killer known only as 47 is in good form, primed and ready for more work in the latest installment in the dark, stylish Hitman series. Though very similar to the last two games in the series, the open-ended stealth action gameplay offered by Hitman: Blood Money is still just about as tensely exciting as ever. A few new twists to the formula, an intriguing story, and a memorably diverse, cinematic sequence of missions further make Blood Money worth it. More bad people in high places need to be murdered in Hitman: Blood Money. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Hitman: Blood Money Video Review This is the fourth game in the Hitman series, but previous experience with the past games isn't assumed or required. In fact, you'll probably be more impressed with the game if you've never played one of these before. Returning players will be in for a comfortably familiar experience. The previous games' stories are alluded to during the course of this one, in which 47 discovers that he and his employer are being threatened by some other mysterious agency. He'll learn more of the rival agency's motives as he completes his own jobs, all leading up to a surprising and climactic conclusion. The starting mission leads you by the nose through one of 47's typical assignments--to eliminate a shady theme park operator, whose negligence once cost the lives of many innocent people. This man, called the Swing King, even entered the drug business in the wake of his theme park's collapse. 47's employer has asked that a photo of a deceased loved one be the last image that the crook ever sees...but when you finally reach him, he's just this sad worm of a man who grovels at 47's feet. Despite the number of armed thugs you'll need to get through before putting the Swing King out of his misery, this mission is easy, provided you follow the step-by-step instructions you're given. Subsequent missions are substantially tougher and less linear, but this first one still is representative of the types of moody, affecting scenarios you'll encounter in the game. There are more than a dozen missions in all, and most of them are set somewhere in the United States, such as a Mardi Gras celebration in New Orleans, an Egyptian-themed Las Vegas casino, a rehab clinic in Northern California, a stately riverboat traveling the Mississippi, a posh Los Angeles suburb, and more. The game does a great job of realizing each of these different settings, making them feel appropriately large, complex, and alive. Mardi Gras is particularly impressive, its streets jam-packed with people partying. All of these places tend to be filled with armed guards as well as civilians, so you'll need to exercise caution in order to take out your targets and escape undetected. However, if you slip up (or deliberately blow your cover), you can always try to shoot your way out. As in the previous games, Hitman: Blood Money rewards stealth and careful planning, but if you want to try to run and gun your way through the levels, you have that option. You can instantly switch from the default behind-the-back perspective to a first-person viewpoint if you prefer, and the game lets you use a whole bunch of different, realistically modeled real-world pistols, rifles, and submachine guns against your enemies. Of course, it's possible to finish most missions in Hitman: Blood Money without squeezing off a single round, if you're careful and observant. Codename 47 is once again in the starring role, but the game's beautiful environments steal the show. You don't need to shoot your victims, because you have access to poisons, explosives, knives, and other means. In many cases it's possible to avoid getting blood on your hands altogether, by arranging an accident for your target--say, by causing something very heavy to drop on his head. Figuring out these trickier, cleaner kills is naturally gratifying, and it also tends to earn you a higher ranking (and more money) once you've escaped and your mission is accomplished. As in the previous games, planning your strike is easy thanks to a GPS-style real-time map that's accessible at the touch of a button, which shows you all other characters in the vicinity at the normal difficulty setting, including your targets. Tougher settings show you fewer characters on the map, make enemies more lethal, and also limit your ability to save your progress during a mission. Even so, between the map, your objectives list, and the ability to purchase more intel if you need it, even the most intimidating missions become solvable. It helps that 47 is much tougher than an average man, and can withstand a lot of gunshot wounds before finally succumbing in a red-tinged, slow-motion haze. As in the previous games, your enemies' artificial intelligence unfortunately doesn't hold up to close scrutiny, but at least it puts on a good show if you don't start messing around. When you're just observing, you'll find that the AI in Blood Money does a convincing job. You'll see characters chatting or lounging about, while guards casually patrol the premises. Someone might stop for a bathroom break or go outside for a smoke, not realizing the danger of splitting off from the crowd. If you resort to shooting your way through a mission, you'll find that your enemies will stand a chance of beating you only through sheer numbers. They'll recklessly come running to their deaths if you wait for them around a corner or in some other type of choke point, and they're easily killed if you aim for the head. Since self-preservation isn't important to any gun-wielding assailants in the game, it makes their deaths seem unrealistic and inconsequential, in contrast to the game's fairly serious (though sometimes darkly humorous) tone. Other less significant issues with the previous Hitman games also carry over to Blood Money. For instance, 47 is still a master of disguise, capable of wearing almost any slain foe's outfit, which helps him infiltrate mission areas. But changing clothes still looks as jarring as ever, with 47 suddenly appearing in the new uniform, while the old one magically appears in a neatly folded bundle at his feet. Disguising yourself in the clothes of your victims is often the best way to get close to your target. Or targets. Those who have been keeping up with the series will find that the gameplay changes in Hitman: Blood Money are minor, occurring mostly in between missions rather than during them. At the normal difficulty setting and above, you gain notoriety from one mission to the next by completing your objective sloppily--namely, by leaving behind a trail of corpses. Your notoriety can make you easier to detect in the next mission, though by paying an affordable fee in between missions, you can reduce your notoriety back down to nothing. So this turns out to be a negligible aspect of play, but having some sort of continuity between missions still helps the game. The money you earn from each contract can also be used to buy new equipment and customize your main weapons, outfitting them with larger clips, laser sights, scopes, silencers, and more. Another nice touch, at least on first impression, is that after each assignment, you get to see a newspaper cover story describing what happened in fairly exacting detail. These dynamically generated newspaper headlines turn out to be pretty predictable after a while, yet they're still a clever way of giving you feedback about how you performed in a given mission. During missions, you may now do such things as hide in closets to ambush your foes, use enemies as human shields, throw knives and other sharp objects, steal surveillance footage of your criminal deeds, and stash bodies in dumpsters or other large bins. But these aren't key additions, since you can go through the entire game without doing any of this stuff. Some missions, especially Mardi Gras, are much more crowded than any of 47's previous assignments, but the crowds are mostly for show. The missions must be played through in a linear order, but between the game's ranking system, its multiple difficulty settings, and the open-ended design of each individual mission, there's good incentive to play through the game more than once. While it's possible to rush through some missions in just a matter of minutes if you know what you're doing, most of them should take you closer to an hour the first time through. The Hitman series is no stranger to the PC, Xbox, and PlayStation 2. Blood Money is available for all of these platforms, as well as the Xbox 360. Each version of the game is identical in terms of content and structure, so the differences are technical in nature. As such, the Xbox 360 version is most impressive, since it features the best combination of sharp visuals and smooth frame rates. The PC version may look comparably as good on a fast system, while the Xbox and PS2 versions still appear quite attractive despite running on dated hardware. These console versions both support progressive-scan displays. Controls are similarly as good across the board, and the game handles about as well when played with a gamepad as with the stock mouse-and-keyboard setup for the PC (though inventory management feels a bit clunkier on the PC). The only other platform-specific difference that stands out is that the Xbox 360 version includes some unlockable achievements that reward you for playing through the game at successively higher difficulty levels and for finishing missions with top rankings. But it's also the most expensive. This may be another routine assignment for 47, but for all practical purposes, that's a good thing. Part of what's made the Hitman series so well liked is its distinct sense of style, which is unmistakably present in this latest episode. Another great soundtrack from series composer Jesper Kyd effectively sets the tone with a combination of choral tracks and downtempo electronic music. Realistic sound effects and generally good voice acting round out the audio. Some excellent atmospheric lighting and subtle animations, as when 47 hides a kitchen knife behind his back while approaching an unsuspecting victim, further add to the ambience. Enemies shot dead still die the same rag-doll deaths as they have since the original Hitman game, and you'll spot some repetition in the civilians and guards roaming each area. Yet the different mission areas in Blood Money definitely capture the overall look and feel they're supposed to. So in turn, when you successfully complete an assignment in one of these ominous areas, chances are you'll feel a sense of grim satisfaction, having experienced Hitman's potent formula again--or maybe for the first time. If you resort to shooting your way through a mission, you'll find that your enemies will stand a chance of beating you only through sheer numbers. They'll recklessly come running to their deaths if you wait for them around a corner or in some other type of choke point, and they're easily killed if you aim for the head. Since self-preservation isn't important to any gun-wielding assailants in the game, it makes their deaths seem unrealistic and inconsequential, in contrast to the game's fairly serious (though sometimes darkly humorous) tone. Other less significant issues with the previous Hitman games also carry over to Blood Money. For instance, 47 is still a master of disguise, capable of wearing almost any slain foe's outfit, which helps him infiltrate mission areas. But changing clothes still looks as jarring as ever, with 47 suddenly appearing in the new uniform, while the old one magically appears in a neatly folded bundle at his feet. Disguising yourself in the clothes of your victims is often the best way to get close to your target. Or targets. Those who have been keeping up with the series will find that the gameplay changes in Hitman: Blood Money are minor, occurring mostly in between missions rather than during them. At the normal difficulty setting and above, you gain notoriety from one mission to the next by completing your objective sloppily--namely, by leaving behind a trail of corpses. Your notoriety can make you easier to detect in the next mission, though by paying an affordable fee in between missions, you can reduce your notoriety back down to nothing. So this turns out to be a negligible aspect of play, but having some sort of continuity between missions still helps the game. The money you earn from each contract can also be used to buy new equipment and customize your main weapons, outfitting them with larger clips, laser sights, scopes, silencers, and more. Another nice touch, at least on first impression, is that after each assignment, you get to see a newspaper cover story describing what happened in fairly exacting detail. These dynamically generated newspaper headlines turn out to be pretty predictable after a while, yet they're still a clever way of giving you feedback about how you performed in a given mission. During missions, you may now do such things as hide in closets to ambush your foes, use enemies as human shields, throw knives and other sharp objects, steal surveillance footage of your criminal deeds, and stash bodies in dumpsters or other large bins. But these aren't key additions, since you can go through the entire game without doing any of this stuff. Some missions, especially Mardi Gras, are much more crowded than any of 47's previous assignments, but the crowds are mostly for show. The missions must be played through in a linear order, but between the game's ranking system, its multiple difficulty settings, and the open-ended design of each individual mission, there's good incentive to play through the game more than once. While it's possible to rush through some missions in just a matter of minutes if you know what you're doing, most of them should take you closer to an hour the first time through. The Hitman series is no stranger to the PC, Xbox, and PlayStation 2. Blood Money is available for all of these platforms, as well as the Xbox 360. Each version of the game is identical in terms of content and structure, so the differences are technical in nature. As such, the Xbox 360 version is most impressive, since it features the best combination of sharp visuals and smooth frame rates. The PC version may look comparably as good on a fast system, while the Xbox and PS2 versions still appear quite attractive despite running on dated hardware. These console versions both support progressive-scan displays. Controls are similarly as good across the board, and the game handles about as well when played with a gamepad as with the stock mouse-and-keyboard setup for the PC (though inventory management feels a bit clunkier on the PC). The only other platform-specific difference that stands out is that the Xbox 360 version includes some unlockable achievements that reward you for playing through the game at successively higher difficulty levels and for finishing missions with top rankings. But it's also the most expensive. This may be another routine assignment for 47, but for all practical purposes, that's a good thing. Part of what's made the Hitman series so well liked is its distinct sense of style, which is unmistakably present in this latest episode. Another great soundtrack from series composer Jesper Kyd effectively sets the tone with a combination of choral tracks and downtempo electronic music. Realistic sound effects and generally good voice acting round out the audio. Some excellent atmospheric lighting and subtle animations, as when 47 hides a kitchen knife behind his back while approaching an unsuspecting victim, further add to the ambience. Enemies shot dead still die the same rag-doll deaths as they have since the original Hitman game, and you'll spot some repetition in the civilians and guards roaming each area. Yet the different mission areas in Blood Money definitely capture the overall look and feel they're supposed to. So in turn, when you successfully complete an assignment in one of these ominous areas, chances are you'll feel a sense of grim satisfaction, having experienced Hitman's potent formula again--or maybe for the first time."}