{"ref": "https://www.gamespot.com/reviews/namco-museum-50th-anniversary-review/1900-6132919/", "date": "May 17, 2006", "game_name": "Namco Museum 50th Anniversary", "text": "It's official: There are now more Namco Museum compilations in Namco's library than there are actual classics. With constant releases for any platform that will support it, Namco seems desperately dedicated to making sure you can always find a version of Bosconian whenever and wherever you need it. With a standard list of games that's been given this same compilation treatment before, as well as a very low-frills presentation, Namco Museum 50th Anniversary is an ill-fitting tribute to such a long-lasting and classic collection of arcade games. This museum is a tourist trap. Though a couple of the games in this pack haven't been released outside of Japan, each one of the 16 in this collection has been included in one of the many previous Namco Museum compilations. The overall list of initially available games consists of Pac-Man, Ms. Pac-Man, Galaga, Galaxian, Dig Dug, Rally-X, Pole Position, Pole Position II, Xevious, Dragon Spirit, Bosconian, Rolling Thunder, Mappy, and Sky Kid. Earning not-especially-high scores in some of the games will unlock Galaga '88 and Pac-Mania. The games in the collection play as well as they used to, but in some cases the sound effects seem slightly out of pitch when compared to the original. Also, the only control you're given over the display is the ability to control the size of the screen. You won't find the same sort of alternate display modes found in the PSP version here. Standard TV resolutions make most of the games look blurry. Support for high-definition resolutions would have made an impact on that problem, but the game doesn't have any HD support at all. The back of the box advertises the menu system as offering the ability to ~explore a virtual arcade~ using a ~brand new retro-cool interface.~ But it's just an ugly polygonal menu that lets you rotate from game to game, just like any other menu. This is deceptive at best. Previous Namco Museums featured an actual first-person museum mode that you could use to explore an area and find artwork, instruction cards, and other info about the games. Considering this one is meant to commemorate the company's 50th birthday, the lack of extras makes the whole package feel even more like a cheap hack job. While we're on the subject of deceptive back-of-the-box copy, the game also talks up its soundtrack of music from the '80s. Activision released a collection that also did this, letting you listen to some licensed music while playing the company's old games. Here the music plays in the ~awesome~ virtual-arcade menu screen. So you'll hear the soundtrack for all of 15 seconds while you change from one game to the next. It's a total waste. If you're on the hunt for some of the games contained in this collection and don't mind the blurry look that most of them have, this collection plays just fine. But if you took a look at the game's 50th Anniversary moniker and expected some sort of special edition DVD-like package, you'll feel cheated by this compilation, even with its $19.99 price tag. Namco's back catalog deserves better than this slapped-together cash-in."}