{"ref": "https://www.gamespot.com/reviews/battlefield-hardline-review/1900-6416066/", "date": "March 16, 2015", "game_name": "Battlefield Hardline", "text": "The felons and thieves of Battlefield: Hardline are like weak-willed vampires. A quick reveal of a police badge and a yell of ~Freeze!~ is akin to holding up a holy cross in their faces. They surrender despite being armed with semi-automatic rifles, and protected by bulletproof vests. They surrender despite outnumbering you three to one. On the other hand, if you're slow on the draw with your badge, these offenders become as lethal as any Battlefield opponent you've previously faced. There's no middle ground between their willingness to capitulate and their cold-blooded ruthlessness--and it's hilarious. Looking for more consistently challenging opponents? That's what Hardline's multiplayer is for, with maps and modes that capture Battlefield's distinct combined-arms warfare, despite the shift away from traditional combat-ready zones toward civilian locales.The episodic structure of Hardline's campaign is hardly unusual. Chapters are framed with recaps and coming-soon montages, reminiscent of games like Alan Wake and Split/Second, which, incidentally, were released the same day in 2010. To appreciate Hardline's contemporary style, you simply reach the end of any episode, where you're greeted by an image that is apparently inspired by Netflix's streaming service: the next-episode countdown timer. The only feature that's lacking is a 13-episode season; this campaign only has 10, plus a prologue.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Battlefield Hardline Video ReviewHardline's story is intended to be appreciated as a TV action drama, though its safe, middle-of-the-road appeal makes it more suited for the USA Network than for Netflix Original Programming. This risk-averse narrative is underscored by its protagonist, Nick Mendoza, your standard issue, incorruptible, straight-and-narrow cop. Just because this medium runs the risk of anti-hero burnout doesn't excuse Nick from being ~the boring one~ in an ensemble cast with more interesting characters. In defense of Hardline's writers, at least Nick's story isn't the generic drug supply chain investigation that the initial chapters lead you to believe.It would be a mistake to approach Hardline's campaign in the same way as the straightforward single-player modes of Battlefield 3 and Battlefield 4. Hardline's world is a complicated one, where its dangers and hostility encourage tactful stealth while your all-powerful badge presents tempting opportunities to be more out in the open. Staying hidden means you get to work against some of the most oblivious criminals you'll face in a first-person shooter. For every guard who moves back and forth in a patrol path, you have one who stands in one spot forever, making the latter a laughably easy target. All that you need to survive is a basic level of competence in studying their field-of-vision cones on the minimap.Unless you are a Solid Snake savant, you will be spotted from time to time, and the ensuing shootouts are typical of Battlefield campaigns. Enemies move with enough unpredictability to keep you on your toes, but not so erratically as to frustrate you. More importantly, the levels are wide enough that you're subconsciously encouraged to try different routes should you keep dying in any given section. Enemies react to your last known position, so flanking opportunities abound and the results can be thrilling if you manage to outsmart the AI.Half of the outposts you infiltrate are wired with alarm systems, the kind that call forth reinforcements if you manage to get spotted. If you're not into prolonged shootouts, it's in your best interest to disable these alarms, so not only does Hardline present a dumbed-down version of Metal Gear Solid's radar-based stealth, but it can also be appropriately described as Far Cry 4 with training wheels. It teaches the basics of surveying an area, marking alarm components, and spotting patrolling enemies. Despite the ease, there's an inherent pleasure in clearing an area undetected, just as getting spotted may cause you to kick yourself out of self-imposed frustration.Who needs sneaking when you can sprint toward enemies in broad daylight and yell ~Freeze!~ well before they notice you?Along with the vision cone, a Splinter Cell-inspired detection ring thickens when you remain in a felon's field of vision, with the potential of going full alert. This would add palpable tension if not for the fact that these enemies suffer from a combination of poor eyesight and abysmal reactive abilities. Who needs sneaking when you can sprint toward enemies in broad daylight and yell ~Freeze!~ well before they notice you? While it's laughably unrealistic, the negative impact isn't too distracting, at least not during the initial playthrough. That's partly because arrests yield the most points toward the campaign's character progression system. Perhaps this reward is a statement by developer Visceral Games that it's more worthwhile to arrest someone than it is to kill him, but even so, the steps it takes to cuff someone without being detected aren't significantly more challenging than surviving a shootout. The only issue with this points system is that it diminishes the value of replaying the campaign. By arresting roughly two out of every three perps, you can easily reach the level cap of 15 long before the final chapter, thereby removing that particular incentive to play through the story again. Retrieving evidence, on the other hand, has multiplayer repercussions, so you may still wish to make a return trip.For as much as Electronic Arts has flaunted Hardline as ~The Fastest Battlefield Ever,~ the need for speed is not satisfied during the campaign's driving sequences. Whether it's a daring escape or an equally heated pursuit, these chases are largely forgettable despite the spectacle of ramp jumps and dodging rockets fired from vans. The helicopter takedown during the first driving sequence of Battlefield 4 was more stimulating. Ironically, the only pleasing moments behind the wheel are the few periods when you don't have to make a getaway, when the characters in the car are naturally making small talk--trivial but nonetheless engaging chit-chat that you wouldn't hear in the dramatic war scenarios of Battlefield 3 or 4.By arresting roughly two out of every three perps, you can easily reach the level cap of 15 long before the final chapter.Speed is instead found in two of Hardline's multiplayer modes, Hotwire and Blood Money. Battlefield vehicles finally get to be more than just death dealers and efficient transports, though Hardline doesn't fully break free from the chains of tradition, including both Conquest and Team Deathmatch in its rotation of modes.In Hotwire, vehicles function as mobile capture points to the players who manage to get behind the wheel. You can't exploit the system by hiding your stolen car in a garage; points are only awarded when you're traveling at speed. This kind of vehicular keep-away is reminiscent of the standout multiplayer events of Driver: San Francisco and Watch Dogs. When you're flooring it, these maps can feel small. Unless you're adept at keeping one eye on the road and another on the minimap, you will inevitably break past the maps' boundaries in the first few rounds, often dying before you have the chance to correct your mistake. Once you're used to a given map's general layout, the conservative approach is to drive laps around the map's outer lanes. While this might keep your top speed high, it can make you a predictable target, especially against a rocket-propelled grenade.Blood Money effectively captures the time urgency depicted in countless robbery films.Vehicles have been synonymous with Battlefield since its inception, so placing the series in the context of the modern-day heist makes a lot of sense, especially given the ubiquity of getaway vans. An escape vehicle is essential in Blood Money, a mode in which both the cops and robbers are looting an evidence vault of cash at the center of the map. The importance of a getaway vehicle near the vault can't be understated, since a packed van of proper villains with bags of loot can turn the tide in the brief time span of a single cash delivery. It effectively captures the time urgency depicted in countless robbery films. Team members can be meaningful contributors by ignoring the cash and instead focusing on being efficient wheelmen (though anyone with money can also drive the van). If you find yourself yelling, Get in the van! We gotta go!, simply embrace the fact that you've become a crime movie cliche. Stakes are higher particularly in maps with helicopters, where deliveries are even quicker provided the competition doesn't have a rocket with your name on it.This emphasis on teamwork highlights one of the core values of Battlefield, a series that popularized rewarding players for contributions beyond mere kill counts and other individual achievements. Wheelmen who stay close to players making cash deposits are awarded proximity bonuses. It's rare to get this much gratification from being a mere shuttle driver going back and forth between two points. In Hotwire, a packed van can last a long time if you have enough teammates firing back at pursuers and at least one buddy constantly repairing the van while inside of it.What makes Blood Money more than just a race to collect the most money from a neutral vault is the option to raid the opposition's vault as well. This can be a headache for teams that don't know how to multitask and divvy up responsibilities. Imagine hauling a big score to your home base only find yourself at the receiving end of a shotgun blast. As your new sworn enemy collects the cash from your vault (and your corpse) and heads for the getaway van, you're anxiously counting the seconds before respawning. Any reasonable thief wouldn't blame you for taking this personally. A thirst for vengeance plus a set of wheels equals a beeline to the opponent's base for the opportunity of justified retribution.The influence of e-sports is felt in Hardline's two five-versus-five modes, Crosshair and Rescue. Both offer multiple conditions for victory, which leads to multiple team-driven strategies. You cannot respawn in these two modes, so eliminating the entire team in order to win is certainly an option. Rescue is a well-designed retrieval mode in which the law enforcement side has to save one hostage at the other end of the map. Visceral Games wisely provided two hostages to choose from per round, a design choice that helps spread out the hostage takers, thereby balancing sides in an otherwise lopsided mode. Equally unpredictable is Crosshair, in which the police are tasked with escorting an informant to a rendezvous point. Given that the cops do not have to stick together and the VIP is well armed (with a potent golden gun, no less), Crosshair often turns into an engaging guessing game for those hunting the snitch.For every guard who moves back and forth in a patrol path, you have one who stands in one spot forever.These opportunities to outthink enemies strike at the core of these Battlefield modes unique to Hardline and go hand-in-hand with countless opportunities for risk assessment. Camping at the VIP's escape point might be a sneaky tactic in Crosshair, but how does that help when your team in the field is now one man short and respawns aren't allowed? One of the smartest things you can do in Blood Money is driving a mobile spawn point to an inconspicuous spot close to the vault. Novice teams will wonder why your side manages to dominate the match despite the kills piling up equally on both sides. Furthermore, the more teammates you have collecting cash evidence, the faster you're able to amass Benjamins individually. Greed sets in, and you wonder if you can stick around and grab one more handful before stiff opposition arrives to kill you all. Do you have a personal cut-off of five handfuls, or do you max out at ten? Temptation weighs heavily on you in Blood Money.The simplicity of the campaign's stealth gameplay and the enemies' readiness to submit at the sound of ~Freeze!~ is comical, though the silliness was not likely Visceral's intention. Even in Battlefield: Hardline, multiplayer competition remains the series' heart and soul. It wasn't that long ago that the ability to eject from a fighter plane and seamlessly continue the battle on foot was one of the most awe-inspiring things you can do in an online shooter. That's why many gravitated to the Battlefield series in the first place, and Hardline isn't short of similar transitional vehicular moments. You can spawn in a chopper, do your part as a gunner to take out valued targets on that ground, and then jump out with a parachute so you can capture a marked car. This isn't Iwo Jima or an Arabian oil field--but it's still pure Battlefield."}