{"ref": "https://www.gamespot.com/reviews/miitopia-review-eyes-without-a-face/1900-6417683/", "date": "May 28, 2021", "game_name": "Miitopia", "text": "When I reviewed Miitopia on 3DS in 2017, I wasnt terribly impressed. The game was dull, simplistic, and felt so random that I barely felt like I was playing it. But, as weve learned over the years, games can be improved significantly from their initial launches, and I figured that a Switch remake of Miitopia would be the perfect opportunity for Nintendo to fix the flaws of the 3DS release. Unfortunately, while there are notable improvements, the core game is still the same tiresome, repetitive experience from four years ago.Miitopia is a game where you take created Mii characters--based on yourself, friends and family, celebrities, fantasy characters, whoever--and cast them as player and NPC characters in a simple RPG story. The Dark Lord of Miitopia is ruining the peace and stealing the faces of the populace, so its up to you and your merry band of adventurers to gear up and put a stop to his wickedness, with plenty of goofy character interactions and dialogue snippets along the way.Its a cute and fun concept, and to Miitopias credit, the Switch version of the game features a fully revamped character creator that lets you go all-out with creating incredibly detailed Mii characters by layering different hair, eyes, facial features, and additional shapes. It takes time to make a really impressive Mii, but if youre willing to put in the effort, you can make some astounding creations. If you dont have that sort of time, you can use Miis made by other players by entering their Access Code or pick from a selection of currently popular Miis. Its a bit cumbersome not being able to search in-game for specific characters (it took me far too long to find a good Hank Hill) but with some online sleuthing on social media you should be able to find some good created-character libraries.Once youve got a bunch of Miis assigned to various roles, its time to set off on the adventure. You meet the Dark Lord, get told youre the chosen hero, and quickly start to amass a party to vanquish evil from the land. The visuals and overall tone of the dialogue set up Miitopia as a tongue-in-cheek, comedic take on RPG tropes, and it succeeds pretty well on this front: its pleasant to look at, has lots of cute animations and bright colors, and the snappy, quip-laden dialogue is of the high quality weve come to expect from first-party Nintendo titles. The visual overhaul for the Switch version is excellent, adding more detail and flourishes without losing the simplistic charm of the original 3DS graphics.Sadly, all of that charm begins to melt away once you start digging into the actual gameplay. Miitopias combat and exploration are simplistic to a fault. Exploration consists of auto-running through an area and, occasionally, making a choice to follow a path or examine an object like a treasure chest. When you encounter enemies, youll be thrust into a turn-based battle where almost all choice of what to do in combat is stripped from you. Instead, your party members, besides your main character,, are CPU-controlled. You cant even give them general instructions like attack the same enemy or focus on spells, they just do what they want, often wasting resources and letting their wacky personality quirks take center stage instead of dispatching foes efficiently. As a result, you spend more time passively watching fights and exploration happen than actually doing anything, and no amount of cute dialogue can make up for the fact that your high-damage mage just wasted a turn sleeping--again. A new addition to Switch Miitopias combat is a horse who will sometimes let you ride it and do special attacks, but only sometimes. Like much of the game, its frustratingly random.But perhaps youre not here for an in-depth RPG experience. Maybe you just want to watch all of your cute little Mii creations have silly dialogue exchanges while traveling and fighting and getting all friendly when they room with each other. Thats perfectly fine. The problem is the character-interaction element of the game isnt all that great either. You encounter inns frequently when exploring, and by putting characters in the same rooms together, you can build their relationships. Better relationships let them learn new combat skills and help each other out in fights. You can also use tickets earned from treasure chests and enemy drops to go on ~outings~ with chosen characters to places like the beach, the movies, and karaoke, where youll see a short skit and watch their closeness levels rise. However, many of these skits and dialogue bits begin to repeat, quickly lessening their appeal. You can also choose to feed your party members and send them on shopping expeditions, which, again, are subject to frustrating random factors: You dont know if characters will like food until they eat it (dislikes equal lesser stat gains), and sometimes when characters go shopping, they wont buy the thing they intended to.Ultimately, beyond character-making and very base-level decisions, what happens in Miitopia feels completely out of your control, and what you can control ultimately feels simplistic and unfulfilling. So when the dialogue and character interactions start to wear thin, you wind up with an RPG that becomes quite dull after just a few hours. And Miitopia does little to add challenge or variety to this very basic formula as the game progresses, other than simply regressing you back to Level 1 with a new class and making you re-recruit party members at certain story points. Whats particularly frustrating is that these were all issues with the original 3DS game that could have been addressed in the Switch remake.Miitopia winds up being little more than a great character creator attached to an overly simple game that, while charming in its visuals and dialogue, is a mostly passive experience. Watching you recreate your favorite fictional character ships in-game or fighting Evil Guy Fieri has some brief appeal, but once those initial chuckles fade, Miitopia is disappointingly shallow. Im sure theres a great RPG yet to be made where you can team up with Mr. T, Goku, and Troy McClure to battle evil, but Miitopia is not that game."}