{"ref": "https://www.gamespot.com/reviews/mega-man-x6-review/1900-2837695/", "date": "January 9, 2002", "game_name": "Mega Man X6", "text": "The Mega Man series has one of the most loyal followings of fans. Without their devout support, Capcom would have trouble finding ample justification for not only producing sequel after sequel, but also for keeping the majority of Mega Man games in 2D and not messing around with the proven platform-shooter-style formula. The latest game in the Mega Man saga, Mega Man X6, attempts to diversify this formula by integrating various features--such as the nightmare and power-up gameplay systems--and indeed, Mega Man fans will probably enjoy these features, as they successfully extend the longevity of the game. But ultimately, these features are unable to hide the fact that the Mega Man series is really starting to show its age. Mega Man X6 begins shortly after the previous game. The space colony has crashed into the planet, and Zero--the plasma-sword-equipped crimson hero of the Mega Man X series--has just been destroyed. Sifting through the debris is a scientist named Gate, who stumbles upon a special piece of technology at the site and then retreats to his lab. Moments later, the scientist is shown in his laboratory conducting experiments when all of a sudden, he goes mad and begins talking about creating a perfect world for reploids. Mavericks--the animal-like robot enemies found in previous games--start appearing around the world, causing Mega Man to take action and find out what's going on. With the exception of the explanation of various gameplay mechanics, Mega Man's narrative is largely irrelevant and uninteresting. The dialogue that occurs between Mega Man and the mavericks is ridiculous and uninteresting--even the game seems to lose its bearing on the main plot, as you'll hear very little from Gate and his sidekick Isoc as you progress through individual levels. This game is quite different from Mega Man X5, which relied heavily on its storyline to drive the game. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Mega Man X6 Video Review But as far as gameplay goes, you won't find too many differences between X5 and X6. When it comes time to enter one of the maverick stages, you'll have the option of choosing between just the regular version of Mega Man X--Mega Man X equipped with falcon armor or, depending on where you are in the game, another character. The difference between the original and armored version of Mega Man is that the armored version has the ability to perform both ground and air dashes from the get-go, whereas the regular Mega Man has to find various power-ups located in different levels to gain these abilities. Of course, this leads to the question of why you would want to play as him if he lacks these skills at the beginning of the game. The answer is that the regular version of Mega Man can equip new suits of armor that give him added abilities, but the extra effort it takes to seek out the parts for those suits of armor and the fact that the falcon version of Mega Man is already well-equipped to handle most maverick battles will make it difficult for some to go that route. Mega Man and his cohorts can perform a variety of moves, ranging from the classic buster-blast attack to a number of different plasma-sword slashes, and like in previous Mega Man games, you gain special weapons whenever you successfully defeat one of the mavericks. Basically, if you've played even just one of the older Mega Man games, then you should be able to jump right in. However, it's worth noting that control can be an issue at times, as Mega Man X's dash feature can be sensitive, making it incredibly difficult to maneuver through areas that require precise movements. With the exception of perhaps one or two areas, the default level designs are fairly straightforward and don't require you to perform ridiculous acrobatic acts, but the nightmare versions of these levels are a different story.One of Mega Man X6's more-touted features is its nightmare system. Whenever you complete a level, you'll immediately notice that one of the mavericks on the maverick selection screen is highlighted in red, which indicates that particular level is currently being affected by the nightmare. Essentially, it means the level has been changed in some way, and these changes can range from the strategic placement of boxes for making specific areas more difficult to the appearance of spectral versions of Mega Man and Zero, which fly around on the level and deliver some serious damage. Some levels will even turn pitch-black with only a few shreds of light to help guide your way. And some levels--those that are affected by nightmare--change, depending on the level you've just exited. It's an interesting system, and while it does add some diversity to the game, it doesn't factor in as much as you might think it does. In fact, if you're not really concerned with collecting the extra items and power-ups, then you probably wouldn't really know the nightmare system existed unless someone told you. The same circumstances apply to the nightmare-soul-collecting system. In each level, you'll see flying enemies that are capable of converting friendly reploids into enemies. If you kill one of the nightmares, you'll see that it leaves a blue orb behind--this orb goes toward your nightmare soul total. Depending on the number of nightmare souls you have, the game will give you a ranking, which determines how many and what types of special items Mega Man and his ally can equip. Again, it's one of those features that can make the game easier and extend its longevity, but it's just as easily ignored. While Capcom has attempted to make subtle changes to the structure of the game, the graphics look on par with previous Mega Man efforts, which is to say that it's time for the Mega Man series to start receiving some upgrades in the graphics department. Some of the enemies and bosses, specifically Blaze Heatnix, look absolutely horrible. Except for perhaps Infinity Mijinion's stage--with an enormous robot firing constantly at you from the background--most of the background art is bland and fairly devoid of any activity. In general, the graphics in Mega Man X6 seem to lack the clean and colorful visuals of its predecessors. It's not difficult to see that Mega Man X6 is a disappointing effort. The nightmare system and the item collecting add variety and longevity to the game, but these two features can easily be set to the side to accomplish the larger goal of just completing the game--which isn't an incredibly easy task--but most shouldn't have trouble getting through each maverick level and the subsequent boss fights with Gate and others after three or four tries. The graphics aren't really even up to the standards set by older games in the series, and while the music is good, there aren't any tracks that particularly stand out. Despite these shortcomings, it's still Mega Man, and the gameplay is still entertaining, making X6 an attractive package for hard-core Mega Man fans. However, everyone else should probably give it a rent first.One of Mega Man X6's more-touted features is its nightmare system. Whenever you complete a level, you'll immediately notice that one of the mavericks on the maverick selection screen is highlighted in red, which indicates that particular level is currently being affected by the nightmare. Essentially, it means the level has been changed in some way, and these changes can range from the strategic placement of boxes for making specific areas more difficult to the appearance of spectral versions of Mega Man and Zero, which fly around on the level and deliver some serious damage. Some levels will even turn pitch-black with only a few shreds of light to help guide your way. And some levels--those that are affected by nightmare--change, depending on the level you've just exited. It's an interesting system, and while it does add some diversity to the game, it doesn't factor in as much as you might think it does. In fact, if you're not really concerned with collecting the extra items and power-ups, then you probably wouldn't really know the nightmare system existed unless someone told you. The same circumstances apply to the nightmare-soul-collecting system. In each level, you'll see flying enemies that are capable of converting friendly reploids into enemies. If you kill one of the nightmares, you'll see that it leaves a blue orb behind--this orb goes toward your nightmare soul total. Depending on the number of nightmare souls you have, the game will give you a ranking, which determines how many and what types of special items Mega Man and his ally can equip. Again, it's one of those features that can make the game easier and extend its longevity, but it's just as easily ignored. While Capcom has attempted to make subtle changes to the structure of the game, the graphics look on par with previous Mega Man efforts, which is to say that it's time for the Mega Man series to start receiving some upgrades in the graphics department. Some of the enemies and bosses, specifically Blaze Heatnix, look absolutely horrible. Except for perhaps Infinity Mijinion's stage--with an enormous robot firing constantly at you from the background--most of the background art is bland and fairly devoid of any activity. In general, the graphics in Mega Man X6 seem to lack the clean and colorful visuals of its predecessors. It's not difficult to see that Mega Man X6 is a disappointing effort. The nightmare system and the item collecting add variety and longevity to the game, but these two features can easily be set to the side to accomplish the larger goal of just completing the game--which isn't an incredibly easy task--but most shouldn't have trouble getting through each maverick level and the subsequent boss fights with Gate and others after three or four tries. The graphics aren't really even up to the standards set by older games in the series, and while the music is good, there aren't any tracks that particularly stand out. Despite these shortcomings, it's still Mega Man, and the gameplay is still entertaining, making X6 an attractive package for hard-core Mega Man fans. However, everyone else should probably give it a rent first."}