{"ref": "https://www.gamespot.com/reviews/darkstone-review/1900-2684332/", "date": "February 9, 2001", "game_name": "Darkstone", "text": "Blizzard's 1997 smash PC hit Diablo took the gaming community by storm, creating one of the most popular game franchises of all time. In an effort to cash in on the success of the Diablo formula, Delphine Software Interactive has released Darkstone for the PlayStation. While it may not have originally been planned for the bargain bin, Darkstone has a retail price of just under $10, making what would otherwise be an unremarkable title reasonably attractive to prospective game shoppers. Most good RPGs have a strong foundation in character generation and advancement. Darkstone lets you take on the role of a warrior, thief, wizard, or priest, with alternate male or female versions of each class also available. Each character class has its strengths and weaknesses in the traits of strength, vitality, dexterity, and magic, and after creation, these traits are fully customizable to suit your individual style of play. Darkstone uses the familiar conventions of life, mana, and hunger, but management becomes something of a chore at times--the character inventory screen seems badly designed, the hunger indicator is hard to find, and manipulating your inventory isn't very intuitive. Developing your character is enjoyable, with a multitude of spells, skills, and weapons available for customization. Monsters and items are randomized and continually spawn, leaving no shortage of things to kill and stuff to pillage. After reaching a certain level, you can proceed from novice mode to play in higher difficulties, where stronger creatures and better items await. Leveling up isn't as much of a chore as it is in other RPGs, given the game's action-based interface, which forces you to undertake timely maneuvering, spell casting, potion quaffing, and weapon use during any given melee. The point and click interface of Diablo has been replaced with an auto-aim attack that performs admirably well. If you're so inclined, you can hurl projectiles before the enemy has been targeted and land a few preemptive strikes--hitting characters offscreen is dirty, but it's effective. Darkstone employs fully polygonal models and 3D environments, though when compared with other recent PlayStation releases, the game appears dated and crude. The particle effects and lighting are impressive considering the aging hardware, and they don't seem to cause any slowdown in the fast-paced action. The analog sticks and the triangle button control your camera angles and zoom, letting you alter the perspective to fit your mood. The more distant overhead views are the most suitable for the gameplay, as the closer views restrict movement and exploration. Shifting your camera angles on the fly as you navigate becomes a necessary skill, although the lack of a behind-the-back camera or other automatic perspective-shifting tool makes controlling your point of view yet another thing to struggle with during adventuring. The total lack of a compass or mapping feature is a grave oversight that mandates the use of the ~teleport to previous location~ function far too often. The load times are quite hefty, and they detract from the enjoyable exploration and leveling aspects of the game. Darkstone is not exactly stunning in the audio department, but there are a couple of enjoyable tunes strewn throughout the game, including the jovial minstrel and singer's anthem in the town square. The enemies are rather silent, though, and your character keeps quiet fairly often, save for an annoying exclamation of joy while leveling up. Sadly, the ability to play as two characters at once, the distinction that set the PC game apart from Diablo, is not available in the PlayStation version, as was originally planned. The dated graphics and the lack of any kind of two-player mode also detract from the otherwise attractive package. However, with all the character options and its nearly infinite replayability, Darkstone makes an excellent case for making a modest $10 investment."}