{"ref": "https://www.gamespot.com/reviews/super-mario-strikers-review/1900-6140729/", "date": "December 2, 2005", "game_name": "Super Mario Strikers", "text": "Most everything you can do in Super Mario Strikers would earn you a red card or worse in a real soccer match--and that's just the point. Nintendo's arcade football game is big on manic pace and cutesy graphics, and it finds just the right amount of pick-up-and-play addictiveness. Unfortunately, its sometimes troubling frame rate and a lack of variety hold the game back from greatness. Mario and the gang hit the pitch with their Nintendo-themed take on the beautiful game. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Super Mario Strikers Video Review So far in 2005, we've seen Mario and his friends on the baseball field in Mario Baseball, the snowy slopes of the GameCube's SSX On Tour, and hitting the hard court in NBA Street Vol. 3. Here in Super Mario Strikers, the gang takes on the beautiful sport in four-on-four competition that focuses squarely on the main cast of Nintendo greats. Each team you control includes three sidekicks and one team captain. The selectable captains are Nintendo mainstays: Mario, Luigi, Peach, Daisy, Peach, Yoshi, Waluigi, and Wario (and one unlockable team). The sidekicks that fill out your team are either Koopas, Birdos, Toads, or Hammer Bros. While the sidekicks have their place on the field--and can be effective in the right situations on both offense and defense--you'll likely want the ball at the feet of your captain when the game is on the line. Captains, after all, are the ones with the superstrike abilities--essentially massive aerial stunt kicks that, if they find the back of the net, are worth two goals as opposed to a measly one. Each captain has his or her own superstrike animation and, while they're all unique and dramatic in appearance, they're all relatively easy to pull off. By holding down the B button, you can charge your shot. Hold it down long enough and you'll enter a small rhythmic minigame that will require you to press the B button twice more while a cursor swings back and forth on a small meter. If you land in the second green area, you nail a superstrike, which goes right past the opposing goalie. If you manage to nail both green zones, you'll kick a shot that blasts the keeper into the back of the goal. Timing is of the essence here, of course, and it's important to note that these superstrike power-ups can be interrupted, provided you can tackle the opposing captain in time. Checking your opponents into the electrified fence is nothing short of shocking. Tackling is an essential skill in Strikers. In fact, it's probably the most essential skill you'll need to master in the game. There are two varieties of the tackle: the slide tackle, which is pulled off with the B button, and the big hit, which you execute with the Y button. As its name implies, the big hit is the more powerful of the two and, as a result, will be your likely go-to tactic when playing defense. Smashing characters with the big hit will knock them down, temporarily taking them out of the action and allowing you to grab possession of the ball. Position your big hit near the sidelines and you'll check your opponent into an electrified net that surrounds every playing field in the game. Yes, that's right, you can electrocute Princess Peach if you so desire (and if you want to win, you better desire just that very thing). The transgressive nature of shocking Nintendo luminaries aside, the big-hit tackle seems a bit overpowered in Strikers. You can certainly play (and win) matches without throwing a single big hit (at least on the lower difficulty levels), but once you discover the powerful effect it can have on your defensive game, you likely won't want to give it up. The turbo button can be similarly overused. Because Strikers has no stamina meter for individual players, you can basically play an entire game with your finger gripping the right trigger button, a fact that is mitigated only by the seemingly minimal boost your character will enjoy while turbo-running. Still, despite these flaws, it's undeniable that Strikers' pick-up-and-play design will have you playing like a cartoon Pele in no time. Lob passes are a breeze, as are one-time kicks, which usually result in some fantastically animated trick shots such as headers and bicycle kicks. The default five-minute setting feels a bit long on the lower difficulty settings (scores will inflate accordingly), but at the upper range of challenge, you'll often find yourself in gripping, one-goal matches in those five minutes, where the momentum shifts with every bomb or mushroom thrown. What, you didn't think you'd get a Mario sports game without tons of power-ups did you? Bowser will drop in periodically to make life rough for your forwards and everyone else on the field. When your sidekicks charge their kicks, you earn these power-ups, which you can unleash at any time on the pitch. These power-ups include different types of shells (blue will freeze your foes, while red shells knock them down); bob-ombs that can blast huge craters in the field; as well as stars that will give you a brief boost of invincibility. Of course, then there are the periodical Bowser attacks--at seemingly random intervals a gigantic version of Mario's archenemy pounces onto the pitch and begins disrupting play. As time winds down in a match (or, when you enter extra time after a tie in regulation), the pace and intensity pick up considerably, as both you and your AI-controlled opponent blast one another with big-hit tackles, fire every power-up in your arsenal, and take shots from everywhere on the pitch in a desperate attempt to nail that game-winning goal. Oftentimes during these fever-pitch moments, it's difficult to tell exactly what's going on, which adds to the manic flavor. So despite this manic pace, why doesn't this game feel as ~Mario~ as other Mario-themed sports games? For one thing, the presentation is lacking in comparison. From the menu system (which is awfully plain), to the superstrike animations (once you've seen these Matrix-time aerial attacks two or three times, you've seen them enough), to a lack of any real narrative beyond winning a succession of tournament cups, Strikers feels a bit underdeveloped. And while the character models themselves have a good dose of that trademark Nintendo charm, sometimes serious frame rate issues when playing in certain stadiums really drag things down. The stadiums feature some nice variety, from futuristic indoor soccer arenas, to more-traditional grass fields, and even wood-planked pitches. Again, though, the playing surfaces don't feel very Mario-like. Beyond their appearance, there is no tangible gameplay difference between playing on wooden planks and playing on a traditional pitch. Where are the slick, ice-covered playing surfaces? Where are the moving platforms that would hamper your movement on the field? An unlockable cheat that allows you to tilt the field when playing is about the closest thing we came to anything really interesting. Super strike kicks are impressively animated and can pack a real punch on the opposing goalkeeper. The game's sound has its charms--from the goofy noises characters make when they hit the electric fence, to Luigi's goal-celebration chant (which has him simply yelling his name over and over again). There is also the ever-present roar of the chanting crowd and, of course, the enthusiastic announcer yelling ~GOOOOOAAAAL!~ after the ball finds the back of the net (and since this is an arcade soccer game, you can expect to hear that sound a lot). Unfortunately, there's not a lot of variety here. Like the goal-celebration animations themselves, once you've heard Luigi yell his name a few times, you'll have heard it enough. Strikers' menu music has some nice flair to it, and the musical cue for Bowser's entrance on the field has an appropriately sinister edge. Super Mario Strikers is an enjoyable but unremarkable game, especially in multiplayer, where up to four players can battle it out in any combination of matchups (two-on-two, three-on-one, or four player co-op). With a number of tournament cups to win, variable difficulty levels, and a decent number of unlockable prizes, the game has some nominal replay value. While there are moments of pure Nintendo-branded fun in Super Mario Strikers, these moments are really just punctuation marks on the longer stretches, which, despite dashes of Nintendo charm, feel far more traditional than you might expect. Still, despite these flaws, it's undeniable that Strikers' pick-up-and-play design will have you playing like a cartoon Pele in no time. Lob passes are a breeze, as are one-time kicks, which usually result in some fantastically animated trick shots such as headers and bicycle kicks. The default five-minute setting feels a bit long on the lower difficulty settings (scores will inflate accordingly), but at the upper range of challenge, you'll often find yourself in gripping, one-goal matches in those five minutes, where the momentum shifts with every bomb or mushroom thrown. What, you didn't think you'd get a Mario sports game without tons of power-ups did you? Bowser will drop in periodically to make life rough for your forwards and everyone else on the field. When your sidekicks charge their kicks, you earn these power-ups, which you can unleash at any time on the pitch. These power-ups include different types of shells (blue will freeze your foes, while red shells knock them down); bob-ombs that can blast huge craters in the field; as well as stars that will give you a brief boost of invincibility. Of course, then there are the periodical Bowser attacks--at seemingly random intervals a gigantic version of Mario's archenemy pounces onto the pitch and begins disrupting play. As time winds down in a match (or, when you enter extra time after a tie in regulation), the pace and intensity pick up considerably, as both you and your AI-controlled opponent blast one another with big-hit tackles, fire every power-up in your arsenal, and take shots from everywhere on the pitch in a desperate attempt to nail that game-winning goal. Oftentimes during these fever-pitch moments, it's difficult to tell exactly what's going on, which adds to the manic flavor. So despite this manic pace, why doesn't this game feel as ~Mario~ as other Mario-themed sports games? For one thing, the presentation is lacking in comparison. From the menu system (which is awfully plain), to the superstrike animations (once you've seen these Matrix-time aerial attacks two or three times, you've seen them enough), to a lack of any real narrative beyond winning a succession of tournament cups, Strikers feels a bit underdeveloped. And while the character models themselves have a good dose of that trademark Nintendo charm, sometimes serious frame rate issues when playing in certain stadiums really drag things down. The stadiums feature some nice variety, from futuristic indoor soccer arenas, to more-traditional grass fields, and even wood-planked pitches. Again, though, the playing surfaces don't feel very Mario-like. Beyond their appearance, there is no tangible gameplay difference between playing on wooden planks and playing on a traditional pitch. Where are the slick, ice-covered playing surfaces? Where are the moving platforms that would hamper your movement on the field? An unlockable cheat that allows you to tilt the field when playing is about the closest thing we came to anything really interesting. Super strike kicks are impressively animated and can pack a real punch on the opposing goalkeeper. The game's sound has its charms--from the goofy noises characters make when they hit the electric fence, to Luigi's goal-celebration chant (which has him simply yelling his name over and over again). There is also the ever-present roar of the chanting crowd and, of course, the enthusiastic announcer yelling ~GOOOOOAAAAL!~ after the ball finds the back of the net (and since this is an arcade soccer game, you can expect to hear that sound a lot). Unfortunately, there's not a lot of variety here. Like the goal-celebration animations themselves, once you've heard Luigi yell his name a few times, you'll have heard it enough. Strikers' menu music has some nice flair to it, and the musical cue for Bowser's entrance on the field has an appropriately sinister edge. Super Mario Strikers is an enjoyable but unremarkable game, especially in multiplayer, where up to four players can battle it out in any combination of matchups (two-on-two, three-on-one, or four player co-op). With a number of tournament cups to win, variable difficulty levels, and a decent number of unlockable prizes, the game has some nominal replay value. While there are moments of pure Nintendo-branded fun in Super Mario Strikers, these moments are really just punctuation marks on the longer stretches, which, despite dashes of Nintendo charm, feel far more traditional than you might expect."}