{"ref": "https://www.gamespot.com/reviews/soul-calibur-iii-review/1900-6136504/", "date": "October 25, 2005", "game_name": "SoulCalibur III", "text": "Ten years ago, Namco released an arcade fighting game called Soul Edge, which was kind of like its extremely popular Tekken series, except all the characters fought with various weapons. But only when a visually stunning version of the sequel came home to the Sega Dreamcast in 1999 did Soul Calibur became possibly the best-known name in competitive fighting games. It's been more than a couple of years since the last Soul Calibur sequel, but all this history still hasn't caused the series to take any particularly dramatic turns since its Dreamcast heyday. Expert players will quickly notice all the characters' new moves and other gameplay tweaks in the latest installment, but for the most part, Soul Calibur III still plays very much like Soul Calibur, while a lot of the new modes and stuff outside the core one-on-one fighting isn't all that noteworthy this time around. To be clear, Soul Calibur III is one of the best fighting games around. But it earns this distinction largely by playing it safe while most of the competition simply dropped off. Soul Calibur III makes some subtle changes to the series' gameplay and adds a weird real-time strategy mode, among other alterations. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Soul Calibur III Video Review Soul Calibur III introduces three completely new characters to a returning cast featuring all the familiar faces from past installments, providing a total of nearly 30 different characters. It's a large roster even from the outset, when about half the characters are locked away. Every type of weapon fighting style you can think of is represented, including various traditional Eastern and Western forms, along with some decidedly unconventional techniques. If you've played a Soul Calibur game before, you'll find that the basics of gameplay are the same as ever. There are four different action buttons: horizontal and vertical slashes, kick, and guard. By combining these with fairly simple directional movements, it's possible to perform literally dozens of different moves as each character. Certain types of moves are performed similarly from one character to the next, so it's easy to switch from playing as one fighter to another, even though the high-level strategies for each character are unique. Mixing up high-hitting and low-hitting attacks while maneuvering around each area and strategically defending against or deflecting the opponent's attacks is what the action is all about. Of course, if you've ever played a Soul Calibur game, none of this exactly comes as a shock. But then again, the gameplay in Soul Calibur represents some of the most well-designed, finely tuned action that fighting games have to offer, so there hasn't been clear-cut room for improvement. As such, the subtle differences this time around seem mostly aimed at hardcore players who got a little too comfortable with certain aspects of Soul Calibur or its sequel. This has rightfully always been an offense-oriented series, where aggressive players who deftly switch up their attacks and constantly remain on high alert tend to dominate passive players who sit back and poke at their opponents. Now this is even more the case, as it's possible to perform extremely damaging combos when opponents are pinned against walls or when opponents fail to actively pick themselves up off the ground after getting knocked down. That's not to say it's pointless to even try to block anymore--far from it, as Soul Calibur's ~guard impact~ system is there to let dexterous players anticipate and deflect their opponent's attacks, creating an opening for retaliation. Many of the arenas in the game are also lined with low walls that can either be smashed or simply cleared if an unfortunate combatant is smacked high enough. Rounds will still often end with one fighter or the other getting knocked out of the ring, but these outcomes are avoidable enough to where they enrich the gameplay rather than cause undue frustration. Characters in Soul Calibur III can also vary up the timing of many of their attacks or even cause their attacks to stop short for some fake-out tactics. Powerful unblockable moves and guard-crushing attacks top off everyone's arsenal, letting you quickly punish opponents who hesitate even slightly. Despite all the different-looking characters in the roster, access to this standard suite of fighting techniques mitigates the differences between fighters, including the potential for imbalances. Fortunately, there's a noticeable amount of new or different moves per character in Soul Calibur III, so if you've played a lot of the previous games, it'll be fun to explore how the fighters have changed in this sequel. Moves and tactics that worked well before still tend to be intact and are effective in Soul Calibur III. However, having access to new options certainly helps freshen up the experience a little. Soul Calibur III seems to emphasize multiple fighting stances per character, which not only tend to look cool, but also give the fighters a lot more room for different moves without unnecessarily complicating the controls. Furthermore, pairs of characters who used to be near-cookie-cutter copies of each other in the past, like Siegfried and Nightmare or Astaroth and Rock, feel more like unique fighters this time around. Several new characters have been added to the roster, and chances are you'll want to use at least one of them as an alternate from time to time. If Soul Calibur III suffers from a sense of dj vu all over again, it's because the game recycles so many of the same animations as its predecessors. The fighters are all gorgeously redrawn, boasting a couple of distinctly different outfits and lifelike features, right on down to their facial expressions. However, you'll see them perform the same moves, take the same dives, and show off with the same win poses they've been sporting for years. Some of the unchanged animations remain shared across all fighters in the game, diminishing the sense that this is a truly new entry and that its roster consists of completely distinct characters. What's more, the various attacks in the game just don't seem to pack the same punch they used to. Despite all the menacing-looking weapons on display--many of which look truly deadly--no attacks ever so much as draw blood. This brand of bloodless, mild violence has always been apparent in Soul Calibur, but it's become increasingly odd as the series' graphics have superficially grown more and more believable. While new animations and harder-looking hits wouldn't have automatically made for a better game, it seems reasonable to expect the look, if not the feel, of Soul Calibur to evolve at a faster rate than this. The new fighters who've joined the cast fit in well with the diversity already on display. Zasalamel is a muscular Egyptian-looking warrior who carries a scythe, and whose slower moves and rather long reach make him a good alternative for fans of Soul Calibur's bigger fighters. Tira is a lithe new female fighter with a wicked look in her eye and a weird leafy outfit that recalls the Batman villainess Poison Ivy. Weirder still is her weapon, essentially a razor-sharp hula hoop that she twirls around like a buzz saw, combining respectable reach with an unpredictably chaotic style. Finally, there's Setsuka, who looks like a Japanese geisha, complete with a lovely parasol...only the parasol does more than block out rain and sun, since it conceals a vicious blade. Setsuka's quick-draw cuts and slashes make her thematically similar to Japanese fighters like Mitsurugi and Taki, and she falls somewhere in between them in terms of her speed and power. Each of these characters has a full complement of moves, but each also doesn't necessarily seem as well developed as the returning cast, which isn't surprising considering the other fighters have effectively been in the works for years. Still, the new members of the cast are more than welcome in Soul Calibur III. As you may have heard, Soul Calibur III is the first game in the series to be released exclusively for a PlayStation platform. There isn't an arcade version this time around, so in somewhat of a telling move, there's no arcade mode in the game...unless you count the ~quick play~ mode that's ironically buried several layers deep in the menu system. Quick play lets you take on a series of opponents in multiround matches, no strings attached, as you would in a typical single-player fighting game. The main single-player mode, though, is called Tales of Souls, and it's your obligatory story mode. You pick a character and end up taking on multiple opponents in single-round matches until you beat the final boss. Some text-based story stuff is there between matches, and some halfhearted attempts are thrown in to let you influence the story by choosing your next destination or by interacting with a few of the cutscenes. But the stories for many of the characters are virtually identical, the cutscenes can't be skipped, and the loading times between brief one-round bouts are more than a few seconds long, which all combine to prevent Tales of Souls from being particularly engrossing. Still, you'll need to spend time in this mode to unlock the game's hidden characters. The story mode doesn't do much to draw you in to the different personalities in the game, but you might as well play it to unlock some hidden fighters. The other big new single-player mode doesn't fare much better. Chronicles of the Sword combines Soul Calibur III's fighting action with the trappings of a basic real-time strategy game. Since there's certainly a lot of strategy involved in playing a typical game of Soul Calibur III, Chronicles of the Sword may seem quite promising at first glance. But it's simply not well executed, partly because the text-based storyline isn't compelling and the generic characters found throughout this mode aren't interesting, but mostly because there's about as much waiting around as there is action in this mode. Lengthy loading times between matches and other dull moments prevent Chronicles of the Sword from being anywhere near as much fun as simply playing standard Soul Calibur III matches against a friend. Chronicles of the Sword also ties in with another touted feature in Soul Calibur III, which is that you can create your own unique character. However, you're limited to choosing from a specific set of templates that strictly determines the moves and weapons you'll have access to, so you're mostly just limited to changing your character's name and appearance. And despite the volume of unlockable clothing pieces and accessories that can be used to customize your character, the created fighters in Soul Calibur III all have a generic look about them that's nowhere near as impressive as the main cast. And since there's unfortunately no online play in this game, all you can really do with your customized fighter is show him or her off to a nearby friend. Soul Calibur III throws still more modes at you with the soul arena, which lets you take on some gimmicky but often fairly fun matches, and the practice mode, which lets you test out all the characters' moves but also lets you get some advice on high-level aspects of play. There's even a full glossary of terms in case you want to learn how to talk like a fighting game snob. Then, if you really want to pretend like you're a pro, you can try the world competition mode, which lets you enter fake tournaments or leagues against computer players (as well as other human players). These put you through standard tournament brackets, and as you win successive matches, the stakes naturally get higher. Unfortunately, you can't save your progress in a league or tournament, so you need to be prepared to play through dozens of matches in a row (or you can just pause the game and come back later). You also can't change your character once you've entered into a league or tournament. So this mode isn't great when playing against the artificial intelligence, but it's nice to have a built-in tournament option for up to eight players. This is where we could harp on the lack of online play again. It bears repeating that the underlying gameplay of Soul Calibur III still shines through, especially when you're playing a similarly skilled friend--but even when you're playing solo. You've got a wide range of difficulty settings to choose from when competing against the AI, and at the default setting it presents a competent challenge for the average player, diligently trying to avoid letting you knock it out of the arena while mixing up its moves against you (at higher difficulty settings, the AI doesn't get smarter so much as its reflexes become more inhuman). It's just too bad that more of the game's different variations on the basic fighting theme aren't successful. At least there's a whole bunch of stuff to unlock along the way. All the time you spend playing Soul Calibur III, especially spent winning, earns you gold, which you can use to unlock a bunch of alternate weapons, illustrations, and more. When you cut past all the fluff, it can still be a ton of fun to play Soul Calibur against some friends. As mentioned, Soul Calibur III sure looks pretty, and for the most part it runs at a silky-smooth 60 frames per second, like every 3D fighting game ought to. Weapons gleam and shine realistically, and the fighting arenas look great, too. Bits and pieces of them fly about as the action of a typical match unfolds, helping make the fights look a little more dynamic. If you've got a widescreen progressive-scan display, so much the better, as the game takes full advantage of it. The audio in Soul Calibur III is great, too, and thankfully you can opt to choose between English and Japanese voice-over this time around. Most of the English voice-over is solid, though, and the sounds of weapons cutting and clashing are as well suited and familiar as ever. Most of the music has the same synth-orchestral sound to it as that of past Soul Calibur games, and while the compositions aren't particularly memorable, they fit the theme well. A few new Middle Eastern-influenced tunes stand out as being distinctively different from all the rest. All the while, Soul Calibur's melodramatic narrator chimes in to introduce and close out each battle. Probably our favorite aspect of the audio is simply how, when the title screen comes up, you get to hear pretty much every character say ~Soul Calibur III~ at one time or another. Fans looking for more Soul Calibur will find just that in Soul Calibur III, a game that mostly just updates the look and some of the subtler aspects of play for this great series. Once you fool around with all the new modes of play, chances are you'll find yourself going back to the same old versus matches you've playing for years. And if you haven't been playing them for years, it's hard to imagine what about Soul Calibur III might convince you to take the plunge. Nevertheless, this is still one of the fastest-paced, most technical fighting games around, even if it doesn't necessarily rock the boat. As you may have heard, Soul Calibur III is the first game in the series to be released exclusively for a PlayStation platform. There isn't an arcade version this time around, so in somewhat of a telling move, there's no arcade mode in the game...unless you count the ~quick play~ mode that's ironically buried several layers deep in the menu system. Quick play lets you take on a series of opponents in multiround matches, no strings attached, as you would in a typical single-player fighting game. The main single-player mode, though, is called Tales of Souls, and it's your obligatory story mode. You pick a character and end up taking on multiple opponents in single-round matches until you beat the final boss. Some text-based story stuff is there between matches, and some halfhearted attempts are thrown in to let you influence the story by choosing your next destination or by interacting with a few of the cutscenes. But the stories for many of the characters are virtually identical, the cutscenes can't be skipped, and the loading times between brief one-round bouts are more than a few seconds long, which all combine to prevent Tales of Souls from being particularly engrossing. Still, you'll need to spend time in this mode to unlock the game's hidden characters. The story mode doesn't do much to draw you in to the different personalities in the game, but you might as well play it to unlock some hidden fighters. The other big new single-player mode doesn't fare much better. Chronicles of the Sword combines Soul Calibur III's fighting action with the trappings of a basic real-time strategy game. Since there's certainly a lot of strategy involved in playing a typical game of Soul Calibur III, Chronicles of the Sword may seem quite promising at first glance. But it's simply not well executed, partly because the text-based storyline isn't compelling and the generic characters found throughout this mode aren't interesting, but mostly because there's about as much waiting around as there is action in this mode. Lengthy loading times between matches and other dull moments prevent Chronicles of the Sword from being anywhere near as much fun as simply playing standard Soul Calibur III matches against a friend. Chronicles of the Sword also ties in with another touted feature in Soul Calibur III, which is that you can create your own unique character. However, you're limited to choosing from a specific set of templates that strictly determines the moves and weapons you'll have access to, so you're mostly just limited to changing your character's name and appearance. And despite the volume of unlockable clothing pieces and accessories that can be used to customize your character, the created fighters in Soul Calibur III all have a generic look about them that's nowhere near as impressive as the main cast. And since there's unfortunately no online play in this game, all you can really do with your customized fighter is show him or her off to a nearby friend. Soul Calibur III throws still more modes at you with the soul arena, which lets you take on some gimmicky but often fairly fun matches, and the practice mode, which lets you test out all the characters' moves but also lets you get some advice on high-level aspects of play. There's even a full glossary of terms in case you want to learn how to talk like a fighting game snob. Then, if you really want to pretend like you're a pro, you can try the world competition mode, which lets you enter fake tournaments or leagues against computer players (as well as other human players). These put you through standard tournament brackets, and as you win successive matches, the stakes naturally get higher. Unfortunately, you can't save your progress in a league or tournament, so you need to be prepared to play through dozens of matches in a row (or you can just pause the game and come back later). You also can't change your character once you've entered into a league or tournament. So this mode isn't great when playing against the artificial intelligence, but it's nice to have a built-in tournament option for up to eight players. This is where we could harp on the lack of online play again. It bears repeating that the underlying gameplay of Soul Calibur III still shines through, especially when you're playing a similarly skilled friend--but even when you're playing solo. You've got a wide range of difficulty settings to choose from when competing against the AI, and at the default setting it presents a competent challenge for the average player, diligently trying to avoid letting you knock it out of the arena while mixing up its moves against you (at higher difficulty settings, the AI doesn't get smarter so much as its reflexes become more inhuman). It's just too bad that more of the game's different variations on the basic fighting theme aren't successful. At least there's a whole bunch of stuff to unlock along the way. All the time you spend playing Soul Calibur III, especially spent winning, earns you gold, which you can use to unlock a bunch of alternate weapons, illustrations, and more. When you cut past all the fluff, it can still be a ton of fun to play Soul Calibur against some friends. As mentioned, Soul Calibur III sure looks pretty, and for the most part it runs at a silky-smooth 60 frames per second, like every 3D fighting game ought to. Weapons gleam and shine realistically, and the fighting arenas look great, too. Bits and pieces of them fly about as the action of a typical match unfolds, helping make the fights look a little more dynamic. If you've got a widescreen progressive-scan display, so much the better, as the game takes full advantage of it. The audio in Soul Calibur III is great, too, and thankfully you can opt to choose between English and Japanese voice-over this time around. Most of the English voice-over is solid, though, and the sounds of weapons cutting and clashing are as well suited and familiar as ever. Most of the music has the same synth-orchestral sound to it as that of past Soul Calibur games, and while the compositions aren't particularly memorable, they fit the theme well. A few new Middle Eastern-influenced tunes stand out as being distinctively different from all the rest. All the while, Soul Calibur's melodramatic narrator chimes in to introduce and close out each battle. Probably our favorite aspect of the audio is simply how, when the title screen comes up, you get to hear pretty much every character say ~Soul Calibur III~ at one time or another. Fans looking for more Soul Calibur will find just that in Soul Calibur III, a game that mostly just updates the look and some of the subtler aspects of play for this great series. Once you fool around with all the new modes of play, chances are you'll find yourself going back to the same old versus matches you've playing for years. And if you haven't been playing them for years, it's hard to imagine what about Soul Calibur III might convince you to take the plunge. Nevertheless, this is still one of the fastest-paced, most technical fighting games around, even if it doesn't necessarily rock the boat."}