{"ref": "https://www.gamespot.com/reviews/transformers-animated-the-game-review/1900-6201403/", "date": "November 19, 2008", "game_name": "Transformers Animated: The Game", "text": "Transformers Animated: The Game for the Nintendo DS is clearly geared toward younger players who are fans of the recently created show on which the game is based. While it might be easy to dismiss it as a typical licensed affair, developer A2M has in fact delivered a rather clever puzzle experience that will give its intended audience more than it would normally expect, and despite the game's shortcomings, it might just hold the interest of older players too. Using teamwork to cross this gap and break down that door is neat. The straightforward story in Transformers Animated: The Game takes many elements directly from the show and is delivered with a mixture of boldly illustrated still shots, voice acting, and transform cinematics, all completely faithful to the series' presentation. All of the original voice actors are here in full force to provide authentic dialogue for every character. The polygonal graphics engine does an admirable job of bringing the show's style to three dimensions with bright colors, large character models, and exaggerated animation. While the frame rate occasionally dips, the aesthetics will definitely satisfy Transformers Animated fans and strangers alike. Underneath this sheen lies a non-Transformers experience, though this isn't entirely a bad thing. The majority of the adventure is dominated by teamwork-based puzzle platforming--during which you can't transform, oddly enough--that recalls Blizzard's The Lost Vikings. You guide Optimus Prime, Bumblebee, and Bulkhead through levels by taking advantage of each character's strengths. Prime's projectile attack can be guided with the stylus to hit remote switches, and he can grapple onto girders to access areas the other two cannot. Bulkhead can punch straight through some heavy doors and push or pull heavy blocks into floor panel switches. Bumblebee is the only one who can jump, and he's able to rebound off walls and power up special switches that the others can't. For the most part, this all works well. Progression is largely smooth as you constantly switch between the three characters to use their talents. The level designs remain intuitive enough that you'll rarely find a situation where you've gotten yourself stuck and your only recourse is to restart. The game falters when it tries to mix things up. Combat is an empty, button-mashing affair, and there's almost no technique required to survive. Even when Prime and Bulkhead are subjected to seemingly unavoidable hits--neither of them can jump, remember, and their blocking animations are a little too slow to be effective at all times--they can take so many hits that it's difficult to lose. The car chase levels aren't much fun since they employ a rigid slot-car mechanic. You can transform into robot form to take down enemies by tapping them with the stylus, but this too is hardly challenging thanks to how slow your targets are. At the risk of committing Transformers blasphemy, it would have been better for the game to play to its strengths and do away with these scenarios altogether, even though they're the only levels in which you can transform. The slow slot-car chase scenes aren't so neat. Thankfully, combat occurs in short, tolerable bursts, and the car chase levels barely comprise a fifth of the game's 25 stages. The bad news is that aside from those stages, the game is relatively bare-bones. Even for those in the younger audience, the game can be beaten in a handful of hours. The promise of ~unlockables~ in the main menu results in nothing more than the opportunity to watch the full-motion video cutscenes that you've already seen in between levels. Nevertheless, Transformers Animated: The Game gets enough right to be a competent, decently made game that doesn't rely on its license to succeed but remains faithful to it. Well, except for the lack of actual transforming."}