{"ref": "https://www.gamespot.com/reviews/ghost-squad-review/1900-6183411/", "date": "November 27, 2007", "game_name": "Ghost Squad", "text": "Ghost Squad is an arcade light-gun game that will not apologize for being an arcade light gun game. Developed by AM2, a Sega studio with a long history of arcade hits, Ghost Squad is cut from the same cloth as arcade light gun games like Virtua Cop and House of the Dead, but with a touch of postmodern self-awareness. Ghost Squad seems to realize that it's a ridiculous anachronism, and it just runs with it, delivering clichd, terrorist-fighting, president-saving arcade action with enthusiasm, but without taking itself too seriously. Its self-effacing charm does a lot to brighten up the very traditional light gun gameplay in Ghost Squad, but it's also a phenomenally fleeting experience. Moments like this bring a little variety to the mostly traditional light-gun action. Ghost Squad consists of three interconnected missions, all of which cast you as a member of the titular Ghost Squad, the kind of top-secret SWAT team prevalent in action movies. The first mission has you infiltrating an international summit being held in a mountain villa where a terrorist organization known as the Indigo Wolves are holding world leaders hostage. Mission two puts you aboard Air Force One, where those same terrorists are looking to kidnap the president. The final mission is straight out of Rambo: First Blood Part II and has you infiltrating the Indigo Wolves' jungle base to rescue either Dr. Steve McCoy or Mr. Steve McCoy, depending on whom you ask, and then make a daring river escape. There are characters with incredible names like Dingo and Alex Havoc, and there's some terrifically awkward dialogue delivered by a cast of English-as-a-second-language voice actors, and the whole thing is just clich and corny enough to be funny. The game looks almost as much like a mid-'90s arcade game as it sounds, with lots of blocky characters, weirdly inexpressive faces, and flat textures. The gameplay is, for the most part, what you might expect from a Sega-produced light gun game. Using the Wii Remote to aim, you move automatically through the environments, shooting at enemies as they pop out from behind various objects, and reloading by pointing your remote offscreen. There are a few simple action sequences where you have to recover hostages, defuse time bombs, engage in hand-to-hand combat, or disarm land mines, and each mission culminates in a boss fight, though they can be kind of anticlimactic. It never goes too far beyond the light gun formula, but for what it is, it's pretty solid. The thing is, you can play through the three missions in Ghost Squad in well under 20 minutes, but that doesn't mean you'll have seen everything. Within each mission there are a number of points where you'll have to choose among multiple paths, and even though they all take you to the same conclusion, there are some pretty cool sequences that you simply won't see on a single play-through. This is just a glimpse of why paradise mode is worth unlocking. The game dangles a few other carrots to keep you coming back. The arcade mode keeps track of your performance, rewarding you with costumes that range from simple color variations on your basic SWAT outfit to an awesome panda suit, as well as a cache of different weapons that can have a significant effect on how the game handles. The game itself changes, too, and as you gain levels, you'll gain access to more difficult versions of the missions. Eventually you'll unlock ridiculous options like ninja mode and paradise mode, which are really the best reasons to play Ghost Squad. In ninja mode, you're armed with an infinite supply of throwing stars, and the generic terrorist thugs are replaced with ninjas. In paradise mode, you're armed with dolphin-shaped squirt guns, and the generic terrorist thugs are replaced with girls in bikinis. There's a hilariously half-assed charm to the way these modes just slap some random stuff into the game without justification or explanation, and they're probably the best reasons to play Ghost Squad. As a tongue-in-cheek homage to mid-'90s arcade light gun games, Ghost Squad is pretty successful, and players with some fondness for the source material, as well as those who appreciate random weirdness, should find it at least briefly enjoyable. The whole so-bad-it's-good thing only goes so far, though, and even with its promise of unlockables, Ghost Squad is ultimately too short for its own good."}