{"ref": "https://www.gamespot.com/reviews/dark-souls-3-review/1900-6416397/", "date": "April 4, 2016", "game_name": "Dark Souls III", "text": "Dark Souls III is a game of valleys and peaks, down through dungeons and up over castle walls. It's a plummet into places we shouldn't be--an escape from places we don't belong.But of course, we fight our way through the darkness, and find our way out. There are a few stumbles along the way, but in the end, Dark Souls III is well worth the riveting climb.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Dark Souls 3 Video ReviewThis is the third in a series of dark fantasy role-playing games known for their brutal difficulty and unforgiving nature. It gives minimal direction and little room for error. As with its predecessors, playing Dark Souls III means accepting two extremes: recurring defeat, and the reward of breaking through it. This is a game that recognizes the value of perseverance, tearing you down before it pulls you back up, reinforcing the spots where it broke you, preparing you for that next valley just down the road.The world itself is a disconnected series of detailed areas--some sprawl outward, while others stack on top of themselves, folding back and looping around in intricate webs. It's a testament to the level design that discovering a bonfire checkpoint is as important as levelling your character or defeating a challenging boss. In this dangerous world of swamps, prisons, and undead villages, every milestone is a victory.Returning to the Firelink Shrine hub world in order to level up character stats, weapon quality, and the health-imbuing estus flask seems tedious at first, but as time goes by, you'll recruit helpful companions that set up camp at your base, granting useful items and buffs throughout your playthrough. Bonfire checkpoints strewn throughout Dark Souls III allow for easy fast travel, and returning to Firelink becomes a welcome reprieve from the surrounding world.This macabre locale has subtle stories to tell--enemies on the Road of Sacrifices behave defensively, only attacking once attacked. Giants bow their heads in exhaustion among the rafters of the Cathedral of the Deep. A sense of mystery pervades Dark Souls III's gloomy world, and there's a confidence on display that's often missing from many modern games--Dark Souls III has secrets, whether you find them or not.It's also impressive how Dark Souls III strikes a balance between exploration and guidance. There's usually more than one path you can take through the world at any time--to new bosses, secret dungeons, or new areas entirely--but never too many that it feels overwhelming. The level design encourages wandering without losing focus.Dark Souls displays a confidence often missing from many modern games--the secrets are here whether you find them or not.Obstacles come in a variety of grotesque forms along the way: hulking giants and feral dogs; ancient knights and suicidal monks. Each enemy is a unique threat, and in groups, they grow more dynamic and punishing, demanding a flexible approach to combat. Dark Souls III is also clever in the way it plays on your false sense of comfort: many deaths come when you underestimate an enemy you've killed dozens of times before. The danger is always lurking. In the long run, survival requires patience.This is true throughout--there's a certain cadence to the combat, a certain pattern to each enemy, that's only discernible when you take time to observe it. Some enemies are weak near their sword arm--others are vulnerable from behind. Instinct may tell you to dodge every time a knight retracts its spear, but wasting stamina could lead to a quick death, forcing a restart at the most recent bonfire. Dark Souls III doesn't just teach you new skills--it forces you to forget ones you've already learned.The combat fluctuates between measured duels and frantic fights, but it almost always manages to keep things fair: you may be outnumbered and underpowered, but defeat is usually your fault. Sometimes, however, Dark Souls III breaks that rule. The camera often struggles to adjust in tight spaces, and the lock-on mechanic can be capricious, especially against Dark Souls III's more mobile, aggressive enemies. In boss fights that require precision, an imprecise camera becomes all the more of a hindrance.But what impressive monstrosities these bosses can be. In fact, several display more creativity than any others in developer From Software's RPG lineup. These creatures play on your expectations and force you to adapt. One boss fight pits you against a crowd of pyromancers that inches toward you, hinting at its weakness with subtle visual cues. Intuition tells you to keep your distance, but it soon becomes clear you'll need to enter the fray. It rips you out of your comfort zone at a harrowing pace.Despite the nuance and novelty of most bosses, however, some stick to familiar ground. Deja vu kicks in during several fights, when the monsters display move sets similar to those that came before them, diminishing the creativity displayed elsewhere. I brought down Pontiff Sullyvahn, the Consumed King, and even Aldrich--a boss the game purports to be one of my major targets--with tactics I had used hours earlier. These enemies feel recycled. They feel repetitive. The skin may be different, but the beast remains the same.One glaring design misstep involves a boss requiring a specific item to bring him down--that is, if you don't want to spend half an hour whittling away at his health. There is an earlier, obscure side quest that removes the need to use that item. But many players might not stumble upon it. Dark Souls is at its best when it rewards your growth, and tests your character's hard-earned experience. This boss fight doesn't--it has a very specific solution, despite the path you've taken to get there. This enemy, and the repetitive bosses, fly in the face of the progress you've made. They repeat patterns you've already mastered.The late-game hours of Dark Souls III seem not to erupt, but fade slowly into the fog.So too does the overall level design of the late-game hours. Whereas most of Dark Souls III makes uses of labyrinthine corridors and trap-laden outdoor settings, these areas lose their design appeal as the game comes to a close. I expected Dark Souls III to carry me through imaginative fights and engaging treks as my character reached the apex of her skills, but instead I felt disappointed. I had come all this way with her, and aside from two fantastic end-game bosses and a handful of inventive secret areas in its waning hours, Dark Souls III seemed not to erupt, but rather, fade slowly into the fog.But by and large, your growth is respected. It's that thread--that near constant sense of progress--that leads to Dark Souls III's greatest moments. We create our travelers. We make them stronger, faster, more resilient, turning them into fighters as we too learn the intricacies of this foreboding world. We can't slay the final boss until we conquer every enemy before it, so by the end of Dark Souls III, we've truly mastered something. That's a special feeling.Much like From Software's earlier entries, Dark Souls III obscures its plot beneath its gameplay elements--the story is more concerned with tone than exposition. But what plot there is asks important questions: why do we place our idols in such high regard? How did they become our legends? The Lords of Cinder are imposing figures in Dark Souls III, and their power is attractive to pawns like us. But the end of their road is a lonely one--was that destination worth the sacrifice it took to get there?There are several possible endings to Dark Souls III, and although most are anticlimactic, they drive home the loneliness of the paths we took. The old lords have abandoned their posts, and in the hunt to usurp them, we descend into those dark valleys, and climb those imposing peaks. This is the essence of Dark Souls III: periods of doubt, followed by great reward. The journey may be rocky, but there's a throne waiting at the end."}