{"ref": "https://www.gamespot.com/reviews/call-of-duty-black-ops-cold-war-review/1900-6417609/", "date": "November 20, 2020", "game_name": "Call of Duty: Black Ops Cold War", "text": "As with any annual game franchise, it's hard not to compare Call of Duty: Black Ops Cold War to last year's Modern Warfare. On the campaign side, Cold War does much better than last year's outing, showing that Call of Duty fares far better when it errs on the side of fantasy. This is true within Cold War's campaign, where the inclusion of Ronald Reagan is a bizarre fit for an otherwise larger-than-life story about espionage and brainwashing, and it's true when comparing its story to that of last year's self-serious Modern Warfare.In Zombies, Cold War has a far more successful co-op mode than Modern Warfare's Spec Ops, though it's still in need of some balance tweaks. Multiplayer, however, is where Cold War struggles; it falls flat overall, and that's especially apparent in Warzone's shadow.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Call Of Duty: Black Ops Cold War Video ReviewLike any Call of Duty campaign, Cold War is theatrical. From the '80s-themed montage that opens the campaign to a Vietnam flashback set to Steppenwolf--along with plenty of explosions, helicopter crashes, and slo-mo shootouts--Cold War's campaign is as action-movie as you'd expect. It largely works with the inherent over-the-top nature of a Black Ops story, and although some bits can be kind of goofy, it's both easy and fun to buy into the spy drama and massive gunfights in equal measure.That's partially thanks to good comedic timing in the dialogue, which helps prevent most scenes from coming across as too self-serious. You're also given plenty of choice throughout the campaign, including optional side missions, whether to kill or capture particular antagonists, and various dialogue options that range from lawful good to cheeky to loose cannon. While most decisions don't materially affect the overall story, I had fun playing around with them and going back to previous levels to try the more chaotic options, like throwing an enemy spy off a building instead of capturing him.Most levels give you multiple options in terms of your approach to combat, too, and some even account for blunders on your part. For example, an early mission tasks you with assassinating a target before he boards a plane and gets away. You'll screw up the assassination regardless, but the first time I did it, I was too slow and didn't even get a shot off before he began to escape; the second time, I did it ~correctly~ and shot at him, but the shot ended up hitting someone else and the target began to escape anyway. Even though the scene proceeds the same way no matter what, the illusion of flexibility, at least, makes Cold War's campaign dynamic and exciting--it often feels like you're just barely getting away with whatever hijinks you're trying to pull.Simple stealth mechanics add to this feeling. Most missions have at least some stealth, which means staying out of sight, relying on silent takedowns, and then hiding a body before someone can find it. In some instances I felt like I got away with more than I realistically should have, especially when noisily stabbing someone right behind someone else. But there are a few missions that create satisfying tension, as if you could be caught doing your spy business at any moment if you aren't quick and careful.The level design is par for the course for Call of Duty, with clear objectives and bombastic set-pieces. Hidden intel and the occasional optional objective mix it up a bit and encourage you to explore places like a well-realized East Berlin or a clever and creative Soviet training facility. One level, however, really stands out as a showcase for both stealth and freedom of choice, giving you free rein inside a KGB building and multiple options for completing your objective. I spent more time in this mission than in any of the others, exploring all the possibilities and sneaking into restricted areas just to see what was behind each door.You have plenty of opportunities to go loud, of course, and the shooting is as tight as ever. I'll never get tired of the satisfying thump that confirms a kill, whether I'm using a sniper rifle or an attack helicopter's minigun. Weapons are responsive and distinct from each other, and on PS5, the DualSense controller's adaptive triggers further differentiate one weapon from the next--I'll get to that a bit later on.Cold War largely avoids specific real-life events in its missions and overall story--at least to my knowledge--and instead uses the backdrop of the Cold War and the Iran hostage crisis to establish a sense of place and a main conflict (though the CIA is no stranger to illegal and questionable operations like those in Cold War's missions). One bizarre intrusion of real life comes in the form of Ronald Reagan, who only appears in a brief scene at the beginning and via a few voice lines toward the end of the game. While the recreation of his likeness and manner of speech is undeniably striking--a technical feat to be sure--he comes across as a weirdly benign grandpa in a room full of rough-talking, chain-smoking badasses discussing illegal military operations. It has very little to do with Reagan's real-life foreign or military policy, and he himself really has no impact on the trajectory of Cold War's story. He might as well have been any generic president in any American political drama, and his appearance sticks out as an attempt to force ~realism~ into an otherwise fantastical story.It's overall a fun action-movie story that absolutely delivers on the quintessential Black Ops twists and turns, but it ultimately walks back its more interesting and relevant questions.Cold War's biggest miss, in terms of story, is giving the United States very little grief for its imagined ills. Without going into too much detail, the US is ultimately responsible for the main (and completely fictional) issue at the center of the game's campaign, all due to an absolutely bonkers anti-Soviet strategy gone awry. The protagonists' main concern is that the US will be blamed for how the Soviets use this to their advantage, rather than that the US is indeed guilty of a major foreign policy blunder and human rights violation in the first place. There are moments in one of the two major endings where the game flirts with the idea that the US is not blameless, but it's ostensibly the bad ending; completing its objectives made me feel guilty, which ultimately solidified my suspicion that the US was meant to be the good guys all along and that the ends justified the questionable means.It's clear that a core theme of Cold War's story is that things are more complicated than just good or evil, and the ways in which this sequel plays off the original Black Ops underscore that. But like many Call of Duty stories, it only gestures at a greater point and stops short of making it. It's overall a fun action-movie story that absolutely delivers on the quintessential Black Ops twists and turns, but it ultimately walks back its more interesting and relevant questions--though I was completely invested in the story for the entire duration.As with any Call of Duty game, the standard suite of 6v6 multiplayer modes is here. There's not much to say about the modes themselves that hasn't been said before; they're the bread and butter of the multiplayer CoD experience, and most of them work well.There's a relatively small group of maps available currently, with more already announced. The Cold War setting allows for a lot of variety from one map to the next, which helps the limited slate feel richer; a highlight in terms of aesthetic are Miami's neon-soaked streets. Each core 6v6 map balances close-quarters spaces with long-range sightlines, and in my experience, they mostly translate well from one mode to the next.Combined Arms is Cold War's answer to Modern Warfare's Ground War, and it's my favorite of the multiplayer modes. The 12v12, objective-based mode incorporates vehicles at a manageable scale--you get boats on Armada, motorcycles on Cartel, and snowmobiles and tanks on Crossroads. Armada is the standout map, with several ships connected by ziplines. To get around, you can take the ziplines, swim, or commandeer a speedboat or larger turreted vessel. This provides a lot of dimension to the map; you can attract the attention of the opposing team with a loud vehicle but get to the objective faster, or you can dive underwater to avoid detection and sneak up on the deck of a ship at the cost of speed.The other two Combined Arms maps aren't quite as exciting, though. While the boats and ziplines of Armada give you an efficient way of navigating a water-based map, Cartel has tighter spaces and a lot of bumpy ground, so its motorcycles don't serve much of a purpose besides alerting everyone to your position. The tanks on Crossroads are good for causing explosions, but you can be just as effective, if not more so, on foot.Conversely, Cartel and Crossroads work just fine as 6v6 maps without their vehicles, whereas Armada is missing a lot of its charm without its boats. And while the maps are altered for the smaller player count, Armada still feels too big--it's much harder to get in a firefight without objectives to funnel you toward your opponents.Cold War is missing key mechanics that Modern Warfare and Warzone have, which leaves multiplayer at odds with the Warzone ecosystem.Fireteam: Dirty Bomb, another new mode, suffers under the weight of its large player count. The 40-player mode isn't battle royale, but it borrows ideas from battle royale games, including dropping out of a plane into a free-for-all against other teams of four. However, it lacks the stakes that make battle royale exciting. You can respawn over and over again after a short cooldown, and the objectives are scattered around the map--which means it's never quite clear which one you should be moving toward and where other teams might be moving in relation to you. It's easy to get flanked by multiple teams because you can't be sure where they're likely to come from, and because the maps are a bit too small for the number of players, you get into frustrating scuffles often.Across the multiplayer modes, Cold War feels a bit clumsier than Modern Warfare and, by extension, Warzone. It's missing key mechanics that Modern Warfare and Warzone have, including mounting weapons and switching a weapon's fire rate, which leaves Cold War at odds with the Warzone ecosystem. Of course, Cold War and Modern Warfare are different sub-series, so it's not fair to expect them to be identical. But the two systems are different enough that it's noticeable, especially in the movement and gunplay. It's not that one is better than the other, but it's a jarring adjustment to switch to Warzone--after all, Warzone is still an active part of Call of Duty and is even launchable from the Cold War menu.On PS5, Cold War utilizes the DualSense controller's various features, including nuanced haptic feedback and the much-touted adaptive triggers. When you're low on health, you can feel your heartbeat in your hands as it thumps in your ears and flashes red on the screen. When switching weapons, you can feel the difference in ADS speed through the left trigger's level of resistance; you can feel the difference in fire rate depending on how snappy (or not) the right trigger is, and the intensity of the vibration changes depending on the firepower and recoil you're working with.I've experimented with a variety of weapons as well as the same weapon with different attachments. Different weapons definitely feel distinct, but it's hard to tell what effect, if any, an attachment like a stock has on the trigger feel of a gun (though you'll still get the gameplay benefits of attachments, like faster reload speed, so it's not a huge deal). The most practical application I've found for the DualSense's feedback is in Zombies, where I tend to switch weapons much more frequently than in multiplayer. It's immediately apparent whether you're using your assault rifle or your LMG, for example, and in practice this helped me keep my eye on the enemies rather than double-checking my weapon in the bottom-right corner of the screen.Generally, this trigger feedback has also informed which weapons I've been favoring. The MP5, even after its nerf, has a satisfying snappiness in the right trigger that I really like; the AK-74u feels a bit heftier but is easy to aim and shoot for the power it gets you. The DualSense and the adaptive triggers specifically aren't a make-or-break feature, but they add dimension to already strong gunplay.While the feedback is engaging, though, it might not necessarily improve your Call of Duty game. Some guns, like long-range ones, require far more pressure to aim down sights than a standard assault rifle, which made my left pointer finger sore after a few hours of matches. That might sound kind of silly, but over time, having to put a lot of pressure on a trigger adds up, and I found myself switching to the much more forgiving AK-47 to offset this. Haptic feedback, too, could potentially interfere with your aim, though personally, I'm here to have a good time rather than nail a lot of headshots. If you prefer a more traditional controller feel, you can disable the features entirely in the game's settings.I've always liked Zombies, but this is the first time in a while that I've felt like I actually learned and improved after each run. A big part of that is the map design--Die Maschine is just the right size, with enough room that everyone can kite their own crowd of zombies but small enough that it doesn't take ages to learn the map basics. It only took a handful of runs to figure out which doors to unlock and when, how to get the power on, and how to unlock the Pack-a-Punch machine; once we found a rhythm for the opening rounds, we could just focus on getting better and surviving longer.However, while the learning curve is manageable, the difficulty curve could use some tweaks. It ramps up rapidly after round 10, as base weapons start to get less and less effective. On top of upgrading weapons at the Pack-a-Punch machine using points, you also have to upgrade their damage tier separately using salvage, which drops from zombies at random. Salvage is very rare compared to points, so you'll end up packing a weapon twice before round 20 but unable to upgrade its damage tier to match. Your ability to do damage can stall out as a result.The inclusion of damage tiers on top of the traditional Pack-a-Punch makes upgrading a weapon a bit more convoluted than it really needs to be. Salvage is also used to upgrade your armor and craft equipment like grenades, meaning you often have to decide between upgrading a weapon or something else. It's a mechanic that's really in need of balancing--even with a weapon attachment that's supposed to increase the rate of salvage drops, I still struggle to get enough to do everything I need to do.There are also radioactive bosses that join the normal zombie horde every few rounds, which exacerbates this issue. These bosses are really spongy, they eat a lot of bullets, and they survive between rounds. By round 20, we end up spending a good amount of our points at ammo crates just to keep up. Because packing a weapon the final time costs a whopping 30,000 points, it's difficult to save up enough points to get the final upgrade, let alone survive long enough without the damage boost you'll get from it. It's even harder once the game throws three of them at you at once.The bosses themselves challenge you to coordinate with your team, though, and we found some success by kiting a lone zombie around the map while we dealt with the bosses. Delaying the start of a new round this way isn't a new strategy for Zombies, of course, but it's still satisfying to execute, especially while dodging radioactive projectiles and trading off runs to the ammo crates. It's just that the boss rounds occur too close together to give you and your team room to breathe.Die Maschine is just the right size, with enough room that everyone can kite their own crowd of zombies but small enough that it doesn't take ages to learn the map basics.The biggest issue plaguing Zombies at the moment, though, is a bevy of server and matchmaking hiccups. I spend 10-15 minutes just troubleshooting matchmaking before my team and I can actually start playing, and it's not uncommon for one person to randomly error out right as the run is starting. I've experienced this both when utilizing cross-play and when playing with only PS5 players. We've also had both PS5 and Xbox Series X players experience hard crashes that completely shut off their systems. Technical issues like these are forgivable in the grand scheme, considering Cold War is cross-gen on top of allowing cross-play and launched in the middle of a pandemic. Still, it's worth noting that there are still a lot of issues to be ironed out.It's reasonable to expect updates to Cold War at a steady clip. Weapons will be tweaked, issues will be patched, and gameplay will be balanced. Zombies has a strong foundation and may very well be improved further by potential updates, but the gap between multiplayer and the Warzone ecosystem is too wide to be bridged by small tweaks. Zombies is a good co-op time overall, but multiplayer falls flat, leaving the strong campaign to do most of the heavy lifting.Call of Duty: Black Ops Cold War is featured on our list of the best split-screen PS4 games."}