{"ref": "https://www.gamespot.com/reviews/blitzkrieg-review/1900-6029008/", "date": "May 27, 2003", "game_name": "Blitzkrieg (2003)", "text": "Blitzkrieg may seem like a difficult game to start playing. It's another European 2D real-time strategy game set in World War II, like the Sudden Strike series. It isn't particularly flashy, and it doesn't have any especially innovative features or revolutionary concepts. It's also rather unpolished. But while the game may not make a very remarkable first impression, it does have some strong gameplay elements that give it some real substance and help make it deserving of your attention. Blitzkrieg features a good variety of units. Blitzkrieg is a fast-paced and fairly strategic game that focuses on ground combat. Rather than constructing a base and a bunch of units, you'll simply be given an army for each mission and set out to complete your objectives. In some cases, you'll be given forces that make the missions rather challenging, though in others, you'll end up with an army that lets you accomplish your mission fairly easily. The game is actually based on historical World War II battles, and in some cases, this means that some missions are rather boring. However, the game has a wealth of other gameplay options, so the game as a whole does have some depth to it. In the actual game, you have a great variety of units at your disposal, including many kinds of artillery, tanks, trucks, and infantry. You'll often be surprised at what you can do with them: Infantry can throw grenades to destroy tanks, if they get close enough; engineers can build trenches, bridges, and tank blocks and plant or disarm mines; artillery can be ordered fire automatically at specified points that are so far away as to be out of view; trucks can ferry troops; and troops can enter buildings. You can also steal unmanned enemy artillery. All these options help make the actual unit vs. unit combat interesting and strategic. The game also offers plenty of other strategic elements. Though Blitzkrieg focuses on ground combat, you can call in different kinds of air support, including bombing runs and paratrooper drops. You can also transport slow-moving troops in trucks and in tanks. You have to keep track of your troops' ammo supply, though. Each unit has primary and secondary ammunition, and once you run out, you must get more from either a supply warehouse or a remote supply station, where you must order truck crews to resupply your armies. However, the game has some noticeable pathfinding problems in these tight areas--vehicles can go in reverse, but they often waste time needlessly repositioning. The concept of supply definitely adds more strategic depth to the game, but the actual process of supplying your army can be cumbersome. The game gives you a lot to do, but it isn't always easy to do it. The interface consists largely of a number of tiny buttons clustered in a very small area. While you're learning the interface, you'll have to stop and carefully examine the buttons, often waiting for the pop-up help tool to appear to get any idea of what each button is. Even when you do get used to the buttons, you may find it hard to always click on the right one in the heat of battle. You can, with enough practice, learn to use these tiny icons fairly well, but the game's interface is by no means intuitive or elegant. And the game's interface and environments look a bit bland. For the most part, the game uses a subdued color palette that mainly consists of dark greens, grays, and browns. Though the terrain is 3D, the maps are 2D, and they aren't very crisp. The buildings, forests, and water featured on the maps aren't especially detailed or artistically inspired, either. We also noticed some odd graphical glitches in the game, such as the fact that player-created overlays tend to interfere with special effects. For instance, if an explosion goes off in a trench (which is fairly common), the explosion appears on either side of it, while the trench itself appears to be plastered on top of the flames. However, the rest of the game actually looks decent, and in some places it looks quite good. Blitzkrieg features a total of 200 3D units with believable animation--tanks rock back after firing, jeeps bounce over hills, and so on. Most importantly, the game also has some satisfying special effects, especially for artillery and rocket fire and explosions (the ones that aren't near trenches, anyway). Your troops have a variety of interesting abilities. The game's audio is its weakest feature. The sound effects are hollow, tinny, and rather unauthentic. The music is mostly orchestral, and though it's appropriate, it's not especially complex or memorable. Similarly, the game's spoken dialogue (in its missions and between-mission cutscenes) is underwhelming in terms of variety and creativity, and the poor translation occasionally renders the dialogue incoherent. Fortunately, the basic mechanics keep the game interesting--especially the unit-to-unit combat, which is even better in the game's free-form multiplayer modes than it is in the single-player campaign. Just about every individual aspect of the game is at least acceptable, if not good, and while it suffers from a distinct lack of charm or style, it has enough substance--including technical stability--to make it worthwhile. Despite its flaws, Blitzkrieg is fast-paced, challenging, and generally enjoyable."}