{"ref": "https://www.gamespot.com/reviews/mx-vs-atv-unleashed-review/1900-6143656/", "date": "June 25, 2007", "game_name": "MX vs. ATV Unleashed", "text": "MX vs. ATV Unleashed found success on the Xbox and PlayStation 2 last year with a fast-paced and approachable style of dirt racing that had you piloting everything from MX bikes to souped-up golf carts. Now, MX vs. ATV has been ~unleashed~ onto PCs and, because it's a fairly literal port of the console game, the same sense of control and amenable fun is left well intact, along with a few PC-only extras. The take-off was fun, but the landing is going to sting. Though motocross bikes and ATV four-wheelers are at the heart of the rides found in MX vs. ATV Unleashed, they are far from the only machines available to race. The game tosses everything but the transportation equivalent of the kitchen sink at you--golf carts, dune buggies, monster trucks, helicopters, and biplanes are only a portion of the available rides. This may sound like great fun, but the controls for some of these vehicles--particularly the airborne ones--are frustrating and unresponsive, a stark contrast to the majority of the earthbound racers. Though you can use the keyboard controls to pilot the vehicles in Unleashed--and naturally customize the keyboard mappings as you see fit--your best bet will be using a USB controller, preferably one with dual analog sticks. Unfortunately, even after you've gotten your controls mapped properly, the airborne vehicle controls remain the same and don't seem to have changed at all since the console version. Therefore, any race involving flight is an exercise in frustration, which is probably why they are so haphazardly (and infrequently) placed throughout the game. Even when you're racing the two- and four-wheeled beauties, you can expect to spend plenty of time in the air. The same bouncy physics model that has propelled previous ATV and MX games is in full effect here in MX vs. ATV Unleashed. Your bike will rocket off the lip of a jump and propel you high into the air, where you'll be free to perform as many point-grabbing-style tricks as you can manage before descending back to earth. If you manage to preload your suspension (by moving the left thumbstick backward, then forward) before your wheels leave the ground, you'll gain even more air. Preloading your bike's suspension is a key technique for navigating the bump-filled courses found in MX vs. ATV, but it won't be a technique you use for each jump. In fact, the game effectively forces you to choose your spots for preloading--take a jump too long and you may crash directly into the apex of another hill; take it too short and you'll lose precious momentum. Your knowledge of how to navigate the tracks is the key ingredient to winning races. There doesn't seem to be much in the way of performance differences among vehicles of the same type, so in all-ATV or all-MX races, your main advantage will be knowing exactly how to tackle each hill you encounter on a course. This is made all the more intriguing by the imaginative and immersive environments. While the majority of the stadium-based motocross tracks are only mediocre, the track designs come to life in the outdoor courses. The 16 Nationals Championship series events, for example, are a tantalizing mix of forest courses, dusty desert roadways, snowy mountain trails, and sandy beachside tracks. The wide variety in track types is further bolstered by individual features that are sure to provide thrills lap after lap. Huge pillars of dirt--resembling walls more than jumps--dot tracks that find you leaping felled trees, open-air gulches, and even your competition. As you speed your way toward the finish line, the dirt tracks twist and turn, wrenching your ATV or bike from side to side as you try to keep up with the constantly shifting camber. See? Told you so... On the most difficult sections of track, such as tight hairpin turns, you're best course of action is to make liberal use of the clutch control found in MX vs. ATV. Using the clutch lets you gain short bursts of speed around tight corners or at the start of a race. It takes some getting used to, but it soon becomes an essential weapon in your driving arsenal. Then there are the tricks you can perform, imaginatively titled stunts such as ~the lazy boy,~ ~the can can,~ and ~the nothing.~ For each trick you successfully land, you'll earn points that can be spent in the store to unlock new rides, gear, pro riders, and tracks, among other goodies. There's simply a lot to do in the game's many modes. Most players will spend the majority of their time either online--racing against up to six other players--or in the championships mode. Here, you'll be able to run a series of races in either the Nationals series or the THQ SX series, both of which are composed of 16 race events. The Nationals series features the outdoor courses, while the THQ SX championship is made up of supercross courses. Unlike other modes in the game, these two series are restricted to either ATVs or MX motocross bikes and feature multiple heats. Also in both series, you'll be periodically challenged to one-off races that will have you racing the aforementioned trophy trucks, helicopters, or biplanes. Win the challenge and you unlock the winning ride; lose, and all you've lost is your pride (or in the case of the air races, a little bit of your sanity). Do you like to go fast, straight, and UP for 10 seconds at a time? If so, the hillclimb is for you. Other modes include a single-player game, which features freestyle, free ride, one-on-one challenges, and individual racing events, such as hill climbs, waypoint races, and short tracks; multiplayer racing, both online and split-screen style; a quick race feature; and a training mode that will introduce you to the basics of high-speed dirt driving, as well as some of the finer control points. The same variety found in MX vs. ATV's single-player mode is also available online. Straight-ahead races are the norm, but you can also compete in events such as the points challenge, where the player who can rack up the most points in a preset time limit is the winner. Online races via either Internet or LAN run with minimal lag, and the controls are as responsive online as they are offline. Like in the single-player game, you're limited to a maximum of six competitors in a single race. Also, the multiplayer interface is a bit confusing and poorly organized. If you wish to chat with folks in the lobby before a race, for example, you have to exit out to a chat window, and then return back to the main lobby and watch as your text appears. The biggest addition to the PC version of Unleashed is a track-creation tool that has everything you need to create the hill climb or MX supercross track of your dreams. The tool lets you focus on everything from the exact height and frequency of undulations in the track to building massive 30-feet-high jumps, all of which can be tested practically right away by firing up the game and giving it a go. There's clearly a lot of depth in the track editor and, even if its layout might not be that user-friendly to novices, the ability to race your user-created tracks online adds some depth that simply can't be found in the console version of the game. The graphics in the PC version are serviceable and have sharper textures, thanks to the PC's higher processing power. The dirt textures on the roads look appropriately dingy, though the bikes don't always kick up as much mud as you might expect them to. That's just being nitpicky, though, because it's really an overall solid graphical package that runs at a speedy clip and saves the special lighting effects for tracks that make the most of them--such as the snowy Northern Lights course complete with an aurora borealis painting the sky. So what's not to like in MX vs. ATV? For one, experienced players won't find much challenge except on the hardest difficulty settings, as the game lets you stay in a race even if you fall well behind. In effect, the biggest challenge is racing against the course, rather than racing against MX vs. ATV's computer-controlled opponents. Furthermore, collision detection can be spotty against other opponents. You generally won't crash if you sideswipe an opponent, yet when the time does come for either you or your artificial intelligence opponent to take a tumble, it's usually you who takes the fall. On the plus side, the loading times that were fairly ugly in the console versions of the game are much improved on the PC. Next up: MX vs. ATV vs. Bigfoot vs. a dude on Rollerblades. While we're tempted to write off the soundtrack simply for including a Nickelback song, in all honesty, the music found in MX vs. ATV does well in keeping with the rugged vibe of the game and features acts such as Papa Roach, Ozomatli, and Phunk Junkeez. The whining bleats of the ATV and motocross bike engines sound true to life, if not extremely varied, and attempts at adding environmental noises, such as chirping birds and hooting owls, are fine, if unremarkable. Because the air races found in MX vs. ATV Unleashed are so frustrating, one wonders why they even made it in the first place, especially when you consider how fun the game is with two (or more) wheels on the ground. Still, MX vs. ATV Unleashed is a fast-paced and fun-filled arcade racing game, loaded with enough variety of modes and unlockable content to keep you engaged for quite a while. There's simply a lot to do in the game's many modes. Most players will spend the majority of their time either online--racing against up to six other players--or in the championships mode. Here, you'll be able to run a series of races in either the Nationals series or the THQ SX series, both of which are composed of 16 race events. The Nationals series features the outdoor courses, while the THQ SX championship is made up of supercross courses. Unlike other modes in the game, these two series are restricted to either ATVs or MX motocross bikes and feature multiple heats. Also in both series, you'll be periodically challenged to one-off races that will have you racing the aforementioned trophy trucks, helicopters, or biplanes. Win the challenge and you unlock the winning ride; lose, and all you've lost is your pride (or in the case of the air races, a little bit of your sanity). Do you like to go fast, straight, and UP for 10 seconds at a time? If so, the hillclimb is for you. Other modes include a single-player game, which features freestyle, free ride, one-on-one challenges, and individual racing events, such as hill climbs, waypoint races, and short tracks; multiplayer racing, both online and split-screen style; a quick race feature; and a training mode that will introduce you to the basics of high-speed dirt driving, as well as some of the finer control points. The same variety found in MX vs. ATV's single-player mode is also available online. Straight-ahead races are the norm, but you can also compete in events such as the points challenge, where the player who can rack up the most points in a preset time limit is the winner. Online races via either Internet or LAN run with minimal lag, and the controls are as responsive online as they are offline. Like in the single-player game, you're limited to a maximum of six competitors in a single race. Also, the multiplayer interface is a bit confusing and poorly organized. If you wish to chat with folks in the lobby before a race, for example, you have to exit out to a chat window, and then return back to the main lobby and watch as your text appears. The biggest addition to the PC version of Unleashed is a track-creation tool that has everything you need to create the hill climb or MX supercross track of your dreams. The tool lets you focus on everything from the exact height and frequency of undulations in the track to building massive 30-feet-high jumps, all of which can be tested practically right away by firing up the game and giving it a go. There's clearly a lot of depth in the track editor and, even if its layout might not be that user-friendly to novices, the ability to race your user-created tracks online adds some depth that simply can't be found in the console version of the game. The graphics in the PC version are serviceable and have sharper textures, thanks to the PC's higher processing power. The dirt textures on the roads look appropriately dingy, though the bikes don't always kick up as much mud as you might expect them to. That's just being nitpicky, though, because it's really an overall solid graphical package that runs at a speedy clip and saves the special lighting effects for tracks that make the most of them--such as the snowy Northern Lights course complete with an aurora borealis painting the sky. So what's not to like in MX vs. ATV? For one, experienced players won't find much challenge except on the hardest difficulty settings, as the game lets you stay in a race even if you fall well behind. In effect, the biggest challenge is racing against the course, rather than racing against MX vs. ATV's computer-controlled opponents. Furthermore, collision detection can be spotty against other opponents. You generally won't crash if you sideswipe an opponent, yet when the time does come for either you or your artificial intelligence opponent to take a tumble, it's usually you who takes the fall. On the plus side, the loading times that were fairly ugly in the console versions of the game are much improved on the PC. Next up: MX vs. ATV vs. Bigfoot vs. a dude on Rollerblades. While we're tempted to write off the soundtrack simply for including a Nickelback song, in all honesty, the music found in MX vs. ATV does well in keeping with the rugged vibe of the game and features acts such as Papa Roach, Ozomatli, and Phunk Junkeez. The whining bleats of the ATV and motocross bike engines sound true to life, if not extremely varied, and attempts at adding environmental noises, such as chirping birds and hooting owls, are fine, if unremarkable. Because the air races found in MX vs. ATV Unleashed are so frustrating, one wonders why they even made it in the first place, especially when you consider how fun the game is with two (or more) wheels on the ground. Still, MX vs. ATV Unleashed is a fast-paced and fun-filled arcade racing game, loaded with enough variety of modes and unlockable content to keep you engaged for quite a while."}