{"ref": "https://www.gamespot.com/reviews/ace-combat-5-the-unsung-war-review/1900-6111374/", "date": "October 26, 2004", "game_name": "Ace Combat 5: The Unsung War", "text": "In 2001, Namco's Ace Combat series of flight combat games hit a high point with Ace Combat 04: Shattered Skies, which was the series' first installment on the PlayStation 2. Featuring incredible visuals, responsive action that captured the thrill of high-flying (and low-flying) aerial dogfighting, and a surprisingly complex and well-told narrative, Ace Combat 04 was a real winner. Now Ace Combat is back in another game bristling with beautifully modeled real-world jet fighters and cinematic cutscenes. Ace Combat 5 isn't the huge step for the series that Ace Combat 04 was, but it's still a great flight combat game, featuring grueling arcade-style action and plenty of surprises both in its mission design and its story. Ace Combat 5 continues the tradition of authentic-looking but decidedly arcadelike flight combat combined with deep storytelling. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Ace Combat 5: The Unsung War Video Review Like its predecessor, Ace Combat 5 takes place in an alternate reality, much like a near-future version of our own, in which war is being waged between two great nations. In the game's campaign, which spans more than two-dozen missions, you'll play as a pilot who goes by the call sign Blaze. His relationship with his fellow pilots and the truth behind the war gradually unfolds during the course of the story, which unravels during the actual missions as well as in beautifully produced cinematic cutscenes between the missions. The story can be difficult to follow, since so much of it rapidly comes across in the heat of battle via radio transmissions. The narrative technique here is also more straightforward in comparison to Ace Combat 04's story, which focused on a main character who wasn't the pilot you played as. Nevertheless, Ace Combat's continued devotion to good storytelling is ultimately one of this game's best strengths, since the presence of so much plot helps to give the missions a sense of genuine significance and cinematic drama. The high-quality voice acting, constant radio chatter, and stirring, dynamic music combine with the action very well, giving Ace Combat 5 an epic feel. At first glance, Ace Combat 5 resembles a realistic flight simulation, since if features dozens of different real-world aircraft, including plenty of American classics like the F-16 Fighting Falcon and the F/A-18 Hornet, as well as Russian planes like the Su-27 and MiG-29. State-of-the-art fighters like the F-22 and classic jets like the F-4 and A-10 Warthog are also represented. In real life, some of these jets handle drastically differently, but despite its realistic looks (complete with gorgeously detailed plane models and cockpits, and authentic heads-up displays), Ace Combat 5 is clearly not intended to be a realistic flight simulation. Each plane handles gracefully and responsively, yet unlike in real life, the most significant differences between them lie in their weapon loadouts. Differences in speed, maneuverability, and durability are also evident, but are not drastic, so it's easy to switch between different planes. For that matter, it's easy to learn how to play, and there's an effective, optional multistep tutorial to help you if you don't feel like figuring things out for yourself. The controls haven't changed much since Ace Combat 04, but they worked very well in that game. Only a rudimentary understanding of how planes maneuver is needed to understand the mechanics of Ace Combat 5. There's really no need to worry about things like stalling or blacking out from extreme g-forces here--all you need to know is that planes roll, pitch, and yaw rather than simply strafe from side to side like a character in a first-person shooter (though, you can use your rudders for limited side-to-side motion). Actually, the game makes use of just about every function on the controller, but it's still quite streamlined; for instance, you can conveniently pop up a minimap of your surroundings to get a sense of the grand scope of a battle and to figure out where you are and where you need to be. The map button is pressure-sensitive, affecting the map's level of zoom. Most of the game's planes come packed with 50 or more guided missiles, which will be the mainstay of your arsenal. Your guns are useful for eliminating stationary targets or finishing off wounded aircraft, but a pair of seeking missiles--while certainly not unavoidable--is the most reliable way to take out a foe. There are plenty of alternate special weapons available, including powerful cluster bombs and far more damaging missiles with better targeting systems, but these will be available to you in short supply in each mission. One-on-one dogfights aren't difficult here, but the odds are never so favorable. Ace Combat 5's diverse assortment of missions contains more surprises than you'd probably expect, though they focus on the unavoidable themes of either having to eliminate enemy targets or defend friendly ones, and they're heavily scripted so they play out similarly each time you try them. Even so, you'll square off against some unlikely foes and fight over land, sea, city, and more, during the course of the game. You'll also have to take account of numerous land targets in addition to aerial threats. Suffice it to say that you'll never quite know what to expect from mission to mission, which--in addition to the story--compels you to keep playing. Regardless, time tends to be of the essence in every mission, and achieving time-sensitive requirements tends to be where the real challenge and occasional trial-and-error-based frustration lies. Fortunately, multiple difficulty settings are available to take the edge off (or add replay value, as the case may be). It's not hard to take down individual enemy fighters, which you'll be blasting away in droves. But it can be decidedly difficult to meet some of the overarching mission goals while fending off dozens of foes and not crashing into anything. Enemies will tend to swarm you and your HUD lights up in warning whenever one of them acquires you in a missile lock. Some basic evasive maneuvering is all that's needed to avoid getting hit at this point, but the combination of evading your foes, not colliding with anything, maintaining focus on your objectives, and managing your wingmen all adds up to having plenty to do in Ace Combat 5's tightly paced, intense missions. The addition of wingman commands is new to Ace Combat 5, and it's a feature that's integrated well within the game. It wouldn't have been much fun to have to babysit a bunch of friendly planes while trying to survive in hostile airspace, so it's fortunate that your wingmates here remain basically autonomous. However, you have the ability to issue several different orders to them just by pressing in one of four directions on the D pad. By default, your wingmates will cover you, helping to keep foes off your six. You may also issue an attack command, sending several comrades toward whichever enemies are centered in your sights. There's also a disperse command, useful for defensive missions in which you're trying to resist enemy attack on several fronts. Finally, you may toggle between permitting and not permitting your wingmates to use their limited supply of special weapons. In practice, it's easy to order your squadron around even in the heat of battle, though doing so does require you to find a spare moment, which isn't always available. Regardless, your wingmates seem to do a competent job of drawing enemy fire and assisting you in your goals, though you'll have to do the vast majority of the work yourself. Ordering your wingmen adds an extra bit of depth to the proceedings, but they really don't require much of your attention. Your wingmen are mostly just there to create additional targets for your enemies, and also to provide some lively banter throughout each sortie. Oftentimes, they (or someone else) will radio into you with yes/no questions, which you can respond to by pressing left or right on the D pad, respectively; or you can ignore the questions entirely. This is useful early on to clue you into the primary uses of the wingman commands--for instance, one of your squad will suggest the dispersion tactic. More than anything, though, it contributes sort of a role-playing element to Ace Combat 5's missions by letting you--as opposed to your jet's cannons, missiles, and bombs--become involved in some of the drama. For what it's worth, the frequent in-mission dialogue is frequently unnecessary, but sometimes it is critical to the mission. You'll probably sometimes wish you could order your squad to maintain radio silence so that you could concentrate on more-important matters than your feelings about each other. Based on your performance in missions, you earn cash with which you can buy new planes. Also, most planes have what's basically an experience point meter, which fills as you earn kills with that plane; fill it up, and an even better plane will become available for purchase. In practice, it can be quite a dilemma trying to decide on whether to stick with a single plane for a few missions and max out its kill meter, or try out all the numerous other planes you've unlocked. In addition to the good-sized campaign, Ace Combat 5 offers some nonstop thrills in the form of a fast-paced arcade mode, which strips away the storyline and focuses on a near-constant string of progressively tougher time-sensitive challenges. This mode showcases how essentially entertaining Ace Combat 5's simplified flight mechanics are, but it also demonstrates how important the campaign's story is to giving meaningful context to all the dogfighting. There's an arcade mode to keep you busy in addition to the rather lengthy campaign. Ace Combat 5's beautiful presentation helps the game a lot. Highly realistic clouds, missile contrails, and terrain, in addition to a silky-smooth frame rate and the option of three different viewpoints (the most useful of which is the transparent HUD, but the coolest of which is the first-person cockpit view), help make this game really believable just from a visual standpoint. A widescreen display option is available, to boot. The terrain graphics hold up nicely even when you're skimming the surface, and the game's plentiful explosions look good, though they aren't terribly complex--don't expect location-based damage or anything like that. All the while, Ace Combat 5's music soars seemingly together with the airplanes that are depicted in the game. The soundtrack serves to heighten the suspense and tension of the game's missions, and it provides a driving beat for the action and a calming change of pace during the story sequences. Likewise, the quality of Ace Combat 5's voice work is mostly quite high, though some of the deliveries fall a bit flat. But there's just so much dialogue happening so quickly (during the missions, anyway) that the net effect of the chatter certainly is convincing. A Japanese-language track is also available, and you can toggle subtitles on or off in either case. The rest of the game's sound effects are solid, from the roar of your afterburners to the threatening buzz of your machine guns. It's been several years since the last Ace Combat game, and this latest installment doesn't do much to change an already-winning formula--but not much was needed to keep this series feeling fresh and exciting, especially since there just aren't many other flight combat games on the market. Those looking for a complex flight simulation on consoles need not apply to Ace Combat 5, which is much more interested in delivering the thrills and drama of Top Gun-style cinematic depictions of modern dogfighting--something that the game achieves very capably. The addition of wingman commands is new to Ace Combat 5, and it's a feature that's integrated well within the game. It wouldn't have been much fun to have to babysit a bunch of friendly planes while trying to survive in hostile airspace, so it's fortunate that your wingmates here remain basically autonomous. However, you have the ability to issue several different orders to them just by pressing in one of four directions on the D pad. By default, your wingmates will cover you, helping to keep foes off your six. You may also issue an attack command, sending several comrades toward whichever enemies are centered in your sights. There's also a disperse command, useful for defensive missions in which you're trying to resist enemy attack on several fronts. Finally, you may toggle between permitting and not permitting your wingmates to use their limited supply of special weapons. In practice, it's easy to order your squadron around even in the heat of battle, though doing so does require you to find a spare moment, which isn't always available. Regardless, your wingmates seem to do a competent job of drawing enemy fire and assisting you in your goals, though you'll have to do the vast majority of the work yourself. Ordering your wingmen adds an extra bit of depth to the proceedings, but they really don't require much of your attention. Your wingmen are mostly just there to create additional targets for your enemies, and also to provide some lively banter throughout each sortie. Oftentimes, they (or someone else) will radio into you with yes/no questions, which you can respond to by pressing left or right on the D pad, respectively; or you can ignore the questions entirely. This is useful early on to clue you into the primary uses of the wingman commands--for instance, one of your squad will suggest the dispersion tactic. More than anything, though, it contributes sort of a role-playing element to Ace Combat 5's missions by letting you--as opposed to your jet's cannons, missiles, and bombs--become involved in some of the drama. For what it's worth, the frequent in-mission dialogue is frequently unnecessary, but sometimes it is critical to the mission. You'll probably sometimes wish you could order your squad to maintain radio silence so that you could concentrate on more-important matters than your feelings about each other. Based on your performance in missions, you earn cash with which you can buy new planes. Also, most planes have what's basically an experience point meter, which fills as you earn kills with that plane; fill it up, and an even better plane will become available for purchase. In practice, it can be quite a dilemma trying to decide on whether to stick with a single plane for a few missions and max out its kill meter, or try out all the numerous other planes you've unlocked. In addition to the good-sized campaign, Ace Combat 5 offers some nonstop thrills in the form of a fast-paced arcade mode, which strips away the storyline and focuses on a near-constant string of progressively tougher time-sensitive challenges. This mode showcases how essentially entertaining Ace Combat 5's simplified flight mechanics are, but it also demonstrates how important the campaign's story is to giving meaningful context to all the dogfighting. There's an arcade mode to keep you busy in addition to the rather lengthy campaign. Ace Combat 5's beautiful presentation helps the game a lot. Highly realistic clouds, missile contrails, and terrain, in addition to a silky-smooth frame rate and the option of three different viewpoints (the most useful of which is the transparent HUD, but the coolest of which is the first-person cockpit view), help make this game really believable just from a visual standpoint. A widescreen display option is available, to boot. The terrain graphics hold up nicely even when you're skimming the surface, and the game's plentiful explosions look good, though they aren't terribly complex--don't expect location-based damage or anything like that. All the while, Ace Combat 5's music soars seemingly together with the airplanes that are depicted in the game. The soundtrack serves to heighten the suspense and tension of the game's missions, and it provides a driving beat for the action and a calming change of pace during the story sequences. Likewise, the quality of Ace Combat 5's voice work is mostly quite high, though some of the deliveries fall a bit flat. But there's just so much dialogue happening so quickly (during the missions, anyway) that the net effect of the chatter certainly is convincing. A Japanese-language track is also available, and you can toggle subtitles on or off in either case. The rest of the game's sound effects are solid, from the roar of your afterburners to the threatening buzz of your machine guns. It's been several years since the last Ace Combat game, and this latest installment doesn't do much to change an already-winning formula--but not much was needed to keep this series feeling fresh and exciting, especially since there just aren't many other flight combat games on the market. Those looking for a complex flight simulation on consoles need not apply to Ace Combat 5, which is much more interested in delivering the thrills and drama of Top Gun-style cinematic depictions of modern dogfighting--something that the game achieves very capably."}