{"ref": "https://www.gamespot.com/reviews/suikoden-iii-review/1900-2896353/", "date": "October 31, 2002", "game_name": "Suikoden III", "text": "It's been a little crowded in the PlayStation 2's role-playing game market this October, what with the release of no fewer than four such games. Yet Konami's entry, Suikoden III, rates at the top of the heap, thanks to an incredibly fleshed-out setting and a huge cast of characters in a tightly woven and relatively contrivance-free plot. Strangely enough, Suikoden III manages to distinguish itself from its contemporaries by not straying too far from common fantasy set pieces and themes, instead opting to focus on the execution of the storytelling. While it has a few minor problems, they are dwarfed by the sheer amount of enjoyment the game will undoubtedly offer to anyone who enjoys a good RPG. Suikoden III begins on the verge of a peace agreement between the upstart Zexen Federation and the Grassland's Six Clans, with both of the warring factions lying in the shadow of the Harmonian Empire. You assume three main roles: Chris, the newly appointed captain of the Zexen knights; Hugo, the son of the Karaya clan's chief; and Geddoe, the leader of a mercenary band acting as part of Harmonia's frontier defense force. Their storylines are interrelated and even have a few points of intersection. This chance to see a few plot points from different perspectives is grandiosely named the ~trinity sight system,~ but thankfully, the mechanic works much better than its gimmicky name, as each character's story is fairly independent of the others. The shifts in viewpoint help make things very interesting, as political intrigue renews the Zexen-Grassland conflict and new threats arise. This installment in the Suikoden series takes place 15 years after Suikoden II, though in a neighboring region of the continent. It's not necessary to have played Suikoden II to understand the unfolding plot in the game, though one scene late in the game will not have as much of an impact on newcomers. The writing otherwise does an excellent job of couching back story in the dialogue and avoiding blatant and lengthy exposition. Those who have played Suikoden II do get to transfer their save data at the start of the game, but the bonuses this provides are just that--bonuses. However, Suikoden III's accessibility to those new to Suikoden does not mean that the gameworld is thinly developed or that it exists in a vacuum. The gameworld is rich with history, politics, and culture, and Suikoden III just does a great job of showing instead of telling, inspiring the imagination of the player to round out the detail. The gorgeous opening movie is illustrative of that. While it's only a montage of unrelated scenes featuring some of the game's more prominent characters, each scene is evocative of a larger story. Mechanically, Suikoden III is fairly standard as an RPG, but with a high level of customization. At any given point, you're in control of a party of up to six characters. Moving about the world and through dungeons will inevitably put you in a series of random encounters with the local monsters, as well as scripted fights against boss monsters. Combat is conducted in pairs--that is, a full party of six will act as three separate pairs. Orders are issued at the start of a round, and each pair is issued a command. This results in a little loss of control, because if one character is ordered to use an item, cast a spell, or execute a special attack, the other character will default to attack. The only time this is really a problem is if you're using one of the spells that has a wide area of effect, as your teammate may wander into the blast while charging the enemy. At least there is a meter at the bottom of the screen that will show you if your partner is going to move before you can finish casting. At any rate, area-effect spells are so powerful that they need to be balanced this way, forcing you to team up your spellcaster with a slow character or wait to use area-effect spells until your character has more experience and can cast them before your partner can run off. So while the combat system isn't necessarily flawed, issuing only three orders for six characters may take a little getting used to. In addition to this main combat mode, there is also a one-on-one duel mode and a strategic battle, neither of which have a whole lot of depth, but they at least break up the monotony. Besides endowing you with experience and treasure, winning in combat will also give you points that can be used toward advancing combat and magic skills. There are basic skills that any character can learn that enhance natural abilities, like magic resistance or accuracy, and then there are some special skills that will only be available to select characters, like ~thief~ and ~freeze.~ Each character has an aptitude for each skill that governs not only how quickly the skill can be improved, but also the maximum level of improvement. Characters are further differentiated by how many skills they can use at one time--some characters can have as few as three, while others can have up to eight. Items and such will also give bonuses to skills. It's a good system, and it allows you to decide whether you want to field a team of specialists, a team of jacks-of-all-trades, or a team featuring little of both. The main attractions of the Suikoden series have always been the ~108 stars and the castle,~ and they continue to be a strength in Suikoden III. The concept of the 108 stars of destiny is based on the Chinese legend that gives Suikoden its name--a story about 36 heavenly heroes and 72 earthly heroes regarded as outlaws by their governments and heroes by the people. The 108 characters that make up the stars in Suikoden III include the three main characters and a variety of others. Gathering them all will require some work, though it is by no means an impossible task. A lot of the stars are just fighters, but there are others who have special roles like shopkeeper, cook, farmer, nurse, librarian, and even theater director. While a lot of the characters have personalities that are little more than lighthearted one-note caricatures, there are more that exhibit depth than in some other RPGs. Each is unique and stylishly designed as well, with perhaps a handful of exceptions. Early on in the game, you'll open up two chapters devoted to the character Thomas, a bastard child of a Zexen official who is sent off to become the master of the dilapidated castle because it's out of the way and unimportant. Thomas' quest is to keep the castle financially solvent, and he does this by recruiting the first few stars and turning the castle into a trade hub that's open to all--a particularly egalitarian move that flies in the face of the current political tensions and causes a lot of problems. The main attractions of the Suikoden series have always been the ~108 stars and the castle,~ and they continue to be a strength in Suikoden III. Thomas' side story is very entertaining (though somewhat cloying), but the castle itself is also a great source of entertainment. Beyond acting as a headquarters and a place to rearm, rest, and organize supplies, it also provides minigames and lots of other interesting little distractions. Sure, the peace of the land is in the balance, but there's always time for fun. For instance, once the theater director is recruited, you can spend a surprising amount of time mangling the balcony scene from Romeo and Juliet or a few other dramatic scenes. All you do is select the cast from the stars you have recruited up to that point and watch. It has a surprising amount of depth to it, with each line in each play delivered in a large number of ways according to who's playing the role. Sometimes an actor will ad-lib a line related to their real job, break character completely, or knock a part of the set over. Seeing how your favorite characters fare at acting really adds to their personalities. If you ever wondered if ninjas, wizards, and barbarians make good actors, Suikoden III is the game for you. As far as production values go, while Suikoden III's great anime-influenced art direction and the aforementioned plot, setting, and gameplay touches make for attractive character design and interesting character development, the game doesn't have the graphical flash of the benchmark Final Fantasy X. Though the exteriors of some buildings have an unnatural, undermodeled look, for the most part the environments are detailed and stylish. The frame rate can get annoyingly slow, but not frustratingly slow. There's also a minor but incredibly obvious control issue that causes problems in three or four locations if you keep holding the directional stick in the same direction when moving into a room or the next segment of field--the orientation of the new area places the border you just walked across in the same direction you pushed to walk across it, so if you continue to hold the stick as you enter, you just walk right back out. For every shortcoming, there are two or three little extra touches that give Suikoden III a depth beyond that of its peers. The only really jarring problem is the game's music. Apart from the striking theme accompanying the opening movie, the music is largely unremarkable. There are even large cutscenes in which there is no music at all, and the silence is very distracting--doubly so since there is no voice work at all in Suikoden III. While most scenes are scored, the few that aren't are few and far between, and none of them have any dramatic reason for being silent. Suikoden III is a little rough in spots, but it has the makings of a classic: The characters are both numerous and memorable, the setting and back story are amazingly well thought out and original for all of their classic fantasy trappings, and the plot is more mature than that of the average ~bad guy threatens to destroy the world~ RPG. For every small shortcoming, there are two or three little extra touches that give Suikoden III a depth beyond that of its peers. It's a must-buy for RPG fans, even those new to the series. The main attractions of the Suikoden series have always been the ~108 stars and the castle,~ and they continue to be a strength in Suikoden III. The concept of the 108 stars of destiny is based on the Chinese legend that gives Suikoden its name--a story about 36 heavenly heroes and 72 earthly heroes regarded as outlaws by their governments and heroes by the people. The 108 characters that make up the stars in Suikoden III include the three main characters and a variety of others. Gathering them all will require some work, though it is by no means an impossible task. A lot of the stars are just fighters, but there are others who have special roles like shopkeeper, cook, farmer, nurse, librarian, and even theater director. While a lot of the characters have personalities that are little more than lighthearted one-note caricatures, there are more that exhibit depth than in some other RPGs. Each is unique and stylishly designed as well, with perhaps a handful of exceptions. Early on in the game, you'll open up two chapters devoted to the character Thomas, a bastard child of a Zexen official who is sent off to become the master of the dilapidated castle because it's out of the way and unimportant. Thomas' quest is to keep the castle financially solvent, and he does this by recruiting the first few stars and turning the castle into a trade hub that's open to all--a particularly egalitarian move that flies in the face of the current political tensions and causes a lot of problems. Thomas' side story is very entertaining (though somewhat cloying), but the castle itself is also a great source of entertainment. Beyond acting as a headquarters and a place to rearm, rest, and organize supplies, it also provides minigames and lots of other interesting little distractions. Sure, the peace of the land is in the balance, but there's always time for fun. For instance, once the theater director is recruited, you can spend a surprising amount of time mangling the balcony scene from Romeo and Juliet or a few other dramatic scenes. All you do is select the cast from the stars you have recruited up to that point and watch. It has a surprising amount of depth to it, with each line in each play delivered in a large number of ways according to who's playing the role. Sometimes an actor will ad-lib a line related to their real job, break character completely, or knock a part of the set over. Seeing how your favorite characters fare at acting really adds to their personalities. If you ever wondered if ninjas, wizards, and barbarians make good actors, Suikoden III is the game for you. As far as production values go, while Suikoden III's great anime-influenced art direction and the aforementioned plot, setting, and gameplay touches make for attractive character design and interesting character development, the game doesn't have the graphical flash of the benchmark Final Fantasy X. Though the exteriors of some buildings have an unnatural, undermodeled look, for the most part the environments are detailed and stylish. The frame rate can get annoyingly slow, but not frustratingly slow. There's also a minor but incredibly obvious control issue that causes problems in three or four locations if you keep holding the directional stick in the same direction when moving into a room or the next segment of field--the orientation of the new area places the border you just walked across in the same direction you pushed to walk across it, so if you continue to hold the stick as you enter, you just walk right back out. The only really jarring problem is the game's music. Apart from the striking theme accompanying the opening movie, the music is largely unremarkable. There are even large cutscenes in which there is no music at all, and the silence is very distracting--doubly so since there is no voice work at all in Suikoden III. While most scenes are scored, the few that aren't are few and far between, and none of them have any dramatic reason for being silent. Suikoden III is a little rough in spots, but it has the makings of a classic: The characters are both numerous and memorable, the setting and back story are amazingly well thought out and original for all of their classic fantasy trappings, and the plot is more mature than that of the average ~bad guy threatens to destroy the world~ RPG. For every small shortcoming, there are two or three little extra touches that give Suikoden III a depth beyond that of its peers. It's a must-buy for RPG fans, even those new to the series."}