{"ref": "https://www.gamespot.com/reviews/humankind-review-culture-war/1900-6417720/", "date": "August 25, 2021", "game_name": "Humankind", "text": "Ambitious in the scope and meticulous in the detail of its genre reinvention, Humankind is a 4X strategy game that steps out from the shadow of Sid Meier's Civilization series. In parts, it does so boldly, both confident that probing questions were asked of the most tired genre assumptions and ready to respond with enlightening answers. But oftentimes it feels ill-prepared for the task at hand, and for all its spirited enthusiasm, Humankind struggles for coherence.Departing furthest from 4X tradition is the way in which you're able to alter your empire's abilities over the course of the game rather than having them defined by a selection at the outset. Typically, in a Civ-style 4X, when you opt to play as Cleopatra, you'll be the Egyptians for the whole game, with her handful of leader abilities set in stone and providing the same bonuses whether you're in the Classical or Industrial Age. Similarly, when you encounter Teddy Roosevelt leading the neighbouring American empire, you know what to expect. It makes for a consistent, readable experience.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: HUMANKIND - Gameplay Overview TrailerIn Humankind, you choose a generic, blank slate leader at the start of a new game. Then, as your empire advances from one historical era to the next, you are able to pick a new culture to adopt for that era. So you might choose to be the Egyptians in the Ancient Era, switch to the Romans for the Classical Era, then the Khmer, the Ottomans, and so on. Cultures come with abilities that emphasise different play styles, allowing you a deal of flexibility to change tack mid-game as new circumstances arise. They also carry over certain legacy bonuses so that the effects of your previous cultural choices are still felt in later eras.In a thematic sense, this sort of dynamic, evolving perspective on culture is a success. It has always been one of the absurdities of Civilization that when you play as Rome you're going to be just as keen to build baths in the 21st century as you were in 300 B.C.--not to mention the rather more awkward fiction of playing as a much younger, post-colonial nation such as Australia. Humankind recognises that cultural traits aren't immutable; societies aren't monolithic. The analogy of a cultural melting pot is trite, but the way that your empire will have drawn together a range of different cultures by the end of the game is a better approximation of how diverse people make up a society than most strategy games manage.On a mechanical level, it's less of a clear triumph. The chief benefit of being able to essentially reroll your empire's abilities every time you pick a new culture is that it equips you to more capably adapt to new information. Settle your capital city along a mountain range and it might make sense to play as the Zhou through the Ancient Era to take advantage of the science bonuses they gain from mountain tiles. But if the terrain beyond your capital is flatter and thus less compatible with the Zhou, instead of missing out, you can pick a different culture in the next era--one that better exploits the land you're about to expand into. This works brilliantly, giving you time to read the lay of the land then empowering you to make smart strategic decisions about how to proceed. And the first few eras feel perfectly synchronised with your expanding empire--in most games I played, I was usually able to build my first culture's unique district in four or five cities before advancing to the next era. After thinking about which culture was going to best suit my next handful of settlements, I'd then be able to build that culture's unique district in all eight or 10 cities before advancing to the next era. It feels well-paced in that regard.But there are significant drawbacks to this innovative culture system. For a start, it's confusing. Not so much for your own empire--though I frequently found myself forgetting which specific culture I was playing as at any given moment--but when it comes to your opponents, it's really difficult to keep track of who you're up against when they keep switching from one culture to another. Other empires are named only for their current culture, so if you've been negotiating with the Hittites in one era, when they return with another diplomatic deal in the next era, they'll be called something else. New messages pop up every turn, informing you that the Celts or the Mayans have done this or that, and nearly as often I was left wondering ~Hang on, which ones are the Celts again? Are they the ones that used to be the Nubians and we were friends? Or were they the Babylonians and they were really annoying?~Exacerbating this issue is one of the least helpful parts of Humankind's user-interface, specifically the row of icons in the top left corner representing the other empires throughout the world. They're different colours--blue, brown, orange, maybe a sickly green--and they contain symbols of different animals--a bear, some sort of bird, maybe the one with the horns is a goat, I'm not sure. You click on these icons to start diplomacy with that empire. But none of the icons tell you which empire they are. Even when you mouse-over them, the tooltip that appears merely reports things like ~Both empires are at peace.~ Empires, plural. Your empire is one of them, but who is the other one? It's already difficult to keep track of who you're up against since the AI empires, like yourself, are switching every era.Humankind's various empires aren't merely confusing to follow, they also aren't memorably distinct. There are 60 cultures spread across the six eras, which feels like a lot even before you consider the millions of possible combinations in the melting pot. And they all have their own unit, district, and legacy trait providing distinct bonuses. But they're not all that distinct, and in general the differences are not all that interesting. Picking your new culture is mostly a decision over which of the four main resources (food, industry, money, science) you want to focus on in the era ahead. It's a meaningful choice in the sense that you'll notice the difference in the amount of each resource you're accumulating, but it's a pretty boring choice--and one that doesn't do much to alter the way you play. Moving from one era to the next, it's a disappointing case of minor adjustments, of building that district on this tile instead of the next one over, or of having a slightly more powerful ranged unit instead of a slightly more powerful melee unit, rather than any drastic rethink in your approach. There are balance issues, too, with some cultures feeling decidedly weak and others significantly overpowered, which can lead to frustration when you arrive late to a new era and the AI has already taken the culture you wanted.On the whole, though, the early game at least is full of interesting decisions. The Neolithic Era has you playing as a nomadic tribe, hunting deer and gathering berries as you scout the land ahead of founding your first city. With this welcome period of exploration, you're able to make an informed choice over where to settle your capital. Then, as the early expansion phase continues through the first few eras, you can spend Influence to create outposts or spend more to turn an outpost into a proper city. You can attach outposts to a city to combine their resources and later even merge cities into mega-cities all sprawled out across the map. There's a delicate push and pull here between claiming new lands or investing in development, a tug-of-war that's complicated in rewarding fashion by a number of intertwining resource constraints.When it comes to interacting with other empires, Humankind allows for a certain degree of ambiguity in your first tentative steps into diplomacy. I really like how you can engage another empire's units in combat while in neutral territory and not have it automatically lead to all out war. You can just skirmish, pushing back on your opponent's scouts in an effort to prevent them from creating outposts in lands you've got your eyes on. This sort of behaviour can eventually lead to war, if you keep doing it and the AI starts demanding you stop, but it's neat that there's a bit of leeway there for, shall we say, a few early misunderstandings.Like a lot of other 4X games, however, Humankind becomes less interesting as you move through the mid-game and into the end-game. Once the map is pretty much settled, subsequent shifts in territorial borders occur only as a result of war or diplomatic exchange. Accumulating enough influence over another empire to be in a position to demand they give you one of their cities is a pretty hands-off operation; it just sort of ticks away in the background and can be beneficial when you get the opportunity, but it's not something I ever felt able to build a strategy around. War, meanwhile, is way more hands-on and is even more of a tedious slog here than in most 4X games. And that's because of Humankind's annoying tactical combat system.When units engage each other, a small section of the surrounding map is cordoned off for the battle. It's like a teeny-tiny XCOM, with units taking turns to move and attack, elevation and other terrain elements to consider, and the possibility of nearby units entering the fight as reinforcements. Basic tactics are all that's required as long as you've brought enough units. The problem isn't that the tactical combat is bad--it's perfectly functional, if quite simplistic--it's that it takes up so much time. Every fight drags on way longer than it should, and you have to fight them because the auto-resolve has a terrible habit of losing fights it ought to win. Any substantial war campaign turns into a drawn out procession of tedious battles. Worse, it's a genuine disincentive to explore the military side of the game.Humankind recognises that cultural traits aren't immutable; societies aren't monolithic. The analogy of a cultural melting pot is trite, but the way that your empire will have drawn together a range of different cultures by the end of the game is a better approximation of how diverse people make up a society than most strategy games manageHumankind feels drawn out in other areas. Inside your cities, there's a lot of stuff to build, and a lot of it starts to feel very samey. In the Ancient Era alone, there are four different things to build to improve your food production. On the military side, one building boosts unit production, another building gives units an XP bonus, while a third increases their combat strength. Then there's a whole other group of military buildings that provide varying fortifications and vision range bonuses. For every resource there's a bewildering number of ways to improve its collection, each offering a slightly different method but very likely similar results. It's too much. The initial sensation of feeling overwhelmed subsides as you learn what each building does, and is replaced by a weary resignation that the differences between them don't amount to a lot.Inside Humankind's urban planning system, there's the foundation of a solid city-builder. Laying down districts expands the tiles you're able to exploit and there are a bunch of neat adjacency bonuses being calculated, giving the impression of a puzzle-esque quality to planning inside your territory. It helps to no end that the map looks lovely, a beautiful pristine landmass just begging to have farms and holy sites plonked down in just the right spots. But aside from a few wonders (the Hanging Gardens of Babylon always looks great) and the odd unique district, most of what you can build in your cities looks pretty ugly, and by the end of the game every city I built consisted almost entirely of generic urban sprawl. At the same time, the tinkering to be done around adjacency just fizzles out when most districts only gain bonuses when placed next to districts of the same type.In contrast to the building bloat, the religious system is undernourished. Religion spreads from city to city passively, as you accumulate Faith through the construction of certain holy buildings. Hitting certain follower thresholds lets you pick tenets to add bonuses--extra production on forest tiles, extra gold on luxury resources, that sort of thing. And that's it. You may not even notice you have a religion, its effect is so subtle.From the faint outlines of religion to the background hum of influence, from the awkward city-building to the cumbersome tactical combat, all wrapped up in a cultural system that struggles to imprint a strong identity on your empire, Humankind strains under the weight of too many complex systems that too often find themselves colliding rather than coalescing. By turns disjointed and confounding, Humankind is nonetheless fascinating, at least to this experienced 4X strategy player, even if I couldn't say I truly enjoyed it."}