{"ref": "https://www.gamespot.com/reviews/wild-arms-4-review/1900-6142179/", "date": "May 17, 2006", "game_name": "Wild Arms 4", "text": "The Wild Arms series occupies that ~cult~ niche inhabited by all those turn-based games that aren't Final Fantasy, setting itself apart with elements of the old West like its sweeping frontier landscapes. It's a bit surprising, therefore, that Wild Arms 4 only lightly touches on the traditional Western themes of its predecessors, and instead favors a more futuristic world that's been thoroughly exhausted by war. In fact, while elements of the Wild Arms universe are still very much in effect--action and puzzle-solving in dungeons, mysterious drifters for hire, and the ARMS themselves--this installment of the series is a bit more adventuresome. The latest iteration of Filgaia has a somber feel to it, and an all-new hex-based battle system and character skills are good twists that are neat to play with. Wild Arms 4 adheres pretty closely to RPG convention, but it is still definitely worth a look for fans both old and new. Hey Jude! Jude Maverick might be any normal teenage boy, skipping his classes to traipse about in the forest. Only the forest in this case is in a hidden construct that's hovering stealthily over the ocean of a larger world. Jude finds all this out when he accidentally activates an ARM (a gun that binds itself to the boy through gene fusion) and loses control, blasting a hole in the machine that stabilizes the only world he's ever known. The planet Filgaia awaits outside, and it's a pretty sorry sight. Largely barren of settlements, and dotted with ruins and rusting tanks, both Filgaia and its people are a wreck after a war decimated the environment and the populace. Jude journeys with Yulie, a soft-spoken and traumatized girl with mysterious powers who he swears to protect; Arnaud, a cowardly drifter with a sharp mind and a talent for magic; and Raquel, a young swordswoman who crosses the globe looking for items of beauty. This group is fleeing the soldiers of Filgaia's current ruling democracy, who have spent years attempting to genetically engineer orphans into ARMs-wielding weapons. Yulie is one of the democracy's pet projects, and they want her back. Their travels take them all over the varied lands of Filgaia, its scattered and struggling human settlements, and through its many ruins and military installations. Whereas other games in the series incorporated something of a fantasy feel to go along with all the technology, the world of Wild Arms 4 is built on war machines, genetic tampering, and the scars of fresh destruction. It's a solemn place that's obviously on the brink of total collapse, and as you journey through the world you'll strongly get the impression that this is a planet that needs saving. And since the democratically elected leaders are only pushing humanity deeper into a hole in their efforts to acquire an ultimate weapon, it's up to you to set things right. It's a fairly standard storyline that still manages to be compelling, thanks to a setting that lets you really empathize with the poor masses who are eking out a living. The world itself isn't all ruins and dust, either. There's a nice variety of places to visit, from lava caves to snowy mountain slopes, abandoned medical facilities and underwater tunnels, a city with its fabled cathedral turned into a monster arena, a military prison, a space-time distortion, and more. There's good detail in most areas, though sometimes the fixed camera doesn't let you see as much as you'd like. The characters themselves are bright and well designed, with a strong anime aesthetic. Battle animations have their most impressive showing in Yulie's monster summons, though there are a number of really good-looking attacks, as well. The battle system makes you think as you fight--and when you're dealing with multiple random encounters, that's always a good thing. The hex-based battle system is new to the series, with seven hexes on the battlefield occupied either by party members or enemies. Each hex can hold one or multiple enemies, depending on their size, and a single hex can hold either one or up to all four of your party members, as well. The system adds some strategy to fights, and it starts with simple positioning. Each battle begins with friends and foes randomly scattered across the hexes, and you can only melee monsters in the hex closest to you. Depending which hex a character stands in, you can flank your enemies, or be flanked in turn, so you'll need to be careful not to expose your characters to multiple assailants at once. The other part of the strategy is introduced via the ley points: three hexes on the outer rim of the battle zone that are imbued with three of four random elemental properties--fire, water, earth, and wind. For example, you can stand in a fire hex and have fire attacks halved, or you can use Arnaud's blast magic in a water hex to drench monsters. Where exactly you stand easily ends up being as important as what skills you choose to use. There are many skills in the game, from passive abilities with a chance to trigger during combat, to active abilities that'll cost you magic points to use, to force abilities that use force points. You'll fill up the force meter during battle as you give and take damage, and it lets you use skills like Raquel's Intrude, which lets her attack twice in a single turn. Some of the skills affect enemies in multiple hexes, some are strong focus attacks, and there are a number of skills you can use on the hexes themselves. You can do things like poison a hex and then lock it so those enemies can't move to another hex, forcing them to take the poison damage. The amount of skills and options you have can make fights quite satisfying. And while you'll quickly get very powerful options at your disposal, enemies still pack a wallop, so it's not a total cakewalk. You can even learn combination attacks that use force power to let multiple characters attack at once. Coupling Arnaud's hex-control skills with strong attack abilities from other characters can quickly turn the tide of battle. The one thing that can get irritating with fights is that each character earns experience multipliers based on the damage they do during fights, as well as bonuses for killing foes. While there are a variety of monsters in the game that have various vulnerabilities to exploit, often you'll find one character or another unintentionally power-leveling at the expense of others. In particular, Yulie can lag behind unless you use her overkill monster summons to be sure she kills everything on the screen. Characters also take a lot of damage from almost everything, so it's easy to let someone die and then have him or her go without getting experience. Dungeon sequences involve a fair amount of puzzle-solving, jumping around, picking up items to use as tools (individual character tools have been done away with), and using an ability called Accelerator to (ironically) slow down time. The puzzle-solving isn't the strongest part of the game, as the creators are fond of having you backtrack while slowly carrying heavy items across dungeons to complete tasks. There are also a number of jumping puzzles and such that can get frustrating with the fixed camera. The one nice addition to dungeons is the introduction of encounter breaks at certain save points. While save points usually have a glowing gem at the top, certain save points are dimmed, and you have the option to perform a ~break~ on it. This usually summons a group of strong monsters, and as soon as you defeat them, the gem is unlocked. You can then toggle encounters on and off by simply pressing the R2 button. You can't do it everywhere, but it's a nice concession to the fact that sometimes you just want to get somewhere and not have to stab 20 imps along the way. The day there isn't melancholy whistling in a Wild Arms soundtrack is the day the series dies for good. The Wild Arms feel is retained in the soundtrack, which features the usual complement of whistling tunes, as well as some peppy numbers for dungeons and towns, and it all sounds really nice. The voice work in Wild Arms is largely uneven, and there's quite a bit of it, in cutscenes, in certain conversations, and in snippets during battle. The delivery is rarely totally awful, but it meanders between acceptable, flat, and awkward, even on the same characters. It can be a little distracting at times, particularly on monsters, who sometimes bark out the most random things while fighting or as they're being defeated. Overall, though, the sound is solid. The battle system is definitely the best innovation Wild Arms 4 has to offer, and while a lot of the series' fixtures got updated or removed in this title, fans of the games will still feel right at home. For RPG junkies who haven't played a Wild Arms game before, it's worth a glance, as it offers up a nice, if not revolutionary, adventure to undertake. Wild Arms 4 manages to breathe some new life into a series that seemed on the wane, and it largely succeeds at crafting an enjoyable experience. There are many skills in the game, from passive abilities with a chance to trigger during combat, to active abilities that'll cost you magic points to use, to force abilities that use force points. You'll fill up the force meter during battle as you give and take damage, and it lets you use skills like Raquel's Intrude, which lets her attack twice in a single turn. Some of the skills affect enemies in multiple hexes, some are strong focus attacks, and there are a number of skills you can use on the hexes themselves. You can do things like poison a hex and then lock it so those enemies can't move to another hex, forcing them to take the poison damage. The amount of skills and options you have can make fights quite satisfying. And while you'll quickly get very powerful options at your disposal, enemies still pack a wallop, so it's not a total cakewalk. You can even learn combination attacks that use force power to let multiple characters attack at once. Coupling Arnaud's hex-control skills with strong attack abilities from other characters can quickly turn the tide of battle. The one thing that can get irritating with fights is that each character earns experience multipliers based on the damage they do during fights, as well as bonuses for killing foes. While there are a variety of monsters in the game that have various vulnerabilities to exploit, often you'll find one character or another unintentionally power-leveling at the expense of others. In particular, Yulie can lag behind unless you use her overkill monster summons to be sure she kills everything on the screen. Characters also take a lot of damage from almost everything, so it's easy to let someone die and then have him or her go without getting experience. Dungeon sequences involve a fair amount of puzzle-solving, jumping around, picking up items to use as tools (individual character tools have been done away with), and using an ability called Accelerator to (ironically) slow down time. The puzzle-solving isn't the strongest part of the game, as the creators are fond of having you backtrack while slowly carrying heavy items across dungeons to complete tasks. There are also a number of jumping puzzles and such that can get frustrating with the fixed camera. The one nice addition to dungeons is the introduction of encounter breaks at certain save points. While save points usually have a glowing gem at the top, certain save points are dimmed, and you have the option to perform a ~break~ on it. This usually summons a group of strong monsters, and as soon as you defeat them, the gem is unlocked. You can then toggle encounters on and off by simply pressing the R2 button. You can't do it everywhere, but it's a nice concession to the fact that sometimes you just want to get somewhere and not have to stab 20 imps along the way. The day there isn't melancholy whistling in a Wild Arms soundtrack is the day the series dies for good. The Wild Arms feel is retained in the soundtrack, which features the usual complement of whistling tunes, as well as some peppy numbers for dungeons and towns, and it all sounds really nice. The voice work in Wild Arms is largely uneven, and there's quite a bit of it, in cutscenes, in certain conversations, and in snippets during battle. The delivery is rarely totally awful, but it meanders between acceptable, flat, and awkward, even on the same characters. It can be a little distracting at times, particularly on monsters, who sometimes bark out the most random things while fighting or as they're being defeated. Overall, though, the sound is solid. The battle system is definitely the best innovation Wild Arms 4 has to offer, and while a lot of the series' fixtures got updated or removed in this title, fans of the games will still feel right at home. For RPG junkies who haven't played a Wild Arms game before, it's worth a glance, as it offers up a nice, if not revolutionary, adventure to undertake. Wild Arms 4 manages to breathe some new life into a series that seemed on the wane, and it largely succeeds at crafting an enjoyable experience."}