{"ref": "https://www.gamespot.com/reviews/into-the-stars-review/1900-6416398/", "date": "April 5, 2016", "game_name": "Into the Stars", "text": "I never could have guessed flying past that moon would have had such dire consequences. The Skorn were hot on my trail, and if I didn't hightail it out of there, I would have been attacked by two of their drones. Considering my ace engineer was out of commission, I wasn't about to let that happen. There was some hope: I could see the glimmer of a planet in the distance. I was running out of food and oxygen, but if I could survive long enough to reach the planet, I could restock my supplies and continue my journey towards my new home--humanity's newest colony. My chances were slim, but I made it to the planet on my last leg. A rush of relief washed over me. And then I discovered the planet had zero resources.Moments like these are the best parts of Into the Stars, the new space Roguelite from Fugitive Games. I left that planet with no food or oxygen and the civilian population aboard my ship was slowly suffocating and starving to death. All I could do was pray that a random planet would gift me what I needed to keep them alive. And it was looking like I was going to survive by the skin of my teeth, until I got ambushed.Into the Stars is practically Battlestar Galactica in game form, minus the paranoia over who is and isn't an imposter. An alien menace, the Skorn, has wiped out Earth, and humanity is doing its best to pick up the pieces and move on. You pilot an ark vessel containing the remaining survivors, flying from star system to star system, picking up fuel and other resources that are necessary to complete the journey. You have to outrun the Skorn along the way, outmanned and outgunned, and worst of all, they aren't the only threat you face.Your ship holds a limited amount of resources, but you burn through them almost as quick as you find them. Not every planet has every resource, so you're forced to decide if it's worth the risk to blindly mine a planet when passengers are suffocating, or accept the loss of life and just hope to make it to another, more fruitful planet further down the line.And all the while, you're fleeing through a gorgeously detailed portion of the galaxy. Although Into the Stars features Roguelite gameplay elements such as randomized rewards for shuttle missions on planets and new crews for each playthrough, there is only one actual map. The first planet you encounter is surrounded by a ring of asteroids, and between the grand draw distance and the detailed and varied architecture of these extra-planetary bodies, Into the Stars rewards your inner space tourist--provided you have the luxury of stopping for a moment to appreciate the view.But Into the Stars' single map eventually makes the game feel repetitive. There are moments in early playthroughs where you may find yourself without a planet in sight and you have to fly off into the dark unknown, hoping to find something before your supplies run out. And the first time you do that, it's genuinely stressful. But in later playthroughs, you know where all the planets are and that feeling of exploring the unknown quickly diminishes.The length of individual ~campaigns~ in Into the Stars is another aspect that subverts the game's better qualities. You have six crew members on your ship to begin with; you can replace crew that are killed, but you can never have more than six. And there are a host of ways to get your crew hurt beyond combat. One of the key ways that you upgrade your ship is by completing shuttle missions, which reward you with modules that upgrade your weaponry or halve the amount of hydrogen you use for fuel. With shuttle missions come potential injuries. You're given a percentage that reflects the possibility of success for all missions, and there's nothing worse than losing an hour of time because your crew failed two activities that had high percentages of success, leaving you without a pilot, commander, or medic. While I didn't sit down and map out a spread of how these missions played out and their stated stats, it's been a long time since I've played a game where the RNG gods punished me with such abandon.You remember these characters and their stories, and you don't want to see anything happen to them.Into the Stars does, however, put in the work of making you care about your fragile, unlucky crew. Representing a diverse array of genders and races, your crew members start to feel like a functioning unit of individuals. There's just enough flavor text to make them stand out--I had a former clergyman who became my top miner, a journalist who became an ace medic. You remember these characters and their stories, and you don't want to see anything happen to them.In addition to the aforementioned potential causes of death, there's always the chance you will die during combat against the Skorn, although it's unlikely unless you're unreasonably outnumbered. Combat involves placing four members of your crew at battle stations, activating deflector shields, and firing lasers and torpedoes to attack the enemy. There's an element of color coordination involved in combat: you defend yourself by making your shields the color of your enemies attacks, and they can do the same.It's all too easy to dodge and block attacks when facing a single opponent. Two Skorn patrols represent a deeper challenge, one that requires a careful consideration of when to use your shields, when to evade, and when to attack. It's still manageable, but you know you will get hit on occasion. But then you have the moments where you're fighting three enemies at once, force to contend with an unmanageable blitzkrieg.When Into the Stars hits its stride and you feel like Admiral Adama leading a desperate race to save humanity, it's a tense and rewarding thrill. Unfortunately, combat never matches the tension of survival, as the cruelty of the game's RNG system can bring your breakneck race to the finish line to a screeching halt."}