{"ref": "https://www.gamespot.com/reviews/oblitus-review/1900-6416040/", "date": "February 27, 2015", "game_name": "Oblitus", "text": "Parvus, from the Latin for ~little,~ is such an apt name for the hero of Oblitus. He spends his waking hours tossing sticks at beasties the size of small buildings, and his jaunts take him among household items such as pots and jars that are so comically oversized he might as well be walking through a Claes Oldenburg exhibit. It's possible, too, to read a bit of self-deprecation on the part of one-man development team Connor Ullmann, who's been saying for two years now that his little 2D sidescrolling rogue owes heavy debts to Dark Souls. Parvus' journey is fraught with failures, restarts, and seemingly insurmountable challenges. Thus, his journey echoes the creative trials of a developer who knows he has massive boots to fill.Generally, Oblitus succeeds, in spirit if not in presentation. The influence of Dark Souls doesn't beat you over the head as it did in last year's Lords of the Fallen; instead, it reveals itself in subtler ways, such as how the reason behind our masked hero's existence reveals itself chiefly through gameplay rather than storytelling. You see it when poor Parvus can't sustain more than a few blows before the words ~You Have Died~ fill the screen and reset your progress, or how darkness and shadows cover so much of Parvus' world. It's a beautiful world, and while Oblitus opts for an attractive hand-painted aesthetic that evokes a gritty reboot of Castle Crashers, it's possible to catch echoes of Blighttown and Darkroot Garden reverberating throughout its interiors and forested paths.The nods to Souls carry over to the combat, with the key difference that this is a fast-paced game that better resembles Mega Man or more contemporary platformers like Outland. It's intuitive stuff, for the most part, and a quick prompt when the game first boots up bidding you to mirror the action keys for either a gamepad or keyboard serves as all the tutorial you need. There's a sense, though, that Ullmann tried too zealously to Souls-ify his game. Parvus can parry and block with his shield by activating the left bumper and trigger of a gamepad, for instance, but the option never feels anywhere as useful as his ability to roll through most adversaries, swatting them with his trusty wooden spear before rolling swiftly to the other side.Small collision issues complicate the matter because it's not always clear if our little warrior can block an attack at a particular angle or even if his jabs will hit. Parvus is thus much more effective when fighting on the move, jumping Mario-style over lumbering bog monsters and lizard men rather than staring them down behind a shield or using the option to throw Parvus' spear across the map (and suffering a slight respawn delay for the privilege). Oblitus' very design tends to confirm this bias, as the combat upgrades Parvus picks up focus far more on options such as gaining invincibility while rolling and jumping higher than on employing our little hero's rickety shield.In less capable hands, such challenges might be overcome by simply memorizing where Oblitus' monsters enter and exit, and recalling precisely when to make various jumps. But this is Oblitus, a name that means forgotten. Ullmann's game escapes such predictability through the roguelike elements of its gameplay, which shakes up the locations and types of upgrades, health renewal boosts, and even a few of the enemies after each death to ensure that each playthrough differs from another. Even the map itself isn't entirely safe, as elements such as corridors and platforms sometimes subtly extend to make room for more foes. The upshot is that each of Parvus' forays into his strange world is fraught with an exciting urgency that's absent in 2D games relying on extra lives and self-sacrifice for the sake of experimentation. When you risk losing everything, Oblitus says, everything starts to count.That's a lot of abuse to hurl at players, particularly when it also means that some playthroughs will inevitably be easier than others. However, Oblitus keeps it manageable with zones that feel just large enough to deliver a satisfying sense of exploration while remaining compact enough to keep replays worthwhile. (There's even an achievement for beating the game within 25 minutes.) Elsewhere, enemies deaths reward you with a near-imperceptible bit of replenished health. The handful of bosses, while massive enough to take up huge chunks of the screen, usually require simple (although sometimes not immediately obvious) strategies that assuage the pain of repetition in the case of almost certain failure. It's like the kid on the playground who's just mean enough to start scuffles with you but is never quite unbearable enough to drive you away. Indeed, my main complaint throughout had little to do with the moment-to-moment gameplay but rather with the way the world is filled with too many surfaces that look like they should be walkable but aren't. Ullmann does his game a bit of a disservice by so vocally trumpeting the influence of Dark Souls; this is something different and attractively brutal, although its component elements are familiar enough to make it accessible to almost everyone. (And if the considerable appeal of Volgarr the Viking proves anything, it's that publisher Adult Swim has a soft spot for punishing platformers.)But there's plenty of pleasure in this pain, and it reveals itself in not only the richly imagined bosses and enemies but also Josh Whelchel's haunting soundtrack, which fares just as well off the screen as it does when Parvus is busy stabbing creatures of the dark. If you're up for some pretty punishment, Oblitus provides an experience that you won't soon forget."}