{"ref": "https://www.gamespot.com/reviews/deathtrap-review/1900-6416022/", "date": "March 12, 2015", "game_name": "World of Van Helsing: Deathtrap", "text": "Deathtrap is one of those genre mash-ups that make you wonder why we haven't seen more of them in recent years, and it's almost a foregone conclusion that we're going to see a lot more of them, and soon. It's an absorbing tower defense game mashed up with a dark, gothic, top-down action role-playing game, and it's just as fun as both.The setup is simple. You play as a magic-spamming sorceress, a melee-fighting warrior, or a stealthy gunslinger who must stop waves of snarling demons from reaching a portal on your side of the isometric-perspective stage and thus getting out of their realm and into ours. You do have plain-Jane Diablo-style attacks and a few area-clearing special attacks later on, but they can only do so much damage before the enemies run past you. Your one ace in the hole against the never-ending horde is the ability to activate long-dormant magical traps in the environment along the demons' pre-set route, which can be anything from simple gun turrets and floor spikes to towers that shoot lightning at random intervals, acid pools, and portals that generate little snarling beasts of your own that turn into little snarling suicide bombers that explode when they reach the nearest enemy. Victory means putting together a sadistic Rube Goldberg conveyor belt of doom through which no demon can pass and, if they do, walking in yourself to try to finish the job. Deathtrap is, technically, a spin-off of developer Neocore Games's Incredible Adventures of Van Helsing games, liberally retooling the tower defense mode from the first game in the series. The story does link up, but despite some snippets of backstory thrust upon the player when selecting a stage, it's not necessary to jump right into the fray. What you do end up needing is some instructions, and while the tutorial pop-ups will give you a 10-cent tour of the interface, figuring out the game's flow requires plenty of trial and error. It's not necessarily a bad thing. Most of the game is easy enough to figure out for anyone who's played a game in either genre, with one button for regular attacks, one for a powerful magic attack, and traps costing Essence, and special points that regenerate after each wave and any time you kill an enemy. There's a tiny frustration where, often, your best vantage point is a few feet away from the action, and clicking the left mouse at the wrong place and the wrong time will send your character into a 30-monster murder pit from which there's no escape. Nevertheless, you do learn to compensate, and there are RPGs with far worse navigation problems than an overly sensitive playing field. It's still the best of both of its worlds. This structure fixes the tower defense problem of having to wait around for your enemies to come to you before the action begins by letting you get yourself right into the thick of it, and any moment of overwhelming odds can be fixed by letting your death machines do the dirty work.The first few stages do go pretty easy on you until you get your first new traps, and the steady escalation of difficulty is good. Much of the leveling-up and character advancement is contingent on what feels comfortable for the player. How you end up killing baddies will determine what upgrades and new traps you get access to. If your boots are on the ground doing more killing than your traps, you'll get access to powers that make enemies more vulnerable to your melee attacks. Use a particular trap that summons a vicious hell beast to fight anything that walks past? Kill enough baddies with him, and you'll get the ability to summon a group of archers to fight at long range. There's a pretty extensive number of upgrades to earn, and the game hits the sweet spot of doling out just enough experience and skill points after matches to feel like you've earned them, without being able to run completely roughshod over the game. There's also a plain old RPG store where you can buy armor, weapons, and accessories, as well as a compulsory crafting system that was used all of once in my playthrough and then ignored. Still, there's no lack of options for players to get their gameplay just how they like it.Problematically, Deathtrap runs out of content the second it really starts to take off. It happens around the fifth or sixth stage, which is the point at which the game seems to run out of new enemies to throw at you and just starts giving the older, bigger ones more HP. Completing the 13th and final stage after a couple of hours of play earns you nothing, unless you count the unlocking of five specialized scenario maps. Deathtrap's roots as an overblown minigame show here. There are a few twists that you can use to try to keep the stages fresh. Getting to level 15 opens up the Scenario mode, which allows you to put new restrictions on each stage (e.g., less Essence regeneration in exchange for more gold/XP at the end), and the Endless mode, which is a non-stop survival mode where Essence is shorter in supply and the monsters are greater in number. There's a level editor that might yield some quality if the game takes off, as well as multiplayer co-op and versus modes, all of which are fun, but it still has you replaying the same stages over and over. There's no fanfare or reward for beating the stages as they currently are, just the pressing urge to earn more XP and open up the level-20 traps.The good news is that Deathtrap is compelling enough that loading it up once in a blue moon to explode some monsters could end up being extremely appealing and fun. It's a nifty little time-waster that Neocore's created here, and while there could and should be a lot more content in the future, the game we've got right now nonetheless makes a convincing bid for your time."}