{"ref": "https://www.gamespot.com/reviews/thunder-force-v-review/1900-2549751/", "date": "May 2, 2000", "game_name": "Thunder Force V", "text": "Originally released in Japan last year for the Sega Saturn, Thunder Force V was the latest installment in Technosoft's legendary series of shooters. While American Saturn owners watched helplessly as SOA passed on yet another highly desired piece of software, it came as no surprise to find that Technosoft was in the process of porting it to the PlayStation. Working Designs quickly saw an opportunity where others had not and subsequently announced it was bringing Thunder Force V to the States via its Spaz label.So, fans of shooters gather round and behold the first episode of Thunder Force rendered in semi-3D glory. As with all previous Thunder Force games, you control your ship from the left side of the screen and proceed to dish out punishment on the endless waves of antagonists who swarm in from the right. Helping you avoid these nasty predators are analog control and the ability to alter your ship's speed from 50-100 percent. Along the way you pick up a large variety of weapons and power-ups from amongst the remains of the recently dispatched. Twin shots, hunter shots, wave, and other exotic weapons are available for the taking, which when powered up with floating energy balls called craw, can be triggered to unleash a massive attack, whose power level depends on the amount of craw obtained at the time. Usually these super attacks are reserved for the huge bosses that await at the end of each level.Considering that little tweaking was necessary to improve the relatively basic gameplay, Technosoft was able to concentrate on the visuals. Although the game plays in 2D, like any decent shooter worth its salt these days, it incorporates 3D details and polygonal enemies and bosses. During introductory sequences, the camera will pan 360 degrees, but that's about it. For any real 3D action you'll need to wait until the bosses to see some polygonal power. As far as additions to the PlayStation version go, a couple of extra levels have been added to bolster what was once a relatively short game. Some nicely done CG sequences were also included to make this a very complete package. Other small but welcome details that were included are a digital viewer, which lets you look at hi-res artwork rendered for the game, and a time attack mode, although it's up for discussion why anyone would want to play a time attack in a side-scrolling shooter.The difference between the Saturn version and the PlayStation version of Thunder Force V, aside from the extra levels and stuff, are few but worth mentioning. Perhaps, due to the ease of rendering 3D on the PlayStation, there is very little slowdown, something that could be found (in small but noticeable amounts) during boss encounters on the Saturn version. The sound effects also seem much clearer on Sony's gray box for some reason. Although the graphics and textures appear a little bit sharper on the Saturn, there's no need for alarm as the two are almost identical to each other. Perhaps the only negative thing about the game is that it's basically the same as any other shooter when you really get down to it. Despite the eye candy and extra window dressing, this is still just a shooter. That having been said, it should be noted that it's an excellent shooter.For Thunderforce fans who own a PlayStation, this is a coup. Not only do you get a technically superior version of Thunder Force V, you get it with all the extra bells and whistles too, providing considerable value and excellent gameplay. Spaz/Working Designs has once again catered to the fans and brought over a perennial fan-favorite. Easily as good as Raystorm or G-Darius and tough competition for Einhander, Thunder Force V is a shooting fan's dream."}