{"ref": "https://www.gamespot.com/reviews/mat-hoffmans-pro-bmx-2-review/1900-2877894/", "date": "May 17, 2006", "game_name": "Mat Hoffman's Pro BMX 2", "text": "Every year, Activision puts developer HotGen Studios to work on another iteration of the Mat Hoffman's Pro BMX franchise. And every year, the game keeps getting better and better. The latest version, Mat Hoffman's Pro BMX 2 for the Game Boy Advance, improves upon the previous release in every conceivable way. The primary focus of this latest edition is its road trip mode, which is similar to the career mode found in most alternative sports games. Each of the eight included parks has nine different challenges for you to attempt, and you're awarded points for each successful completion. Most tasks are what you'd expect from this type of game--the standard assortment of high-score challenges and scavenger hunts--but there are a number of clever exceptions. For example, some courses have gates or barricades that you can unlock in order to access new zones. In general, the courses in Mat Hoffman's Pro BMX 2 are larger and more diverse than those of its predecessor. Even before you unlock the secret areas that are hidden within each park, there are still many out-of-the-way rooftops and paths to explore. Likewise, the level of interactivity is greater with this latest installment. Each course has a number of vehicles and fixtures that you can activate in order to cause a variety of disturbances both big and small. Along with this increase in scope come visuals and audio that are significantly improved over the previous installment. Park structures are crisp and well defined, and there is a lot of movement in the many signs and fountains that populate each level. Riders are fairly realistic as well and possess a huge number of animations for even the most mundane of tasks. There are still plenty of digitized sound and voice effects to accompany the onscreen action, but the music is much louder and more energetic this time around. The soundtrack isn't quite as nice as that of Tony Hawk's Pro Skater 3, but it's nonetheless appropriate. Mostly though, Mat Hoffman's Pro BMX 2 is just really fun to play. Last year's edition had plenty of tricks, but it was in sore need of transitional moves such as turns and slides. Now, not only are there turns and powerslides, but there are also tire taps, stalls, plants, and a vast number of fakie (backward) tricks. Unfortunately, the controls are more complex as a result. To successfully perform manuals and special tricks, you'll have to hold the L and R buttons while keying in a variety of button combinations with the D-pad and the A and B buttons. The learning curve is a small price to pay, however, because it's now possible to perform trick combinations that cycle back and forth down the entire length of a course. In addition to the road trip mode, there are two other single-player options. A single session mode lets you ride for two minutes in an attempt to best your high score, while a free ride mode lets you goof off to your heart's content in any of the courses you've unlocked. Mat Hoffman's Pro BMX 2 also includes a number of multiplayer modes. By taking turns on a single system or linking together two systems with a link cable, you and a friend can participate in competitions to see who can get the highest score, perform the most unique tricks, perform the most specials, or execute the longest combo. Even if you bought last year's edition, there is still so much new and refreshing in Mat Hoffman's Pro BMX 2 that it feels like it's an entirely brand-new game."}