{"ref": "https://www.gamespot.com/reviews/samurai-shodown-v-review/1900-6143066/", "date": "January 25, 2006", "game_name": "Samurai Shodown V", "text": "Before there was Soul Calibur, there was Samurai Shodown. SNK's weapon-based fighting game series has always featured fantastic character design, unique play mechanics, and lots of personality, though many fans agree that the series hit its peak with 1993's Samurai Shodown II. Nevertheless, the series carried on, and one of its latest installments is now available for the Xbox, complete with online support so that you can take on those other 2D fighting fans out there. Samurai Shodown V's uneven, bare-bones presentation and somewhat clunky feel mean it's not the best 2D fighting game you could find these days, but it's got some interesting aspects, and a bunch of different characters, so it's a decent route for those of us who've always felt like something got lost in translation when fighting games went 3D. The Samurai Shodown series has seen better days, but most of the classic characters are back in this installment, and taking them online can make for some nostalgic fun. The Xbox version of Samurai Shodown V is more or less a straight port of the NeoGeo fighting game originally released in 2003. That's not so long ago, but the NeoGeo hardware dates back to the early '90s, and this game recycles a lot of the graphics and the sound from 1995's Samurai Shodown III, so this isn't exactly cutting-edge stuff--well, besides all the swords. It's also rather ironic that a lot of the recycled character graphics and sounds are better than the content that was newly added to SSV. Classic characters like the wild swordsman Haohmaru and his ruthless rival Genjuro still look quite good--with their fearsome fighting stances and colorful expressions--but some of the newly added characters, like the hammer-wielding rascal Sankuro and the game's tough, spear-wielding last boss Gaoh, are drawn and animated rather poorly. Likewise, the game's background graphics range from sort of pretty to pretty garish, which makes SSV look like something out of a classic game compilation. The audio does a better job of standing the test of time. There's some nice music (including both the original, digitized soundtrack and a new, instrumental version) and good voice work here and there, including a gravelly voiced English-speaking announcer who fits the game pretty well--even though Samurai Shodown's narration has always been in Japanese up until this installment. The original Japanese language option is still available, but you're required to adjust your Xbox's language setting to activate it. It's worth noting that, for whatever reason, SNK opted to bring the original version of Samurai Shodown V to the Xbox, rather than the updated version called Samurai Shodown V Special. While the differences between the two aren't superficially obvious, the updated version sought to improve the mechanics and play balance, based on how SSV panned out with its hardcore fans. SSV Special also featured the return of Samurai Shodown's classic boss characters, and in what appears to be an unfortunate misprint, the manual for SSV suggests that they're hidden in this version of the game, which apparently is untrue. At any rate, there's a slow, tactical pace to the action in SSV that won't necessarily appeal to every fighting game player. While the game moves relatively smoothly, the combat is responsive enough, and the emphasis on well-placed hits over drawn-out combos is refreshing, none of the characters move particularly gracefully, and the hits don't feel all that solid when they connect. It's a basic issue with the overall feel of the action as compared to some of the tighter, faster fighting games out there, including a lot of older ones. Play balance is also pretty suspect, especially since the two deliberately stronger-than-normal midboss characters are freely playable online. Brief yet annoying loading times between battles also drag the pacing down. It seems bizarre that this game would have any loading times at all. Some of the new characters are pretty wild, but they're not as memorable as Samurai Shodown's classic cast. The game features well over two dozen different characters, including virtually every Samurai Shodown character who has appeared in the series to date. Everyone from the master ninja Hanzo to the terminally ill swordmaster Ukyo is in here, complete with all their trademark moves. Notable omissions, though, include the freakish Gen-An, the ferocious Wan-Fu, and the aptly named Earthquake--but for the most part, this is a good reunion. New fighters include Yoshitora, a flashy aristocrat armed with not just one or two, but seven swords; Mina, a sprightly archer with an annoyingly cute pet; Kusaregedo, a monstrous freak; and several others. Not all of the new fighters are completely original, though. In Samurai Showdown III and IV, you could choose between two alternate versions of each fighter, each of which had his or her own set of special moves. SSV ditches this option, choosing instead to spin off some of these alternate personalities into semi-unique characters. For example, Haohmaru has an evil twin in the even meaner and nastier Rasetsumaru, but the two aren't dramatically different in terms of gameplay. Also, a lot of the underlying game mechanics translate equally across all the fighters, so there isn't necessarily as much variety to the roster as you may initially suspect, despite how many different faces are in it. Even so, the character design runs the whole gamut, and it can be fun and interesting to try to learn the nuances of everybody in here. This is a straightforward fighting game for the most part. You hack up your opponent in a best-of-three-rounds battle, using a variety of slashes, kicks, special moves, and combos. While the basics are conventional, SSV does feature a number of fairly weird gameplay systems that become easier to grasp the more you play. There's an attack strength meter onscreen, which depletes each time you attack but gradually refills when you're not swinging. This feature discourages you from going wild on the attack buttons, since the more you flail about, the weaker you get. As in previous Samurai Shodown games, your fighter also gradually becomes enraged as you take damage. When your rage gauge fills up, you turn completely red and may execute a powerful move that can disarm your opponent, and your attack strength gets maxed out, making it possible to defeat your opponent with just a couple of well-placed strong slashes. Once per match, you can trigger a rage explosion ability, which instantly fills your rage gauge and also interrupts an opponent's combo, potentially saving your skin. Alternatively, SSV introduces an ability called ~concentration one,~ which may be used only once per match under special conditions when you're close to defeat. This ability effectively gives you a speed advantage by causing the opponent to move in slow motion, giving you the chance to perform a last-ditch, one-hit-kill maneuver. In practice, stuff like this makes it so that SSV matches can really come down to the wire, since a nearly defeated player can still make a dramatic comeback. It can feel a little cheap to wind up on the receiving end of a move that sucks up half your health or more, though, but SSV's esoteric gameplay system can still make for some fairly exciting matches. It really doesn't look like much by today's standards, but some of that old SNK charm and personality still shines through in Samurai Shodown V. The artificial intelligence in the single-player mode mounts a pretty stiff challenge the closer you get to the final boss, though certain dirty tricks can be used to practically guarantee easy wins. There's also a versus mode for two players, a practice mode that lets you mess around with all the different fighters, and an online mode through Xbox Live. The Xbox Live support is about as basic as can be, but it works, and we experienced relatively smooth, lag-free matches whenever we were able to find opponents online. It's easiest to find an opponent using the quick match option, but the option to ask the opponent for a rematch doesn't seem to work after a quick match--you're thrown back out to the Xbox Live menu. Since there aren't that many people playing SSV online, you'd naturally want to keep battling against any decent competition you find. Thankfully, you can keep fighting against any given player as much as the two of you want if you create a match or use the optimatch option. Samurai Shodown V is ideal for fans of NeoGeo fighting games who are still keeping the faith after all these years, but its dated presentation and complicated game mechanics probably won't do much for anybody else. The game does work well online, though, so if you want to experience this once-great fighting game series with other like-minded players, the less-than-full retail price of SSV can be well worth it."}