{"ref": "https://www.gamespot.com/reviews/the-legend-of-heroes-ii-prophecy-of-the-moonlight-/1900-6152964/", "date": "June 20, 2006", "game_name": "The Legend of Heroes II: Prophecy of the Moonlight Witch", "text": "If you've played last year's The Legend of Heroes, then for better or worse, you know exactly what to expect from the sequel. It's just like the first, but with its own self-contained storyline and cast of characters. Like the original, The Legend of Heroes II is a typical anime-inspired role-playing game, starring a couple of strong-willed teenage protagonists who will venture across a vast fantasy world in search of adventure while fighting various monsters in turn-based battles, finding better stuff, and meeting new friends and foes. A long-winded, fairly generic story and somewhat sluggishly paced battles keep this one from being too memorable or exciting, but if you're just looking for a new RPG to take with you on the go, it gets the job done. Bright-eyed, good-natured Jurio and Chris are the prototypical world-saving teenagers in this particular RPG. The Legend of Heroes II is filled with awkward names, some of which seem poorly translated from the original Japanese. But the game's conventional anime trappings somehow make all this easier to digest. Jurio and Chris (short for Christine) are a couple of country kids from Ragpick village, tucked away in the corner of the continent of Tirasweel. As part of a coming-of-age ritual, they must leave their families behind and embark on a pilgrimage that involves visiting several magic mirrors, each of which grants a vision. Of course, this journey turns out to be substantially more dangerous and more important than either of these two bargained for. The mirrors contain ominous visions that Jurio and Chris are compelled to investigate further, and there's also the matter of the Moonlight Witch, a legendary and mysterious figure who might be the key to sorting out Tirasweel's growing list of problems. The game takes its time expounding on the main storyline, instead padding out the script with lots of unnecessary dialogue that's probably meant to make the main characters more endearing or draw you into the world. There are a lot of throwaway characters to talk to in the numerous towns and villages you'll come across, though mission-critical ones are conveniently marked with an exclamation point. That's very fortunate, because other than this visual cue, it's often unclear exactly what you're supposed to do next, or where you're supposed to go. Unless you pay close attention to key dialogue sequences, it's possible to wind up wandering aimlessly between towns, trying to remember what was next on your agenda. There's an overworld map available, but it doesn't point you to your next destination, and there's no quest log or anything of that sort, either. This serves to substantially slow the pacing of The Legend of Heroes II, and it may throw you off if you like to play in relatively short sessions--each time you come back to the game, you'll probably need to spend a few minutes reorienting yourself. The best thing about the game's combat is that it can be avoided. Just like in the previous game, you'll see various creatures and monsters wandering about in the field as you travel the land. Stronger monsters will chase you when you approach, but it's still possible to outmaneuver many of these if you're just trying to get from point A to point B as quickly as possible. However, you'll still end up fighting frequently, and it's important to do so if only to keep on leveling up and strengthening your party members. You can have up to four characters in battle at a time, and in between turns, you can decide to make your characters fight, or use magic, items, or special abilities. Then everyone involved in the fight acts based on their speed statistic. For the most part, the battles move along pretty quickly, as long as you concentrate on physical attacks. But you'll often need to use spells, and your foes will also use magic against you--and the spell animations are slow to the point of being cumbersome. At least it's possible to quickly flee from most battles, and you'll also frequently be able to use ~finishing moves,~ powerful attacks that can wipe out average foes in one hit. The combat isn't terribly interesting, but you'll still feel a sense of progress as you gain experience levels, learn new skills and spells, and find and purchase better gear. Your traveling companions will also come and go as the story progresses. Some of the characters are likable and some of their interactions are definitely amusing, though the game's attempts at comic relief succeed less than half the time. Key characters are depicted using big, nicely drawn portraits that add a vibrant touch to the game's fairly basic graphics. The big-headed, doll-like characters you'll typically see running around onscreen don't look particularly special, though some of the 3D environments are pretty nice. A fitting but repetitive soundtrack tends to drone on while you play, but there's no speech to go with all the dialogue. Combat requires you to consider distances between your characters and their targets, but it still isn't very strategic. You can save your progress at any point outside of combat or dialogue, which helps make the game feel like a good fit for the PSP. There aren't too many other distinguishing features worth mentioning, with the possible exception of the pet system. Though your party is represented by just one character running around, you do get a little animal that'll chase after you (even underwater!) and will sometimes assist you in battle or find you a potion. That's about it for the pet system. The best thing about The Legend of Heroes II is that it's a long game, and could easily take you a few dozen hours to play through. It doesn't noticeably improve on any aspect of its predecessor, including the story, characters, or quality of the text translation. But while some games have accomplished much, much more on these fronts, other games have done a lot worse. So if you're OK with the RPG status quo and like the idea of sinking your teeth into a long-lasting portable game, then The Legend of Heroes II should keep you busy for a while."}