{"ref": "https://www.gamespot.com/reviews/hoshigami-ruining-blue-earth-review/1900-2836339/", "date": "May 17, 2006", "game_name": "Hoshigami: Ruining Blue Earth", "text": "There are some games that anyone can pick up and enjoy. Such titles offer intuitive gameplay, a graceful learning curve, and the ability to progress steadily through the game. Within the strategy genre, however, games rarely fit this description. Like war, these games can be quite harsh. It can take some serious commitment to reap the rewards of the battlefield, and this is definitely the case in Hoshigami, the first effort of developer MaxFive. Hoshigami is inspired by games like Tactics Ogre and the more recent Final Fantasy Tactics, and it features some new game systems and high level of challenge that can be a bit difficult to acclimate to but definitely give the game merit. The setting for this tale of war and strife is the continent of Mardias. The Valaiman Empire is seeking the powers of the ancient Ixian civilization, and they have already invaded the country of Geraud to further their interests. As the forces of Valaim begin to make excursions into another country, Nightweld, the game's young hero is thrust onto the stage of history. As he struggles to protect the people he cares about, his actions will determine the fate of the continent. Although there's nothing particularly striking about the story, the execution is quite capable. Your group of mercenaries is always provided with a clear direction, and Atlus' translation is consistent. Players who prefer a nonlinear story will be happy to find the story branching off into multiple paths at several points in the game. Further variations will occur depending on whether or not you keep the main characters alive, which can prove to be quite challenging. In order to advance the story, the player must manipulate a group of seven mercenaries on a 3D map in a tactical manner and fulfill the conditions for victory. You'll need to take into account positioning, terrain, hit percentages, and the interplay between elemental forces. This is often par for the course in this type of game, but Hoshigami brings in several new concepts that substantially affect the gameplay. Taking the place of a traditional class system, each character is affiliated with an element that determines what weapons a soldier is proficient in and what abilities he or she can learn. Besides this, there are much more substantial changes in gameplay: the RAP, attack session, and coinfeigm systems. A queue indicator is displayed at the top of the screen, and it represents the flow of battle. This is the single most important part of the screen. Turns are ordered left to right. The more RAP (ready for action points) characters expend in their turn, the farther right they will move on the indicator. Any action a character performs will cost a certain amount of RAP, be it moving, attacking, or casting a spell. When a character's turn comes around, he or she starts with an empty RAP gauge. Any combination of actions can be performed, allowing multiple attacks or a quick hit and run, but the more points you spend, the longer you'll wait for the next turn. To be an effective strategist, it is absolutely vital that you have a firm grasp of the RAP system. Without this understanding, death will come swiftly, frequently, and unexpectedly. The learning curve is quite high and the enemy is unforgiving, but overcoming the steep learning curve for this very versatile system will provide you with an amazing degree of control and allow you to initiate Hoshigami's trademark attack session. Two lesser mechanics tie in with the RAP system in order to execute an attack session. Anytime a character attacks, another gauge appears that indicates attack strength. By stopping the gauge in the critical or shoot area, your character will either inflict more damage or push the enemy back. By ~shooting~ an enemy into a comrade who has selected standby to end his or her turn, the enemy will be pushed again in the direction that character was facing. With the proper planning and timing, a damaging multiple-hit combo can be performed. Additionally, performing these multiple-hit combos will occasionally allow you to take a piece of equipment or learn a skill from your enemy once it's defeated.Hoshigami also features an unconventional system for dealing with magical attacks. Using an ancient technology, the power of elemental spirits can be contained and released within a coinfeigm. Engraving coinfeigms with seals can create new spells or increase the potency of existing ones. A coinfeigm's different properties will change independently of each other, and each combination of seals can create very different results. Because no particular seal is tied to one particular stat, the process is fairly involved, as you'll need to preview many different combinations before you actually engrave a coin. A pen and paper and a copy of the game's elemental chart are almost a necessity. Because the majority of enemy soldiers will be equal to your highest-level soldier, and because your seven-member party must often face two to one odds, maintaining equal levels among your party is essential. The ability to continually enhance coinfeigms and the gleaning of superior equipment through attack sessions are powerful and often necessary equalizers. For these reasons, towers of trial exist throughout the gameworld. Each floor in these towers pits you against enemy parties of increasing difficulty. The early floors are much easier to overcome than the taxing story battles, allowing you to level up relatively easily. Rare coinfeigm seals can also be found within the tower walls and are awarded randomly as you clear each floor. Throughout the game, you'll be fighting intelligent human soldiers. Slight mistakes can easily thin your character ranks, as an overextended character will be singled out and felled before you realize what's happened. To make things even tougher, enemies are often outfitted with superior equipment. There are occasional hiccups--for instance, one AI flaw causes enemy archers to occasionally plant an arrow in the back of an ally's skull or attempt to shoot at a character on the other side of a wall. Thankfully, enemies do have a sense of self-preservation, and many smaller groups of enemies won't engage you until they are advanced upon. As bad as things may seem, a solid strategy and wise use of the RAP system can overcome the odds, provided you keep your army in fighting shape by visiting the towers of trial. If this sounds like a lot to consider, that's because it is. It's simply not possible to advance through the game without stopping to train and power up your coinfeigms. Combined with a learning curve that may seem like a sheer cliff to SRPG neophytes, this makes for a very labor-intensive game. Rather than aiming for accessibility, the developer has opted to make a game suited for hard-core strategy fans. That MaxFive's first title is so rife with new game systems and gauges and features a branching story is evidence of its zeal as a first-time developer. Less flattering evidence pointing to a debut title is a bit of weakness in the audio and visual areas. The sound effects are nondescript, and while the musical score isn't necessarily bad, many of the tunes are quite simplistic. Amplifying this problem is the fact that music is heavily recycled. Many of the maps are aesthetically pleasing in composition and make excellent battlefields, but they all lack animation, and the colors seem to be muted. Although not ugly, the game ultimately lacks visual variety. The presentation isn't so poor as to detract from the game, but the player may feel a bit let down by it. Above all, one should understand that Hoshigami is a difficult game, and, as the developer's first effort, it's a bit rough around the edges. For serious fans of the genre, the game can be very time consuming and rewarding in the way a good strategy game should be. Not everyone will find that the returns are worth the investment, but if you're curious about the RAP system or would like to see a more-refined second effort from this new developer, you should check the game out.Hoshigami also features an unconventional system for dealing with magical attacks. Using an ancient technology, the power of elemental spirits can be contained and released within a coinfeigm. Engraving coinfeigms with seals can create new spells or increase the potency of existing ones. A coinfeigm's different properties will change independently of each other, and each combination of seals can create very different results. Because no particular seal is tied to one particular stat, the process is fairly involved, as you'll need to preview many different combinations before you actually engrave a coin. A pen and paper and a copy of the game's elemental chart are almost a necessity. Because the majority of enemy soldiers will be equal to your highest-level soldier, and because your seven-member party must often face two to one odds, maintaining equal levels among your party is essential. The ability to continually enhance coinfeigms and the gleaning of superior equipment through attack sessions are powerful and often necessary equalizers. For these reasons, towers of trial exist throughout the gameworld. Each floor in these towers pits you against enemy parties of increasing difficulty. The early floors are much easier to overcome than the taxing story battles, allowing you to level up relatively easily. Rare coinfeigm seals can also be found within the tower walls and are awarded randomly as you clear each floor. Throughout the game, you'll be fighting intelligent human soldiers. Slight mistakes can easily thin your character ranks, as an overextended character will be singled out and felled before you realize what's happened. To make things even tougher, enemies are often outfitted with superior equipment. There are occasional hiccups--for instance, one AI flaw causes enemy archers to occasionally plant an arrow in the back of an ally's skull or attempt to shoot at a character on the other side of a wall. Thankfully, enemies do have a sense of self-preservation, and many smaller groups of enemies won't engage you until they are advanced upon. As bad as things may seem, a solid strategy and wise use of the RAP system can overcome the odds, provided you keep your army in fighting shape by visiting the towers of trial. If this sounds like a lot to consider, that's because it is. It's simply not possible to advance through the game without stopping to train and power up your coinfeigms. Combined with a learning curve that may seem like a sheer cliff to SRPG neophytes, this makes for a very labor-intensive game. Rather than aiming for accessibility, the developer has opted to make a game suited for hard-core strategy fans. That MaxFive's first title is so rife with new game systems and gauges and features a branching story is evidence of its zeal as a first-time developer. Less flattering evidence pointing to a debut title is a bit of weakness in the audio and visual areas. The sound effects are nondescript, and while the musical score isn't necessarily bad, many of the tunes are quite simplistic. Amplifying this problem is the fact that music is heavily recycled. Many of the maps are aesthetically pleasing in composition and make excellent battlefields, but they all lack animation, and the colors seem to be muted. Although not ugly, the game ultimately lacks visual variety. The presentation isn't so poor as to detract from the game, but the player may feel a bit let down by it. Above all, one should understand that Hoshigami is a difficult game, and, as the developer's first effort, it's a bit rough around the edges. For serious fans of the genre, the game can be very time consuming and rewarding in the way a good strategy game should be. Not everyone will find that the returns are worth the investment, but if you're curious about the RAP system or would like to see a more-refined second effort from this new developer, you should check the game out."}