{"ref": "https://www.gamespot.com/reviews/gangland-review/1900-6091479/", "date": "March 15, 2004", "game_name": "Gangland", "text": "On the surface, it would seem like Gangland would be a surefire hit. It leverages the popular gangster theme and melds it into a hybrid game that is part action, part strategy, and part simulation. You can run a number of illegal businesses, like speakeasies, brothels, chop shops, and moonshine distilleries, while also raising a family, putting out contract hits, and performing drive-bys. So, in theory, there's something for everyone here. Unfortunately, the execution of many of Gangland's different elements falls short of its lofty promise, thus leaving a game that has a lot of good ideas but is sometimes convoluted and often frustrating. The streets are all but devoid of cars. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Gangland Video Review Gangland's story isn't going to make anyone forget about Mafia (the game) anytime soon, but the premise is solid enough. You play as Mario Mangano, one of five brothers from Palermo, Sicily. One night your brother Chico is found dead. Apparently, he met his fate at the hands of your three other brothers, Angelo, Romano, and Sonny. Your three brothers soon disappear from the island and flee to Paradise City, which is in the New World. As a result of their departure, you're sent to apprentice in the New World--under your uncle Vincenzo--to seek vengeance for Chico's death. Gangland's modern-style music doesn't seem to fit the '30s theme, but then again, neither do the ninjas, Humvees, bazookas, and Uzis that you'll eventually come across. It's also strange that voice-overs weren't used to relate the plot in between missions, but considering how terribly voiced the unit acknowledgments are, maybe this is a good thing. One of the first things you'll notice about the game is that it has a fairly capable graphics engine. The city maps you play in are rendered in 3D, and the streets and buildings you explore have a satisfying level of detail. Dozens of pedestrians roam about, and interior areas are fully fleshed-out with furniture and other amenities. Other nice touches include steam that escapes from sewer drains and a day-night cycle that appropriately affects your line of sight. You can zoom the viewpoint in and out with the mouse wheel, and you can rotate your angle smoothly with the mouse by holding down the Alt key. Usually, though, you'll rely on a couple of keys on the keyboard to quickly rotate your view 90 degrees in either direction. After just a few minutes of playing, you'll begin to notice what's missing more than what's there--namely, vehicular traffic. Every now and then you'll walk past a car parked on the street (that you can't steal!), but otherwise Gangland is devoid of vehicles, aside from those you drive and those your enemies drive. The lack of civilian vehicles is a pretty big flaw for a game that boasts a ~living city.~ Even when you do get to drive a vehicle, the handling of these cars leaves a lot to be desired. You can pull off drive-bys, but for some strange reason, cars are restricted to running on the streets. If you attempt to drive up the curb, you get stopped cold, as though there are invisible guardrails lining every sidewalk. If people are in the street, you can still run them over. However, collision physics are pretty much nonexistent, so your car just pushes victims a short distance before they die. Another big issue is the fact that there doesn't seem to be much variation in the character models for both your hired help and the nonplayer characters. Gangland has you interacting with and moving among so many people that it's distracting when they end up all looking like clones of one another. You'll start the game as a low-level gangster under your uncle Vincenzo. You've only got one goon sidekick to start out with, and your missions begin slowly by having you extort nearby businesses, like a gun shop and a restaurant, and having you carry out small hits for your uncle. As you gain firsthand knowledge about running a protection racket and offing poor saps, you gain experience that allows you to hire and simultaneously control more goons. The standard hired help varies from burly bouncers, who excel in melee combat; to gunmen, who wield pistols and tommy guns; to fast-moving street girls, who can use mace to incapacitate their quarries. If you complete the game's challenge missions, you can unlock powerful special units, such as big mammas (shotgun-wielding fat women who can heal your units), ninjas, bazooka troops, and snipers (who tote their rifles in violin cases). Street girls spray clouds of gas to temporarily stun enemies. Initially, you can only hire people from restaurants you've taken over, so an immediately frustrating issue is that the type of goons available to you is randomized. If you're looking for a tommy gunner, you may end up waiting for a while if the only people looking for jobs in your restaurant are bouncers. Having more restaurants under your control increases the applicant pool, but the inability at the outset of the game to freely choose the troops you want can be irritating. Gangland's combat is hit-or-miss. While you can (and must) use the environment to your advantage by positioning your men behind cover, the action usually develops so fast that it can be very difficult and frustrating to manage. The ability to issue orders while paused would have done a lot to mitigate the chaos, but this feature isn't available in Gangland. Hundreds of bullets fill the air with each pitched battle because it takes a ridiculous amount of gunfire to bring down just one man. The fact that most of your men are such horrible shots makes matters even worse because ammunition is one of the game's key resources. As a result, the more gun shops you have in the fold, the faster you accumulate bullets. Complicating things even more is the random manner in which NPC bystanders and nearby police participate in gunfights. Most NPCs will simply run away from the area, but a good percentage of them carry their own weapons and will often fight with you or against you. The same goes for the police, though mostly they will shoot at gangsters of either side. However, at times it feels as though they do pick a side. It's frustrating when the police end up against you in a fight because it makes you wonder why you've been paying them off in the first place. There appears to be little rhyme or reason as to when these third parties will be with you or against you, which adds to the trial-and-error nature of Gangland's underlying strategy. The enemy artificial intelligence feels pretty basic as well. Damaged units will often try to run away and heal up with medkits, but sometimes enemies stack together foolishly, thus making them ideal targets for bombs and dynamite attacks. Garages will generate car parts for you to trade with international contacts. You can expect to die often in Gangland because the normal difficulty level offers an intimidating level of challenge. The game has a steep learning curve. For instance, right at the end of the first mission, you're asked to start knocking off other bosses and told to walk right into heavily fortified safe houses. All too often, these mission failures are the result of being unexpectedly outnumbered due to police interference or other hard-to-avoid circumstances, like your thrown dynamite exploding too close to your men. It would have been nice to have been able to save a game in the middle of a mission, but for some reason, this feature has been left out of Gangland (though a patch is apparently in the works to address this issue). As it is, if you spend an hour or more on a hard mission and get whacked at the end, you'll have to start it all over. The challenge missions, in particular, seem all but impossible because dozens of enemies are flung at you, and you don't even get a steady source of ammunition to fend them off. The game's default level of difficulty may turn off some potential players, but thankfully, the developers have included three different difficulty settings, which primarily affect the amount of damage your men can take. If you can persevere through the first few missions, you'll reach a point where you can get out from under your uncle's shadow and begin running your own mob. The game opens up from here because you have more options available to you, and the game introduces different mobs, new units, and different settings. You can also begin collecting secondary resources by taking over special businesses, like chop shops, brothels, and distilleries. International mobsters will call you up on the phone and offer money, other resources, and special units in exchange for your hot car parts, blackmail photos, and liquor. You're also able to marry and have children. These children grow up to be underbosses with special skills that allow you to hire more goons. You can also have your grown child watch the headquarters while you roam around the city. Unfortunately, these added features sometimes feel like they present more hassle than they're worth. Managing a single battle is difficult enough, but attempting to protect a far-flung empire of businesses--all of which are potential targets for your enemies--while attempting to organize your own attacks is all but untenable. Protecting your wife from attack is also a pain because she cannot be controlled directly. Like any good woman, she's got a mind of her own, so she'll wander around in public near your safe house for amusement, which can be dangerous. Gangland offers a ton of content. There are 16 conquest missions in the campaign, with 12 optional challenge missions interspersed. While Mario's experience carries over from mission to mission, your experienced henchmen and the businesses you own do not, so Gangland lacks a sense of continuity, which is important for a game of this type. Protecting your wife and child is a difficult priority in Gangland. There are a number of maps available for multiplayer action, and these can optionally be played with computer opponents in a makeshift sandbox mode. Against human opponents, building up your empire in the standard conquest mode feels somewhat slow, but a faster-paced shoot-out mode is also included for those with shorter attention spans. Though the game touts online capabilities, like many real-time strategy games, Gangland wasn't designed with dedicated servers in mind. As of this writing, we haven't been able to find random players to compete against using the matchmaking tool. It's also worth noting that multiplayer still seems a bit buggy as of patch 1.1. Specifically, the game routinely crashes on us upon exiting a multiplayer match, thus requiring a hard reboot. All told, Gangland is an unfortunate example of wasted potential. But don't take this as an outright dismissal. Those who are very interested in gangster-themed games will still find plenty to like about it, since its general design is fairly solid. There's an undeniable charm in taking over businesses, running a protection racket, and interacting with international mobsters as you vie for control of the city. Gangland certainly offers a lot of ambitious features to add depth to the gameplay. However, it's too bad that the overly chaotic battles, some balancing issues, and a lack of attention to vehicles keep us from giving it an unqualified recommendation. Complicating things even more is the random manner in which NPC bystanders and nearby police participate in gunfights. Most NPCs will simply run away from the area, but a good percentage of them carry their own weapons and will often fight with you or against you. The same goes for the police, though mostly they will shoot at gangsters of either side. However, at times it feels as though they do pick a side. It's frustrating when the police end up against you in a fight because it makes you wonder why you've been paying them off in the first place. There appears to be little rhyme or reason as to when these third parties will be with you or against you, which adds to the trial-and-error nature of Gangland's underlying strategy. The enemy artificial intelligence feels pretty basic as well. Damaged units will often try to run away and heal up with medkits, but sometimes enemies stack together foolishly, thus making them ideal targets for bombs and dynamite attacks. Garages will generate car parts for you to trade with international contacts. You can expect to die often in Gangland because the normal difficulty level offers an intimidating level of challenge. The game has a steep learning curve. For instance, right at the end of the first mission, you're asked to start knocking off other bosses and told to walk right into heavily fortified safe houses. All too often, these mission failures are the result of being unexpectedly outnumbered due to police interference or other hard-to-avoid circumstances, like your thrown dynamite exploding too close to your men. It would have been nice to have been able to save a game in the middle of a mission, but for some reason, this feature has been left out of Gangland (though a patch is apparently in the works to address this issue). As it is, if you spend an hour or more on a hard mission and get whacked at the end, you'll have to start it all over. The challenge missions, in particular, seem all but impossible because dozens of enemies are flung at you, and you don't even get a steady source of ammunition to fend them off. The game's default level of difficulty may turn off some potential players, but thankfully, the developers have included three different difficulty settings, which primarily affect the amount of damage your men can take. If you can persevere through the first few missions, you'll reach a point where you can get out from under your uncle's shadow and begin running your own mob. The game opens up from here because you have more options available to you, and the game introduces different mobs, new units, and different settings. You can also begin collecting secondary resources by taking over special businesses, like chop shops, brothels, and distilleries. International mobsters will call you up on the phone and offer money, other resources, and special units in exchange for your hot car parts, blackmail photos, and liquor. You're also able to marry and have children. These children grow up to be underbosses with special skills that allow you to hire more goons. You can also have your grown child watch the headquarters while you roam around the city. Unfortunately, these added features sometimes feel like they present more hassle than they're worth. Managing a single battle is difficult enough, but attempting to protect a far-flung empire of businesses--all of which are potential targets for your enemies--while attempting to organize your own attacks is all but untenable. Protecting your wife from attack is also a pain because she cannot be controlled directly. Like any good woman, she's got a mind of her own, so she'll wander around in public near your safe house for amusement, which can be dangerous. Gangland offers a ton of content. There are 16 conquest missions in the campaign, with 12 optional challenge missions interspersed. While Mario's experience carries over from mission to mission, your experienced henchmen and the businesses you own do not, so Gangland lacks a sense of continuity, which is important for a game of this type. Protecting your wife and child is a difficult priority in Gangland. There are a number of maps available for multiplayer action, and these can optionally be played with computer opponents in a makeshift sandbox mode. Against human opponents, building up your empire in the standard conquest mode feels somewhat slow, but a faster-paced shoot-out mode is also included for those with shorter attention spans. Though the game touts online capabilities, like many real-time strategy games, Gangland wasn't designed with dedicated servers in mind. As of this writing, we haven't been able to find random players to compete against using the matchmaking tool. It's also worth noting that multiplayer still seems a bit buggy as of patch 1.1. Specifically, the game routinely crashes on us upon exiting a multiplayer match, thus requiring a hard reboot. All told, Gangland is an unfortunate example of wasted potential. But don't take this as an outright dismissal. Those who are very interested in gangster-themed games will still find plenty to like about it, since its general design is fairly solid. There's an undeniable charm in taking over businesses, running a protection racket, and interacting with international mobsters as you vie for control of the city. Gangland certainly offers a lot of ambitious features to add depth to the gameplay. However, it's too bad that the overly chaotic battles, some balancing issues, and a lack of attention to vehicles keep us from giving it an unqualified recommendation."}