{"ref": "https://www.gamespot.com/reviews/the-lord-of-the-rings-the-fellowship-of-the-ring-r/1900-2895654/", "date": "October 24, 2002", "game_name": "The Lord of the Rings: The Fellowship of the Ring", "text": "Thanks to last year's blockbuster motion-picture adaptation, author J.R.R. Tolkien's Lord of the Rings novels are an extremely hot property--the kind that people put on T-shirts, on collectible cups at fast-food restaurants, and even in computer games. But Black Label Games' The Fellowship of the Ring is officially based on the fantasy novel rather than the movie and carries the approval of Tolkien Enterprises, so you'd think that the computer game would be more than a cheap rush job to earn some quick cash. You'd be right. You might also expect it to be an even more faithful adaptation of the novels than the film--one that even the stuffiest Tolkien enthusiasts will enjoy. Unfortunately, thanks to Fellowship of the Ring's limited gameplay, only true Tolkien enthusiasts will enjoy the game for very long. The Fellowship of the Ring, which is a third-person action adventure game, gets off to a good start. The PC version has a simple control scheme that's reminiscent of a first-person shooter and has a true first-person mode that can be used to aim at enemies from a distance. Over the course of the game, you can play as one of three characters, the kindly hobbit Frodo Baggins, the elderly wizard Gandalf, and the tall, solemn ranger Aragorn, though you'll also eventually travel with the dwarf Gimli, the elf Legolas, the human Boromir, and the hobbits Sam Gamgee, Merry Brandybuck, and Pippin Took in your quest to bring the evil One Ring to Mordor and destroy it. The game also has a simple inventory system that automatically pauses the game when accessed and lets you cycle through your active character's inventory to find an item you may need to solve a puzzle or use a healing item or magic spell. Fellowship of the Ring is also a good-looking game. Many of the game's environments are huge: The outdoor areas are composed of grassy, rolling hills, and the subterranean mines of Moria, which your party will eventually explore, feature impressive architecture that suggests the huge underground hallways from both the books and the film. The game also does a decent job with its character models, each of which bears a considerable resemblance to the characters in the movie. Though they're animated expressively in the game's in-engine cinematics, their movement tends to be a bit stiff in the actual game, and their textures tend to be simplistic, making them look rather ugly up close in the cutscenes. In addition, the game's character models suffer from some rather embarrassing graphical glitches, including problems with polygon clipping (the elf-queen Galadriel's hair clips into her shoulders and out through her chest, for instance), and from the game's third-person camera perspective. Fellowship of the Ring's camera has a tendency to get stuck on walls, which isn't much of a problem in the outdoor areas but is very problematic once your party reaches (and spends a considerable part of the game in) the mines of Moria--the camera tends to get stuck on walls and often completely obscures you, leaving you at the mercy of angry orcs that you can't fight properly because you can't see anything other than the nearest wall looming in front of you. At least the game sounds fairly good. The game's voice acting is generally decent, though if you've seen the movie, you might expect the game to have more fake British accents than you can shake a stick at, and you'd be right. Some characters, like Frodo, sound decent enough, while others, like the overly grim, overly melodramatic Aragorn, are a bit overdone. The game's sound effects are adequate, but not especially memorable, and unfortunately, the developer didn't capitalize on the opportunity to make good use of 3D sound in the cavernous mines of Moria--echoing footsteps and orc battle cries might have sounded that much more menacing and exciting. Fortunately, the game has a great symphonic soundtrack that changes on the fly when you're exploring peacefully or are under attack. The music is generally quite good and appropriate to the game, and though it might not be memorable, it's certainly not annoying either. Unfortunately, the actual gameplay of Fellowship of the Ring isn't very good. The game's pacing is inconsistent: It consists alternately of simplistic errand-boy quests and fighting sequences, which are either too easy or too frustrating, since the game sometimes throws too many enemies for your sluggish characters to deal with at once and since the game's camera sometimes gets in the way. For most of the early game, you'll play as Frodo and will carry out several easy, menial tasks before you can move on to other parts of the game. You'll later play as the swashbuckling Aragorn, who can shoot rather useless arrows or slash his opponents with a simple, predetermined series of sword strokes and can also stun his opponents by kicking them, and then finish them off while they're down. Unfortunately, Aragorn is far too slow to deal with multiple opponents, and as you'll find out later in the game, so is Gandalf, who can use some magic spells to defeat his enemies but generally suffers just as much from his own slow movement and from the game's bad camera angles. When you're being swarmed with enemies, you'll also have a hard time targeting a single one (which you'll need to do against tough enemies like trolls and uruk-hai), but this problem is balanced out somewhat by the fact that in several areas, you'll have the help of one or more computer-controlled companions, and in some cases, you can simply hang back and do nothing while your buddies do all the fighting. These problems might be easier to ignore if Fellowship of the Ring were a tightly structured, action-packed game. But when you're not struggling with orcs, or struggling with the camera, you're basically just walking around, either trying to collect items or to get from one point to another. And occasionally, you won't even be able to do that because the PC version has an unnerving tendency to randomly crash every so often. Since the game doesn't create autosave files whenever you complete an area or a particularly important quest, you'll find that you have to save early and save often, or you'll lose lots of progress. Unfortunately, you'll finish trudging through the game's areas fairly quickly--Fellowship of the Ring isn't a long game, and though the game has a few optional side quests, you probably won't find much incentive to play through it again once you've finished it the first time. Unless you are a highly critical, extremely demanding Tolkien fan, you probably won't criticize The Lord of the Rings: The Fellowship of the Ring for its production values. The game generally looks and sounds quite good, but unfortunately, it just isn't that much fun to play, thanks to its control and camera problems, along with its occasional crashes and lack of an autosave feature. If you're looking to visit (or revisit) the fantasy worlds that Tolkien created in The Fellowship of the Ring, you might be better off picking up a copy of the book."}