{"ref": "https://www.gamespot.com/reviews/dual-blades-review/1900-2895267/", "date": "October 21, 2002", "game_name": "Dual Blades", "text": "Dual Blades is a fighting game that seems to borrow a little of everything from an assortment of popular one-on-one combat games. General gameplay is reminiscent of SNK's Samurai Shodown series, complete with bladed weapons and gruesome finishing moves. Special attacks are laden with projectiles and somersaults, just like those found in Capcom's Street Fighter games. Last but not least, super attacks are outlandish and fill the screen similar to those in Sammy's Guilty Gear X. Since it borrows traits from so many other games, it's no surprise that Dual Blades is generally decent. Nevertheless, the game desperately needs its own identity and doesn't quite achieve the same consistency as the more established fighting game franchises. At a cursory glance, the game certainly has a lot going for it. There are nine included characters, each of which has its own unique set of attacks and special moves, as well as its own specific background location. They all look completely different from one another, so you don't necessarily notice that the roster is smaller than that of other GBA fighting games. The included gameplay options are also more than adequate and include single-player arcade, linked versus, time trial, survival, and practice modes. Still, when you actually put a few matches under your belt, you can't help but notice that Dual Blades blends together an amalgam of basic styles without actually incorporating the kind of deep gameplay so necessary in a one-on-one fighting game. Each character has an assortment of slashes and special moves, but very few of them can be chained together into complex combinations. Likewise, counterattacks are extremely basic and usually only result in an opportunity to take one punitive stab at the enemy. This isn't to say that there aren't large combinations or various ways to combo into finishing moves--there just aren't that many of them. The game is remarkably easy to just dive into and play, however, which makes it perfect for the large subset of players who haven't yet begun to refer to fighting games in terms of tiers, turtles, ratios, or any other blas vocabulary. You only have to push buttons to slash and hold back to defend, while special moves use the same quarter-circle, double-tap, and charge motions found in any number of previous 2D fighting games. As such, it won't take long to attain proficiency with the entire roster of characters. The game also earns high marks for its gruesome death scenes, in which you can actually decapitate or dismember an opponent with a final killing blow. In addition to the basic ~hold back to block~ defense that's typical of the genre, Dual Blades also includes a block-parry system similar to the one found in Capcom's Street Fighter 3 and Capcom vs. SNK 2 games. If you tap forward into your opponents just as they attack, you can block their strikes with your weapon and counter with a quick strike of your own. A successful parry also regains a touch of lost stamina. For as clever as the concept is, you can't parry successive attacks, which limits the move's practical use to isolated defenses against strong slashes and single-hit special moves. The game's best feature is its rage system. Each character has two pairs of attacks that can result in a number of beneficial situations, such as multihit combinations, defensive boosts, or strength increases. Before the match, you get to decide which two of the four attacks you'll use during the fight, so there is some strategy in choosing the pair that best suits your style. As the fight progresses, the rage meter fills as you land attacks or incur damage. When it's half full, you can unleash the weaker of the two attacks, and when it's completely full, you can unleash the single stronger attack or a pair of the weak variety. These rage attacks are easy to combo into from regular attacks and are gorgeous to watch since they often fill the screen. An added benefit of the rage meter is the recovery move, which lets you trade a chunk of rage power in order to cancel out of a special move or interrupt an opponent's combo. Besides its limited design, Dual Blades also exhibits a number of minor imperfections that may displease pickier players. Collision detection isn't always accurate, such that throws and hard slashes sometimes pass through an opponent. Another problem is that some special moves are difficult to execute as intended, since some characters have attacks that use both double-tap and quarter-circle motions--which aren't always easy for the GBA to distinguish, especially when you're in a crouch position. CPU behavior is also fairly limited, which means you'll want to graduate to human opponents before the computer's predictable patterns and cheap counters become too tiresome. If you can see past the rough edges of the game's design, which a lot of players will, there's no denying that Dual Blades is one of the more polished fighting games to land on a handheld in some time. The characters are quite large and absolutely full of animation, which is especially impressive considering that they all have their own set of attacks and that no one character is a duplicate of another. Likewise, the backgrounds are colorful and creative, even if they're not as detailed as those in Capcom's previous Super Street Fighter II: Turbo Revival. There aren't many voice samples, but audio manages to keep pace with the game's visuals due primarily to a choice assortment of operatic music and a few meaty slash effects. If you're the kind of person who tends to squeeze the most out of fighting games, you'll find that Dual Blades is a somewhat brief and limited adventure. The gathering of many different gameplay styles is interesting, but they're never brought together in a manner that begs to be mastered. As such, Dual Blades is better for those seeking vicarious thrills or a game that friends can play without hours of basic instruction."}