{"ref": "https://www.gamespot.com/reviews/cyber-shadow-review/1900-6417636/", "date": "February 3, 2021", "game_name": "Cyber Shadow", "text": "What do you associate with the term ~ninja game~? Perhaps you think of speedy action and superhuman agility, crazy character maneuvers, intense swordplay, or sneaky stealth. Odds are, however, that you also associate video game ninjas with games that are really, really hard. You wouldn't be wrong; in the long history of ninja-themed games, a lot of the standout titles are known for the formidable challenges they present. Knowing that, you'd likely expect a retro-throwback 2D platformer starring a cyborg ninja to be a tough test of your skills. Enter Cyber Shadow, a game that delivers everything above, especially the difficulty.Cyber Shadow puts you in the role of the titular Shadow, a cyborg ninja awakened from stasis in the ruins of a massive city. A mad scientist is on the rampage, having fashioned an army of robotic supersoldiers in a crazed quest to revive the dead, and it's up to you to foil his ambitions. It's a simple premise, but Cyber Shadow's story has a complexity that reveals itself as you progress. As you find the souls of your fallen comrades and discover records of the city's destruction and the lunatic doctor's experiments, you learn of a backstory far more interesting and tragic than a simple mad scientist gone rogue yarn.Shadow starts the game quite weak, having simple jumping, slashing, and running capabilities. Thankfully, the first level is a merciful introduction, with plentiful health drops, relatively weak enemies, and lots of checkpoints. But it's not long before things start to ramp up considerably, with early bosses and their bullet-spewing, fast-moving patterns giving you a taste of what's to come very soon. By the second area, you start to feel the pressure--quite literally, as crushing factory debris and instant-kill compactors make it clear that your mission is not going to be a walk in the park.Fortunately, Shadow is very adaptable and can even the odds with the challenges his environments and adversaries present. The world of Cyber Shadow is filled with hidden chambers yielding secret enhancements like permanent life- and spirit-increasing upgrade items, just waiting for the eagle-eyed explorer behind destructible walls and out-of-the-way routes. By defeating bosses and completing certain tasks, you earn new skills that greatly enhance combat and movement: a long-range shuriken, a downward stab, a wall cling, a dash and faster-than-light slash strike. Not only do these skills enhance your ability to combat and evade enemies, but they also open up new areas for exploration in previous areas.But even getting to the bosses that hold these skills can be a trial by fire. To ease the pressure, you can make good use of the game's checkpoint enhancement system. Many of Cyber Shadow's checkpoint terminals have optional boosts you can activate by choosing to spend collected essence points. These enhancements include full health and spirit restores along with robot helper items like a charge cannon and a shot-absorbing drone. Once you pay for the enhancement, it will always be available from that checkpoint--and if you die and respawn, you'll come back with those enhancements in tow. This system adds a level of resource-management strategy to the game while also enabling you to make use of some really cool weaponry that can aid you in facing upcoming obstacles.Even with enhancements, though, getting through the stages requires you to stay alert, figuring out enemy and obstacle patterns while making good use of the skills and resources available to you. There are a lot of great and satisfying ~a-HA!~ moments in Cyber Shadow, where suddenly an inaccessible item or area can be reached with a skill or a difficult enemy can be safely eliminated using a ninja skill or helper weapon wisely.Once you do reach the boss battles, you'll be in for some very fun and challenging fights. These encounters are where Cyber Shadow really reaches its peak, featuring imaginative and unique boss and attack designs that require both fast thinking and reaction to successfully fend off everything that gets thrown at you. Each boss does something new to put the skills you've honed through the stages to the test, and every win feels like a satisfying, hard-fought victory. One boss, the Mekadragon, has a particularly unique gimmick that I won't spoil here, but I know I'll be remembering what a blast that particular fight was for years to come.However, as you get further in the game, Cyber Shadow's stage difficulty begins to take a turn toward being plainly brutal. Strangely, as you get more skills for your attack and movement repertoire, the game puts less and less emphasis on creative combat and reaction, instead relying on obnoxious elements like instant-kill spikes and offscreen enemies in very bad places. At several points in the latter half of the game, I felt like I was being forced to do overly precise and specific actions with absolutely no room for error over and over again until I got things exactly right. The increasingly sparse checkpoints, along with limited health pickups and hazards that have a bad habit of blending into the other visuals, made traversing many of these areas feel like an arduous task. I had to put the game down more than a few times because I was on tilt from dying repeatedly in certain areas, sometimes only noticing an inconspicuous instant-kill spike after my death.While you can go back to earlier areas to find upgrades to make the late game a little bit easier, the way Cyber Shadow handles backtracking is quite messy. There are limited warp terminals in the game, and you'll sometimes go far very long stretches without seeing one. You can always attempt to backtrack the long way, as many of the stages are interconnected, though the ways they intersect are confusing--and the game's limited map does little to help. A more detailed map system would have done wonders in assisting players with exploration and finding all of the game's hidden areas and items, as well as making the world feel a bit more cohesive overall. It makes exploration more of a chore than it should be, and that's unfortunate.Cyber Shadow is a solid retro throwback with a few things that drag it down. The feeling of becoming more powerful and being able to take down huge enemy threats with your wits and skills is very rewarding, and the levels when you can use your abilities more freely to overcome challenges are quite fun. It's the trial-and-error areas littered with cheap deaths, demanding exact precision over long and frustrating stretches, that hamper the experience. Still, if you're looking for an old-school-styled ninja game that will test your skills (and sometimes your patience), Cyber Shadow is a worthy contender."}