{"ref": "https://www.gamespot.com/reviews/banjo-pilot-review/1900-6117578/", "date": "May 17, 2006", "game_name": "Banjo-Pilot", "text": "It's 2005, and by now, the number of available Mario Kart-like mascot racing games must number somewhere in the trillions. If you've ever played any of them, then congratulations, you've already played Banjo Pilot, too. Despite the fact that this game has been in and out of development limbo since before the GBA even launched (it was originally Diddy Kong Pilot, before Rare became a Microsoft studio), the four-plus years of production haven't resulted in a game that's anything more than a paint-by-numbers kart racer. Of course, the long development and copycat design doesn't automatically make Banjo Pilot a failure. In fact, despite the game's utter lack of originality, Banjo Pilot can often be good old-fashioned simplistic fun in the vein of some of the great kart racing classics like Super Mario Kart for the SNES. Spinning your platformer mascot out into a kart racing game is, like, soooo 1995. Following the kart racing Mad Libs tablet to the letter, Banjo Pilot features pretty much everything you would expect, including nine different racers from Rare's Banjo-Kazooie universe, a slew of wacky, pitfall-filled tracks, all the usual mode types--like a grand prix mode, a quick race, time trial, multiplayer for up to four racers--and even some unlockable goodies. However, there is one aspect of the game that sets itself apart from the norm--the karts themselves. These are not the little fun-sized Shriner karts of old that you're accustomed to racing with; in Banjo Pilot, you're racing with miniature airplanes. As goofy as that might sound, the racing still feels a lot like a typical kart racer. You may be airborne, but you'll still have to powerslide around sharp corners, lose speed or crash when you fly over rough parts of the track or obstacles, and fire off weapons you collect after hitting specific weapon pickups scattered throughout each track. Ultimately, the whole plane thing really only varies from the kart-based blueprint when you have to scoot yourself higher or lower to pick up weapons or avoid obstacles. You also can use the L button to supposedly pull off a barrel-roll maneuver to avoid enemy weapons, though after hours upon hours of attempting to pull that off, we never managed to avoid anything. Apart from these slight alterations to the classic kart racing scheme, there's no difference to speak of. Banjo Pilot's multiplayer is your best opportunity for excitement. The battle races can often be a riot if you're playing with friends. The single-player portions of the game aren't always as captivating, unfortunately. The grand prix mode gets repetitive fast, as the tracks are never particularly long, nor especially varied, and the jiggy challenge mode (sort of a minigame type of thing) never really catches on. However, it's worth playing through the GP mode just to unlock the extra racers, courses, and other doodads the game has hidden away, and hey, there's always the time trial mode. Overall though, the multiplayer is definitely the highlight here, and it's worth the price of admission if you've got the friends to play with. You won't find anything in Banjo Pilot that hasn't been done before, but the game still has its inherent charm. Banjo Pilot also presents itself pretty well. The graphics are straight-up SNES style, complete with copious amounts of Mode-7-like scaling and rotation, but with a little more in the way of detail in the racers and environments. The action never hitches up, even if all the racers on the track are bunched up together. That actually does happen from time to time, and unfortunately, it is the one visual annoyance. Too many racers too close together can really clutter the screen and obscure any view of your racer or what's coming up on the track. It's not a constant problem, but it's annoying when it happens. The audio portion of the game is peppered mostly with a solid, if repetitive, soundtrack and some occasional voice samples from the array of wacky characters in the game. There's nothing earth-shattering here, but it all works contextually. Like most kart racing games, Banjo Pilot's multiplayer leaves its single-player counterpart in the dust. The single-player has its moments, but ultimately, Banjo Pilot is best served for those who have three friends who also want to do a little airplane racing."}