{"ref": "https://www.gamespot.com/reviews/the-sims-2-bon-voyage-review/1900-6178733/", "date": "September 19, 2007", "game_name": "The Sims 2: Bon Voyage", "text": "The Sims series' unique formula of simulating the lives of little computer people as they live, love, and go to the bathroom has been successful more or less from the start. Both the original game and the solid sequel, The Sims 2, have consistently stayed interesting, thanks to a never-ending stream of expansion packs. And Bon Voyage, the latest expansion for The Sims 2, adds a good amount of variety and some handy new options that make managing your computerized families' lives even easier. Bon Voyage offers three different vacation venues with plenty of amenities. The focus of this expansion is vacations--specifically, moving your family of ~sims~ out of the house and checking them into a fabulous resort hotel, then hitting one of three different vacation spots: sunny beaches, tea gardens, or ancient ruins. At these vacation spots, your sims try out leisure activities, collect souvenirs, and interact with the locals, who may teach your sims new ~social~ gestures specific to the area. Even though three vacation venues may not sound like much, each setting offers multiple hotels with different price ranges, but all of them have enough in the way of basic services to help your sims survive their off-time. The better resort hotels have swimming pools, hot tubs, and other relaxing activities, but they all have handy, round-the-clock room service to feed your hungry sims; beds, showers, and TV sets to take care of their fatigue, hygiene, and entertainment needs; as well as plenty of other guests to socialize with. Since going on vacation suspends the regular flow of time from their home and professional lives (so they don't have to worry about missing a day of work), staying in a hotel makes life much easier for your in-game family. Once you're settled in a hotel, you can take a cab (or hoof it) to a nearby tourist lot. There's a decent variety of tourist areas for each venue, including shopping and recreation areas where your characters can collect many different items, such as fresh fruit from the local market, or hidden treasure from rummaging through the cabin of an abandoned pirate ship. There are plenty of new social interactions and new activities to try at these venues as well, such as building sand castles or swimming in the oceans, which make excellent group activities. This helps shift the game's focus away from always worrying about your sims' needs (making sure they aren't hungry, tired, or bored) and makes it easier to focus on getting your virtual family into a fun-filled group activity quicker. And the ample population of other sims at both resorts and tourist areas provide plenty of opportunities for characters to network, make new friends, and learn new social gestures (such as bowing, which the kimono-wearing locals at the tea garden can teach you). When your vacation is over, your sims check out of the hotel and can return home with plenty of mementos. Aside from purchased or scrounged souvenirs, which may appeal to pack rat players who simply must collect everything, your sims may have photos taken with the game's new photo camera, which lets you snap family photos (or ask a kind passerby to get a group shot for you). In addition, if your sims had a great time on their vacation, they'll be able to choose useful bonuses to their abilities on returning home, such as increased productivity at work, faster skill learning, and, perhaps most useful, an additional slot for their immediate ~wants~--the short-term personal goals each sim carries around that, when fulfilled, can lead them to true happiness. Having a great vacation can let you unlock additional bonuses for your sims. The expansion looks and sounds about as good as you might expect from the consistently high-quality expansion packs we've seen for The Sims 2. The tourism lots and the resorts are all very colorful and look very different from the standard neighborhood lot, though some of the higher-end, amenity-packed resorts and some of the tourist areas, like the winding, mazelike temple ruins, are sometimes a bit too crowded with objects and people, so sometimes you'll have to play with the camera a bit more to keep tabs on your family. Since the game still lacks much in the way of further optimization, the sometimes-sluggish Sims 2 camera still has a tendency to slow down when there are lots of objects onscreen, especially at crowded locations. Fortunately, you can edit any of these vacation lots to your liking if you care to. The expansion's music is as upbeat as ever, and some festive holiday tunes have been added that fit seamlessly into the game, along with the new nonsensical ~simlish~ voice samples your characters will make as they try out new activities like playing pirate or meditating. Most of Bon Voyage's additional content comes in the form of lighthearted and handy extras that don't seem to fundamentally change the way The Sims 2 is played. Still, the expansion adds enough variety and ease of use to be worth playing. Obsessive Sims 2 fans will probably want the expansion for the collection-based gameplay and the prospect of bonus want slots; casual Sims 2 fans should enjoy just getting out of the house and taking a holiday."}