{"ref": "https://www.gamespot.com/reviews/tom-clancys-splinter-cell-chaos-theory-review/1900-6121743/", "date": "April 5, 2005", "game_name": "Tom Clancy's Splinter Cell: Chaos Theory", "text": "The old adage ~if it ain't broke, don't fix it~ likely gets tossed around a lot in mobile development studios. Tom Clancy's Splinter Cell Chaos theory is a modest update to one of the best games of last year, and it is therefore a terrific--if familiar--experience. While, like its console brethren, Chaos Theory has been tipped a little toward the action side of stealth action, its core gameplay could hardly be called a departure from that of Pandora Tomorrow. If you've played previous Splinter Cell iterations, you'll find Chaos Theory to be an incremental update, with better graphics and a few new toys for Sam Fisher. Sam's back, and he is (just barely) better than ever. In Chaos Theory, you reprise the role of Sam Fisher, a hard-boiled special agent--called a Splinter Cell--trained in the infiltration and disruption of terrorist organizations. Like any stealth operative worth his salt, Sam is given instructions through a headset communicator, and he executes these orders with deadly precision. Sam can wield a variety of weapons, including grenades, handguns, and self-propelled explosives, but he'll have to find these on the field, as he begins the game unarmed. As with previous Splinter Cells, it's possible to complete your objectives without firing a shot. It's likely, however, that you'll want to execute a few of your foes using old-fashioned brute force. Chaos Theory doesn't discourage this approach, apart from docking you a few points for every shot fired. When you alert a foe to your presence, rather than silently executing him, you'll set off an alarm. Fortunately, these alarms are deactivated within seconds. It's still not possible to shoot while moving, though, so it's impossible to run and gun your way through the game. Chaos Theory is the best-looking 2D Splinter Cell yet, but not by a wide margin. Still, that means this game's graphical quality is almost peerless on the LG VX7000. With each successive game, Gameloft seems to get better at drawing various levels of ambient light. You'll learn to remain enshrouded in chiaroscuro, or risk exposure. Hide in the shadows or shoot people in the head--it's up to your discretion. There's nothing wrong with Chaos Theory's sound, either. The music is heart-poundingly percussive and is reminiscent of Danny Elfman's Mission: Impossible score. The tunes cut out as soon as you fire a shot, though, which is perhaps the biggest incentive to take a non-violent approach. Tom Clancy's Splinter Cell Chaos Theory is a terrific game in its own right, even if it doesn't stray far from the established formula. Veterans of previous Splinter Cells will be pleased with this game, while series newcomers will find Chaos Theory the most accessible SC title yet, as it allows one to use the ~fifth freedom~ unabated."}