{"ref": "https://www.gamespot.com/reviews/the-godfather-review/1900-6146252/", "date": "March 20, 2006", "game_name": "The Godfather", "text": "The Godfather is widely regarded as one of the greatest films of all time. So when Electronic Arts announced that it was making a game based on the license, it made sense as a business venture, but it also seemed like a risky move to adapt such a beloved and well-known story to a video game. Luckily, that risk paid off. The Godfather is a satisfying, lengthy adventure, and more importantly, it remains faithful to the classic film while managing to create a compelling story of its own. Even though you play as an all new character, the game still manages to stick closely to the events in the movie. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: The Godfather Video Review The Godfather puts you in the role of a peripheral character that didn't appear in the film, but nevertheless played a critical role in the story. While the character is by no means an official write-in from Mario Puzo or Francis Ford Coppola, he manages to mesh fairly well with the rest of the story, a large part of which is taken directly from the film. When you start the game, you can create a mobster using customization tools similar to those found in the EA Sports games. You then begin the game and watch your father get gunned down in the streets by rival mobsters. Flash forward a few years to the wedding scene from the opening of the film, and your mother is asking the Don to take you under his wing and offer you work. As we learned from the film, no Sicilian can refuse a request for a favor on his daughter's wedding day, so the Don sends the imposing Luca Brasi to look after you and teach you how to be a mobster. You start off as an unofficial enforcer for the Corleone family, which means your job is to muscle merchants into paying you protection money. You do this by simply walking into a store and talking to the owner. Usually the owners won't simply give in, but you can intimidate them by smashing up their stores (or their faces) until they start to see things your way. Once you take over a business, you get a payout each week, and there are dozens of shops you can shake down all throughout the five areas of New York. Some stores are fronts for illegal rackets, such as brothels, gambling dens, and illegitimate importing operations, and you can buy out these rackets to further increase your weekly income. Extorting businesses and taking over rackets isn't all there is to do, though. There are plenty of story missions that you'll pick up as you play. Some missions are taken directly from the movie. You'll have to drive the Don to the hospital after he's gunned down in the street, travel to Hollywood to reenact the famous horse head scene, plant the pistol for Michael Corleone to use to off Sallazzo in the diner, and more. Most of the scenes are very faithfully re-created for the game, and it's great to be able to take part in some of the most memorable moments from the film, such as Sonny's ambush at the toll plaza and the assassinations of the Dons intercut with scenes from the baptism of Michael Corleone's niece. In fact, the best part of The Godfather is that it handles the source material respectfully and manages to offer enough new content to feel like more than just a by-the-numbers adaptation of the movie. Helping to keep the game faithfully tied to the movie is the accurate depictions of the Corleone family members. With the exception of Michael, all of the characters look and sound just like they did in the movie. The voice acting is mostly excellent, with the exception being some of the stock characters that populate the city beyond the Corleone compound. The music is taken directly from the movie, and while you'll hear the main theme a few too many times throughout the game, the music adds a nice touch of authenticity. This game borrows heavily from GTA, but that isn't necessarily a bad thing. In addition to the characters, the city of New York has been carefully rendered in detail, and you can spot specific scenes from the film as you travel the streets of Little Italy, Brooklyn, Midtown, Hell's Kitchen, and New Jersey. The city might be a bit too accurate, though, because some of the streets are confusing, making it a hassle to get around town. There are a lot of interiors in the game as well, which you can freely enter without any load times. Unfortunately, most of the interiors are heavily recycled, so you'll see the exact same bakery, hotel, flower shop, and mob-family compound several times throughout the game. The Godfather borrows heavily from the Grand Theft Auto series of games, so you can expect the same senseless violence and absurd mayhem those games are known for. You can steal cars, run down pedestrians, shoot people at random, and evade the police. As you commit crimes, your heat gauge increases, and anywhere from one to five badge icons will appear on the screen to indicate how badly the cops want to take you down. It's easy to avoid the police for the most part, and you can bribe them if you don't feel like a chase. If you don't bribe them, they'll try to run you off the road, but the cars handle so well in the game that you can deftly weave through traffic to avoid being caught. If you are caught, you're simply killed, which isn't such a big deal, since you get revived at the nearest hospital for a small fee. You might as well get used to it though, because you'll die often in The Godfather. Some of the missions are quite difficult, usually because you have to face dozens of mobsters all by yourself. It also doesn't help that a single round from a shotgun can take you down in an instant. You can find health tonics from time to time, but you'll need to take cover and plan your attack wisely if you want to live. You never know when a mob war will break out, so it's best to carry plenty of weapons with you at all times. The gunplay in The Godfather is simple but effective. You can lock on to enemies with the press of a button, and you can duck or back up against a wall for cover. If you want, you can switch to free aim mode, which controls a lot like your standard first-person shooter, where one stick controls your movement and the other controls your aim. The guns in the game range from a .38 special revolver to a tommy gun to a snub-nosed shotgun. There's also a variety of other weapons, including Molotov cocktails, sticks of dynamite, and lead pipes. All of the guns can be upgraded two times at back-alley arms dealers. You can carry all of these weapons at the same time, too, effectively turning you into a one-mobster army. There are several scripted execution moves as well, and you're rewarded for your brutality in the form of respect. If you prefer to get your hands dirty, you can simply beat the life out of anyone you encounter. You lock on with one button, and then use the right analog stick or mouse to throw punches, slam opponents into walls, or even toss them off rooftops. You can also strangle your enemies and perform neck-breaking execution moves. Combat is fun overall, especially because you're given a healthy set of options when it comes to executing people. The artificial intelligence is fairly good for most of the enemies. They'll often run for cover, team up on you, and duck behind objects. Occasionally, though, you'll run into some glitchy or just plain dumb enemies. Sometimes an enemy won't be facing you, but somehow he'll be pelting you with lead. Other times, enemies will simply stand around as you blast them, or they'll draw weapons and then put them away for some reason. Despite the infrequent AI oddities, the combat in The Godfather is a bloody good time. As you indiscriminately waste people, extort businesses, and complete missions, you'll earn respect points. When you earn enough respect, you level up so to speak, and you can distribute skill points to learn new abilities and improve your stats. You can level up fighting, shooting, street smarts, speed, and health. These bonuses, along with the upgraded weapons, help tremendously later in the game as the missions become more difficult. As much as we hate to say it, it seems obligatory at this point, so here goes: This is an offer you can't refuse. The game looks slightly better on the Xbox than the PlayStation 2, but the PC version looks the best thanks to some higher resolution textures. The controls are best suited to the dual analog control scheme, and using the mouse and keyboard on the PC is awkward at best. The PC version does support USB gamepads, which is a big improvement over the standard control scheme. Aside from the controls, the PC version has a slightly less steady frame rate than the console versions, but all the versions do suffer from occasional choppiness. With the sheer number of businesses to extort and missions to complete, you can easily spend 20 hours working your way up through the ranks and eliminating other families before finally becoming the Don of New York City. You can unlock bonus clips from the movie by collecting 100 film reels that are scattered throughout the city, so there's definitely plenty to do in The Godfather. If you're a fan of the film, you'll appreciate the way the game pays tribute to the movie. Even if you've never seen the film, the satisfying combat and challenging missions make this game worth playing. You might as well get used to it though, because you'll die often in The Godfather. Some of the missions are quite difficult, usually because you have to face dozens of mobsters all by yourself. It also doesn't help that a single round from a shotgun can take you down in an instant. You can find health tonics from time to time, but you'll need to take cover and plan your attack wisely if you want to live. You never know when a mob war will break out, so it's best to carry plenty of weapons with you at all times. The gunplay in The Godfather is simple but effective. You can lock on to enemies with the press of a button, and you can duck or back up against a wall for cover. If you want, you can switch to free aim mode, which controls a lot like your standard first-person shooter, where one stick controls your movement and the other controls your aim. The guns in the game range from a .38 special revolver to a tommy gun to a snub-nosed shotgun. There's also a variety of other weapons, including Molotov cocktails, sticks of dynamite, and lead pipes. All of the guns can be upgraded two times at back-alley arms dealers. You can carry all of these weapons at the same time, too, effectively turning you into a one-mobster army. There are several scripted execution moves as well, and you're rewarded for your brutality in the form of respect. If you prefer to get your hands dirty, you can simply beat the life out of anyone you encounter. You lock on with one button, and then use the right analog stick or mouse to throw punches, slam opponents into walls, or even toss them off rooftops. You can also strangle your enemies and perform neck-breaking execution moves. Combat is fun overall, especially because you're given a healthy set of options when it comes to executing people. The artificial intelligence is fairly good for most of the enemies. They'll often run for cover, team up on you, and duck behind objects. Occasionally, though, you'll run into some glitchy or just plain dumb enemies. Sometimes an enemy won't be facing you, but somehow he'll be pelting you with lead. Other times, enemies will simply stand around as you blast them, or they'll draw weapons and then put them away for some reason. Despite the infrequent AI oddities, the combat in The Godfather is a bloody good time. As you indiscriminately waste people, extort businesses, and complete missions, you'll earn respect points. When you earn enough respect, you level up so to speak, and you can distribute skill points to learn new abilities and improve your stats. You can level up fighting, shooting, street smarts, speed, and health. These bonuses, along with the upgraded weapons, help tremendously later in the game as the missions become more difficult. As much as we hate to say it, it seems obligatory at this point, so here goes: This is an offer you can't refuse. The game looks slightly better on the Xbox than the PlayStation 2, but the PC version looks the best thanks to some higher resolution textures. The controls are best suited to the dual analog control scheme, and using the mouse and keyboard on the PC is awkward at best. The PC version does support USB gamepads, which is a big improvement over the standard control scheme. Aside from the controls, the PC version has a slightly less steady frame rate than the console versions, but all the versions do suffer from occasional choppiness. With the sheer number of businesses to extort and missions to complete, you can easily spend 20 hours working your way up through the ranks and eliminating other families before finally becoming the Don of New York City. You can unlock bonus clips from the movie by collecting 100 film reels that are scattered throughout the city, so there's definitely plenty to do in The Godfather. If you're a fan of the film, you'll appreciate the way the game pays tribute to the movie. Even if you've never seen the film, the satisfying combat and challenging missions make this game worth playing."}