{"ref": "https://www.gamespot.com/reviews/hexic-2-review/1900-6176751/", "date": "August 16, 2007", "game_name": "Hexic 2", "text": "Hexic HD was the Bejeweled-like, gem-rotating puzzle game that came for free on the hard drives of Xbox 360 Premium consoles. As a free game it was a pretty smart choice, because anyone can enjoy a quality puzzle game, at least for awhile. Now, Microsoft and Carbonated have reteamed to deliver a sequel that successfully builds on the Hexic formula. While it might seem a little steep to pay $10 for a game that isn't vastly different from a free pack-in, the new online play and additional special pieces make it a worthy successor to the original game. It's gettin', it's gettin', it's gettin' kinda Hexic. The game is based around you rotating three-piece clusters of gems on a playfield. If three gems of the same color connect on two or more sides, they pop and vanish from the pit, causing more gems to fall into play. You can only make moves that create matches, but there are more special pieces in the sequel than there were in the original game. Each special piece has its own unique way of moving pieces, which gives you a way to transport gems around even if they don't make a match. Creating special pieces and upgrading them to even more special pieces, such as rubies and black pearls, is still quite tricky. If the special pieces get in the way, or if you need a quick way to get rid of a bomb, you can hold down the B button on a special piece to cause it to explode. The three modes from the original Hexic return in the sequel. Marathon mode lets you play at your own pace, and you can conceivably play forever, provided that the colored bombs that occasionally drop onto the playfield are defused before they explode. One explosion ends your game, and you win by creating a combo involving multiple black pearls. Timed mode has a clock that counts down, but you're given more time for removing gems, which forces you to work fast. Survival mode doesn't immediately replace popped gems with new ones; when you run out of moves, the remaining pieces are locked into place, and then new gems fill the gaps. Battle mode is the new mode addition to Hexic 2, and it's a multiplayer take on Hexic that has a Lumines-like feel to it. The pit is widened and split down the middle, giving each player a place to play. The goal is to fill a meter before your opponent can, and it fills slowly as you remove gems. Each gem color contributes to one of four tanks at the top of the screen, and when they're filled, you can execute special moves, like locking a bunch of your opponent's pieces, sending your opponent a bomb, sliding the center line over to shrink your opponent's playfield, or removing a bunch of gems from your own side to make larger combos easier. It has a frenetic pace that the other modes lack, giving it an entirely different feel from the rest of the game, but it's still just as satisfying. Battles can be played alone with three difficulty settings, locally against another player, or online. Taking it online is the best way to find competition, but you might notice a little lag in some matches. It's not a big deal. In battle mode, you've got the power to unleash attacks on your enemies. Hexic 2 makes a solid upgrade to the flat, 2D visuals of the original game. The gems are polygonally rendered and, presumably for the colorblind, available in seven different color and pattern configurations. If you have trouble seeing certain colors, you should be able to cycle through them until you find a setting that works. The previous game offered patterns on the gems, but not on the bombs. Here, the patterns are mapped onto the bombs as well, which is a much-needed addition. The game feels slightly darker, with its brooding, black background and sparse electronic music, but it's nice, overall. If you were a fan of the original Hexic, you'll find plenty of things to like about Hexic 2. The new special pieces really make an impact on how the single-player game is played, and the new battle mode is a lot of fun. If you're after a first-rate puzzle game, Hexic 2 fits the bill nicely."}