{"ref": "https://www.gamespot.com/reviews/rollercoaster-tycoon-review/1900-6025507/", "date": "October 3, 2013", "game_name": "RollerCoaster Tycoon", "text": "RollerCoaster Tycoon on the Xbox is a quick-and-dirty port of the best-selling PC strategy game of the same name, which was originally released in 1999. Like the many other 'Tycoon' games that since have followed its lead, RollerCoaster Tycoon hands you control of a vast entrepreneurial enterprise--in this case, you're in the theme park biz--and lets you exercise a huge number of construction and control options as you build your fortune. The Xbox version includes the original PC game and its two expansions, Corkscrew Follies and Loopy Landscapes, so hard-core strategy fans will find a lot of value in this $30 package. However, the game's visuals are incredibly dated, and there's no real action to speak of, so those in the market for a more modern-looking and quick-playing game will want to pass this one over. RollerCoaster Tycoon is a port of one of the PC's most successful strategy games ever. To begin playing RollerCoaster Tycoon, you select from a large number of premade landscapes and attempt to build a theme park, either from the ground up or by adding onto an existing layout, and then fill it with as many paying customers as you can. You're given a goal in each scenario that basically consists of ~have X patrons by month Y, year Z, with a park rating of A.~ As you build your park, you'll notice the incredible amount of control you have over nearly every variable involved in the construction and upkeep of your operation. You could spend countless hours in RollerCoaster Tycoon just tweaking minor details to see how they affect the attendance rate and happiness of your customers. Each scenario starts you out with a number of rides, smaller buildings, and decorations that you can construct, and you can divert more money to research and development to make new rides available more quickly. Once you've built something, be it a roller coaster, merry-go-round, or hamburger stand, you can configure it precisely to your own standards. With a roller coaster, for instance, you can set the price of the ride, the number of times the cars go around, the minimum load of the cars before they'll take off, the frequency of mechanical servicing...the list goes on and on. As if that weren't enough, you can hire different service workers, such as maintenance technicians, dancing mascots, and security guards, to enhance the atmosphere of your park. When building the larger rides, such as various roller coasters or a log flume, you can either construct preset rides or build your own by laying out the tracks piece by piece, adding as little or as much complexity as you want. You can even form the land to your liking, flattening it out to accommodate more rides or creating hills and valleys as you see fit. The upshot of all this, of course, is that the meat of RollerCoaster Tycoon's gameplay is in customizing everything--layout, colors, prices--until you've got a winning formula and you're turning a tidy profit. Overall, playing RollerCoaster Tycoon is a pretty painless affair once you get over its modest learning curve. The game's control scheme hasn't changed any since it was released for the PC in 1999--here, you simply use the controller's thumbstick to move the cursor around instead of a mouse. There are a lot of windows to deal with, but they've all got pop-up labels and are laid out intuitively enough that you can learn your way around the interface pretty quickly. Alas, the game's included tutorial isn't very informative, so if you do need help, you'll have to turn to the print manual. After you've spent an hour or two with the game, you can plant new buildings, move the camera around, and check on your yearly attendance graph as though it's all second nature. It's not much to look at, but RollerCoaster Tycoon has great gameplay and plenty of depth. You play RollerCoaster Tycoon from an isometric overhead perspective. The graphics are all entirely 2D, and frankly they haven't aged very well. While it might be unrealistic to expect a massive 3D overhaul, it's still a little disappointing to see the same 10-pixel people running around your park that were running around four years ago on the PC. The visuals do get the job done, and this kind of game isn't about graphics in the first place, so it can't really be faulted because it's not as pretty as Panzer Dragoon Orta. The game's sound is very sparse. There is no real theme music and no speech at all; rather, you'll simply hear the ambient sounds of your park as you're playing. Each ride does generate its own sounds, so you'll hear screams every time the cars fly around your coaster or some happy circus music when you hover over the merry-go-round. RollerCoaster Tycoon is hardly the game to show off your Xbox, but it works fine for what it is. RollerCoaster Tycoon is good, but if you're not into slowly paced strategy games that require a lot of patience and number-tweaking without a lot of tangible payoff, it's not really for you. The game offers no Xbox-specific enhancements over the PC version, but it's nice to be able to play it on a big television from your sofa. Armchair tycoons who haven't already played RollerCoaster Tycoon to death on their PCs should find a lot to like here."}