{"ref": "https://www.gamespot.com/reviews/vampire-night-review/1900-2823600/", "date": "November 8, 2001", "game_name": "Vampire Night", "text": "It's no secret. Arcades are a phenomenon that is quickly slipping into the past. As a genre of games that essentially lives and dies with the arcade, this spells trouble for the light-gun game. In a turn of events that will no doubt bring joy to light-gun game fans the world over, two of the most prominent light-gun game publishers, Namco and Sega, have pooled their resources and brought in Wow Entertainment, one of the top light-gun game developers, to create Vampire Night, an unofficial sequel to Wow Entertainment's popular House of the Dead series. The result is unquestionably the best-looking light-gun game ever released, as well as a game that will seem instantly familiar to House of the Dead fans while still pushing their skills.As previously mentioned, Vampire Night is a House of the Dead game only in spirit, with hordes of flesh-eating zombies being swapped out with hordes of vampire minions. The story revolves around Light and Shadow, a pair of steely vampire hunters bent on destroying a powerful vampire who has taken a small medieval village under his control. There is also a crew of five colorful vampires that range from the lightning-fast vampire night to the elegant and beautiful ice queen, who serves as the game's level bosses. Rounding out the cast is a pigtailed young villager who follows Light and Shadow through most of the game and is generally so screechy and annoying that even the game's protagonists seem bothered by her presence.The game pretty much follows the standard light-gun formula with little deviation. You travel on a predetermined course from one end of a level to the other, pausing along the way to kill off wave after wave of enemies, with the end of each level punctuated with a two-stage boss fight. Initially appearing in their human forms, the bosses will transform into menacing monsters halfway through the fight. You can pick up extra point bonuses and extra health by shooting crates, barrels, and other select pieces of scenery. At some point in any modern light-gun game, you'll have to save innocent bystanders from the wrath of whatever evil force you might be fighting. Vampire Night has a unique take on this convention. Instead of staving off the ravenous undead or a gun-wielding terrorist, you'll come upon villagers in each level with a large parasite attached to their bodies. Get a clean shot at the parasite, and you'll save the villager. Shoot any other part of the villager, and the parasite will consume his or her body, turning the villager into a nasty vampire with no love for you. This is a fine example of the game's focus on precision shooting. Make no mistake, you'll have pumped several hundred rounds into vampire flesh in a single level, but each enemy you come upon will have a weak point, usually highlighted by a small glowing blue circle, and you can dispose of the enemies with fewer bullets if you target their weak points. Enemies are also incredibly fast and nimble, and the overall difficulty of Vampire Night will no doubt put your hand-eye coordination to the test.Aside from the arcade mode, Vampire Night offers some extras. There is the extensive training mode, which consists of 17 different minigames that help hone your ability to shoot quickly and accurately. The ~special~ mode puts you through the paces of the arcade mode with hilariously out-of-place objectives, like collecting nuts for a villager. You can use points gained from completing these tasks to purchase special weapon and armor power-ups, making your job of wasting vampires a little bit easier.The polish that the game exudes proves that Wow Entertainment has a strong handle on the PlayStation 2 hardware. The levels vary from a tranquil, snow-covered cemetery to the hot, dank recesses of a medieval castle without ever compromising the game's overall visual style. Enemies are well animated, and their movement defines them almost as much as their bizarre, otherworldly appearance. But what Vampire Night excels at more than anything else is special effects. Instead of just falling down and fading away when shot, enemies will experience the disintegration and crumbling away of flesh from their bones. The game's first boss is a quick-footed vampire night who can move faster than a blink of the human eye. As he speeds up and slows down, you'll see him warp in and out of sight. The execution of this effect has to be seen to be believed and is one of the better special effects we've seen on the PlayStation 2 to date. Vampire Night is full of these small details, and while a light-gun game is all about the gameplay, having all this tasty eye candy certainly doesn't hurt. Those who have played through House of the Dead 2 are keenly aware of the preternaturally awful voice acting that Wow Entertainment is capable of. Delivered in either a mechanical monotone or with heaps of dinner theater panache, the voice work added an ironically campy edge to the game. With Vampire Night, Wow proves that it's in on the joke by supplying hammy dialogue that makes the voice acting in House of the Dead 2 sound profoundly subtle and underplayed. Depending on which side of the kitsch line you stand, this is either a fun addition and a nice contrast against the macabre setting of the game or an annoying distraction that inspires you to skip the cutscenes and kill off any villager before he or she has a chance to talk to you. The music that accompanies your vampire hunting is a bit more appropriate to the subject matter, consisting of ambient techno with a strong gothic influence. If you're looking for a revolutionary light-gun game, something that tears down all the old conventions and delivers an entirely new and fresh experience, then you'll be sorely disappointed with Vampire Night. But what Vampire Night lacks in innovation, it makes up for with top-of-the-line production value, a challenging level of difficulty, and above and beyond some of the campiest voice acting ever.The polish that the game exudes proves that Wow Entertainment has a strong handle on the PlayStation 2 hardware. The levels vary from a tranquil, snow-covered cemetery to the hot, dank recesses of a medieval castle without ever compromising the game's overall visual style. Enemies are well animated, and their movement defines them almost as much as their bizarre, otherworldly appearance. But what Vampire Night excels at more than anything else is special effects. Instead of just falling down and fading away when shot, enemies will experience the disintegration and crumbling away of flesh from their bones. The game's first boss is a quick-footed vampire night who can move faster than a blink of the human eye. As he speeds up and slows down, you'll see him warp in and out of sight. The execution of this effect has to be seen to be believed and is one of the better special effects we've seen on the PlayStation 2 to date. Vampire Night is full of these small details, and while a light-gun game is all about the gameplay, having all this tasty eye candy certainly doesn't hurt.Those who have played through House of the Dead 2 are keenly aware of the preternaturally awful voice acting that Wow Entertainment is capable of. Delivered in either a mechanical monotone or with heaps of dinner theater panache, the voice work added an ironically campy edge to the game. With Vampire Night, Wow proves that it's in on the joke by supplying hammy dialogue that makes the voice acting in House of the Dead 2 sound profoundly subtle and underplayed. Depending on which side of the kitsch line you stand, this is either a fun addition and a nice contrast against the macabre setting of the game or an annoying distraction that inspires you to skip the cutscenes and kill off any villager before he or she has a chance to talk to you. The music that accompanies your vampire hunting is a bit more appropriate to the subject matter, consisting of ambient techno with a strong gothic influence. If you're looking for a revolutionary light-gun game, something that tears down all the old conventions and delivers an entirely new and fresh experience, then you'll be sorely disappointed with Vampire Night. But what Vampire Night lacks in innovation, it makes up for with top-of-the-line production value, a challenging level of difficulty, and above and beyond some of the campiest voice acting ever."}