{"ref": "https://www.gamespot.com/reviews/the-polar-express-review/1900-6114519/", "date": "December 6, 2004", "game_name": "The Polar Express", "text": "As a game based on a movie based on a book, The Polar Express is two degrees removed from the original vision of children's author Chris Van Allsburg, whose surrealist yuletide imagery won him a Caldecott Medal in 1986. One would assume that the video game purveyors of such a beloved property would feel pressure to be faithful to book and film, as they are both products of considerable talent. Instead, the end result of this game's development is a directionless hack job. An ugly collection of poorly conceived minigames, The Polar Express is a failure by the standards of any medium. It may be a blessing that this game is also extremely short, such that it can be completed by its target audience in about as much time as it takes to watch the film. Unlike Van Allsburg's award-winning book, The Polar Express game is devoid of any artistic merit. Most of The Polar Express takes place on a magical train destined for the elfin metropolis of the North Pole. As the bathrobe-clad, anonymous ~hero boy,~ you take it upon yourself to ensure that all the children on the train arrive safely. At first, you'll have to contend with Scrooge, a misanthropic puppet who frequently steals the children's tickets through some manner of prestidigitation. Each room on the train is a simple sort of minigame in which the object is usually to defeat some of Scrooge's mechanized underlings, thereby advancing toward one of your compatriots' lost tickets. One relatively memorable minigame has you sneaking by an angry chef, whose head will project a Metal Gear-style exclamation point should a noise arouse his suspicion. Another game has you climb atop the train to chase the conductor to some unknown point where he plans to jettison your ponytailed romantic interest--unless, of course, you can supply her missing ticket. By far the strangest of these sequences, however, are Polar Express' several rhythm-action games, which require nothing of you, save the arrhythmic tapping of buttons in conjunction with the faintest touch of background music, probably culled from the film. These games are invariably facile and uninteresting. At about the game's halfway point, you'll defeat Scrooge, using snowballs to hit him in his nose and exposed chest. Once the Polar Express' only villain is defeated, this already disjointed game loses all semblance of direction. The second 40 minutes of gameplay feels even more meaningless than the first. At this point, the game is frequently interrupted by cinematics taken from the movie. Featuring much better voice talent than was used in the game, along with infinitely superior art and music direction, these movies feel like a total tease. They also expose The Polar Express for what it is--nothing more than a commercial extension of the film license. The game is over before it begins, and will leave even the youngest of tykes painfully aware that they've been cheated. Thirty dollars is rarely enough money to spend for an experience clocking in at under an hour and a half, especially if that experience is devoid of any enjoyment. The Polar Express' film footage makes the game's presentation look all the more shoddy by comparison. In a halfhearted effort to provide some replay value, The Polar Express lets you unlock some of the minigames from the story mode for individual play. However, it's difficult to see why any child would want to endure these a second time. In the PlayStation 2 version of The Polar Express, two of these games involve the EyeToy. Incredibly, these are even worse than their controller-driven counterparts. One has you wipe the snow off the windshield of the Polar Express train before it accumulates to the point where your vision will be obscured. In line with the rest of the game's visuals, this snow looks like it was scribbled in Microsoft Paint. The other EyeToy game has you decorate a Christmas tree by waving your hand over the appropriate areas. Occasionally, one of Scrooge's puppets will attempt to ruin your work, so you'll have to swat him away. Obviously, the GameCube version doesn't include these two particular games. No loss there. The Polar Express really feels like a soulless video game cash-in on the movie. Providing so little for the parental holiday dollar certainly isn't in the Christmas spirit the game purportedly teaches kids to cherish. No matter who you are, this is a train you'd be better off missing."}