{"ref": "https://www.gamespot.com/reviews/sonic-battle-review/1900-6086442/", "date": "January 13, 2004", "game_name": "Sonic Battle", "text": "Multiplayer party games can provide a room full of people with hours of knock-down, drag-out competition, especially if you're playing them on the Nintendo GameCube or the Microsoft Xbox. Since both systems already have four controller ports, all you need to get a shindig going is a game like Mario Party, Super Smash Bros. Melee, or Fuzion Frenzy and one or two of your friends to bring over any additional controllers you might need. While this setup works fine on a system such as the GameCube, playing multiplayer party games isn't nearly so easy on a handheld console such as the Game Boy Advance. In order to start a game with four players, you'll need four systems, four game cartridges, and at least three link cables. Nonetheless, if you're in the mood for a melee fighting game on the go, and you can find two or three other people willing to make the investment necessary to duke it out with you, then Sega's Sonic Battle is a good choice. Sonic Battle gives four players the opportunity to link up and fight it out on the go. The easiest way to describe Sonic Battle is to call it a portable version of Super Smash Bros. Melee, except that instead of using Nintendo's characters to fight your battles, you and your friends can choose any of 10 different characters from Sega's Sonic Adventure series. The goal in Sonic Battle, much as it is in Super Smash Bros., is to score more knockouts than your opponents by the time the match ends. This isn't a fighting game in the traditional sense, though. The combat system is remarkably simple, and the pace is lightning fast. Most attacks are performed using a combination of the directional pad and the B button, while the A button and the L trigger allow you to jump and guard. There are numerous ways to juggle an opponent in midair, and attacks generally dole out massive amounts of damage. Each character has three special attacks--one of Knuckles' is a meteor smash. Besides the portability factor, there are a few other key differences that distinguish Sonic Battle from Super Smash Bros. First, each character in Sonic Battle has three different special attacks, which you can designate as airborne-, ground-, or guard-based. Sonic's spin-dash, for example, acts as a dive-bomb move if you select it as an aerial attack, but if you assign it as a ground attack, it launches a powerful gust of wind across the screen. Another of the game's unique aspects involves your ability to regain health and to store energy into a power reserve just by holding down the guard button. Once the bar is full, you can unleash a one-hit knockout using one of your character's special moves. Whereas you might go 30 seconds or more between knockouts in a game like Super Smash Bros., the typical span between points in Sonic Battle is more like 10 seconds or less. That sort of frantic, intense pace is perfect for a portable game system like the Game Boy Advance. If you're a fan of the Super Smash Bros. games, the biggest gripe that you may have with Sonic Battle is that the layouts of the arenas don't play a strategic role in the outcome of matches. In Super Smash Bros., you need to be aware of jet cars whizzing by on the F-Zero stage or of bombs falling to the ground in front of the princess's castle. The arenas in Sonic Battle provide a great degree of three-dimensional movement, but they're generally rectangular in shape and don't offer much in the way of interactivity. You can toss opponents into walls and perch atop boxes, but the majority of combat takes place on flat ground. This shortcoming doesn't have much of an impact on the game's fun factor, though, because the combat itself is so lively and satisfying. Sonic Battle has a good variety of solo and multiplayer play modes, but the battle mode stands out as the game's best feature--primarily because your opponents are the same living, breathing, unpredictable people you interact with on a daily basis. With four players, you can choose to fight it out battle royal style or pair up into teams. If you can't pull together four live players, you can have the CPU substitute for any empty spots. The CPU has multiple skill settings and tends to put up a good fight at higher levels. You can choose a variety of match types, time limits, and handicap options as well. Other play options include challenge and practice modes, minigames that you can play with your friends using only a single cartridge, and a story mode that takes you through the long process of designing your own custom character. The story mode allows you to customize your own character with more than 100 unique attacks. The story mode is worth the 10 or so hours it takes to complete, if for no other reason than it gives you the opportunity to design your own unique character. Each of the story mode's eight individual episodes lets you play as a different character from the Sonic Adventure games and is set up as a series of fights interspersed with dialogue sequences. Despite the presence of familiar personalities such as Sonic, Knuckles, Rouge, and Dr. Eggman, the real star of this mode is Emerl, the robot that tags along as you work to unravel Dr. Eggman's latest scheme. Emerl learns new attacks by seeing them used in battle. When he learns an attack, you earn a card, which allows you to toggle the skill on or off in the robot's setup menu. You can assign normal, heavy, and midair attacks, run and dash moves, and even healing moves and fighting stances. To enable each move, you must have a certain number of skill points, which you earn by defeating opponents in the story mode. There are hundreds of unique attacks to acquire, so, chances are, the Emerl you end up with won't be the same as the one your friend puts together. Sonic fans will recognize the majority of attacks, like Sonic's spin-dash. Even though there aren't any pinball machines or bumpers to play around with in any of the battle arenas, Sonic Battle still manages to capture many of the essential qualities that characterize the traditional, adventure-based Sonic games. The characters fight using the same moves they have in Sonic Advance or Sonic Adventure, and the animation is fairly similar as well. For example, Sonic tosses out a ring before certain attacks, Tails uses his foxtails to hover around, Knuckles can attack with a midair punch attack, and Cream uses her chao pet, Cheese, to do most of her dirty work. The plot that plays out during the story mode also does a wonderful job of conveying the roles and personalities of each of the characters so that even if you're not familiar with any of the previous Sonic games, you'll know who's who by the time you've completed all eight separate chapters. From a purely technical standpoint, it doesn't hurt that the stages are fully 3D and that the characters speak up with voice samples taken from the Sonic Adventure series. These finishing touches really help the game make a lasting impression. You really can't talk about a game like Sonic Battle without comparing it to Nintendo's Super Smash Bros. Nintendo took the idea of a multiplayer melee fighting game and made it work on the Nintendo 64 and GameCube consoles, but it hasn't yet ventured to do the same on the Game Boy Advance. Sonic Battle is a good substitute for Super Smash Bros, and while you may find it lacking in certain areas, the fast-paced design and raucous battle mode more than compensate for the majority of the game's wholly subjective shortcomings. Sonic Battle has a good variety of solo and multiplayer play modes, but the battle mode stands out as the game's best feature--primarily because your opponents are the same living, breathing, unpredictable people you interact with on a daily basis. With four players, you can choose to fight it out battle royal style or pair up into teams. If you can't pull together four live players, you can have the CPU substitute for any empty spots. The CPU has multiple skill settings and tends to put up a good fight at higher levels. You can choose a variety of match types, time limits, and handicap options as well. Other play options include challenge and practice modes, minigames that you can play with your friends using only a single cartridge, and a story mode that takes you through the long process of designing your own custom character. The story mode allows you to customize your own character with more than 100 unique attacks. The story mode is worth the 10 or so hours it takes to complete, if for no other reason than it gives you the opportunity to design your own unique character. Each of the story mode's eight individual episodes lets you play as a different character from the Sonic Adventure games and is set up as a series of fights interspersed with dialogue sequences. Despite the presence of familiar personalities such as Sonic, Knuckles, Rouge, and Dr. Eggman, the real star of this mode is Emerl, the robot that tags along as you work to unravel Dr. Eggman's latest scheme. Emerl learns new attacks by seeing them used in battle. When he learns an attack, you earn a card, which allows you to toggle the skill on or off in the robot's setup menu. You can assign normal, heavy, and midair attacks, run and dash moves, and even healing moves and fighting stances. To enable each move, you must have a certain number of skill points, which you earn by defeating opponents in the story mode. There are hundreds of unique attacks to acquire, so, chances are, the Emerl you end up with won't be the same as the one your friend puts together. Sonic fans will recognize the majority of attacks, like Sonic's spin-dash. Even though there aren't any pinball machines or bumpers to play around with in any of the battle arenas, Sonic Battle still manages to capture many of the essential qualities that characterize the traditional, adventure-based Sonic games. The characters fight using the same moves they have in Sonic Advance or Sonic Adventure, and the animation is fairly similar as well. For example, Sonic tosses out a ring before certain attacks, Tails uses his foxtails to hover around, Knuckles can attack with a midair punch attack, and Cream uses her chao pet, Cheese, to do most of her dirty work. The plot that plays out during the story mode also does a wonderful job of conveying the roles and personalities of each of the characters so that even if you're not familiar with any of the previous Sonic games, you'll know who's who by the time you've completed all eight separate chapters. From a purely technical standpoint, it doesn't hurt that the stages are fully 3D and that the characters speak up with voice samples taken from the Sonic Adventure series. These finishing touches really help the game make a lasting impression. You really can't talk about a game like Sonic Battle without comparing it to Nintendo's Super Smash Bros. Nintendo took the idea of a multiplayer melee fighting game and made it work on the Nintendo 64 and GameCube consoles, but it hasn't yet ventured to do the same on the Game Boy Advance. Sonic Battle is a good substitute for Super Smash Bros, and while you may find it lacking in certain areas, the fast-paced design and raucous battle mode more than compensate for the majority of the game's wholly subjective shortcomings."}