{"ref": "https://www.gamespot.com/reviews/arthur-and-the-invisibles-review/1900-6165062/", "date": "January 31, 2007", "game_name": "Arthur and the Invisibles", "text": "With the PlayStation 2, PC, and Nintendo DS versions of the Arthur and the Invisibles video game tie-in defying the odds by not being half bad, it was only a matter of time before the other shoe dropped. And sure enough, along comes the Game Boy Advance version to set things right in the universe. This questionably coherent take on the movie equates to an abbreviated, chopped-up version of the not-so-shabby PlayStation 2 and PC versions, and its looping level designs and utter lack of challenge prevent it from being anywhere close to an enjoyable game in its own right. This rhythm-game sequence could have been neat...if it actually had rhythm. The GBA version of Arthur gives you even less of a plot outline than the Nintendo DS version of the game, which is actually kind of impressive considering how little of a movie tie-in was to be found in that version. Instead of playing out the entire adventure like in the PS2 and PC versions, or going in a completely opposite direction like the DS version, the game starts out by giving you some text that is supposed to provide a little context for your adventuring, and you're then launched into a series of short, disjointed, and extremely easy missions divvied up into three chapters that essentially follow the phases of the film--survive the initial henchmen attack on the Minimoy village, travel through your backyard to Necropolis, wreck Necropolis and flee in a toy car. It's a bit like watching the movie in fast-forward, hitting the play button occasionally just to see where you're at. All told, the 20 missions can be burned through in two to three hours. As you jump from one scenario to the next, Betameche, being the irritating troll doll that he is, will explain to you each and every time how to jump, move, attack, and so on--not that any of the controls ever change. In fact, nothing here is even remotely challenging or interesting, as most enemies die in one hit and the ones that don't tend to seize up in indecision, trying to figure how to counter the devastating tactic of jumping over them and attacking from behind. Also, for the most part the game is a one-dimensional side-scroller, so there isn't much in the way of exploring, and puzzles are painfully straightforward. If anything nice can be said about the GBA version of Arthur and the Invisibles, it's that the game tries to present a good amount of variety in the types of missions you'll go on. Nearly every mission has you tackling a different task, whether it be solving environmental puzzles with the standard team, flying on a mosquito as Arthur while you shoot ~tears of death~ at other mosquitoes, or hitting a scrolling series of button sequences. Unfortunately, even though there is variety to the types of missions, there isn't much variety within the actual missions themselves. In fact, levels seem to play out in a continuous loop; you'll come up against the same obstacles laid out in the exact same fashion and enemies waiting for you in the exact same places that you passed just minutes before. And while it's entirely possible that the developers are subliminally urging us to abandon our heathen ways lest we eternally live out a Sisyphean afterlife, it's probably more along the lines of lazy, uninspired level design--or the recognition that a GBA version of this game probably shouldn't have been made. Within these levels, you'll be able to free mul-muls and collect runes, which are used to unlock ~bonus~ content. However, collecting all the mul-muls in any given stage simply lets you play a level you already have access to. And even more worthless, collecting all of the runes decodes a secret message that may as well declare you the king of Zimbabwe, for all the sense it makes or value it imparts. Betameche really just doesn't like you hitting on his sister all the time. Arthur's presentation is equally underwhelming. Backgrounds aren't particularly varied or interesting to look at, and the color palette is pretty bland with its ubiquitous earthy tones. Likewise, the audio just loops two or three tunes, and the other sound effects are just good enough to get the job done. Considering that the presentation went a long way in improving the other versions of this game, it's a bit surprising to see the utterly unremarkable quality on display here. If you enjoyed Arthur and the Invisibles and are looking for more, do yourself a favor and pick up any other version of the game than this one. You'll receive a lot more game for your investment, and perhaps more importantly, you might actually enjoy playing the game you get. Also, it's a rude disservice to fans to price this vastly inferior version at the same point as the other versions--except for the PC version, which is actually $10 cheaper. And if the GBA version is your only option, just go watch the movie three more times, or save your cash for when it comes out on DVD."}