{"ref": "https://www.gamespot.com/reviews/sky-gunner-review/1900-2871462/", "date": "May 17, 2006", "game_name": "SkyGunner", "text": "Sky Gunner is another example of Sony balking at a North American release of a strong game from overseas. Originally released by Sony Japan last year, Sky Gunner is a 3D flight action game featuring a cleverly stylized world and gameplay that's a modern reinterpretation of the frantic play style of classic 2D shooters. Though its visual style is soft and often flowery, the pace of the action is maddening and intense. You'll frequently fight not only throngs of small enemy fighters, but also larger, hulking warships, and you'll often fight them in huge numbers, though this is where the game starts to show its seams. During particularly intense moments, the game exhibits some pretty crippling levels of slowdown. And though some technical concessions were made to help deal with this, these problems still hurt the game. Nevertheless, it's good that Atlus picked this one up for US release, because it's got a lot going for it. Sky Gunner's setting and story are clever and well conceived and do much to engross you in the world and endear you to its characters. The story is also told in very interesting ways--the cutscenes combine the real-time 3D graphics engine with some 2D art to great effect. The story itself focuses on the quiet, idyllic island town of Rive, whose inhabitants hold a yearly exposition to celebrate their level of cultural and mechanical achievement. But at one such expo, terror strikes--an evil genius named Ventre is aiming to steal the centerpiece of the event, the Eternal Engine. It's a sort of perpetual-motion machine, and it's very valuable. Ventre attacks with fighters and warships, and it's up to you, in the role of one of two expert flying mercenaries called gunners, to stop him. These gunners are nowhere near as menacing as they sound, though. They're actually superdeformed, with big heads and big eyes, and adolescent, though they each have unique abilities as well as unique airships that make them formidable and distinct. You start out being able to play as Ciel and Femme, a male and female pair, with their other partner, Copain, unlockable when you play through the game and meet specific requirements. Each character has his or her own distinct scenarios throughout the game's five scenes (with several missions composing each), so playing it through more than once will give you somewhat of a different experience, though the game itself is relatively short. Depending on which control scheme you select at the game's outset, Sky Gunner can be either simple to pick up and play or difficult to come to grips with. Choosing the basic control scheme, which is akin to choosing a similar mode in a game like Ace Combat, will allow you to control all of your plane's movements with the left stick. Most players will get more out of this control setup, as the alternative--the expert mode--is tricky, though considerably deeper. The expert mode maps pitch and roll controls to the analog sticks, with the shoulder buttons controlling your yaw. In other words, it makes the game play like a console combat flight sim. And though you can perform some trickier moves with this mode if you get the hang of it, it's also extremely sensitive, which makes it frustrating at times, especially at first. Regardless of which setup you use, you'll notice several unique things about Sky Gunner's gameplay systems. First off is the camera, which has been pulled off quite well. Essentially, it'll always point in the direction of the enemy or group of enemies that you have targeted, regardless of your own bearing. So in practice, you'll frequently see the front of your plane, speeding away from groups of enemies. This works out pretty well, especially with the basic control scheme. In the expert mode, it sometimes gets confusing to remember to adjust your yaw in the opposite direction to turn, but it eventually sinks in.The camera system does a lot to facilitate the game's various homages to 2D shooters. Specifically, the chain combos that you can execute on enemies wouldn't be quite as feasible if the game's camera weren't so focused on your targets. The concept is simple: You basically get more points the larger the group of enemies that you destroy. Certain enemies will cause chain reactions when they explode in the vicinity of other enemies, and there are special weapons at your disposal that let you destroy many enemies at once. You rack up big points either way. You'll have a number of unique special weapons to help you along. There are three types, and you start off with a limited number of each and can pick up more from enemy squadron leaders. You'll get a huge, javelin-like weapon that turns into a giant crucifix when it hits and impales the hull of an enemy ship, after which you can shoot it with your machine gun to detonate it. Another is a cluster bomb of sorts, which unleashes fireworks-style explosions, damaging all enemies in the blast. The last one fires groups of chattering bear-trap-like devices, which gnaw at the hulls of enemies they hit. You can fire up to three of these weapons at any given time by pressing and holding the circle button when your intended target is in your sights. The targeting system itself is quite versatile, letting you swap between larger groups of enemies (squadrons, battleships, and the like) and individual enemies or parts within the larger groups (such as individual planes in a squadron or armaments on a battleship) with the R2 button. It works remarkably well and provides you with all sorts of combat options at any given time. The technical problems crop up when you encounter just a bit too much of what the game does best. Basically, the game slows down dramatically when there's a lot going on. And we're not talking about a moderate hiccup here and there. The slowdown is downright painful at times, and it seems to have an almost destructive effect on the game's ability to render 3D geometry, as is evidenced by the pixilated effect that occurs alongside the slowdown. Given that the playfields are often pretty full, this sort of slowdown can happen frequently. To remedy this, the game's developer has included a code that you can enter that will let you play the game in a considerably lower resolution, which does much to alleviate the slowdown but of course makes the game look worse. The fact that a cool-looking game has to be marred in such a fashion just to stay playable during its most exciting moments is a shame. And it is a cool-looking game. The ship designs look both fantastical and antique, the graphical style is marvelously realized, and the overall production is pretty much untouchable. When looked at objectively, the graphics are a bit simplistic, but the excellent use of color and the neat arrangements of simple geometric forms for its devices and environments make the game stand out. A nice and varied orchestral soundtrack complements all this: During especially heated battles with giant battleships, for instance, you'll notice the tempo picks up to ~boss music~ speed, while some of the mushier cutscenes lull as is appropriate. The game's dialogue is voiced competently, though the special treat is that you can leave the Japanese voices in and play with English subtitles. Overall, Sky Gunner is a pretty neat game, though one that has some pretty shameful technical issues. Still, it plays really well a lot of the time, and the game itself is action-packed and interesting enough to warrant looking past its problems. So if you like to fly and enjoy cool-looking visuals, then check this out."}