{"ref": "https://www.gamespot.com/reviews/brothers-in-arms-earned-in-blood-review/1900-6135219/", "date": "October 6, 2005", "game_name": "Brothers in Arms: Earned in Blood", "text": "Gameloft's Brothers in Arms: Earned in Blood owes more to Ikari Warriors or the MSX Metal Gear than to its PC namesake. As an unnamed American soldier in the Second World War, your job is to run and gun through Die Wehrmacht, hopefully causing a few gray hairs to sprout in Hitler's meticulously trimmed mustache. In the game, you'll fire automatic rifles, machine guns, rocket launchers, and the ever-popular flame thrower. You'll also pilot quite a few tanks on your way to the Fuhrer's castle. Brothers in Arms is a fun action game while it lasts, which isn't very long at all. Of course, we can't tell you about the ~Hot Jagermeister~ scenes that take place in a Berlin cabaret. Brothers in Arms uses an overhead scrolling perspective, allowing for multidirectional combat. You control your character with eight movement keys and a fire button. Weapons arrive in crates dropped by the Allied Air Force. As enemies spawn fast and furious, it's your job to destroy them before they damage you. While most enemy gunfire and grenades can be dodged, it's harder to avoid tank blasts. Power-ups are spaced out in such a way, however, that it's possible to destroy all enemy tanks without any evasive action. You can take an unrealistic number of direct blasts, whether in a vehicle or on foot. Of course, that's normal for a game of this style and pacing. Each level is short, lasting perhaps only five minutes. You'll have to restart the later levels several times, but the challenge never becomes overwhelming. After a few consecutive attempts, the game will offer you the opportunity to enter easy mode. This isn't recommended, as it makes a fairly facile game even less challenging. The action is pretty frenetic in Brothers in Arms; you have just more than enough health to keep you afloat. The game ends after an hour or so of arcade-style bullet showers. You'll often take control of a tank in Brothers in Arms, which is the most fun thing to do in the game. The tank automatically dishes out machine gun fire to enemy infantry, but it's incumbent upon you to rotate your cannon into position and devastate as necessary. The tanks in Brothers in Arms are identical--among both Axis and Allies--and aren't meant to represent a specific model. As you play, you are apparently gaining experience points, because a ~LEVEL UP!~ message is occasionally displayed. Gaining levels apparently increases your stamina and strength points, but stat-boosting isn't a major consideration in the game. At several points during the game, you'll have to protect a Brother by getting the jump on those Reichsprotektorat rascals. Working with another soldier theoretically doubles your firepower, but burdens you with the added consideration of your buddy's life bar. If you've played an action game, you've dealt with escort situations before. Overall, the action goes off without a hitch. It's somewhat difficult to move along diagonals, however, simply because this necessitates the use of one's LG VX7000's keypad. It would be much easier to simply roll one's thumb on the navigation pad but, sadly, chording is not enabled. Brothers in Arms features diminutive characters in an incredibly cute, war-torn Europe. You'll want to pinch those SS Troopers' adorable cheeks before you blast them into oblivion. During the final cinematic, your soldiers happily wave their guns at you from the Norman beachside. Hey, at least the action's fast, and it scrolls fluidly in all directions. Springtime for Hitler... Brothers in Arms' sound is above average. A bit of patriotic MIDI music plays over the splash screen, which gives way to some decent sound effects in-game. Weapon fire and explosions punctuate the action, and make a casual game a bit more immersive. Brothers in Arms: Earned in Blood adheres closely to genre standards and is a solid scrolling shooter overall. The game's major failing is its short length. Whether you're paying for a subscription or buying the game outright, an hour of enjoyable gameplay isn't enough to justify that purchase. The game's high-score list is a cheap way to entice gamers to play through the campaign multiple times. However, you can't even upload that list to an online scoreboard, so the replay incentive isn't very great. Unlockable difficulty modes or weaponry would have been more compelling. You'll have fun playing Brothers in Arms; you just won't have fun for very long."}