{"ref": "https://www.gamespot.com/reviews/brothers-in-arms-earned-in-blood-review/1900-6135237/", "date": "October 6, 2005", "game_name": "Brothers in Arms: Earned in Blood", "text": "When Brothers in Arms: Road to Hill 30 was released earlier this year, it was lauded for its nearly seamless integration between first-person-shooter control and squad command mechanics. While clearly not as twitchy as most shooters, Brothers in Arms focused on the tactical aspect of small-squad infantry combat in World War II and packaged it with a cinema-quality presentation reminiscent of HBO's Band of Brothers. Fewer than seven months later, Gearbox has churned out a sequel. And as you'd expect from a sequel turned around so quickly, Brothers in Arms: Earned in Blood offers a rather similar experience to its excellent predecessor, with improved enemy artificial intelligence and additional multiplayer options. The novelty has worn off just a bit, though. If you loved the first game, Earned in Blood offers a lot more of the same great gameplay. For those who aren't familiar with the first game, Earned in Blood puts you in the shoes of an American corporal in World War II named Joe ~Red~ Hartsock. Hartsock was one of the thousands of US Airborne troopers who dropped in behind enemy lines the night before the Normandy landing in France. The story and the campaign are based on the real-life stories of Hartsock and his mates as they fought across the French countryside in those critical first two weeks after the invasion. For those of you who did play Road to Hill 30, Hartsock's name might ring a bell. That's because he was a character in the first game. The storyline in Earned in Blood overlaps that of Road to Hill 30, so you'll get to see Hartsock's point of view, as well as his experiences during the same time frame. As you'd imagine, much of the game is played from a flashback perspective as Hartsock is debriefed on his experiences by a superior officer. The in-engine cutscenes used to advance the story before and after missions are as heartfelt and impactful as they were in the first game, with the voice actor depicting Hartsock doing a fantastic job of conveying the emotion you'd expect from a war-weary soldier. The interface of Earned in Blood is pretty much the same as it was in Road to Hill 30. You play as Hartsock from a first-person perspective and have the ability to walk, kneel, fire, aim down the iron sight of your gun, and throw grenades. You'll also have up to two different fireteams, or one fireteam and a tank, at your command. You can direct each team to follow you, move to an area, open fire on enemies, or charge enemies in an all-out assault. In general, your teammates are intelligent about contextually evaluating their surroundings and finding the proper cover in a given situation. If you direct them near a low wall or log, for example, they'll take up cover behind it. Move them to the side of a building with windows and they'll sidle up between the openings and peer through the windows so they don't leave themselves vulnerable. Once in a while they'll do something stupid, like take themselves out of cover or set up in a bad place. Usually this happens if you plant yourself in the spot you told them to move to. The enemy will actually maneuver and retreat in response to your movement. The primary gameplay conceit in Earned in Blood, as in the first game, is to ~find, fix, flank, and finish~ the enemy. The enemy soldiers you encounter in the game also move in small fireteams. But unlike most other shooters, the enemies in Earned in Blood can be suppressed by firing at their position. Their level of suppression is measured by a red-and-white circle above the enemy position, but these indicators can be shut off for a more realistic experience. Enemies that are suppressed won't fire back as often, and when they do, they're less accurate. The general idea is that you or one of your teams first engages the enemy with a hail of suppressing fire. Then you direct your other squad element (or yourself) around to the side, where you can get a clean shot at the suppressed enemy and can possibly kill him. What's new about the enemy artificial intelligence in Earned in Blood is that it's more likely to retreat to another position if it spots you flanking, even if it's suppressed. Enemies in the previous game were more likely to sit tight. At the higher difficulty levels, the enemy may even act aggressively, moving to flank you and putting pressure on your squad. It also seems as though you have a smaller opportunity to kill off suppressed enemies that you attack from a flanking position in this game. The return fire you get comes faster and more accurately than before. This all makes Earned in Blood somewhat more difficult than the last game, but overall, veterans of Road to Hill 30 should find that this game is remarkably similar. Enemies behind cover are still not invincible to enemy fire. If you're a very careful shot with a rifle, it's possible to pick off enemy soldiers who are poking their heads up from behind cover. But in general, flanking maneuvers still work better when the situation allows for it. As in the last game, the more than 10 missions in Earned in Blood are called ~chapters.~ These will take you across various parts of France--from farms and forests, to towns and cities--and they should keep you busy for around 10 hours, counting restarts. The levels feel about the same size as last time, and you're generally compelled to move along a linear path, although there's sometimes more than one angle at which you can approach an enemy or make your way to an objective. Though the novelty of the gameplay mechanics masked the linear nature of the levels in the last game, we found ourselves somewhat disappointed to run into contrived obstacles that kept us from maneuvering as freely as we wanted to in Earned in Blood. The fact that enemies are more apt to retreat or to move exacerbates the problem somewhat more this time around, as you'll often run into situations where flanking is all but impossible. With an enemy backed into a corner, you may find yourself relying on risky assaults by your fireteam elements, which can cost you men, even when the enemy is suppressed. Grenades are another option, but it's somewhat difficult to aim your tosses in Brothers in Arms, making grenade attacks a trial-and-error affair. Thankfully, the game still offers a number of checkpoints throughout each level, and if you find yourself reloading at the same checkpoint a few times, you'll be offered an opportunity (at lower difficulty levels) to revive your health and the health of your squad members at that point. WWII: It's the war we love to keep fighting. There are a couple of new multiplayer options available in Earned in Blood. A skirmish mode lets you play any of the single-player missions cooperatively. Skirmish is available in split-screen mode on a single Xbox, or online over Xbox Live, or on the PC. Other skirmish modes are available as well, including defense, which requires you to defend wave after wave of enemy troops. Timed assault is another mode that requires you to kill all enemies on a map in a given amount of time. Bonus time is awarded for each enemy you take out, and you're scored based on remaining time. Finally, for the hardcore battlefield tacticians, a very difficult tour-of-duty mode is available that requires you to complete five consecutive missions with a single squad and a single life. (Good luck.) Rounding out the multiplayer options is the same objective-based multiplayer mode for two to four players that was available in the last game. There are 20 maps to choose from this time around, and it's pretty much a tactical game of cat and mouse, as each player controls his or her squad and tries to outmaneuver the other team. This mode is as fun and challenging as it was the last time, and the new skirmish modes are pretty fun to play with a friend. Again, since more people seem to be using headsets on Xbox Live than on the PC, and since communication is at such a premium in this game, it's probably a little more fun getting online with the Xbox, assuming you can find a mature playing partner. The presentation in Earned in Blood is excellent, just as it was in Road to Hill 30. The character and vehicle models are quite detailed, and your soldiers animate well, both individually and moving in groups. The lighting and particle effects seem a little better than in the last game, and the sound effects of the different weapons are as sharp and vibrant as ever. The PC version is, of course, sharper than the Xbox version, but both tend to suffer from a bit of slowdown when the action gets really hot and heavy. There's a lot of voice acting in the game, both during battles (as your squadmates shout out to you and to one another) and during cutscenes. While the stuff your squad yells in combat can get a bit repetitive, the voice acting in general is excellent, and Hartsock's is especially noteworthy. Hartsock's heartfelt voice acting is one of many highlights in the presentation. Though improvements have been made to the AI, and you've got additional multiplayer modes available, it's somewhat difficult to call Earned in Blood a true sequel. In the end, it delivers a pretty similar experience to the first game, even going so far as to tell an overlapping story. Of course, if you enjoyed Road to Hill 30, then Earned in Blood is definitely worth picking up, both for the tactical gameplay and for the high-class presentation of the story. All told, Earned in Blood is an excellent shooter that offers a unique gameplay experience you won't get with any other shooter franchise. As in the last game, the more than 10 missions in Earned in Blood are called ~chapters.~ These will take you across various parts of France--from farms and forests, to towns and cities--and they should keep you busy for around 10 hours, counting restarts. The levels feel about the same size as last time, and you're generally compelled to move along a linear path, although there's sometimes more than one angle at which you can approach an enemy or make your way to an objective. Though the novelty of the gameplay mechanics masked the linear nature of the levels in the last game, we found ourselves somewhat disappointed to run into contrived obstacles that kept us from maneuvering as freely as we wanted to in Earned in Blood. The fact that enemies are more apt to retreat or to move exacerbates the problem somewhat more this time around, as you'll often run into situations where flanking is all but impossible. With an enemy backed into a corner, you may find yourself relying on risky assaults by your fireteam elements, which can cost you men, even when the enemy is suppressed. Grenades are another option, but it's somewhat difficult to aim your tosses in Brothers in Arms, making grenade attacks a trial-and-error affair. Thankfully, the game still offers a number of checkpoints throughout each level, and if you find yourself reloading at the same checkpoint a few times, you'll be offered an opportunity (at lower difficulty levels) to revive your health and the health of your squad members at that point. WWII: It's the war we love to keep fighting. There are a couple of new multiplayer options available in Earned in Blood. A skirmish mode lets you play any of the single-player missions cooperatively. Skirmish is available in split-screen mode on a single Xbox, or online over Xbox Live, or on the PC. Other skirmish modes are available as well, including defense, which requires you to defend wave after wave of enemy troops. Timed assault is another mode that requires you to kill all enemies on a map in a given amount of time. Bonus time is awarded for each enemy you take out, and you're scored based on remaining time. Finally, for the hardcore battlefield tacticians, a very difficult tour-of-duty mode is available that requires you to complete five consecutive missions with a single squad and a single life. (Good luck.) Rounding out the multiplayer options is the same objective-based multiplayer mode for two to four players that was available in the last game. There are 20 maps to choose from this time around, and it's pretty much a tactical game of cat and mouse, as each player controls his or her squad and tries to outmaneuver the other team. This mode is as fun and challenging as it was the last time, and the new skirmish modes are pretty fun to play with a friend. Again, since more people seem to be using headsets on Xbox Live than on the PC, and since communication is at such a premium in this game, it's probably a little more fun getting online with the Xbox, assuming you can find a mature playing partner. The presentation in Earned in Blood is excellent, just as it was in Road to Hill 30. The character and vehicle models are quite detailed, and your soldiers animate well, both individually and moving in groups. The lighting and particle effects seem a little better than in the last game, and the sound effects of the different weapons are as sharp and vibrant as ever. The PC version is, of course, sharper than the Xbox version, but both tend to suffer from a bit of slowdown when the action gets really hot and heavy. There's a lot of voice acting in the game, both during battles (as your squadmates shout out to you and to one another) and during cutscenes. While the stuff your squad yells in combat can get a bit repetitive, the voice acting in general is excellent, and Hartsock's is especially noteworthy. Hartsock's heartfelt voice acting is one of many highlights in the presentation. Though improvements have been made to the AI, and you've got additional multiplayer modes available, it's somewhat difficult to call Earned in Blood a true sequel. In the end, it delivers a pretty similar experience to the first game, even going so far as to tell an overlapping story. Of course, if you enjoyed Road to Hill 30, then Earned in Blood is definitely worth picking up, both for the tactical gameplay and for the high-class presentation of the story. All told, Earned in Blood is an excellent shooter that offers a unique gameplay experience you won't get with any other shooter franchise."}