{"ref": "https://www.gamespot.com/reviews/hummer-badlands-review/1900-6148424/", "date": "April 26, 2006", "game_name": "Hummer Badlands", "text": "When you think of performance racing vehicles, the Hummer would probably be pretty far from mind. But, video game logic dictates that anything with wheels can and should be raced, be it a finely tuned Ferrari or a lumbering monstrosity of a vehicle such as the bright-yellow H1 Hummer. And so it is in Hummer Badlands, the latest budget racer from Global Star and Eutechnyx. Oddity of the license aside, this just isn't a good racing game. The racing is boring and way too easy, the physics are bouncy and unrealistic, the rubber-band artificial intelligence is ridiculous, and you can easily beat every race in the game in a couple hours. Put simply, even a Hummer driven by Rainier Wolfcastle and copiloted by John Matrix from Commando couldn't drag this game out of the mud. It smells like a steak and seats 35--it is the obscenely yellow H1 Hummer. Hummer Badlands lets you race a couple dozen different Hummers, but since there are only three different models in the company line, variety is limited to different paint jobs, wheels, and light kits. All of the vehicles look accurate enough to their real-world counterparts, but they all drive pretty much the same. Sure, the bulky H1 is a bit slower than the comparatively demure H3, but the difference is negligible. The vehicles do deform slightly as you race, although the damage is limited to cracked windshields and slightly malformed bumpers. You can drive headlong into a rock, tree, or even a row of grape vines, and you'll hear a crunch and see some colored particles fly off your vehicle before you bounce right back on track and continue unabated. Hummers are tough vehicles and all, but hitting a wall at a hundred miles an hour and just bouncing off seems a bit strange, and it makes the game extremely easy because you can just mash the accelerator and let the track guide you along. There are a handful of different event types, but none of them are any fun. The best of the bunch is the Extreme Off-road mode, where instead of racing, you get to take your Hummer off the beaten path and drive over fallen trees, across rushing rivers, and up steep inclines. There are five challenges of increasing difficulty, but none of them will take you more than a few attempts to complete. There are only two courses available in this mode, though, so you'll be able to finish all of the whopping 10 challenges in half an hour or so. For completing the off-road challenges, you'll unlock new Hummers to drive, including an H2 Bling with flame detail and snazzy rims and the majestic H1 Patriot, which features a stars-and-stripes paint job and a giant eagle head on each side. Other modes include the requisite time trial and quick race, as well as a beat-the-clock mode where you have to hit checkpoints before the clock runs out. There is also a championship mode, where you can participate in a series of five races in which points are awarded for each race, and the person with the most points at the end of the series is the winner. The first four races of each series are three laps apiece, and the last race is five laps. Since some of the courses are rather short, you can finish a series in half an hour or less. There are five different tracks: California, Arizona, New York, Peru, and Colorado. Each track has five variations, for a total of 25 different courses. But, since all those courses take place on the same five tracks, there isn't much variety at all to the scenery. You'll see the same trees, fences, and roads in each series, and none of it looks very good at all. There are some shortcuts in each track, but they are so glaringly obvious that there's no challenge at all in finding or navigating them. In fact, all of the tracks are laughably easy. The snowy Colorado track can provide a slight challenge as you tend to slide around, but it's still easy to take first in each series on your very first play through. Making things even easier is the rubber-band artificial intelligence in the game. No matter how many short cuts you take or how well you race, the other three racers will always be right on your tail. You can run an opponent off the road or spin him around backward, and he'll somehow magically catch up within a few seconds. Conversely, you can fall behind by a considerable distance and easily catch up, as if your opponents decided to stop and wait for you. The physics in the game are way off, too. Your Hummer bounces off of even the smallest bumps in the track, and instead of simulating the sway of the suspension on your vehicle, your tires simply melt into the ground as you drive over uneven terrain. There's also no collision detection on a lot of objects in the environment, so as you drive through some dense foliage or across a river, you'll see the branches, leaves, and water clip right through your vehicle. The understated elegance of the H1 Patriot is, quite simply, frickin' awesome. If you want to inflict this game upon a friend, you can play two-player split-screen in three different modes. You can have a head-to-head race, a pursuit race, or a tug-of-war match. In a pursuit race, you both start on opposite points in the track and try to catch up to your opponent. In tug of war, you basically hold the reverse button and try to drag your opponent across a line. In pursuit race and tug of war, both players have to use the same Hummer, which makes the competition even less exciting than it would be otherwise. Hummer Badlands isn't worth your time, regardless of your affinity for the vehicles. The racing is easy and simplistic, and the off-road mode is too brief to be worthwhile. With so many great racing games on both the PlayStation 2 and Xbox, this one might as well not even exist."}