{"ref": "https://www.gamespot.com/reviews/supreme-ruler-2020-review/1900-6193605/", "date": "July 11, 2008", "game_name": "Supreme Ruler 2020", "text": "Geopolitics is the subject of Supreme Ruler 2020, a fiendishly complex real-time strategy game from BattleGoat Studios. Unfortunately the developer doesn't appear to have learned any lessons from 2005's more-than-promising Supreme Ruler 2010 and has issued a sequel with virtually all of the flaws of the original game intact but, in many cases, made even worse. Unbelievable political events, statesmanship by proxy where the game practically plays itself, and an incredibly steep learning curve that comes without the assistance of an interactive tutorial will turn off all but the most fanatical strategy gamers. The focus of Supreme Ruler 2020 is exactly the same as its predecessor--attempting to guide the country of your choice through all of the wars, economic crises, and international intrigue that states face in the early 21st century. Sandbox-style grand campaigns are available, along with scenarios dealing with specific situations, such as the United States taking on an allied Canada and Mexico for control of North America. Multiplayer support for up to 16 players is also offered, although the absence of an online matching service means that you have to connect with other gamers via direct IP. Additional feedback to make sense of all this would have been a big help. Regardless of the game mode or the opposition, you play a president or prime minister with total control over all of a nation's affairs--both foreign and domestic. Policies are set by bossing around a cabinet of six ministers who look after portfolios, such as the state department, defense, and trade. This is handled by pinpointing key policy initiatives and checking them off under each minister's area of responsibility. So if you want to crank up the troops, you might make ~massive military buildup~ and ~increase unit readiness~ the top priorities of the defense minister. On the other hand, you can move toward peaceful nation building by ordering your finance minister to prioritize such initiatives as ~family subsidies~ and ~health care.~ The buck stops with you, so you can do just about anything you want. The game feels somewhat similar to Paradox Interactive's grand strategy franchises Europa Universalis and Hearts of Iron, with slightly futuristic concerns replacing the medieval and WWII worries of those series. Comparisons shouldn't be taken too far, however, as Supreme Ruler 2020 isn't nearly as refined as something like Europa Universalis III. For starters, it is just about impossible to make heads or tails out of the gameplay. As with its predecessor, tutorials are built around rough walk-throughs of the interface and some basic game concepts. These guided tours contain a lot of information, but it's hard to remember enough of it to put into practice when actually playing the game because of the absence of any sort of interactive element. Even after you do suss out gameplay, you quickly discover that a lot of the basic game mechanics seem broken, or at least the information is poorly presented. The cabinet system is an absolute mess. There is little feedback regarding the effects of each policy change, which leaves you in the dark about what is actually happening when you prioritize issues. Every policy is accompanied by nothing but skimpy tooltip pop-ups that tell you next to nothing about what they actually do. ~Massive military buildup,~ for instance, is accompanied only by a few sparse words revealing that checking it maxes out unit building and deploys reserves. That's awfully uninformative when you consider the vast number of military units and facilities that the average nation will crank out during the course of a campaign. The AI seems fairly good, at least, although Supreme Ruler 2010 was already no slouch in this department. So if you put your ministers on a war footing, you can pretty much guarantee that the military will get top priority all over the nation. Barracks start going up, and you soon receive e-mail from the defense minister suggesting that you start utilizing unused army construction slots. If you ignore all of the nitty-gritty about what's being built when and where, you can still fight a pretty solid war on autopilot. But watching a game play itself isn't very satisfying, and neither is the alternative; digging deep into micromanagement to construct every uranium mine, water works, and barracks on your own. Given the complexity of the game design, the former is certainly the path of least resistance because the game generally knows how to play itself better than you do. So adopting a cruise-control philosophy can lead to quicker success with meeting campaign and scenario goals. Yet it's hardly enjoyable to play this way because you spend most of your time waiting to make a decision. The latter option offers a lot more action in the form of taking charge of everything, although the game is such a wide-open geopolitical sandbox that determining what to do at any given moment can be deeply frustrating. Supreme Ruler 2020 could also use more intelligence when it comes to political events. Many actions within the game seem more like they come from the Bizarro World than our own, and the weirdness is much more pronounced here than it was in Supreme Ruler 2010. Ministers never object to their priorities, even if you give them ones that contradict one another. For example, you can tell the defense boss to start a massive military buildup and a discreet military buildup at the same time. Trading is screwed up by nations continually offering goods that you don't need. If you take over Ontario, for instance, you'll soon be inundated by worthless offers like water from Kazakhstan or electric power from the Philippines even though you now possess one of the most resource-rich regions in the world. Just another average afternoon in the Middle East. International actions frequently have no connection with reality. The UN, for example, typically steps in to offer Israel supplies during war with Lebanon, Syria, and Egypt--a helping hand that you're never going to see in the real world. Israel itself is run by Arab ministers like defense chief Sayed Arafat and secretary of state Mohammed Hussein. You don't have to be a political junkie to know that something is wrong with that picture. Wars and their underlying factors don't seem to make any sense. Even in the wacky futuristic world of 2020, it's hard to imagine how Ontario would have a 10 percent casus belli on Alabama; or how Israel and Syria can go from being mortal enemies one moment with no chance of resolving anything via diplomacy to signing a peace treaty no questions asked just a day later. Maybe there are reasons for these oddities, but the game certainly doesn't bother to try to explain them. The visuals and sound only add more confusion. While the new world map was apparently modeled on NASA photos and looks pretty good from a distance, all of the features are pixelated and the terrain is barren when viewed up close. The biggest issue is how buildings and units vanish when you zoom out to get a look at an entire region. This is a big-picture game that needs to be played with the map pulled back, yet the graphics force you to zoom in tight to actually see what's happening. Even then it's tough to make out what's taking place during battles, and there is no collision detection, so units pile up into vaguely tanklike blobs. Audio is nearly nonexistent, notably in regard to order acknowledgements from units in battle and from your cabinet, who communicate with you solely by silent e-mail. You do get some irritating gunfire and explosion sounds during combat, however, along with a soundtrack of repetitive martial music. Supreme Ruler 2020 should be consigned to a hardcore strategy game ghetto where casual players fear to tread. Despite the game's tremendous ambitions, all of the game's potentially positive features are buried beneath an avalanche of nonsensical politics and gameplay that forces you to choose between cruise control and tedious micromanagement. Let's hope that the entire game engine gets a serious overhaul before Supreme Ruler 2030."}