{"ref": "https://www.gamespot.com/reviews/pro-evolution-soccer-6-review/1900-6160696/", "date": "February 9, 2007", "game_name": "Winning Eleven: Pro Evolution Soccer 2007", "text": "Konami's Pro Evolution Soccer series has usually managed to outdo EA's FIFA series in the eyes of European critics, even if it rarely manages to generate the same level of sales. When Winning Eleven: Pro Evolution Soccer 2007 (or Pro Evolution Soccer 6 in Europe) was announced for the Xbox 360, it seemed gamers could finally look forward to a game that combined superb playability with more impressive visuals and a compelling online offering. We're pleased to report that the newest Pro Evolution Soccer continues the series' tradition of playing a great game of football. From the moment you kick off, either against a friend or the computer, Pro Evolution Soccer delivers a fantastic representation of the sport. Realistic body shapes, player momentum, and ball physics combine to provide the greatest result yet. Just like in real football, you have to work at creating build-up play and set pieces, but in return you'll get a deep level of satisfaction when you score a truly remarkable goal. The game's visuals have received some Xbox 360 attention. Konami has made this year's game tighter than ever before. For example, players need to be facing their intended targets to attain any sort of passing accuracy, and the game usually favours the defending player in one-on-one situations. Consequently, Pro Evolution Soccer 2007 is a slower game than its predecessor and favours quick-passing play as opposed to selfish, solo runs. On the other hand, fouls are awarded much less frequently this time around, which prevents the stop-start routine that marred PES5. Although it takes a while to adjust to these changes, the new version of Pro Evolution Soccer is the best yet in terms of action, and it will reward dedicated players with a good degree of depth. However, as a next-generation title, Pro Evolution on the Xbox 360 doesn't work quite as hard as it could. The lack of licensed team data has always been an issue for the series, but this version has even less functionality than last year's PlayStation 2 game. The German league has mysteriously disappeared, and while there are still a reasonable number of licensed teams, only four are represented from the entire British Isles. That's fine if you're a fan of Rangers, Celtic, Arsenal, or Manchester United, but everyone else will have to make do with a fictional team name that is based loosely on the real club's location. Spurs fans must put up with North East London, Reading fans with Berkshire Blues, and so on. Even worse, Konami has now decided to omit the editing features that were available in previous Pro Evolution Soccer games. These options have been comprehensive in the past in order to make up for the lack of official licences in the game. In fact, while the full roster of team and player changes can still be made in the PlayStation 2 version of the game, in the Xbox 360 game you can only make alterations to players' names and statistics. Appearances, kits, and even fake team names can't be changed, which is something of a step backwards, although the proportion of accurate player names overall is higher this time around, and transfers are accurate to the end of the August 2006 transfer window. What's more, there's no option to save goal replays either, so the days of saving your most glorious strikes to show off to your mates are gone. Also, the unlockable items that PES points previously allowed you to buy are gone, although national teams of classic players can be obtained by winning some of the cup competitions available. All of the usual national tournaments return in exactly the same format as before. The Asian Cup, which includes just five teams, provides a short-term challenge, and for something more comprehensive, you can play the European competition or set up your own club or national team tournaments if you so desire, playing as any team in the game. The focus of the single-player game has always been the master league, and thankfully, it returns in this year's game. Because this is a long-term challenge in which you take a team of low-quality fictional players to the top, you'll need to win matches and accumulate in-game currency to buy decent players on the way. This year's version of the master league is exactly the same as in previous years, with one or two changes in presentation. For example, it's now possible to choose whether or not players age or improve. By switching this last option off, you can re-create the experience from past Pro Evo games and gradually build up a team of today's superstars, as opposed to a raft of regenerated youngsters with the exact same names as famous players now. Licensed players look great, but there aren't enough of them. Either way, there's nothing in this career mode that shows any particular ambition, and Konami has been content to simply serve up what we've seen in previous versions of the game. Therefore, if you've spent weeks working your way out of fake-player obscurity and into the world-class arena previously, you can now contemplate doing exactly the same thing over again, in exactly the same way. As you'd expect from a game that is making its Xbox 360 debut, the biggest improvement to Pro Evolution Soccer is in the visuals. The high-definition overhaul means that you can really appreciate the player details, particularly in the way they move. The interaction between players and the ball has been key to Pro Evolution Soccer's success, and it's never looked as clear as on the Xbox 360. While it's not yet in the same league as the 2006 FIFA World Cup game in terms of detail and authenticity, there's still enough to please the eye. Player likenesses are reasonable enough so that you can tell who the players are for the most part, although the licensed players certainly seem to have had more attention paid to them. There are still entire club and national teams that feature players with incorrect names, and a few of them have hair colour or facial characteristics that will no doubt baffle some football fans. Peter Brackley and Sir Trevor Brooking make a return in the commentary box, and while there seems to be less repetition in their remarks, there's nothing noticeably new in the stock phrases either. It's always been one of the Pro Evo series' weaknesses. Although they won't have you switching off the commentary after playing for a few days, it's nothing to write home about. There has been a fair amount of anticipation about the online multiplayer capabilities of Pro Evolution Soccer 2007, as with many other Xbox 360 games. While playing against the computer is certainly compelling, competing against real people is far more exciting, and players can battle over an online leaderboard. Each person's Xbox Live profile will build up an online database, which keeps track of a variety of statistics, including your performance over time and even your favoured choice of team. The online mode will sort you into several leagues, depending on your ranking. And you will move up and down based on how many times you win, lose, or draw. If you want to play practise matches or against friends, then you can play in unranked games. But the real challenge comes in playing online ranked matches that will contribute to your leaderboard position. The real disappointment is that you can't set up online tournaments with friends. So while the online multiplayer mode is incredibly fun and addictive, it's a decidedly last-generation experience. Body shapes and player movement make the game feel realistic. The performance of online play is fairly stable, although there are some issues that blight a game, which depend on quick reactions. Shots, crosses, free kicks, and corners are much trickier online because of a lag between the button press and the onscreen power bar. This means that you'll often hold the button down for longer than you need. And when the action is completed, you end up with way more power than you'd want. After a few games, you'll work out how to compensate, but it's still off-putting. Achievements in the game are straightforward to win by playing through the preset tournaments and the master league competitions. It may sound as if a lot of time is required, but it's possible to unlock most achievements by setting the game to the easy mode and on the shortest match length to romp through them. Much harder to achieve are the online badges, which require you to play 100 online games and win 100 matches. Overall, while the most important part of the game--the football--is of the usual high standard, there's a general lack of ambition in other areas of the game. But there's no doubt that for the foreseeable future this game will continue to play some of the greatest matches around, and the challenge to be one of the best players online will live on for a long time to come."}