{"ref": "https://www.gamespot.com/reviews/socom-3-us-navy-seals-review/1900-6135605/", "date": "October 12, 2005", "game_name": "SOCOM 3: U.S. Navy SEALs", "text": "When the original SOCOM was released in 2002 on the PlayStation 2, it made an impact as one of the best online shooters available on a console. A year later, SOCOM II continued that winning formula, becoming a wildly popular game among console shooter fans. It's been almost two long years since the last SOCOM game, and SOCOM 3: US Navy SEALs makes some significant strides over its predecessors, offering 32-player online play, drivable vehicles, much larger maps, and a worthwhile single-player campaign. Drivable vehicles like this gunboat are one of the exciting new additions to the franchise. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: SOCOM 3: U.S. Navy SEALs Video Review As in previous SOCOM games, you're put in the role of a squad leader of a four-man team of Navy SEALs. The single-player consists of three campaigns that will take you across three different settings, ranging from North Africa to South Asia, on over to Poland. You'll be asked to do a variety of different tasks, ranging from hostage rescue to search and destroy, or even capturing enemy officers. Though a lot of the combat boils down to detecting enemies from long range and picking them off before they can get close, you'll find a number of situations in which you're forced into close combat, such as exploring tunnel systems or house-to-house fighting in a city. Other scenarios require you to paint enemy tanks with a laser-targeting device for an air strike, or even take out tanks yourself with a missile launcher mounted on a humvee. Each of the maps is quite large, so you'll often have vehicles at your disposal, which let you get from place to place quickly and give you added firepower. These range from machine gun-mounted buggies, trucks, and humvees to heavily armed gunboats. The miniguns mounted on the gunboat are particularly fearsome; they unleash a high volume of lead with a frightening zipper sound accompanying the burst. Since the maps are so large, the missions can be rather lengthy, so the game includes a lot of smartly spaced nav points. You won't ever find yourself lost or wondering where to go in SOCOM 3. There are also a number of checkpoints where your game gets saved within each mission. Your team gets healed and resupplied at these checkpoints. Hardcore shooter fans may find that these conveniences make SOCOM 3's single player somewhat easy, but it also reduces frustration greatly as you make your way through each map's objectives. SOCOM 3, much like its predecessors, controls very well. One of the new control mechanisms added in this game is the ability to swim. Many of the maps in both the single- and multiplayer game feature rivers or other bodies of water, and you can often make a stealthy approach by swimming. You can't fire your gun from in the water, but you can submerge yourself for a limited time, making you all but invisible in the partially translucent water. You can play SOCOM 3 from either a third- or a first-person perspective, and some aspect of realism has been worked into the gameplay design. Though you can take several hits before going down, the accuracy of your weapons is reduced greatly when you're on the move. You can improve your aim stability and stealthiness by kneeling or going prone, or by firing in short bursts instead of going full auto. The actual feel of moving and shooting in SOCOM 3 is one of its primary strengths. Everything feels solid and strikes that fine balance between realism and fun. If you have a heavy machine gun, for example, you will get much more accuracy from snapping on a bipod and going prone than from shooting from the hip. Silenced weapons don't pack quite as much punch as unsilenced guns, and submachine guns are much easier to control than rifles. You also get great visual feedback from hitting the enemy; they'll react appropriately when shot, limp or stumble away if wounded, and squirt some overexaggerated but satisfying blood spray when hit. Numerous cutscenes give you context for your missions. Your team can be commanded via voice if you have a USB headset, or by using a simple menu system. Context-sensitive commands are also available via the L2 button, so it's usually easy to get your team to follow you or move to a specific point, or even breach into a room. If there's any complaint to be made, it's that the teammate artificial intelligence is uneven. You'll often find that there's one stubborn mule that just won't get into the car when you order your men to ~mount up.~ Getting that one soldier back under control can be a real pain. The enemy AI is also not all that bright about detecting your presence or reacting when they come under fire, nor are they very good shots. They'll eventually move to nearby cover or hit the deck, but SOCOM 3 tends to be pretty forgiving with the stealth aspects of the game, so long as you're crouched and using silenced weapons. Speaking of weapons, perhaps one of the most fun aspects of SOCOM 3 is equipping yourself with the wide array of weapons and add-ons. Prior to each single- or multiplayer mission, you can choose from shotguns, sniper rifles, assault rifles, and submachine guns as your primary weapon, and dozens of different accessories are available for them, including different scopes, lasers, thermal sights, bipods, or underslung grenade launchers. You can't go too crazy with the customizing, though--each thing you snap on adds weight, and if you're overencumbered, you won't move that well. The add-ons also have a noticeable effect on weapon power, accuracy, and range. A wide range of sidearms are also available, as well as secondary weapons like rocket launchers and different grenades. Gun nuts can find themselves spending quite a bit of time picking out the right tools for the job, as there are literally thousands of different possible loadout configurations. If you're not a regular subscriber to Guns & Ammo, or otherwise have no interest in shopping for guns, the default loadouts usually work just fine for single-player. Choosing your loadout can be as fun as actually playing. The online aspect of SOCOM 3 is the where the real meat of the game lies. Online matches have been beefed up to 32 players from 16 in previous games, to help populate the game's larger map sizes. Both day and night versions of the game's dozen or so multiplayer maps are available, which helps add variety in how each map plays. What was once a wide-open area for fire fights in a day map becomes a stalking ground in the night version for silenced, close-range weapons. A couple of new game modes have been added in SOCOM 3, including convoy, which is particularly interesting because it requires the SEAL team to load and sneak some cargo trucks past the terrorist team. As of this writing, however, it's difficult to get a full 32-player game going on the more fringe modes. Most of the game's population seems content with playing old standbys like suppression or demolition. Of course, the inclusion of fun and easy-to-drive vehicles in the game makes those old modes seem a lot fresher now. When you have tanks, technicals, and Bradleys marauding around maps, picking up and dropping off passengers as they blast at each other and at infantry, the result is the closest approximation to the PC's Battlefield series that you'll find on a console today. Online play was smooth for the most part in our testing, although frame rates can get chunky when you're watching a teammate in spectator mode. If there's anything bad to say about online play, it's that you'll often need to deal with your typical shooter punk talking trash or just being generally obnoxious on the headset. But if you really can't stand Mr. ~420-24-7~ cussing at you with stoned slurring, you can add him to your ignore list or just take off the headset. SOCOM 3 is a worthwhile purchase for any shooter fan with a PS2. Considering the amazing technical job that the development team has done fitting large maps, vehicles, and 32 players into a PlayStation 2 game, SOCOM 3 looks pretty darn good. The view distances are appreciable; even squinting through a 4x rifle scope, you can still pick out tiny enemy soldiers from extreme range and shoot at them. The maps in both the campaign and multiplayer modes are varied, with some nice details in the environments and lots of buildings, widgets, and other objects strewn about to make for a believable environment. Characters animate well when they move, shoot, and come under fire. You'll also get some satisfying explosions, dust kick-up, and blood spray as the lead flies around back and forth. Sure, the polygon counts aren't so high on the models, and the textures get pretty muddy on the terrain and fuzzy on character models; but the overall look of SOCOM 3 is still impressive, given the scope of the game. The sound effects in the game are even better, whether it's the harsh bark of an assault rifle, the deadly whirring click of a silenced submachine gun, or the sharp ricochets of bullets missing a target. A stirring soundtrack keeps your mood in the right place as it plays in the background and in menus, evoking thoughts of explosion-laden Jerry Bruckheimer movies that you've seen too many times. A good amount of speech is also present in-game and during cutscenes and briefings. SOCOM 3 is a remarkable addition to the venerable franchise. The team at Zipper has maintained the series' solid mechanics and feel, while doubling the number of online players per match, expanding the size of the maps, adding fun, drivable vehicles, and even throwing in a worthwhile single-player campaign to boot. Whether you're a longtime fan of SOCOM or you're new to the series, SOCOM 3 is well worth the price of admission, and is proof positive that a great, large-scale shooter can be done, and done well, on the PlayStation 2. Speaking of weapons, perhaps one of the most fun aspects of SOCOM 3 is equipping yourself with the wide array of weapons and add-ons. Prior to each single- or multiplayer mission, you can choose from shotguns, sniper rifles, assault rifles, and submachine guns as your primary weapon, and dozens of different accessories are available for them, including different scopes, lasers, thermal sights, bipods, or underslung grenade launchers. You can't go too crazy with the customizing, though--each thing you snap on adds weight, and if you're overencumbered, you won't move that well. The add-ons also have a noticeable effect on weapon power, accuracy, and range. A wide range of sidearms are also available, as well as secondary weapons like rocket launchers and different grenades. Gun nuts can find themselves spending quite a bit of time picking out the right tools for the job, as there are literally thousands of different possible loadout configurations. If you're not a regular subscriber to Guns & Ammo, or otherwise have no interest in shopping for guns, the default loadouts usually work just fine for single-player. Choosing your loadout can be as fun as actually playing. The online aspect of SOCOM 3 is the where the real meat of the game lies. Online matches have been beefed up to 32 players from 16 in previous games, to help populate the game's larger map sizes. Both day and night versions of the game's dozen or so multiplayer maps are available, which helps add variety in how each map plays. What was once a wide-open area for fire fights in a day map becomes a stalking ground in the night version for silenced, close-range weapons. A couple of new game modes have been added in SOCOM 3, including convoy, which is particularly interesting because it requires the SEAL team to load and sneak some cargo trucks past the terrorist team. As of this writing, however, it's difficult to get a full 32-player game going on the more fringe modes. Most of the game's population seems content with playing old standbys like suppression or demolition. Of course, the inclusion of fun and easy-to-drive vehicles in the game makes those old modes seem a lot fresher now. When you have tanks, technicals, and Bradleys marauding around maps, picking up and dropping off passengers as they blast at each other and at infantry, the result is the closest approximation to the PC's Battlefield series that you'll find on a console today. Online play was smooth for the most part in our testing, although frame rates can get chunky when you're watching a teammate in spectator mode. If there's anything bad to say about online play, it's that you'll often need to deal with your typical shooter punk talking trash or just being generally obnoxious on the headset. But if you really can't stand Mr. ~420-24-7~ cussing at you with stoned slurring, you can add him to your ignore list or just take off the headset. SOCOM 3 is a worthwhile purchase for any shooter fan with a PS2. Considering the amazing technical job that the development team has done fitting large maps, vehicles, and 32 players into a PlayStation 2 game, SOCOM 3 looks pretty darn good. The view distances are appreciable; even squinting through a 4x rifle scope, you can still pick out tiny enemy soldiers from extreme range and shoot at them. The maps in both the campaign and multiplayer modes are varied, with some nice details in the environments and lots of buildings, widgets, and other objects strewn about to make for a believable environment. Characters animate well when they move, shoot, and come under fire. You'll also get some satisfying explosions, dust kick-up, and blood spray as the lead flies around back and forth. Sure, the polygon counts aren't so high on the models, and the textures get pretty muddy on the terrain and fuzzy on character models; but the overall look of SOCOM 3 is still impressive, given the scope of the game. The sound effects in the game are even better, whether it's the harsh bark of an assault rifle, the deadly whirring click of a silenced submachine gun, or the sharp ricochets of bullets missing a target. A stirring soundtrack keeps your mood in the right place as it plays in the background and in menus, evoking thoughts of explosion-laden Jerry Bruckheimer movies that you've seen too many times. A good amount of speech is also present in-game and during cutscenes and briefings. SOCOM 3 is a remarkable addition to the venerable franchise. The team at Zipper has maintained the series' solid mechanics and feel, while doubling the number of online players per match, expanding the size of the maps, adding fun, drivable vehicles, and even throwing in a worthwhile single-player campaign to boot. Whether you're a longtime fan of SOCOM or you're new to the series, SOCOM 3 is well worth the price of admission, and is proof positive that a great, large-scale shooter can be done, and done well, on the PlayStation 2."}