{"ref": "https://www.gamespot.com/reviews/football-manager-2017-review/1900-6416575/", "date": "November 22, 2016", "game_name": "Football Manager 2017", "text": "Sports Interactives long-running Football Manager series is at its best when youve been with a team for a handful of seasons--once youve managed to stamp your mark on a club, imbued it with your own philosophies, and adopted an anomalous way of putting your opponents to the sword. Sure, youve dealt with your fair share of volatile personalities throughout the years--perhaps you were forced to sell a star player after a heated argument over his eagerness to join Barcelona--but you always had a plan.All of the franchise's disparate systems--transfer dealings, player scouting, tactical tinkering--coalesced into an endlessly engaging whole that creates some memorable tales. Its no surprise that with each new addition to the series, we see plenty of improvements and new features in these areas. Yet its the on-pitch action--which usually takes a relative backseat in Football Manager--that really holds it all together.In that regard, Football Manager 2016 was a decidedly flawed game. Its 3D match engine was flushed with blemishes: god-like crosses comprised the vast majority of goals scored, right backs were overpowered, and defenders inexcusably forgot how to defend in the simplest of situations. These flaws may have seemed minor, but magnified over the long haul, they cheapened and frustrated the experience. My resounding success leading Burnley to a fourth-place finish in the Premier League hardly felt gratifying once I realized Id unwittingly exploited the AIs inability to deal with crosses. And losing a cup final on something that felt less like a players mistake and more like the fault of the match engine itself was particularly exasperating. As such, I only spent a mere 200 hours with Football Manager 16 (a far cry from the 800-ish hours I usually spend rooted in the series virtual dugout).Im happy, then, to proclaim that Football Manager 2017's engine rights its predecessors wrongs, and its simply a much more enjoyable game to watch and manage. There are still a tad too many goals scored from crosses, but this is mitigated somewhat by the sheer variety of potential goals now, owing to the fact that players perform far more intelligently.Previously (and Im talking a few years here), wingers would reach the byline and unforgivably shoot from the tightest of angles. Now when this happens, your sprightly winger will, more often than not, take stock and assess the situation. He might hit a high cross to the striker at the back post or cut it back to an onrushing midfielder on the edge of the box for a Lampard-esque finish. Youll also see playmakers ping 40-yard passes to pacy forwards dashing behind the defense, see the odd deflected effort loop over a stranded goalkeeper, or jump up in excitement as a curler nestles in the top corner of the net. And its not just a goalfest, either. Defenders are now more adept at, well, defending--maintaining their shape and proving difficult to break down if theyre set up to do so.Opposition managers are more likely to make tactical adjustments mid-match, too. When I went up against Big Sam Allardyce and his Everton team during my career with Liverpool, he started the game in a very defensive 5-4-1, hoping to keep things tight and probably come away with a hard-fought draw. When I breached his wall of defenders after a few minutes, however, he switched things up, shifted some of his midfielders further up the pitch, and stuck another striker on to try to score an equaliser. Stuff like this makes match days more involved than ever. Theres just more ingenuity spread throughout the pitch, and that edges the simulation ever closer to reality.Legacy issues do still persist, however. The conversation system--whether its with individual players, the press, or in team talks--is relatively untouched, so youll still be choosing the same options you've had for the past few years. Tactics are also in need of a grand overhaul. The mixture of shouts and player roles the series has been using for a few iterations now is certainly serviceable, but at this point, it feels far too rigid and restrictive. Say you want to utilize a double pivot between your two central midfielders or deploy the type of structured pressing Jurgen Klopp and Roger Schmidt use so effectively--theres no easy way to do either of these things. You can try various workarounds in an attempt to mimic something that regularly happens in real-world football, but even then, its never going to be perfectly accurate.The tactical side of Football Manager would benefit from giving you more control over how your team functions, especially during specific phases of play--perhaps letting you fluidly shift from one formation to another depending on whether your team has the ball or not. Against Real Madrid in this years Spanish Supercup, new Sevilla manager Jorge Sampaoli did exactly that. By deploying a 4-2-3-1 formation while in possession and altering to a 3-4-2-1 without it, Sevilla managed to effectively stifle the Galacticos attack for much of the game, while still maintaining a system his team was comfortable with when they had the ball. Stuff like this just isnt possible in Football Manager, so it makes the tactical system feel outdated and behind the curve of the sports most innovative coaching minds.The tactical interface is also incredibly difficult to get into. Unless you want to scour the Internet for the real nitty-gritty stuff and actually read pages and pages of differing opinions to learn how everything works, it can feel like youre shooting in the dark. This could be rectified somewhat if the game offered more feedback on your tactics--with staff members providing information on what instructions clash with one another or tips on how to prevent the types of goals youve been conceding--but youre basically left to your own devices. Its in need of reinvention. This might be tough to implement in an annualized series, but its about time.The perennial strengths of Football Manager are stronger than ever, yet its the furtive improvements to the match engine that really set Football Manager 2017 apart from its immediate predecessor.And that last part is pertinent, because on the whole, Football Manager 2017 is a lot better about presenting you with digestible information than its predecessors ever were. Now you consistently receive clear, concise reports from your backroom staff that significantly speeds up the process of actually playing the game. Theyll come to you with reports on training and scouting, as well as players they think you should praise or tutor. In the past, youd have to sift through pages and pages of information to make these kinds of decisions, but now its only one or two clicks away. Tasks that you would have previously neglected because you just couldnt be bothered, or because you simply overlooked them, are now easily performed. It makes your job as a manager much more streamlined. These aspects of the game might not be anything new, but these refinements are wholly appreciated.In terms of new features, there are only a few that stand out, and theyre mostly shallow and inconsequential. There is one outlier, however. Brexit--everyones favorite apocalyptic buzzword--stands apart as being a more meaningful addition than most because it alters the landscape of world football if its randomly enacted during your game. This is most keenly felt in the British leagues, of course, as work permits for foreign players become increasingly harder to come by, limits are imposed on squad selection, and the Premier Leagues bundles of money are sapped out. It might prove frustrating, especially if youre forced to disassemble a multinational squad, but to ignore a real-world event with such far-reaching consequences would be a disservice.The inclusion of social media is decidedly less profound, but it does at least allow you to keep an eye on notable events happening across the world of football. As it pertains to you and your club, however, the finite depository of fan reactions soon gets repetitive, with the same happy, angry, and indifferent responses repeated over and over again, no matter the situation. Youd think everyone would be overjoyed when an 18-year-old scores a hat trick in his debut, but I guess theres no pleasing some people.Similarly forgettable is a more robust (and I use that word lightly) creation suite. There are more sliders and hair options, and you can import a picture of your face (or anybody elses) to slap on the default character model. But for the rare occasions when you actually catch a glimpse of your manager, this is a feature hardly worth mentioning. I should, however, acknowledge a few of the new wrinkles that crop up during Football Manager 2017s regular structure. Across multiple saves Ive seen some abnormally high-scoring games: Tottenham beating Arsenal 8-2 (like that would ever happen) or Barcelona smashing Atletico Madrid 7-3, along with the usual 5-0s and 6-4s that seem to appear on a near-weekly basis. These arent game-breaking, but they do break the immersion nonetheless--as do the sheer number of managerial sackings. There were seven during my first season in the Premier League (most notably Manchester Citys Pep Guardiola), despite the fact that there were only six games left to go in the season. Apparently battling for fourth place wasnt good enough.Football Manager 2017 is not a game of revolution, but one of refinement. Transfers are smarter and more involved, and the faster player development and the aforementioned streamlining of information are welcome. The perennial strengths of Football Manager are stronger than ever, yet its the furtive improvements to the match engine that really set Football Manager 2017 apart from its immediate predecessor. Sure, I still have gripes with the tactical interface, and there isnt anything new there worth writing about. But if your rear end has ever been entrenched in the virtual dugout or you're just a fresh-faced hopeful looking to begin your journey, Football Manager 2017 is easy to recommend to the budding manager."}