{"ref": "https://www.gamespot.com/reviews/fear-effect-2-retro-helix-review/1900-2687897/", "date": "February 22, 2001", "game_name": "Fear Effect 2: Retro Helix", "text": "Fear Effect 2: Retro Helix is the prequel to last year's acclaimed hit Fear Effect. Clocking in with more than 40 hours of first-run gameplay across four discs, this chapter delves into the histories of Hana, Glas, and Deke, while simultaneously presenting a story of espionage and supernatural villainy that ultimately surpasses the original game in terms of both shock value and excellence. As it is a prequel, Fear Effect 2 retains many of the traits that defined its predecessor, such as Resident Evil-style gameplay, full-motion animated backgrounds, and a Hollywood-inspired presentation. In tandem with this solid foundation, though, the game stands firm in its own right thanks to a plethora of control, weaponry, character, and setting improvements. Like the original, Fear Effect 2: Retro Helix is an experience many people will either truly love or deeply loathe. For those in the first category, Eidos has just released your PlayStation game of the year. However, because of the recurring violence and sexual themes, this is definitely not a game for young children. Fear Effect 2: Retro Helix is set in Hong Kong, circa 2048. In the aftermath of the onset of a terrible genetic malady, biological theft and terrorism are big business. Beginning with Hana's mission to liberate a DNA sequence from a renowned doctor, you'll act out and experience multiple roles throughout the game. You'll play as Hana Tsu-Vachel, a beautiful assassin who is equally as trained in the art of seduction as she is warfare; Rain Qin, a close companion to Hana whose flair for technology hides a dark secret; Royce Glas, a burnt-out mercenary-for-hire; and Jakob ~Deke~ Decourt, a greedy thug who just so happens to be afflicted with the same genetic disease that is slowly wiping out the population. Unlike similar games where you switch perspectives midway through the game, Fear Effect 2 keeps things fresh by constantly transporting you from one character to another. As in the original Fear Effect, the prequel starts out grounded in reality but soon becomes a one-way ticket to weirdness. Corporate conspiracy gives way to supernatural meddling, while Rain and Hana's relationship ultimately proves itself to be the game's tearful legacy. If you like action-oriented survival-horror that's story driven, Fear Effect 2 is the right game for you. Because its roots are in survival-horror, Fear Effect 2 embodies what is best about the genre, while also incorporating a few much-needed changes to make the game attractive to a wider audience. Spanning the game's four discs, the game's eight distinct environments require that you crawl, run, shoot, and think your way out of a variety of tough situations. Deadly robots, thugs, and monsters leap from the floors and ceilings with little notice, while numerous onrushing catastrophes force you to acclimate to the game's sneak, run, and roll gameplay features. There are a variety of weapons at your disposal, ranging from handguns and small arms to genre staples such as rocket launchers and flamethrowers. The number of weapons is triple that of the original Fear Effect, and this includes a few humorous additions, such as a long-range tazer, a 40-foot-tall mech, and a portable EMP generator. Along the way, you'll also have to solve numerous mathematical, spatial, and odds-based puzzles, as well as gather items that gain you access to later areas. Fear Effect 2: Retro Helix plays like a comfortable merger of Parasite Eve and Metal Gear Solid, with a cinematic presentation that's on an even keel with Resident Evil: Code Veronica in terms of quality. Although the difficulty level is high due to the game's trial-and-error nature, there are few times when a situation requires more than two or three attempts. Thankfully, there are also plenty of save points along the way.Although the first Fear Effect was an excellent effort, there were many criticisms raised against it for a variety of reasons. To make the prequel more palatable to a larger audience, Kronos Digital has made some improvements to the game. A 3D-oriented control option joins the default survival-horror interface, postdeath load times have been eliminated, and replay value has been improved through the inclusion of special weapons and hidden secrets. The addition of Rain also provides a much-needed fourth character and love interest for Hana, as well as a reason to kick the game's maturity level into the stratosphere. Fear Effect 2 is also longer and less linear than the first attempt. In all, there are eight environments to explore this time, including the aqueducts, a formal party, a biomedical laboratory, the haunted city of Xi'An, the tomb of the first Chinese emperor, a monster-filled island garden, a towering pagoda, and finally hell itself. While the story is obviously geared toward a single plot point, there are many situations where you'll get to make choices that take the story in a new direction. Similar to the original, the prequel also features multiple final boss characters and endings based upon the choices you make near the end of the game. Between completing the game, playing out each ending, and revisiting it again for secrets you've missed, Fear Effect 2 has a good 60 to 80 hours of gameplay. The prequel may be an improvement, but Fear Effect 2 isn't without its flaws. Foremost of these is the game's inventory system, which while speedier than that of the original, still lumps all weapons and items together in a cyclical list. This wouldn't be so bad, except you have to manage it all in real time. If you're transplanted into the thick of battle with only a sonar weapon and you need to switch to an assault rifle ASAP, you'll have to cycle through five or six items before finally being allowed to equip the necessary weapon. Additionally, while Kronos Digital has done an excellent job of creating eight unique environments, the game's first stage, the aqueducts, is a pathetically lengthy rip-off of the tunnels from any Parasite Eve or Resident Evil game. Not only is it one of the more difficult areas in the game, it's also the least engaging and least important to the storyline. Some of you may also find the constant exploration and puzzle aspects of the game to be overwhelmingly tedious, but this is a complaint more in line with general tastes than it is against the game itself. If you like the genre and can see past the touchy inventory system and lackluster first area, you'll likely find Fear Effect 2 to be a satisfyingly suspenseful hands-on experience. Of course, survival-horror is a genre that relies heavily on graphical presentation. In this respect too, Fear Effect 2: Retro Helix is a stellar example. In keeping with the first game, the prequel superimposes polygonal texture-mapped characters onto full-motion video backgrounds to convey a sense of realism and mood. While the execution is a bit grainy and dark, the overall effect is superb. Environments are colorful, highly animated, and detailed, although the FMV looping is noticeable at times. The game's characters and enemies are once again rendered in an anime style reminiscent of those in Sega's Jet Grind Radio, but movement is much more fluid this time around since Kronos has done away with the stiltedness of motion capture in favor of hand-tweaked animation. As you progress through the game, you'll don a variety of costumes, see blood spurt from half-dead monsters, and even witness a few rather sexually charged situations. Wrapping it all up, more than two hours of full-motion video cinematics are seamlessly woven into the game to provide both plot development and brief relief from its lengthy quest.Although the first Fear Effect was an excellent effort, there were many criticisms raised against it for a variety of reasons. To make the prequel more palatable to a larger audience, Kronos Digital has made some improvements to the game. A 3D-oriented control option joins the default survival-horror interface, postdeath load times have been eliminated, and replay value has been improved through the inclusion of special weapons and hidden secrets. The addition of Rain also provides a much-needed fourth character and love interest for Hana, as well as a reason to kick the game's maturity level into the stratosphere. Fear Effect 2 is also longer and less linear than the first attempt. In all, there are eight environments to explore this time, including the aqueducts, a formal party, a biomedical laboratory, the haunted city of Xi'An, the tomb of the first Chinese emperor, a monster-filled island garden, a towering pagoda, and finally hell itself. While the story is obviously geared toward a single plot point, there are many situations where you'll get to make choices that take the story in a new direction. Similar to the original, the prequel also features multiple final boss characters and endings based upon the choices you make near the end of the game. Between completing the game, playing out each ending, and revisiting it again for secrets you've missed, Fear Effect 2 has a good 60 to 80 hours of gameplay. The prequel may be an improvement, but Fear Effect 2 isn't without its flaws. Foremost of these is the game's inventory system, which while speedier than that of the original, still lumps all weapons and items together in a cyclical list. This wouldn't be so bad, except you have to manage it all in real time. If you're transplanted into the thick of battle with only a sonar weapon and you need to switch to an assault rifle ASAP, you'll have to cycle through five or six items before finally being allowed to equip the necessary weapon. Additionally, while Kronos Digital has done an excellent job of creating eight unique environments, the game's first stage, the aqueducts, is a pathetically lengthy rip-off of the tunnels from any Parasite Eve or Resident Evil game. Not only is it one of the more difficult areas in the game, it's also the least engaging and least important to the storyline. Some of you may also find the constant exploration and puzzle aspects of the game to be overwhelmingly tedious, but this is a complaint more in line with general tastes than it is against the game itself. If you like the genre and can see past the touchy inventory system and lackluster first area, you'll likely find Fear Effect 2 to be a satisfyingly suspenseful hands-on experience. Of course, survival-horror is a genre that relies heavily on graphical presentation. In this respect too, Fear Effect 2: Retro Helix is a stellar example. In keeping with the first game, the prequel superimposes polygonal texture-mapped characters onto full-motion video backgrounds to convey a sense of realism and mood. While the execution is a bit grainy and dark, the overall effect is superb. Environments are colorful, highly animated, and detailed, although the FMV looping is noticeable at times. The game's characters and enemies are once again rendered in an anime style reminiscent of those in Sega's Jet Grind Radio, but movement is much more fluid this time around since Kronos has done away with the stiltedness of motion capture in favor of hand-tweaked animation. As you progress through the game, you'll don a variety of costumes, see blood spurt from half-dead monsters, and even witness a few rather sexually charged situations. Wrapping it all up, more than two hours of full-motion video cinematics are seamlessly woven into the game to provide both plot development and brief relief from its lengthy quest.Fear Effect 2's audio and voice acting are impressive. The game's soundtrack is hauntingly effective, while a number of timed musical cues give the experience a distinctly Hollywood edge. Sound effects, while taken from the same generic array that all survival-horror games seem to draw from, are loud, crisp, and fitting. Since the game relies on its story and characters to keep you interested, the quality of voice acting is important to its overall success. Fear Effect 2 does not disappoint. Wendee Lee voices the role of Hana and does a much better job this time around, while the voices of Anthony Marcott and Lex Lang do an A-plus job of bringing out the personalities of Glas and Deke. Professional voice actors are used for every speaking character in the game, including generic enemies and bosses, and it's an extravagance that pays big dividends. If the previous seven paragraphs didn't make the point clear, Fear Effect 2: Retro Helix is a game that successfully blends the action, survival-horror, and role-playing genres into a single outstanding product. It does have its flaws, but if you're even mildly interested in games like Resident Evil, Parasite Eve, or Metal Gear Solid, you'll probably love Fear Effect 2. Fear Effect 2's audio and voice acting are impressive. The game's soundtrack is hauntingly effective, while a number of timed musical cues give the experience a distinctly Hollywood edge. Sound effects, while taken from the same generic array that all survival-horror games seem to draw from, are loud, crisp, and fitting. Since the game relies on its story and characters to keep you interested, the quality of voice acting is important to its overall success. Fear Effect 2 does not disappoint. Wendee Lee voices the role of Hana and does a much better job this time around, while the voices of Anthony Marcott and Lex Lang do an A-plus job of bringing out the personalities of Glas and Deke. Professional voice actors are used for every speaking character in the game, including generic enemies and bosses, and it's an extravagance that pays big dividends. If the previous seven paragraphs didn't make the point clear, Fear Effect 2: Retro Helix is a game that successfully blends the action, survival-horror, and role-playing genres into a single outstanding product. It does have its flaws, but if you're even mildly interested in games like Resident Evil, Parasite Eve, or Metal Gear Solid, you'll probably love Fear Effect 2."}