{"ref": "https://www.gamespot.com/reviews/hellfire-review/1900-2537524/", "date": "May 1, 2000", "game_name": "Diablo", "text": "To the surprise of many gamers, instead of releasing an expansion pack for Diablo, Blizzard North decided to focus its efforts on a full-fledged sequel (which has tentatively been given the appropriate, if unoriginal, title Diablo II). But gamers have continued to clamor for more Diablo, and eventually the expansion pack torch was passed to Blizzard's affiliate, Synergistic Software. Synergistic's Hellfire gives gamers new levels, monsters, items, spells, and single-player quests and refinements to the original Diablo engine, but the overall package is slightly less compelling than the original game.As with Diablo, Hellfire's storyline is not particularly deep - Na'Krul, a demon that once ranked highly in Diablo's hierarchy until turning on his master, is released from exile by ye local foolhardy mage. Na'Krul and his cronies set up shop in eight new levels that fit seamlessly into the original game. These eight new levels are divided into two areas, each with its own new tileset, the gothic Demon Crypt (home sweet home for Na'Krul) and the Festering Nest, an organic hive-like domain that hosts Na-Krul's ~Starship Troopers-refugee~ lieutenant, the Defiler. In addition to these new threats, you must once again deal with the big guy, Diablo, who returns more powerful than ever.Although all the new monsters are confined to the new Hellfire levels, once you install Hellfire, you can find new items and shrines scattered throughout the original 16 levels of Diablo. You can use a new character class, the Monk, to conquer the challenges in the original game. The new Hellfire levels are roughly equivalent in difficulty to levels nine through 16 of the original game, which means you must either transfer a high-level character from the old game (through a needlessly cumbersome process), download one of the characters that has been made available at Sierra's web site, or trudge through the old levels with a new character if you want to survive the new levels. In addition to the new character class, items, and shrines, Hellfire provides a number of refinements to Diablo's gameplay - you can now jog instead of merely sauntering around town, cast spells to quickly find an exit to a level or to locate a tiny ring that you vaguely heard drop nearby, and can buy more useful items from the town's ever-greedy merchants. Synergistic has also added difficulty levels into the single-player version of the game, a feature inexplicably lacking from the original game. Gamers who are still playing Diablo will definitely appreciate these enhancements more than those who put Diablo back on the shelf long ago.The most notable absence from Hellfire is multiplayer support, an especially surprising omission considering that Diablo is one of the most popular multiplayer games of all time. Given the amount of player hacking the original game underwent, it's not surprising that an unofficial hack has already appeared to let you use the Monk character class in a multiplayer game (but not on Battle.net, Blizzard's free Internet server). Future hacks may succeed in making the new levels and monsters accessible in a multiplayer game, but such hacks won't receive official sanction or support. For now, you'll be forced to play the new levels solo, which is reason enough for a significant portion of Diablo's fans to stay away from this expansion pack.Hellfire includes a couple dozen new enemies, over 30 new magic items, seven new spells, and a handful of relatively simple new quests. The Monk character class is a very powerful fighter-mage. In addition to being a formidable spell-caster, the Monk is an adept martial artist who can use a staff to attack multiple opponents at once and is skilled in unarmed combat (yep, now you can kick Diablo in the head). The new spells include a healthy mix of defensive enchantments, devastating new offensive weapons (the original game's most powerful spells, Apocalypse and Nova, are now also available as spell books), and spells that just make wandering through the labyrinths more convenient.Unlike the original game, most new monsters are represented by original artwork and are not just differently colored and powered variations of monsters previously used in the game. But there's a price to be paid for all the new art, as the monster animations and death sequences, in particular, appear to be less detailed than those included in the original game (although there are some great additions, such as the Liches, Crypt Demons, and Orbs). The new Demon Crypt tileset works well and is as detailed as any of the four tilesets in Diablo, but the Festering Nest tileset is a bit too disorienting and cluttered. There are, however, some nice graphical touches. For example, the barrels that appeared throughout the original game are replaced in the Festering Nest levels with organic body-snatcher-ish pods and by suitably gothic urns in the Demon Crypt. Hellfire adds some impressive new spell effects, such as huge glowing fireballs. The new levels also come with their own musical scores, which mainly consist of ambient sounds and don't measure up to the quality of the music in the original game.Hellfire fails to provide as compelling an experience as Diablo, but does provides a good quantity of new monsters, items, spells, and settings, and a number of gameplay enhancements that eliminate a few annoyances of the original game. These additions and enhancements may not be sufficient to breathe new life into the original game, but if you are a single-player Diablo addict, Hellfire will enhance your enjoyment of Diablo. Hellfire is definitely more of the same, but that's not necessarily a bad thing, considering that Diablo was GameSpot's 1996 Game of the Year. Multiplayer aficionados, however, should pass on Hellfire."}