{"ref": "https://www.gamespot.com/reviews/world-tour-soccer-2006-review/1900-6121424/", "date": "March 31, 2005", "game_name": "World Tour Soccer 2006", "text": "Despite some lackluster performances in recent years, the World Tour Soccer team hasn't given up on achieving some kind of result against the likes of EA's FIFA series and Konami's Winning Eleven games on the PlayStation 2 playing field. Like both of those series' latest installments, World Tour Soccer 2006 primarily looks to improve upon its predecessor through the introduction of new features and subtle gameplay refinements. Unlike those series' latest installments, however, World Tour Soccer 2006 ranks as one of the worst soccer games to appear on the PS2 to date, for reasons that will soon become clear. Despite its cool EyeToy support, World Tour Soccer 2006 has little to offer soccer fans. It says a lot about World Tour Soccer 2006 that the most significant new feature you'll find in the game is its EyeToy Cameo support, which lets you stick something that vaguely resembles your own head onto an in-game player. The Digimask-powered process is surprisingly simple, and provided you set your EyeToy camera up in an appropriately well-lit area, it's actually possible to create a reasonably pleasing 3D likeness of your head, complete with freakish facial animations, within just a few minutes. Something strange happens between the initial creation of your 3D head and its first appearance in-game though, and more often than not your would-be doppelganger will boast either a ghostly white or a slightly unnerving purple complexion when he steps out onto the pitch. You can create a custom team composed entirely of EyeToy Cameo players, incidentally, but since each cameo weighs in at 685KB, when you save it you'll need an otherwise empty memory card to do so. Other new features in World Tour Soccer 2006 are few and far between, and we're sorry to report that most of the flaws we noted in our review of last year's game not only are still present, but are now joined by a host of all-new ones. For example, you'll still get to stare at a loading screen for almost a minute before every match (longer if you want to use EyeToy Cameo players), and you'll still find that you can quite effortlessly walk the ball from one end of the field to the other on at least two of the game's four difficulty settings. Replays of goals are generally so short that you don't get to see the strike (let alone any of the buildup), and you'll certainly notice that your occasionally inanimate and mostly useless CPU teammates have little more than their names and their hairstyles in common with their real-life counterparts. New problems in this year's game, or at least those that are more pronounced now, include referees that are always very slow to react to incidents, goalkeepers that are often even slower to react to incoming shots, players under your control occasionally refusing to make contact with the ball, an inconsistent frame rate, and commentators that often deliver repetitive and inaccurate information. Like a stopped clock, the commentators aren't always wrong of course, and occasionally they'll come out with some real gems, like ~This is a semiprofessional league match between these two representatives of the semiprofessional league,~ which, although poorly written, is certainly accurate. There are ~school league~ and ~professional league~ variations on that particular quote, both of which you'll be hearing a lot of if you're brave enough to tackle World Tour Soccer 2006's career mode. This year's career mode is largely unchanged from that in World Tour Soccer 2005, which means that before you're able to compete in professional leagues you'll have to play through and win both school and semiprofessional seasons. For those of you who like numbers, this means that before you're able to compete against professional teams and check out the transfer market, you'll have to play almost 50 matches using a team composed entirely of players whose overall skill ratings are lower than 10 out of a possible 100. Worse still, when you make it to the professional leagues (you can choose to play in one of 23 from around the world), you'll still be in charge of the same school team that you started out with. Your players will have reached at least 16 or 17 years of age by that point, but their skills in the professional stadiums will be no better than when they were competing on school playing fields. Fortunately you'll receive around $7.5 million with which to improve your team when you become a professional manager, which we found was more than enough money to add several decent players to our squad. There are more than 19,000 real-life players in World Tour Soccer 2006, so there's never any shortage on the transfer market. The search engine you'll use to find players that you're interested in is adequate rather than great, and sifting through the attributes of players on your short list can be a time-consuming process. This is in stark contrast to the actual transfer deals, though, which can see new players joining your squad within a few seconds of your submitting an offer. Occasionally you might find yourself becoming embroiled in a bidding war for the services of a particularly talented or promising player, but for the most part the deals are uneventful. There's not even any mention of a player's wage demands when you sign them, which is particularly unfortunate given that their services don't come for free. The arrows around the edge of the screen are a useful feature that helps you to locate teammates. So, can we think of anything good to say about World Tour Soccer 2006? Of course. Some of the stadiums and new player animations look really good (though the pitches and crowds don't), the option to change your team's tactics on the fly is still great, the game's soundtrack isn't awful, and the arrows that appear around the edge of the screen to show you where your offscreen teammates are would make a great addition to any soccer game that doesn't already feature them. We're also pleased to report that your CPU opponents in World Tour Soccer 2006 hardly ever use the deliberate dive button. World Tour Soccer 2006 also boasts some interesting unlockable content that you'll gain access to via a club shop and tokens system, including additional stadiums, amusing sound-effect packs, and plenty of classic, super, and all-star teams. World Tour Soccer 2006 is a game that's even more difficult to recommend than its predecessor, not only because it's inferior in many ways, but because its competitors have improved their games significantly in the last year. Perhaps the most disappointing (and surprising) thing about World Tour Soccer 2006 is that it's vastly inferior to the recently released PSP World Tour Soccer game, which not only plays a better game of soccer but also features a style-based challenge mode that's infinitely more enjoyable than that on the PS2. Last year we likened World Tour Soccer 2005 to an overweight soccer fan who wears a replica uniform and dreams of joining his heroes (FIFA and Winning Eleven) on the pitch one day. This year, that guy is still doing pretty much the same thing, except his replica uniform is a season out of date and starting to smell bad."}