{"ref": "https://www.gamespot.com/reviews/f1-2001-review/1900-2818008/", "date": "May 17, 2006", "game_name": "F1 2001", "text": "Considering how relatively unpopular the sport is in the United States, it's amazing how many games based on Formula One racing are released on our shores every year. All told, there are almost as many F1 games released by companies like Eidos, Ubi Soft, Sony, and MicroProse as there are games based on the NASCAR license, which is easily this country's favorite form of auto racing. And yet, of those games, very few have managed to walk the fine line between appealing to the masses and appealing to those who require the utmost level of realism, but that's precisely what Electronic Arts' F1 2001 for the PlayStation 2 does. As its title implies, F1 2001 is based on the current season of Formula One racing, which concluded only recently, and it lets you race on any of the 17 circuits as any of the 11 teams' 22 drivers, including veteran Michael Schumacher and rookie Juan Pablo Montoya. As you'd expect, the game has numerous racing options, including a quick race mode that lets you instantly drive around the circuit of your choosing and a more robust career option that takes you through all 17 of the series' races. None of this, however, is anything that other Formula One games haven't offered in the past. Where F1 2001 differentiates itself is with the bevy of single- and multiplayer options that let you make the game as approachable or as challenging as you like. In fact, there are five different multiplayer options alone in the game, one of which lets a whopping total of 22 players take turns competing against each other for the fastest lap on any given track. F1 2001 also has several split-screen modes that let you race against another friend, including a tag team mode and a surprisingly fun mode called last man standing, wherein the last-place car is eliminated after each lap in a race. But the heart of F1 2001 lies in its Grand Prix mode, which is as robust and varied as its multiplayer counterpart. Grand Prix mode is actually made up of five distinct modes of gameplay, including a single weekend event, full and custom championship modes, and a domination event that requires you to complete an entire F1 season without coming in below first place in any race. What's interesting about the Grand Prix mode is that it's initially locked--F1 2001 doesn't let anyone enter these races, no matter how skilled, without first passing a series of challenges that are presented in a manner similar to Gran Turismo 3's license tests. Specifically, there are 25 challenges that the game grades you on, and they range from the basics of racing--braking, cornering, and so on--to more complex race craft like pitting, fuel management, and driving under wet conditions. The intention of these tests is a good one, but their execution is rather poor. First of all, while they are a good primer to Formula One racing for beginners, experienced players might be annoyed at being forced to go through these exercises before being able to qualify for the Grand Prix mode. Furthermore, the game doesn't give you any real indication of what you're supposed to do, aside from showing a trackside replay that's more confusing than helpful. Some drive lines, speed indicators, and/or a map of the test area would have gone a long way toward making these challenges more educational. Regardless, it shouldn't take anyone with a passing knowledge of driving mechanics more than an hour to complete these tests and proceed to the Grand Prix portion of F1 2001. The cars themselves handle with a surprising amount of precision. At first, the controls feel twitchy and overly responsive, but that's simply the nature of F1 cars. Mashing the accelerator or brake around corners will get you nowhere fast, and it'll take you a few laps to get used to the sensitivity of the Dual Shock's analog face buttons. But once you get the hang of controlling these cars, staying competitive with the rest of the field shouldn't be a problem. Of course, options like driving assists, turn indicators, and adjustable AI can better help you find a level of realism you're comfortable with. F1 2001 also has two overarching handling modes--normal and simulation--for those who don't want to fiddle with the finer aspects of the game's adjustable driving model. What's more, the game supports USB peripherals, so players with a wheel and pedal combo will enjoy the added level of control. We played the game using Logitech's GT Force wheel and preferred its tight control and wide range of motion to the standard PlayStation 2 controller.Each of the 17 weekend events in the Grand Prix mode is fairly straightforward. You'll have the chance to tweak various aspects of your car's performance, like tire compound, gear ratios, and suspension setup, during warm-up, practice, and qualifying sessions. After you've dialed in the car to your liking and become comfortable with the racetrack, you'll be entered in the actual race. Here, you can customize the game even further by toggling options like car damage, FIA rules, transmission, race length, AI difficulty, and tire wear. All of these options have a drastic impact on the race. Fuel use, for example, is an option that depletes your fuel throughout the course of the race, which makes your car lighter. You can actually notice this change, because your car will feel a little more nimble around turns and faster down straights. The physics engine of the game is impressive because of its dynamic nature. The game does a good job of modeling damage, and if you lose your front wing, for example, your braking distance will increase. Tire wear will also have a significant effect on how aggressive you race, and factors like track conditions will also force you to change the way you're driving. One of the biggest of these factors is weather. F1 2001 has a dynamic weather generator that can change the conditions of a racetrack from favorable in its opening laps, to downright miserable in the closing moments. The skies will actually darken, and the rain will start as a drizzle at first and then change to an all-out downpour. What's more, effects like rain do more than just affect your handling. They'll also affect--sometimes severely--your visibility. Heavier sheets of rain will splatter on your visor for an effect not unlike the one found in the Metal Gear Solid 2 demo, and this effect is compounded even further by the ~rooster tails~ that each car on the track kicks up. The graphics engine of F1 2001 seems especially good at rendering peripheral effects like rain droplets, dust clouds, gravel, flags in the grandstands, sun glare, and even some conservative use of motion blur. The game even draws all of your pit crew in complete 3D, but although they're fairly well animated, the crew members don't move with the same sense of urgency they do in real life. Regardless, it's certainly nice to see an F1 game model a decent pit area, complete with crew. The actual track and car models leave something to be desired, however. While each car has plenty of detail up close--you can easily make out the tire tread, logos, and even some reflections of surrounding objects--in motion, they lose a lot of their visual splendor. Likewise, the tracks are all accurately modeled, but they lack the polish of those in F355 Challenge, for example. In fact, the whole game has a very grainy look to it that only seems to disappear when standing still. This is especially true in the replays, which don't even come close to displaying the level of realism found in Gran Turismo 3 or MotoGP. This is unfortunate, because the lack of sharp visuals isn't a purposeful move to increase performance, as F1 2001 doesn't seem to run at 60fps either. Like the graphics, the sound in F1 2001 is a mix of impressive and average effects. At idle, the cars lack the growling, sputtering rumble that F1 cars emit, but at wide-open throttle, these machines scream as loudly as the real thing. Tearing down straightaways, the cars in the game will wail like banshees on helium. The radio chatter from your pit chief is well done, as is the voice of the commentator, who does his best to keep from getting repetitive or annoying. The game doesn't have any music in the actual races, but the menu interfaces feature a number of well-produced techno and jazzy selections. Ultimately, F1 2001 is a wholly satisfying racing game. Its interface is extremely slick, and while some of the in-game menus have some room for improvement, the entire game's presentation is well done. The game can be played 10 different ways--five single-player and five multiplayer modes--and its many tuning options make it adjustable for a wide range of experience levels. The controls are tight, the sound is on par with similar racing games, and the graphics are what you'd expect from a PlayStation 2 game. Already, there are a handful of Formula One games for the PlayStation 2, but if you're going to buy only one, make sure it's this one.Each of the 17 weekend events in the Grand Prix mode is fairly straightforward. You'll have the chance to tweak various aspects of your car's performance, like tire compound, gear ratios, and suspension setup, during warm-up, practice, and qualifying sessions. After you've dialed in the car to your liking and become comfortable with the racetrack, you'll be entered in the actual race. Here, you can customize the game even further by toggling options like car damage, FIA rules, transmission, race length, AI difficulty, and tire wear. All of these options have a drastic impact on the race. Fuel use, for example, is an option that depletes your fuel throughout the course of the race, which makes your car lighter. You can actually notice this change, because your car will feel a little more nimble around turns and faster down straights. The physics engine of the game is impressive because of its dynamic nature. The game does a good job of modeling damage, and if you lose your front wing, for example, your braking distance will increase. Tire wear will also have a significant effect on how aggressive you race, and factors like track conditions will also force you to change the way you're driving. One of the biggest of these factors is weather. F1 2001 has a dynamic weather generator that can change the conditions of a racetrack from favorable in its opening laps, to downright miserable in the closing moments. The skies will actually darken, and the rain will start as a drizzle at first and then change to an all-out downpour. What's more, effects like rain do more than just affect your handling. They'll also affect--sometimes severely--your visibility. Heavier sheets of rain will splatter on your visor for an effect not unlike the one found in the Metal Gear Solid 2 demo, and this effect is compounded even further by the ~rooster tails~ that each car on the track kicks up. The graphics engine of F1 2001 seems especially good at rendering peripheral effects like rain droplets, dust clouds, gravel, flags in the grandstands, sun glare, and even some conservative use of motion blur. The game even draws all of your pit crew in complete 3D, but although they're fairly well animated, the crew members don't move with the same sense of urgency they do in real life. Regardless, it's certainly nice to see an F1 game model a decent pit area, complete with crew. The actual track and car models leave something to be desired, however. While each car has plenty of detail up close--you can easily make out the tire tread, logos, and even some reflections of surrounding objects--in motion, they lose a lot of their visual splendor. Likewise, the tracks are all accurately modeled, but they lack the polish of those in F355 Challenge, for example. In fact, the whole game has a very grainy look to it that only seems to disappear when standing still. This is especially true in the replays, which don't even come close to displaying the level of realism found in Gran Turismo 3 or MotoGP. This is unfortunate, because the lack of sharp visuals isn't a purposeful move to increase performance, as F1 2001 doesn't seem to run at 60fps either. Like the graphics, the sound in F1 2001 is a mix of impressive and average effects. At idle, the cars lack the growling, sputtering rumble that F1 cars emit, but at wide-open throttle, these machines scream as loudly as the real thing. Tearing down straightaways, the cars in the game will wail like banshees on helium. The radio chatter from your pit chief is well done, as is the voice of the commentator, who does his best to keep from getting repetitive or annoying. The game doesn't have any music in the actual races, but the menu interfaces feature a number of well-produced techno and jazzy selections. Ultimately, F1 2001 is a wholly satisfying racing game. Its interface is extremely slick, and while some of the in-game menus have some room for improvement, the entire game's presentation is well done. The game can be played 10 different ways--five single-player and five multiplayer modes--and its many tuning options make it adjustable for a wide range of experience levels. The controls are tight, the sound is on par with similar racing games, and the graphics are what you'd expect from a PlayStation 2 game. Already, there are a handful of Formula One games for the PlayStation 2, but if you're going to buy only one, make sure it's this one."}