{"ref": "https://www.gamespot.com/reviews/the-sims-bustin-out-review/1900-6100210/", "date": "May 17, 2006", "game_name": "The Sims Bustin' Out", "text": "The Sims Bustin' Out for the N-Gage is a fairly direct port of The Sims Bustin' Out for the Game Boy Advance. The game takes much of the fundamentals from The Sims for the PC and then streamlines the experience by removing some of the sandbox aspects of the gameplay, thus turning it into more of a traditional game, complete with predefined goals, minigames, and the like. The end result is pretty different from Maxis' original lifestyle simulation, but it's still a laid-back game that carries some inherent appeal, despite the presentation's rough edges. It's not as free-form as The Sims on the PC, but it retains much of that game's charm. You start the game as a sim--a rough approximation of a living, breathing person--who has moved out from the big SimCity to his uncle's farm in SimValley for the summer. You'll define the basic characteristics of your sim, which includes physical stuff like gender and hair color, as well as personality traits, like cleanliness, sociability, and zodiac sign. These stats will factor into the basic needs of your sim, which include food, hygiene, sleep, social interaction, stamina, bladder, entertainment, and homesickness. These needs are represented by a row of bars at the bottom of the screen, and as your sim goes about his or her business, these bars will slowly drop. If a bar gets too low, your sim won't function correctly. Micromanaging these needs has always been one of the fundamentals of The Sims, and quite frankly, it's not particularly fun. But, to its credit, The Sims Bustin' Out does a fairly good job of making these needs easy to fulfill, which means you can spend more time running errands, rearranging the furniture in and buying new furniture for your living space, chatting with the other sims, and meeting goals to advance your sim to the next level. But as much as you alter the basic makeup of your sim, the characters that you'll encounter in SimValley don't really change much from game to game. As a result, you'll generally meet the same group of sims, which includes your Uncle Hayseed, a salty old sea captain-turned-fish-and-chips vendor (appropriately named Olde Salty), a burly biker named Dusty Hogg, and an aspiring politician named Nora Zeal-ott, among many others. Since the encounters your sim will have won't vary too radically, the replay value for Bustin' Out isn't great. However, the core game is long enough that this isn't too big an issue, really. Conversing with the other residents in SimValley is a big part of the game, since your talks can lead to occasional errands. More importantly, though, these dialogues build stronger relationships with other sims. Basically, these conversations are driven by a short list of statement options, which have a positive, negative, or neutral effect on your relationships. However, it doesn't take long to figure out the different effects various statements will have, and since the statement options recycle with great frequency, this aspect of the gameplay turns into a rote mechanic before long. In The Sims for the PC, your sims would magically disappear for a good eight hours a day to go to ~work,~ but The Sims Bustin' Out makes earning simoleans (the currency in the world of The Sims) more interesting by making you an active participant in your work. The main way to get paid in Bustin' Out is by playing the job minigames, which are based on tasks like mowing the lawn for your uncle, serving drinks to rowdy bikers, fishing, and, rather inexplicably, lifting weights. Some of these are more interesting and more well-executed than others, but they all bring some variety to the gameplay, and they prove to be nice, little departures from the standard gameplay in The Sims. The N-Gage version of Bustin' Out features three exclusive new minigames--Snake, Tennis, and Blocks--which are essentially emulated versions of Nokia cell-phone games of the same name. They're pretty good versions of these games, and high scores can net you some unique in-game items, but as far as exclusive content goes, it's pretty underwhelming. There is also some N-Gage Arena support, which lets you post high scores in the minigames, and you can use Bluetooth to trade items with another player. It's not much for connectivity, but for a game that doesn't really lend itself to multiplayer action, it's about as much as you could expect. The N-Gage has shown the capacity for some basic 3D graphics, but The Sims Bustin' Loose opts to stick with prerendered sprites on an isometric background. The game's look is definitely reminiscent of The Sims on the PC, though the proportions of the models are far more exaggerated, lending the game a goofier, more playful feel. The game is not particularly graphically stunning, but the game gives you a pretty good sense of location for SimValley, and what's there is functional. There are a few odd pieces, such as some rather peculiar-looking skin tones, but the impact they have on the overall presentation is pretty nominal. The job minigames make work more fun--and less of an abstract concept. The elements that make up the sound are mostly lifted from other Sims games, including some looping instrumental tracks and little clips of simlish, the rather convincing gibberish language spoken by all sims. You'll also notice some ambient sounds that change based on time of day and location. It would be nice if these sounds played at a higher bit rate, because, as it stands, most of them sound rather grainy coming out of the N-Gage's speaker. Fans who know The Sims through their PC exploits may be disappointed by the significantly more-straightforward path that The Sims Bustin' Out follows, but what's here is pretty engaging. It's pretty low-key and doesn't rely on a lot of twitchy-action gameplay mechanics, which is perfect for the N-Gage. Certain aspects of the gameplay can become a little tedious over time, and the game could've benefited from a slightly cleaner presentation, but there's really nothing like it on the N-Gage, and it's still good fun, despite its shortcomings."}