{"ref": "https://www.gamespot.com/reviews/mtv-sports-pure-ride-review/1900-2633684/", "date": "May 17, 2006", "game_name": "MTV Sports: Pure Ride", "text": "It's the third time around for Radical and its MTV series of PlayStation snowboarding games. While last year's effort, MTV: Snowboarding, is enjoyable for its depth of play, the game's graphics leave visual purists with a sense of yearning. This year, Radical has spruced up a few things, but basically, it has rolled out the same game. MTV: Pure Ride is an excellent snowboarding game, but it's yet another example of a development house shifting the majority of its resources to the next generation of hardware. Like last year's game, Pure Ride is simply loaded with options. The core of the gameplay takes place in the tour challenge mode. Here you begin by picking one of five selectable characters and one of six boards to rip with. As you begin each event, you are faced with the challenge of placing first overall through three events: half-pipe, big air, and slopestyle. As you defeat each circuit, a new circuit opens. There are nine riders (including four real-world pros), 14 boards, and extra courses to unlock when you make it to the top of the leader board. Pure Ride gives you ample chance to learn how to play. Before you hit the tour, you can polish your skills in the specialist or stunt modes. In the specialist mode you may practice the separate events that are commonplace on the tour. In each discipline you begin with a target score to reach. If you make the target, the next track becomes available. In the stunt mode you are faced with scenarios that gradually build in difficulty. It begins easily enough with a simple gap jump. But the testing quickly graduates to a sequence of rail tricks that must be performed error-free for you to advance. As if all these modes weren't enough, you may also cruise down any of the open courses at your leisure in the free-ride mode. Or if you've become tired of the courses that Radical provides, you may jump over to the build-a-mountain mode and set up your own personalized stunt course. Two players may also face off head-to-head in races down the open courses. While very few amendments have been added to the original formula of last year's game, Pure Ride's options definitely keep it real. If you're looking for a pretty snowboarding game to impress your friends with, MTV Sports: Pure Ride shouldn't be on the top of your list. If you manage to stay on course and keep a good speed, nothing seems overly offensive. The impressively long field of vision lets you prepare for the terrain ahead as the draw-in is rarely noticeable. The animation of each trick is smooth, but the camera is so far panned out that it's often difficult to tell an indy grab from a mute or a stalefish from a backside. It's when things slow down after a crash that Pure Ride's graphical imperfections become apparent. The scaling of some of the objects is surreal. The picnic tables look like they are meant for giants, and the buses placed for obstacles are larger than they should be. The tree sprites are a pixelated mess, and overall the texture quality is just a touch blurry. Normally the game hums along at a steady frame rate, but if you catch major air, which requires the game engine to draw a long distance, it's slideshow city. Your rider also has a tendency to ~teleport~ onto rails even though he may be several feet away, which can make for some awkward moments. The available tricks are also a bit puzzling. You may ollie up to rails and grind them, but performing board slides isn't possible. Even when it says you're performing a nose grind, it's impossible to distinguish it from any other sort of grind. There are special tricks unique to each rider that require insane amounts of hang time to pull off but are satisfying once you nail them down.Pure Ride is no snowboarding simulation. Oftentimes when you're coming off a rail the computer will automatically eject you directly toward the next one. You get moving so fast down the mountain that you sometimes catch hundreds of feet of air off the smallest of hits. But if it's excitement you're looking for, Pure Ride has plenty to spare. Radical has set up the game so that if it's played correctly, it's a blast. Once you discover the timing needed to land each combination of tricks, the expansive courses open themselves up to getting burly. The courses are more than branching as they are full of new areas to discover. It's easy to find a new line each time down the hill while attempting to one-up your previous score. Considering Pure Ride carries the MTV license, it's surprising that the game's soundtrack doesn't carry a group of A-list recording artists. Instead you get what is described as a compilation of some of the world's hottest up-and-coming bands. What you really get is a bunch of songs from groups that are still unearthing the mysteries of the bar chord. As you might expect, the majority of the music is grunge/rap rock, but there is one nice dub-influenced tune thrown in that truly reflects the snowboarding vibe. The sound effects get the job done: Digging your edges into the snow emits a raspy scrape while gently carving provides that wonderful whooshing sound that sings hard-core snowboarders to sleep at night. While not necessarily a leap ahead of last year's release, MTV Sports: Pure Ride is a solid snowboarding game with enough options and tricks to keep you busy for weeks. The gameplay is fast and intuitive, and while the graphics aren't eye-popping, Radical has managed to capture what is most important in snowboarding games: the spirit of freedom.Pure Ride is no snowboarding simulation. Oftentimes when you're coming off a rail the computer will automatically eject you directly toward the next one. You get moving so fast down the mountain that you sometimes catch hundreds of feet of air off the smallest of hits. But if it's excitement you're looking for, Pure Ride has plenty to spare. Radical has set up the game so that if it's played correctly, it's a blast. Once you discover the timing needed to land each combination of tricks, the expansive courses open themselves up to getting burly. The courses are more than branching as they are full of new areas to discover. It's easy to find a new line each time down the hill while attempting to one-up your previous score. Considering Pure Ride carries the MTV license, it's surprising that the game's soundtrack doesn't carry a group of A-list recording artists. Instead you get what is described as a compilation of some of the world's hottest up-and-coming bands. What you really get is a bunch of songs from groups that are still unearthing the mysteries of the bar chord. As you might expect, the majority of the music is grunge/rap rock, but there is one nice dub-influenced tune thrown in that truly reflects the snowboarding vibe. The sound effects get the job done: Digging your edges into the snow emits a raspy scrape while gently carving provides that wonderful whooshing sound that sings hard-core snowboarders to sleep at night. While not necessarily a leap ahead of last year's release, MTV Sports: Pure Ride is a solid snowboarding game with enough options and tricks to keep you busy for weeks. The gameplay is fast and intuitive, and while the graphics aren't eye-popping, Radical has managed to capture what is most important in snowboarding games: the spirit of freedom."}