{"ref": "https://www.gamespot.com/reviews/monster-rancher-evo-review/1900-6148132/", "date": "April 21, 2006", "game_name": "Monster Rancher EVO", "text": "The DIY appeal of the Monster Rancher series has always been its biggest selling point. Though it's seen plenty of superficial changes, the gameplay has remained mostly unadorned over the four previous entries, with the focus remaining squarely on the core tasks of breeding your monsters, training them, and ultimately pitting them against other gladiatorial monsters. Monster Rancher EVO represents a huge departure for the series, as it all but abandons the previously stripped-down formula in favor of something more similar to a traditional Japanese RPG. It's true that the series wasn't gaining a lot of momentum before, but in its new form, Monster Rancher EVO dilutes the basic activities that made Monster Rancher endearing in the first place, and it's not particularly great as an RPG, either. Forget the ranch, it's time to run away and join the circus! Though the title Monster Rancher EVO is a none-too-subtle nudge that the series is ~evolving,~ perhaps a more suggestive and accurate title would have been Monster Rancher Goes to the Circus. While past Monster Rancher games very intuitively had you tending to monsters who lived on your ranch, EVO puts you in the role of a young, feathered-haired trainer of monsters who travels the world with the circus, putting on little song-and-dance routines with your sole monster, until one day when your costar inexplicably flips out and runs away. Fortuitously, a young girl capable of conjuring monsters virtually out of thin air shows up around the same time, joining your troupe of performers and taking an extra-special interest in your character's development into a world-class monster trainer. From here you'll go off on a series of rather disjointed adventures as the circus moves from town to town. As much time as the game invests in lengthy, text-based conversations between characters, there are no breakout characters worthy of the emotional investment that a really good RPG will evoke, and the story arcs you encounter in each of the different towns you travel to feel more like bends in the road. Aside from all the big-top trappings of the circus, EVO offers several other notable changes to the Monster Rancher formula. Of course, beneath it all, the actual monster-creation process remains the single most compelling activity. There's just something about being able to stick virtually any CD or DVD into your PlayStation 2 and see it produce some bizarre monster, which has always made the fact that you can acquire special in-game ~saucers~ with which to birth certain monsters a bit puzzling--like, why bother? Once you've got your monster, your first priority is to create a training regimen that best suits the personality of both your monster and the trainer. Your character is the only trainer at first, though eventually you can use other members of your circus troupe as monster trainers, and each has a different training style. A bond also forms between monster and trainer over time, and the stronger the bond, the better your monsters will perform. Since switching trainers breaks the bond, it's essential to establish a good match the first time around. The actual training process is all extremely hands-off, with you choosing the intensity of the training and the performance-enhancing gadget that each monster will train on. Different gadgets increase your monsters' stats in different ways, and though you start off with a few stock gadgets, you can also build your own gadgets from scratch at special shops found in the different towns. Gadgets basically prep the monster to put on a particular type of performance when showtime comes around, which is when you actually get involved. Performances simply require you to successfully complete a rhythm-based minigame that starts off easy, and stays pretty easy for quite awhile. How you perform here will determine the payoff of the weeks of training leading up to showtime. It's just too bad that the performance minigames are so repetitive and mind-numbingly dull. In the past, the whole training cycle served the purpose of preparing your monster for a series of regimented tournaments, which play a smaller role in EVO. Your monsters will still do plenty of fighting, though most of it will be in the adventure mode, which serves as a basic dungeon crawl through the areas surrounding each town you visit. You'll fight your way through wild monsters, pick up treasure chests, and take care of a variety of sundry quests for the people in town. Every time you best a wild monster, your monsters earn a little bit of anima, which is just fancy talk for the ever-present RPG convention of ~experience.~ Anima points can be cashed in for new abilities or traits, making it a necessity since your monsters will start out their lives with a very limited number of attacks. Up to three of your monsters can enter combat at once, regardless of the number of opponents you're facing, so there's definitely power in numbers. The combat is a familiar amalgamation of turn-based and real-time RPG combat. You can freely move your monsters forward and backward on the battlefield, and their relative distance from their opponents determines what kinds of attacks they can dish out. Performing an attack drains a shared pool of ~guts,~ which is slowly but surely refilling itself as the fight progresses, so the speed at which your guts meter refills will determine the pacing of the fight. You can speed up the regeneration of your guts meter by arranging your monsters so that all three are lined up side by side. The fights definitely get a bit more interesting as you further develop your monsters' abilities, but they still tend to run a bit on the slow side, and even with the large, rotating cast of opponents you'll face, there's definitely monotony to the process. One of the interesting, persistent twists in past Monster Rancher games was deciding whether you would directly control your monster before it entered combat, or if you'd just let its training and fate decide the outcome, and it's something that has been sadly ironed out of EVO. EVO seems to miss the point that people just want to breed monsters and fight them. The aesthetic of the Monster Rancher series has gone from blocky and utilitarian to flamboyantly cartoonish over the years, and EVO deviates yet again, taking on a style that's one part Cirque du Soleil and one part Final Fantasy, a combination that is likely a first. Despite its modestly sized environments and some bland texturing, it does a decent job of setting a uniquely derivative tone, and it has the most fully realized world of any of the Monster Rancher games. For the work that went into refining the game's visual style, EVO still seems to rely on the same cheaply synthesized sound design that the series has been leaning on since the beginning, though this time around it's occasionally spiked with poorly pronounced English sound bites. Scouring your media collection to see what sorts of monsters you can divine from it is still ultimately what makes Monster Rancher intriguing, not a limp cast of characters and a suite of peripheral tasks that distract from the fundamentals of monster husbandry. Rather than piling on additional, irrelevant features, Tecmo should be figuring out how to make the core disciplines of the series more accessible if that's how it really wants to see the Monster Rancher series evolve."}