{"ref": "https://www.gamespot.com/reviews/the-lord-of-the-rings-the-battle-for-middle-earth-/1900-6153687/", "date": "July 7, 2006", "game_name": "The Lord of the Rings: The Battle for Middle-Earth II", "text": "At last, the Xbox 360 version of The Lord of the Rings, The Battle for Middle-earth II has arrived, and we can see if EA's experiment to translate a PC real-time strategy game to a console is a success. Real-time strategy has been done on the consoles before, of course, but previous efforts have produced mixed results. However, since the power of the Xbox 360 is comparable to that of high-end PCs, EA felt that the time was right to try again, especially since it has a license that everyone is familiar with in The Lord of the Rings. So how does it play on the Xbox 360? The answer is surprisingly well. Apart from the control scheme, the game is virtually indistinguishable from the PC experience. As such, this is a pretty good introduction to real-time strategy for console gamers, and a good way to discover the joys of building up huge armies and using them to crush your opponents. Real-time strategy arrives on the Xbox 360 in the form of The Battle for Middle-earth II. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: The Lord of the Rings, The Battle for Middle-earth II Video Review The Battle for Middle-earth II gives you command of the forces of both good and evil as they war for the lands of Middle-earth. Or, more appropriately, the northern part of Middle-earth. The game's campaign covers all the stuff that was happening offscreen while Frodo was making his way to Mount Doom and the rest of the Fellowship was busy elsewhere in Peter Jackson's famous movie trilogy. The game can do this since it combines the movie license with the Tolkien estate license, which means that EA could draw upon all of J.R.R. Tolkien's works in addition to the movies. This combination could have been messy, but the results are a seamless blending of the two. You'll see armies of dwarves and elves battle it out with the goblin hordes, and there are appearances by many characters from the books, such as the Goblin King. At the same time, these new units fit in nicely with the familiar armies of Mordor and the men from the movies. The Xbox 360 version is a fairly straightforward translation of the PC game, though it does have some curious omissions that are balanced out by some notable additions. For instance, the single-player game consists of three modes. There's a good and an evil campaign, each of which has eight missions, and then a skirmish mode that lets you set up a stand-alone battle on any map. This includes maps from not only The Battle for Middle-earth II, but also for the first Battle for Middle-earth. Why are there maps from the first game included? They were originally included in the PC version of Battle for Middle-earth II to support the dynamic campaign, which lets you conquer all of Middle-earth any way you want as any of the six factions in the game. However, that dynamic campaign is missing altogether from the Xbox 360 version, and its absence is noted since it added a fair bit of replayability to the PC version. Still, at least it's nice to have the maps, as you can battle it out in skirmish on familiar settings, such as Helm's Deep and Minas Tirith. Even without the dynamic campaign, the single-player component on the Xbox 360 version is pretty good. The two campaigns take you throughout the northern parts of Middle-earth as you fight for good or for evil. On the good side there are three factions, ranging from the sturdy dwarves, who are excellent warriors; the slim elves, who are fantastic archers; and the Men of the West, which combines Gondor and Rohan. On the evil side, there are the armies of Mordor, led by Sauron and his Nazgul lieutenants; Isengard, commanded by the wizard Saruman; and the goblins, a faction of goblins, trolls, giants, and spiderlings. It will be your job to take these factions into battle across the whole of Middle-earth. For instance, you can fight as the elves defending the harbor of the Grey Havens from attack in the good campaign, while the evil campaign might have you fighting as the goblins trying to conquer the city. Other battles are unique to each campaign, and you may have to retake the haunted Mirkwood, or sweep the Shire clean of those pesky hobbits (massacring hobbits never felt so good, either). Command armies of orcs, goblins, elves, dwarves, and more for control of Middle-earth. The campaign battles are nicely structured for newcomers to the real-time strategy genre, though veteran gamers will find that they're not too tough. The artificial intelligence is fairly predictable, and it's content to send wave after wave of units at you in a regular pattern, so this means you have time to build up your economy and armies and research all the various upgrades on the tech tree. These upgrades are particularly important in the game, since the difference between a newly recruited battalion of soldiers and one that's been given upgrades, such as banner carriers, armor, and enchanted weapons, is huge. There is a mix of conventional units that you can recruit, and they have a sort of rock-paper-scissors relationship to one another. Swordsmen are good against other swordsmen, but archers can pick the swordsmen apart. Archers are vulnerable to cavalry, but cavalry can be blunted by pikemen. The key to winning is recognizing what the enemy is using against you and building the counter to that. While you're building up your army, you can also recruit hero units, which are notable characters from the books and movies, such as Gimli the dwarf. These are super-units, each capable of dishing out and taking large amounts of damage, while also having special powers and abilities themselves. Then there are your special powers. As you gain experience through the game, you collect points that can be used to purchase a variety of powers that you can use repeatedly, though there is a recharge time associated with each one. The most basic powers can heal your units, or turn the landscape into an elven wood, which boosts the forces of good while weakening the forces of evil. The more-advanced powers can turn the tide of a stalemate, as you can summon earthquakes or a balrog, the fiery demon seen in The Fellowship of the Ring. Whenever your army and heroes are ready, simply select them and send them off in the direction of the enemy. You can micromanage control of each battalion if you want, or you can simply sit back and let them do their work with the occasional adjustment on your behalf. This is a process that you may have to repeat several times in each battle (and in some of the more drawn-out battles, a lot of times). When you win, it's off to the next battle in the campaign, and by the time you're done, you'll have the hang of everything and you'll be ready for a tougher challenge: multilpayer. The two campaigns, along with the skirmish mode, provide plenty of single-player gameplay. Where the Xbox 360 version improves on the PC version is in multiplayer, as there are five modes to play. There's the traditional skirmish mode, of course, which pits players in a free-for-all battle of survival. These games can end early, with a quick rush by one side to crush the other, or they can turn into siege slugfests as players attack and counterattack with huge armies. The capture-the-flag, capture-and-hold, and resource race modes are best if you want a fast game that doesn't drag on too long. The idea in these modes is that there's a victory condition that requires players to take risks quickly and early, so there's no real chance to turtle up and create elaborate bases and defenses. Finally, there's hero mode, which does away with the armies altogether and leaves you with just the hero units battling against one another. The multiplayer modes are engaging and cater to different play styles, so if you're looking for a quick game that's finished in 15 minutes or an epic game that can take upward of an hour, you'll be able to find one in multiplayer. And considering that The Battle for Middle-earth II is the only real-time strategy game on the Xbox 360, there's the potential for it to become a very popular game on Xbox Live. The big question, of course, is how the control scheme holds up. For years, the criticism of real-time strategy games on consoles has been that they're much easier to play with a PC's keyboard and mouse. Well, conventional thinking can be thrown out the window, because The Battle for Middle-earth II is pretty easy to play with the Xbox 360's gamepad. When you get down to it, all you need to use to play the game are the two thumbsticks, the two triggers, and the A button. The thumbsticks control the cursor and the camera, and you can swing the view around or zoom in and out (though, like with many real-time strategy games, you can never zoom out far enough to get a really big view of the battlefield). The A button lets you select a unit, and if you move the context-sensitive cursor over an enemy, it changes to an attack symbol, so all you need to do is hit A again to issue an attack. Holding down the left trigger while hitting A selects all military units onscreen, which makes it quickly give orders to your army. Meanwhile, the right trigger calls up the order menu. If you want to construct a unit, just select a building, hold down the right trigger, call up the build menu, and then select what you want to build. While the other buttons on the gamepad have their uses and functions, you can get through the entire game knowing just those basic controls. It's that easy. Multiplayer will let you pit your strategic skills against other players on Xbox Live in five different game modes. On a high-definition screen, the visuals are pretty much identical to the PC version, which was a good-looking game. In fact, the graphics actually benefit a bit from a cleaner look, since much of the interface clutter required for the PC version has been removed. The environments are certainly pretty, and you'll explore the lushness of the Shire, the frozen wastes of the Misty Mountains, and the gloomy depths of the Mirkwood. Each faction has a unique look and feel to it, and you really can appreciate the detail in some of the bigger units, such as the mountain giants or the Ents. The downside is that frame rate issues that cropped up in the PC version are here as well, so things slow down quite a bit during large battles. Meanwhile, the game is playable on a standard-definition television, though the visuals turn into a muddled mess. The tiny units on the screen are hard to distinguish from one another, and everything blends together unless you zoom in tight to the screen. The audio is still top-notch, though. Actor Hugo Weaving lends his voice to Elrond in the game, though you'll also hear Ian McKellen, Christopher Lee, and other familiar voices that were featured in the original Battle for Middle-earth, as well. And the music is appropriately epic, obviously inspired by the Academy Award-winning movie scores. Put it all together and The Battle for Middle-earth II is a game that offers a lot for the strategy-inclined Xbox 360 gamer. There's a considerable amount of replayability thanks to the single-player campaign, skirmish, and multiplayer modes, a fact that is further aided by the points system. The game has a fair amount of points and achievements that you can unlock (though for some strange reason you can only earn 705 points overall), so you may find yourself playing missions over again so you can get the achievement. While the single-player game will appeal to fans of The Lord of the Rings, competitive players will undoubtedly be drawn to the cutthroat multiplayer mode, especially since there's nothing quite like it on the Xbox 360. And, yes, the big surprise is that here's a real-time strategy game that works on a console, and the world didn't come to an end. Whenever your army and heroes are ready, simply select them and send them off in the direction of the enemy. You can micromanage control of each battalion if you want, or you can simply sit back and let them do their work with the occasional adjustment on your behalf. This is a process that you may have to repeat several times in each battle (and in some of the more drawn-out battles, a lot of times). When you win, it's off to the next battle in the campaign, and by the time you're done, you'll have the hang of everything and you'll be ready for a tougher challenge: multilpayer. The two campaigns, along with the skirmish mode, provide plenty of single-player gameplay. Where the Xbox 360 version improves on the PC version is in multiplayer, as there are five modes to play. There's the traditional skirmish mode, of course, which pits players in a free-for-all battle of survival. These games can end early, with a quick rush by one side to crush the other, or they can turn into siege slugfests as players attack and counterattack with huge armies. The capture-the-flag, capture-and-hold, and resource race modes are best if you want a fast game that doesn't drag on too long. The idea in these modes is that there's a victory condition that requires players to take risks quickly and early, so there's no real chance to turtle up and create elaborate bases and defenses. Finally, there's hero mode, which does away with the armies altogether and leaves you with just the hero units battling against one another. The multiplayer modes are engaging and cater to different play styles, so if you're looking for a quick game that's finished in 15 minutes or an epic game that can take upward of an hour, you'll be able to find one in multiplayer. And considering that The Battle for Middle-earth II is the only real-time strategy game on the Xbox 360, there's the potential for it to become a very popular game on Xbox Live. The big question, of course, is how the control scheme holds up. For years, the criticism of real-time strategy games on consoles has been that they're much easier to play with a PC's keyboard and mouse. Well, conventional thinking can be thrown out the window, because The Battle for Middle-earth II is pretty easy to play with the Xbox 360's gamepad. When you get down to it, all you need to use to play the game are the two thumbsticks, the two triggers, and the A button. The thumbsticks control the cursor and the camera, and you can swing the view around or zoom in and out (though, like with many real-time strategy games, you can never zoom out far enough to get a really big view of the battlefield). The A button lets you select a unit, and if you move the context-sensitive cursor over an enemy, it changes to an attack symbol, so all you need to do is hit A again to issue an attack. Holding down the left trigger while hitting A selects all military units onscreen, which makes it quickly give orders to your army. Meanwhile, the right trigger calls up the order menu. If you want to construct a unit, just select a building, hold down the right trigger, call up the build menu, and then select what you want to build. While the other buttons on the gamepad have their uses and functions, you can get through the entire game knowing just those basic controls. It's that easy. Multiplayer will let you pit your strategic skills against other players on Xbox Live in five different game modes. On a high-definition screen, the visuals are pretty much identical to the PC version, which was a good-looking game. In fact, the graphics actually benefit a bit from a cleaner look, since much of the interface clutter required for the PC version has been removed. The environments are certainly pretty, and you'll explore the lushness of the Shire, the frozen wastes of the Misty Mountains, and the gloomy depths of the Mirkwood. Each faction has a unique look and feel to it, and you really can appreciate the detail in some of the bigger units, such as the mountain giants or the Ents. The downside is that frame rate issues that cropped up in the PC version are here as well, so things slow down quite a bit during large battles. Meanwhile, the game is playable on a standard-definition television, though the visuals turn into a muddled mess. The tiny units on the screen are hard to distinguish from one another, and everything blends together unless you zoom in tight to the screen. The audio is still top-notch, though. Actor Hugo Weaving lends his voice to Elrond in the game, though you'll also hear Ian McKellen, Christopher Lee, and other familiar voices that were featured in the original Battle for Middle-earth, as well. And the music is appropriately epic, obviously inspired by the Academy Award-winning movie scores. Put it all together and The Battle for Middle-earth II is a game that offers a lot for the strategy-inclined Xbox 360 gamer. There's a considerable amount of replayability thanks to the single-player campaign, skirmish, and multiplayer modes, a fact that is further aided by the points system. The game has a fair amount of points and achievements that you can unlock (though for some strange reason you can only earn 705 points overall), so you may find yourself playing missions over again so you can get the achievement. While the single-player game will appeal to fans of The Lord of the Rings, competitive players will undoubtedly be drawn to the cutthroat multiplayer mode, especially since there's nothing quite like it on the Xbox 360. And, yes, the big surprise is that here's a real-time strategy game that works on a console, and the world didn't come to an end."}