{"ref": "https://www.gamespot.com/reviews/sonic-the-hedgehog-arcade/1900-6175328/", "date": "July 18, 2007", "game_name": "Sonic the Hedgehog", "text": "As Sega's response to the ubiquity of Mario, Sonic was a success specifically because of how unlike your usual Super Mario Bros. experience it was. It was still a run-to-the-right platformer set in a colorful and detail-rich fantasy world, but the focus on speed over intricate platform-jumping and hordes of enemies gave it a flavor all its own, one that Sega has been mining with varying degrees of success for the past 16 years. Sega has rereleased the original Sonic the Hedgehog many times over, with last year's appearance on the Wii Virtual Console being its most recent. And now it's arrived on Xbox Live Arcade. The first in a seemingly endless series of confrontations between Sonic and the bulbous Dr. Robotnik. If it's been a while since you've played the original Sonic the Hedgehog, you may be surprised to find that it's not quite as speedy as you remember. It's much faster than your average platformer, but it feels like more of a traditional platformer than more modern 2D Sonic games, such as Sonic Rush for the DS, a game so fast that you can hardly blink. For as much speeding through loops and across a variety of lush, checkerboard environments as you'll do, there are also plenty of bottomless pits, spike traps, and antagonistic robots to worry about. Knowing when to hit the brakes is key, as the game has a habit of throwing a ring-stealing obstacle in your path right when you feel like you're hitting your stride. Levels are peppered with multiple paths, which can lead to some really enjoyable improvisation, but as the game gets tougher, you'll end up relying on more route memorization. There are six stages to the game, each consisting of three acts, and each act can run anywhere from 30 seconds to a couple of minutes. Basic math tells you that you should be able to burn through the whole game in an hour or two, but the sheer difficulty of the later stages, along with the game's sparing attitude toward extra lives and continues, means you'll likely have to start from scratch several times over before you finally make it to the end. After that, there are Xbox achievements for beating specific acts within a certain amount of time, collecting all of the chaos emeralds, and beating the game under different conditions to keep you coming back. Aside from the achievements, the other big bonus that this version brings to the original Sonic the Hedgehog is an enhanced visual mode that smoothes out the rough, pixelated edges, giving the game an odd, watercolor feel. The upside is that it generally makes the game look better on an HDTV setup; the downside is that it diminishes the sense of depth afforded by some of the parallax scrolling backgrounds. While Sega has, over the years, refined the Sonic formula into a supersonic rollercoaster ride, this is still a fine piece of platforming, something that is in curiously short supply on XBLA. For 400 points, or $5 American, it's a pretty good deal for what still stands as a seminal platforming experience."}