{"ref": "https://www.gamespot.com/reviews/the-lord-of-the-rings-the-battle-for-middle-earth-/1900-6145313/", "date": "March 2, 2006", "game_name": "The Lord of the Rings: The Battle for Middle-Earth II", "text": "With the Lord of the Rings movie trilogy more than two years in the past now, it seems a bit weird that EA is still pushing ahead with its Lord of the Rings game franchise. After all, 2004's The Lord of the Rings, The Battle for Middle-earth already covered all the ground from the movies. EA's solution, though, was to unify the movie franchise with the general Tolkien license, so now the games can feature content from both the movies and the many Middle-earth books that J.R.R. Tolkien wrote. Armed with this unified license, EA has gone about and created The Lord of the Rings, The Battle for Middle-earth II, a real-time strategy game that features all of Middle-earth, and not just the stuff we saw in the movies. Battle for Middle-earth II features new battles in both the north and south of Middle-earth. The original game focused just on the latter. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: The Lord of the Rings, The Battle for Middle-earth II Video Review Battle for Middle-earth II focuses mainly on the northern part of Middle-earth, where elves, dwarves, and goblins battled it out while those pesky hobbits trekked to Mt. Doom. That means there are new races and factions that we didn't get to see in the original game, complete with their own heroes and specialized units. The elves are supreme archers, the dwarves are miners who build giant war machines, and the goblins rely on spiders and sheer numbers to swamp you. Battles take place in familiar places, such as the Shire, and in unfamiliar places, unless you've read the books, such as Dol Guldur. And if you liked the factions and settings from the original game, don't worry, because they all appear in the game's overarching War of the Ring mode in one form or another. The two single-player campaigns in Battle for Middle-earth II, one for good and the other for evil, are easily the weakest part of the game, in that they consist of the same, cookie-cutter real-time strategy missions that you've probably played countless times already. There's little here that hints at originality, a situation made worse by the decision to remove some of the more unique ideas from the original game, such as building nodes. In the first Battle for Middle-earth, you could construct buildings on only a few predetermined points of the map, which eliminated the base sprawl problem seen in most real-time strategy games. It also forced you to spread out in order to seize the remote building nodes, which meant that your forces were usually stretched thin trying to defend remote outposts. While Battle for Middle-earth II does try to force you to spread out by the way farms and mines work (you can't concentrate resource centers because it limits their cumulative effectiveness), you usually needn't worry, because all you really need to do is build up a huge core base and defend it. So basically, much of the strategy in these missions involves ~turtling up~ in a defensive shell until you manage to research all the unit upgrades, and then sending out a massive force to sweep the enemy off the map. While the single-player game is fairly generic, it is at least saved by some of the rich Tolkien mythology. Once again, you command armies in the form of companies and hero units. Soldiers, archers, and cavalry come in company formations of about 20 to 30 units in size, and they form the bulk of your army. Your hero units include notable characters from the books and movies, such as Aragorn and the Witch King, and they're far more powerful than regular units, with special abilities that they can bring into play. They're also far more expensive to purchase. Meanwhile, once again, you can draw upon special army powers that you purchase by accumulating certain points. These powers can range from summoning a fiery balrog to instantly turning a portion of the battlefield into a lush forest, which confers bonuses to any good units in its midst. Also, it's worth noting that the artificial intelligence is better than it was in the original game, as it's usually pretty good about hitting you where you're vulnerable, which means that the computer can send units around you from the sides. The good news is that things get really interesting once you play with the new War of the Ring mode. Essentially, War of the Ring links all the real-time battles to an overarching strategic campaign, but one that's deeper than the superficial strategic mode in the original Battle for Middle-earth. There are a number of different War of the Ring scenarios to choose from, but the basic goal is that you will try to lead your side to victory by conquering all of Middle-earth, province by province. You can re-create the entire epic scale of the war, with the elves, dwarves, and men battling the goblins, Mordor, and Isengard--you control one of the factions, while the computer controls the others. Or you can set it up so perhaps the dwarves and elves battle each other, or any combination. The War of the Ring mode lets you try to battle for all of Middle-earth, your way. The strategic mode in War of the Ring looks and feels very much like a board game, such as Risk. This isn't a complex or incredibly detailed strategy game, and EA keeps the overall management rather light. Your main job is to manage territories and move armies around the map. And since there are only two building nodes per territory (and only four building choices), you have to make some basic decisions about each territory's role. You might want your rear territories to house all the farms, which lets you recruit larger armies, while your front-line territories contain barracks to pump out units and fortresses to provide defense. Each territory confers certain bonuses to take into consideration as well, so that may go into your decision making. In addition, if you conquer whole regions, you'll gain even more bonuses. When two opposing armies meet, you can choose either to have the computer automatically generate the battle results or to play the battle yourself in real time. If you do play the battle yourself, you'll drop down to the province map and have to play it out just like you would a regular skirmish game, though any units or strategic buildings that were in the province at the beginning of the battle will show up on the battlefield. Needless to say, to win, just wipe out the opposing force. War of the Ring does suffer from some issues, though. For one thing, the world's not as persistent as it should be. You can develop a huge base in a territory during one battle, but if the enemy reinvades that territory, most of your structures will disappear and you have to start from scratch again. And while it's understandable that this is so (a contest between a fully developed real-time economy and a nonexistent one isn't really a contest), it's a bit frustrating, not to mention illogical, to have to rebuild everything all over again. The same goes for armies on the battlefield. Only the units that you build on the strategic map are persistent, which means that the huge armies you may build during a battle disappear once the battle is done. And while those strategic units gain experience, it still doesn't make much sense to see fully developed armies suddenly vanish in the middle of war. It's these kinds of issues that prevent War of the Ring mode from being the ultimate Lord of the Rings strategy experience that many of us have been waiting for, but it still makes for a good lightweight strategy game. You can still summon superunits, such as the balrog, and these can turn the tide in a battle. EA has made some changes to the battlefield gameplay mechanics, though not much has changed. Naval warfare is a pretty addition, thanks to the shimmering reflections of ships on the beautifully rendered water. However, ships are featured only a handful of times in the campaign, and they don't come in most of the time during the War of the Ring mode, since most territories are landlocked. Meanwhile, the new emphasis on being able to build defenses such as walls seems a bit misplaced, since walls can be incredibly easy to knock down and defensive towers are something of a joke, making their value suspect. Other new features in Battle for Middle-earth II aren't fully fleshed out. For instance, the new build-a-hero function is pretty lightweight. Basically, you can create your own hero or heroine, and he or she appears as a hero unit in the game. However, the actual build-a-hero function is quite limited, since you can't alter your character's appearance aside from selecting between a few armor types, weapons, and colors--you're stuck with the physical features that EA gives you. Normally, this wouldn't be a big thing, but since practically every other EA game features a much more powerful build-a-character mode, Battle for Middle-earth II's build-a-hero mode comes off as disappointing. The game's multiplayer suite is also one of its strengths, though be prepared for some brutal and wild matches online. You can play in the customary skirmish game in one-on-one matches or in teams. The new resource model becomes the huge linchpin in multiplayer skirmish, since you have to spread as many resource-gathering centers as possible over the map. This means that the winner is usually the side that can quickly eliminate a handful of the opposing side's resource structures, which is an incredibly easy task. After that, it becomes a huge battle of attrition, as one side has a resource advantage to bring to bear. Heroes and other powerful abilities also come into play quite a bit more during multiplayer, since human players are much smarter about using them than the AI. Hero units like Gandalf are worth their weight in gold, as they can quickly wipe out swaths of an opposing army. Meanwhile, the War of the Ring mode is also playable in multiplayer, though as you'd expect, these games take a long time to play through (we're talking days, not hours). Thankfully, you can save a game's progress and pick it up at a later time. EA has also done some good work in terms of making games easy to find online--the server browser is nicely organized, and the game persistently tracks performance so you can easily gauge your chances against a potential opponent by examining his or her experience level. Visually, Battle for Middle-earth II packs a few graphical improvements over the original. For instance, there seem to be a few more shader effects at work, so surfaces such as ice have a nice sheen to them. There's also some improved lighting and shadowing at work. But in general, the graphics haven't evolved much from the first game. That's not a bad thing, though, as the original game still captured the look and feel of Middle-earth quite well. Though the battles are nowhere near as large as those seen in the movies (or in the game's own cutscenes, for that matter), you still get a sense of the clash of arms as companies of human soldiers clash with hordes of goblins and orcs. And, once again, the biggest units in the game are some of the best looking--you can send impressively rendered dragons and fellbeasts into battle or watch the noble eagles swoop down from the sky and rip apart an enemy building with their talons. It's interesting to note that the in-game cutscenes taken directly from The Lord of the Rings have disappeared in the sequel, probably because the developers would have had to recycle the same cutscenes over again given that there has been no new movie footage since the first game. The build-a-hero mode isn't as powerful as it should be, but at least you can still create your own avatar in the game. The sound effects also remain strong, and Howard Shore's memorable music from the movies echoes throughout the game. Meanwhile, some of the voice work from the original carries over to the sequel, and die-hard Lord of the Rings fans may feel a chill down their spines whenever they hear Ian McKellen's Gandalf or Christopher Lee's Saruman declare victory after a battle. And EA managed to find decent substitutes for the other big-name roles. The Battle for Middle-earth II is certainly a better version of 2004's great strategy game. With that said, for all the things it does new or differently than before, some aspects feel a bit undercooked. Still, this is probably the best Lord of the Rings RTS available, and by encompassing the whole of Tolkien's mythology, it really lets you battle for all of Middle-earth this time around. War of the Ring does suffer from some issues, though. For one thing, the world's not as persistent as it should be. You can develop a huge base in a territory during one battle, but if the enemy reinvades that territory, most of your structures will disappear and you have to start from scratch again. And while it's understandable that this is so (a contest between a fully developed real-time economy and a nonexistent one isn't really a contest), it's a bit frustrating, not to mention illogical, to have to rebuild everything all over again. The same goes for armies on the battlefield. Only the units that you build on the strategic map are persistent, which means that the huge armies you may build during a battle disappear once the battle is done. And while those strategic units gain experience, it still doesn't make much sense to see fully developed armies suddenly vanish in the middle of war. It's these kinds of issues that prevent War of the Ring mode from being the ultimate Lord of the Rings strategy experience that many of us have been waiting for, but it still makes for a good lightweight strategy game. You can still summon superunits, such as the balrog, and these can turn the tide in a battle. EA has made some changes to the battlefield gameplay mechanics, though not much has changed. Naval warfare is a pretty addition, thanks to the shimmering reflections of ships on the beautifully rendered water. However, ships are featured only a handful of times in the campaign, and they don't come in most of the time during the War of the Ring mode, since most territories are landlocked. Meanwhile, the new emphasis on being able to build defenses such as walls seems a bit misplaced, since walls can be incredibly easy to knock down and defensive towers are something of a joke, making their value suspect. Other new features in Battle for Middle-earth II aren't fully fleshed out. For instance, the new build-a-hero function is pretty lightweight. Basically, you can create your own hero or heroine, and he or she appears as a hero unit in the game. However, the actual build-a-hero function is quite limited, since you can't alter your character's appearance aside from selecting between a few armor types, weapons, and colors--you're stuck with the physical features that EA gives you. Normally, this wouldn't be a big thing, but since practically every other EA game features a much more powerful build-a-character mode, Battle for Middle-earth II's build-a-hero mode comes off as disappointing. The game's multiplayer suite is also one of its strengths, though be prepared for some brutal and wild matches online. You can play in the customary skirmish game in one-on-one matches or in teams. The new resource model becomes the huge linchpin in multiplayer skirmish, since you have to spread as many resource-gathering centers as possible over the map. This means that the winner is usually the side that can quickly eliminate a handful of the opposing side's resource structures, which is an incredibly easy task. After that, it becomes a huge battle of attrition, as one side has a resource advantage to bring to bear. Heroes and other powerful abilities also come into play quite a bit more during multiplayer, since human players are much smarter about using them than the AI. Hero units like Gandalf are worth their weight in gold, as they can quickly wipe out swaths of an opposing army. Meanwhile, the War of the Ring mode is also playable in multiplayer, though as you'd expect, these games take a long time to play through (we're talking days, not hours). Thankfully, you can save a game's progress and pick it up at a later time. EA has also done some good work in terms of making games easy to find online--the server browser is nicely organized, and the game persistently tracks performance so you can easily gauge your chances against a potential opponent by examining his or her experience level. Visually, Battle for Middle-earth II packs a few graphical improvements over the original. For instance, there seem to be a few more shader effects at work, so surfaces such as ice have a nice sheen to them. There's also some improved lighting and shadowing at work. But in general, the graphics haven't evolved much from the first game. That's not a bad thing, though, as the original game still captured the look and feel of Middle-earth quite well. Though the battles are nowhere near as large as those seen in the movies (or in the game's own cutscenes, for that matter), you still get a sense of the clash of arms as companies of human soldiers clash with hordes of goblins and orcs. And, once again, the biggest units in the game are some of the best looking--you can send impressively rendered dragons and fellbeasts into battle or watch the noble eagles swoop down from the sky and rip apart an enemy building with their talons. It's interesting to note that the in-game cutscenes taken directly from The Lord of the Rings have disappeared in the sequel, probably because the developers would have had to recycle the same cutscenes over again given that there has been no new movie footage since the first game. The build-a-hero mode isn't as powerful as it should be, but at least you can still create your own avatar in the game. The sound effects also remain strong, and Howard Shore's memorable music from the movies echoes throughout the game. Meanwhile, some of the voice work from the original carries over to the sequel, and die-hard Lord of the Rings fans may feel a chill down their spines whenever they hear Ian McKellen's Gandalf or Christopher Lee's Saruman declare victory after a battle. And EA managed to find decent substitutes for the other big-name roles. The Battle for Middle-earth II is certainly a better version of 2004's great strategy game. With that said, for all the things it does new or differently than before, some aspects feel a bit undercooked. Still, this is probably the best Lord of the Rings RTS available, and by encompassing the whole of Tolkien's mythology, it really lets you battle for all of Middle-earth this time around."}