{"ref": "https://www.gamespot.com/reviews/james-bond-quantum-of-solace-review/1900-6200423/", "date": "November 5, 2008", "game_name": "007: Quantum of Solace", "text": "James Bond has had something of a chequered past in video games, but Quantum of Solace brings him back with a certain amount of style. While the game based on the latest 007 movie is primarily a first-person shooter, the single-player mode incorporates stealth-action gameplay and a number of third-person sequences. The solo play is fun while it lasts, but it ends abruptly after only four or five hours. Fortunately the wealth of included multiplayer modes ensures that this remains an enjoyable Bond experience. The majority of the gameplay feels conventional for a first-person shooter, though the optional stealth elements and the third-person cover mechanic definitely make things more interesting. When in cover, the camera zooms out and affords you a third-person view of the situation that makes popping out for headshots a relatively undemanding endeavour. This view also helps the game in more subtle ways; the satisfaction of controlling a character who is instantly recognisable as Bond as you pop out from cover and silently put a bullet in the back of a henchman's head cannot be overstated. Just another day in the office. When attempting to move around unnoticed, your silenced pistol serves you well--as long as you manage one-hit kills. Get careless, and you'll find yourself under heavy fire and diving for cover as enemies are alerted to your presence and their reinforcements pile in. With that said, on lower difficulty settings it's certainly possible to make it through many levels with guns blazing. But it's just as much fun and ultimately more rewarding to play by moving carefully, sneakily taking your enemies down, disabling security cameras, and quietly hacking locked doors. Occasionally, taking a somewhat stealthy approach is mandatory. This would be fine, except that some of the set-pieces feel a little ham-fisted. A couple of segments that leave you pinned down by multiple waves of enemies feel out of place, and the novelty of edging along a window ledge keeping an eye on windows to avoid guards inside wears off by the third time you find yourself doing it. The environments are, on the whole, well designed. The variation presented by wreaking merry havoc in a large museum in Miami, gunning down bad guys on the roof of a moving train, and chasing double agents across rooftops in a world heritage site is one of the game's strengths; it makes the chapters more fun individually and really helps to make the game feel like a James Bond movie. That feeling is further enhanced by cutscenes that feature key members of the cast of both Casino Royale and Quantum of Solace, including Daniel Craig, Dame Judi Dench, and Eva Green. The stars' voice talents are also put to good use in the MI6 briefings that flash across the screen between missions, and all of these things add up to a very satisfactory Bond experience. One thing that doesn't sit well is the amount of product placement in many of the levels, from indestructible Sony Vaio laptops to SonyEriccson Cybershot phones that are loaded with clues. The presence of such things really jars with the rest of the world, given that nothing else is branded at all. In the words of Sherrif Pepper: ~You're that secret agent! That English secret agent! From England!~ The thing that really brings Quantum of Solace down, though, is the lack of a coherent story. This is largely because in addition to the titular movie it features content from 2006's Casino Royale. The action from the earlier film is presented as an extended flashback sequence that kicks in after an hour or so of gameplay, and it feels out of place in the context of the main story. It goes on for so long that by the time you are thrust back into the story proper, you will almost certainly have forgotten why you're standing on a rocky outcrop in the middle of a jungle next to a downed helicopter. The story takes only four to five hours to play through, and ends very abruptly. There's some replay value, though only if you're into unlocking achievements, finding hidden items, or checking out different difficulty settings. Thankfully, the multiplayer suffers from none of the issues that put a damper on the single-player experience, and the wealth of modes makes for manic fun across all of the game's varied environments. The linear chase through the Siena rooftops provides the basis for a great multiplayer environment spread over a seemingly wider area, for example, while the courtyards of Venice provide some intense close-quarters action. Most of the multiplayer modes pit nameless MI6 operatives against mercenaries from a shadowy group known simply as The Organisation. The Man With the Golden Gun mode is worth singling out from the standard selection of deathmatch and territory control modes, however, as it lends itself well to manic encounters. All players are fighting for control of a gold Magnum that fires explosive one-hit-kill rounds, and kills with it count for much more than those using other weapons. The nature of the challenge means that nervous and fragile alliances will be formed on the fly among players going for the gun, with all parties waiting for just the right moment to annihilate those around them. Other interesting multiplayer modes include those in which you get to play as Bond. Bond Evasion is a team-based escort-style game in which MI6 players are charged with making sure that the Bond player makes it to an exit point alive. Bond Versus, on the other hand, pits The Bond player against everyone else in the game in a fight to the death. Bond has access to more impressive gadgets than his Organisation enemies, he can see them on his minimap, and he has two lives. Bond can only live twice, Organisation players can only live once. Both of these modes are fun for a while, and they provide an interesting counterpoint to the more traditional offerings. Third nipple optional. To give the multiplayer even more longevity, credits are awarded from each successful round based on your contribution. These can then be spent on new weapons, new gadgets--such as scopes, extra ammo capacity, or armour--and even rather excessive golden weapons. These are a nice touch for those who want to make it very clear how little taste they have or to flaunt their experience over less-seasoned competitors. The standard loadout is good enough, however, to not put new players at any great disadvantage, and it's also possible to earn credits in the modes that don't let you customise your starting weapon or equipment set. It's unfortunate that Quantum of Solace's single-player mode is so short-lived, but there's enough good multiplayer content here to keep you playing long after you've saved the world."}