{"ref": "https://www.gamespot.com/reviews/gothic-review/1900-2833594/", "date": "December 18, 2001", "game_name": "Gothic", "text": "Piranha Bytes' Gothic is an unconventional game that takes place in an unconventional setting: a magically sealed prison in a stark, grim fantasy realm. Even though the developer calls it a role-playing game, Gothic is a hybrid game that features RPG, adventure, and action elements. Gothic does have standard role-playing elements, such as experience levels and character development, but it also places heavy emphasis on dialogue and inventory puzzles and has some real-time action sequences. And though it has an unusual and open-ended story, lots of spoken dialogue, and a substantial amount of gameplay, it also has frustrating action sequences and some noticeable technical problems. The most interesting things about Gothic are its offbeat story and the way that you can interact with it. You play as a single character, an anonymous, soft-spoken convict who's been thrown into the game's world, which is both a prison and an ore mine. Though you'll start the game as a lowly peon with no skills or abilities, you'll eventually become an accomplished adventurer who will join one of the colony's three main camps, but not before you get into a tussle with some rowdies or with some of the colony's indigenous monsters. Both of these can and will squash you flat, at least at the beginning of the game. To Gothic's credit, these vicious enemies make the game's world seem as hostile and as unforgiving as you might expect a prison colony to be. However, once you start exploring and meet a few of the game's characters, you'll find most of them to be very talkative, even chatty, as they explain how to interact with the game's world, as well as give your character simple quests to perform. Most of Gothic consists of running back and forth to collect and deliver items for these quests, though at several points in the game, you'll also have to fight against enemies. Unfortunately, Gothic's fighting system just doesn't work well. It's fairly simple; you ready a melee weapon, a bow, or a magic spell, target your enemy, and attack and defend by pressing the ~use~ key together with movement keys. Most single enemies simply come straight at you, and though they'll occasionally dodge to the side, you can usually wait them out by defending until they attack and then attacking yourself. However, Gothic usually throws groups of at least two to three enemies at you (presumably to reinforce the fact that you're in a harsh, hostile world). Multiple enemies can and will surround you, attack you from the rear, and cut you down before you even have time to angrily curse Gothic's largely unresponsive control scheme. Moving and fighting both require you to use your movement keys, so actively trying to dodge while fighting and defending is basically impossible. And using ranged weapons like bows can be even more frustrating, since attacking enemies from a distance invariably causes them to come charging straight at you--and they'll usually knock you out before you can even reach for your melee weapon. That's not to say that Gothic's control scheme is flat-out awful, but it does have problems--and so does the game's interface. For whatever reason, Gothic uses a fixed third-person, behind-your-character's-back view--a view that usually gets blocked as you explore the game's winding mountain passes and narrow caverns. Most recent third-person action-adventure games either feature an alternate first-person view or make your character transparent when it's pressed against a wall or corner; Gothic does neither. What's more, though Gothic lets you use your mouse to turn your character, the game doesn't actually have a cursor. This is puzzling, considering that the only way to interact with your surroundings is to target them by turning and facing them to highlight them; being able to use a mouse cursor to point at and click on whatever you want to interact with would have made the game easier to play. Also, Gothic has several characters that'll actually physically guide you through the world if you ask them. These characters display remarkably good pathfinding, but after trudging around after a few of these characters, you'll wonder why the developers didn't simply implement an in-game map, which would have made navigating the game's huge outdoor areas much easier. Even though Gothic does have plenty of things going for it, most of its elements have noticeable problems. For instance, consider the game's graphics: Gothic features some impressive lighting effects, most notably in the pulsating magical seal over the prison where the game takes place. The game also features day-and-night cycles, and the lighting effects are at their best at night around the different prison camps, where moonlight and torches cast realistic glows and shadows. Unfortunately, Gothic's architecture and scenery are generally rather plain, and its character models are very blocky and are textured crudely. Even so, the game itself has surprisingly high system requirements and will prove extremely taxing to most computers. We tested Gothic on a PIII 900MHz with 256MB RAM and a 32MB card, as well as on a PIII 450MHz with 128MB RAM and a 16MB 3D card. Even on the former system, which is well above the game's recommended specs, we still encountered some frame rate problems, and it ran so slowly on the latter machine that it was barely playable. And on both machines, Gothic had surprisingly long loading times. Gothic's sound is also a bit uneven. The game's music consists of appropriate, if generic, symphonic tracks that are so subdued that you'll often forget they're even there. Gothic also features decent ambient sound effects that are especially good in outdoor areas, such as the forest and swamp areas. In addition, the game has an enormous amount of recorded speech for both your character and those he meets in his travels. In fact, many of the characters you meet will tend to drone on and on about whatever task you'll need to perform next, and it's clear that only a few actors provided the voices of the game's many characters. However, most of the dialogue is delivered quite well. If you can actually get past all of the game's problems and can also appreciate its strengths, you may well enjoy Gothic. Its action sequences are weak, and its role-playing elements are straightforward--you gain experience points either by performing quests or fighting enemies and eventually gain levels that yield skill points. You can use these skill points to develop your fighting or magic abilities or to improve a few miscellaneous skills, though these are generally less important than fighting or casting spells. However, Gothic's adventure elements are actually quite strong. Furthermore, the game itself is quite lengthy, and to complete its many quests, you'll need to speak to many different characters. In several cases, you'll actually have a choice as to how you want to complete a quest or whether you want to complete it at all. Apart from its main quests, many of which are open ended, Gothic has several optional side quests. And for the most part, none of the game's quests have any time constraints, so you can often try out a certain approach, fight any monsters in the area, rest until you recover from your wounds, and try again. Should you play Gothic? Not if you want a deep character-development RPG or an action-packed hack-and-slash game, or if you'd have trouble dealing with the game's various problems. And not if you don't have a good computer that's substantially better than the game's minimum requirements. However, if none of these conditions really bother you and if you'd be interested in playing a game that places more emphasis on character interaction and quests than on fighting monsters, you should give Gothic a try."}