{"ref": "https://www.gamespot.com/reviews/bittrip-void-review/1900-6241263/", "date": "November 24, 2009", "game_name": "Bit.Trip Void", "text": "The Bit.Trip series is a celebration of the past that blends 8-bit-inspired visuals and nostalgic chiptune music with simplistic goals to create memorable experiences. As its predecessor did before it, Bit.Trip Void mixes things up by introducing an all-new gameplay system and control scheme while maintaining the audio/video building blocks that make the series so distinct. Though unmistakably true to its roots (so much so that it too lacks online leaderboards), Void presents a very different challenge that is not only fun and addictive but also forgiving and accessible. Series fans will undoubtedly enjoy the twists and turns of this latest entry, but even if you've never experienced the Bit.Trip before, you'll find a rewarding challenge that will keep you on your toes and stick a catchy beat in your head. This time around, you control a pixelated black hole called the void with the analog stick on either a Nunchuk or the Classic Controller. You have complete freedom of movement and must guide the void into the path of incoming black pixels called beats while avoiding their white counterparts. Each black beat consumed increases the size of the void and your combo multiplier at the cost of decreasing your mobility and making you more susceptible to those pesky white beats. At any time, you can exchange your collected beats for points by pressing the A button, thus returning the void back to its original size. It's to your advantage to keep the void as large as possible to maximize your score, but if you make a mistake and collect a white beat, your void shrinks back down and your combo multiplier is lost. This risk-versus-reward mechanic adds an entirely new dimension to scoring in that you can choose when (or even if) you want to go big at the risk of losing it all or to just play it safe by keeping your void small and maneuverable the whole time. No matter how you play it, you can finish the game, but high-score enthusiasts will have a blast trying to figure out how to best rack up their scores. As you progress through each of the three levels by successfully consuming black beats and avoiding white ones, you transition into higher score modes. By colliding with white beats or missing black ones, you run can lowering your score mode until you eventually find yourself in a black-and-white purgatory world. Success here sends you back to the Technicolor world of high scoring, but this is your last chance to prove yourself before it's game over. This intriguing system lets you come back from the jaws of defeat, but even if you don't, each stage now has three checkpoints from which you can continue. Levels last from 12 to 15 minutes, and being able to earn extra lives through high scores is a huge improvement on the formula, especially during your first few attempts when you're trying to learn a level. As with the other Bit.Trip games, you encounter a series of surprising bosses based on classic arcade games that are as fun as they are demanding. To reveal much more about these bosses would spoil them, but each and every one is a memorable experience that stands out even among Bit.Trip Void's peers. Near the end of the game, the white beat patterns you have to dodge get pretty tricky. Though the series is known for its boisterous and psychedelic background visuals, that aesthetic has actually been toned down a bit in Void, which tends to focus less on trying to confuse you with the backgrounds. Levels still consist of constantly evolving synthesized songs in which you play a part--collecting beats, shrinking the void, and changing the scoring modes all contribute to the soundtrack--but this time, performing certain actions can also affect the sorts of visualizations you see. Keeping your eye on one void can be difficult enough given the twists and turns of each stage, but if you like, you can have up to three friends join your game with each taking control of a different black hole. Though you all share the same score, coordinating more than one void through wave after wave of beats brings on an entirely new type of challenge as you soar to ever higher scores. With each step the Bit.Trip series takes, it manages to radically redefine itself while somehow hanging on to the core audio and visual elements that thematically tie it together. Bit.Trip Void's unique void mechanic and risk-versus-reward system puts a refreshing spin on the bullet-hell genre. Though you're still unable to share your high scores with your friends through online leaderboards, Void surpasses its predecessors in terms of fun and addictiveness. If you're looking for an exciting, fair, and accessible challenge on the Wii, you should definitely let yourself get sucked into the Bit.Trip Void."}