{"ref": "https://www.gamespot.com/reviews/inside-my-radio-review/1900-6416132/", "date": "May 11, 2015", "game_name": "Inside My Radio", "text": "I'm a firm believer that all skills, even the ones we often think of as innate--artistic talent, athletic ability, imaginative writing--can be taught. It's just a matter of putting the time and effort into learning to excel (or at least be competent) at something. Rhythm is the exception to that rule. You either have it or you don't. And I do not. The only reason I could play drums in Rock Band was because of the falling note chart in the game. That I was able to enjoy the rhythmic platforming of Inside My Radio despite my total lack of an inner metronome is a testament to its hypnotic power.Seaven Studio's Inside My Radio is a hybrid of Thomas Was Alone's geometric platforming and the beat-dependent movement of 2012's criminally underselling Sound Shapes. On a surface covered with blocks set against old-school backdrops, you explore levels through rhythmic jumping, dashing, and smashing. Beyond basic left/right movement, you can only perform more complex actions in time with the rhythm of the level's music. Featuring rock, electronic, and even reggae tunes, Inside My Radio forces you to become one with the soundtrack's tempos in order to avoid the varied obstacles in the environments themselves.If you're wanting a game that is perfect for a chill evening where you want to relax with music and a video game, Inside My Radio is worth the spin.Much like Sound Shapes, Inside My Radio successfully cultivates a sense of synesthesia in players--the ability to experience music with your senses beyond hearing. It's partially achieved through the core mechanical loop of the game: overcoming environmental obstacles through rhythm. If you can't find the tempo of that level's track, you aren't going to get very far. But once you discover the song's groove, you begin to feel a sense of oneness between the music and your platforming. Well, you do if you have any rhythm. I don't, but even I began to get the groove of Inside My Radio once I took a couple deep breaths and focused on the sound.But it's more than mechanical design that creates the multisensory musical experience. The environments react to the music. The dub level has trees that grow and unfurl in time to the beats. The most devious platforming segments require an understanding of the beat to conquer. The puzzles work around the polyrhythms of the most complex tracks. Every element of Inside My Radio feeds back into the music. Music becomes the mechanics. It becomes the art. And when you learn that this guitar riff means the fatal electric platform is going to disappear before it even happens, the game has accomplished its goal of creating an immersive sonic experience.Inside My Radio has an actual plot as well, though it's fairly nonsensical and mostly serves as an excuse to have the characters you control explore these varied worlds--including what appears to be the literal inside of a radio, a dance club, and the abstraction of a Rasta/electronic fusion. The game also relies on an unnecessary preponderance of pop culture humor/meme references that fall a little flat in its storytelling. The jokes rarely seem to serve a purpose beyond ~Aren't we clever for knowing this bit of cultural ephemera?~And despite the great soundtrack and the trance-inducing interplay between music, game art, and mechanics, the platforming and art are merely good. Your dash mechanic is key to traversing many of the game's obstacles, but it feels loose and imprecise, which is rarely a major issue but becomes frustrating when it does rear its head. The art can become a phantasmagoric, psychedelic delight, but the game also embraces staid, bland cyberpunk electroscapes that feel rote by the end of the game. Boss fights against a cyber-spider crop up at the end of the game, and they are more aggravating than hypnotic. Inside My Radio also suffers from the inclusion of an occasional puzzle where you might not even realize you're trying to solve a puzzle at first, and it interrupts the musical momentum of the game.Inside My Radio never quite reaches the synergetic highs of its most obvious peer, Sound Shapes, but it's still an entrancing experience. Although the main campaign is very short (it takes less than two hours to complete), the Time Attack mode adds legs to the game for those who wish to truly master the game's levels. If you're wanting a game that is perfect for a chill evening where you want to relax with music and a video game, Inside My Radio is worth a spin."}