{"ref": "https://www.gamespot.com/reviews/space-run-galaxy-review/1900-6416466/", "date": "July 6, 2016", "game_name": "Space Run Galaxy", "text": "Long-haul trucking heads to the stars with Space Run Galaxy, a mix of tower-defense strategizing and twitchy arcade action that is surprisingly engrossing. It features a great deal of depth and compelling gameplay that challenges both your brain and your fingers. Broadly speaking, it's a game about running cargo from point A to point B--and sometimes point C or more, since some jobs take you to multiple star systems. You might go to places with names like Station K-2001 and Ceti Station instead of Indianapolis and Boise, and you might haul radioactive barrels and genetic decoders instead of frozen foods and car tires, but the focus here is still all about making deliveries on time with your cargo intact.There are a few key complications, however. Ships in Space Run Galaxy are all built with modular hexes, and you're free to configure them as you wish. Make some cash from your runs and you can add to the basic vessel layout, improving your ship in several ways. You can haul more cargo, outfit your ride with more weapons, add high-tech gadgets like shields and repair units, or install more thrusters for greater speed. All of these add-ons--which are divided into four self-explanatory categories of Offensive, Defensive, Utilities, and Basic--can be purchased from a mechanic when you are planetside for both credits and materials specifically slotted into each of those categories. However, they can only be installed during missions.This adds a sizable tactical layer to the game. As you are always dealing with a limited number of credits and materials, you have to make tough decisions between assignments. Do I go offensive by adding another laser cannon or a missile launcher to my stock? Do I increase the size of my vessel to haul more cargo and install more thrusters for speed? Do I go defensive with another shield or repair unit? The tech tree isnt spectacularly large or complex, but it offers enough choice to keep you intrigued and constantly customizing your ship to meet the demands of the spacelanes.Said demands can be quite grueling, too. Unlike the average trucker on Earth, who faces hazards like tire blow-outs and the lure of wasting too much time in Dennys, every route in Space Run Galaxy is strewn with asteroids, murderous pirates, and potentially hostile aliens. Even though your ship basically runs on a pre-determined path during each run, there is a lot of action here as you build the aforementioned weapons, shields, thrusters, and so forth to address threats.Incoming bad guys, space rocks, and the like are depicted on the main screen along with a meter that shows which way they are coming from and how long you have until the threats are upon you. This makes for some white-knuckle rides, as you need to make sure that your ship is well-equipped to deal with these problems in advance. While you may start a mission with a measured approach--dropping in a laser cannon here and a shield generator there--very soon youre scrambling to meet increasing threats as they slowly slide into range and start wrecking your vessel.There is no pause button, so everything has to be tackled in real time. Hexnuts--the game's form of currency--always seem in short supply, which means you have to be really careful with what hardware you choose to install or else you run the risk of being defenseless when a bunch of enemy drones show up. Speed is also a big concern. Every mission must be completed before a timer expires, and you'll need to combat this by adding thrusters to your ship. Of course, this forces you to engage in a balancing act between prioritizing offense and defense as the limited number of hexnuts makes it very difficult to cover all of those bases and keep up your need for speed.About the only drawbacks here are repetition and occasionally wonky difficulty. Every mission takes you back to the drawing board with a clean ship that needs a fresh install of all weapons and gear. This is unavoidable given the core design of the game, although it still forces you to endure repeat actions with every assignment.Difficulty is more hit-and-miss than a steady progression, due to what seems to be a big disparity between story missions and respawning basic cargo runs. You can do one easy haul after another, then run into a brick wall of an insane job where you get confronted by multiple enemy gunships or aliens that cut you to ribbons. This actually increases the sense of repetition, as you need to grind out a lot of these basic cargo runs to earn the credits and goodies that are needed to upgrade your ship into a killer vessel able to handle such enemies. Missions are speedy, though, so you never feel like the game is dragging. The game has a real just one more turn vibe.Multiplayer is incorporated here to provide the feel of an expanded universe. This is an interesting idea, clearly based on the appeal of setting up a full market system for players where they can interact, sell and buy goods, and even help one another out with delivery runs. That said, multiplayer seems to exist right now mainly as a way to pick up the odd run for extra credits or equipment. And since many missions allow you unlimited respawns, there isn't any real reason to take on these multiplayer offers unless you happen to be going in the right direction and have the room for a little extra cargo.Even though it's repetitive and occasionally frustrating, Space Run Galaxy is a great way to, as Deep Purple puts it, go space truckin round the stars. Tactical depth, a wide range of choices when it comes to customizing your ships, and a liberal dose of frantic action during cargo runs--not to mention a good sense of humor and attractively cartoony visuals--combines to deliver an experience that isn't easy to master, but one that's worth the extra effort."}