{"ref": "https://www.gamespot.com/reviews/gravity-ghost-review/1900-6416014/", "date": "January 28, 2015", "game_name": "Gravity Ghost", "text": "Childhood is terrifying. Childhood is beautiful. Childhood is full of wonder. And childhood is marked by the continual loss of innocence that comes with each new year. Learning that the unexplored experiences which is exciting and enticing could kill you is part of growing up; as is learning that there are consequences to all of our actions no matter how pure our intentions may be. Those are heavy themes for adults to handle, let alone children, but they rest at the core of delightful platformer Gravity Ghost.In Gravity Ghost, you control the ghost of Iona, a recently deceased young girl who lives on a secluded island with her two younger sisters and her older sister, Hickory, who became their guardian after the tragic death of their parents. The circumstances leading up to Iona's death unfurl throughout her story as tensions between her and Hickory arise: she believes that her sister's fianc was responsible for their parents' deaths. You meet Voy, a seemingly tame wolf that Iona has befriended. And you watch Iona retreat deeper and deeper into her own heartache and isolation as the mystery and tension surrounding her death grow.Gravity Ghost combines the aesthetics of Maurice Sendak with the narrative power of classic Don Bluth films like The Secret of NIMH, yet there's little to compare the game's overall style to. The art is like the pages of an illustrated children's book come to life with painstaking details and a beautiful colored-pencils effect, and before the (welcome) heavier elements of the story arrived, I grinned ear to ear at the sincere innocence of it all. But Gravity Ghost is a story about the price of innocence, and it explores guilt and death and family from a child's point of view without sacrificing clarity of insight and without ever looking down on or being condescending towards the perspective of its young star. Gravity Ghost operates on pure empathy, and the story's denouement left me on the verge of tears.Gravity Ghost's gameplay is also quite good, although it never quite reaches the magnificent heights of the game's storytelling and art. Gameplay revolves around platforming with a physics twist. You leap back and forth between planetoid objects of varying sizes and manipulate the gravity wells of each object to shoot yourself across the levels. Along the way you collect stars which open the doors to finish each level, and flowers which lengthen ghost Iona's hair and allow you in turn to collect the ghosts of dead animals and terraform planets. Returning those animal-ghosts to their former bodies also leads to the sublimely animated cutscenes which move the story forward.The variety of celestial objects in the game is a perfect fit for its tight three-hour running time. Gas giants allow you to bounce like a pinball machine. Fire planets propel you high in the sky off their steam. Water planets allow you to dive beneath their surfaces to collect stars and flowers. And gem planets are super-dense with stronger gravity wells than normal. Over the course of the seven constellations--with around 80 or so small levels in total--that make up the game's campaign, you also gain the ability to terraform the planets from one type to another, which is necessary for solving many of the game's simple puzzles.Leaping back and forth between the gravity wells to collect the stars and flowers and ghosts and power-ups isn't always the smoothest experience, but the game gives you a host of tools to circumnavigate most potential sources of frustration, except in timed segments where the looseness of the gravity physics can become aggravating. Despite the looseness of the controls, bouncing and floating between the planets is an oddly Zen experience and it becomes quite soothing before long. It also helps that the soundtrack, from FTL composer Ben Prunty, adds to the games strange rejuvenative power.The worst thing that can be said about Gravity Ghost is that I crave more of it.Beyond the occasionally frustrating timed segments, the worst thing that can be said about Gravity Ghost is that I crave more of it. The game is short. It took me just over three hours to do a 100-percent run for each star and ghost and power-up. And, once you've beaten it, there are few incentives to go back and play again, minus chasing a couple of achievements you wouldn't think to chase on your first go around. But while Gravity Ghost may be short, it never overstays its welcome. Each constellation is the perfect length, and the game continues to implement new mechanics and kinks into the core gameplay up to the final levels.It's easy to capture the happiest moments of being a child: friendships, vacations, exploring the vast, uncharted world in front of you. But it's hard to convey the toughest moments, those moments that we compartmentalize and repress beyond recognition as adults. And it's especially hard to convey such moments in language and images that both children and adults can appreciate and understand. That Gravity Ghost accomplishes this feat with such seeming ease is a testament to its imagination and its power."}