{"ref": "https://www.gamespot.com/reviews/final-fantasy-chronicles-review/1900-2783150/", "date": "July 6, 2001", "game_name": "Final Fantasy Chronicles", "text": "For all of Square's explosive growth over the last few years, Final Fantasy Chronicles proves that the company hasn't forgotten its roots. Like 1999's Final Fantasy Anthology, which saw the release of Final Fantasies V and VI, Chronicles is a repackaging of two of Square's greatest triumphs from the golden 16-bit era--here, Final Fantasy IV and Chrono Trigger make their return. But in the 21st century, when games are as often based on polygons as plot, can a couple of good old 2D epics make a new mark? The answer depends largely on your perspective. Informed gamers will know Final Fantasy IV was originally released in the United States in 1991 as a scaled back and poorly translated Final Fantasy II. In addition to realigning the title of the game with subsequent releases, Square has remade Final Fantasy IV into the game it should have been 10 years ago. To begin with, the game's text has been retranslated; gone is the simplistic and sometimes broken English of the Super NES version. The new translation also gives us vastly deeper insight into the characters and plot than we ever got before--Cecil's struggle with the nature of his dark knighthood is much more fully developed, for instance. This translation has thankfully been applied to the original Japanese edition of Final Fantasy IV instead of the dumbed-down ~Easy Type~ version that was originally released in the States. American gamers finally have a chance to see, in English, all the missing items, battle commands, and other removed features that they missed out on the first time. This is surely the version of FFIV that will endure for years to come. Final Fantasy IV tells the story of the dark knight Cecil, commander of the kingdom of Baron's elite force of airships, the Red Wings. Something is amiss in Baron, however, whose political aims have exceeded its capacity for peace. Soon, Cecil and his friends are forced to rebel against the tyranny of their ruler, and they discover that Baron's evil is merely a front for a much larger force that threatens their entire world. This is, of course, very typical Final Fantasy stuff, but it hasn't been done better since. Series newcomers will want to note that Final Fantasy IV revolves heavily around the elemental crystals they heard so much about in Final Fantasy IX.Chrono Trigger came later in the Square time line, after the company had begun to solidify its popularity in the United States. The original Super NES game therefore featured a fully developed translation and was generally identical to its Japanese counterpart. As such, the PlayStation release of Chrono Trigger doesn't really bring any new elements to the game itself. It does feature a new anime introduction and ending, as well as several anime clips interspersed Final Fantasy VII-style throughout the gameplay. More interesting among Chrono Trigger's additions is the extras mode. It gives you movie and sound tests, extensive information on the game's monsters and attacks, maps of dungeons and item locations, and an artwork viewer. The catch is that initially, only the movie and sound tests are accessible, and only a few of each can be played. To unlock more features in the extras mode, you'll have to finish the game multiple times, as each of the myriad endings opens up more stuff to play with. Of course, only the hard-core will ever see all the toys in the extras mode, but that's the type of player such features are targeted at, anyway. Chrono Trigger was certainly an interesting animal when it came out in 1996. It looked like a cross between a Square RPG and Dragon Quest, thanks to the involvement of famous Dragonball artist Akira Toriyama. The game focused on a main character named Crono and his friends Lucca and Marle. When inventor Lucca's teleportation experiment inadvertently sends the friends back in time, they discover an ancient evil that will one day ruin their world, and so they set out to fix it. Chrono Trigger presented an amazing array of fantastic environments throughout its multitude of time periods, and its storyline was suitably twisty for a Square RPG. Chrono Trigger is as classic as any of the Final Fantasy games. As with Square's previous Super Nintendo-to-PlayStation releases, Final Fantasy IV and Chrono Trigger appear on the Sony machine courtesy of emulation, and as such their technical quality is acceptably lacking. Though they run serviceably, enough minor discrepancies exist between these emulated versions and their cartridge originals to make picky Square stalwarts wince on occasion. Final Fantasy IV was the first game Square released for the PlayStation in Japan, and it has a few slowdown problems, especially in battles, and awfully muffled sound effects. As the last SNES port, Chrono Trigger's emulation issues are ironed out, but its long and frequent loading is somewhat annoying. These flaws aren't really glaring and shouldn't stop you from playing the games, but purists should consider themselves warned. Of course, it goes without saying that Final Fantasy IV and Chrono Trigger represent some of the best that the Square of old had to offer. Most American gamers will think of Final Fantasy IV as the beginning of the series we know today--it was only the second game in the series that we got to play, and it introduced us to the endearing characters and intricate plotlines that Final Fantasy is now known for. Chrono Trigger is significant in its own right--it was known before release as the ~Dream Project~ because it brought together the best minds of Square and Enix for joint development on one colossal game. Both titles deserve to be played by anyone interested in RPGs, and those who've played them before would do well to sit back and remember their gaming roots by checking them out again. Unfortunately, though the two games were visually stupendous in their respective times, they look quite dated by today's standards, and this will probably turn off those looking for a bigger thrill for their gaming dollar. If you can get over their unglamorous appearance, however, the games of Final Fantasy Chronicles are sure to please. With two solid games in one, how can you go wrong?Chrono Trigger came later in the Square time line, after the company had begun to solidify its popularity in the United States. The original Super NES game therefore featured a fully developed translation and was generally identical to its Japanese counterpart. As such, the PlayStation release of Chrono Trigger doesn't really bring any new elements to the game itself. It does feature a new anime introduction and ending, as well as several anime clips interspersed Final Fantasy VII-style throughout the gameplay. More interesting among Chrono Trigger's additions is the extras mode. It gives you movie and sound tests, extensive information on the game's monsters and attacks, maps of dungeons and item locations, and an artwork viewer. The catch is that initially, only the movie and sound tests are accessible, and only a few of each can be played. To unlock more features in the extras mode, you'll have to finish the game multiple times, as each of the myriad endings opens up more stuff to play with. Of course, only the hard-core will ever see all the toys in the extras mode, but that's the type of player such features are targeted at, anyway. Chrono Trigger was certainly an interesting animal when it came out in 1996. It looked like a cross between a Square RPG and Dragon Quest, thanks to the involvement of famous Dragonball artist Akira Toriyama. The game focused on a main character named Crono and his friends Lucca and Marle. When inventor Lucca's teleportation experiment inadvertently sends the friends back in time, they discover an ancient evil that will one day ruin their world, and so they set out to fix it. Chrono Trigger presented an amazing array of fantastic environments throughout its multitude of time periods, and its storyline was suitably twisty for a Square RPG. Chrono Trigger is as classic as any of the Final Fantasy games. As with Square's previous Super Nintendo-to-PlayStation releases, Final Fantasy IV and Chrono Trigger appear on the Sony machine courtesy of emulation, and as such their technical quality is acceptably lacking. Though they run serviceably, enough minor discrepancies exist between these emulated versions and their cartridge originals to make picky Square stalwarts wince on occasion. Final Fantasy IV was the first game Square released for the PlayStation in Japan, and it has a few slowdown problems, especially in battles, and awfully muffled sound effects. As the last SNES port, Chrono Trigger's emulation issues are ironed out, but its long and frequent loading is somewhat annoying. These flaws aren't really glaring and shouldn't stop you from playing the games, but purists should consider themselves warned. Of course, it goes without saying that Final Fantasy IV and Chrono Trigger represent some of the best that the Square of old had to offer. Most American gamers will think of Final Fantasy IV as the beginning of the series we know today--it was only the second game in the series that we got to play, and it introduced us to the endearing characters and intricate plotlines that Final Fantasy is now known for. Chrono Trigger is significant in its own right--it was known before release as the ~Dream Project~ because it brought together the best minds of Square and Enix for joint development on one colossal game. Both titles deserve to be played by anyone interested in RPGs, and those who've played them before would do well to sit back and remember their gaming roots by checking them out again. Unfortunately, though the two games were visually stupendous in their respective times, they look quite dated by today's standards, and this will probably turn off those looking for a bigger thrill for their gaming dollar. If you can get over their unglamorous appearance, however, the games of Final Fantasy Chronicles are sure to please. With two solid games in one, how can you go wrong?"}