{"ref": "https://www.gamespot.com/reviews/legacy-dark-shadows-review/1900-6114694/", "date": "December 8, 2004", "game_name": "Legacy: Dark Shadows", "text": "Have you been yearning for an adventure game with sharp writing, compelling characters, and interesting puzzles? If so, forget about Legacy: Dark Shadows, which feels cheap and amateurish in every way. Playing the game can be a numbing experience. Antiquated graphics, horrible voice-overs, clumsy storytelling, boring characters, derivative settings, pixel hunts, simplistic puzzles, and severe bugs have a way of doing that. If Legacy can do something wrong, it does. Welcome to Mars, where boredom is the leading cause of death. Legacy: Dark Shadows--which, by the way, has nothing to do with the Dark Shadows TV show--stumbles at the start and never recovers. An underdeveloped, barely coherent prologue has you playing for a scant few minutes as a Russian combat journalist (or something to that effect) in Stalingrad in 1941. Apparently a battle is raging even though the real-world battle for Stalingrad began in 1942. You don't really do anything in this prologue except open up a crate ejected from a downed plane. Then the opening credits roll, and this tiny, cryptic episode is essentially forgotten. The bulk of the game has you playing as Ren Silver, a female private investigator in the 22nd century. You start out vacationing on Mars. The game gives you no clue what you're supposed to do there, so you walk around aimlessly with no motive or explanations until you mysteriously trigger an event that calls you back to detective work on Earth. An acquaintance named Hacker calls to say Ted is missing. Who's Ted, you might ask? (And why, by the way, shouldn't he get a more evocative name for a futuristic mystery story?) Beyond the fact that he's a journalist, Legacy doesn't really make it clear who he is or why you should care about him. In fact, the game has a hard time making it clear who even Ren is or why you should care about her--or anything in the gameworld, for that matter. If you learn anything about our heroine, it's through her stoic, bored comments on scenery items, or it comes through her stilted, emotionless dialogue with the few cardboard characters you encounter. You can play the entire game and never get a feel for who Ren is, so if you're expecting a strong female protagonist akin to April Ryan or Kate Walker, you'll be sorely disappointed. Legacy's storytelling fares no better than the character development. If you want to learn what's going on in this clunky, underdeveloped tale of world domination, you'll usually have to stop, open Ren's logbook, and read her comments. This is backward. A player shouldn't have to repeatedly read about events after the fact to learn their significance. Ridiculous monsters and objects hidden on dark screens are par for the course. The game unfolds in weird ways, with new areas opening up to exploration for no clear reason. You might find that you can enter a hotel only after reading an advertising leaflet about it. Or that you can't initially go down a hallway that your cursor shows to be a valid route--nothing is blocking you, and no reason is given as to why you can't proceed that way. The puzzles are mostly inventory-based and offer little challenge except when the game forces you into tedious pixel hunting. There are too many items or hotspots that are tiny and hidden against dark backgrounds, so it's often only sheer luck that you'll stumble across some of them. Some items aren't even marked as hotspots, so near the end of the game, you have to click all over the ground to dig up vital items. On top of that, major bugs can make items (and even Ren) temporarily disappear. How on earth can you solve a puzzle when the items vanish? In addition to the inventory puzzles, you get four logic puzzles, but any adventure-game veteran will have solved variants of these puzzles many times before and will be able to breeze through them in a heartbeat. In fact, novices should find them easy, too. Legacy offers no difficulty settings or alternate puzzle solutions, and it unfolds in a strictly linear fashion, so not only is the game too easy, but it also has no replay value at all. On the bright side, it's at least reasonably long the first time through. Reading Legacy's box, you get the impression the interface is something special. In fact, it's pretty bad. Little radial command menus pop up when you click on the characters or items you can interact with, letting you look at, take, or talk to the person or object in question. That part is fine. The problem is that the cursor doesn't always make it clear when you can actually interact with something, rather than merely look at it to hear Ren's thoughts. Between that problem and the hotspots that are far too easy to miss, you'll pretty much have to click everything in sight to avoid missing important items or exits. The interface can also make movement unclear. You might have two exits at the bottom of the screen, yet the movement cursor stays lit up all along that edge, implying that it's all one exit. The visuals don't clearly show two routes, either, so it's only by chance that you might discover you can actually go either left or right. The gameworld is a boring thing to explore, anyway. It's a third-rate mishmash of old cyberpunk imagery and Blade Runner's dystopian urban future. This is a gameworld where a metropolis is called ~Big City,~ an arms dealer is named ~Gunman,~ and characters talk with a straight face about the ~conquest of the universe.~ The world isn't merely clichd and underdeveloped--it's also portrayed with dated, blocky graphics and mostly static backgrounds. The character animations are extremely limited and stilted, too. Ren's walking and running animations don't look remotely realistic, and her lips never move when she speaks. When she interacts with an object, she just vaguely waves her hand in its direction instead of actually holding, turning, or opening it. Ren looks more like a marionette than a person. Outside of some frustrating pixel hunts, the puzzles are a breeze. While the graphics are unoriginal and at least six years out of date on a technical level, they still more or less get the job done. The same can't be said for the audio, which is atrocious. The sound effects and music are simplistic and sparse, and the voice-overs range from bad to astonishingly bad. The actors have heavy Slavic accents, so Ren takes a ~wacation~ instead of a ~vacation.~ This wouldn't be a problem if all the characters were supposed to be from the developer's native Croatia, but there's no indication that such is the case. In fact, one is apparently supposed to be a Texan. What's worse is the way many actors gratuitously affect strange, cartoony voices that are downright silly and distracting. Mispronunciations, coupled with numerous typos in the subtitles, only add to the game's audio woes and general sloppiness. More than anything, what's striking about the voice-overs is how everyone sounds terminally bored, as if random people were dragged in off the streets and paid a few bucks to read some bad dialogue for an afternoon. Not a single character sounds like a person with real emotions that you can relate to. It somehow seems fitting that whenever you exit Legacy, it starts to play a cheesy little rap song and then crashes. In fact, Legacy crashes during gameplay, too, so save often. Better yet, save your money for one of the many superior adventure games released this year."}