{"ref": "https://www.gamespot.com/reviews/superpower-2-review/1900-6111209/", "date": "October 22, 2004", "game_name": "SuperPower 2", "text": "More comic relief than serious geopolitical simulation, the original SuperPower wasn't big on realism. While the ambition of the game design gave it a certain charm, everything was skewed with such a bizarre take on foreign affairs that almost anything was possible. If you were looking for a thoughtful take on the international community of nations, you came away disappointed. If you were looking for a game that finally let you see what would happen if Belgium invaded Sri Lanka, you came away thrilled. Things are a little better in the sequel, but not by much. While SuperPower 2 tones down the outrageous stuff somewhat, there are still so many strange incidents that it's impossible to keep from laughing out loud at least once per game. And there still isn't enough to do. Scenarios can be successfully completed by making just a couple of minor adjustments to the default setup and then waiting for time to pass. If running a nation in the real world were this easy, the planet would be a paradise. Germany's up to her old tricks again...but in India? Gameplay at least seems impressive, with a selection of single-player scenarios and a custom mode that can be played alone or with up to 32 opponents via the Internet or a LAN. You can take control of any nation on the picturesque rotating globe (zoom in and you can even make out highways and rivers) and direct its three spheres of influence: political, economic, and military. Politically, you can outlaw religions, ban languages, and declare various forms of dictatorships, while in economics you get to play with commerce. The military sphere is perhaps the most interesting, however, as here you get to purchase and design jet fighters, tanks, and the other hardware required to attack neighbors. You can even direct forces on the battlefield using an abstract map to direct units, although the options are so limited that it makes more sense to let the computer automatically generate battle results. This is actually quite appropriate, too, since much of the game flies on autopilot. In the intermediate military scenario, where the goal was the seemingly daunting task of developing nuclear weapons in Canada, we won simply by cranking up the tax rate to pay for the project and selecting the options necessary to research and deploy nuclear weapons. We just clicked on the buttons to build a missile defense system and strategic forces, and then designed and constructed ballistic missiles. The only hard part was waiting the 15 to 20 minutes needed for all the research to be completed. Nothing else was required during that delay, save patience. Despite the momentous nature of what Canada was doing, nobody tried to stop the building of this massive nuclear arsenal. Washington didn't care about the deployment of nukes on its doorstep. Alliances actually strengthened over the four years it took to go nuclear. By the time the missiles were rolling off the assembly line, Canada was beloved from Azerbaijan to Zaire. Opinion was the same inside the country. Without even lifting a finger to appease the heavily taxed electorate, the ruling Liberals surged to 98 percent wins in two straight elections, government corruption dropped to an astounding zero percent, and gross domestic product per capita leaped to over $50,000 per year. It seems like there's a lot going on, especially when you pull up the current events ticker, but there really isn't a lot to do here. All of the other scenarios seem similarly automated. While you can influence nearly every aspect of your nation's foreign and domestic policy, there isn't much need to tinker. Yes, you can declare martial law in the US, set up a theocracy in the new capital of Wichita, and send covert operatives to stage a coup in Zambia, but there's no point to doing any of these outlandish things unless you want to make things hard for yourself. Smaller, less radical steps, like signing economic treaties and forming common markets with other nations, have more of an obvious payoff, essentially making your people richer and happier. But since you can usually get where you're going without such experiments, why bother? Unless you absolutely need to build your economy through a series of treaties, as in the scenario where Turkey must raise its standard of living before being admitted to the European Union, nations advance in prosperity so naturally that you can just about sit back and enjoy the ride. Custom solo games and multiplayer matches offer more entertainment. Here you can adopt a sandbox state of mind and set goals that demand real strategizing, like raising GDP by 50 percent, conquering the planet, or simply trying to accomplish some personal aspirations, such as banning the Republican party and outlawing the French language in Canada. Still, there are some flaws here as well. Unless you're playing an online game with a full complement of human opponents controlling the world powers, chances are very good that the computer is going to do something absolutely ridiculous, usually involving a major nation. If you're willing to endure some negative press at home for a little while, nukes are a good way to end the quagmire in Iraq once and for all. In one custom game, a placid international scene was shattered when Germany attacked India. A cease-fire was soon declared, but within the next year a massive war had broken out, pitting Germany, Taiwan, Nepal, Bangladesh, Tajikistan, and Pakistan against India. Something like this seems to happen in almost every game. One nation gets involved in a conflict, sometimes a sensible one against an authentic enemy, and then becomes the whipping boy for the entire planet, or at least a region. We've seen Syria declare war on Israel at least three times. Syria always loses, and then it turns into a target for civilian espionage and terror attacks--launched from South America. Israel must have some strong allies in that part of the world, because immediately after a cease-fire is signed between Tel Aviv and Damascus, Peru and Colombia start mounting espionage missions, terror attacks, and coup attempts in Syria. Often, this heightens tension to the point where a second war breaks out, pitting the victimized country against a half-dozen or more enemies from all over the globe. These wars are always ludicrous, as the game's odd system of alliances draws in nations that are thousands of miles away from the initial flash point. So you regularly get such oddities as the above example, where half of central Asia and a European superpower invade the Indian subcontinent for no apparent reason. Conflicts do make sense on occasion. In most games, espionage is common between Israel and its Arab neighbors, and this often erupts into full-scale war. Iraq stages civilian sabotage in the US. Pakistan and India constantly feud. But even then things don't seem quite right. The military model doesn't appear to account for nuclear weapons. When India was conquered in the game described above, it never used nukes against the multinational invaders. It didn't even throw a couple of missiles at Pakistan out of spite. Even Israel was never seen to respond to Arab invasions with a nuclear deterrent. Also, sea battles seem broken. They drag on for months before being resolved and often still rage long after one of the nations involved has been conquered. Even when the bullets aren't flying, strangeness abounds. We witnessed Bulgaria launching espionage missions in Brazil, the terrorist group Hizbullah winning national elections in Mauritius, Iraq sponsoring a coup in Venezuela, and the Democratic party in the US securing 95 percent, plus support of the voting public in one federal election after another. Some games were quiet and uneventful, but most featured wild events straight out of the bizarro world. Manually directing battles is a waste of time, due to simplistic controls that show an abstract view of battlefields. And SuperPower 2's programming seems almost as unstable as the political situations that it depicts. GolemLabs clearly didn't work out all the bugs before the shipping date, as we encountered a number of drops to the desktop and odd pauses where the mouse cursor could be moved, but nothing could actually be clicked. Music often locks into a loop where one sample plays endlessly until the game is rebooted (which is a shame, because the martial theme song is one of the best aspects of the game). Also, the StarForce copy protection leaves a lot to be desired. We couldn't get the game started without uninstalling the CD-burning software program Nero. Even after that, it tried to access the Internet for some kind of lengthy CD-verification process before starting single-player games. All SuperPower 2 has going for it is an anything-can-happen atmosphere. Even while you know that the game isn't the least bit realistic, you keep playing just to see what sort of craziness will happen next. But the novelty of curiosities like Fiji spying on Denmark fades in just a few hours, and when it does, you'll reach for the uninstall icon. Custom solo games and multiplayer matches offer more entertainment. Here you can adopt a sandbox state of mind and set goals that demand real strategizing, like raising GDP by 50 percent, conquering the planet, or simply trying to accomplish some personal aspirations, such as banning the Republican party and outlawing the French language in Canada. Still, there are some flaws here as well. Unless you're playing an online game with a full complement of human opponents controlling the world powers, chances are very good that the computer is going to do something absolutely ridiculous, usually involving a major nation. If you're willing to endure some negative press at home for a little while, nukes are a good way to end the quagmire in Iraq once and for all. In one custom game, a placid international scene was shattered when Germany attacked India. A cease-fire was soon declared, but within the next year a massive war had broken out, pitting Germany, Taiwan, Nepal, Bangladesh, Tajikistan, and Pakistan against India. Something like this seems to happen in almost every game. One nation gets involved in a conflict, sometimes a sensible one against an authentic enemy, and then becomes the whipping boy for the entire planet, or at least a region. We've seen Syria declare war on Israel at least three times. Syria always loses, and then it turns into a target for civilian espionage and terror attacks--launched from South America. Israel must have some strong allies in that part of the world, because immediately after a cease-fire is signed between Tel Aviv and Damascus, Peru and Colombia start mounting espionage missions, terror attacks, and coup attempts in Syria. Often, this heightens tension to the point where a second war breaks out, pitting the victimized country against a half-dozen or more enemies from all over the globe. These wars are always ludicrous, as the game's odd system of alliances draws in nations that are thousands of miles away from the initial flash point. So you regularly get such oddities as the above example, where half of central Asia and a European superpower invade the Indian subcontinent for no apparent reason. Conflicts do make sense on occasion. In most games, espionage is common between Israel and its Arab neighbors, and this often erupts into full-scale war. Iraq stages civilian sabotage in the US. Pakistan and India constantly feud. But even then things don't seem quite right. The military model doesn't appear to account for nuclear weapons. When India was conquered in the game described above, it never used nukes against the multinational invaders. It didn't even throw a couple of missiles at Pakistan out of spite. Even Israel was never seen to respond to Arab invasions with a nuclear deterrent. Also, sea battles seem broken. They drag on for months before being resolved and often still rage long after one of the nations involved has been conquered. Even when the bullets aren't flying, strangeness abounds. We witnessed Bulgaria launching espionage missions in Brazil, the terrorist group Hizbullah winning national elections in Mauritius, Iraq sponsoring a coup in Venezuela, and the Democratic party in the US securing 95 percent, plus support of the voting public in one federal election after another. Some games were quiet and uneventful, but most featured wild events straight out of the bizarro world. Manually directing battles is a waste of time, due to simplistic controls that show an abstract view of battlefields. And SuperPower 2's programming seems almost as unstable as the political situations that it depicts. GolemLabs clearly didn't work out all the bugs before the shipping date, as we encountered a number of drops to the desktop and odd pauses where the mouse cursor could be moved, but nothing could actually be clicked. Music often locks into a loop where one sample plays endlessly until the game is rebooted (which is a shame, because the martial theme song is one of the best aspects of the game). Also, the StarForce copy protection leaves a lot to be desired. We couldn't get the game started without uninstalling the CD-burning software program Nero. Even after that, it tried to access the Internet for some kind of lengthy CD-verification process before starting single-player games. All SuperPower 2 has going for it is an anything-can-happen atmosphere. Even while you know that the game isn't the least bit realistic, you keep playing just to see what sort of craziness will happen next. But the novelty of curiosities like Fiji spying on Denmark fades in just a few hours, and when it does, you'll reach for the uninstall icon."}