{"ref": "https://www.gamespot.com/reviews/locoroco-cocoreccho-review/1900-6179869/", "date": "September 26, 2007", "game_name": "LocoRoco Cocoreccho!", "text": "The bulbous, bouncy blobs known as LocoRoco are back, though things are a bit different this time. The tilting mechanics of the original PSP title have been replaced with an interesting new control scheme, and the minimalist gameplay is even simpler this time around. But really, it's all about the agreeably goopy globules that spread charm across your screen, and it's hard not to be taken with them. At $6.99, this PlayStation Network download feels a bit overpriced for a single (albeit large) level, but the few hours of gaming you'll get out of it are rewarding and strangely compelling. If you played the original LocoRoco, you'll immediately notice the changes in mechanics. Rather than tilting the playfield to move your LocoRocos, you move a cursor in the form of a butterfly around the screen. When you press the circle button, you call any Locos in range in your direction, and if you tap the button, they will jump toward your cursor. You begin the game with a single LocoRoco, and your goal is to awaken the remaining 199 blobs by getting other Locos to bump into them. The level itself is set up like a huge, complex Rube Goldberg contraption, complete with trampolines, moving platforms, water bubbles, wind gusts, and all sorts of other elements that send your screwy spheres careening across the screen. Once you wake enough of them, you move them to a collection area to unlock the next section of the level. Great goopy globs of gaiety. The game makes decent use of the Sixaxis controller. You can tip the controller to tilt platforms, wiggle it to fling flowers off the screen, or shake it to perform other contextual actions. You'll need to experiment to see just what items on the screen can be manipulated, but it's fun to discover new tricks that reveal new LocoRocos. You'll also encounter a few minigames that let you release even more LocoRocos, like one where you bounce a Loco into the air to collect flies. There is also a minigame/boss fight you'll need to complete a few times to unlock new areas. There are some occasional frustrations, especially when you try to stack LocoRocos to reach higher areas but they don't wish to cooperate. Yet the stubborn obtuseness of the Locos is a part of the game's appeal. It doesn't sound like much on its own, but the real saving grace is the personality of the LocoRocos. They cheerfully follow your butterfly around, singing along with the kooky theme song. You can see and hear each Loco croon its own part of the tune, the way all the animatronic children do on the Small World ride at Disney World. Except this music is actually good, and the repeated jingle never gets old. Too bad it's the same music featured in LocoRoco on the PSP. The visual design is outstanding as well, featuring a simple pastel color scheme and a clever level layout. Watching the LocoRocos fly and roll around is a hoot, especially in the chaotic late stages. Like flOw, another downloadable PSN game, this is as much an entertainment experience as it is a game. LocoRoco Cocoreccho is more interactive and decidedly less soothing, yet it's just as fun to tool around with, in spite of its relative simplicity. In fact, its weird frenetic charm makes it a perfect companion piece to flOw's hallucinogenic psychedelia. You can see all the game has to offer in just a few short hours, and if you're a fan of LocoRoco on the PSP, you may be disappointed that the game veers so much from the original formula. But if you can shed your misgivings about the new gameplay elements and added simplicity, you will find yourself singing along with the LocoRocos as you guide them on their zany journey. LocoRoco Cocoreccho will make you grin and giggle, guaranteed."}