{"ref": "https://www.gamespot.com/reviews/lost-planet-extreme-condition-review/1900-6173317/", "date": "June 28, 2007", "game_name": "Lost Planet: Extreme Condition", "text": "Capcom has opted to bring Lost Planet: Extreme Condition, its exciting Xbox 360 shooter, to the PC, complete with DX10 support. But all is not well with this port. Right off the bat, you'll detect signs of platform translation. The pop-up tutorials all refer to the Xbox 360 controller, leaving equivalent keyboard commands completely out of the equation--and if you're a keyboard jockey, the correspondingly awkward menu navigation will be the first thing you notice. You may also observe another major annoyance: Lost Planet requires you to be connected to the Internet via Valve Software's Steam client just to play the single-player game. Losing your connection during gameplay will cause the game client to quit, and since there are no midmission saves, you'll have to replay the entire mission from the beginning. Without the connection, the game can't start, and at press time, will not start even if Steam is in offline mode. Should've brought a can of Raid. These are simple but exasperating blunders, but if you can overlook them, you'll find that Lost Planet's single-player campaign features a lot of cool action with larger-than-life shooting sequences. Furthermore, it's all capped with stunning visuals that surpass those of its console counterpart. Make no mistake: This is a beautiful game. You trudge through drift after drift of gleaming white snow, fending off towering insects in memorable scenes that will make your heart pound. The high dynamic range lighting is particularly stunning, and the game makes good use of it both in indoor caverns and wintry fields. It's also been touted as one of the first DirectX 10 titles, though running it in DX10 mode didn't yield any noticeable quality or performance differences. Either way, be prepared to turn down visual settings, as you need a beefy rig to run the game, let alone see it in all its frigid glory. In Lost Planet you play as former snow pirate Wayne on planet E.D.N. III, a frozen wasteland teeming with buglike creatures called the Akrid. Wayne and his colleagues, including his own father, are attacked by a monstrous Akrid called Green Eye. After the assault, Wayne believes his father was killed in the incident, and the story plays out initially as a revenge tale. As the narrative progresses, however, it gets more and more convoluted as characters are introduced and the plot swerves out of control. As you can imagine, you'll spend a lot of time in the frozen tundra, though you'll explore plenty of indoor arenas as well. As on the Xbox 360, you control Wayne from a third-person perspective, though you can zoom in to a closer view, or even use a limited first-person perspective if you like. Unlike the 360 version, however, the aiming reticle stays fixed in the center of the screen. It makes the PC controls feel less cumbersome, if a bit less original. They work just fine with a mouse and keyboard, though you can plug in a gamepad and play that way if you prefer. But even with its more traditional targeting scheme, Lost Planet moves at a measured pace. Wayne doesn't run all that quickly, and lumbering through heaps of snow slows him down even further. You'll be spending a lot of time shooting bugs. Some of them flutter around and are nothing more than an annoyance. Others rise toward the heavens, swiping at you with pincers the size of snowplows. These are the moments where the game excels. The Akrid look and sound horrific and intimidating, and getting sideswiped will send you flying backward and underneath the drifts, causing plenty of confusion as you try to stand up and get your bearings. Granted, some of these assaults can be exasperating when you fall victim to a succession of attacks that make it almost impossible to escape unscathed, but it simply lends gravity to your struggles with these disgusting monstrosities. That isn't to say that Lost Planet is hard, mostly due to Wayne's ability to collect thermal energy, or T-Gen. T-Gen is found throughout the game in glowing puddles left behind by fallen Akrid, or even within entire towers filled with the stuff. Your energy level drops continuously as you play, so you need to keep replenishing it lest you drop dead. When you take damage, T-Gen is used to restore your health--and since there's so much of it to be had, it's not often you need to worry about death. Some of the menacing bosses may take you to task, and these encounters are a lot of fun. They don't present much of a challenge though, as long as you quickly learn their patterns. On top of that, every Akrid has an obvious weak spot, identified by the glowing energy within. Target that spot and be mindful of the boss' movement, and you'll be fine in most cases. You also get a grappling hook to play around with, which makes it easy to get to higher places and is occasionally used in some simple platforming sequences. It's a nice idea but underused, and you'll spend most of your time shooting guns and piloting hulking mechs called vital suits. Piloting a VS is pretty simple, and there are a few different types. Some of them can jump to decent heights; another can transform into a drill for bulldozing over enemies. But whether you're on foot or in a VS, there's a nice selection of weapons, from your standard assault SMG to laser weapons, and they all feel weighty and produce plenty of clatter and screen-filling explosions. Yet you won't be spending all your time dealing with frostbite and overgrown cockroaches. Wayne gets plenty of harassment from human and mechanical foes too, indoors as well as out. Snow pirates aren't as interesting as the Akrid; they will often just stand there and let you shoot them without exhibiting many signs of life. Occasionally they'll try to tumble away or take cover, but for the most part, they're bullet fodder. VSs are harder to take down, but you'll often have your own VS to pilot, though a plasma rifle and a few grenades will turn them into scrap heaps in no time flat. It's easier to destroy this giant grasshopper than it is to connect to a multiplayer match. Lost Planet is relatively short, with each of its 11 missions taking between 30 and 45 minutes to complete, depending on whether you rush through to take on the boss at the end of each level. In theory, the multiplayer should help extend its life, though at this point, it's unclear if online multiplayer is even functioning properly. Prerelease online test sessions resulted in multiple disconnects, and a day after release, attempts to both host and join multiplayer sessions on multiple connections have never resulted in finding opponents. Local network play has at least been successful. The initial eight maps included with the 360 version are included--though, inexplicably, subsequent maps available for free download on the Xbox 360 are nowhere to be found here. Should you find a match, you'll find the maps to be large and detailed. There's standard deathmatch and team deathmatch, as well as a Battlefield-type game called post grab, and fugitive mode, which pits all players against a single defender. But it appears that online multiplayer is broken for many, and the issue is widespread. It's a testament to strong game design that even with numerous technical and porting issues, Lost Planet's single-player campaign makes it still worth taking a look. But as visually dazzling as it is, the PC version can't quite reach the heights of its console counterpart, thanks to inexplicable design decisions and broken online play. It's too bad these issues weren't ironed out prior to release, but if you can look past them, you're bound to get a lot of enjoyment from shooting down colossal creepy-crawlies."}