{"ref": "https://www.gamespot.com/reviews/stake-fortune-fighters-review/1900-6028859/", "date": "May 23, 2003", "game_name": "Stake: Fortune Fighters", "text": "Stake: Fortune Fighters, Metro3D's new arena-based fighting game, attempts to emulate games like Super Smash Bros. Melee, pitting four fighters against each other in an open arena full of power-ups and environmental hazards. But while the Super Smash Bros. games featured sharp visuals, a fighting system that was forgiving for beginners but had a surprising amount of depth, and a good amount of polish overall, Stake has none of these things. In many respects, Stake is the antithesis of Super Smash Bros. Melee and that game's best features. Stake isn't much to look at. The focus of Stake is squarely on the four-player action, a feature that's highlighted clearly on the front of the game's box. It does have a single-player mode that is virtually identical to the multiplayer game, except that you get to play against erratic AI opponents instead of your friends. Strangely, there are only two other fighters in the regular single-player game, though you can start up a multiplayer game and add three computer-controlled opponents to it. The fact that the game even bothers to differentiate between the single-player and the multiplayer is bizarre in itself. Even stranger is the game's watch mode, where you can just sit back and enjoy the game's four-player split-screen play without bothering to actually join in. After choosing one of eight different characters, most of whom look like poor imitations of Capcom's fighting game characters, you're thrown into an arena where you duke it out with your opponents. The arenas you'll fight in are all rather large--too large, in fact. Though the game gives you a map in the corner of the screen to help you locate your opponents, you'll still spend more time in the game just trying to find someone to fight than doing any real fighting. However, this almost seems like a good thing, since the fighting itself isn't terribly compelling. You have two attacks, which are simply referred to as ~attack #1~ and ~attack #2~ in the manual, and you can also use special ranged attacks. The fighting system gets no deeper than pressing two buttons at once to trigger a special attack, and in the meantime, you'll simply pound one attack button, occasionally switching over to the other attack button when you get bored of watching the same attack animation over and over again. To its credit, Stake displays a few hints of technical proficiency in its presentation--though, on the whole, it's not much to look at. The game uses a forced-focus look, which makes everything look blurrier the further away from the camera it is. The characters are self-shadowed, and they actually look pretty good standing still, though their animations are stilted and repetitive, which more or less negates the quality of the models. The environments are generally blocky and are rendered with decent-looking but uninteresting textures. Unfortunately, Stake's stubborn camera makes the otherwise straightforward game more frustrating than it should be, since you have no horizontal control over it, which causes you to occasionally lose track of your character behind pieces of the environment. The game generally moves pretty smoothly when you play it alone, though it stutters and slows down quite a bit in the four-player split-screen mode. It's not clear why the game has separate single-player and multiplayer modes. The sound in Stake is probably the single most offensive aspect of the game, since it almost seems unfinished. The game is pretty much dominated by the music, a shoddy fusion of Asian-themed music and rock and techno tunes. By default, you'll barely be able to hear the in-game sound effects over the music, though the annoying, repetitive attack sounds and death knells probably won't inspire you to mess with the audio levels. Stake: Fortune Fighters has bad music and sound, unimpressive graphics, and camera problems. The only thing that it has going for it is its four-player mode, though even this is executed so poorly that if you play it with three of your friends, you'll probably just end up with three fewer friends."}