{"ref": "https://www.gamespot.com/reviews/dave-mirra-freestyle-bmx-2-review/1900-2810555/", "date": "May 17, 2006", "game_name": "Dave Mirra Freestyle BMX 2", "text": "A little less than a year ago, Acclaim was the first to stake out BMX territory on the PlayStation with Dave Mirra Freestyle BMX. Nine months later, a ~remixed~ version of the game was released, containing new levels and a smoothed-out trick system. Now, Acclaim and Z-Axis have claimed the first PlayStation 2 BMX game with Dave Mirra Freestyle BMX 2. The jump to next-gen hardware has been good to the game in many respects, but the control problems that have haunted the last two games are still present, and a few new ones have cropped up to boot. Not straying from the script established in the first game, the focus lies in the career mode, where you take a pro BMX rider through the game's eight levels, completing a variety of level challenges along the way. The basic goals remain essentially unchanged, with the standard high-score, long-grind, and big-air challenges making a return. Beating Tony Hawk 3 to the punch, each level is populated with other pro BMX riders, who will lay down the level's more difficult challenges, most of which consist of executing tricks on specific items in the level. This character interaction helps to further immerse you in the level, but the challenges existed in the last two iterations of Dave Mirra, and the other riders essentially serve as window dressing here. You'll also find a variety of motorized vehicles rolling around the levels, each of them a grinding opportunity. The two-player modes have been expanded on greatly, now offering 13 different game types, such as a high-score challenge, a H-O-R-S-E variant, and a wipeout mode where players try to pull off the nastiest, most painful bail possible. The game also includes a hefty level editor, comparable to the one found in Tony Hawk's Pro Skater 2. You're given a choice of several level themes, a large open space, and a boatload of objects with which to design your level. Using the Dual Shock 2 to design levels can be a bit clunky, but that won't stop those determined to design their dream BMX track. One of the biggest improvements that the PlayStation 2 hardware has afforded Dave Mirra is larger level size. The Woodward Camp level, for example, essentially takes four levels from the original game and rolls them up into one. Other than the size of the levels, however, the level design is pretty much business as usual, with status quo courses set in old industrial train stations and busy urban centers, though the swamp and Arizona desert levels do provide a welcome change of pace. Balanced control has always been a bit of a trial for Dave Mirra games of past, and unfortunately, it has remained that way. Dave Mirra 2 employs the beefed-up control scheme from Maximum Remix, which uses the X button for jumps, the triangle for grinds, the circle button for bike and body tricks, and the square button for trick modifiers. The trick modifier is a suitable wild card, as it exponentially increases the game's trick catalog, but it also lets you perform physically impossible tricks, such as the physics-defying 360 No-Handed Superman. The game still suffers from magnetic grind rails and easily landed tricks, and the collision detection and environment clipping is way off, making it possible to put yourself inside otherwise inaccessible buildings, or else right through metal rails with a well-placed bail. Suffice it to say, the physics in general lack polish, and considering it's the area that has been begging for improvement through the life of the series, it's disappointing to see the same flaws rear their ugly heads yet again. There are significantly more good things to say about the presentation in Dave Mirra 2, though it is still hampered with a few noteworthy problems. As stated earlier, the levels are big, and any pop-up you might see is so minute that it has little impact on the game. The character models have been improved, adding a greater sense of diversity to the collection of riders. The riders are better animated as well, making for smoother trick transitions. Bland, fuzzy textures are now but a memory, as is texture warping. On the bad side, the game still suffers from the occasional fit of slowdown. The camera has a tendency to get stuck on corners and low overpasses, leaving you to watch your rider go off into the distance until the camera catches up. The soundtrack is pretty much occupied by the types of musical acts you'd expect in an action-sports game: current pop-punk darlings Sum 41 contribute a track, as do Methods of Mayhem, Rage Against the Machine, Sublime, and Fenix TX. While hardly a genre-shattering collection of artists, the soundtrack is serviceable and serves as decent background noise.Dave Mirra Freestyle BMX 2 does not suffer from any single huge, crippling flaw; rather, a handful of smaller problems plague the game and keep it from achieving BMX greatness. If you're looking for some BMX action, you could certainly do worse, but Acclaim and Z-Axis could certainly do better."}