{"ref": "https://www.gamespot.com/reviews/death-track-resurrection-review/1900-6208071/", "date": "April 16, 2009", "game_name": "Death Track: Resurrection", "text": "You've probably wished for a forgotten game franchise to be brought back from the dead. Chances are, however, that the Death Track series of PC car combat games was not on your list of nominees. Yet as unfamiliar as you may be with those racers, there's something to be said for Death Track: Resurrection's simple brand of motorway mayhem. Nevertheless, while the game can be fun in spurts, its budget roots are obvious: there's no multiplayer, the production values are inconsistent, and some small but glaring flaws hinder the enjoyment. The game offers some light entertainment, but it's not a strong argument for the series' return. One thing Death Track: Resurrection does well is nail its postapocalyptic vision. You'll race through the streets of a number of real-world cities, though you'll discover that in the future, Paris is, literally, burning. The courses are designed well and are presented with a nice sci-fi flair, and you'll glimpse familiar landmarks as you zoom and battle through them. When you're in top form, the game delivers a good sense of speed, which enhances the occasional burst of chaos. Yet Resurrection isn't visually up to date: vehicles don't exhibit a lot of detail, explosions look terrible, and the reddish brown haze of a few environments makes them look washed out and somewhat unpleasant. Settings like Tokyo and New York, on the other hand, look appealing and provide glitzy backdrops for all the vehicular violence. The pulsing but inoffensive soundtrack contributes to the futuristic ambience as well, though the song that plays in the menu screens is not easy on the ears. There are several ways to tackle these tracks, most notably in Scenario mode, which presents an absurd but easily dismissed story about murdered tournament drivers. The dryly dubbed live-action newscast is an unintentionally campy hoot, however, so you may want to follow along for the occasional giggle. It's also the best way to introduce yourself to the car combat at Resurrection's center, though some slightly awkward keyboard and mouse controls will inspire you to plug in (and configure) a controller first. Your vehicle is equipped with primary, secondary, and rear weaponry, and you'll need to take down your competitors while chasing them around the track. Courses offer multiple routes, and the slick sensation of speed can make the game quite fun at times. The potential for madness is further enhanced by the ability to take aim at certain environmental structures and other objects, like blimps. Should you take a building down, a slow-motion cutaway may dramatize the event, or the destruction may be depicted in a window on the right side of your screen. Resurrection loves these bits of drama, perhaps a bit too much for comfort. Hitting a ramp generally causes time to slow and the camera to pan about with cinematic spectacle. It's cool at first, but when it interferes with your ability to adjust your landing or grab a power-up floating in the air, this bit of design hubris is more annoying than exciting. In fact, grabbing a power-up is often a pain, since some of them jump around or sway to and fro. This isn't too problematic for speed and repair enhancements, but when you're low on ammo and desperately need that pickup, this kind of randomness can be frustrating. Other aspects of the game feel similarly left to chance. For example, vehicle respawns are handled poorly. There's practically no safety period once a vehicle reappears, so you could crash into an enemy that spawns directly in front of you, or you might respawn directly behind a divider. These and other missteps (what's with the laser-spewing hoverbots?) mean that no matter how well you drive or battle, matters of chance still decide the outcome more often than they should. If Resurrection offered more forgiving finishing conditions, the randomness would be easier to stomach, but in Scenario mode, you need to finish at least in second place to reap any monetary rewards and advance--and in other modes, you must be the winner. It's Istanbul, not Constantinople. Earning that dough is important, because you'll be able to beat the story only if your vehicle is properly upgraded. There aren't a whole lot of choices, but the different weapons and cars provide a bit of variety. To pad your pocketbook (or just to mix things up), you can race in Tournament mode, enter a one-off race, or compete in drag races. More interesting is Challenge mode, in which you must complete a series of objectives, such as destroying a certain number of opponents in a particular lap or finishing a lap within a certain time period. Unfortunately, you won't find any kind of multiplayer mode, which is a big blow to a game that begs for human competition. Without online play, Resurrection simply doesn't offer much replay value; its single-player offerings are sometimes fun but are too unoriginal and short-lived to keep you coming back for long. Nevertheless, Death Track: Resurrection's very low discount price makes it worth considering for a day's worth of amusement. The tracks are put together well, and the game delivers the occasional rush. The small frustrations, however, can really add up, and there isn't enough content here to help offset them."}