{"ref": "https://www.gamespot.com/reviews/red-steel-2-review/1900-6254074/", "date": "March 23, 2010", "game_name": "Red Steel 2", "text": "When Red Steel was released alongside the launch of the Wii in 2006, a lot of hopes were riding on its promise of exciting swordplay that utilized the Wii's motion controls. And when it failed to live up to expectations, it became apparent that perhaps the Wii's technology just wasn't capable of reading one's movements with the precision necessary to deliver on that promise. Now, aided by the Wii MotionPlus accessory, Ubisoft has overhauled the Red Steel franchise. While it's far from flawless, it's a dramatically better game than its predecessor and offers the best excuse yet to swing a Wii Remote around as if delivering sharp, merciless death to your enemies. Red Steel 2 scraps the yakuza theme and contemporary setting of the original, replacing it with an aesthetic that combines the Old West with a sprinkling of Asian architecture and advanced technology. Your nameless hero is the last of the Kusagari, a clan who protected the people of the Red West from the marauding biker gangs that infest the region. Returning to the town of Caldera after spending some years in exile, you set out to learn who is behind the deaths of the Kusagari and avenge your fallen brothers. Unfortunately, the characters are underdeveloped and the story is nearly incoherent. For example, the mission description will tell you to do something, but often, it won't be especially clear why you're doing what you're doing. You also learn so little about the main character and the villain that it's impossible to care about the quest for vengeance that drives the story forward. A turn of events near the end of the game that's meant to stoke the fires of your rage falls completely flat, and the final battle along with the subsequent ending are almost shockingly underwhelming. But the combat is the real draw here, and thankfully, it's pretty good. You move with the nunchuk's thumbstick; you turn, interact with objects, aim, and attack with the remote. A Kusagari clan member can switch instantly from his katana to his firearms, and you'll often combine shooting with swordplay to effectively take down your enemies. Those hoping to see their swordfighting techniques mimicked onscreen with unerring accuracy will be disappointed; Red Steel 2 doesn't try to precisely match your movements. Rather, various general inputs make your character perform moves from his repertoire. You can swing horizontally or vertically or stab with the remote to perform a standard attack, with a wider horizontal swing resulting in a stronger attack you can use to break through an enemy's guard posture or destroy any armor he might be wearing. While common sense might suggest that trying to mow enemies down with a tommy gun from a safe distance would always be an easier way to deal with a gang of thugs than engaging them in swordfights one at a time, in the world of Red Steel 2, that's not always the case. The game encourages you to use the different weapons at your disposal in tandem; perhaps shooting an enemy in the head to stun him (yes, stun him) and then responding to an onscreen prompt to finish him off with a fancy katana move. It may feel a bit contrived, but switching effortlessly between shooting and slicing adds variety to the action, as well as contributes to the feeling that you're a master of some ludicrous but extremely effective fighting style. Looks like someone brought a hammer to the sword and/or gun fight. Initially, you have only a few simple moves at your disposal. But you'll gain access to a wide array of techniques as you progress, most of which are performed with a combination of button presses and sword swings. Some of these moves are doled out automatically at certain points in the story, while others can be purchased with the money you earn for completing missions and by blasting open every box you come across. The steady increase in your abilities matches the wider variety of attacks your enemies progressively employ. You'll learn to parry strong attacks by pressing the A button and holding the remote vertically or horizontally, depending on the direction of your opponent's swing, then take advantage of the opening to land an attack of your own. You'll learn to quickly circle around enemies to attack them from behind and to deflect bullets back at their shooters. You'll also acquire powers that let you send your opponent flying skyward or trigger earthquakes that knock down enemies gathered around you. At times, you may feel a bit too powerful, cutting through a small mob of thugs as if they were made of paper, but the sense of progression that comes from acquiring techniques that allow you to make short work of enemies who had previously given you a tough time is rewarding. That's not to say that the game is too easy. Some groups of enemies can be effortlessly eliminated once you've got the right techniques, but there are also times when you're confronted with mobs of enemies in which the odds are stacked a bit too much in their favor. Even well-armored enemies generally aren't smart enough to be much of a threat one-on-one, especially once you've figured out which attacks are most effective against that particular type of enemy. But the group tactics that your enemies resort to sometimes feel cheap. Being swarmed from behind while you're trying to deal with the enemy in front of you can get irritating, despite the indicator that tells you when you're about to be attacked from the back. And although it doesn't happen often, enemy bullets occasionally pass right through walls, which can lead to some especially infuriating deaths. When someone sports facial hair like this, you know you can trust him. The motion controls for all this shooting and slashing work very well for the most part. There may still be the rare time when a stabbing motion doesn't register or when what felt like a pretty wide swing to you is interpreted as a standard attack instead of a strong one, but it doesn't happen frequently enough to be a real problem. It's possible to see Red Steel 2 as both an argument for more widespread use of motion control or against it. At times, seeing an enemy fall before you as you forcefully swing or thrust can be visceral and exciting, but at other times, you may tire a bit of all the arm waving, longing for the reduced exhaustion of a traditional control scheme. Just how much a control scheme like this can add to a gaming experience is not a question Red Steel 2 is going to answer once and for all, but it is one of the more successful implementations of a motion control scheme in which your character's movements mirror your own to some degree. You don't spend every spare moment in combat, but there certainly isn't much else of interest outside of it. In each area, in addition to main missions that advance the story, there are a number of optional side missions available that you can take on to earn some extra cash. (In addition to buying new techniques, that coin can also get you damage upgrades, life extensions, armor, and trophy masks that give you more time to input finishing moves on stunned opponents.) But these optional tasks are dull, and many of them repeat from area to area. The money you earn might be useful, but it hardly compensates you for the time spent scouring the area in search of a few wanted posters or running around pushing buttons to activate communication towers. The most engaging diversion outside of combat is the quick safecracking process that you encounter from time to time. For this, you turn the remote back and forth like the dial on a safe, pushing a button when you hear the click of the lock sliding into place. It's not challenging, but it's a fun little use of the added precision that is afforded by the game's MotionPlus motion controls. Red Steel 2 is one of the best-looking games on the Wii. What the cel-shaded environments may lack in fine detail, they make up for in vibrancy. Your enemies attack with style and grace, with dramatic speed lines giving the action a heightened, comic-book quality. Even in the midst of the most frantic combat, the game maintains a silky smooth frame rate that helps pull you into this dusty place of tumbleweeds and neon signs. In fact, the visuals are so good, you won't even spend much time thinking about the fact that your steel never turns red at all. Sadly, the sound design isn't so successful. The music combines spaghetti western motifs with Asian influences, which fits the setting, but the results here are a bit uninspired. Some of the voice acting is terrible, particularly with regard to a few villains who strain with every word to sound as evil as possible. And a few instances in which subtitles indicate that a character's words are being jammed by enemy transmission yet you can hear every word perfectly suggest that the sound just didn't get the attention it deserved. A fool and his armor are soon parted. Shortly thereafter, the fool dies. It takes roughly eight or 10 hours to reach the game's conclusion, and while you can jump to any chapter you've completed to use any guns or techniques you've acquired, there's little incentive to return to the Red West after the credits roll. But it's a memorable experience while it lasts, thanks to its interesting setting, great visuals, and frequently exciting combat. Red Steel 2 isn't going to usher in a golden age of motion-controlled action games, but it's a solid enough game in its own right to be worth playing regardless of how you feel about the potential of the technology. That's not to say that the game is too easy. Some groups of enemies can be effortlessly eliminated once you've got the right techniques, but there are also times when you're confronted with mobs of enemies in which the odds are stacked a bit too much in their favor. Even well-armored enemies generally aren't smart enough to be much of a threat one-on-one, especially once you've figured out which attacks are most effective against that particular type of enemy. But the group tactics that your enemies resort to sometimes feel cheap. Being swarmed from behind while you're trying to deal with the enemy in front of you can get irritating, despite the indicator that tells you when you're about to be attacked from the back. And although it doesn't happen often, enemy bullets occasionally pass right through walls, which can lead to some especially infuriating deaths. When someone sports facial hair like this, you know you can trust him. The motion controls for all this shooting and slashing work very well for the most part. There may still be the rare time when a stabbing motion doesn't register or when what felt like a pretty wide swing to you is interpreted as a standard attack instead of a strong one, but it doesn't happen frequently enough to be a real problem. It's possible to see Red Steel 2 as both an argument for more widespread use of motion control or against it. At times, seeing an enemy fall before you as you forcefully swing or thrust can be visceral and exciting, but at other times, you may tire a bit of all the arm waving, longing for the reduced exhaustion of a traditional control scheme. Just how much a control scheme like this can add to a gaming experience is not a question Red Steel 2 is going to answer once and for all, but it is one of the more successful implementations of a motion control scheme in which your character's movements mirror your own to some degree. You don't spend every spare moment in combat, but there certainly isn't much else of interest outside of it. In each area, in addition to main missions that advance the story, there are a number of optional side missions available that you can take on to earn some extra cash. (In addition to buying new techniques, that coin can also get you damage upgrades, life extensions, armor, and trophy masks that give you more time to input finishing moves on stunned opponents.) But these optional tasks are dull, and many of them repeat from area to area. The money you earn might be useful, but it hardly compensates you for the time spent scouring the area in search of a few wanted posters or running around pushing buttons to activate communication towers. The most engaging diversion outside of combat is the quick safecracking process that you encounter from time to time. For this, you turn the remote back and forth like the dial on a safe, pushing a button when you hear the click of the lock sliding into place. It's not challenging, but it's a fun little use of the added precision that is afforded by the game's MotionPlus motion controls. Red Steel 2 is one of the best-looking games on the Wii. What the cel-shaded environments may lack in fine detail, they make up for in vibrancy. Your enemies attack with style and grace, with dramatic speed lines giving the action a heightened, comic-book quality. Even in the midst of the most frantic combat, the game maintains a silky smooth frame rate that helps pull you into this dusty place of tumbleweeds and neon signs. In fact, the visuals are so good, you won't even spend much time thinking about the fact that your steel never turns red at all. Sadly, the sound design isn't so successful. The music combines spaghetti western motifs with Asian influences, which fits the setting, but the results here are a bit uninspired. Some of the voice acting is terrible, particularly with regard to a few villains who strain with every word to sound as evil as possible. And a few instances in which subtitles indicate that a character's words are being jammed by enemy transmission yet you can hear every word perfectly suggest that the sound just didn't get the attention it deserved. A fool and his armor are soon parted. Shortly thereafter, the fool dies. It takes roughly eight or 10 hours to reach the game's conclusion, and while you can jump to any chapter you've completed to use any guns or techniques you've acquired, there's little incentive to return to the Red West after the credits roll. But it's a memorable experience while it lasts, thanks to its interesting setting, great visuals, and frequently exciting combat. Red Steel 2 isn't going to usher in a golden age of motion-controlled action games, but it's a solid enough game in its own right to be worth playing regardless of how you feel about the potential of the technology."}