{"ref": "https://www.gamespot.com/reviews/beat-hazard-review/1900-6259809/", "date": "April 22, 2010", "game_name": "Beat Hazard", "text": "There's a good chance you've already played a game like Beat Hazard. In this downloadable dual-stick shoot-'em-up, you maneuver a small spacecraft about the screen, blowing up asteroids and other vessels before they can turn you into space dust. Countless games have used this ever-popular formula, but Beat Hazard stands out because its gameplay molds itself to the rhythm of the music tracks you import. The resulting diversity leads to some exciting and challenging action and makes for an interesting way to enjoy your favorite musical artists. This unique feature doesn't completely absolve the game of its minor sins--underwhelming sound effects and a scarcity of modes and enemy types. Beat Hazard, however, offers its simple gifts with loads of energy and enthusiasm, which makes it an attractive value, even at its full price of $9.99. Beat Hazard works with many traditional audio file types, though we had no luck using files protected by stringent digital-rights management; in other words, forget using the protected tracks you downloaded from iTunes or the Zune store. We had no trouble with any unprotected audio files, however, and the game comes with its own great, pulsing soundtrack. Your ship's firing pattern throbs to the rhythm, and every track results in a different chorus line of space rocks, projectile-spewing bosses, and evil ships. As with most games of this type, you fly about the screen using the left stick and aim and shoot using the right. The keyboard and mouse also provide a workable, if slightly more awkward, solution. Busy music with strong, varied beats produces the best action, so you may want to leave Brahms and Beethoven in their graves and stick with something more current. As the music heats up and as you grab the few power-ups that pop up, your ship's lasers will beef up to impossibly powerful levels; so too will the screen fill with impossibly large numbers of meanies. The resulting mayhem looks remarkably slick, with your ship's bright neon fire filling the screen and explosions so vibrant and colorful they look as if they might burst from your monitor. The morphing colors and background visualizations look attractively chaotic but rarely make it difficult to tell what's onscreen. The only visual downside is the flashy strobe effect that intensifies as the track progresses; on hard difficulty, the flashing can get uncomfortable, so if you have sensitive eyes, you may need to rest them from time to time. The disappointing sound effects are surprisingly subdued, considering the attractive, vivacious visuals. Firing your weapons makes no sound whatsoever, and explosions are oddly muffled. Perhaps developer Cold Beam Games wanted to avoid overwhelming the music, but the minimal sound effects just make it seem as if something important is missing. Ooh. Pretty. There aren't a lot of ways to experience Beat Hazard's customizable take on the old-fashioned shooter. You can only play through a single track individually (a fun and pleasant diversion) or take on an entire album in Survival mode (a tough-as-nails challenge). For that matter, there are only a few different enemy types, so don't expect the variety of a game like Geometry Wars 2, which provides multiple modes and various strong-willed foes. But the way the game wraps itself around the music you import provides its own kind of variety, and there's nothing quite like taking on a new tune for the first time because you never know how it will play out. There's also a leveling-up mechanism that rewards you with new ranks as you play, and lets you compete with your friends on Valve's Steam service. A ticker at the bottom of the screen provides updates on your friends' progress, and you can compare your point totals and overall progress with players across the globe with the online leaderboards. Without its few grace notes, Beat Hazard would be just another dual-stick shooter, but the way the game transforms to your favorite music gives it that extra push needed to stand out in a crowded genre. It's also fun, frenzied, and flashy--the interactive equivalent of a fancy music visualizer. There is still room for improvement here, but Beat Hazard is an entertaining diversion and a cool new way to experience your music library. Editor's Note: This review is based on a copy of the game downloaded from Steam; some of the features described may be unavailable in versions downloaded from other sources."}