{"ref": "https://www.gamespot.com/reviews/7-wonders-of-the-ancient-world-review/1900-6179841/", "date": "September 25, 2007", "game_name": "7 Wonders of the Ancient World", "text": "Success breeds imitation, and in the world of video games this is no more apparent than in the realm of puzzle games. Casual game company PopCap struck gold with Bejeweled, a simple and addictive grid-based gem-matching game, and it wasn't long before competing casual game company iWin conjured up its own, Mayan-themed Bejeweled knockoff called Jewel Quest. Now MumboJumbo is getting in on the action with 7 Wonders of the Ancient World for the DS, which cribs more directly from Jewel Quest than Bejeweled, effectively making 7 Wonders a knockoff of a knockoff. As a Bejeweled knockoff, 7 Wonders plays about how you'd expect. Each level consists of a grid of different-colored runes that you can shuffle around to create rows or columns of three or more like-colored runes in order to make those runes disappear. In 7 Wonders, each level is themed after one of the Seven Wonders of the Ancient World, which include the Great Pyramid of Giza, the Hanging Gardens of Babylon, the Temple of Artemis, the Statue of Zeus at Olympia, the Mausoleum of Maussollos, the Colossus of Rhodes, and the Lighthouse of Alexandria. Ironically, one of the seven wonders isn't, 'I wonder why they made this game.' The game operates under the premise that you're actually building the seven wonders by completing these puzzles. You have to clear runes on every space of the grid at least once, and you have to move a special building block from the top of the grid all the way to the bottom, all while working against the clock. The shape of the grid changes from level to level, and clearing out runes in some of the corners can get tricky, though special row-clearing runes that appear when you create rows of four or five runes make short work of those hard-to-reach spaces, ultimately killing much of the difficulty in 7 Wonders. And, as grand as the ancient-wonder-building premise might sound, all it really means is that you get a slightly different wallpaper and background music every few levels. Even then, the art is uninspired, relying heavily on drab earth tones, and the music is generic. You'll likely grow tired of the story mode before you work your way through all seven wonders, which leaves you with the predictable free play mode as well as the rune quest mode, which changes things up by challenging you to clear a number of specific types of runes before you're allowed to advance. The rune quest mode is one of the few interesting bits in 7 Wonders. There are no multiplayer modes to liven things up--it's just you and the wonders--though as a semiconsolation you can read short descriptions of each of the Seven Wonders of the Ancient World in the game. With more inventive Bejeweled-inspired games like Puzzle Quest available for the DS, there's no reason to settle for something like 7 Wonders of the Ancient World. The lack of multiplayer is a serious omission, and what's there just feels like a photocopy of a more inspired game that we've already played."}