{"ref": "https://www.gamespot.com/reviews/singstar-pop/1900-6168613/", "date": "April 5, 2007", "game_name": "SingStar Pop", "text": "Sony finally brought the long-running, European-produced SingStar karaoke franchise to North America last fall with SingStar Rocks!, and a few scant months later, it's back with the second US installment, SingStar Pop. The game shares an identical interface design and feature set with its predecessor, so the quality of the experience hinges almost entirely on the quality of its song lineup. The last game featured more than a few songs that rocked, but it was also peppered with some incongruous R&B, disco, and so on. Luckily, the style of songs in SingStar Pop sticks closer to the ~pop~ category, and while that's a pretty broad label, you can expect any song included here to have appeared on Top 40 radio at some point over the last couple of decades. Veterans of last fall's SingStar Rocks! will find the interface and gameplay eminently familiar. As in the last game, SingStar Pop leans more heavily on contemporary tracks than classic karaoke standbys, but there's a decent mix here. You relative old-timers can look for just a few hits by A-ha, Whitney Houston, Cyndi Lauper, and the Clash. However, the majority of the list is taken right from the pop radio of the last few years, with singles from Alicia Keys, Franz Ferdinand, James Blunt, the Gorillaz, Hoobastank, Natasha Bedingfield, and My Chemical Romance, among others. Even if you're not familiar with many of these artists, you'll likely realize after one flip through the song-select screen that you've heard quite a few of them on the radio or television already. Since the game's 36 songs are all unlocked from the get-go, it's easy to seek out your favorites or sample the songs you don't know well. As mentioned, the underlying game design in Pop is more or less the same as that of last year's Rocks!. The game plays exactly the same, with a series of bars--indicating the pitch and sustain of each line or phrase as you sing--overlaid on the selected song's music video. All the same features are here, though if you played the previous game, you'll know there aren't a lot of them. The eight-player party mode also returns, which lets you trade off the two microphones between two teams as you compete for high scores, sing rapid-fire medleys, and so on. You can use an EyeToy to watch yourself in place of the music video while you sing, and you can record your favorite performances to a memory card for later review (and distortion, via a few silly effects). One nice new feature is that you can swap in SingStar Rocks! (and presumably any subsequent PS2-based SingStar releases) directly from the main song menu, so you don't have to restart the console to access a new set of songs. This doesn't allow the games to share scoreboards or anything, though. Pop princesses and radio-friendly rock populate the track list on this second domestic SingStar release. As with Rocks!, SingStar Pop can be purchased with two nice microphones and a USB adapter for $50, and if you already bought that initial package, you can treat the stand-alone Pop game as the song pack it really is and grab it for around $30. That's not a bad value, though with no apparent possibility of downloadable content in the future, the 36 songs here could wear thin if you play the game daily. Rocks! owners who are familiar with the general SingStar formula only need to look at Pop's song list to determine their interest level. If you're new to the series, though, or even video game karaoke in general, SingStar Pop isn't a bad place to start."}