{"ref": "https://www.gamespot.com/reviews/motogp-3-ultimate-racing-technology-review/1900-6135609/", "date": "May 17, 2006", "game_name": "MotoGP 3: Ultimate Racing Technology", "text": "Riding a motorcycle at speeds approaching 200 miles per hour around hairpin turns on hot asphalt is about as intense as motorsports get. MotoGP 3: Ultimate Racing Technology, the latest motorcycle racing sim from THQ, comes complete with a full roster of riders and courses from around the world. But it isn't a mere roster update. In the third installment in the series, developer Climax offers a more arcade-style racing experience with the addition of extreme mode, which adds all-new fictional tracks and riders to complement the licensed portion of the game. Diehard sim fans might object to this slight departure from reality, but it feels perfectly valid within the context of the game, and it's a lot of fun to boot. Unfortunately, the PC version doesn't have the same online support and tight control that made the Xbox version so great, but at $20 it's an acceptable alternative for racing fans. MotoGP 3 on the PC doesn't have the same tight controls and online support as the Xbox version of the game, but for $20 it's still a pretty good deal. MotoGP 3 is split into two distinct but complementary racing modes: Grand Prix and extreme mode. Grand Prix mode lets you take part in the 2004 MotoGP season, with fully licensed tracks, riders, and bikes. You can race against the best riders in the world on the 16 real-world MotoGP tracks, from the familiar Le Mans course in France to the new Gulf course in Qatar. All the riders, bikes, and courses are represented with pinpoint accuracy here, but the 2004 season highlight movies that were included in the Xbox version of the game have been cut from the PC version. When you play career mode you can create a custom rider and race your way through all 16 races in the 2004 MotoGP season. You can choose your bike and leathers, and even create a custom logo to slap on the side of your racing machine. Once that's complete, you're ready to race. Before each race, you have an opportunity to run practice laps to get a feel for the course. After that, you can move on to the qualifying round, where you're given 10 minutes to run the fastest lap possible. Your fastest lap determines which position you'll start in at the beginning of the race. You can't always count on the weather being the same for the practice, qualifying, and racing rounds, so you have to be ready to adapt if it's raining on race day. After completing each race, you earn attribute points that can be applied to your rider to improve cornering, braking, top speed, and acceleration. These points can be redistributed between races. For example, if you think you'll need a few more points on the top end for an upcoming race, you can pull some points from cornering and put them toward your top speed. In addition to modifying your stats, you can tune your bike between races. The tuning component of the game is fairly shallow, but you can adjust your bike where it counts most: tire compound for grip; gear-tuning for acceleration and top speed; suspension for stability; and wheelbase for cornering. Depending on how you place in each career race, you earn championship points, and the rider with the most points at the end of the season is the champion. How well you do really depends on your familiarity with each turn of every track, as well as the difficulty setting of the artificial intelligence-controlled racers. The artificial competition is downright pathetic in rookie mode, and even inexperienced racers will easily take at least a 30- to 40-second lead over the rest of the pack. Luckily, the pro, champion, and legend difficulty modes are challenging enough to give seasoned riders a run for their money. This time around you can race on 16 all-new 'extreme' courses. The biggest new feature in MotoGP 3 is extreme mode, which lets you race in three different classes on 16 fictional street courses. You can race 600cc 2-strokes, as well as 1000cc and 1200cc 4-strokes, for a total of 16 new bikes. All of the bikes and riders are fictional, but they look and behave convincingly enough. If you're playing in career mode, you'll earn money for each race you're in, which you can spend on parts, tuning, or new bikes. There are five different categories to sink your earnings into on your bike, and each category has three progressive stages. For example, if you want to spend some money to tune your engine, you have to start off with fuel mapping for $100, then move on to port polishing and engine blueprinting, with a $100 increase at each stage. It isn't especially involved, but it provides all the more incentive to keep winning races. As in Grand Prix mode, you can also tune your bike by adjusting things like gear ratios, suspension, and tire compound. Again, the tuning isn't too involved, so even the mechanically inept can easily figure out how to properly tune a bike. The tracks in extreme mode are fictional, but they're set in real-world locations such as Tokyo, Barcelona, and Prague. These are all street circuits, so you'll race through narrow alleyways, city streets, or crooked country roads. Some of the races even take place at night. The courses look great, especially when you're zooming by at 180 miles per hour. The extreme courses are not only nice to look at, but they're also fast. These courses have fewer sharp turns, so you can keep the throttle open for most of the race. On the smaller bikes, you hardly need to use the brakes at all. Overall, the extreme courses are much less demanding in terms of technical racing skills, but they're still a lot of fun. And even if you're put off by the arcade-style feel of these races, it doesn't detract from the Grand Prix part of the game in any way. MotoGP 3 supports up to 16 players online, but for some reason there's no integrated server browser. Whether you play MotoGP 3 online or offline, you'll improve your seed, which is basically a skill ranking. If you win a lot of difficult races, your seed will get lower and lower. You start out at 100, and you can get all the way down to one if you're really dedicated. Your seed is used to let others online know how you rank in terms of skill and experience. You can race any of the extreme or Grand Prix courses online, with a full suite of options to adjust the weather effects, number of laps, scoring, collisions, AI riders, and more. Up to 16 players can race in Grand Prix mode, and up to 10 can race in extreme mode. Unfortunately, the online multiplayer in the PC version isn't integrated very well. There is no server browser in the game, so unless you know the IP address you want to connect to, you have to exit MotoGP 3 and launch a third-party program to find a game. The game also supports LAN play, or you can run four-player, split-screen races if you have enough USB ports and gamepads. The controls are fully customizable, but steering with the keyboard is less than ideal. We found the best option to be a gamepad with analog control, which the game does support. The bike physics are accurately represented here, and there's a simple satisfaction to be found in gracefully righting your bike after a perfectly navigated chicane or hairpin turn. You can really feel a difference when the road surfaces change--which they often do. You'll race on cobblestones, wooden bridges, and rain-slicked pavement, and if you stray off the course there's always a dreaded gravel trap waiting to swallow your wheels and slow you down. All of these effects can drastically alter the outcome of a race. For example, when the track is wet, it really feels like your rear wheels are about to slip out from under you at any moment. As a result, you have to modify your lines and ride a bit more conservatively to stay on course. One thing to especially look out for is getting too close to the computer-controlled riders. If you tangle with them, you'll most likely end up eating asphalt while they ride on unfazed. Although the AI isn't overly aggressive, it's still frustrating when you get knocked off your bike at the slightest contact with another racer. The tracks, riders, and weather effects look nice, but unfortunately the frame rate often gets choppy. The production values are fairly high in MotoGP 3 on the PC, especially for a budget game. The courses, bikes, and riders look great, but the frame rate often dips and snags as you're racing. The engine noise sounds authentic, and while the music isn't particularly interesting, it isn't intrusive either. MotoGP 3 on the PC feels like a stripped-down version of its Xbox counterpart. The PC version features the same tracks and riders, but the online play, frame rate issues, and awkward controls make it a much less-appealing game. Still, the licensed content and budget price make MotoGP 3 a solid choice for racing fans. The tracks in extreme mode are fictional, but they're set in real-world locations such as Tokyo, Barcelona, and Prague. These are all street circuits, so you'll race through narrow alleyways, city streets, or crooked country roads. Some of the races even take place at night. The courses look great, especially when you're zooming by at 180 miles per hour. The extreme courses are not only nice to look at, but they're also fast. These courses have fewer sharp turns, so you can keep the throttle open for most of the race. On the smaller bikes, you hardly need to use the brakes at all. Overall, the extreme courses are much less demanding in terms of technical racing skills, but they're still a lot of fun. And even if you're put off by the arcade-style feel of these races, it doesn't detract from the Grand Prix part of the game in any way. MotoGP 3 supports up to 16 players online, but for some reason there's no integrated server browser. Whether you play MotoGP 3 online or offline, you'll improve your seed, which is basically a skill ranking. If you win a lot of difficult races, your seed will get lower and lower. You start out at 100, and you can get all the way down to one if you're really dedicated. Your seed is used to let others online know how you rank in terms of skill and experience. You can race any of the extreme or Grand Prix courses online, with a full suite of options to adjust the weather effects, number of laps, scoring, collisions, AI riders, and more. Up to 16 players can race in Grand Prix mode, and up to 10 can race in extreme mode. Unfortunately, the online multiplayer in the PC version isn't integrated very well. There is no server browser in the game, so unless you know the IP address you want to connect to, you have to exit MotoGP 3 and launch a third-party program to find a game. The game also supports LAN play, or you can run four-player, split-screen races if you have enough USB ports and gamepads. The controls are fully customizable, but steering with the keyboard is less than ideal. We found the best option to be a gamepad with analog control, which the game does support. The bike physics are accurately represented here, and there's a simple satisfaction to be found in gracefully righting your bike after a perfectly navigated chicane or hairpin turn. You can really feel a difference when the road surfaces change--which they often do. You'll race on cobblestones, wooden bridges, and rain-slicked pavement, and if you stray off the course there's always a dreaded gravel trap waiting to swallow your wheels and slow you down. All of these effects can drastically alter the outcome of a race. For example, when the track is wet, it really feels like your rear wheels are about to slip out from under you at any moment. As a result, you have to modify your lines and ride a bit more conservatively to stay on course. One thing to especially look out for is getting too close to the computer-controlled riders. If you tangle with them, you'll most likely end up eating asphalt while they ride on unfazed. Although the AI isn't overly aggressive, it's still frustrating when you get knocked off your bike at the slightest contact with another racer. The tracks, riders, and weather effects look nice, but unfortunately the frame rate often gets choppy. The production values are fairly high in MotoGP 3 on the PC, especially for a budget game. The courses, bikes, and riders look great, but the frame rate often dips and snags as you're racing. The engine noise sounds authentic, and while the music isn't particularly interesting, it isn't intrusive either. MotoGP 3 on the PC feels like a stripped-down version of its Xbox counterpart. The PC version features the same tracks and riders, but the online play, frame rate issues, and awkward controls make it a much less-appealing game. Still, the licensed content and budget price make MotoGP 3 a solid choice for racing fans."}