{"ref": "https://www.gamespot.com/reviews/tony-hawks-american-sk8land-review/1900-6136846/", "date": "October 28, 2005", "game_name": "Tony Hawk's American Sk8land", "text": "Now in its sixth installment on the Game Boy Advance, the Tony Hawk franchise appears as if it may be finally running out of steam. The latest iteration, Tony Hawk's American Sk8land, is just as slick as previous installments in the franchise, and it contains all of the tricks and play modes that fans are accustomed to. However, its skate park designs are weak and its story mode missions lack the creativity that normally makes these games palatable. As you'd expect from any Tony Hawk game, this one is easy to play and packed with tricks. If you've played any of the last few Tony Hawk games, you already know what to expect with this one. You can easily perform and chain together various tricks just by pressing a few buttons and making proper use of structures in the environment. The selection of tricks is truly comprehensive and includes staples such as ollies, grinds, manuals, reverts, board tricks, lip tricks, air tricks, ground tricks, run outs, and so on. Play modes include story, classic, and multiplayer. The story mode lets you build up a custom character by completing missions given out by bystanders who are situated throughout seven large free-roaming environments. Classic mode uses the same environments as the story mode, but you can pick any of eight real pro skaters, and you're only given two minutes per run to set high scores and collect items (such as video tapes and the letters that spell ~skate~). Multiplayer games include the same batch of link-play and pass-and-play competitions that have been present in previous installments, such as horse, tag, and trick attack. Sk8land misses the mark in two major ways. First, the story mode is dull and painstaking. Second, the skate park designs aren't very good. The story mode is set up roughly the same as it has been in previous Tony Hawk games. In order to boost your character's stats and unlock new outfits and game locations, you have to talk to bystanders and complete the challenges they give you. Unfortunately, the challenges doled out by the characters in Sk8land are easy and mundane compared to the goofy tasks handed out in previous games. Most don't involve anything more taxing than linking together tricks to achieve a suggested score or collecting items that are scattered throughout the area, and the humor level tops out at wall-riding coffee shops at the request of a grizzled old coot. To make matters worse, most challenges take forever to complete because the neighborhoods are so massive. You'll spend significantly more time hunting for bystanders and tracking down items than you will actually performing tricks. It doesn't help that the story and characters are shallow and underdeveloped. When you talk to bystanders and the other skate pros, their dialogue is limited to comments like, ~grind the rooftops behind me~ or ~I'd be happy to help, but first I need you to find my tools.~ The main plot isn't much better. It involves a skater girl named Mindy, who has taken up the cause of fixing up the Sk8land Warehouse, while simultaneously putting together a comic book about the experience. She and Tony Hawk appear in single frame cutscenes every so often to chat about how the process is going and to send you out to find other pro skaters who are willing lend a hand. Feuding with Bam Margera and his crew in Tony Hawk's Underground 2 may have seemed silly at the time, but those interactions were more involved and interesting than this drivel. You can avoid the doldrums of the story mode by playing the timed classic mode, but that leads into the other major negative. In addition to being overly large, the skate park designs are poorly designed. It's nice that the skate parks are patterned after actual California locations, though. Grinding the Hollywood sign and handplanting the benches at Fisherman's Wharf in San Francisco is great fun. What isn't fun, however, is that there are too few places where you can actually cut loose and put together a flashy trick run. With the exception of Van's Skate Park and the Warehouse, which were designed for all-out trick runs, the rest of the game's seven environments consist mainly of streets, sidewalks, and buildings that you can't do much with, along with a few token bowls, quarter pipes, and rail sections. The skate parks in Sk8land are too big and generally don't give the player enough opportunities to cut loose. Even though the game's skate parks are poorly designed, they do at least look good. In fact, Tony Hawk's American Sk8land is just as slickly presented as any of the previous Tony Hawk games. The isometric visual style makes it appear that the game is 3D, and some of the recognizable landmarks, such as the Hollywood sign and the Fisherman's Wharf sign, are immaculately re-created. Just like in the console versions of the game, you can move seamlessly between neighborhoods without worrying about loading screens or long pauses. Character animation is ridiculously fluid, which is impressive when you consider that the game has to handle almost 200 unique tricks and various animations for everything from riding along to scraping knees during a nasty spill. Longtime fans of the franchise may not appreciate how the developers drew black lines around the characters and scenery in order to give everything a cel-shaded look. But the effect isn't obnoxious and doesn't interfere one bit with the 3D look of the environments or the fluidity of the skater animations. As for the audio, there isn't a great deal of music this time around; just a few rock and techno riffs. But the sound effects are plentiful and realistic. The sound that the board's wheels make while riding on pavement, and when landing and taking off from rails and ramps sounds exactly like a real skateboard does. All of the different screams and groans that the skaters make when bailing out and pancaking are also true to life. Ultimately, because the skate park designs and the story mode are so weak, it's tough to recommend Tony Hawk's American Sk8land over previous installments in the franchise. There haven't been any significant changes made to the trick system, so there's really no compelling reason for longtime fans to upgrade. And new players would be better off tracking down one of the Tony Hawk's Underground games, which are better designed and probably heavily discounted by now."}