{"ref": "https://www.gamespot.com/reviews/tatsunoko-vs-capcom-ultimate-all-stars-review/1900-6246956/", "date": "January 27, 2010", "game_name": "Tatsunoko vs. Capcom: Ultimate All-Stars", "text": "Complexity is in the DNA of most modern fighting games, and Tatsunoko vs. Capcom: Ultimate All-Stars is no exception. The game's hefty character list, intricate mechanics, and hyperkinetic presentation could easily spook fighting first-timers, potentially sending them running from the room when they see terms like ~advancing guard,~ ~crossover air raid,~ or ~baroque combo~ flash across the screen. But while fighting veterans will revel in Tatsunoko vs. Capcom's deeply satisfying combat, the game is without a doubt one of the easiest in the genre to jump into, thanks to control schemes that cater to everyone from brawling neophytes to air combo aficionados. Some character balance issues and a more-difficult-than-necessary online experience hold it back, but if you're a Wii owner and you've been itching for a fight, then Tatsunoko vs. Capcom is a great sparring partner no matter what your starting skill level. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Tatsunoko vs. Capcom: Ultimate All-Stars Video Review Last year's Street Fighter revival reinvigorated the fighting genre, but don't expect the same type of experience from Tatsunoko vs. Capcom. Tatsunoko is far more fast-paced than Street Fighter IV and is more akin to Capcom's classic Vs. title, Marvel vs. Capcom 2. This 2.5D fighter (3D characters on a 2D plane) lets you choose two playable characters, and you'll be able to switch between them at almost any time during a match. Just as in Marvel vs. Capcom 2, smart switching is vital, not only because a newly switched character is momentarily open to attack, but also because ~resting~ characters slowly regain a portion of their lost health. Swapping characters also plays strongly into offensive and defensive strategies, with tag-ins used to lengthen combos or disrupt enemy attacks. The basic control scheme in Tatsunoko has been simplified from previous Vs. titles to now feature only four buttons: three for attacks (light, medium, and strong) and one dedicated for calling in your partner to assist. Special moves are performed using a variety of quarter-circle, half-circle, charge, and button combos, while the game's flashy hyper combo attacks are similarly done using D pad/stick movements in conjunction with button presses. These over-the-top hypers vary in effectiveness, but they do share the common trait of being visually spectacular. They range from the functional (Ryu's shinku hadoken) to the brutal (Polimar's multihit illusion destructive fist) and even include the comical (Roll's tsunami-from-a-bucket finisher called Oh. No. You. Didn't.). The game may seem less complex because it uses fewer buttons, but this simplicity belies the depth of each character's move set. Combining D pad/stick direction with button presses changes the nature of an attack; pressing strong while standing, for example, performs an uppercut, while pressing the same button while holding down on the D pad results in a sweep. The same applies to special moves; the attack button you use determines the direction or effect of an attack or, in some cases, changes a move entirely. There's plenty of intricacy to be found in Tatsunoko, and it will take some serious play time with the game's rock-solid mechanics to get the nuances of each character down pat. Whatever character you choose, offence is the key, and the game lets you--skill permitting--notch ground and air hit combos well into the double digits. You can add even more destruction thanks to the ability to string together hyper combos, release two at once, or even unleash ultrapowerful hypers that can take serious chunks out of any health bar. A lot of the fun in Tatsunoko comes from finding and experimenting with new combos, a joy that's topped only by the satisfaction you feel when you successfully carry out a devastating multihit attack on your opponents. Your defensive options are similarly varied. Pressing the three attack buttons at once while blocking pushes an opponent back, giving you more room to manoeuvre away, while pressing all four buttons will perform a mega crash which will disrupt opponents mid-combo and throw them across the screen (although this uses up two hyper combo meters). You can also sacrifice any red health you have--the portion of a character's lost health that would normally recover over time when not in battle--for a momentary boost in power. Called a baroque combo, this can be used to extend combos and can be particularly devastating in expert hands because of the increase in damage temporarily bestowed. Giant bucket hyper, courtesy of Roll. This might all sound rather complex, but the game's different control schemes do an outstanding job of making it accessible to everyone, from absolute newcomers to frame-counting fighting veterans. Experienced players will naturally gravitate to using a Classic Controller or GameCube controller (if not a fight stick), with the Classic's D pad proving to be responsive and thoroughly dependable. The game also has two simpler setups: one using the Wii Remote solely and the other using the Wii Remote and Nunchuk. Both of these condense the controls even further, assigning one button for all attacks and one button for all special moves (with the move you bust out dependent on the direction of the D pad/control stick). It sounds limiting, and for those serious about their fighting games, it is. But these simple control schemes are surprisingly robust, allowing you to pull off hypers, most special moves, and some basic combos. The simplified control schemes make playing a rewarding experience for novices, allowing them to become instantly competitive against more practiced players, as well as letting them pull off flashy sequences normally reserved for experts. Tatsunoko also gives you the option of having your character's move list appear on the top third of the screen at all times, eliminating the need to pause the game, check a move, and then unpause. If you've shied away from fighting games for fear of being unable to do a simple fireball, then Tatsunoko is the game for you. While its user-friendly controls should prove appealing for the majority, Tatsunoko's 26-strong roster is less of a draw card, at least initially. Both sides have some pretty big names on the list: Capcom has Ryu, Chun Li, and Alex from Street Fighter; two Mega Man incarnations; and Morrigan from Darkstalkers. Famous anime studio Tatsunoko brings in three Gatchaman heroes (also known as Battle of the Planets in the West) and Casshan (otherwise know as Casshern). But while the rest is made up of Capcom stars who mainly haven't appeared in anything recently or anime characters little known outside of Japan, each of the pugilists plays uniquely. Even characters who look like they could be the same model but with different skins--such as Tekkaman and Tekkaman Blade, and the two Yattermans--have totally different move sets. While this makes the transfer of learned skills from one character to another difficult, it does make for a varied fighting game with plenty of depth and replayability. Gold Lightan can be a tough assignment. There are also two playable ~giant~ characters on the roster, and due to their sheer screen-filling bulk, they appear solo only and never as part of a team. On the Capcom side, there's the PTX-40A mech from Lost Planet, while Tatsunoko has the gigantic lighter known as Gold Lightan (seriously). While they're slow, each of these behemoths deals serious damage even with basic attacks, although as single fighters they do have the disadvantage of not being able to recover any health. Despite this handicap, PTX-40A and Lightan can throw off the balance of the game. Experienced players will have no trouble getting past them, but inexperienced to average gamers may find them tough hurdles to overcome, even if they're being controlled by only moderately skilled human opponents. If you don't have a human opponent to challenge, then Tatsunoko vs. Capcom comes with four standard single-player modes: Arcade, Survival, Time Attack, and Training. There's no separate Story mode, although finishing the game in Arcade mode will give you a simple ending made up of text and still images for the character who dealt the finishing blow on the final boss. There are also two minigames: one is an extremely simple collect-all-the-letters activity during the end credits, and the other is a more fully featured four-player shoot-'em-up that can be unlocked only after a certain condition is fulfilled. The rest of the game's offline component is pretty bare-bones--being able to purchase new costume colours, stage backgrounds, and movies from the in-game store is the only other extra. While there may not be a slew of wacky minigames, there is online play in Tatsunoko, and it works quite smoothly. Both ranked and unranked matches are available, with wins in ranked matches earning you points and title promotions. Strong connections will result in practically seamless matches, and even games with opponents from the other side of the globe can run hassle-free. Most of the hassle in online comes from the bare-bones matchmaking process and the convoluted method of adding to your friends list. Apart from being able to filter for local or global matches, there's no option to see the available games when you're trying to find a game online; you're automatically paired up, so those finicky about playing against only opponents with good connections will have to try their luck. You can add anyone you come across with a good connection to a rivals list, which is a significantly easier thing to do than adding a friend to your friends list. To add a friend, you both need to exchange a unique 12-digit code found within Tatsunoko vs. Capcom. This process, of course, has more to do with how the Wii handles its online side and is not the fault of the game, but it's annoying nonetheless. Frank West is still American, but his voice has changed since Dead Rising. Tatsunoko vs. Capcom is easily one of the most impressive-looking games to grace the Wii to date. All of the characters are animated beautifully, and while stage backgrounds are a little plain, all of the various specials and hypers are presented with vibrant colours and particle-laden effects. Tatsunoko is a dynamic and pretty game to watch, and this is matched by great audio ranging from convincing battle effects to catchy music, with the highlight (or lowlight, depending on your taste) being a couple of upbeat J-pop tunes. And Japanophiles will be pleased that the original voices for all of the characters have made it across to the Western release of Tatsunoko, although Dead Rising protagonist Frank West does speak his lines in English. That Tatsunoko vs. Capcom is even getting a Western release is a major positive, considering the relative obscurity of some of the characters on offer. While the characters may not be popular, the game itself deserves to be, thanks to its top looks, tight gameplay, and deep mechanics, all covered in a layer of accessibility few fighting games can boast. While some balance issues and its lack of online options hold it back, Tatsunoko vs. Capcom: Ultimate All-Stars is still not only one of the best fighting games on the Wii, but also one of the best available on any current-gen system. While its user-friendly controls should prove appealing for the majority, Tatsunoko's 26-strong roster is less of a draw card, at least initially. Both sides have some pretty big names on the list: Capcom has Ryu, Chun Li, and Alex from Street Fighter; two Mega Man incarnations; and Morrigan from Darkstalkers. Famous anime studio Tatsunoko brings in three Gatchaman heroes (also known as Battle of the Planets in the West) and Casshan (otherwise know as Casshern). But while the rest is made up of Capcom stars who mainly haven't appeared in anything recently or anime characters little known outside of Japan, each of the pugilists plays uniquely. Even characters who look like they could be the same model but with different skins--such as Tekkaman and Tekkaman Blade, and the two Yattermans--have totally different move sets. While this makes the transfer of learned skills from one character to another difficult, it does make for a varied fighting game with plenty of depth and replayability. Gold Lightan can be a tough assignment. There are also two playable ~giant~ characters on the roster, and due to their sheer screen-filling bulk, they appear solo only and never as part of a team. On the Capcom side, there's the PTX-40A mech from Lost Planet, while Tatsunoko has the gigantic lighter known as Gold Lightan (seriously). While they're slow, each of these behemoths deals serious damage even with basic attacks, although as single fighters they do have the disadvantage of not being able to recover any health. Despite this handicap, PTX-40A and Lightan can throw off the balance of the game. Experienced players will have no trouble getting past them, but inexperienced to average gamers may find them tough hurdles to overcome, even if they're being controlled by only moderately skilled human opponents. If you don't have a human opponent to challenge, then Tatsunoko vs. Capcom comes with four standard single-player modes: Arcade, Survival, Time Attack, and Training. There's no separate Story mode, although finishing the game in Arcade mode will give you a simple ending made up of text and still images for the character who dealt the finishing blow on the final boss. There are also two minigames: one is an extremely simple collect-all-the-letters activity during the end credits, and the other is a more fully featured four-player shoot-'em-up that can be unlocked only after a certain condition is fulfilled. The rest of the game's offline component is pretty bare-bones--being able to purchase new costume colours, stage backgrounds, and movies from the in-game store is the only other extra. While there may not be a slew of wacky minigames, there is online play in Tatsunoko, and it works quite smoothly. Both ranked and unranked matches are available, with wins in ranked matches earning you points and title promotions. Strong connections will result in practically seamless matches, and even games with opponents from the other side of the globe can run hassle-free. Most of the hassle in online comes from the bare-bones matchmaking process and the convoluted method of adding to your friends list. Apart from being able to filter for local or global matches, there's no option to see the available games when you're trying to find a game online; you're automatically paired up, so those finicky about playing against only opponents with good connections will have to try their luck. You can add anyone you come across with a good connection to a rivals list, which is a significantly easier thing to do than adding a friend to your friends list. To add a friend, you both need to exchange a unique 12-digit code found within Tatsunoko vs. Capcom. This process, of course, has more to do with how the Wii handles its online side and is not the fault of the game, but it's annoying nonetheless. Frank West is still American, but his voice has changed since Dead Rising. Tatsunoko vs. Capcom is easily one of the most impressive-looking games to grace the Wii to date. All of the characters are animated beautifully, and while stage backgrounds are a little plain, all of the various specials and hypers are presented with vibrant colours and particle-laden effects. Tatsunoko is a dynamic and pretty game to watch, and this is matched by great audio ranging from convincing battle effects to catchy music, with the highlight (or lowlight, depending on your taste) being a couple of upbeat J-pop tunes. And Japanophiles will be pleased that the original voices for all of the characters have made it across to the Western release of Tatsunoko, although Dead Rising protagonist Frank West does speak his lines in English. That Tatsunoko vs. Capcom is even getting a Western release is a major positive, considering the relative obscurity of some of the characters on offer. While the characters may not be popular, the game itself deserves to be, thanks to its top looks, tight gameplay, and deep mechanics, all covered in a layer of accessibility few fighting games can boast. While some balance issues and its lack of online options hold it back, Tatsunoko vs. Capcom: Ultimate All-Stars is still not only one of the best fighting games on the Wii, but also one of the best available on any current-gen system."}