{"ref": "https://www.gamespot.com/reviews/mission-impossible-operation-surma-review/1900-6085309/", "date": "December 9, 2003", "game_name": "Mission: Impossible: Operation Surma", "text": "It's a pretty safe bet by now that the stealth genre is here to stay, and adding even more fuel to the hide-and-seek fire is Mission: Impossible: Operation Surma, a new stealth action game from Atari and developer Paradigm. As you'd expect, the game isn't based on the old television series Mission: Impossible but rather on the more recent, successful action movie franchise starring Tom Cruise. You won't see Cruise's likeness representing main character Ethan Hunt here, but you will see an entirely new storyline created specifically for the game. Operation Surma takes no big chances with the genre's rules--it's strictly stealth-by-numbers that's highly reminiscent of last year's Splinter Cell--but it's a well-made and entertaining game all the same. Ethan Hunt's back for a new mission in M:I: Operation Surma. Mission: Impossible: Operation Surma contains some primary characters that will be familiar to fans of the films. You play as Ethan Hunt, the masterful operative and all-around human Swiss army knife that goes out into the field and gets the job done for the IMF (Impossible Mission Force). Your support consists primarily of computer expert Luther Stickell, played by Ving Rhames in the films. Unlike Cruise, Rhames does lend both his likeness and his voice talent to the character of Luther, which makes him seem a little more authentic (and badass). Transport guy Billy Baird will also be at your disposal, as will two new characters: Spelvin, a friendly con artist, and Curry, a rookie IMF agent. The storyline is the standard ~Tom Clancy lite~ stuff you see in most stealth games these days--lots of political and technological intrigue involving shadowy multinational groups and third-world government figures. It's not bad, by any means, just typical, and it'll sufficiently entertain you as it moves you from one location to the next. The gameplay in Operation Surma ought to be pretty familiar to you if you've played games like Splinter Cell. You creep around all manner of enemy compounds, sticking to the shadows to avoid being seen and engaging enemies silently and only when necessary. Hunt also has a whole ton of gadgets at his disposal, which run the gamut from old stealth standbys, like night vision and a tranquilizer pistol, to more interesting fare, such as the sonic imager, which effectively lets you see through closed doors, and the electronic warfare gun (EWG), a multifunction pistol that can disable security cameras, deliver sound decoys, and tag unsuspecting people with a homing device. The gadgets are easily accessed from a convenient HUD, and the levels do a good job of mixing up the circumstances so that you'll need to use your devices intelligently to get around. Most stealth games discourage you from engaging in direct combat, and so does M:I: Operation Surma, but once it comes down to fisticuffs or a firefight, the game allows you a little bit more leeway than some other games in the genre. If you should be discovered, Ethan can pull off a pretty effective punch combo and a running jump kick that will quickly immobilize an enemy. If you're fast enough, you can knock out the alerted guard and hide his body without raising alarms elsewhere. In the rare instances when you'll actually trade gunfire with opponents, the game switches to an over-the-shoulder aiming mode that's easy to control and gives you a pretty fair shot at taking out the bad guys. Granted, there are still a fair number of situations where tripping an alarm or alerting the guards means you'll have to revert to the last checkpoint, but it's nice to sometimes have the option to pull yourself out of whatever mess you've made. Of course, as a more or less cookie-cutter stealth game, Operation Surma is susceptible to the problems inherent in the genre. Primarily, there's a lot of trial and error involved in figuring out what you need to do next. The HUD does feature a map that indicates where your next objective is, so you're pretty well guided, but getting from point A to B can sometimes be a frustrating exercise. The minimap doesn't show you nearby enemies (unless you tag them with the EWG), so it can be difficult to move through an area without getting spotted. When you make it through an area on the first try, it's gratifying, but as often as not you'll fail at least a time or two. If you pound on any given situation enough times, you'll eventually figure out precisely how to get through it, but a little more dynamic gameplay would have been nice. Mission: Impossible: Operation Surma is a pretty good looking game. Surprisingly, there isn't a whole lot of difference, in visual quality or in frame rate, between the PlayStation 2 and Xbox versions of the game. The game has nicely detailed characters (especially Ethan), mostly pleasing level design, and the occasional pretty graphical effect (such as reflections on wet pavement). There are also some environmental shadows at work, which are both fun to look at and functional, since you can hide in them to evade roving enemies. The game suffers from noticeable frame rate drops in some larger areas, which is a little annoying, and there's nothing of staggering aesthetic genius at work, but Operation Surma does a good visual job overall. The game adheres to the same old stealth formula, but it does its thing well. The game's sound is pretty great across the board. As mentioned, Ving Rhames' voice leads the cast, and he's quite good at reprising the character of Luther from the films. The Ethan Hunt character here looks and sounds nothing like Tom Cruise--in fact, he sounds disturbingly similar to Michael Ironside's gruff, gravelly Sam Fisher in Splinter Cell. The voice is done well enough, at any rate, so that's not too big an issue. The game's other actors aren't extremely noticeable, but they get the job done decently. The sound design is also imaginative, with decent little whiz-bang effects powering the gadgets and so on. Finally, there's not a whole lot of music, but what's there is quite atmospheric (without intruding on the action) and provides a nice backdrop for the stealthy goings-on. Mission: Impossible: Operation Surma is a game with a clear-cut audience. If you've played and enjoyed games like Splinter Cell and find yourself hungering for more, you'll find exactly what you're looking for with Operation Surma. Then again, if you loathe the very idea of stealth action, stay far away from this one. It's a good, solid game that doesn't take any chances whatsoever, and though it only contains a core single-player campaign that's good for one or two plays, it's a fun game while you're playing it. Just don't expect any genre-bending innovations and you'll be fine with Mission: Impossible: Operation Surma."}