{"ref": "https://www.gamespot.com/reviews/carmen-sandiego-the-secret-of-the-stolen-drums-rev/1900-6109134/", "date": "September 28, 2004", "game_name": "Carmen Sandiego: The Secret of the Stolen Drums", "text": "Let's get one important thing out of the way right out of the gate: If you're expecting Carmen Sandiego: The Secret of the Stolen Drums to be anything like the Broderbund-developed Carmen Sandiego edutainment games of old, you're going to be phenomenally disappointed by what this game has to offer. In fact, even if you're a fan of this game's genre--3D platformers--you're still going to be disappointed. The Secret of the Stolen Drums is a mediocre game across the board, offering nothing new or even remotely entertaining and instead putting you through the paces of Generic Platformer 101. This isn't the worst game you'll ever play, but that doesn't mean it's worth your time. Where in the world is the educational or entertainment value in Carmen Sandiego: The Secret of the Stolen Drums? In this latest Carmen Sandiego adventure, you play as Cole Gannon, an in-training operative of the ACME detective agency who must track Carmen across nine countries on the hunt for a set of stolen tribal drums that will unlock the key to some form of ultimate power, and so on and so forth. Those of you with high hopes of being able to track Carmen the old-fashioned way--with some solid geography education--are going to be brutally rebuffed. There is no real educational element to Stolen Drums, save for a few blurbs before each new level that give you a brief tutorial on the country you're about to visit. However, none of this information ever comes into play during the game, and really it's about the educational equivalent of tossing a carrot stick into a bowl of Lucky Charms for added nutrition. It makes little to no impact. As a 3D platformer, Stolen Drums gives you all the obligatory abilities, like double jumping, a basic weapon to attack with (a big stick, in this case), and a couple of little special abilities, like a pole-vault maneuver you can use to traverse larger gaps. You can also go into ~stealth mode~ on command, which is supposedly necessary against certain enemies who can be attacked only from behind (specifically, enemies of the robot variety--yes, Carmen Sandiego has robots now). Fortunately, their artificial intelligence is generally very bad, so if you are spotted, you simply need to duck behind the nearest corner and they'll lose track of you. The stealth mechanics aren't the only irritating thing about the gameplay, either--there's also the horrid control of Cole. The analog control of Cole's movements is extremely loose, which ultimately leads to a whole lot of missed jumps, simply because you can't get a good hold on Cole. If it weren't for these control hang-ups and periodic moments of poorly executed stealth gameplay, Stolen Drums would be an exceptionally easy game. Despite offering you an array of gadgets to use--such as a map, a GPS system to track Carmen's movements with, and a communication system to talk to your fellow ACME agents with--the game doesn't really ever factor them into the gameplay. For example, the GPS system is entirely based on collecting a series of ~clues~ throughout each level, and nothing more. There is no requirement on your part to actually track down Carmen, as it's done for you once you pick up all the items. Other than picking up these items, all you really have to do from level to level is solve a few idiotically simple puzzles, beat up a few bad guys, and then move on to the next level. Five hours later, you're done, and no better for it. The members of Rockapella are rolling over in their graves, and they're not even dead yet! There's very little to say about Stolen Drums' presentation, as it's fairly obvious that neither graphics nor sound were a big focus during this game's development. The look of the game is somewhat similar to the old Where on Earth Is Carmen Sandiego? cartoon series, featuring a few animated cutscenes of middling quality here and there. The in-game visuals are pretty bare-bones, with minimal amounts of animation and similarly bland level designs. Even the technical aspects, like the frame rate and camera, don't hold up. Little bouts of frame-rate drop pop up all over the place in all three versions of the game, and the freewheeling camera is just plain bad, getting hung up on pieces of the scenery constantly, and never moving into a proper angle no matter what the situation. Of further note, there are no appreciable differences between the three console versions of Stolen Drums, control-wise or graphically--so you're going to experience the same issues across the board. The only real audio of note in the game are the bouts of dialogue between Cole, his colleagues, and Carmen that you'll encounter from time to time. None of it is very good, but it isn't the most awkward voice acting you'll ever hear. It's plainly obvious that The Secret of the Stolen Drums is aimed squarely at younger gamers, but even so, this game is pretty unimpressive. The controls are likely to frustrate younger players even more than experienced platformer fans, and the lack of even a modicum of challenge and the relative brevity of the game make this a pretty lousy package overall. To sum it all up, don't go into The Secret of the Stolen Drums thinking you're going to get an educational game or an enjoyable platformer, as you'll find neither here."}