{"ref": "https://www.gamespot.com/reviews/lego-battles-review/1900-6215283/", "date": "August 13, 2009", "game_name": "LEGO Battles", "text": "Recent Lego video games have featured gameplay that is cutesy and kid-friendly but still solid enough to appeal to more seasoned gamers. Lego Battles tries to take this trend into the realm of real-time strategy, embracing the basic concepts on which many successful RTS games are built. Resource acquisition, building construction, unit production, and combat are the main gameplay elements here, and the game bears strong similarities to early RTS games like Warcraft: Orcs & Humans. Sticking with what works is generally a good thing, and Lego Battles does that well enough to appeal to folks who don't have much RTS experience. The downside of imitating a 15-year-old game is that Lego Battles lacks the sophistication to appeal to a more experienced audience. The vexing pathfinding issues and slow-witted friendly AI are often frustrating, but the solid core mechanics and humorous Lego charm make the light strategy of Lego Battles fun and rewarding. There are six different campaigns in Lego Battles, each featuring a different Lego faction. Medieval knights, skeleton warriors, pirates, an imperial navy, astronauts, and aliens each have a unique campaign that takes a couple of hours to finish, making for a robust amount of single-player content. Each faction is set against another, and these rivalries create some interesting situations. For example, at the beginning of the astronaut campaign you are tasked with capturing an alien specimen. Meanwhile, in the alien campaign, you are miffed to learn that some strange creatures have run off with your buddy, so it's off to the rescue. These mission briefings are often amusing, and there are a few cutscenes per campaign that contain the uniquely charming humor found in recent Lego adventure games. Each campaign begins with easy missions and slowly ramps up the difficulty, and the first available campaign has an extensive tutorial that walks you through pretty much every aspect of the game. In order to construct buildings and recruit soldiers, you'll need bricks. You can earn bricks by building a mine, but not all maps have a conveniently located mine site. Given that, your main brick supply will usually come from chopping down trees and carrying the logs back to your castle or your yield-boosting lumber mill. The castle is your home base where you can replace a fallen hero and recruit builders, who are the only units that can harvest trees and build structures. There are structures that produce units (barracks, special factory, and shipyard) and fortifications that help you defend your territory (walls and towers). You won't need or be able to build all these structures on every map (bridges, for example, are rarely needed), but they will all come in handy at some point in your campaigns. Constructing a bustling brick-reaping, unit-producing settlement gives you a great feeling of progressively becoming more powerful, and you'll soon be ready to extend your influence out into the world. Building a barracks lets you recruit a few different kinds of troops, and as you amass your army you need to build farms to feed them all. Each farm supplies four regular units (such as soldier, archer, or knight) and one special unit (such as boat, tank, or dragon), and you can have a maximum of 20 regular units and 4 special units in any given level. You can explore the map and battle enemies by selecting a maximum of nine units with the stylus, then tapping a location or enemy. While this may sound simple, your movements are complicated by the fact that your units aren't very good at navigating the map. If you tell them to cross an open landscape, they'll do fine. But if you send them around a bend, some of them will get hung up on the scenery and forget what they were doing in the first place. Narrow bridges and winding paths are even more problematic. You can tap the destination at regular intervals during your units' journey, reissuing the movement command and making sure all your units arrive, but this gets tedious and makes it aggravating to manage more than nine units at a time. Recruiting and assembling a spaceman strike force. Fortunately, a squad of nine units is usually sufficiently large enough to achieve your objectives, provided you manage them well. The most important combat element is your lone hero character. This unit not only has much more health than all the others, but can cast spells that can give you a significant edge in combat. You can boost your nearby allies' attack or defense strengths, or attack your enemies directly with fireballs or laser strikes, depending on your hero. Perhaps most crucial is the hero's ability to heal any friendly units in the immediate vicinity. Attacking in a tight cluster means that your hero will be constantly replenishing your army's strength and can cast area spells that benefit every unit. By attacking this way, occasionally regrouping to fully heal, then attacking again, you can get the best of all but the most staunchly defended enemy outposts. Most of the time you can execute this strategy and reap a satisfying victory. However, your not-so-bright units also have some trouble in combat. If you tap on an enemy unit or structure while your units are selected, they will usually attack without issue. If that unit happens to be around a corner, some of your ranged units will start shooting at the enemy but not recognize that there are impenetrable trees in the way. Most enemy units are pretty small on the touch screen, and you can easily click right next to them and issue a move command instead of an attack command. Your army will run right up next to the enemy, but not necessarily begin attacking. Units who are attacked will usually fight back, but allies will often stand next to a battling teammate and twiddle their proverbial thumbs. This is merely annoying in small encounters, but it can be absolutely devastating in large assaults when you need every unit you have. Bizarrely, sometimes allies will get feisty only when you try to retreat to regroup and heal. Halfway to the destination, they will turn around and sprint back toward their assured demise. During some missions these miscues can cause you to fail outright, but even when you can rebuild and take another stab, it's still frustrating. Captain Brickbeard heals his fleet before sending them off to harry naval transports. Missions aren't particularly long, so even having to restart one doesn't sting too badly. Primary objectives are reasonably varied, including destroying enemy camps, rescuing allies, searching for treasure, moving your force from point A to point B, and defending against enemy onslaughts. Once you achieve victory, you can continue exploring the map for as long as you'd like in order to find all the Lego studs, minikits, and red bricks that are scattered about. Collecting these items will allow you to unlock concept art and cheats, as well as maps and characters for multiplayer matches. Lego Battles features multicard wireless matches for up to three players. Battles against humans are much more engaging, and there are a wide variety of maps, as well as three different victory conditions to choose from that favor different strategies. Players can customize their rosters from the characters they've unlocked, allowing you to field pistol-wielding pirates alongside skeletal knights. Among each class of soldier there are slight attribute differences, though the unlockable characters aren't necessarily better than the default ones. There is also a broad variety of heroes, each featuring different attributes and different spells. Tweaking your army can give you an edge in a hotly contested match, and ensures a satisfying degree of replay value. In-game achievements add an extra goal to strive for, ensuring that you'll be reaping rewards even after you've spent hours and hours with Lego Battles. The movement and combat issues can certainly be vexing, but with some diligent stylus work you can bull your way through the frustration. And it's worth it, because the solid fundamentals make this game fun and satisfying, and the Lego silliness adds a welcome spark of humor. It's not complex enough to satisfy seasoned strategy buffs, but Lego Battles offers a lot of enjoyable action into a small package."}