{"ref": "https://www.gamespot.com/reviews/jaws-unleashed-review/1900-6151939/", "date": "May 26, 2006", "game_name": "Jaws Unleashed", "text": "Displayed on the various loading screens of Jaws Unleashed are a number of trivia bits pertaining to the original Jaws film. One particularly excellent piece of trivia cites that the writer of both the Jaws novel and screenplay, Peter Benchley, never would have written the original story had he known anything about realistic shark behaviors. But while history has been kind to Jaws' legacy, in spite of its creative liberties, Jaws Unleashed, the action game based on the film license and developed by Appaloosa International, won't be getting any such pass. And Appaloosa doesn't get to excuse its awful game by claiming not to know anything about making a fun action adventure starring an ocean-based lead character, either. This is the maker of the Ecco the Dolphin games, otherwise known as some of the best underwater adventures ever put on consoles. Jaws Unleashed is, in every imaginable way, the anti-Ecco. Instead of saving humanity, you're chomping down on it with sharp, angry teeth, and instead of finding yourself having a breezy, enjoyable time with the game, you'll find yourself cursing at Jaws Unleashed's awful controls, even worse camera, and completely idiotic missions. There is certainly a measure of visceral entertainment to be derived from being able to tear into unsuspecting prey... Jaws Unleashed takes place 30 years after the events of the first film. The days of the malcontent shark have all but been forgotten, and Amity Island has returned to its days as a thriving township. But when a major corporation comes to town to do something entirely corporate and anonymously evil, the local marine population is disturbed, and along comes yet another gigantic shark (or is it the same one, 30 years later?) to lay waste to the populace and wreak havoc on the island. The setup for the shark-biting action is flimsy at best; but then again, this isn't really a game you'd ever play for its story, and the developers had to find some way to tie the Jaws license into this whole thing. You can't really blame the Jaws license for sinking this game. This is not some hastily tossed-together cash-in on a classic movie. This game was originally announced back in 2003 as Sole Predator, and was a completely license-free shark-based action game long before the Jaws license came along. So without the license to blame, all you're left with is an entirely poor game design. In theory, it's not a bad idea for a game. Jaws Unleashed takes the concept of an open-ended game world and simply makes it an underwater adventure. It also takes the sort of freeform ultraviolence of something like the Grand Theft Auto series, replacing guns with rows and rows of sharp teeth. Once you get past the first mission, you can go just about anywhere on Amity Island and eat just about anyone or anything you want, be they people, dolphins, seals, or anything else with an ounce of blood in it. Not to mention that you can destroy various pieces of the scenery and take part in some side missions. While that might sound like a hoot, every other aspect of the game design conspires to wreck the experience. For starters, the game controls are just awful. Jaws starts out with a few basic moves, including a basic bite, a charge-up head-butt attack that's good for wrecking boats, docks, and the like, and a slightly less damaging but still reasonably effective tail whip. You can earn new moves over time, too. But the problem with the basic moveset given to Jaws is that the shark just doesn't handle well. It's not necessarily surprising that a big, lumbering shark, traveling at full speed through the water, might blow past a target or have trouble lining itself up for a precise attack, but it doesn't make it any less frustrating in this game, when so many of your mission objectives and attacks require a degree of precision that simply isn't there. Not to mention that some of the things Jaws can do are just ridiculous. One of the things you'll actually find yourself doing a lot in the game is having Jaws jump out of the water and onto dry land to grab some poor, unsuspecting schmuck. And it isn't like Jaws just throws his head out long enough to grab the guy and sink back into the water--Jaws actually beaches himself in most cases, and you use the swim button to make him wriggle his way back ever so slowly into the water. He can survive for only a limited number of seconds, but watching this unbelievably silly act is no less mind-blowing to watch--nor any less frustrating when he gets stuck on some invisible piece of scenery and can't make it back to the water in time. The in-game camera makes matters even worse. Enemies come from all directions in Jaws Unleashed, and trying to position the camera in such a way as to make it so you're not constantly getting nailed from behind is a near impossibility. It's even worse because the game constantly forces you to feed on enemies to maintain your hunger level (if it drops too low, you die), but when you're getting constantly sideswiped by enemies you can't see, and you can't properly steer yourself into an opportune position to snag a meal fast enough, you're going to find yourself extremely flustered. It's even worse when you're swimming near surface level. The camera snaps beneath and above the water depending on where you're at, and if you get too close to the surface while trying to snag something or perform an attack, the camera will snap to the surface view, which totally obscures your ability to see if you hit what you were after, and to even get the camera back to a normal position, you have to swim down a ways. You might be willing to struggle with the controls if the game provided missions that were entertaining in the slightest. Jaws Unleashed does nothing of the sort. For what it's worth, there is a measure of entertainment to be found in Jaws' missions, but it's purely unintentional hilarity. Take, for example, the very first mission objective you're handed. You're trapped in a science lab, and in order to escape, a door must be opened. Normal Jaws logic would dictate that simple brute force would get you out, but no, not in Jaws Unleashed. Here, you have to grab a nearby scientist, drag him into the water, swim over to a nearby key card reader, swipe his body past it, and thus, open the door. And this is hardly the only example--the game is littered with scenarios in which you're picking up exploding barrels with your mouth to toss at enemies (inexplicably, the barrels catch on fire the moment they leave your jaws), and murdering orca whales inside theme parks so that a magic door will open instantly the second that orca dies. Maybe it's asking for too much to expect a total reenvisioning of the action game paradigm in a budget, movie-licensed game, but Appaloosa failed to think anywhere even resembling outside the box on this one, instead slavishly dedicating itself to recycling the same trite, boilerplate action-game mission designs that have been done to death in other games and furthermore, seem ludicrously out of place in a game starring a wild shark. It's not even done with a hint of irony or humor. ...But in a game this poorly designed, that visceral entertainment turns into frustration and boredom pretty quick. Jaws Unleashed's presentational aspects are better produced than anything the gameplay has to offer, but that isn't to suggest they're any good. Expectedly, the most graphical detail is shown in the Jaws model, and it is a pretty good-looking shark by any standard. It animates well, looks natural swimming, and basically does what it needs to in order to look like a big, mean shark. The underwater environments have their charm, too. You'll see lots of little schools of fish, groupings of dolphins, and other assorted undersea bric-a-brac swimming about--although you won't see any of it until it's practically right in front of you, as the game has a terrible draw distance. Once you get out of the water, things fall apart. The people in the game just look bad, and the environmental designs above water just look cheap. The frame rate also completely tanks in certain underwater situations, especially when lots of air bubbles start appearing during a thrash-heavy battle. It seriously goes into single-digit territory on both platforms. The frame rate actually seems a little worse on the Xbox version, though the Xbox version also has slightly cleaner overall visuals compared with the PS2 version, so there is a tradeoff. There are also plenty of random animation glitches and random bugs to give the game something of an unfinished feel--it even crashed on us a couple of times while we tried to exit missions. On the audio front, there's some decent orchestral music going on in the background, but beyond that, it's just cheesy voice acting and some underwhelming sound effects and screams. And even the musical score isn't that great, especially considering the theme music the game uses isn't the original track from the movie, but rather a new orchestration of it that sounds a little cheesier. There's certainly a measure of morbid thrill that can be derived from some of the more open-ended components of Jaws Unleashed. A novel level of enjoyment exists in the notion of swimming up to an unsuspecting oceangoer and sinking your teeth into them, dragging them screaming beneath the waves and turning them into a midday snack. However, the novelty of said action wears off about 15 minutes into Jaws Unleashed, and without it, all you're left with is a really lousy action game that's cumbersome to play, contains not a single interesting mission over the course of its roughly 10-hour structure, and looks and sounds terribly mediocre. The $30 price tag might seem enticing, but $30 for a bad game is no deal at all."}