{"ref": "https://www.gamespot.com/reviews/far-cry-instincts-predator-review/1900-6147034/", "date": "April 3, 2006", "game_name": "Far Cry Instincts Predator", "text": "Far Cry Instincts was one of the best games released on the Xbox last year. It was also one of the most demanding, and you could easily tell that the Xbox was being pushed to its limits. Unfortunately, Xbox 360 owners looking to run the game on their next-generation consoles haven't had any luck; the game isn't currently backward compatible with the Xbox 360. Enter Far Cry Instincts Predator, a convoluted name for what is essentially an Xbox 360 version of Far Cry Instincts, along with a new campaign and enhanced multiplayer support. Jack Carver and the jungle, two good things that are great together. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Far Cry Instincts Predator Video Review There's a lot of gameplay in Predator. The first campaign tells the tale of how Jack Carver, a retired Navy commando now a charter-boat captain, gets stranded on a remote Pacific island where a mad scientist is doing his best Dr. Moreau impersonation, creating human-animal hybrids. Along the way, Jack himself is injected with the mysterious serum and becomes an incredibly lethal killing machine, adept with both guns (lots of them) and his animal powers to tear people to shreds. If you missed out on Far Cry Instincts the first time around, you're in for a treat, because there's a reason why this is one of the best shooters on the Xbox. Far Cry Instincts combines traditional run-and-gun gameplay with a healthy amount of skulking around a jungle. You can stealthily infiltrate enemy compounds, set up elaborate traps in the bushes, and sneak up behind guys and knife them in the back. Along the way, you'll be able to haul around in a variety of vehicles, from pick-ups to boats to even a hang glider. The new campaign is more like an expansion than a full campaign, as it's about half the length of the original. Still, considering that the original campaign was easily at least 10 hours long, there's about five to six hours of content here to enjoy. In this new campaign, Carver still finds himself down on his luck in paradise when he meets Kade, a beautiful woman who hires him to act as muscle for a gun-running deal she has going with the local warlords. Of course, something goes wrong, and before too long, Carver finds himself once again on the run in the jungle, battling rebels as well as a tribe of animal-human hybrids who leap about like characters from Crouching Tiger, Hidden Dragon. Maybe it's the sense that we've done this already before, or maybe it's some of the contrived gameplay mechanics that rear their ugly head, but this new campaign doesn't measure up to the original. For instance, enemies have a constant habit of instantly spawning next to you (so much for sneaking around the jungle), and in some cases, there are unlimited waves of them, a not-so-subtle hint to move on. Then there are the numerous jumping puzzles that border from mildly annoying to downright frustrating. With that said, there's some good stuff in the new campaign as well. One of our issues with the original campaign was that it was fairly linear. The new campaign introduces a couple of wide-open environments that let you tackle the objectives any way you'd like, and you have to hunt around a bit to figure out what to do, which gets rid of some of the hand-holding inherent in most shooters. The artificial intelligence seems a bit sharper than before, and you'll see guys duck behind cover, though they'll still also be inclined to charge at you. Meanwhile, you can play around with a bigger arsenal, including Molotov cocktails, and there's nothing more enjoyable than setting a bad guy on fire and then watching him run toward you in panic. There are a few new vehicles as well, but the corny vehicle physics remain unchanged from the original game. In particular, the physics seem a bit too loose; there's too much bump when you hit objects, as if you're driving around in bumper cars. When you're done with the two single-player campaigns, there's a full-featured multiplayer suite to delve into. The original multiplayer levels are all here, along with a number of new maps based on the Predator campaign, including Shanty Town, an elevated fishing village. Multiplayer modes still feature deathmatch and team deathmatch, as well as capture the flag (steal the sample) and predator mode, in which one player gets animal powers and the rest don't. One of the nice features about the game is the built-in map editor, which makes making and sharing maps incredibly simple. Indeed, there's about an equal split between official and user-made levels on Xbox Live, and downloading new levels is seamless and automatic. The new campaign isn't as good as the original campaign, but it still has its share of moments. There's no denying that Predator looks good, with its incredibly lush jungle environments. However, there's little question that the game could look a lot better. Frankly, it seems just like a high-res version of the original Xbox game at times, a fact that you're reminded of whenever you see the horribly blocky weapons models, or the incredibly plastic-looking characters, or some downright low-resolution textures. On a standard-definition display, it's hard to distinguish Predator from the original Xbox version. Things get somewhat better on a high-definition screen, but the sharpness also emphasizes some of the low-polygon models. The audio still sounds good, from the primal techno music to the subtler sound effects. However, the mixing seems off, particularly during cutscenes, and it's hard to hear some of the dialogue at times. If you didn't play Far Cry Instincts on the Xbox last year, then you'll definitely get a lot of value out of Predator, since you're effectively getting two games as well as the multiplayer suite. This is a good package that offers a ton of excellent content to chew through, especially if you're trying to unlock the myriad achievements. Far Cry Instincts veterans, on the other hand, may balk at the full price--in which case you have some good news. You can pick up the Xbox version of Predator (titled Far Cry Instincts Evolution) and get just the new campaign, at a lower price. (You also won't have to play through the original campaign again to unlock the new campaign). And on a standard-definition display, it'll be hard to tell the difference, anyway."}