{"ref": "https://www.gamespot.com/reviews/raiden-fighters-aces-review/1900-6210340/", "date": "May 27, 2009", "game_name": "Raiden Fighters Aces", "text": "Originally released in arcades between 1996 and 1998, the three Raiden Fighters games were conventional but very solid vertically scrolling shooters. Now, all three titles have been compiled and released as Raiden Fighters Aces, and the quality of these games makes them as competent now as they were back in the day. With a low price tag and a terrific number of options for customizing the experience, Raiden Fighters Aces has a decent bang-to-buck ratio that makes it a worthy addition to the library of any shoot-'em-up fan. Each Raiden Fighters game plays out in essentially the same way. You pick from an assortment of aircraft of varying power and speed and then take to the skies to destroy an overwhelming onslaught of enemy planes, tanks, and ships, along with the occasional massive boss war machine, dodging the shower of bullets sent your way all the while. As you destroy enemies, you can pick up laser or missile power-ups, which determine whether your aircraft currently has its laser weapon or missile weapon available, and you can acquire slave ships that follow you around and increase your firepower. You also have a limited number of devastating bombs at your disposal. There's nothing innovative or unusual about these shooters, but they have an unflagging intensity and level of craftsmanship that make them memorable. On the default settings--three credits, normal difficulty--the games offer a serious challenge, though not one that can't be overcome with plenty of practice, memorization, and sheer bullet-dodging skill. However, you can alter the settings to give yourself as few or as many credits as you'd like and choose from seven difficulty levels, so regardless of whether you want the relaxing satisfaction of tearing through the opposition effortlessly or a pulse-pounding one-in-a-million shot at taking down an overwhelming enemy force, Raiden Fighters Aces can deliver. In addition to the three core games, there's a boss rush mode, an expert mode in which defeated enemies send bullets at you as they explode, a customizable training mode, and a time-limited score attack mode. You can also play a ranked game in the arcade, boss rush, or bullet-crazy expert game types, though you're limited to a single credit and to either normal or arcade difficulty. The leaderboards nicely rank you both against all other players and against only those who used the same ship. And should you want to know how those at the top achieved their high scores, you can view their complete play-throughs, which is a helpful feature if you're keen on improving your game. Sadly, if you want to play these games with a friend, you'll need to be in the same room, because online cooperative play is strangely absent. As you'd expect, taking on the enemy forces with a wingman is more enjoyable than flying solo. You can employ different tactics when coordinating your attacks with a buddy, and there are certainly more than enough enemies to go around. Turns out shooting things and then seeing them blow up can be fun. Who knew? The visuals for the Raiden Fighters games exude an imaginativeness and a flair for the dramatic that make them a delight, even today. You'll soar over fog-covered forests and snowy train yards, through lightning storms and blood-red skies, as your lasers or missiles fill the screen with your exploding enemies. The stars of the show are the bosses--huge tanks, screen-spanning battleships, planes twenty times the size of yours--which gradually get more and more damaged by your attacks until they finally blow up in spectacular fashion. The graphics here are arcade-perfect and offer as impressive an array of customization options as the gameplay. You can set the game speed to 60 frames per second or go with the 54fps rate of the arcade machines. You can choose from a number of smoothing options or leave the graphics in all their pixelated glory, and you can turn on a scanline emulation effect that will make the experience all the more nostalgic if you first encountered these games during their arcade heyday. If you're willing to stand your widescreen TV on its side, you can rotate the game screen to maximize the amount of space taken up by the action, or you can play it as a side-scrolling shooter, though it feels awkward to do so. There's also an assortment of options that more dramatically impact the visuals, mimicking how the game would look in a cabinet with a busted projector, in monotone or sepia, and the like, though these are more novelty options than anything else. The music can't be altered or customized, but it's terrific as it is. The catchy, exciting techno tunes heighten the intensity of the action. The sounds of weapon fire and explosions are standard fare, but they get the job done. It's a good thing there are so many customization options, because there really isn't a whole lot of game to these games. Each of them can be completed in 20 minutes or so, but the quality of that time, and the variety of ways in which it can be experienced, make this compilation worth coming back to time and time again. Twenty bucks for three decent shooters from the arcades of yesteryear isn't a bad deal."}