{"ref": "https://www.gamespot.com/reviews/harry-potter-and-the-half-blood-prince-review/1900-6212842/", "date": "July 1, 2009", "game_name": "Harry Potter and the Half-Blood Prince", "text": "Although the Harry Potter novels are some of the finest fantasy works around, the famous wizard's foray into other media has been met with uneven success. The movies based on these books dont contain all the story details, but they have been saved by their fantastic special effects and beautiful art direction. Unfortunately, their video game counterparts have struggled to capture the brilliance of the books. Half-Blood Prince continues right where 2007's disappointing Order of the Phoenix left off. An accurate representation of Hogwarts is the main draw, but simple gameplay and a lack of any coherent storytelling mar the whole experience. For fans of the books, there is a certain joy in tromping around the weathered school grounds and dueling death eaters, but the Half-Blood Prince ultimately feels like a half-finished game. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Harry Potter and the Half-Blood Prince Video Review The story is barely comprehensible if you haven't read the book beforehand. There are a couple of references to the titular Half-Blood Prince whose notes dot Harry's potions book, a trip or two through Dumbledore's memory to see the young Tom Riddle, and a quick peek at Harry's ever-growing suspicion of Draco Malfoy. But you'll have to fit these pieces together yourself because the game doesn't spend any time filling in the details. The cutscenes are not only short and sporadic, but they are also poorly acted and look awful. None of the movie's actors lend their voice talents, so you'll have to make do with sound-alikes who sound little like the real people. The character models are based on the actors but are poor imitations of their real life counterparts. Hermione's long hair hardly moves, Professor McGonagall is cast in perpetual shadow, and Albus Dumbledore has trouble moving his lips. Furthermore, the game's plot takes liberties with the source material, putting Harry in preposterous positions that clash wildly with the book. Order of the Phoenix was the first game in the series to faithfully re-create Hogwarts, letting players explore its many hidden alcoves and winding passageways at their leisure. For people who have not played the previous adventure, it can be a kick to walk around the world's most famous fictional school, navigating the moving staircases and taking shortcuts through the many portraits that line the walls. But if you've already played Phoenix, there's very little new to see in Half-Blood Prince. The environment is nearly identical to the last game's so series veterans will find no new thrill in checking out Harry's school. At least it's easier to find your way to your next objective this time. You can summon Nearly Headless Nick any time you're lost, but you'll still spend way too much time backtracking. Aside from running all around the school grounds (complete with unnecessary motion blur), you partake in three different wizard-themed activities. Seeing as the Half-Blood Prince has greatly improved Harry's potion-making ability, you'll be spending a lot of time in the potions dungeon, brewing up a number of tasty concoctions. This plays like a magical version of Cooking Mama, placing a number of ingredients in front of you with the recipe lining the side of the screen. Potion creation makes good use of the motion controls, letting you pour, stir, and heat your mixture with a few logical gestures, and it is cool to combine the often gross ingredients into something even viler. However, you'll need to make so many potions throughout your quest that you'll wish you could slip one of your classmates a few Bertie Bott's Every Flavor Beans to prepare them for you. What starts as a simple though entertaining minigame quickly reaches tedium as you go through the same motions over and over again. Quidditch makes a return after a brief hiatus in Order of the Phoenix, but it's less imaginative and even less fun than making potions. You play as a seeker, Harry's chosen position, and once atop your broomstick, you need only worry about flying through hovering stars in the sky. The controls are extremely simple--use the pointer to place your cursor in the center of a star and let Harry worry about the rest. When you zoom through enough of them, you automatically nab the golden snitch and end the match. There is a real disconnect between your midair maneuvering and what's going on in the match below, though. In the books, Harry is constantly forced to avoid angry opponents trying to knock him off his broom and heavy bludgers being thrown his way, but none of those obstacles factor in here. You won't have to pull off any fancy evasive moves, and given that your path is preset, you don't even have to search for the fast-moving snitch. This mode is predictable and bland, never capturing the exhilaration of playing an airborne sport. Say hello to Zombie Hermione. Your final task in Half-Blood Prince is dueling, and though it's more fun than anything else in the game, that isn't saying much. These one-on-one battles have you slinging magical spells at your opponent and dodging out of the way to avoid losing your own energy. The controls are motion based, so depending on how you move the remote or Nunchuk, you perform one of six different spells. Protego is the most satisfying because you have to cross your arms in front of your body to form a shield, and deflecting a blow at the last second is pretty sweet. However, the battles often boil down to one cheap tactic: Stun your opponent with one powerful spell and then spam your weaker attack. For instance, if you can nail your foe with levicorpus, he or she will float defenselessly in midair, and then you need only shake your arm frantically to let out a string of stupify attacks, quickly dropping your opponent's health. Going head-to-head with a friend is more unpredictable, but the lack of depth limits the long-term appeal of this mode. The Harry Potter video games should complement the other media, providing gleeful interaction to match the excellent story from the books and the visual splendor of the films. But Half-Blood Prince isn't much fun to play once you've gotten a taste of the few simple activities. The game is ultimately a forgettable experience, pushing players through the same three minigames over and over again, without ever capturing the thrill of being a wizard. The story lacks focus and is difficult to follow, giving players only the faintest motivation to continue on before it finally ends on an emotionless, anticlimactic note. The Half-Blood Prince squanders its impressive license; you're better off reading the book again."}