{"ref": "https://www.gamespot.com/reviews/espn-college-hoops-review/1900-6083952/", "date": "November 19, 2003", "game_name": "ESPN College Hoops", "text": "It wasn't too long ago that Carmelo Anthony's Syracuse Orangemen prevailed over Kirk Hinrich's Kansas Jayhawks in the 2003 NCAA basketball tournament. Both college stars have since moved on to the NBA and are starting for their respective teams. The new college basketball season is now upon us, and fresh faces are ready to step into the spotlight. Also, Sega Sports has released a new college basketball game, ESPN College Hoops, to mark the beginning of this new season. The game uses the same engine and many of the same features found in ESPN NBA Basketball, but the developers have made sure to add plenty of college atmosphere and flavor so that it doesn't just feel like ESPN NBA in different clothing. With solid gameplay feel, exceptional customizability, and a deep legacy mode, ESPN College Hoops is easily recommendable to any college basketball fan. Playing against zone defenses can be tricky. ESPN College Hoops' basic gameplay will feel familiar to anyone who's played ESPN NBA basketball. What's different is that you'll face a lot of different types of zone defenses, which reflects the same difference between the college and pro games. The computer will change up its defense regularly throughout a game. Sometimes it will sag into the paint with a 2-3 zone, and, after a few possessions, it will switch up into a half-court trap to mix things up a bit. Later on, you might see a box-and-1, man-to-man, or a full-court press. As you might expect, you'll need to rely a lot on ball movement and crisp passing to break down the defense and find open shots. However, if you get careless with passes, you'll throw the ball away and turn it over often, especially against a press or a trap. To help you break down defenses, you'll see the players in ESPN College Hoops moving frequently without the ball. You can initiate more motion by calling a play, but even if you don't, you'll see your players regularly cycling around the perimeter and moving in and out of the lane to give the defense a different look. The game includes dozens of different plays on both offense and defense, and each team has its own playbook to reflect the real-life style of that team. If you don't like your team's default sets, you can easily create a custom playbook. You'll only be able to access four plays at a time--during the flow of the game--by pressing on the directional pad, but you can change the four quick-plays before or during a game (from the pause screen). Though ESPN College Hoops features isomotion juke moves, like ESPN NBA, they don't function quite the same way. Unlike ESPN NBA, you won't have to worry quite as much about getting called for a charging foul when you use isomotion jukes. However, you'll find that the jukes are not quite so effective in College Hoops. With the computer running so much zone defense, faking out the first defender usually isn't enough, as there's nearly always a help defender nearby to ~cover up.~ Defense with College Hoops' isomotion is a little different also, as using the right analog stick results in a steal motion rather than a side step to try and close off a driving lane. Rebounding has seen some tweaks too; boxing-out now feels more effective, so it's easier to keep the computer off the offensive glass. Shotblocking, which occurred far too frequently in ESPN NBA, is also toned down a little bit in College Hoops. Perhaps the most unique gameplay feature in ESPN College Hoops is the momentum meter at the bottom right of the screen. If you or your opponent goes on a scoring run, the meter will slowly build toward one side. With momentum in your favor, your players seem to execute better and make shots a little more often than they normally would. Likewise, if the computer has all the momentum, your players seem to play tightly and will blow easy layups and botch simple passes. Calling a timeout can artificially cut down an opponent's momentum, but the only real way to turn things back in your favor is to score baskets. The developers have done a great job at capturing college spirit and atmosphere. On the downside, ESPN College Hoops seems to have a real problem with dunks and layups. All too often, you'll have a player streaking to the basket or standing right underneath it, and, instead of attempting to throw it down or lay it in, he'll put up a weak-looking jumper that's likely to get swatted. The post-game is also a little bit suspect. You can try to spin around your defender or put up a jump hook, but you often don't get a chance to do so, as the computer is relentless about pinching down into the post to strip your big men of the ball. You'll still score a lot from the paint, but most baskets will be off of quick shots and ball movement as you wait for your big men to gain good position without the ball in their hands. As with any college sports game, the developers are prohibited from using the real names of amateur athletes in ESPN College Hoops. You have the option of having only the player numbers displayed (which do correspond to their real-life counterparts) or having the computer generate random fictional names for you. If you're so inclined, you can also input the names yourself, as the game includes extensive lists of first and last names, many of which are the same as the names of the missing players. While modifying Cal's vaunted freshman class, we were pleased to find the unusual given names and surnames of Leon Powe, Marquise Kately, and even Ayinde Ubaka on the huge lists. If you use names from the list, the PA announcer and play-by-play man will actually say the names while calling the game, which is a really nice touch. Aside from names, the player customization feature gives you many options for adjusting a player's appearance and/or accessories. The list of teams in the game is also excellent. More than 310 Division I schools are included, which means a small handful have been left out, including mid- to low-level programs like Cal Poly San Luis Obispo's (called ~Cal Coastside~ in the game) and UC Santa Barbara's (called ~SB Del Mar State~). You can always create your own school if you desire. The school creation feature allows for an exceptional level of customization. You can name your school and pick out colors, a mascot, and a logo. You can choose from about 15 different kinds of arenas and gyms. You can then name your gym and design the floor, including its wood pattern, color coordination on the painted lines, and more. You also have a number of options with the color and design of your uniform, the cheerleaders' uniforms, and even the appearance of your coach. Additionally, the game lets you pick out a fight song from the dozens of included real-school fight songs; some generic fight songs are also included. Head to the campus store to spend your points on mascot teams and alternate jerseys. ESPN College Hoops includes a number of extra modes and unlockables. Using points you earn while playing, you can go to the campus store and purchase mascot teams, fantasy courts, like a farm or space station, alternate jerseys, and classic teams, like the 1993 ~Fab Five~ Michigan squad, Larry Bird's 1979 Indiana State team, or Pete Newell's 1959 Cal championship team. There's also an ~ESPN Slam Session,~ which is basically a dunk contest with a few different modes. Though it's amusing at first, the Slam Session modes get old quickly because they basically boil down to pressing different button combinations in quick succession to execute the different dunks. ESPN College Hoops' legacy mode is extremely involving. Not only can you create and customize playing schedules for your team, but you'll be responsible for hiring and working with assistant coaches, who have their own attributes and strengths in categories like offensive/defensive strategy, game planning, recruiting, loyalty, and more. You interact with your assistants while they recruit players, and you also interact with them before games as they give you tips on the opposing team's strengths and weaknesses. What's somewhat overwhelming is that recruiting is reflected as a yearlong process (as it is in real life). You'll be able to scout high school players, attend (and play) their high school games, invite them to visit your school, and make scholarship offers all during your own regular season. You won't have many action points to spend during the season, so you'll need to be judicious about which recruits you focus on. However, if you wait until the off-season to handle most of your recruiting, you'll find that many of the plum picks are already committed or leaning heavily toward another school. The fact that you are more or less forced to participate in the early-season recruiting process can slow down your progress through the regular season, as you must necessitate dealing with these extra responsibilities. As far as managing your team, you can manually play as many or as few games as you wish. For those more interested in simulating games, there are numerous coaching sliders to reflect playing style. There's half-court versus fast break, fundamental versus flashy, finesse versus physical, and more. The regular season is a great time to play with the sliders and learn the strengths and weaknesses of your team as you head into the year-end conference and national tournaments. Free-throw shooters can expect harassment from the other team's crowd. As you'd expect from a Sega Sports game, College Hoops' graphics are very good. The developers have done a great job of modeling the various major arenas across the country. As you play the game, you'll see a lot of nice touches, including cutaway shots of fans who are cheering or groaning based on the fortunes of their home teams. Mascots will interact with coaches and players. You'll also see the crowd performing card stunts or waving ~Brick!~ and/or ~Choke!~ signs at opposing free-throw shooters. The player models themselves don't seem quite as detailed as in ESPN NBA, and the animations seem a bit rougher (for some reason), but they still hold up very well. The Xbox version of the game is a bit cleaner and more vibrant-looking than its PS2 counterpart, but, otherwise, there aren't any glaring differences. College Hoops fares even better in the sound department. As mentioned earlier, the game includes many authentic fight songs, and the crowd interaction with the game is dynamic and realistic. They'll roar as the home team performs well, or they'll die down into silence if they're getting beaten. The crowd also has an impressive number of different chants to urge on the home team. Announcing is handled by ESPN's Mike Patrick and Jay Bilas. They do a great job overall, but if there's any criticism to make, it's that they might talk a little too much. Bilas is certainly a knowledgeable college basketball analyst, but the color commentary he adds to the game sometimes gets a little long-winded and trails the actual gameplay. The online features for both the PS2 and Xbox are similar to ESPN NBA Basketball's offerings. You can play matches on a ranked leaderboard, and on the PS2 you can participate in tournaments. Gameplay over Xbox Live seems smooth and responsive, for the most part, with all of the features you've come to expect from Xbox Live-enabled games. Though the similarities between ESPN NBA Basketball and College Hoops are readily apparent, there are definite differences in the gameplay that reflect the contrasts between the pro and college games. The developers have done a great job with College Hoops' presentation in establishing a proper college ambience, and, with the online play, unlockables, legacy mode, and other extras, College Hoops comes together as a great overall game for college basketball fans. The list of teams in the game is also excellent. More than 310 Division I schools are included, which means a small handful have been left out, including mid- to low-level programs like Cal Poly San Luis Obispo's (called ~Cal Coastside~ in the game) and UC Santa Barbara's (called ~SB Del Mar State~). You can always create your own school if you desire. The school creation feature allows for an exceptional level of customization. You can name your school and pick out colors, a mascot, and a logo. You can choose from about 15 different kinds of arenas and gyms. You can then name your gym and design the floor, including its wood pattern, color coordination on the painted lines, and more. You also have a number of options with the color and design of your uniform, the cheerleaders' uniforms, and even the appearance of your coach. Additionally, the game lets you pick out a fight song from the dozens of included real-school fight songs; some generic fight songs are also included. Head to the campus store to spend your points on mascot teams and alternate jerseys. ESPN College Hoops includes a number of extra modes and unlockables. Using points you earn while playing, you can go to the campus store and purchase mascot teams, fantasy courts, like a farm or space station, alternate jerseys, and classic teams, like the 1993 ~Fab Five~ Michigan squad, Larry Bird's 1979 Indiana State team, or Pete Newell's 1959 Cal championship team. There's also an ~ESPN Slam Session,~ which is basically a dunk contest with a few different modes. Though it's amusing at first, the Slam Session modes get old quickly because they basically boil down to pressing different button combinations in quick succession to execute the different dunks. ESPN College Hoops' legacy mode is extremely involving. Not only can you create and customize playing schedules for your team, but you'll be responsible for hiring and working with assistant coaches, who have their own attributes and strengths in categories like offensive/defensive strategy, game planning, recruiting, loyalty, and more. You interact with your assistants while they recruit players, and you also interact with them before games as they give you tips on the opposing team's strengths and weaknesses. What's somewhat overwhelming is that recruiting is reflected as a yearlong process (as it is in real life). You'll be able to scout high school players, attend (and play) their high school games, invite them to visit your school, and make scholarship offers all during your own regular season. You won't have many action points to spend during the season, so you'll need to be judicious about which recruits you focus on. However, if you wait until the off-season to handle most of your recruiting, you'll find that many of the plum picks are already committed or leaning heavily toward another school. The fact that you are more or less forced to participate in the early-season recruiting process can slow down your progress through the regular season, as you must necessitate dealing with these extra responsibilities. As far as managing your team, you can manually play as many or as few games as you wish. For those more interested in simulating games, there are numerous coaching sliders to reflect playing style. There's half-court versus fast break, fundamental versus flashy, finesse versus physical, and more. The regular season is a great time to play with the sliders and learn the strengths and weaknesses of your team as you head into the year-end conference and national tournaments. Free-throw shooters can expect harassment from the other team's crowd. As you'd expect from a Sega Sports game, College Hoops' graphics are very good. The developers have done a great job of modeling the various major arenas across the country. As you play the game, you'll see a lot of nice touches, including cutaway shots of fans who are cheering or groaning based on the fortunes of their home teams. Mascots will interact with coaches and players. You'll also see the crowd performing card stunts or waving ~Brick!~ and/or ~Choke!~ signs at opposing free-throw shooters. The player models themselves don't seem quite as detailed as in ESPN NBA, and the animations seem a bit rougher (for some reason), but they still hold up very well. The Xbox version of the game is a bit cleaner and more vibrant-looking than its PS2 counterpart, but, otherwise, there aren't any glaring differences. College Hoops fares even better in the sound department. As mentioned earlier, the game includes many authentic fight songs, and the crowd interaction with the game is dynamic and realistic. They'll roar as the home team performs well, or they'll die down into silence if they're getting beaten. The crowd also has an impressive number of different chants to urge on the home team. Announcing is handled by ESPN's Mike Patrick and Jay Bilas. They do a great job overall, but if there's any criticism to make, it's that they might talk a little too much. Bilas is certainly a knowledgeable college basketball analyst, but the color commentary he adds to the game sometimes gets a little long-winded and trails the actual gameplay. The online features for both the PS2 and Xbox are similar to ESPN NBA Basketball's offerings. You can play matches on a ranked leaderboard, and on the PS2 you can participate in tournaments. Gameplay over Xbox Live seems smooth and responsive, for the most part, with all of the features you've come to expect from Xbox Live-enabled games. Though the similarities between ESPN NBA Basketball and College Hoops are readily apparent, there are definite differences in the gameplay that reflect the contrasts between the pro and college games. The developers have done a great job with College Hoops' presentation in establishing a proper college ambience, and, with the online play, unlockables, legacy mode, and other extras, College Hoops comes together as a great overall game for college basketball fans."}