{"ref": "https://www.gamespot.com/reviews/half-life-2-review/1900-6139872/", "date": "October 5, 2013", "game_name": "Half-Life 2", "text": "Half-Life 2 for the Xbox is here, and somehow, Valve managed to squeeze in every little ounce of gameplay that appeared in last year's hit PC game...barely. And let's get this out of the way now: Half-Life 2 for the Xbox is, in terms of content, exactly the same as the PC version's single-player game, so if you played it on the PC, there's nothing new for you here. And note that we did say single-player game, because the Xbox version lacks Counter-Strike: Source, the latest version of the hugely popular online action game that came with Half-Life 2 on the PC. So, when you get down to it, Half-Life 2 for the Xbox is basically just the acclaimed single-player campaign for Half-Life 2. And that's why Half-Life 2 for the Xbox comes off as a bit underwhelming. Yes, it's a fairly solid translation of one of the better first-person shooters of recent years, but it also lacks the extensive multiplayer and mod-making features of its PC cousin. Half-Life 2 lets you battle the alien Combine to free a defeated humanity. And the story is exactly the same as the one found in last year's PC version. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Half-Life 2 Video Review So why all the hubbub over an average-length single-player first-person shooter? Keep in mind that Half-Life 2 is the sequel to arguably one of the greatest action games ever made. The original Half-Life single-handedly reinvented the first-person shooter, putting the emphasis on cinematic pacing and complete immersion in the experience. Pretty much every modern-day shooter owes a lot to the original Half-Life. In many ways, this big-budget sequel does what it sets out to do: Half-Life 2 is a technically amazing, sharply honed first-person shooter that pulls all the tricks that made Half-Life such a beloved experience. In Half-Life 2, you once again assume the role of Gordon Freeman, the theoretical physicist and dimension-hopping commando who saved the world from an alien invasion at the end of Half-Life. Or did he? Half-Life 2 starts you off facing the infamous G-Man, the mysterious blue-suited character from the original. At the end of Half-Life, the G-Man offered you a choice: work for him or die. Since there would be no sequel if you chose the latter, Half-Life 2 assumes you chose the former, and so you start the game on a train entering City 17 for your introduction into this new world. City 17 is a run-down urban center that's the equivalent of the Warsaw ghettos during World War II; instead of Jews being rounded up to live in City 17, it's all the remnants of a defeated humanity. Half-Life 2 takes place an untold number of years after the Black Mesa incident, but it's clear that much has changed. A mysterious enemy known as the Combine has conquered the planet and installed a human puppet government to carry out its rule. Black-clad security forces patrol the streets, while propaganda blares endlessly from omnipresent video screens. If there's one thing that Valve does extremely well, it's capturing a sense of atmosphere, as this vision of a dystopian police state is chillingly effective. But you won't spend a lot of time soaking in the scene before you're thrust into the struggle to defeat the Combine and free humanity. As soon as the shooting begins you'll join an essentially nonstop battle that will last the remainder of the game. Like the original Half-Life, Half-Life 2 is presented as a nearly seamless experience. You play entirely from Gordon Freeman's perspective, without cutscenes, perspective changes to take you out of the moment, or narrative jumps that skip ahead in time (at least, there are none from your perspective). Surprisingly, the Xbox version is broken up into the same pieces as the PC game, which means that Valve was able to squeeze in the same-sized levels on the Xbox as there are in the PC version. If you played the PC game, then you know that levels are broken up into sections, and it takes about 10 seconds to load in the next section before you can transition from one part of a level to another. When you're killed, you simply load back at the last checkpoint or level save, or the last manual save, as the Xbox lets you keep up to 30 saved games on the hard drive. This sounds like a lot, but you'll probably want to save quite a bit in order to cut down on having to play sections over and over again. And yes, while the load times in the Xbox version are a bit longer than on the PC, they're not frustratingly long, at least. Even with the slightly longer loading times, you're still looking at between 10 to 15 hours of gameplay, depending on your skill level. The striders are some of the toughest and coolest opponents in the game. Good luck taking one down. The original Half-Life was highly cinematic in nature--the virtual equivalent of starring in your own blockbuster sci-fi action movie. Who could ever forget the first time a headcrab leapt out at you from a dark corner? Or the moment when the commando tossed a satchel charge into the sewer pipe you were hiding in? The movie analogy is apt, not only because Half-Life 2 packs a few cinematic moments of its own, but also because, like most movie sequels, it plays it safe and doesn't deviate much from its storied predecessor. Half-Life 2 doesn't revolutionize the genre. Instead, it sticks with the familiar formula of run-and-gun action, occasional puzzle-solving, and scripted sequences established by Half-Life. And it's an effective formula, for the most part. The action begins with a rousing start, as the opening levels combine these three ingredients masterfully. You start off on the lam from the Combine, armed with only a pistol and your wits, and you embark on a chase through a train yard and tunnel system that's filled with all sorts of hairbreadth escapes. After you reach safety, Half-Life 2 settles into a more conventional and familiar style of play. Aside from a detour through a deserted town full of all sorts of booby traps, there are a lot of echoes of the original Half-Life in Half-Life 2--so many, in fact, that there's a strong sense of dj vu at times. Still, it's hard to knock Valve for not wanting to tinker too much with a proven formula, and Half-Life 2 is as fast-paced and enjoyable as its predecessor. Clad in your rugged hazard suit, you'll battle your way forward against all manner of enemies, only to recover quickly by picking up health packs and recharging your hazard suit at energy stations. Some of these foes are familiar, such as the headcrab and the barnacle, while others, like the manhacks (essentially flying buzz saws) present whole new challenges. Meanwhile, you'll be armed with a formidable arsenal, most of which is recycled from the first game, such as the submachine gun, shotgun, crossbow, and, of course, the ubiquitous crowbar. These weapons haven't changed much, and they feel roughly the same. There are only three new weapons, including the pulse rifle, which is a sort of beefed-up energy rifle with a devastating secondary attack and a meaty sound to it. You can battle a wide variety of opponents. Or, if you're smart, you'll let them battle one another at times. The Xbox version of Half-Life 2 also manages to keep the full physics engine that was featured in the PC version, though it's something of a double-edged sword on the Xbox. Objects in motion behave in a very realistic manner, thanks to the physics engine. The designers took full advantage of this to set up situations like a room full of exploding barrels, or giant ant lions or zombies that hurl objects at you to damage you. And the biggest benefit of the physics engine is the gravity gun, which lets you pick up and throw objects. It's just as useful for picking up and hurling a grenade back at an enemy as it is for solving any number of puzzles. The bad news is that any kind of large-scale physics reaction, involving multiple objects, will kill the already-struggling frame rate. Therefore, the results just aren't as smooth or as coolly realized as they are in the PC version. The other noteworthy additions to the gameplay are vehicles, specifically an airboat and a high-speed buggy. While these sequences offer a visual rush, they're also not too far removed from some of the rail sequences in the original Half-Life. In many instances, you'll be battling enemies in a high-speed engagement while being funneled down a narrow channel or road, which doesn't leave you with much of a chance to explore or veer off the beaten path. You'll then encounter an obstacle that requires you to jump out of your vehicle and solve a puzzle to proceed. The controls and physics in these sequences are a bit loose, but the vehicles are fun to drive, especially when you get some room to maneuver. It's too bad that Valve didn't use this occasion to edit these sequences, because the airboat scene in particular drags on a bit too long for its own good. You'll be on your own during most of the game, but there are levels in which you'll have the opportunity to fight alongside allies, both alien and human. Some of the best team moments come later, when you're battling the Combine in the streets and buildings of City 17, with large-scale battles going on between groups of humans and the Combine's huge, spiderlike striders. You never really develop any attachment to your teammates, though, as they tend to be very disposable, and replacements are available at regular intervals. Teammates have a tendency to get in your way in cramped interiors. Even though they'll slowly move out of your way, it's still a little annoying. In addition to taking on teammates, you'll occasionally have the opportunity to set up sentry guns to assist you in defense. The toughest sequence that we encountered involved setting up a handful of sentry guns in a defensive alignment, and then holding out against waves of incoming Combine soldiers. The vehicle sequences in Half-Life 2 let you speed along on land and on water. Surprisingly, Half-Life 2's story is one of its most disappointing aspects. The first half of the game feels a bit unfocused, while the second half seems rushed. Even worse, the story leaves behind a mess of unanswered questions, and it doesn't touch on any of the lingering questions left over from the first game. Valve likes to leave tantalizing hints and tidbits everywhere, but few of these actually develop into anything interesting, and by the end you're left wondering what the game was all about. In many ways, Half-Life 2 feels like the middle chapter in a much larger story, and it suffers as a result. Another surprise is the somewhat disappointing performance by the artificial intelligence. Most of the humanoid enemies don't seem to show the same kind of intelligent behavior that they did in the original, even on the tougher difficulty levels. They'll seek cover and then peek out to fire, but invariably they'll charge at you, which makes it easy to take them down. And maybe it's due to some of the weapons being a bit overpowered, but most opponents don't present much of a challenge at all--a few rounds is usually enough to stop them. There are a few fearsome foes, like the larger ant lions, which will tirelessly pursue you while you frantically unload every bullet you have at them. Then there's the strider, the 50-foot-tall, walking, organic tank that fires devastating bursts and can spear you with one of its legs if you get too close. But for the most part, Half-Life 2 is surprisingly easy, even on the tougher difficulty levels. Case in point is the end of the game, which feels anticlimactic: You're given a horrendously overpowered weapon to use against relatively weak opposition. After you reach safety, Half-Life 2 settles into a more conventional and familiar style of play. Aside from a detour through a deserted town full of all sorts of booby traps, there are a lot of echoes of the original Half-Life in Half-Life 2--so many, in fact, that there's a strong sense of dj vu at times. Still, it's hard to knock Valve for not wanting to tinker too much with a proven formula, and Half-Life 2 is as fast-paced and enjoyable as its predecessor. Clad in your rugged hazard suit, you'll battle your way forward against all manner of enemies, only to recover quickly by picking up health packs and recharging your hazard suit at energy stations. Some of these foes are familiar, such as the headcrab and the barnacle, while others, like the manhacks (essentially flying buzz saws) present whole new challenges. Meanwhile, you'll be armed with a formidable arsenal, most of which is recycled from the first game, such as the submachine gun, shotgun, crossbow, and, of course, the ubiquitous crowbar. These weapons haven't changed much, and they feel roughly the same. There are only three new weapons, including the pulse rifle, which is a sort of beefed-up energy rifle with a devastating secondary attack and a meaty sound to it. You can battle a wide variety of opponents. Or, if you're smart, you'll let them battle one another at times. The Xbox version of Half-Life 2 also manages to keep the full physics engine that was featured in the PC version, though it's something of a double-edged sword on the Xbox. Objects in motion behave in a very realistic manner, thanks to the physics engine. The designers took full advantage of this to set up situations like a room full of exploding barrels, or giant ant lions or zombies that hurl objects at you to damage you. And the biggest benefit of the physics engine is the gravity gun, which lets you pick up and throw objects. It's just as useful for picking up and hurling a grenade back at an enemy as it is for solving any number of puzzles. The bad news is that any kind of large-scale physics reaction, involving multiple objects, will kill the already-struggling frame rate. Therefore, the results just aren't as smooth or as coolly realized as they are in the PC version. The other noteworthy additions to the gameplay are vehicles, specifically an airboat and a high-speed buggy. While these sequences offer a visual rush, they're also not too far removed from some of the rail sequences in the original Half-Life. In many instances, you'll be battling enemies in a high-speed engagement while being funneled down a narrow channel or road, which doesn't leave you with much of a chance to explore or veer off the beaten path. You'll then encounter an obstacle that requires you to jump out of your vehicle and solve a puzzle to proceed. The controls and physics in these sequences are a bit loose, but the vehicles are fun to drive, especially when you get some room to maneuver. It's too bad that Valve didn't use this occasion to edit these sequences, because the airboat scene in particular drags on a bit too long for its own good. You'll be on your own during most of the game, but there are levels in which you'll have the opportunity to fight alongside allies, both alien and human. Some of the best team moments come later, when you're battling the Combine in the streets and buildings of City 17, with large-scale battles going on between groups of humans and the Combine's huge, spiderlike striders. You never really develop any attachment to your teammates, though, as they tend to be very disposable, and replacements are available at regular intervals. Teammates have a tendency to get in your way in cramped interiors. Even though they'll slowly move out of your way, it's still a little annoying. In addition to taking on teammates, you'll occasionally have the opportunity to set up sentry guns to assist you in defense. The toughest sequence that we encountered involved setting up a handful of sentry guns in a defensive alignment, and then holding out against waves of incoming Combine soldiers. The vehicle sequences in Half-Life 2 let you speed along on land and on water. Surprisingly, Half-Life 2's story is one of its most disappointing aspects. The first half of the game feels a bit unfocused, while the second half seems rushed. Even worse, the story leaves behind a mess of unanswered questions, and it doesn't touch on any of the lingering questions left over from the first game. Valve likes to leave tantalizing hints and tidbits everywhere, but few of these actually develop into anything interesting, and by the end you're left wondering what the game was all about. In many ways, Half-Life 2 feels like the middle chapter in a much larger story, and it suffers as a result. Another surprise is the somewhat disappointing performance by the artificial intelligence. Most of the humanoid enemies don't seem to show the same kind of intelligent behavior that they did in the original, even on the tougher difficulty levels. They'll seek cover and then peek out to fire, but invariably they'll charge at you, which makes it easy to take them down. And maybe it's due to some of the weapons being a bit overpowered, but most opponents don't present much of a challenge at all--a few rounds is usually enough to stop them. There are a few fearsome foes, like the larger ant lions, which will tirelessly pursue you while you frantically unload every bullet you have at them. Then there's the strider, the 50-foot-tall, walking, organic tank that fires devastating bursts and can spear you with one of its legs if you get too close. But for the most part, Half-Life 2 is surprisingly easy, even on the tougher difficulty levels. Case in point is the end of the game, which feels anticlimactic: You're given a horrendously overpowered weapon to use against relatively weak opposition. The controls translate really well to the Xbox's gamepad, and we like the solution that Valve came up with for manipulating your formidable arsenal later on. You'd think that selecting from two different pistols, a shotgun, assault rifle, rocket launcher, grenades, crowbar, gravity gun, crossbow, and more would be a bit awkward, but Valve has an elegant solution. Meanwhile, the rest of the controls conform to the standard first-person-shooter controls established by Halo. And, yes, there have been some concessions to the aim mechanic to make it work better with the gamepad, which is far less accurate than a mouse. There's essentially auto-aim in the Xbox version, so often all you have to do is move the targeting cursor somewhere near the target and it will lock on (the hit detection is also very generous on your end). The physics engine combined with the gravity gun lets you pick up and hurl objects, such as the many explosive barrels littering City 17. We only wish that the rest of Half-Life 2 translated as smoothly as the controls, because even though Valve managed to squeeze the PC game onto the Xbox, you have to question the wisdom of doing so. Half-Life 2 struggles to maintain a decent frame rate throughout, and while it's by no means crippling, it's not exactly what you would consider smooth, either. Valve has scaled down the resolution and the textures quite a bit from the PC version, and some do look quite blurry if you linger on them too much. With that said, though, this is still a great-looking Xbox game, and the atmospheric immersion is still there. You'll be dropped into huge, believable environments that are downright impressive, from the plazas and streets of City 17 to the rusted interiors of an abandoned factory. There's also some excellent level design, including a deserted town full of deadly traps and the gaping interiors of an alien citadel. Though Half-Life 2 is stuffed with excellent voice talent to give life to the many characters in the game, the fact that Gordon Freeman doesn't say a single word remains disconcerting. The idea is that since you are Gordon Freeman, then giving him a voice would take away from the immersion. Valve got away with this in the original Half-Life because Gordon encountered few characters, and they didn't linger onscreen for too long. On the other hand, Half-Life 2 features whole conversations where everyone is talking to you, and it's just weird that they seem fine with you not saying anything in return. The conversations that do take place remain some of the better parts of the game, as Half-Life 2 has excellent facial technology that brings human characters to life in a believable way. It also helps that Valve enlisted notable talent to supply the voices for many characters, including Robert Guillaume, Louis Gossett Jr., Robert Culp, and Michelle Forbes. The voice acting is superb, and the script itself features wit, warmth, and humor. The sound effects are also well done. Once again, it's the little details that stand out, like the buzzing noise of manhacks as they approach and the clatter of a gutter pipe as something climbs up to reach you. As in the original, there's very little music, and what's here is electronic in nature and reserved to emphasize important moments, such as when you're headed for a showdown with a major foe. Despite a few standout themes (one of which is recycled from the original), most of the music is forgettable. Unfortunately, Half-Life 2 on the Xbox is single-player only, so once it's done, you've seen it all. Unfortunately, once you get through the single-player story, you've pretty much seen everything that Half-Life 2 for the Xbox has to offer. In a move that will undoubtedly upset fans, the Xbox version lacks any kind of multiplayer capability, from split screen to Xbox Live support. Valve argues that Counter-Strike is already available as a separate Xbox game. But, if you were looking forward to Counter-Strike: Source on the Xbox or Half-Life 2 deathmatch with the gravity gun, then you'll likely be disappointed. This has an obvious impact on the game's value, as multiplayer was a huge part of the PC version. Also, the Xbox version lacks the mod-making features of the PC, which has a huge number of user-created mods. When you get down to it, Half-Life 2 for the Xbox is an excellent single-player game. If you didn't get a chance to play the PC version, then you owe it to yourself to check out the game on the Xbox (even though it's not as smooth and as sharp as what you'll find on the PC). You'll find few games that can match Half-Life 2's quality in terms of immersion and gameplay. And all these months after its original release, it's still an excellent first-person shooter that should be experienced by most every action fan. Just don't expect anything more after the game ends. The controls translate really well to the Xbox's gamepad, and we like the solution that Valve came up with for manipulating your formidable arsenal later on. You'd think that selecting from two different pistols, a shotgun, assault rifle, rocket launcher, grenades, crowbar, gravity gun, crossbow, and more would be a bit awkward, but Valve has an elegant solution. Meanwhile, the rest of the controls conform to the standard first-person-shooter controls established by Halo. And, yes, there have been some concessions to the aim mechanic to make it work better with the gamepad, which is far less accurate than a mouse. There's essentially auto-aim in the Xbox version, so often all you have to do is move the targeting cursor somewhere near the target and it will lock on (the hit detection is also very generous on your end). The physics engine combined with the gravity gun lets you pick up and hurl objects, such as the many explosive barrels littering City 17. We only wish that the rest of Half-Life 2 translated as smoothly as the controls, because even though Valve managed to squeeze the PC game onto the Xbox, you have to question the wisdom of doing so. Half-Life 2 struggles to maintain a decent frame rate throughout, and while it's by no means crippling, it's not exactly what you would consider smooth, either. Valve has scaled down the resolution and the textures quite a bit from the PC version, and some do look quite blurry if you linger on them too much. With that said, though, this is still a great-looking Xbox game, and the atmospheric immersion is still there. You'll be dropped into huge, believable environments that are downright impressive, from the plazas and streets of City 17 to the rusted interiors of an abandoned factory. There's also some excellent level design, including a deserted town full of deadly traps and the gaping interiors of an alien citadel. Though Half-Life 2 is stuffed with excellent voice talent to give life to the many characters in the game, the fact that Gordon Freeman doesn't say a single word remains disconcerting. The idea is that since you are Gordon Freeman, then giving him a voice would take away from the immersion. Valve got away with this in the original Half-Life because Gordon encountered few characters, and they didn't linger onscreen for too long. On the other hand, Half-Life 2 features whole conversations where everyone is talking to you, and it's just weird that they seem fine with you not saying anything in return. The conversations that do take place remain some of the better parts of the game, as Half-Life 2 has excellent facial technology that brings human characters to life in a believable way. It also helps that Valve enlisted notable talent to supply the voices for many characters, including Robert Guillaume, Louis Gossett Jr., Robert Culp, and Michelle Forbes. The voice acting is superb, and the script itself features wit, warmth, and humor. The sound effects are also well done. Once again, it's the little details that stand out, like the buzzing noise of manhacks as they approach and the clatter of a gutter pipe as something climbs up to reach you. As in the original, there's very little music, and what's here is electronic in nature and reserved to emphasize important moments, such as when you're headed for a showdown with a major foe. Despite a few standout themes (one of which is recycled from the original), most of the music is forgettable. Unfortunately, Half-Life 2 on the Xbox is single-player only, so once it's done, you've seen it all. Unfortunately, once you get through the single-player story, you've pretty much seen everything that Half-Life 2 for the Xbox has to offer. In a move that will undoubtedly upset fans, the Xbox version lacks any kind of multiplayer capability, from split screen to Xbox Live support. Valve argues that Counter-Strike is already available as a separate Xbox game. But, if you were looking forward to Counter-Strike: Source on the Xbox or Half-Life 2 deathmatch with the gravity gun, then you'll likely be disappointed. This has an obvious impact on the game's value, as multiplayer was a huge part of the PC version. Also, the Xbox version lacks the mod-making features of the PC, which has a huge number of user-created mods. When you get down to it, Half-Life 2 for the Xbox is an excellent single-player game. If you didn't get a chance to play the PC version, then you owe it to yourself to check out the game on the Xbox (even though it's not as smooth and as sharp as what you'll find on the PC). You'll find few games that can match Half-Life 2's quality in terms of immersion and gameplay. And all these months after its original release, it's still an excellent first-person shooter that should be experienced by most every action fan. Just don't expect anything more after the game ends."}