{"ref": "https://www.gamespot.com/reviews/apollo-justice-ace-attorney-review/1900-6186826/", "date": "February 27, 2008", "game_name": "Apollo Justice: Ace Attorney", "text": "The Ace Attorney games have always been exclusive to the Nintendo DS in North America, but they were essentially ports of the Japanese games, which were originally released on the GameBoy Advance. Apollo Justice: Ace Attorney marks the first time a game in the Ace Attorney series has been built from the ground up for the Nintendo DS, and it includes many features (several of which were first introduced in the bonus case in Phoenix Wright: Ace Attorney) that take advantage of the handheld's touch-screen capabilities. It also has a new protagonist: Apollo Justice. These changes, along with an excellent final case, freshen things up enough to make Apollo Justice worth investigating for diehard fans of the series, but if you found your interest waning in any of the previous games, you'll want to temper your expectations when it comes to how much has changed. You can inspect every nook and cranny of these panties thanks to the 3D evidence feature. Apollo Justice: Ace Attorney focuses surprisingly enough on...Apollo Justice, an attorney with more than a passing resemblance to the series' previous star, Phoenix Wright. Apollo is young, has spiked hair, lacks confidence in court, and even has a young, quirky girl for a sidekick. In addition to Apollo, there are many new characters, some who are interesting, but few of whom are as endearing as the characters from the Phoenix Wright games. The good news for anyone suffering from nostalgia is that quite a few familiar faces make appearances throughout the game. The judge, Winston Payne, and a few other more notable people make their presence felt here. Returning characters are a blessing and a curse. On one hand, they're a nice way of tying the two story arcs together, but on the other hand, they serve to show how the new cast isn't quite as endearing as the old one. There are four turnabouts (cases), all of which find you defending a client accused of murder. The first three cases are solid but aren't anything special. It's the last case that steals the show. It's interesting, it has a number of genuinely intriguing twists and turns, and it weaves a number of past cases together into one really compelling finale. The writing is as witty as ever (if not a bit more long-winded), and you'll notice various pop-culture references to U2, Harry Potter, Bon Jovi, and more. For the most part it's business as usual with regard to gameplay. You'll spend your time out of court investigating crime scenes, collecting evidence, and interviewing witnesses. The in-court proceedings are almost completely unchanged. You'll cross-examine witnesses and present evidence and profiles to support your position in hopes of getting the judge to hand down a ~not guilty~ verdict. There's less ambiguity in Apollo Justice when it comes to presenting evidence, because the game automatically narrows down whether you need to show a character profile or a physical piece of evidence, but many of the series' flaws are still present. Witnesses repeatedly lie on the stand without any sort of punishment; the proceedings are strictly linear so there's no room for creative thinking; you'll still find yourself occasionally stuck while in the investigation portion of the game because you didn't show someone a particular object or look in some out-of-the-way corner; and the story moves along at a snail's pace, often forcing you to watch a flashback for an event that occurred just minutes before. It's not all bad news, though. The developer has finally added some new forensic investigation mechanics that take advantage of the touch screen. Many of these were found in the last case of the first game, which was created specifically for the DS, but they've been MIA ever since. The new features will let you inspect and rotate items in 3D, dust for fingerprints, spray evidence to find traces of certain liquids, make plaster casts out of footprints, and even isolate music tracks with a mixing board. Many of the new mechanics are really neat, and they do help break up the monotony of investigating, but they're used too infrequently to have much of an impact. Like Phoenix, Apollo has the power to sense when someone's lying, though his ability is used only in court. Thanks to Apollo's magic bracelet, you can perceive when a witness is hiding something by zooming in on the witness and looking for a twitch or other slight movement. Unfortunately, perceiving when someone's lying involves some guesswork and a lot of tedious trial and error when you're hearing the same testimony over and over looking for a tiny, almost imperceptible movement. Another benefit of having the game designed specifically for the DS is the improved presentation. There are a few nice-looking full-motion video sequences, character sprites are larger and more detailed, and the courtroom, lobby, and detention center have finally been redrawn. None of these improvements drastically enhance the way the game plays, but when you're genuinely excited that there's a new piece of artwork in the defendant's lobby, you know it was time for a change. Apollo Justice's music isn't quite as catchy as the music in previous games (admittedly the bar has been set pretty high), but it's still enjoyable and fits each character well. It wouldn't be an Ace Attorney game without a few music references. If you've played and loved all of the previous Ace Attorney games, you'll be able to once again look past the series' inherent flaws and will love what Apollo Justice has to offer. If you're someone who feels that the franchise is in need of an overhaul, you'll likely be disappointed at how little things have changed. Problems and all, Apollo Justice: Ace Attorney is a good game that's worth playing."}