{"ref": "https://www.gamespot.com/reviews/a-plague-tale-requiem-review-picturesque-terror/1900-6417981/", "date": "October 17, 2022", "game_name": "A Plague Tale: Requiem", "text": "There's a sequence in A Plague Tale: Requiem's fourth chapter where you're forced to flee a literal tsunami of rats. As you jump from one stone rooftop to another, the swarm of plague-infested vermin sweeps through the town below like raging flood waters, toppling over buildings at their foundations and consuming anyone caught in its destructive path. It's a moment of Hollywood spectacle that showcases the remarkable advancements in technology since A Plague Tale: Innocence was released in 2019. Whereas the first game could handle 5,000 rats at any one time, its sequel can populate the screen with a staggering 300,000. This vast multiplication enhances the terrifying and oppressive nature of the series' signature rodents, but moments like this are an outlier; for the most part, Requiem feels very familiar to its predecessor.Although developer Asobo Studio has supplemented its stealth action gameplay with a few new additions, this sense of familiarity persists throughout the first half of the game. Like Innocence, Requiem puts you in the well-worn shoes of Amicia de Rune, a teenage girl who's tasked with protecting her younger brother, Hugo, as they traverse a plague-stricken, 14th-century France in search of a cure for his mysterious illness. Amicia is armed with a sling that can both kill helmet-less enemies and strike crates of conveniently-placed armor to create a distraction. You also have access to alchemical ammo that can either light fires or snuff them out, letting you navigate through the mischief of light-averse rats and use them to your advantage by shrouding enemies in darkness.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: A Plague Tale: Requiem Video ReviewAmicia is a more proficient fighter this time around, so you're able to counter armored enemies after being spotted and leave them stunned for a few seconds. If you have a single-use knife handy, you can finish them off with a killing blow, but knives are hard to come by and also double as a tool for opening padlocked workbenches. These hidden stashes are filled with various crafting materials, so I always found it more advantageous to hold onto any knives I could get my hands on rather than wasting them on a single kill. You can also use Amicia's sling to strangle unarmored enemies by catching them unaware from behind. There's an element of risk and reward in doing so, however, since the animation is fairly lengthy and it's not completely quiet.As a result of Amicia's fragility, most encounters in Requiem demand a stealthy approach, such as sneaking through tall grass, crawling under carts, and throwing pots to divert prying eyes. When you're not utilizing rats to devour the soldiers in your way, this distraction-based stealth isn't the most interesting and hasn't really evolved since Innocence. It makes sense within the context of the game and sells the relentlessness of the situation Amicia and Hugo are in, as the odds are stacked against them, and their entire existence essentially boils down to escaping death over and over again. But the environments you're in are often fairly linear and cramped, so your avenues of approach are severely limited. Unlike the first game, you can at least re-enter stealth after being caught by running away, losing line-of-sight, and hiding, but these early areas don't offer enough space to make this feasible, so restarting the section is usually your best option upon detection.Fortunately, the game starts to stretch its legs around five hours in, and this also coincides with the introduction of a few more tools and abilities for you to play with. Amicia eventually gains access to a deadly crossbow that can kill most armored enemies with a single bolt. To offset the weapons power, ammunition is scarce, so it's not something you'll be using often, but Hugo has a more reliable way of dispatching any enemies in your path: rats. The disease he's afflicted with has gradually deepened his connection with the plague-carrying rodents, giving you the chance to directly control the writhing mass and violently consume those unprotected by light. There's something disturbingly satisfying about watching a mischief of rats wash over people until there's almost nothing left, although controlling them is limited by a gauge that fills with use, putting Hugo's powers out of action for a while once filled.Amecia and Hugos circumstances make it difficult for the pair to trust anyone, but they are often joined on their travels by a number of companions who help out in either stealth or combat. Arnaud, for instance, is a gruff soldier who can be directed to fight enemies with the press of a button. He reliably wins one-on-one duels within a few moves, but he's loud and you'll need to lend a helping hand if he gets surrounded, otherwise he'll die and trigger a game over. Sophia, on the other hand, is a pirate you meet in the latter half of the game. She comes equipped with a shard of glass that can be used to deflect sunlight and set dry grass on fire. This provides a valuable distraction since any soldiers nearby will leave their patrol route to stamp out the small flame.The game starts to stretch its legs around five hours in, and this also coincides with the introduction of a few more tools and abilities for you to play withThese new toys add renewed energy and a semblance of strategy to encounters, especially in areas where the game opens up and allows you to navigate past enemies in more ways than one. Aside from offering multiple paths through a section, these larger maps also encourage you to adopt a particular playstyle--which is further incentivized by Requiem's skill system. By opting for the pacifist route, for example, and sneaking past enemies without being spotted or killing anyone, you'll unlock skills geared toward improving your stealth abilities--such as increasing your speed when crouched and dampening the amount of noise you make when moving. If you're aggressive, on the other hand, you'll gain access to abilities including a push that lets you shove enemies into fire or rats, and another that speeds up the amount of time it takes to choke out foes with Amicia's sling. You can mix and match approaches to unlock skills in each category, so there's an element of freedom present in how you shape Amicia's repertoire. If you have your eye on a particular skill, though, it's easy to find yourself compelled to adopt a specific playstyle.There's also some light puzzle-solving sprinkled throughout that's never too complicated and usually revolves around using various light sources to traverse through rat-infested areas. These moments provide a welcome change of pace, although there are a few too many instances where you need to push carts in order to climb up and reach higher levels, which feels both contrived and archaic. Similarly, there are a number of moments where you're forced into confined combat scenarios where the only way through is by killing everyone in your path. The role these sequences play in Requiem's story is impactful, as it chronicles Amicia's shifting attitude since the first game, and tackles the struggles and guilt she faces with each life she's forced to snuff out. But from a gameplay perspective, they offer little more than frustrating trial and error. Combat isn't especially difficult, but the game likes to punish you in order to underline Amicia's fragility. It feels like there's a correct path through these sequences, and you'll die over and over again until you can figure out what it is.Missteps like this are disappointing, not least because there's so much to love about Requiem's story and setting. The narrative picks up six months after the first game ended, with Amicia and Hugo traveling to the region of Provence in southern France, bordering the Mediterranean Sea. It's the beginning of summer, so this new setting infuses the game with an abundance of color and vibrancy that wasn't present in the original. It's utterly beautiful at times, with sunkissed fields bursting with the color of lavender and daffodil flowers, bustling markets draped in black and yellow banners, and windswept cliffsides overlooking an incoming thunderstorm. War and the rat-carrying plague are yet to puncture this region of France, so the game takes every opportunity to capture these quiet moments where you're surrounded by the vivacity of life and nature.At its core, Requiem feels like a game of stark contrasts. The picturesque setting and mesmerizing sights it frequently conjures make the influx of sudden violence all the more impactful, while also adding another element of terror to the darkness of night. You'll enter a town where people are shopping at a florist's stall, or taking in a street performance with exorbitant glee, and witnessing this makes it hit harder when the rats swarm in and leave the bare corpses of those same people in their wake. You see it reflected in Hugo, too, where the innocence of his childhood glee clashes with his harrowing circumstances, whether it's because he's wrestling with his disease and connection with the rats, exploding in anger at the world's cruelty, or struggling to deal with the horrible things he's seen.Amicia and Hugo's characterization is at the heart of Requiem's story and propels the narrative forward even when it occasionally stumbles. There's a sequence around halfway through where the game's relentless pace slows to a crawl so it can dump a load of exposition. This could've been tightened up and shortened, particularly since the game's last couple of hours feel overly drawn out. These are my only nitpicks with the story, though. The performances across the board are excellent, and I appreciate its authentic portrayal of anxiety and panic attacks as the consequences of their traumatic experiences finally catch up with Amicia. It can seem cruel at times, but Requiem tells a heartrending and powerful tale that's worth seeing through to the end.This is where that familiarity creeps in again, as the exact same thing can be said of the first game. A Plague Tale: Requiem excels in the same areas its predecessor did. Its stealth-action gameplay is uneven but has at least improved, introducing more tools for you to play around with and expanding in scope to provide more interesting avenues to explore when it comes to traversing past threats both human and rodent alike. The rats are still its most memorable feature, bursting from the floor like geysers and in more numbers than ever before. There's a lot to love in Requiem, even if frustration is an all-too-common bedfellow when it comes to gameplay. There are better stealth games out there, but its unique setting, poignant storytelling, and rat-infested dread make 14th-century France worth returning to."}