{"ref": "https://www.gamespot.com/reviews/devil-daggers-review/1900-6416374/", "date": "March 3, 2016", "game_name": "Devil Daggers", "text": "Devil Daggers uses the foundation of the shooter formula, stripped of spectacle as it hurtles toward simplicity. There's no narrative, no characters, no context surrounding your presence in a dark corner of hell--just precise mechanics and a harrowing pace.Hearkening back to Doom, Quake, and other '90s shooter fare, Devil Daggers touts a grainy art style and direct approach to combat. With the ability to fire daggers from your fingers at a growing tide of demonic enemies, you're placed on a platform in the middle of a black abyss--the only objective being survival, for as long as possible.In most cases, that won't be very long: Devil Daggers is overwhelming. All it takes to kill you is physical contact with one enemy. A score timer at the top of the screen indicates how long you've lasted, and during your first hour, it's an accomplishment just to pass 60 seconds in any given round. Devil Daggers compresses the shooter experience into a focused microcosm, stretching seconds into their own hectic chapters. As deaths go by and you learn the game's intricacies, your survival time increases, if only one terrifying second at a time.And there are intricacies here. Devil Daggers' dated appearance belies extensive nuance in its systems and the way they unfold. The hellish enemies are numerous, but also varied, exhibiting vastly different behaviors as they cover increasing space on the map. Giant centipedes descend from above. Horned demons change elevation to avoid damage. Poisonous insects force you to hurdle them as floating skulls pursue you from behind. Learning Devil Daggers means understanding its satanic inhabitants, and how best to deal with the dangers they present.This rings true when prioritizing certain opponents over others. Many of Devil Daggers' denizens are spawn towers, capable of spewing smaller minions into the area at specific intervals. They're also only vulnerable at specific weak points, so killing them means slower, measured tension, especially with a host of enemies on your tail.The decision process these towers entail adds another layer to combat: destroying them first might seem like the logical option, but if you ignore their putrid offspring, they'll cover the map, leaving less space for your escape if things go awry.This brings acrobatics and spatial awareness into the necessary skillset. As more enemies fill the map, the amount of safe zones shrink and, eventually, disappear--dodging enemies is tantamount to thinning their ranks. What's more, the map is a floating platform in the middle of endless black, and falling off means failure. As you circumvent spawn towers and lead enemies in a chase around the platform, the edge is an ever-looming concern. It keeps you out of your comfort zone, forcing you to weave through groups of demons, back toward the center, rather than just run away. An endless plane would be banal--a secluded circle is terrifying.Devil Daggers finds elegance in its simplicity.Devil Daggers supplements the fundamentals of movement and shooting with more subtle options that aren't apparent from the outset. For one, spawn towers and stronger enemies drop red diamonds which, if you accrue enough, upgrade your daggers for increased damage. These are enticing for later rounds. But they often lure you into traps, off the safer path outside of the demonic hordes.You can also use a shotgun blast as alternate fire, finishing off more powerful foes with relative ease. It also allows for a super jump if you fire at the ground at the exact moment you leap, launching you into the air, above dangerous swaths of demons.The shotgun's increased cooldown time doesn't bode well against groups, though, and the super jump can land you in areas more dangerous than before. Knowing which scenarios require which ability becomes another skill you gradually develop. These minutiae add to the learning process and, in turn, push your high score upward. Those numbers are rewards in themselves.But despite Devil Daggers' ability to find order in the chaos, it can sometimes buckle under its own weight. If you survive past the two-minute mark, the screen often becomes a mess of grainy textures, forming an ugly kaleidoscope of demon blood and polygonal centipedes. Devil Daggers' retro visual style fits with its mechanical themes, but in rare cases, it becomes a hindrance.Most of the time, though, Devil Daggers finds elegance in its simplicity. By stripping the pomp of many modern shooters, it reveals the complexity beneath, molding the fundamentals into something exhilarating, something always worth one more try."}