{"ref": "https://www.gamespot.com/reviews/guilty-gear-x-review/1900-2817426/", "date": "October 11, 2001", "game_name": "Guilty Gear X", "text": "There's no need for feeling guilty about still liking 2D fighting games in this day and age. Though the genre has seen few changes since the release of Capcom's Street Fighter II a decade ago, the fighting game remains characterized by its fast, responsive gameplay and competitive spirit--features that will never go out of style. Guilty Gear X, a visually impressive and altogether very Japanese fighting game, is good evidence that the genre isn't going anywhere, for better or worse. The game's bizarre yet likable characters, familiar mechanics, and colorful, high-resolution graphics can make it a lot of fun for fans of previous 2D fighting games. At the same time, Guilty Gear X offers little that hasn't been done before--not that its tried-and-true concepts don't make for fun matches. Guilty Gear X is actually a port of a Dreamcast game that was never released in this country, which itself is the sequel to the 1998 PlayStation fighting game, simply called Guilty Gear. As a sequel, Guilty Gear X offers what you might expect--better graphics, some new characters, and some new moves and techniques. Like in its predecessor, the far-flung setting of Guilty Gear X immediately stands out. Each of the game's 14 initially selectable characters looks unusual to say the least, though on the other hand, the game's roots in anime and manga are obvious, as is the direct influence of other popular fighting games on Guilty Gear X's character design. At any rate, the cast of Guilty Gear X--featuring well-built, strangely clothed lanky guys with names like Axl Low, Chipp Zanuff, and Sol Badguy, and cute yet not-so-surprisingly powerful gals like Jam Kuradoberi and Millia Rage--will more than likely make or break the game for you. If you can't deal with special moves with such names as ~Mr. Dolphin!~ and ~Dim Bomber,~ or characters that look nothing like normal people, then you won't like Guilty Gear X. These same things might just as soon attract you to the game, though. Guilty Gear X is the sort of game that provides a brief glimpse of how different gaming can be in Japan compared with this country, and if nothing else, it's always good to see domestic versions of games that are so decidedly foreign. The gameplay isn't nearly as weird as the game's style and appearance might first suggest. If you're familiar with other 2D fighting games, you'll soon recognize that most every one of the game mechanics found in Guilty Gear X can be traced directly to some other fighting game either by Capcom or by SNK. Guilty Gear X uses the PlayStation 2 pad's face buttons for attacks--your character can execute punches, kicks, and light and heavy slashes with his or her weapon of choice. The game takes many cues from the spectacular battles of Capcom's Marvel Superheroes games, in that most characters can dash back and forth, execute super jumps several stories high, chain together strings of punches, slashes, and kicks, block in midair, counterattack from a blocking position, and much more. Guilty Gear X also borrows Street Fighter Alpha III's midair recovery system--you can juggle your opponent with consecutive hits in midair, but the opponent has a chance to snap out of it by pressing two attack buttons simultaneously as he's getting pounded.Something called the ~tension gauge~ builds up over the course of a match as you execute attacks. Once you've stored up enough ~tension,~ you can execute super moves, counter hits, and also what are called ~roman cancels,~ which are used to instantly cancel out any attack to create otherwise-impossible combos. The tension gauge has a few other applications. You can use it to go into a special defensive posture that makes you invulnerable for a short while. Special moves normally sap a bit of your health even if you block them, but not if you use this ~faultless defense~ technique. Characters can also execute what are aptly called ~instant kill~ moves. You can usually see these moves coming from a mile away, but that doesn't mean you'll avoid them. If you don't, you'll take a serious beating and you'll lose the round right then and there, regardless of how much health you had left. Thankfully, since these moves require most of a full tension gauge, which starts to empty at the beginning of each round, instant kills aren't quite as overpowering as they might sound. They're a last resort that will keep you on your toes when you might otherwise think you've got your foe beat. Guilty Gear X controls smoothly and precisely for the most part, but the action appears very chaotic onscreen. Characters fly all about during matches, and extremely aggressive--even reckless--fighting tactics tend to dominate, which makes the faster characters seem significantly stronger than the slower, less maneuverable ones. Guilty Gear X looks good, but it's one of those rare games that can look better in still shots than in motion. The high-resolution character sprites look rather like cell drawings from a cartoon. The characters are well detailed and sometimes animated very smoothly, but sometimes not. The game moves quickly--it can be hard to tell what characters are actually doing in some of their attacks, hard to get a good sense of how much range and power many of the attacks have, and even sometimes hard to tell whether your attacks are hitting the enemy or getting blocked. All this contributes to the chaotic feel of the action, especially with all the iridescent special effects going off all at once. The gaudy, flat backgrounds are nice but don't help this matter. The X in Guilty Gear X must stand for excess. What little English speech there is in Guilty Gear X is rendered unintelligible, if not from thick Japanese accents then from the fact that most of the game's speech and sound effects are disappointingly muffled. Still, there's plenty of talking going on during battles, which makes them sound interesting even if you can't make out what's being said. Meanwhile, the game's announcer, who's apparently a robot covering his mouth with his hand, judging from the sound of him, doesn't provide much motivation. On the other hand, the game's musical score--featuring plenty of synthesized electric guitars--is very well suited to the game's fast-paced action, as well as its anime theme. Guilty Gear X is pretty bare-bones in terms of its features. There's the arcade mode and a versus mode, a survivor mode where you keep on fighting until you lose, and a practice mode where you can try to figure out some of the game's finer points. The computer provides a good challenge even at the standard difficulty, though as with any fighting game, you'll have a better time playing Guilty Gear X with a friend. All in all, Guilty Gear X does its job quite well--it's a graphically remarkable yet otherwise conventional 2D fighting game that plays well, sounds good, and offers a memorable lineup of cool characters with countless crazy moves. If you like a little more flair in your fighting games, and especially if you like the game's anime graphics style, you'll find that Guilty Gear X plays just as good as it looks.Something called the ~tension gauge~ builds up over the course of a match as you execute attacks. Once you've stored up enough ~tension,~ you can execute super moves, counter hits, and also what are called ~roman cancels,~ which are used to instantly cancel out any attack to create otherwise-impossible combos. The tension gauge has a few other applications. You can use it to go into a special defensive posture that makes you invulnerable for a short while. Special moves normally sap a bit of your health even if you block them, but not if you use this ~faultless defense~ technique. Characters can also execute what are aptly called ~instant kill~ moves. You can usually see these moves coming from a mile away, but that doesn't mean you'll avoid them. If you don't, you'll take a serious beating and you'll lose the round right then and there, regardless of how much health you had left. Thankfully, since these moves require most of a full tension gauge, which starts to empty at the beginning of each round, instant kills aren't quite as overpowering as they might sound. They're a last resort that will keep you on your toes when you might otherwise think you've got your foe beat. Guilty Gear X controls smoothly and precisely for the most part, but the action appears very chaotic onscreen. Characters fly all about during matches, and extremely aggressive--even reckless--fighting tactics tend to dominate, which makes the faster characters seem significantly stronger than the slower, less maneuverable ones. Guilty Gear X looks good, but it's one of those rare games that can look better in still shots than in motion. The high-resolution character sprites look rather like cell drawings from a cartoon. The characters are well detailed and sometimes animated very smoothly, but sometimes not. The game moves quickly--it can be hard to tell what characters are actually doing in some of their attacks, hard to get a good sense of how much range and power many of the attacks have, and even sometimes hard to tell whether your attacks are hitting the enemy or getting blocked. All this contributes to the chaotic feel of the action, especially with all the iridescent special effects going off all at once. The gaudy, flat backgrounds are nice but don't help this matter. The X in Guilty Gear X must stand for excess. What little English speech there is in Guilty Gear X is rendered unintelligible, if not from thick Japanese accents then from the fact that most of the game's speech and sound effects are disappointingly muffled. Still, there's plenty of talking going on during battles, which makes them sound interesting even if you can't make out what's being said. Meanwhile, the game's announcer, who's apparently a robot covering his mouth with his hand, judging from the sound of him, doesn't provide much motivation. On the other hand, the game's musical score--featuring plenty of synthesized electric guitars--is very well suited to the game's fast-paced action, as well as its anime theme. Guilty Gear X is pretty bare-bones in terms of its features. There's the arcade mode and a versus mode, a survivor mode where you keep on fighting until you lose, and a practice mode where you can try to figure out some of the game's finer points. The computer provides a good challenge even at the standard difficulty, though as with any fighting game, you'll have a better time playing Guilty Gear X with a friend. All in all, Guilty Gear X does its job quite well--it's a graphically remarkable yet otherwise conventional 2D fighting game that plays well, sounds good, and offers a memorable lineup of cool characters with countless crazy moves. If you like a little more flair in your fighting games, and especially if you like the game's anime graphics style, you'll find that Guilty Gear X plays just as good as it looks."}