{"ref": "https://www.gamespot.com/reviews/hello-kitty-roller-rescue-review/1900-6131608/", "date": "August 19, 2005", "game_name": "Hello Kitty: Roller Rescue", "text": "For those of us who are male, our experience with Sanrio began and ended in junior high, with notes written to us by girls on Keroppi-covered stationery. Well, that's where it ended for most of us, at least. At any rate, if it wasn't abundantly clear already, Hello Kitty: Roller Rescue is not a game aimed at the Halo and Grand Theft Auto crowd. But for the adolescent girls it's targeted at, the game does a fine job at capturing the cuteness of the Sanrio universe in video game form. Hello Kitty Roller Rescue oozes cuteness from start to finish. Roller Rescue is a single-player, 3D, action adventure game that puts you in the dainty shoes of Sanrio's signature character, Hello Kitty. To put it more precisely, you're actually in roller skates. The plot centers around an invasion of Earth being carried out by the menacing Block-O king. His alien army has overrun Sanriotown, so it's up to our heroine to roller skate around the game's 16 different levels, defeat Block-O troops along the way, and rescue family members and other denizens of the quaint town. If you're familiar with Sanrio, you'll be sure to recognize many of the characters as you get through the campaign, including Purin the dog, Pochi the alligator, and the Little Twin Stars. Many of them will assist you throughout the levels, and some can even fight alongside you in later missions as your sidekick. It's just unfortunate that the most popular Sanrio characters, such as Badtz-Maru and Pochaco, make only brief cameos. The sidekicks you pick up over the course of the game consist of much-less-popular toons, such as Tabo and Monkichi. Keroppi, arguably the next most-popular Sanrio character after Hello Kitty, appears throughout the game, but only in a detached, advisory capacity. The core gameplay of Roller Rescue is like a platformer married to a beat-'em-up. Hello Kitty begins the game with a magic wand that she can use to bonk enemies on the head. Repeated thwappings will defeat them and yield coins or stars. By mixing up presses of the attack button with the jump button, you can unleash combo attacks, but for the bulk of the game it will suffice to simply mash the basic attack button. You'll also be able to pick up coins lying about the levels, which can be used in between levels to unlock character profiles, videos, and music. Within a level, you can use the money you collect to buy cakes from special kiosks to restore your health. The stars you collect fill up a separate power meter, which can be filled up two times. Depending on how many times you've filled your star meter, you'll unleash one of two different magical attacks, which make clearing areas full of enemies a snap. The overall gameplay is pretty easy, and you can rely on your radar and large flashing arrows onscreen to tell you exactly where you need to go next. This is nice for keeping smaller children from getting frustrated. You can change into new outfits between levels. In between levels, you're taken back to Hello Kitty's house, where you can interact with the family members you've rescued, save your game, purchase unlockable content with your coins, and change into one of the many outfits you'll unlock as you complete levels. The clothes are purely cosmetic--they don't give you special attributes, but there is a good variety of them, helping to show off Hello Kitty's stylishness. One complaint we have about the interface here is that the game doesn't autosave, for some odd reason. After beating a level, you always have to talk to grandpa to get to the save screen and save manually. We can see smaller children forgetting to do this and becoming frustrated when a couple levels of work are lost. Though light platforming and puzzle-solving elements are included, it's a little surprising that a game so clearly targeted at girls would rely so much on fighting as its primary game mechanic. Certainly the ~violence~ in the game, if you can even call it that, is about as intense and graphic as a Care Bears cartoon. But parents who are very sensitive to the subject may give pause before buying the game for a young child. On that note, the game's best parts are arguably the boss levels, which are pretty numerous and offer a nice, varied experience for what amounts to a pretty short game (an experienced gamer should blow through it in a couple of hours). The boss fights are numerous and fun. Roller Rescue doesn't disappoint in its presentation, either. The translation of the characters to 3D is excellent, and the gameworld effectively captures the cute, whimsical attitude you'd expect from a Sanrio video game. Strong lines and vibrant colors set off both the characters and gameworld nicely, while the music in the game is largely pleasant and soothing. There's no voice acting in the game, so characters communicate via talk bubbles. That's probably a good thing, in this case. If you're looking for a cute video game to give to your favorite Sanrio fan, Hello Kitty: Roller Rescue is probably a good choice. It's a nice little kids' game, and its only major drawbacks are that it's rather short and that you don't get to see enough of the most popular characters."}