{"ref": "https://www.gamespot.com/reviews/mario-kart-live-home-circuit-review-making-tracks/1900-6417584/", "date": "October 14, 2020", "game_name": "Mario Kart Live: Home Circuit", "text": "There's an old truism in gaming circles that Nintendo is a toy company at its core. This is both praise and critique, expressing a sense of wonderment over the company's ability to tap into childlike playfulness and bafflement at some of its esoteric hardware decisions. Mario Kart Live: Home Circuit may be the purest recent expression of the ~Nintendo as toy company~ ethos. For one, it revolves almost entirely around an actual toy: a tiny camera-equipped go-kart that you race around your real-life house. But more broadly, it behaves the way the simplest toys do, by giving back only as much as the effort you put into creative play.That's because the core pillar of Mario Kart Live is making your own tracks. The game comes with four numbered gates that help define your track. These are made out of unfolding cardboard, like the natural evolution of Nintendo Labo. Once you've laid down your track and any real-life objects as hazards, you need to run through it once, pace-car style, before starting the race. Choosing the main Grand Prix mode populates your Augmented Reality (AR) track with four Koopaling opponents, and then you're off to the races.Once you're actually in a race, it operates like any other Mario Kart game. You keep your eyes on the screen--watching your real-life kart is a surefire way to lose--and you see visual effects like Item Blocks and virtual hazards littering the track. And while the kart actually moves relatively slowly in its slowest setting, it actually looks reasonably fast on-screen with the camera set so low to the ground.Surprisingly, seeing how well the usual suite of Mario Kart mechanics has been translated into this new format really is the magic moment of the game. Drifting actually works exactly as you'd expect it to, at least on the screen, as you drag a little askew and then get a sudden boost of speed. Mushrooms give you a longer boost, while hazards and obstacles slow or stop your kart completely. The physical kart even zips around noticeably faster at 150cc and 200cc than at the beginner 50cc.Seeing how well the usual suite of Mario Kart mechanics has been translated into this new format really is the magic moment of the game.Your reward for racing through these events and collecting coins is customization options. You can swap out your kart, your racer's outfit, and your horn. These are cute effects, and even though they only show up on-screen, they have a nice sense of variety to them. I'm partial to my Pirate Mario outfit, which swaps out his traditional cap for a giant tricorn and complements the ensemble with an eyepatch. But more significant are the track parts themselves. Those actually have an impact on gameplay by giving you an ever-growing suite of options for your DIY tracks. Gate types let you add new in-game effects to your four gates, while stage types add general hazards like lava or ice blocks.The best parts of Mario Kart Live are the ideas that should migrate back into the main series. A Magikoopa effect reverses the track on you spontaneously, similar to Mirror Mode but even more dynamic and skill-testing. My favorite addition, a G clef item, will spawn a line of music notes to collect and then reward you with an extra item box separate from the usual ones available at the gates.Other new ideas are less successful, especially due to the game's real-world physicality. A powerful wind effect is designed to make you feel as if your kart is being veered off-course, but in practice it just feels like you lose control of your remote go-kart at frustrating, inopportune moments. A similar struggle occasionally presents itself with the Magikoopa, since you may be mid-turn when the kart is suddenly instructed to interpret your steering in reverse.When you lose control of your kart this way, you raise the chances of slamming into an actual, real-world table leg, stair, or wandering pet. Unlike in a traditional Mario Kart game, Lakitu won't lift you out of danger automatically. You need to manually back out your kart and get back on-course yourself, compounding the frustration when it feels like control was taken from you by the wind.That real-world physicality manifests itself in other less-than-ideal ways too. Mario Kart games usually get a lot of mileage out of their verticality, and Mario Kart 8 made a point of wildly swirling anti-gravity tracks. But the go-kart toy struggles with relatively shallow inclines, so you can't reasonably make a track that takes full advantage of hills and valleys. I was never brave enough to try making a jump, and I can't recommend it--the toy is relatively hearty but I wouldn't risk damaging it, especially given the $100 price tag on them. After a while, all of your created tracks running across the same flat surface starts to feel samey, akin to the flat Mode-7 tracks in the very first Mario Kart game.Perhaps the biggest problem, though, is the way Grand Prix races are structured. These are a series of three races with different stage effects, but there's no option to change your track midway. On one hand, this is understandable--it would certainly slow down the feeling of a Grand Prix if you kept having to pause to rearrange all of your track pieces. But instead, you just run the same track for three races in a row. Instead of the classic Grand Prix, in which you tour a variety of different locations through the tracks, you're doing the same race over and over with slightly different set dressing. It makes the whole experience wear thin that much faster.Since you're making the tracks yourself, it's trivially easy to cheat the system and give yourself access to exclusive shortcuts that aren't available to your AI competitors, who will always follow the exact track line you draw without deviation. This would be resolved with human opponents, but for review we only had access to one kart toy. Expecting players to buy two of these toy sets for a tougher (and smarter) opponent seems like a difficult ask.That said, cheating the system is really only cheating yourself out of the experience. There's fun to be had in Mario Kart Live: Home Circuit, but you have to invest in it. The more work you put into making your go-kart track craftwork unique, the more enjoyment you'll get out of racing, with or without some frustration and repetition. Mario Kart Live isn't going to have the long-term appeal of Mario Kart 8 Deluxe, but with some imagination and ingenuity, you can make it something special."}