{"ref": "https://www.gamespot.com/reviews/skate-3-review/1900-6261859/", "date": "May 11, 2010", "game_name": "Skate 3", "text": "Skate 3 doesn't reinvent the wheels. Nor does it reinvent the decks, the trucks, or any other aspect of the Skate series. This sequel is as noteworthy for the features that it cuts from Skate 2 as it is for those that it introduces, yet this is still a better game than its predecessor. Challenges are varied and cater to players of different abilities, you have more tricks in your repertoire, and longevity comes courtesy of robust park creation tools and impressive online features. There are some problems--mostly caused by the unpredictable AI of pedestrians and other skaters, as well as the inconsistent frame rate--but goofy or regular, there's plenty of fun to be found in the new, skater-friendly city of Port Carverton. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Skate 3 Video Review Having made a name for yourself as a pro skater in the previous game, the setup in Skate 3 now has you looking to establish your own team and skateboard business. The only noticeable effect that this has on gameplay is that your overall career score is measured in board sales and you now compete alongside teammates in both solo and online events. Those events are much the same as those in previous games and include races, street and vert competitions, film and photo shoots, games of 1-up (take it in turns to beat scores set by another skater), and ~hall of meat~ challenges in which you deliberately break bones. Though you can still choose to play them online, the frustrating S.K.A.T.E. challenges that require you to perfectly copy tricks performed by opponents are, thankfully, no longer included in single-player. That's definitely a good thing because even now that you're clearly shown what you need to do with the right analog stick to repeat a trick, the controls--which also incorporate numerous button presses--lack the necessary precision. Also gone from the single-player game are the anti-skater clips and caps that rendered certain areas unskateable until you unlocked them, as well as the security guards who chased you away from company buildings in Skate 2. These omissions give you the freedom to skate wherever you like in the large and nicely detailed city, but they also make it a little less interesting because removing clips and caps gave a good sense of progression, and fleeing from security guards was fun sometimes. With its university campus, docks, memorial gardens, downtown area, residential neighborhood, and multiple skate parks, Port Carverton has a good number of varied locales to explore. The problem is that you're given very little incentive to do so. With the exception of ~own the spot~ challenges at locations you haven't discovered yet, you can access all of the challenges that you complete to sell more boards via the pause menu, so there's no need to skate between them. The number of boards that you're credited with selling after completing a challenge depends not only on the difficulty of the challenge, but also on whether you merely ~own~ the challenge or ~kill~ it outright. These two different levels of completion are a great addition to Skate 3 because, unlike previous games in which certain challenges were tough enough to halt your progress for a time, here you only need to own them to move forward, which is rarely difficult. To kill a challenge, which you can attempt at any time after owning it, you need to rack up significantly better scores and, often, perform specific types of tricks while doing so. Regardless of whether you're attempting to own or kill a challenge, Skate 3's unpredictable and occasionally boneheaded AI can make succeeding a little trickier than necessary. For example, pros that you're challenged to follow will occasionally fall off their boards and then push themselves into walls for several seconds while you wait for them to get going again. And in team races and trick events, it's not unusual for teammates to drag you down with subpar performances that cause your team to lose even though you personally put in a great performance. You might even witness a teammate fail to score a single point in a trick event--meaning that even a simple ollie was too much to ask of him in 90 seconds of competition. Furthermore, skaters who are seemingly oblivious to your existence will regularly get in your way, and while punching opponents is a viable option during races, the same can't be said when you're in midair or mid-grind, or when the problem is a teammate. Some of the Hall of Meat setups aren't so much falls as they are freefalls. During one contest, in which you perform tricks around the edge of a skatepark, opponents even stand around in your way while awaiting their turn. They start in those positions during the ~jam~ round of the contest when everyone skates simultaneously, but there's no reason for them to be there like mannequin roadblocks during your solo run. Pedestrians are less of a problem, and it's helpful that they flee in fear anytime you perform a simple gesture using the D pad. They don't always flee in a direction that clears a path for you, though, and they even wander around in areas where organized skate competitions (complete with grandstands, spectators, announcers, and plenty of sponsorship) are taking place. Pedestrians can still be problematic when you play online but replace the AI skaters with other players, and the already-fun challenges and contests from the single-player game are immediately made more enjoyable. Furthermore, additional online options are among the best features that Skate 3 has to offer, such as the Domination gameplay mode in which you skate simultaneously with an opponent and attempt to best each other's scores on multiple objects in the same environment. You can establish or enter into an online team that functions in much the same way as a guild or clan in other online games. And if you take the time to create and upload photos or short movies of your skating antics, you earn more board sales (which count toward both unlocking content and your position on the leaderboard) anytime another player views and rates your content. Photos taken during photography challenges involving magazine covers and the like can be shared along with custom creations, but the photographers you work with in the challenges rarely give you a lot to work with and occasionally take up laughably bad positions from which to take their shots. Yes, you get to play around with the zoom, contrast, and coloring of those photos, but that doesn't always help if you're a long way from the photographer or obscured from view completely. If you want to take user-generated content a step further, you can use powerful park creation tools to build your own skater-friendly environments using ramps, rails, and dozens of other unlockable objects. You can build a simple street setting, a supersized stadium, or just about anything in between--either from scratch or from a template. The tools--which you can also call up anytime you want to spawn a new object in the city--are surprisingly easy to work with, and you're free to share your parks in the exact same way that you do photos and movies. It's very satisfying to create and share content in this way, and it's fascinating to check out other players' creations as well. Favorite photos and movies can be bookmarked, and you can even use other players' parks as the basis for your own after you download them. Another neat online feature is that anytime you start the game, you have the option to view a feed detailing what your friends and teammates have been up to, whether it's earning achievements/trophies, beating your scores, or uploading new content. The powerful park creation tools are surprisingly easy to use. Clearly, Skate 3 has its fair share of mostly minor problems. But this is the best game in the series regardless, and given the state of Activision's Tony Hawk series right now, that makes it the best skateboarding game around by default. Skate 3 isn't likely to win you over if its predecessors failed to do so, but it goes a great job of catering to newcomers and experienced players alike, and it's one of very few games that makes even the act of breaking your own bones fun."}