{"ref": "https://www.gamespot.com/reviews/strike-fighters-project-1-review/1900-2896434/", "date": "November 1, 2002", "game_name": "Strike Fighters: Project 1", "text": "Strike Fighters: Project 1 has already been released once, in a fiasco in which an early version was put in a box and sold at the retail chain Wal-Mart to meet a shipping deadline and then withdrawn just as quickly. Three months later, the game is back as an ~official release.~ And unfortunately, Strike Fighters might be the only game that has ever been released twice in an unfinished state. The idea behind the game itself is great: Take a period in aviation history that hasn't gotten a lot of attention in flight simulator games and build an expandable simulation that revolves around some of the most interesting and beloved aircraft of the time. In true survey-sim fashion, Strike Fighters avoids turning into a gadget show that requires you to fiddle with a thousand knobs and buttons on your planes' control panels, and this approach is actually pretty realistic, since the avionics in the real-world aircraft featured in Strike Fighters were fairly primitive in the first place. And development of the game involved Tsuyoshi Kawahito, the designer of the classic European Air War and the programmer of the even more highly esteemed Longbow 2, so Strike Fighters had the potential to be an absolutely essential game for all computer pilots. If the game had actually been finished by the time it was shipped, this might have been the case. Currently, Strike Fighters lets you fly four standard aircraft: the A-5 Skyhawk, the F-100 Super Sabre, the F-104 Starfighter, and the F-4 Phantom II (though in multiplayer, you can also fly Soviet-built MiG jets). The Phantom II is really the centerpiece of the sim, as it has a truly unique flight model: It has a lot of power, but it handles like a brick. If you played EA's 1999 simulation Jane's USAF, you may remember the physics on the Phantom II in that game--and as it turns out, Strike Fighters does a better job of conveying the way this powerful fighter jet handles. In fact, Strike Fighters does a great job of modeling just about all the aircraft it features, and you really have to learn how to handle these early jets much differently than you would a modern F-22. These jets bleed airspeed like crazy, even in relatively shallow turns, and this is exacerbated by the fact that the Soviet-built planes generally have much more horizontal maneuverability than the other jets, so you have to play to your strengths. Strike Fighters' modeling of air-to-air missiles gives you a good idea of how unreliable and difficult to use the early models were. Additionally, the realistic difficulty in using missiles in air-to-air battles leads to a lot of intense dogfights in which a missile launch rarely means an automatic kill, and in which guns are your most reliable asset. The challenges in the game aren't technical but a matter of flying skill, so you might compare it to Rowan Software's 1999 MiG Alley, since both games offer a new flight experience that hasn't been featured in a flight sim in a while. Strike Fighters' graphics range from incredible, especially its aircraft models, to serviceable, especially its terrain. The realism of the game's flight model also scales nicely, so Strike Fighters gets off to a good start. Unfortunately, once you really start playing the game, you'll notice Strike Fighters' problems, as well as some of its conspicuously missing features. One of the biggest is the complete lack of any surface-to-air missiles (SAMs) or antiaircraft artillery (AAA). In a game in which you spend a fair amount of time flying ground-attack missions, this is a big problem. Also, the game's terrain textures sometimes go missing, especially over water. Strike Fighters' collision detection with the ground is also unreliable, and the game simply doesn't have ground explosions for weapons. The game's planning map is essentially useless, since it has no zoom levels. And while we were able to play the game without experiencing severe problems, other users have reported technical problems that include frequent crashes of the game to their computers' desktops. Strike Fighters was designed to be an expandable game that could easily support both official and user-made add-ons. There are certainly plenty of aircraft to choose from as candidates for future inclusion (the F-8 Crusader and F-105 Thunderchief are notable examples), but since the game doesn't have a compelling campaign, it doesn't seem like adding these missing planes would help much. The dynamic campaign included in the game is set in a fictional desert war circa 1959 between two fictional countries, one with Soviet weapons and one with arms that are US-built. A simulation like this is crying out for a Vietnam theme, and while the desert setting is a way to get around having to build a terrain engine that can model large numbers of trees, it seems a bit sterile. It's hard to recommend Strike Fighters as it is. The core gameplay is actually quite good, and it's tempting to just overlook the bugs and missing features and focus on the game's strengths. Unfortunately, there are too many of these bugs and missing features to ignore. A stable version of Strike Fighters with fully functional ground-to-air defenses, ground-collision detection, a bigger theater of war, and a steady stream of new flyable aircraft would have been a terrific flight simulation. Developer Third Wire has promised to support and fully patch the game, but there probably isn't much reason to pick up the game in its current state. Considering the fact that many flight sims really took off after their retail release (and after numerous patches and updates), it's possible that the game could improve in the future, but out of the box, Strike Fighters is more than a little disappointing. Then again, the war isn't going anywhere."}