{"ref": "https://www.gamespot.com/reviews/broken-sword-5-the-serpent-s-curse-part-ii-review/1900-6415739/", "date": "April 22, 2014", "game_name": "Broken Sword 5: The Serpent's Curse", "text": "The camera slowly pans over the rolling yellow and green hills of Catalonia, a Spanish community nestled between France and the Mediterranean Sea. In Broken Sword 5: The Serpent's Curse, George Stobbart and Nico Collard leave London and Paris behind, traveling to this quiet landscape after deciphering clues hidden within a painting that stands at the center of a murderous conspiracy.Mere hours before they stepped out onto the Spanish countryside, they were rescued from atop a burning building, set alight by one of the game's key antagonists: a man whose true identity and purpose remain unknown. As George and Nico are standing at the dilapidated entryway of the Castell del Sants, the tragic epicenter of the story, the pensive calm is shattered by gunfire aimed at them from inside the building--out of the frying pan and into the firing range.The two protagonists leave the first chapter with the elusive painting La Malediccio in hand. The enigmatic Gnostic imagery that enshrouds the canvas has led George and Nico to the aging castell, where they hope to decipher the meaning behind its cryptic symbology. They are soon led to a gorgeous town in the scenic Spanish mountainside, and later, to the parched amber sands of modern-day Iraq. The game discards the urban sprawls and embraces nature, a move that bolsters the impact of the already impressive aesthetics. The hand-painted environments range in scope from imposing mountains, which are home to soaring eagles, to archaic monasteries and Gnostic shrines stained and cracked with age.Since the first episode's release late last year, the developer has released a large update allowing you to make the game match your current resolution. If you run your computer at a 1080p resolution, you now have the option to make the game match your settings, which should improve many of the finer details within the environments. The visuals are not without some problems, such as the occasional dropped frames and animation oddities. Thankfully, graphical issues are rare. The second part doesn't come free of other glitches, however. There is a small chance the game will crash directly to the desktop. Worse than that, I once loaded my quick-save file to discover that George and Nico had completely disappeared from the scene. Though I could click on objects to hear George's internal monologue describing them, he had somehow vanished into the ether. Luckily, I had another save file to fall back on.The game touches upon some heady subjects, mostly revolving around the conflict between Gnostic and Dominican Christians. The second part delves even more deeply than the first, covering the religious theme of two ~opposing sides~: the devout, who believe the world is ruled by order, and those who embrace freedom of human expression, and don't devote their lives to following traditional theisms. George, a skeptical man by nature, stands in between. He is presented with a challenge: follow one side over the other or, perhaps, find a balance between the two. Not unlike prior games in the series, Broken Sword 5 also delves into the metaphysical realm late in the game.Broken Sword 5's second chapter puts more focus on puzzle solving over the investigations involving exploration and the conversations that established the first part. The move makes the chapter an even more linear adventure than before, discarding the map system that allowed you to warp between locations tracking down clues. Some of the puzzles are noticeably more difficult, demanding more chin rubbing than usual. They challenge you to decipher messages such as a telegram yellowed by age and an ancient artifact on which lies the directions to a lost biblical paradise.Though the puzzles still deliver satisfaction when completed, most aren't especially engaging, nor are they anything that hasn't been experienced in adventure games before. Others, however, adhere to the series' penchant for including complex puzzles you solve by using an eclectic mix of items stored in your inventory--the Broken Sword series has long been known for its unusual puzzles and their intricate, sometimes-out-of-the-box solutions. During the second chapter, you control George as he hammers out a religious tune using cans of paint and an old oil drum. In another moment, he fixes a complicated piece of hardware using a biscuit-loving cockroach, named Trevor, which occupies an empty matchbox that George has carried around since early into the first half of the game.With the map system discarded, the game funnels you onto a path broken up by brief moments of puzzle solving. It's a shame, because the linearity removes the need to explore the world and engage in conversations, which I found to be the most memorable part of the game's first half. I was enthralled by characters who populated the starting chapter of Broken Sword 5, and their departure causes the game to lose some depth and energy.The second part isn't completely devoid of narration, however, and moments of interaction are fortified with strong writing and voice acting. The protagonists are briefly joined by a new ally, Eva Sanchez, and George is reunited with two old friends who graced the first two Broken Sword games, Duane and Pearl Henderson. Much to George's chagrin, the disgruntled goat that gave nightmares to those who played Broken Sword: The Shadow of the Templars makes a return early in the second half of The Serpent's Curse. But fear not: the goat that some publications dubbed one of the most difficult puzzles ever is graciously declawed, providing a simpler puzzle, and is mainly there for nostalgia--perhaps to evoke a little terror as well.Broken Sword 5's second part is noticeably shorter, coming in at fewer than five hours when compared to the first part's six, and its linear nature diminishes the joy of exploration. Nevertheless, Broken Sword 5: The Serpent's Curse is a solid installment in the nearly 20-year-old franchise, delivering a captivating story with great characters and loads of good-natured humor. We'll have to see if the combination is enough to warrant another adventure, but until then, The Serpent's Curse achieves its goals, giving George and Nico one more shot at the limelight."}