{"ref": "https://www.gamespot.com/reviews/teenage-mutant-ninja-turtles-3-mutant-nightmare-re/1900-6142433/", "date": "May 17, 2006", "game_name": "Teenage Mutant Ninja Turtles 3: Mutant Nightmare", "text": "Ever since Konami reacquired the rights to produce games based on the Teenage Mutant Ninja Turtles property, the company has churned out one mediocre beat-'em-up after another. Teenage Mutant Ninja Turtles 3: Mutant Nightmare for the Nintendo DS does nothing to reverse the trend, although its silky-smooth graphics and Turtle-inspired combat may be enough to satisfy some truly diehard TMNT fans out there. Everyone else, however, will likely lose interest quickly, whether due to the game's overly repetitive combat and platforming, or as a result of frustration brought on by the unresponsive controls and the various puzzle and touch screen gimmicks that feel tacked on and intrusive. TMNT 3: Mutant Nightmare is 50 percent beat-'em-up, 30 percent platformer, and 20 percent puzzles. Many of the game's superficial aspects are downright pleasant. Konami has transformed the most recent seasons of the cartoon show into a side-scrolling beat-'em-up with some platforming and puzzle-solving mixed in. Players can play through the game as any of the four turtles, facing off against recognizable enemies along the way, such as the Triceratons, Dr. Stockman, and Shredder, and also encountering familiar friends, like the Fugitoid and Casey Jones. Graphically, this is one of the better-looking side-scrollers in recent memory. The 2D character sprites are large, smoothly animated spitting images of their cartoon counterparts. Every character, good or bad, has numerous attacks and goofy facial expressions that add some personality to the goings on. The backgrounds are drawn in the same Technicolor style as the cartoon, and there's also a fair amount of subtle depth to take in, thanks to the combination of 2D and 3D background layers. The overall effect is identical to what Konami accomplished in Castlevania: Dawn of Sorrow, with buildings and clouds in the backdrop gradually changing orientation as you pass by them in the foreground. And, although the audio in Mutant Nightmare doesn't quite achieve the same standard as Dawn of Sorrow, its series-inspired music and frequent use of turtle voice clips suit the action perfectly. Mutant Nightmare also offers more levels than the typical beat-'em-up. The single-player story mode is broken down into four chapters, each containing six levels, for a grand total of 24 levels. The actual level count is somewhere closer to 40, however, because some levels are completely different depending on the character you pick. Each turtle can also access certain rooms in some levels that the others can't. Raphael can push heavy boulders out of the way, for instance, which lets him uncover hidden passageways that the others have no chance of accessing. Apart from seeing all the different levels, there are other incentives for playing through the game with all four turtles, such as unique ending scenes for each turtle, and the special bonus that's unlocked when you've gathered up all of the crystals located within every level. Even though the story mode is the game's main focus, there's also a battle mode to dabble in, which can be played solo or with as many as three other friends by linking multiple copies of the game together using the system's local Wi-Fi capabilities. Multiplayer is a bonus more than anything else; it simply involves gathering up crystals in smaller variations of the main levels, but the option to play cooperatively in addition to free-for-all does ensure a few extra laughs, at least. Wisely, Konami didn't try to get too elaborate with the way combat works. The controls are laid out simply enough, with three buttons labeled jump, attack, and special attack, respectively, along with a few so-called tag moves that are activated by tapping hotspots on the touch screen. Combat occurs on a 2D plane, but in most spots you can dangle from ledges or jump onto platforms to wrangle some breathing room. Each turtle has a good assortment of attacks for use close-up and in midair, as well as a long-distance attack and a pair of special attacks that are useful in certain situations. Meanwhile, pressing the attack button multiple times will cause your turtle to perform a predefined sequence of attacks. Tag moves feel like a gimmick that was tacked on solely to play up touch screen support, but they're not altogether unpleasant. By tapping hotspots on the touch screen, you can summon a second turtle to shove objects out of the way, give you a boost to distant handholds, or eliminate every enemy that's visible onscreen. This latter attack is limited to three uses per level. Thankfully, the touch area for tag moves is large enough so that you can use a finger to activate them, instead of having to fumble for the stylus every time. One annoying drawback, though, is that the system beeps constantly to alert you whenever you can perform a touch screen action, which totally drowns out the music and sound effects. Beating up on anonymous Triceratons and federation soldiers is enjoyable for the first couple of levels or so, but then the game starts to lose steam. That's partly due to the fatigue that develops from fighting the same carbon copy enemies repeatedly in each chapter, especially if you're playing through the game with all four turtles just to see every ending. By and large, however, the real culprits are the platforming sections and touch screen-oriented puzzles that crop up once or twice in each level. Instead of providing some much-needed variety between melees, these aspects slow the game down even further and, at times, also bring unwanted frustration. The platforming sections tend to involve drawn-out segments of crawling through tunnels and waiting for spike traps to retract. Occasionally, you'll have to escort Fugitoid or Splinter through a level, which involves picking them up and carrying them over jump sections and putting them down when you have to deal with enemies. This sort of constant start-stop-start just doesn't feel appropriate in a game that's supposed to be action-packed. Equally bothersome are the touch screen puzzles that crop up multiple times during certain levels. In some spots, you'll come across a computer terminal that initiates a puzzle sequence, which you have to solve by tapping and rotating objects on the touch screen. These silly pattern matching and alignment tasks aren't at all interesting, for one, and secondly, they can prove frustrating because the touch-sensitive areas for these puzzles are so tiny. Combat, however, doesn't require any fumbling with the stylus; you'll find yourself scrambling for it each time you see a computer terminal up ahead. Unfortunately, the platforming sections and puzzles feel intrusive, and the controls are rather rigid. To further complicate matters, the controls are rigid and often unresponsive. Cheap hits are the order of the day for a number of reasons. For one, you can't interrupt an attack to turn around or to jump out of the way should an enemy walk up behind you. Those combination attacks that look so flashy and do such a nice job of hammering single enemies also leave you wide open for an attack from behind, because your turtle stays stuck in place until the attack animation is finished. Secondly, the game isn't consistent when it comes to overlapping enemies. Leo's sword slash, for instance, will hit overlapping enemies simultaneously with one use, but may only hit one of them the next. Thus, while you're attacking that one Triceraton, the other is in perfect position to punch Leo right in the jaw. Ouch. Worst of all, though, is that the game will often just ignore button inputs. In a fast-paced game such as this one, it's demoralizing to tap the attack or jump button, hoping for a quick attack or leap to safety, only to have nothing happen. You can work around the stuffy controls by sticking to jump attacks and long-range attacks as much as possible, but where's the joy in that? On the whole, devoted TMNT worshippers may be able to see past the game's faults long enough to squeeze their money's worth out of it. Anyone else should probably steer clear of Teenage Mutant Ninja Turtles 3: Mutant Nightmare. Had Konami ironed out the kinks with the controls and not been so liberal with the various platform, puzzle, and touch screen elements, which serve only to overcomplicate a formula that shouldn't be complicated in the first place, they would've produced a beat-'em-up suitable for a wide audience. Sadly, they missed the mark yet again."}