{"ref": "https://www.gamespot.com/reviews/the-italian-job-review/1900-2878364/", "date": "June 26, 2003", "game_name": "The Italian Job", "text": "You don't see games like The Italian Job every day. The game itself isn't particularly extraordinary--it's a lighthearted mission-based driving game that takes you through the streets of London, to Turin, and finally to the Swiss Alps. Of further note, it's brought to you by the makers of the notoriously gory Carmageddon series (no signs of any gore here, though), it's based on a 1969 heist film starring Michael Caine and the late Benny Hill, and it was originally released some months ago for the Sony PlayStation. Actually, the PC version of The Italian Job shows its roots in all these respects, and despite some rough edges, it makes for a fun ride that justifies the budget price. The Italian Job stars cockney wise guy Charlie Croker, who is fresh out of prison and is already looking to get into more trouble--trouble, in the form of $4 million that the Mafia already has its eyes on. The plan is to cause a major pileup in the streets of Turin and make off with the loot while the authorities and the Mob are scrambling to figure out what happened. In the game, you'll take on 16 different missions, first gearing up for the heist, then pulling it off, and then getting away scot-free. Along the way, you'll get to drive eight different vehicles, including everything from a nimble Mini Cooper to a bus filled with explosives. The missions are all short, but they'll often require you to try them a number of times before you get them right. This isn't really frustrating, because the missions are quite fun, requiring you to pull off some outrageous driving moves in densely packed urban settings, and failing a mission never sets you back more than a few minutes. The controls are a cinch. Even if you've never played a driving game before, you'll be able to pick up and play The Italian Job easily. You can accelerate, brake, and turn left and right. The hand brake lets you execute sharper turns, and you can sound the horn of your vehicle to no real effect, and that's it. A damage meter indicates how close you are to totaling your car, though no incremental damage to the vehicle can be seen as you bang it up. The game's physics aren't particularly realistic, but they're good enough, and the various vehicles you'll drive are satisfyingly different in how they handle. Between the open-ended environments and the relaxed driving mechanics, The Italian Job is most reminiscent of the Midtown Madness series, though it's also comparable (though not favorably) to Driver or even the driving portions of Grand Theft Auto III. It won't take you long to finish The Italian Job. There are only 16 missions in total, so you'll get through the main storyline in short order, even if you have to retry most of the missions several times. Some additional modes of play, including a free ride option through London and Turin, a multiplayer party mode, and the ~challenge,~ ~destructor,~ and ~checkpoint~ missions, add to the game's replay value somewhat, but the story mode is definitely the main attraction. The game's simple physics and minimal detail just aren't enough to carry it through these other modes of play, though the context of the story mode and the diversity of its missions will keep you involved. The Italian Job doesn't look like much, but considering that it was originally a PlayStation game, it looks surprisingly decent in some ways. In particular, the vehicles you'll drive look quite good and feature a nice metallic sheen. There's also no shortage of vehicular and pedestrian traffic on the streets you'll be racing through, so The Italian Job certainly isn't boring to look at. On the other hand, everything else about the game's appearance, from the blurry textures seen on buildings to the simplistic geometry of the environments, leaves a lot to be desired and is hardly up to par with the high graphical standards for the driving genre these days. The game sounds considerably better. Though you'll hear some repetitive complaints from pedestrians, and the sound of crunching your car into another isn't all that impressive, the noisy engines of your vehicles and the catchy, upbeat musical score are quite good. Best of all, the voice actor who portrays Charlie Croker does an excellent job of sounding like the brash, fast-talking scoundrel he's supposed to be. You'll enjoy listening to his mission briefings and watching some of the game's admittedly simple but nonetheless amusing in-engine cutscenes. The Italian Job maybe isn't quite as out-of-the-blue as it might seem. Between the resurgence of the Mini Cooper's popularity and the ongoing production of a Hollywood remake of the 1969 film starring Mark Wahlberg and Ed Norton, The Italian Job's appearance on the PC isn't pointless. The game is simple and in some ways even a bit crude, and the entertainment it offers is relatively short-lived, but it's not a bad deal at $20, and it's got a lot more personality than you'd find in your average PC game."}