{"ref": "https://www.gamespot.com/reviews/leisure-suit-larry-magna-cum-laude-review/1900-6109836/", "date": "October 6, 2004", "game_name": "Leisure Suit Larry: Magna Cum Laude", "text": "Times sure have changed since the last time a Leisure Suit Larry game hit store shelves. Once the name in sexually charged adventure gaming, the Leisure Suit Larry series has been altogether dormant since the '90s. This could at least be partially attributed to the fact that the sort of humor the series brought to the table was frequently being upstaged by increasingly foul and bawdy humor in all other facets of the media. Now, more than half a decade after the last Leisure Suit Larry, VU Games and developer High Voltage have brought out Leisure Suit Larry: Magna Cum Laude, a total reenvisioning of the franchise both from a gameplay and content perspective. Gone are the innuendo- and entendre-based gags of old, replaced by blatant, obscene, and downright insane humor that rivals most modern-day Hollywood comedies in terms of sheer hilarity and pure shock value. Unfortunately, also gone are the appreciable adventure gameplay stylings of old, replaced by myriad shallow minigames that aren't particularly fun. However, if you're willing to forgive its brain-dead gameplay and occasionally frustrating design, Magna Cum Laude is a hysterically entertaining romp through the world of wacky sexual hijinks. Finally, college life has been accurately depicted in a game. Thanks, Leisure Suit Larry: Magna Cum Laude! You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Leisure Suit Larry: Magna Cum Laude Video Review In Magna Cum Laude, you play as a college-aged loser by the name of Larry Loveage. This new Larry is actually the nephew of the old-school namesake of the Leisure Suit Larry series, Larry Laffer. Little Larry is just like his famous uncle, from his questionable method of dress and novelty-sized head to his pathetic but undying love of the fairer sex. At the beginning of the game, it seems as though Larry's desire to get with the ladies will only be achievable in dreams, but then, as luck would have it, Larry sees a TV commercial for a hot new dating show called Swingles, which is coming to Larry's community college. He is immediately determined to become a Swingles contestant so that he can try to win the heart (or at least get in the pants) of one of the three hot babes featured on the show. After a fairly rough meeting with the host of Swingles, Uma, Larry is informed that the only way he'll ever have a chance in hell of appearing on Swingles is to prove to her that he can actually get a girl to give him the time of day. Unlikely as that may be, Larry then sets off on a quest to make his dream come true. The main portions of Magna Cum Laude's story largely involve Larry's attempts to woo a series of blatantly stereotypical women scattered about the campus and surrounding town. There's the highly popular and ditzy cheerleader, the tough greaser/biker chick, the artsy French girl, the bookworm-turned vixen/lesbian, and, in a nod to the American Pie films, a sex-obsessed and mildly satanic band geek. To try to wear down the defenses of these girls, Larry has to jump through a series of hoops to either prove himself to them or to just plain trick them. Typically, this involves a lot of minigames and a lot of alcohol. Just like real life! The primary minigame you'll find yourself faced with in Magna Cum Laude is the conversation minigame. How do you turn a conversation with a woman into a game? Why, by putting a window at the bottom of the screen and letting you navigate a smiley-faced sperm through a wacky obstacle course, of course! Sounds deranged, doesn't it? It's actually not all that bad. Basically, the way in which you steer Larry's conversational course of lies and exaggerations is by controlling this happy little sperm. You will frequently come upon sections in the little obstacle course with three icons, one of which you will have no choice but to pass through. These represent things Larry will say next during his conversation. By passing through the green icon, Larry will say the best thing possible. By passing through a red icon, Larry will say something wholly unappealing, and thus he will begin to lose the girl's interest. There are also other, context-sensitive icons that will appear from time to time, some good and some bad. Also, you'll frequently have to navigate around a whole host of other random, though dodgeable icons, like ones that will make you belch, and others that progressively make Larry drunker (and thus make the sperm icon harder to move properly). This is certainly an inventive way to turn a conversation into a game, though it can be a little distracting at times, especially when you're trying to pay attention to the dialogue. Unfortunately, this is about the only inventive or interesting minigame that Magna Cum Laude throws at you. The rest range from varying types of Space Channel 5-style rhythm games--where you have to match the controller commands called out by another character--to basic ~collect a whole bunch of items and run away from bad guys while you do it~ games. There's even a series of Tapper-inspired games, as well as a simple analog-stick- or mouse-based version of the classic drinking game ~quarters.~ The variety may sound good, but each and every one of these games is simple to a fault--and highly repetitive. The oversimplicity of these games is completely rooted in the minigames' designs themselves. However, the blame for the repetitiveness of the games falls squarely on the overall game design and mission structure. A fair number of Magna Cum Laude's missions require money or specific items--or both--to activate. As you play, you'll have the ability to earn cash through a number of different side games and quests strewn throughout each level. Similarly, you can buy required outfits and accessories from a similar number of scattered locations. Unfortunately, all the minigames you have to play are literally the same games you'll be playing during missions. Furthermore, only a scant couple of the games actually net you much cash, meaning you'll have to play a lot of the same games over and over and over again. Without a doubt, this is the funniest game to come out so far this year. Further compounding the frustration of this sort of mission structuring is the game's problematic pacing--at least on the console versions. A number of missions require you to move through multiple sections of the game's world, which actually amounts to no easy task. Every single specific area, be it a dorm room or an outdoor quad, requires a load time of anywhere from 10 to 30 seconds. In fact, only a sparing few areas actually provide you with short load times, and more often, you'll be out of action for at least 20 seconds at a time. This might be permissible if it weren't for the fact that you'll spend almost as much time loading as you will playing. The simple process of walking out of a room, then out of a building and into an open area, and then into another building can actually take upwards of a full minute and a half's worth of loading, at times. The whole game itself is about a dozen hours long, though you have to wonder exactly how much of that time is spent staring at a loading screen. Also, the game sort of tries to appease you by providing erotic photos of both the polygonal and ~real-life~ versions of the girls featured in the game as load screens, but unless you're the kind of person who is immediately lulled into submission by the mere sight of a half-naked woman, it's unlikely this will have any effect on the frustration-factor of the game's loading times. The good news is that the PC version of the game is entirely devoid of these horrendous load times, which pretty much makes that version of the game the most enjoyable one by default. The Xbox version's load times are also somewhat shorter than the PlayStation 2's, but both have their lengthy loading periods. However, if you can find a way to look past the abhorrent console loading times and generally banal gameplay, Magna Cum Laude is most certainly an entertaining experience, thanks largely to its irreverent sense of humor. Drawing inspiration from everything from American Pie to National Lampoon's Animal House, Magna Cum Laude's comedic quality is really quite astounding. The actual style of humor shifts frequently between the raunchy and vulgar variety to the obscurely referential. The cast of characters Larry encounters is pretty hilarious by itself, including his best male friend, a frequently drunk homeless man known only as The Commissar; a comically mismatched gay couple, featuring an effeminate middle-aged gay bar owner and a muscular, Speedo-clad German fellow named Helmut; a porno fairy--sporting a pink tutu and a massive gut and moustache--who periodically appears to bestow wildly inappropriate advice and gifts; and a talking arcade machine based on the movie Road House, who frequently berates Larry during one of the episodes with the girls and even manages to show up at Larry's dorm room at one point. How, you ask? ~367 extension cords--most of them stolen!~ The game's scattershot collection of minigames isn't terrible, but none of them are especially engaging by themselves. That last bit is actually a pretty good example of the kind of insane dialogue and scenarios featured throughout most of the game. When the game isn't making bizarrely obscure references to films like Dunston Checks In and Baby Geniuses, it's sticking Larry in the midst of a gay-themed musical number based on the song ~Summer Nights~ from Grease, or it's having Larry streak through a bar to the tune of The Benny Hill Show to impress a lesbian (who Larry himself helped ~discover~ her true sexual orientation). The incredible variety of situations the game puts in front of you is highly entertaining, to say the least. Occasionally, some of the gags swing a little too far into dismally obvious territory (such as the periodic bouts with fart humor), but, for the most part, the game rarely features a dull moment (outside of the repetitive minigames and loading screens, that is). If it isn't already obvious at this point, Magna Cum Laude is very much an M-rated game, and, in fact, it pushes some of the boundaries of what we've seen in M-rated games up to this point, mainly with regard to sexuality and dialogue. This game is remarkably politically incorrect, and very few, if any, subjects or social taboos are left unchecked. Rampant swearing and polygonal nudity is all over the place, as well as more than a fair share of crazy sex scenes, including one that borders on pornographic. Of course, the game never gets full-frontal on you, and aside from breasts and posteriors, characters' naughty bits and the serious sex scenes are mostly covered over by giant ~CENSORED~ boxes--which actually sort of add to the whole humorous aspect of the situation. All the swearing and offensive joking, thankfully, manages to work well and never feels forced, largely due to the really excellent voice acting and writing. Unfortunately, we can't say quite the same thing about the sex stuff. Make no mistake, it's quite funny to watch how each sexual scenario with Larry manages to go raucously awry, but whatever supposed enticement is to be derived from staring at a polygonal model of a nude woman just isn't there, despite the fact that the game really seems to think it is. In fact, the nudity mostly comes across as pretty benign and uninteresting. Apart from all that polygonal bumping and grinding and what have you, Magna Cum Laude is a pretty good-looking game. Larry's character model shows a lot of detail, as do many of the featured characters in the game. The surrounding environments, like Larry's school campus or the streets of the rough part of town, are all appropriately exaggerated-looking, giving the game sort of a cartoonish feel. The game also features a lot of subtle bits of visual hilarity that you'll have to explore to find, like a series of sorority house bedrooms featuring the names of all the girls from The Facts of Life and a vending machine near Larry's dorm room that dispenses werewolf repellent, for some inexplicable reason. For the most part, the game performs well enough from a technical perspective, although you will notice some occasional frame rate issues while walking around (more so on the PS2 than on the Xbox), and the camera does have its infrequently annoying moments. Also, during our testing, the PC version occasionally hitched on certain frames, seemingly at random, which was a tad bit distracting when trying to play the rhythm-based games. Yes, you can see this girl naked...eventually. Whether that's a good thing or not is entirely up to you We've already raved at length about the solid voice acting, but the acting itself is not the only boon when it comes to the dialogue. The overall sound design provides you a lot of fun opportunities to discover random bits of comedy in strange places. Just walk up to one group of people or another, and launch into some strange and funny conversations that are completely outside of what you're doing. Then you'll know what we mean. The only problem with this is that each time you walk up to a group, the exchange always begins with the same line, and the only time you'll hear a new one is if you stay in that level and walk back to the group a second or third time. If you go elsewhere and have to reload that level, it starts all over again; this can become a little repetitive. The game also features some bizarre licensed music, which, despite consisting of a seemingly ill-fitting roster of artists--like 2 Live Crew, Mtley Cre, and Right Said Fred--somehow just works in the context of the game. When it comes right down to it, Leisure Suit Larry: Magna Cum Laude is not a recommendable ~game,~ per se, so much as it is a recommendable experience. The game portions found here are largely insignificant and are actually pretty uninteresting as a whole, but the comedically brilliant story, characters, and dialogue, as well as the clever and profane tone of it all, really do make this a game worth playing through for anybody who enjoys a particularly adult brand of humor. Should you go out and pay full price for the console versions? No, probably not. However, Magna Cum Laude is perfectly suited for rental purposes, because it's exactly the kind of game you will greatly appreciate the first time through. Drawing inspiration from everything from American Pie to National Lampoon's Animal House, Magna Cum Laude's comedic quality is really quite astounding. The actual style of humor shifts frequently between the raunchy and vulgar variety to the obscurely referential. The cast of characters Larry encounters is pretty hilarious by itself, including his best male friend, a frequently drunk homeless man known only as The Commissar; a comically mismatched gay couple, featuring an effeminate middle-aged gay bar owner and a muscular, Speedo-clad German fellow named Helmut; a porno fairy--sporting a pink tutu and a massive gut and moustache--who periodically appears to bestow wildly inappropriate advice and gifts; and a talking arcade machine based on the movie Road House, who frequently berates Larry during one of the episodes with the girls and even manages to show up at Larry's dorm room at one point. How, you ask? ~367 extension cords--most of them stolen!~ The game's scattershot collection of minigames isn't terrible, but none of them are especially engaging by themselves. That last bit is actually a pretty good example of the kind of insane dialogue and scenarios featured throughout most of the game. When the game isn't making bizarrely obscure references to films like Dunston Checks In and Baby Geniuses, it's sticking Larry in the midst of a gay-themed musical number based on the song ~Summer Nights~ from Grease, or it's having Larry streak through a bar to the tune of The Benny Hill Show to impress a lesbian (who Larry himself helped ~discover~ her true sexual orientation). The incredible variety of situations the game puts in front of you is highly entertaining, to say the least. Occasionally, some of the gags swing a little too far into dismally obvious territory (such as the periodic bouts with fart humor), but, for the most part, the game rarely features a dull moment (outside of the repetitive minigames and loading screens, that is). If it isn't already obvious at this point, Magna Cum Laude is very much an M-rated game, and, in fact, it pushes some of the boundaries of what we've seen in M-rated games up to this point, mainly with regard to sexuality and dialogue. This game is remarkably politically incorrect, and very few, if any, subjects or social taboos are left unchecked. Rampant swearing and polygonal nudity is all over the place, as well as more than a fair share of crazy sex scenes, including one that borders on pornographic. Of course, the game never gets full-frontal on you, and aside from breasts and posteriors, characters' naughty bits and the serious sex scenes are mostly covered over by giant ~CENSORED~ boxes--which actually sort of add to the whole humorous aspect of the situation. All the swearing and offensive joking, thankfully, manages to work well and never feels forced, largely due to the really excellent voice acting and writing. Unfortunately, we can't say quite the same thing about the sex stuff. Make no mistake, it's quite funny to watch how each sexual scenario with Larry manages to go raucously awry, but whatever supposed enticement is to be derived from staring at a polygonal model of a nude woman just isn't there, despite the fact that the game really seems to think it is. In fact, the nudity mostly comes across as pretty benign and uninteresting. Apart from all that polygonal bumping and grinding and what have you, Magna Cum Laude is a pretty good-looking game. Larry's character model shows a lot of detail, as do many of the featured characters in the game. The surrounding environments, like Larry's school campus or the streets of the rough part of town, are all appropriately exaggerated-looking, giving the game sort of a cartoonish feel. The game also features a lot of subtle bits of visual hilarity that you'll have to explore to find, like a series of sorority house bedrooms featuring the names of all the girls from The Facts of Life and a vending machine near Larry's dorm room that dispenses werewolf repellent, for some inexplicable reason. For the most part, the game performs well enough from a technical perspective, although you will notice some occasional frame rate issues while walking around (more so on the PS2 than on the Xbox), and the camera does have its infrequently annoying moments. Also, during our testing, the PC version occasionally hitched on certain frames, seemingly at random, which was a tad bit distracting when trying to play the rhythm-based games. Yes, you can see this girl naked...eventually. Whether that's a good thing or not is entirely up to you We've already raved at length about the solid voice acting, but the acting itself is not the only boon when it comes to the dialogue. The overall sound design provides you a lot of fun opportunities to discover random bits of comedy in strange places. Just walk up to one group of people or another, and launch into some strange and funny conversations that are completely outside of what you're doing. Then you'll know what we mean. The only problem with this is that each time you walk up to a group, the exchange always begins with the same line, and the only time you'll hear a new one is if you stay in that level and walk back to the group a second or third time. If you go elsewhere and have to reload that level, it starts all over again; this can become a little repetitive. The game also features some bizarre licensed music, which, despite consisting of a seemingly ill-fitting roster of artists--like 2 Live Crew, Mtley Cre, and Right Said Fred--somehow just works in the context of the game. When it comes right down to it, Leisure Suit Larry: Magna Cum Laude is not a recommendable ~game,~ per se, so much as it is a recommendable experience. The game portions found here are largely insignificant and are actually pretty uninteresting as a whole, but the comedically brilliant story, characters, and dialogue, as well as the clever and profane tone of it all, really do make this a game worth playing through for anybody who enjoys a particularly adult brand of humor. Should you go out and pay full price for the console versions? No, probably not. However, Magna Cum Laude is perfectly suited for rental purposes, because it's exactly the kind of game you will greatly appreciate the first time through."}