{"ref": "https://www.gamespot.com/reviews/yu-yu-hakusho-dark-tournament-review/1900-6109486/", "date": "May 17, 2006", "game_name": "Yu Yu Hakusho: Dark Tournament", "text": "Yu Yu Hakusho: Dark Tournament bears a striking resemblance to Atari's own Dragon Ball Z: Budokai fighting series. Aside from both being part of a deal between the anime tycoons at Funimation and the French gaming impresarios at Atari, both sport cel-shaded graphics, relatively simple fighting systems, and story modes that are well above average within the realm of fighting games. Their biggest similarity, though, is probably the fact that both are better as fan-service offerings than as pure fighting games. Dark Tournament is made almost explicitly for fans of Yu Yu Hakusho. The actual fighting mechanics are pretty simple. You have four basic attacks: a hook, a jab, a kick, and a throw, as well as a block. The blocking mechanic feels a bit overpowered, making it too easy to block anything your opponent can dish out--including the powerful spirit attacks--without any sort of repercussion, which ends up encouraging lots of turtling. Each character has a set of unique spirit attacks, which are ranged attacks that you can trigger by using the shoulder buttons. There are also some unique multihit combos that you can pull off with a series of button presses and directional commands, but rather than being a natural extension of a character's basic moves, many of the combos just feel canned. Some fighters can brandish weapons like swords and axes; some fighters pack especially big punches; and some fighters are able to unleash quick flurries of punches and kicks. Aside from these class-style differences, however, most of the characters seem to handle pretty much the same. The action isn't particularly fast-paced, but the controls are pretty responsive. There are some goofy commands you'll have to execute to perform basic maneuvers, like ducking and jumping, but the biggest fundamental issue with the action in Dark Tournament is that there just isn't much depth to it. There aren't a ton of moves to learn, and a lot of the moves are shared between characters, so you basically just go through the motions of blocking or anticipating an opponent's own attacks, and then you counter with your own--which can be pretty fun for two players, as is the case with many other fighting games. As you jump into the game's main story mode, you're quickly introduced to the world of Yu Yu Hakusho through a highlight reel from the animated series. Using clips from the show, the game quickly explains how a brash, young student named Yusuke is killed while saving a young child from a speeding car. After this, Yusuke is brought back to life by a benevolent spirit ruler and is then assigned the duties of a ~spirit detective,~ whose job is to keep demons from mucking up the world of the living. The game is set during the Dark Tournament saga, where Yusuke and his allies have to enter an underground fighting tournament against the sinister Toguro brothers. The story mode ostensibly follows the events of the show by using clips from it to move things along, but the game makes a lot of assumptions about how familiar you are with Yu Yu Hakusho, and it skips over large chunks of the show that it deems frivolous. If you don't already know who the Toguro brothers are or what the outcome of the Dark Tournament is, then this game probably isn't for you. The action in the story mode itself is more than just a string of vanilla bouts, because the game keeps things interesting by introducing unique rules for many of the matches. You'll have team matches where you can swap between three different characters on the fly, matches where you can only use a limited portion of your attacks, matches where you start with half your health, and matches where your health is slowly depleting. There's also one fight called the knife-edge deathmatch, which, surprisingly, has little to do with knives. Basically, without moving and without blocking, both fighters trade blows until one of them falls. The key to success here is to anticipate the attack pattern of your foe, though, unfortunately, the only real way to do this is through trial and error. The whole story mode is a little uneven, and the pacing of the story seems a bit staccato, but it's still a nice change of pace from the usually predictable story modes found in most fighting games. As you progress through the story mode, you'll unlock characters and stages for use in other modes, in addition to unlocking tokens. These tokens, which represent different Yu Yu Hakusho characters, are used in the token game, which is sort of like a cross between a collectible card game and Chinese checkers. The outer ring of spaces in the hexagonal playfield is filled with ~fan~ tokens, who either root for you or your opponent. The placement of the fan tokens is random, and the tokens can have a huge effect on the outcome of the match, because all of your tokens have a ~fan requirement~ stat and must be placed adjacent to one, two, or three of your fans. Your tokens also have unique attack ratings and hit point stats that determine how much damage they can dish out and how much they can take before they're out of commission. Your basic tokens will just attack any opposing token that they're placed adjacent to, though you will earn tokens that can attack other ones across the board, as well as tokens that can swap places with other ones. There seems to be a decent potential for strategy here, but there are only seven spaces on the playfield, and matches always seem to end much too quickly--so the results end up seeming convoluted rather than fun and addictive. The rules are pretty arcane, and it can take a while to get a firm understanding of the action. Though it seems like every other anime franchise has its own collectible card game (it's called the token game...get it?), this mode comes across as rather out of place in the context of a simple fighting game. Most of the other modes of play are pretty predictable. The ladder-style arcade mode lets you choose your fighter and your final opponent, but then the game stacks a pile of other fighters that you'll have to defeat one at a time before you can get to the final battle. The skirmish mode allows for one-off fights against the CPU or a second player, and you can choose between standard one-on-one fights or team-based fights. Finally, there's a survival mode where you have a single health bar with which to fight against a series of nine opponents. The scope of the game's visuals is pretty modest, but this focus keeps the elements that are onscreen looking pretty good. The fights take place in confined circular arenas that do a fair job of imitating some of the locales from the show, though they feel like close-knit stages more than actual locations, in most instances. The fighters themselves are all given the cel-shading treatment, with thick black lines defining their outlines and flat colors with some small textured details filling them in. The cel-shading in Dark Tournament looks pretty good, though the outlining can look a little jagged on some characters. In general, the level of detail on the models is shy of what is found in its 2D counterparts. There are some decent effects for the spirit attacks, and combo moves are accompanied by anime-inspired flashes. In general, this is a good-looking game, even if it doesn't dazzle. Fans will appreciate the original voice work from the US cast of Yu Yu Hakusho. Aside from the abundance of clips from the Yu Yu Hakusho TV series, fans will probably most appreciate the fact that basically the entire US voice cast of the show has recorded new dialogue for Dark Tournament. This adds an air of authenticity for Yu Yu Hakusho fans, but for anyone else, it will probably just come off sounding like some silly anime voice acting. The rest of the sound design, from the anime-style zings and cracks that make up the fight effects to the rather understated music, seems to be operating under the same philosophy of aiming for consistency with the show's relative quality, rather than aiming high with respect to the fighting game genre. Considering the conflict-driven undertones in Yu Yu Hakusho and the series' focus on martial arts, a fighting game is just about as good a fit as you could find for bringing it to the world of video games--and the execution of Yu Yu Hakusho: Dark Tournament definitely appeals more to fans of the show than it does to fans of fighting games. So, if you're a big-time Yu Yu Hakusho fan looking to step into the shoes of Yusuke, Kuwabara, Kurama, Hiei, or any of the other notable characters from the series, you'll definitely find Dark Tournament to be a much more engaging experience than if you were just looking for a good 3D fighting game."}