{"ref": "https://www.gamespot.com/reviews/the-thing-review/1900-2878689/", "date": "August 28, 2002", "game_name": "The Thing", "text": "Given the bleak track record of movie-to-game translations, The Thing--based on John Carpenter's 1982 horror film, which was itself a remake of the 1951 Howard Hawks original--comes saddled with some understandably low expectations. Against the odds, it's actually good. In fact, if it weren't for a general scarcity of terror and a control scheme unsuited to its action-oriented gameplay, The Thing would be great. Rather than retelling the movie's plot, the game starts right where the movie ended. You're sent to investigate the pair of Antarctic research stations that provided the setting for the film's events. Along the way, you'll run across various survivors and fellow investigators, with whom you can team up. This is The Thing's most innovative idea. At any given point, you can have as many as three computer-controlled teammates traveling with you. You can hand them weapons and ammo, heal them, and give them simple dog commands such as stay and follow. Because the thing itself is a parasitic infection, nobody knows who's infected and who isn't. Teammates each have a trust meter that gauges how firmly they believe you're not a thing. Various actions, such as healing them, helping them in combat, and giving them equipment, all raise this trust level, while other actions lower it. If a companion doesn't trust you, he (they're all male) won't follow your orders and may eventually even attack you. Each person also has a fear level. As his terror rises, he becomes more unhinged. If nothing is done to relieve his fear, he'll eventually go crazy, at which point he may become totally unresponsive, kill himself, wet his pants, or start firing his weapon blindly. Roughly the same actions that increase a team member's trust in you will also quell his fears. Of course, any of your companions may actually be a thing, meaning at some point he'll transform into a monster. In theory, this fear/trust/infection system sounds like a great way to capture the film's atmosphere of unremitting paranoia. In practice, however, it has little impact on the game. The actions that earn your teammates' trust and lower their fear are all things you'd be doing anyway--arming them, supplying them with ammo, healing them, and fighting monsters. So while it's possible for a sidekick to lose his mind or turn on you, it'll never actually occur except as the result of a conscious decision on your part to make it happen just to witness the results. Only once during the short seven hours it took to finish The Thing did a team member ever succumb to fear, and that may have been a largely unavoidable part of a puzzle sequence. The threat of companions turning into things is less a source of terror and more a minor inconvenience, since the things are generally no match for your weapons. When a teammate turns, you'll kill him and move on. It's generally no great loss, both because existing team members often don't follow you across level transitions and because new members are available at regular intervals. Every other video game is about a solitary hero fighting a horde of monsters, so just having a coterie of armed guards--even if some of them are things--actually further undercuts the game's horror quotient. In fact, The Thing is really more of an action game with monsters to shoot than a moody survival horror piece. The hallmarks of the survival horror genre--a relatively frail hero and a scarcity of munitions--simply don't apply here. As in a traditional run-and-gun shooter, weapons, ammo, and health are abundant, and your character can take a real beating. At no point will you be low on health and down to your last few bullets. Compared to you, the things themselves are pretty weak. You'll often find yourself chasing a thing as it flees in terror from your flamethrower. So in some sense, it works as survival horror from the thing's perspective. However, as an action game, The Thing is largely successful. The controls are its only real drawback. You view your character from a third-person perspective. You can look left and right with the mouse, but not up and down. In order to look up or down, you need to hold in a free-look key, during which time you can't move. Unless you're in the free-look mode, aiming is automatic. It's a control scheme much more suited to a console gamepad (The Thing is also available on the PlayStation 2 and Xbox) than the PC's combination of a keyboard and mouse. Having no auto-aim (or even an option to toggle it on or off) and a persistent free-look--essentially the de facto standard in third-person PC games--would have made for a much more satisfying control scheme. Other than that, though, The Thing is a good shooter. The teammate AI is great in a fight, and there are a lot of well-staged battles. One that takes place in a small building being attacked from all four sides by waves of things is especially intense. The puzzles are lightweight, but generally intuitive. The game has an almost perfect blend of story and gameplay--interesting things happen without intruding on the ongoing action. The game even utilizes a limited save system that, with a few exceptions, is lenient enough to avoid being frustrating. On top of all of this, The Thing's presentation is almost flawless. The lighting, detailed texture work, and atmospheric ambient sound effects are all top notch. The designers have managed to wring an amazing amount of variety out of what is essentially a long walk through a concrete bunker and the barren landscape surrounding it. The character models are well animated, and, in a nice touch, all of the team members you run across are unique from each other--each has a unique face and inflection. The Thing is kind of short, it's not especially effective at making you feel afraid, its most intriguing gameplay elements are somewhat extraneous, and it suffers from a wonky control scheme. Yet, thanks to some high production values and consistently interesting action scenes, The Thing rises above these flaws. It could have been great, but in light of the checkered history of movie-licensed games, being good at all is a pretty impressive achievement."}