{"ref": "https://www.gamespot.com/reviews/stonefly-review-buzz-kill/1900-6417687/", "date": "June 8, 2021", "game_name": "Stonefly", "text": "When Stonefly promises a chill and tranquil adventure it's not telling the whole truth. Annika, a capable young pilot searching for her engineer father's stolen mech, finds herself under frequent attack from the bugs that protect the resources she so desperately needs. Much of Stonefly is spent propelling your insectoid mech through an arboreal maze, hopping from leaf to leaf and catching the breeze to higher layers of canopy. But the various minerals you must extract to craft mech upgrades are fiercely protected, and so the game's rhythm becomes one of sedate exploration punctuated by frantic skirmishes.While Annika can modify her mech for combat, improving existing functions and installing new ones, the pattern remains the same throughout. While airborne, she can shoot at enemies directly below her; damage them sufficiently--basic enemies take only one hit while the toughest will require multiple strafings--and they flip over onto their backs. Once vulnerable, enemies can be blown off the edge of whatever leaf or branch constitutes the current battlefield, and thus eliminated.It's a neat system in theory that echoes the typical shield and health combo of many shooters and other action games. You've first got to take out an enemy's shield by flipping it onto its back, then you can target its health by cannoning it out of the arena. Unfortunately, a few additional factors contribute to the flow of combat feeling overly chaotic and ultimately frustrating.For a start, many of the enemies are quite small. Worse, they also tend to be of a similar colour to the resources you're trying to mine. When the screen is busy with dozens of enemy bugs, several clusters of similarly-hued minerals, and the bullets and impact radii of your shots and your enemies, it is very difficult to properly discern what's going on. On many, many occasions--at least once every single fight, by my reckoning--I took damage or was bounced out of the arena by something I hadn't even noticed.Exacerbating the frustration, the combat controls are overly complicated yet full of redundancies. The jump button launches you into the air. The shoot button also launches you into air, though not quite as high as the jump, before you start dropping bullets and slowly drifting down again. Hit jump a second time while airborne and you dive to the ground, which is not what you want while hovering above an enemy target, while a third button also brings you immediately back to earth. Holding down the left-trigger modifies all the face buttons for a second selection of abilities that sound useful but rarely are, and good luck remembering what does what in the heat of battle anyway.Blowing a vulnerable enemy out of the arena entails blasting it with a gust of pressurised air, accomplished by holding down right-trigger for a full charge or tapping it for a quick jet. The difference here feels like it should be meaningful, but I rarely had time to wait for a full charge or carefully target with the right-stick. But the fact that both abilities use the same button means that I was all too often accidentally charging when I wanted to tap, or tapping on the few occasions I actually wanted to charge. In both cases, there's significant knockback, too, and as such it's all too easy to hurl yourself backwards off a branch when you're trying to blast the enemy in front of you.Sometimes the combat does come together. When you're able to read the battlefield clearly, prioritise the immediate threats, and focus on eliminating the most dangerous enemies--and when the controls are doing all the things you want them to do--it feels satisfying to clear an encounter. Recognising that a new wave of enemies will appear when you knock out these specific earlier enemies, or that clearing that resource node will trigger the arrival of these particular enemies, introduces a welcome element of strategy and empowers players to manage the flow of combat, alleviating its frantic nature.Despite these advantages, you're still at the mercy of an overly punitive negative feedback loop. Taking damage will gradually incapacitate your mech's systems, ultimately preventing it from performing any function more advanced than walking around. In the more demanding combat encounters, this usually means that getting hit and losing systems will only increase the likelihood of getting hit again and losing more systems. The more damage you take, the less ability you have to avoid taking even more.Repairing the mech is tied to a cooldown that is never explained and even after completing the game I never felt confident I understood why I wasn't able to repair damage now, nor how long I'd have to wait until I could. I'd simply try to dodge enemies until the repair icon lit up again and I could press the button. Scraping through by the seat of your pants in such situations can be a thrill. I enjoyed the moments when the tables were turned and I'd have to spend the next 10 seconds or so desperately trying to disengage, but only when afforded the space to do so, when the play area was large enough to allow a bit of hide and seek. Too often combat occurs in enclosed arenas and you're penalised for straying beyond their limits. It's extremely annoying to think you've found a moment to recharge only to be picked up and dumped back into the heat of the action because you wandered beyond an arbitrary line.Stonefly fares better when you're left to your own devices and encouraged to survey its strange landscape, free from the stress of its combat. You're expected to learn each area as you explore, with the lack of a detailed map or clear objective markers emphasising that this is not a game that's going to hold your hand. Despite the alien, almost abstract nature of the terrain, a mental map slowly takes shape as you traverse each area, the contours firming each time you revisit.Learning the layout is important when every new task requires you to collect increasing quantities of specific resources. Remembering how to navigate to that particularly rich vein of dinotite massages that part of the brain that enjoys performing a methodical task with precision. But it's also a pleasure to leap into the unknown, drift on a passing breeze and discover what's around the next tree trunk.If anything, Stonefly could afford to be a bit weirder. A striking art style, with its low poly environments, garish colours, and scratchy, almost pencil-sketched shadows adding texture, enhances the otherworldly atmosphere. The hints at weirdness are welcome, but it doesnt go far enough. In the end, its just another type of tree or fungus and the leaves are a different colour. There's still a sense of mystery whenever you first set foot in new territory, but it's diluted by prior experience of realising that things aren't going to change THAT much.Reinforcing that feeling is a structure that offers little deviation. Objectives tend to come in two forms. Sometimes you're tracking something, typically when first venturing into an area, which involves following the little fireflies that guide you in roughly the right direction until Annika tells you she's noticed some clues in the environment. It's disappointing that Annika picks up on these clues herself, without your input, and it ends up feeling like you're watching her work something out rather than actually participating in the solution.But most of the time you're heading back into previous areas to gather the resources needed to fulfil your current objective or because you want to craft one of many upgrades. And this is where the grind kicks in. You fly out, beat up some bugs, scoop the minerals they were guarding, and head back. Turns out you still need 500 of that and 800 of this, and if you get another 1,600 all up you can buy this too. So you fly out, beat up the same bugs, scoop the same minerals, and head back. When this is the vast majority of objectives, the process of doing it yet again becomes tiresome. If the narrative pulling you through was stronger, the grindy repetition might be more tolerable. But the story is slight, the promise of its early mystery dissipating into too many dead ends.Stonefly takes flight in a fantastical world where you glide amongst giant trees, branches twisting improbable pirouettes in the sky. But the initial wonder soon sputters under frustrating combat design and runs aground against the mundane grind of its progression structure."}