{"ref": "https://www.gamespot.com/reviews/f1-2002-review/1900-2882006/", "date": "September 30, 2002", "game_name": "F1 2002", "text": "Electronic Arts' F1 2002 has the distinction of being the only Formula 1 racing game currently available for the GameCube, and that alone will mean a lot to racing fans who own Nintendo's console. However, F1 2002 is also a noteworthy Formula 1 game in its own right, with an up-to-date roster of drivers, teams, and racetracks from the ongoing F1 season; controls and options that are designed to accommodate experienced and novice players; and some of the best graphics in a GameCube driving game. Functionally and visually, this game is a twin of F1 2002 for the PlayStation 2, which was developed using the same impressive graphics and physics engine used in F1 2001. In absolute terms, however, F1 2002 is better than F1 2001. The game has retained all the exceptional aspects of its predecessor while trimming a lot of the fat. Gone is the domination single-player mode. As interesting as it might have been, it wasn't true to Formula 1 racing, so it's out. The number of challenges, though, has been increased to a total of 25. These objective-based driving exercises are modeled after Gran Turismo's license tests, and they're designed to hone your F1 driving skills to a sharp edge. Unlike in last year's PS2 game, completing all of them is no longer a prerequisite to racing in F1 2002's season mode, which--like in most racing games--is the game's heart and soul. Those who have played F1 2001 for either the Xbox or PS2 will know exactly what to expect of this game's core gameplay mechanics. The cars' sensitive controls are still the same, though they're somewhat twitchier in this version of F1 2002, since the GameCube controller's face buttons are not analog. You'll have to resort to the controller's C stick if you want gradual acceleration and braking. As such, driving these 800hp machines around the tracks requires a judicious amount of restraint, as laying into the accelerator will do nothing but quickly introduce your car to a cement wall. The brakes require a delicate touch as well, since it doesn't take much to cause a lockup. Those who might not be used to these controls will probably find them frustrating at first, but it only takes a few laps to get used to them, and a few more to excel at them. The physics model of F1 2001 for the PS2 and Xbox has also been retained, meaning that your car's handling will change throughout the course of the race as your tires grow bald and as you use up fuel, making the car lighter. The interactive pit stops are also the same, and you can easily make out your entire pit crew fussing over every aspect of your car. If you damage your car during a race, you'll even see some crewmembers replace the broken parts with brand-new ones--they don't magically appear out of thin air. As its name implies, F1 2002 is based on the current season of Formula 1 racing, and as such, it lets you race as any of the league's 22 drivers--from Barrichello and Coulthard to the brothers Schumacher--on any of the world-famous racetracks. This updated roster of teams means that you can also choose to play as either of this year's new arrivals, Renault and Toyota. The game's season mode will take you through all 17 tracks in the proper order, starting with Melbourne and concluding at Suzuka, and before every race, you can practice, qualify, warm up, and dial in your car's settings to your liking. Like in real life, points are awarded to drivers and teams who place first, second, and third, and at the end of the season, the driver with the most points is crowned the champion and the team with the most points is awarded the constructor's cup. The ultimate goal, of course, is to have enough points to win both of these coveted prizes. For those without the patience to endure 17 individual practice sessions, qualifying runs, and races, F1 2002 lets you create custom seasons of any length and order. You can also participate in a single race weekend, or skip practice and qualifying altogether and jump straight into a race. Most of the tracks in this quick race mode are locked, however, and require you to successfully complete them in the season mode beforehand. Another meaningful change since F1 2001 is the addition of a slipstream meter. Located on the right-hand side of the screen, this gauge ~measures~ the amount of draft from the car ahead of you. It takes about three seconds of drafting to fill up the meter, at which point you can slingshot by the opponent ahead of you. This addition is supposed to make passing easier, and it does, but it seems more appropriate in a NASCAR game than in a game about F1 racing, where passing and drafting are nearly nonexistent in real life. Hard-core fans of the sports will undoubtedly dislike this feature. Thankfully, F1 2002 gives you the option of turning it off altogether. In fact, the game is clearly designed to accommodate the widest range of players possible. Before each race, you can toggle opponent AI, race length, weather, fuel use, tire wear, transmission type, and engine failures, and you can customize the tire compound, tire pressure, wing height, ride height, spring rate, antiroll bar stiffness, brake bias, gear ratios, and a number of other settings on your car. Or not--F1 2002's default settings will keep most players competitive throughout the entire season. The game's graphics have been left largely unchanged from F1 2001 for the PS2 and Xbox, and they aren't any different from those of F1 2002 for the PS2, but they still hold up nicely. From the first-person perspective, you can make out a lot of detail on your car and the surrounding tracks, and nice touches like reflections off your helmet and fairing are easily distinguishable. Raindrops and rooster tails leave streaks on your visor, and once the clouds break, grandstands and other trackside objects are subtly reflected in the puddles on the track. Like in its predecessor, the environments in F1 2002 have a grainy and gritty look while in motion, though this effect seems to disappear at slower speeds. The game also suffers from suboptimal frame rate. Given a full field of cars, the frame rate seems to drop well below 30fps, though never to a point where it becomes unplayable. The game has support for up to four players at once, though only in a split screen, and the smaller windows make the game's visuals even grainier. The sound is a mix of old and new, though it's all quite good. Most of the sound effects, like engine noise, exhaust notes, and squealing tires, are from F1 2001, but the techno beats that play throughout the game are new and for the most part well done. Ultimately, F1 2002 is another great installment in EA Sports' long-running F1 franchise and a welcome addition to the GameCube's relatively small library of driving games. Fans of the sport who haven't had the chance to play this game or previous iterations of it on the other consoles would do well to pick it up. It might be the only one of its kind for the GameCube, but its merits make it a worthwhile purchase regardless of that fact."}