{"ref": "https://www.gamespot.com/reviews/beetle-adventure-racing-review/1900-2557842/", "date": "April 28, 2000", "game_name": "Beetle Adventure Racing", "text": "With driving games getting all serious these days, it's nice to see a racer focusing on fun rather than realism. EA's Beetle Adventure Racing shouldn't even be thought of as being within the same genre as games like Sony's Gran Turismo or Sega's Sega Rally 2, as it really belongs more to the crazy racing offshoot pioneered by Midway's San Francisco Rush.That, of course, means Beetle Adventure Racing is rife with shortcuts and jumps, but the physics are more down to earth than its San Francisco cousin, making you feel much more in control of the car. Taking a cue from the N64 version of San Francisco Rush, the game has numbered boxes scattered across its tracks. If you collect all these boxes, they open up cheats and other extras in BAR's GoldenEye 007-style cheat menu. Beyond that, you can earn new tracks and cars by coming in first in the championship mode, and you can practice both in the single-race option. What Paradigm accomplished visually with BAR was impressive, especially considering it didn't use the RAM Pak for an additional boost. Helicopters and creatures pop out of the environments, the framerate maintains an excellent speed throughout (it's less apparent at first, since you begin with slower cars), and the weather and lighting effects are superb. For example, the final stretch of the second track re-creates the look of driving up a mountain road during a gorgeous Colorado morning. The only real complaint that can be aimed at the visuals is that there are a few instances of pop-up in some of the tracks. They're pretty rare, but they occur just enough to rob the graphics of an even higher score. There are also a few imperfections at work on the game's multiplayer side, but these don't ruin the game in the least. The Beetle battle mode, wherein two to four players try to gather six differently colored beetle icons and escape first, just misses its mark. The arenas are often so large so that you begin playing more by watching your radar than the actual screen. They're not badly designed, but they make you wish for the simply constructed and compact ~deathmatch~ levels of Mario Kart 64. Meanwhile, the two-player race option is weak since there are no computer-controlled opponents to compete against. Since it's not the only multiplayer mode in the game, it's not horribly important, but it does contribute to keeping the game from being well rounded. Beetle Adventure Racing really shines in its single-player mode. Even without the appeal of letting you find each of the track's shortcuts and collect all the boxes to open up the game's secrets, the basic racing model is quite sound. The tracks are well made, and the gameplay is challenging to the point where you'll begin memorizing where you want to be on the other side of the turn to ensure getting that extra turbo-boost (something I haven't felt compelled to do since WipeOut XL). Having the shortcuts and other extras on top of this all is just cake.To bring it down to brass tacks, Beetle Adventure Racing is a great deal of fun. It's an excellent game, whatever genre or sub-genre you try to classify it in, and its flaws don't drag it down nearly as much as they might sound. This game is not to be missed, highly recommended, and so on."}