{"ref": "https://www.gamespot.com/reviews/star-trek-legacy-review/1900-6163442/", "date": "December 19, 2006", "game_name": "Star Trek: Legacy", "text": "It seems like a can't-lose proposition: a Star Trek game, arriving in the year of the franchise's 40th anniversary and featuring nothing but glorious starship combat, as well as the voices of all five Star Trek captains. That sounds like paradise to Trek fans starved after an unexpected hiatus from new games over the past several years. And in some ways, this is true, at least if you're playing Star Trek Legacy on the Xbox 360. The Xbox 360 version is similar in many ways to the PC version, but the big difference is that while the PC version is plagued with bugs and broken features, the Xbox 360 version works fine. And the control scheme that was awkward with the PC's keyboard and mouse is natural when used with the Xbox 360 controller. The result is a good starship combat game that feels right at home on the Xbox 360. Star Trek Legacy warps onto the Xbox 360, and it's a far better game than its PC counterpart. Legacy puts you in charge of a one- to four-ship task force of Starfleet vessels, spanning the entire breadth of Star Trek. You'll start with Archer, in the NX-01, before moving on to Kirk, Picard, Sisko, and Janeway. The plot cleverly ties together all five Star Trek franchises by using the Borg as the plot device. By chance, a typically long-lived Vulcan scientist learns about the Borg during the early days of the Federation and figures out a way to become their queen, though this quest will take decades. Along the way, she crosses paths with every famous Star Trek captain, and each one will attempt to ascertain what she's up to and stop her. Sure, there's a lot of revisionist history going on here--enough to make any Trek purist's head spin--but because Star Trek has always felt free to tinker with its history, it's not horribly egregious. As a game of starship combat, Legacy delivers on the majesty of Star Trek's starship battles. This isn't a game of twitch reflexes or starships that maneuver like fighters. Instead, it's a game of maneuvering, as you attempt to get your ship into position where it can bring its weapon banks and torpedo tubes into action against an enemy. Thankfully, the control scheme is up to the task. You'll use one joystick on the Xbox 360 control pad to control your starship while the other stick moves the camera around. It takes a bit of practice, but once you have it down, you'll be able to easily maneuver your starship in combat while keeping the camera fixed on the enemy. Nearly every iconic starship is in the game, from the NX-01 to the mighty Sovereign-class Enterprise. You'll dive into a campaign filled with some good highs but also some infuriating lows. There are plenty of massive battles to partake in, which is when the game looks best, as starships and explosions fill the screen. There's a fair amount of thinking required because you can use the command screen to order your task force to different parts of the battlefield. Thus, you can do a hit-and-run on an enemy space station, fall back for repairs, or dive into the thick of the action to help out allies. The downside is that you can't save at all during a mission, which means that if you fail, you have to start the entire thing over. Considering some missions can easily last an hour, the lack of an in-mission save gets annoying awfully quickly. It doesn't help that mission objectives are sometimes hazy, and you'll zoom about trying to figure out what you need to do. At other times, the mission objectives are insanely difficult, and you'll need to turn in a superhuman effort to win. A case in point is a save-the-planets mission where you have to warp around and destroy stellar debris before they crash into planets. However, the margin for error is so small that the slightest misstep can cause mission failure. The skirmish and multiplayer modes provide some interesting gameplay outside of the main campaign, but it's a bit annoying that both modes follow the one-and-done formula. So every time you finish a skirmish or multiplayer battle, you drop back to the main menu and have to set up another game. If you're playing on Xbox Live with a good group of people, that's absolutely no way to keep the good times going because someone has to restart the server after every mission success or failure. Still, the multiplayer battles can be very tactical in nature because you can use the size of the maps to warp around and hide from your enemy, or you can team up together to crush an isolated foe. However, the battles do not provide a lot of variety. For example, there's a deathmatch game that you can play in teams, or a co-op wave game, where all the players have to survive as long as possible against a wave of endless enemies--and that's about it. The multiplayer suite could have been a lot better, but at least it works when compared to the PC version. The achievement points are well distributed, so you'll be rewarded a fair amount for playing through the campaign. You'll receive special rewards for doing so at higher difficulty levels or not losing a ship during an era, which encourages long-term play and distinguished performance. If you're a fan of the original Enterprise, the Enterprise-D, the Defiant, or any one of the many iconic starships from the show, you'll be satisfied with the level of detail that's achieved in the game. It looks even prettier during the large-scale battles, as Federation, Borg, Romulan, and Klingon starships trade fire and explode. However, there are issues. Smaller vessels break apart nicely, but the artists should be embarrassed by how badly anything large, like a space station or a Borg cube, explodes. The Borg cube breaks apart, then a fresh cube appears in the middle of the explosion and breaks apart; then another cube appears in the middle of that crack-up and breaks apart, before the large chunky pieces spin in place like a top twirled at high speed. Then there are the bumper-car physics. If a starship runs into anything, such as another vessel, an asteroid, or even a ridiculously out-of-scale planet, it just rubs against it and then moves on. It's these kinds of oversights that ruin the otherwise solid presentation. You can also play as the Romulans, Klingons, or even the Borg in skirmish and multiplayer modes. Considering that Legacy boasts the voice acting talents of all five Star Trek captains, you'd think that all the stops would have been pulled for the game's audio. But for the most part, the efforts seem wasted because a number of the actors sound like they're dialing it in. William Shatner does his best to infuse his unique delivery, but he also sounds every one of his 75 years at times. Only the captains' voices make an appearance, because the story is told in overly long, drawn-out voice-overs while the camera pans over ships and space stations. Riveting viewing it is not. The music is typical Trek, which means noble orchestral themes for the most part. The sound effects are also fairly authentic, though some of the phaser fire seems off. However, only hardcore Trek fans should notice these details because they live for this kind of critiquing. Despite some noticeable flaws, the Xbox 360 version of Legacy manages to capture the epic feel of Star Trek combat like no other game to date. There's something captivating about watching these stately and beautiful vessels fight and die onscreen, which is something that any Star Trek fan who owns an Xbox 360 should definitely check out."}