{"ref": "https://www.gamespot.com/reviews/naruto-shippuden-ultimate-ninja-heroes-3-review/1900-6262338/", "date": "May 12, 2010", "game_name": "Naruto Shippuden: Ultimate Ninja Heroes 3", "text": "A game like Naruto Shippuden: Ultimate Ninja Heroes 3 has to do two things to be a success. It has to deliver on the Naruto name by providing content that will appeal to fans of the popular anime series, and it has to make fighting as the titular blond ninja and his friends or foes enjoyable. Ultimate Ninja Heroes 3 pays out in spades on the first point but fails to deliver on the second. As a result, it ends up feeling like fan-service halfheartedly disguised as a video game. Come for the fighting, stay for the conversation. The meat of the game is in a mode called the Master Road, which picks up with Naruto returning to Hidden Leaf Village after an absence of two-and-a-half years. He barely has time to fight a few sparring matches before his friend Gaara is kidnapped by the evil Akatsuki organization. The story of the subsequent rescue attempt and what follows is spread out across the seven chapters that make up the Master Road. This will all be familiar territory for Naruto fans, but the story is told so incoherently and throws so many characters and clan names at you that players unacquainted with the source material will be lost. The occasional dramatic animation sequence livens things up, but the overwhelming majority of conversations take place between static character portraits that oddly stand side by side and stare out at you even while speaking to each other. The Master Road is presented as a series of squares along which you move cute little animated Naruto. As you progress from mission to mission, you frequently unlock new characters you can use in both the Master Road and other modes. You also unlock new jutsu attacks and tactics that you can activate to enhance attributes like attack power and speed. You're regularly given the chance to use points earned for completing missions to purchase movies, music, and character artwork as well. If the thought of acquiring all these goodies isn't enough to motivate you, you're out of luck because the gameplay itself is wholly unrewarding. Missions take on one of two formats. In some, the camera is situated close to your character, and you must defeat one or two opponents just as you would in a fighting game. In others, the camera is further away, giving the action the look of a side-scrolling platformer. In some missions, you must defeat a certain number of enemies to advance; other times, your goal is to reach the end within a certain time limit. No matter what format a mission takes or what goals you're assigned, the shallow action and poor controls ensure that they're all equally uninvolving. Button mashing is the order of the day in the fights here. That's not to say that you don't have a decent variety of moves available, though neither the flimsy manual nor the game itself make any effort to familiarize you with your attacks. (Your best bet is the practice mode, where you can view a command list of your attacks and test them out on dummy opponents.) But this hardly matters because you can just mindlessly unleash strings of attacks until your opponents go down. There's rarely a need to think about what you're doing, and while you can eventually unlock upward of 50 characters, they don't bring any additional depth to the action. Each character does have a unique, visually stunning ultimate jutsu move that you can unleash if you have enough chakra, but these moves are so easy to pull off that the sense of satisfaction that comes from sending your opponent flying hundreds of meters into a mountainside quickly wears off. There's also a slight but noticeable delay between when you push a button and when your character performs the attack, sapping any sense of immediacy and impact from the combat. The side-scrolling levels are equally problematic. Your jumps are slow and floaty when quick and responsive is what you want for avoiding the obstacles in your way. But despite the poor controls, making your way to the exit is usually a simple matter of holding left or right and leaping over the enemies and dangers. Simple and dull. You'll soon long for the Master Road to offer you something other than these two basic types of missions, but it never does, which makes most of your journey along the road a real slog. The presentation is great, but the gameplay sadly doesn't back it up. In addition to Master Road, there are practice and free battle modes. Ultimate Ninja Heroes 3 also supports ad hoc multiplayer for up to four players. Many missions in Master Road let players invite a friend or three to help them out, and the wireless battle option lets you and your friends challenge each other. It's nice to see this functionality supported, but it doesn't change the fact that the gameplay is shallow and bland. There's no shortage of far-superior multiplayer fighting games available for the PSP, making this one impossible to recommend for solo players or those eager for human competition. There is one area where this game doesn't disappoint. The visuals are beautiful, with detailed, well-animated characters and remarkably vivid environments. Little touches like rolling rivers, leaves blowing in the wind, and flickering light from flames go a long way toward making the surroundings for the action feel alive and authentic. Enthusiastic voice performances are the highlight of the game's sound, though you'll quickly tire of hearing Naruto declare ~Health recovery!~ and ~Finders keepers!~ nearly every time he grabs a power-up. There are certainly hours upon hours of gameplay to be had here for completionists who are determined to unlock every character and acquire all the collectables, but no amount of unlockable character pictures can make putting up with this tedium worthwhile. It's not too much to ask for a game to deliver both fan service and solid gameplay. It's just more than this particular game can manage."}