{"ref": "https://www.gamespot.com/reviews/pod-speedzone-review/1900-2666138/", "date": "December 18, 2000", "game_name": "POD: Speedzone", "text": "UbiSoft has decided to capitalize on the current buzz surrounding online play on consoles with POD SpeedZone, the sequel to POD, by stripping down the single-player game and focusing on the online components. POD SpeedZone can prove to be a decent diversion, though serious control issues and a general lack of options keep it from realizing its full potential. POD SpeedZone sticks to the premise of the first POD game - POD, a crazy alien space virus, mutates anything it comes in contact with, and it is spreading across the Damertha mining colony. Mutant cars spread the virus further, and it's your job to... race against them. The premise is flimsy at best, but it's an excellent way to integrate some seriously bizarre vehicle and level design. Aside from the bizarre art direction, what separates POD SpeedZone from the pack are the large, multipathed, interactive courses. While a grand total of six different courses may not seem like much, there are truly two or three courses worth of track packed into each course. This keeps the game fresh, though occasionally the tracks lose their focus, and you may find yourself going in the wrong direction without even knowing it. And of course, there's the online mode. Supporting both the standard Dreamcast modem as well as the broadband adapter, POD SpeedZone offers extensive online play, with the single-player game functioning as more of a practice area than a real game. The online mode is proficient, with both broadband and dial-up keeping the game clipping along at a steady rate. The major problem with the game is the control of the cars themselves. POD SpeedZone goes for arcade-style racing action, and while the sense of speed can be immersive, the cars' soft cornering and propensity for wrecking prove to be annoying, bordering on frustrating. The cars are squirrelly, and a corner taken too tight or a jump that isn't lined up just right will result in a big tumbling wreck, guaranteed. For the most part, the game looks great. Each of the six tracks has its own individual look and feel, without losing the overall ~crazy alien virus~ theme of the game. The cars themselves look alien, with lots of abstract shapes. Whether you love or loathe the car design, there is no doubt that they fit perfectly in their equally twisted surroundings. The frame rate can be a bit spotty at times, specifically when there are four cars onscreen at once. The game's sound is simply present, consisting primarily of ambient techno music and the strange alien humming of your virus-infected craft. There are some good ideas present here, but POD SpeedZone comes up short in the end. The interesting level design, copious eye candy, and heavily touted online play are crippled by the games fumbled controls. Those jonesing for any kind of online play may find it amusing, but the majority would do well to leave POD SpeedZone for a weekend rental at best."}