{"ref": "https://www.gamespot.com/reviews/aragami-2-review-shadow-dancer/1900-6417747/", "date": "September 29, 2021", "game_name": "Aragami 2", "text": "Interpreting stealth as a power fantasy, Aragami 2 deploys the shadows as a literal weapon, not merely as somewhere to hide. One ability discharges tendrils of black mist from your fingertips to grab a nearby enemy and fling them headfirst into your fist, knocking them unconscious. Such powerful abilities emphasize a proactive approach to stealth that's less about waiting for a window of opportunity to open and more about knocking a hole in the wall. With a lean, stylish aesthetic complementing minimalist mission design, Aragami 2 succeeds in making you feel like a daring and deadly shadow warrior, even if it eventually falls victim to repetition and a lack of variety.Afflicted by a mysterious force that corrodes the body and devours the mind (most people would call this ~getting old~), the aragami are gifted with shadow essence which grants them supernatural abilities. They call it a curse, but to be honest it's hard to see the downside. The most basic of these abilities lets them briefly assume a shadow form and dash unseen across open ground, grapple up onto the roof of a building, or down to the cliff ledge below. Combined with a double-jump, the ability enables you to fling yourself around a level with abandon, traveling swiftly to bypass enemies, move in for the kill, or make a speedy getaway.Movement in this mode is limited by a stamina meter, but it's a generous one, allowing you to string together several jumps and dashes before requiring a moment's pause to regenerate. Traversal through an area tends to be a matter of grappling to high ground, quickly surveying the surroundings, then executing clean and decisive strikes, whether you're nimbly darting through gaps in enemy patrol routes or eliminating them one by one. There's nothing stopping you from spending half an hour hanging off the roof of a pagoda or squatting in some waist-high reeds before making your move, if that's what you want to do. It's more that the tools at your disposal, and the ease and speed with which you can utilize them, better encourage the fast, fluid approach.A highlight for me was a level where I decided, for narrative reasons I won't spoil, that every single person in this village had to die, and that I wanted every single person to know that I was hunting them down--so I made a mess. I would grapple onto a roof then leap off and plant my katana in an enemy to cushion my fall, leaving their bloodied corpse for all to see while I darted down an alley and sliced open a second enemy, before grappling onto a roof to break line-of-sight with a pursuer. I'd quickly circle around behind him then leap down and slaughter him there in the middle of the street. It was chaos, with alerted enemies frantically trying to pinpoint my location amidst all the bodies and blood, but thanks to the range of movement options that let me recover from being spotted, it was controlled chaos. This is stealth where you always feel like the hunter rather than the hunted.The aragami are not only endowed with a range of supernatural abilities, they also receive a second chance at life. Die, and they are immediately resurrected, with their health fully replenished and all experience intact. This sets you back to the start of a level, but all your progress remains--even alerted enemies will still be trying to track you down. There's no third chance, though; die a second time and the mission is failed and you'll have to repeat the whole thing over, collectibles and all. There's no mid-mission save either, so the standard crutch of stealth gaming--quick-saving after every encounter and reloading if it all hits the fan--is taken away. That these restrictions don't chafe is testament to how powerful Aragami 2 makes you feel, in the tools it equips you with to not only deal with any situation but escape from any crisis.Being low on health during your second life and knowing that one slip means a mission restart, nicely tightens the tension as you near the mission objective. It almost adds an element of dynamic difficulty in how it forces a single-minded focus on the task at hand and a gear-change from the more liberated, laissez-faire approach encouraged by the movement options. To be clear, it's never a particularly challenging game--you're too powerful for that--but I did die and restart a mission a few times, including one memorable occasion where I had to survive the last third of a level with a health bar so slim I couldn't even discern a hint of red. My heart was in my mouth over this final stretch, and it was incredibly satisfying to eventually make it by the skin of my teeth.It's impressive that the suite of stealth abilities allowed me to overcome such a setback--trust me, it wasn't because I'm any kind of gaming savant. Yet the fact I was able to do it, and that this was the one and only time it really challenged me to perform such a feat, clarified to me that Aragami 2 plays it too safe. For one, there are too few enemy types, and the handful that are present for the most part don't require you to alter your tactics in any meaningful way to deal with them. There are varying types of regular soldiers, some of whom are tougher than others, but all behave in the same way. The exceptions are the soldiers with conical hats who don't patrol and can't be lured away from their posts by any of your bag of tricks, and the monks who lob fireballs in your general direction if you open up that bag of tricks, but both of these can be knocked out or killed as easily as any other. They also don't really combine in interesting ways that might necessitate a different plan of action. Occasionally a few enemies will overlap with their patrol routes, thus forcing you to consider them as part of a group and be strategic about the order in which you handle them. Too often, however, they operate in isolation and you can take them out or ghost past them one at a time.Later levels introduce a couple of enemies that seem to offer more. The most successful of these is one with a psychic link to several nearby enemies; he'll know if you kill any enemy he's linked with and send reinforcements to investigate. The idea is that you now have to target a specific enemy first, one that's by design located in the middle of a bunch of other nearby enemies. That's a cool idea. But it's undermined by how the reinforcements aren't terribly diligent in searching for you, the fact you can simply knock out the linked enemies and the psychic won't notice, and that the psychic only appears in a bare handful of levels right at the end of the game. Another missed opportunity is a ~Predator~ enemy who perches on ledges and sports a hard-to-see shadow camouflage. They're tricky to discern because of their appearance, and don't add much to the experience as a whole since they're only encountered in a mere two levels. And in any case, they're no trickier to deal with than any regular enemy.The other major way Aragami 2 plays it safe is in a mission structure that has you revisiting the same locations numerous times. Each area hosts multiple missions over the course of the game, serving up new objectives and enemy placements in the same environment. Sometimes you'll enter from a different point, and sometimes certain sections will be closed off and other sections now open, meaning you're never re-running the exact same level on a new mission. But it does mean fewer surprises than if you were exploring new terrain on every outing.Predictability is a two-edged sword. Over the course of multiple missions in the same place, you learn the best routes and the little shortcuts and gradually familiarize yourself with a sense of place. But at the same time, a certain weariness creeps in until eventually there's an over-familiarity. Looks like this mission is taking back to the old mines yet again. Sigh. The new mission objectives freshen things up a little--this time you're killing three targets, next time you're destroying seven weapons caches, for example--but you're still looking in the same places.Over the course of multiple missions in the same place, you learn the best routes and the little shortcuts and gradually familiarize yourself with a sense of place. But at the same time, a certain weariness creeps in until eventually there's an over-familiarityIt doesn't help that each mission is also designed to be replayed, with slightly remixed enemies to allow you to grind and track down all the hidden collectibles. I made the mistake of replaying all the early missions as I went, thinking I'd need the extra XP and gold, but I later realized it was unnecessary. The main missions supply more than enough XP to purchase the new abilities and upgrades you want, and gold is abundant even if you do end up buying all the cosmetic items. Maybe it sounds great that there are slightly remixed missions to keep coming back to, but I found them to be a pretty pointless detour that bogged down my progress and accelerated the staleness of a repeated area.Threading the missions together is a light narrative that offers just enough detail to propel events forward, but is never the focus. In between missions, you'll return to your home village to speak to the few significant characters who keep the plot ticking over. Such exchanges are brief and do little to emotionally invest you in the world. It'd be nice to have a compelling reason to take on a mission, but the stealth-action is impressive enough to stand on its own.Aragami 2 is a bold and aggressive take on the stealth genre, when it finds the confidence to step out of the shadows. Occasionally, however, it's a little too timid and reverts to playing it safe, cowering in the corner rather than seizing the initiative."}