{"ref": "https://www.gamespot.com/reviews/donkey-kong-country-review/1900-6029844/", "date": "June 11, 2003", "game_name": "Donkey Kong Country", "text": "A small yet popular portion of the Game Boy Advance library consists of remakes of Super NES games. Breath of Fire, Kirby: Nightmare in Dream Land, The Legend of Zelda: A Link to the Past, Super Mario World, and Yoshi's Island are just a few of the many games that have been bought back to life on Nintendo's diminutive handheld system. The latest to join the roster is Donkey Kong Country, which was originally released in 1994 as a joint project between Rare and Nintendo. By and large, it's a faithful port of a fondly remembered platformer. These graphics were the talk of the town in 1994. Back then, the game leapt off store shelves to the tune of more than 8 million copies sold, because it combined familiar characters and traditional platform-jumping gameplay with a graphical technique that was relatively uncommon at the time. All the characters and backgrounds were first rendered in 3D using powerful Silicon Graphics computer systems and then transformed into 2D objects and animation sequences for use in the game. The end result was a $50 game with characters and animation that were more colorful and fluid than anything else available for home systems at that time. More importantly for Nintendo, it gave players and their families a reason to stick with the Super NES over Sega's two high-powered Genesis add-ons, the Sega CD and 32X. Perhaps because they made use of what were once cutting-edge techniques, the graphics in Donkey Kong Country have aged well. The environments, as colorful and tropical as they are, are brought to life by the use of multiple background layers and the careful positioning of light sources during the original rendering process. While you walk, leap, and swing your way through the game, you really get the impression that you're in a dense jungle, with mountains in the distance and the sun glaring down from above. A few stages take place beneath the surface of lakes and swamps, where a bubbly translucency effect suggests the presence of water all around you. Of course, the techniques used to create the backgrounds are old hat now and employed by just about every game currently available for the GBA--but that doesn't mean that Donkey Kong Country won't impress you from time to time. The blowing snowstorm in the Snow Barrel Canyon stage and the eerie haze effect in Misty Mines are just as stirring now as they were in 1994. For this remake, Nintendo and Rare have made a few graphical improvements and adjustments in an effort to compensate for the unique size and contrast of the GBA's LCD screen. The visible screen area is cropped slightly, more on the top and bottom than the left and right. In general, this doesn't pose a problem, except in rare situations when you need to jump onto a moving platform situated just below your range of vision. Another, more significant change is that the brightness has been cranked way up--so much so that if you own a GBA SP, certain stages may appear washed-out or grainy. Of the 34 stages in the game, roughly three or four may require that you deactivate the GBA SP's backlight to be able to see the backgrounds comfortably. Purists will note that some stages are missing various translucency or parallax scrolling effects, but these omissions really aren't noticeable unless you're looking for them. A new enhancement that's more than welcome is the addition of background accents, such as scurrying rats and crawling spiders. The underwater sequences are beautiful. Much of the animation and artwork for the characters has been redone as well. Donkey Kong and Diddy Kong, the two stars of the game, move more gracefully and react more visibly to contact with enemies and hazards. Many of the larger Kremling characters, who are the enemies in the game, also display a more lifelike range of motion. At various points throughout the journey, you'll visit homes and businesses set up by three of Donkey Kong's closest friends: Cranky, Candy, and Funky. Their dwellings have all been redrawn to better reflect their personalities. The most amusing of these is Cranky's cabin, which now has a Nintendo sign sticking out from among some crates on the floor, as well as a head mounted on the wall that closely resembles Sabrewulf from Rare and Nintendo's other joint project, Killer Instinct. Overall, Donkey Kong Country fits right in graphically with recent games designed specifically for the GBA hardware. For the most part, the same holds true for the audio. The background instrumentals feature a mix of various styles--primarily tropical, trance, rock, and classical. Many of the tunes from the original game have been remixed and redone for the GBA version, likely due to the differences between the sound hardware in the Super NES and GBA. Fans of the original game will notice the absence of a drumbeat here or there, but nothing to get angry about. The sound effects aren't all that special anymore, but it's nice to be able to clearly hear the grunts and growls that Diddy and Donkey make. Nintendo's main goal in 1994 was to show that the Super NES could still hold its own against the graphics and audio capabilities of the more expensive and more powerful machines coming into the market from Sega, Sony, and other companies. In that respect, Donkey Kong Country was, and in many ways still is, a resounding success. Nonetheless, its gameplay aspects were only a touch ahead of the curve back then, and they aren't nearly as impressive on a system that already has a dozen or more excellent side-scrolling adventure games. If you were a fan of Donkey Kong Country when it was first released, you'll probably appreciate the GBA version. Likewise, if you enjoy side-scrolling adventure games, this is the sort of title that will occupy a beloved spot in your collection. For those of you who don't belong to either group, your mileage may vary. Squawks the parrot lights the way in this cave level. At its heart, Donkey Kong Country is Super Mario Bros. with apes--an adventure game for all ages where the main task is to run and jump your way through level after level until you reach, and hopefully defeat, the final boss. Like in the Super Mario Bros. games, you can pounce on top of enemies to remove them from the screen, and you can use objects (barrels instead of turtle shells) to throw at enemies and smash open the secret passageways littered throughout each stage. Where Super Mario Bros. would give you an additional stamina point in the form of a cape or fireball suit, Donkey Kong Country has Diddy and Donkey following one another through each level. When one character falls to an enemy, you have a second chance using the other. The major aspect that sets Donkey Kong Country apart from similar games is the amount of variety present in each level. Each stage has its own theme that manifests itself in the gameplay somehow, whether it's swimming underwater, riding in mine carts, swinging from vines, or launching your character out of barrel-shaped cannons. There are two or three secret passageways hidden in each level that lead to any of a half dozen or so bonus games where you can earn bananas and balloons, which ultimately translate into additional lives. In many places, you'll find crates that contain animals that you can ride and control--anything from a rampaging rhino and a bouncing frog to a flying ostrich that can hover across short distances. Even though only a few of today's games pack an equivalent amount of diversity into each level, it's a good bet that you've performed many of these tasks before. Shuffling along in mine carts, riding atop animals, and attempting to reveal secret passageways are hardly original ideas anymore. There's certainly a lot to do in Donkey Kong Country, and the character dialogue does a fine job of moving the story along, but the two aspects never converge into the same sort of charm that you experience playing a game like Yoshi's Island or Sonic the Hedgehog. In those games, the characters themselves can do a lot more than jump around and hurl barrels. Here, many levels just feel like an excuse to chain together a series of impossible jumps and bounces that will drain your stored lives and force you to backtrack to earn more. Minigames aren't a bad way to spice up an older game, but a few more would've been a good idea here. Nintendo and Rare didn't make any significant changes to the gameplay for the GBA game. A few levels come up in different locations, and the attack patterns for two of the bosses are different, but that's about it. It would have been nice if there had been at least a couple of new levels to challenge those who've played the game before. An effort was made to add more bonuses to the game, however. You can collect snapshots hidden in various spots to build a photo gallery of artwork associated with the game, and Candy and Funky Kong run dancing and fishing minigames that offer prizes such as extra lives and additional snapshots. For each level you complete, you can select a time attack option that records your fastest time through the level. The last bonus is the hero mode, which becomes available once you complete the game with 90 percent of the secret items collected. Hero mode is a more difficult variation of the normal quest that limits you to a single character and doesn't allow you to save in the middle of a level. These bonuses aren't exactly noteworthy additions, but they're better than nothing. As time goes by, more and more of the classics of yesteryear will be remade and renovated for a new generation of players. Donkey Kong Country may not impress you with its play mechanics, but it's easy to understand just from looking at and listening to the game why it was able to stave off the competition and give the Super NES another year of retail viability. There's a lot to like here, provided you haven't already played the game to death. Nintendo's main goal in 1994 was to show that the Super NES could still hold its own against the graphics and audio capabilities of the more expensive and more powerful machines coming into the market from Sega, Sony, and other companies. In that respect, Donkey Kong Country was, and in many ways still is, a resounding success. Nonetheless, its gameplay aspects were only a touch ahead of the curve back then, and they aren't nearly as impressive on a system that already has a dozen or more excellent side-scrolling adventure games. If you were a fan of Donkey Kong Country when it was first released, you'll probably appreciate the GBA version. Likewise, if you enjoy side-scrolling adventure games, this is the sort of title that will occupy a beloved spot in your collection. For those of you who don't belong to either group, your mileage may vary. Squawks the parrot lights the way in this cave level. At its heart, Donkey Kong Country is Super Mario Bros. with apes--an adventure game for all ages where the main task is to run and jump your way through level after level until you reach, and hopefully defeat, the final boss. Like in the Super Mario Bros. games, you can pounce on top of enemies to remove them from the screen, and you can use objects (barrels instead of turtle shells) to throw at enemies and smash open the secret passageways littered throughout each stage. Where Super Mario Bros. would give you an additional stamina point in the form of a cape or fireball suit, Donkey Kong Country has Diddy and Donkey following one another through each level. When one character falls to an enemy, you have a second chance using the other. The major aspect that sets Donkey Kong Country apart from similar games is the amount of variety present in each level. Each stage has its own theme that manifests itself in the gameplay somehow, whether it's swimming underwater, riding in mine carts, swinging from vines, or launching your character out of barrel-shaped cannons. There are two or three secret passageways hidden in each level that lead to any of a half dozen or so bonus games where you can earn bananas and balloons, which ultimately translate into additional lives. In many places, you'll find crates that contain animals that you can ride and control--anything from a rampaging rhino and a bouncing frog to a flying ostrich that can hover across short distances. Even though only a few of today's games pack an equivalent amount of diversity into each level, it's a good bet that you've performed many of these tasks before. Shuffling along in mine carts, riding atop animals, and attempting to reveal secret passageways are hardly original ideas anymore. There's certainly a lot to do in Donkey Kong Country, and the character dialogue does a fine job of moving the story along, but the two aspects never converge into the same sort of charm that you experience playing a game like Yoshi's Island or Sonic the Hedgehog. In those games, the characters themselves can do a lot more than jump around and hurl barrels. Here, many levels just feel like an excuse to chain together a series of impossible jumps and bounces that will drain your stored lives and force you to backtrack to earn more. Minigames aren't a bad way to spice up an older game, but a few more would've been a good idea here. Nintendo and Rare didn't make any significant changes to the gameplay for the GBA game. A few levels come up in different locations, and the attack patterns for two of the bosses are different, but that's about it. It would have been nice if there had been at least a couple of new levels to challenge those who've played the game before. An effort was made to add more bonuses to the game, however. You can collect snapshots hidden in various spots to build a photo gallery of artwork associated with the game, and Candy and Funky Kong run dancing and fishing minigames that offer prizes such as extra lives and additional snapshots. For each level you complete, you can select a time attack option that records your fastest time through the level. The last bonus is the hero mode, which becomes available once you complete the game with 90 percent of the secret items collected. Hero mode is a more difficult variation of the normal quest that limits you to a single character and doesn't allow you to save in the middle of a level. These bonuses aren't exactly noteworthy additions, but they're better than nothing. As time goes by, more and more of the classics of yesteryear will be remade and renovated for a new generation of players. Donkey Kong Country may not impress you with its play mechanics, but it's easy to understand just from looking at and listening to the game why it was able to stave off the competition and give the Super NES another year of retail viability. There's a lot to like here, provided you haven't already played the game to death."}