{"ref": "https://www.gamespot.com/reviews/lost-via-domus-review/1900-6186994/", "date": "February 29, 2008", "game_name": "Lost: Via Domus", "text": "According to the television show Lost, in 2004, Oceanic Airlines flight 815 crashed somewhere in the Pacific Ocean. Whether you think the survivors are stranded on an island or bottled up in a different location, Ubisoft has added one more survivor to the mix in its latest adventure game. Lost: Via Domus tells a good story, but it's far too short to justify the game's price of admission. In Lost: Via Domus, you take control of an amnesiac photojournalist who was also aboard the fateful transpacific flight. During the game you must slowly regain your identity through completing quests, talking with the other survivors, and correctly identifying clues during flashbacks. Early on you find out you had a camera on the plane with you. Evidently one of your photographs made another survivor mad enough to want to destroy the photograph and kill you. The events in the story unfold in a great parallel to the TV series. Most of the game's storyline occurs during the first two seasons of the show, but characters appearing in season three of the show are also included in encounters and exposition. The core characters are all there: Jack, Locke, Kate, Sawyer, Charlie, Claire, Sun, Jin, Hurley, and Sayid. Tom, Ben, and Juliet--of the Others--appear as well to ensure that the hostile, we-were-here-before-you storyline is kept alive and well. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Lost: Via Domus Gameplay Video Review Fans of the show will recognize plenty of characters and locations. The environments are hands down the best-looking part of the game, particularly on the PlayStation 3. The as-seen-on-Lost locations and the few new environments are beautifully and accurately rendered. The lighting, feel, and sounds of the environment are all spot-on. Frequently, we found ourselves walking out to precipices just to take in the sights or zooming in with our camera to see how detailed the hatch's bookshelves were. The crash site looks true to the show's pilot episode, even if the chaotic initial few minutes don't play out exactly as they do in the TV series. The areas look great, and their diversity keeps you from feeling like you're spending too much time in one place. The biggest problem is that there is not enough gameplay to fill more than seven hours, even if you go out of your way to find all of the Easter eggs, take in all of the sights, and unlock all of the achievements available on the Xbox 360. The bartering, exploring, hot-wiring, and occasional pistol-firing sequences are all a clear part of the Lost milieu. You'll spend so much time in the fuse-plugging minigames, though, that you'll feel like an electrician by the end of your adventure. That's because the same minigame is played when you need to access everything from old hatches on the island to the crashed jetliner's fuselage. One standout portion of the gameplay is the way photography is used in the playable flashback sequences. At the outset of each trip down memory lane, you get a glimpse of a torn-up photograph. From that flash, you have to use your camera to take a picture to match the broken image as the sequence of events plays out. The same sequence will loop repeatedly for you as you try to zoom, focus, and position the framing to match what the image was. Upon successfully capturing the required image, you are then treated to a cutscene with a portion of the main character's backstory. The whole premise makes flashbacks interesting, immersive, and enjoyable. The fact that flashbacks fit so well within the main character's photojournalist vocation also makes the functionality feel natural and engaging. Interacting with the cast should be enjoyable, but that isn't always the case. Your character's dialogue isn't always voiced, but when it is, his comments are often natural and believable. At other times, however, his remarks get repetitious. The voice acting in Lost: Via Domus is generally decent, but the lip-synching leaves a lot to be desired. Aside from the occasionally great delivery by Hurley or the infrequent encounters with the Others, most of the exchanges look and feel flat. Even the nicknames delivered by Sawyer crash and burn most of the time. The characters are instantly recognizable but generally fail to do their real-life counterparts justice. Also, the 360 version has some instances of inconsistent shading on the characters' faces. You'll get the same Lost: Via Domus experience regardless of which platform you choose to play on. All three versions of Lost: Via Domus look and perform in a similar manner. The PlayStation 3 version looks a little cleaner and brighter than the others, but it can be played only after a seven-minute, onetime install. The PC version allows for seamless mouse-and-keyboard controls. The Xbox 360 version looks a little darker than the others. Still, you'll get the same story and a pretty similar experience on every platform. For the most diehard of Lost followers, the time spent with the game will be enjoyable. Unfortunately, it is over way too fast. Via Domus is full of little hang-ups, and it requires some knowledge of the show that could potentially isolate outside players and keep them from becoming immersed in the gameworld. Ultimately, this game can be recommended for purchase only to the most diehard of Lost fans."}