{"ref": "https://www.gamespot.com/reviews/red-faction-review/1900-2813101/", "date": "September 18, 2001", "game_name": "Red Faction", "text": "It's a concept straight out of a sci-fi 'zine: Deep in the heart of Mars, a hapless miner named Parker slaves away for a dictatorial corporation called Ultor. Suddenly, the miners can't take the abuse any longer, and Parker gets swept up in an armed revolt against his inhumane employer and its legions of corrupt, heavily armed guards. You play as Parker throughout Red Faction, a good-looking first-person shooter that has a wide variety of weapons and some other notable features, as well as a mostly enjoyable single-player game and a complete multiplayer mode. Red Faction was well received when it was released for the PlayStation 2 console earlier this year. As one of the only original first-person shooters for the PlayStation 2, Red Faction impressed an audience of gamers that didn't know what to expect from a next-generation console shooter. However, the PC shooter genre is already filled with excellent games. So the PC version of Red Faction, which adds 32-player multiplayer support and a level editor, has a harder time distinguishing itself, despite its good traits. Red Faction was created by Volition, the talented studio whose earlier projects include the role-playing game Summoner and the superlative space combat simulation FreeSpace 2. Volition's latest game has much of the same visual appeal and generally high level of quality found in its previous efforts. Yet Red Faction is somewhat lacking in creativity compared with those other games, as the plot, the characters, the levels, and many of the weapons found throughout are all pretty typical of what you might find in other sci-fi-themed shooters. Red Faction's single-player game also isn't very long, and it will likely take you about 10 hours to finish, though multiple difficulty settings and the multiplayer mode do give the game some replay value. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Red Faction Video Review Red Faction is clearly inspired by earlier shooters, especially Valve's groundbreaking Half-Life, and it doesn't deviate much from the formula that was refined by that game and has been reused by many others over the years. As with any recent shooter, controlling Red Faction is easy and responsive by means of a keyboard-and-mouse combination. As Parker, you're generally well protected against enemy attacks thanks to your bright red mining suit, which even lets you breathe underwater indefinitely. Parker runs quickly and jumps nice and high, and he can carry a huge arsenal of weapons--more than a dozen. Many of these weapons are instantly recognizable archetypes found in other shooters. They're mostly well done in Red Faction, and they all have alternate firing modes or special features. You'll appreciate such details as the digital ammo readout on the side of the assault rifle, the rocket launcher's ability to detect human heat signatures through walls, and the flamethrower's detachable explosive fuel canisters. A see-through riot shield that can absorb enemy gunfire, a deadly semiautomatic sniper rifle, and a single-shot railgun that shoots through walls are some of the other highlights. Yet while Red Faction's arsenal seems extensive, it can also feel somewhat confining. Weapons such as the assault shotgun and grenade are too slow to be of much use. Your aim with either of the two different sniper rifles is completely steady even when you're looking through the magnifying scopes, which reduces some of the challenge in using them. Often, you'll have just one or two weapons in your arsenal that are best suited to your particular situation, which makes some of the gun battles in Red Faction seem predictable. This is partly because you'll be fighting the same sorts of enemy guards, only in various shapes and forms, throughout the majority of the game. Fortunately, these guards are quite competent--the tougher ones aim well, and they all do a pretty good job of dodging from side to side and hiding behind walls when they can. They also tend to flee when they take some damage or run out of ammo, but on the other hand, they aren't good at working in groups and they don't flush you out when you're hiding. And once you learn to aim for their heads--you may already be very used to doing this in other shooters--in most cases you'll be able to bring them down quickly and without much trouble. Besides all the guards, you'll take on an occasional mining robot or an experiment-gone-wrong, but these aren't very interesting and don't give the combat quite as much variety as you'd probably want.It's too bad that Parker must fight all by himself most of the time. On the rare occasions when he's accompanied by other miners, those fools blunder headlong into their deaths. No wonder he's alone. Still, Red Faction's context--a violent revolt--just doesn't come across well since only Parker seems to be doing any of the real work, while a remote hacker tells him which way to go next. At any rate, you'll certainly appreciate the game's few sequences when you're not the only one shooting at the enemy. More such sequences would have been welcome, just as it would have been nice if Volition offered a cooperative multiplayer option for the single-player levels. You'll get to commandeer several different types of vehicles. Red Faction has some fun features that are a bit gimmicky but nevertheless add some diversity to the action and otherwise leave room for future shooters to try to improve on these elements. Most notably, Volition's trademarked Geo-Mod technology lets you use your explosive weapons to literally blow apart certain types of surfaces, such as thin metal or cavern walls. In several satisfying points in the game, rather than having to unlock a door of some sort, you get to blast a hole through the wall beside it and walk on through. This effect is quite well done and used with surprising restraint--perhaps too much restraint--during the single-player game, though it figures prominently in some of the multiplayer maps, especially the capture-the-flag levels, where you can rip into the opposing team's headquarters rather than try to navigate the corridors. Red Faction also lets you commandeer a variety of vehicles, ranging from submarines and one-man fliers to armored trucks, that look great and can be fun to use, but they're modeled with simplicity and all control in about the same sluggish way. Red Faction even throws in a couple of stealth sequences that require you to stay far enough away from nearsighted guards and security cameras--but these parts are mostly just a diversion from the more-straightforward shooting sequences, which are more fun. Red Faction's proprietary 3D engine looks good and runs fast and smooth on systems with plenty of memory and a good graphics card, the game's moderately sized levels load fairly quickly, and you can instantly save your progress at any time. The game occasionally crashed on two different test systems, though this wasn't detrimental. The characters found throughout Red Faction are fully animated and clearly detailed--you'll learn to identify the various weapons in the hands of your foes--and the special effects, especially explosions and shattering glass, look great. Red Faction also has rather pronounced blood effects for whenever anybody gets hit, but they're as graphic as the game gets. The game's environments feature sharp, attractive textures, although the architecture itself is fairly plain. Furthermore, the game's futuristic Martian setting just doesn't really lend itself to a tremendous amount of variety--the environments won't surprise you if you've played any other sci-fi-themed shooters lately, and the game's early stages, all winding red caverns, are particularly drab. Most of the audio in Red Faction isn't very special, either, as the flat voice acting, the somewhat subdued weapon effects, and the droning electronic/ambient score all suitably supplement the action but don't enhance it much. Fortunately, some of the weapons do sound like they pack a serious punch, and effects like explosions are nice and loud. The action is formulaic, but it's fast and frequently fun. Because of the game's multiplayer mode, and perhaps the level editor that comes included, Red Faction should keep you busy for a while after you've finished the single-player mode. The editor is as complex as you'd expect from a tool that lets you build intricate 3D levels, though prospective level designers should find good incentive in tinkering with the Geo-Mod system. Multiplayer offers 20 different maps for standard deathmatch and team deathmatch, as well as seven maps designed for capture the flag. Red Faction's fast pacing and broad arsenal make the action play out rather differently on some maps than on others--some are much more conducive to close-quarters skirmishes, while others are perfect for long-range combat, and Red Faction has plenty of weapons in each category. And despite the fact that a few of Red Faction's weapons can be much more powerful than most, the multiplayer mode can be quite fun. Red Faction is a good, solid shooter. The PC version is technically superior to the earlier PlayStation 2 version on account of its higher-resolution graphics and its multiplayer mode, and it controls much better using the PC's keyboard-mouse combo compared with the PlayStation 2's gamepad. The PC version even retails for $10 less. Then again, Red Faction for the PC faces stiff competition from other, similar sci-fi-themed shooters that are older but still popular. Its relative lack of originality can therefore undermine Red Faction's appeal for more-experienced players, for whom the game will provide mostly familiar territory. Nevertheless, Red Faction is an accomplished shooter in its own right--it deserves a look from fans of the genre, as well as from those who've been impressed with Volition's other achievements.It's too bad that Parker must fight all by himself most of the time. On the rare occasions when he's accompanied by other miners, those fools blunder headlong into their deaths. No wonder he's alone. Still, Red Faction's context--a violent revolt--just doesn't come across well since only Parker seems to be doing any of the real work, while a remote hacker tells him which way to go next. At any rate, you'll certainly appreciate the game's few sequences when you're not the only one shooting at the enemy. More such sequences would have been welcome, just as it would have been nice if Volition offered a cooperative multiplayer option for the single-player levels. Red Faction has some fun features that are a bit gimmicky but nevertheless add some diversity to the action and otherwise leave room for future shooters to try to improve on these elements. Most notably, Volition's trademarked Geo-Mod technology lets you use your explosive weapons to literally blow apart certain types of surfaces, such as thin metal or cavern walls. In several satisfying points in the game, rather than having to unlock a door of some sort, you get to blast a hole through the wall beside it and walk on through. This effect is quite well done and used with surprising restraint--perhaps too much restraint--during the single-player game, though it figures prominently in some of the multiplayer maps, especially the capture-the-flag levels, where you can rip into the opposing team's headquarters rather than try to navigate the corridors. Red Faction also lets you commandeer a variety of vehicles, ranging from submarines and one-man fliers to armored trucks, that look great and can be fun to use, but they're modeled with simplicity and all control in about the same sluggish way. Red Faction even throws in a couple of stealth sequences that require you to stay far enough away from nearsighted guards and security cameras--but these parts are mostly just a diversion from the more-straightforward shooting sequences, which are more fun. Red Faction's proprietary 3D engine looks good and runs fast and smooth on systems with plenty of memory and a good graphics card, the game's moderately sized levels load fairly quickly, and you can instantly save your progress at any time. The game occasionally crashed on two different test systems, though this wasn't detrimental. The characters found throughout Red Faction are fully animated and clearly detailed--you'll learn to identify the various weapons in the hands of your foes--and the special effects, especially explosions and shattering glass, look great. Red Faction also has rather pronounced blood effects for whenever anybody gets hit, but they're as graphic as the game gets. The game's environments feature sharp, attractive textures, although the architecture itself is fairly plain. Furthermore, the game's futuristic Martian setting just doesn't really lend itself to a tremendous amount of variety--the environments won't surprise you if you've played any other sci-fi-themed shooters lately, and the game's early stages, all winding red caverns, are particularly drab. Most of the audio in Red Faction isn't very special, either, as the flat voice acting, the somewhat subdued weapon effects, and the droning electronic/ambient score all suitably supplement the action but don't enhance it much. Fortunately, some of the weapons do sound like they pack a serious punch, and effects like explosions are nice and loud. Because of the game's multiplayer mode, and perhaps the level editor that comes included, Red Faction should keep you busy for a while after you've finished the single-player mode. The editor is as complex as you'd expect from a tool that lets you build intricate 3D levels, though prospective level designers should find good incentive in tinkering with the Geo-Mod system. Multiplayer offers 20 different maps for standard deathmatch and team deathmatch, as well as seven maps designed for capture the flag. Red Faction's fast pacing and broad arsenal make the action play out rather differently on some maps than on others--some are much more conducive to close-quarters skirmishes, while others are perfect for long-range combat, and Red Faction has plenty of weapons in each category. And despite the fact that a few of Red Faction's weapons can be much more powerful than most, the multiplayer mode can be quite fun. Red Faction is a good, solid shooter. The PC version is technically superior to the earlier PlayStation 2 version on account of its higher-resolution graphics and its multiplayer mode, and it controls much better using the PC's keyboard-mouse combo compared with the PlayStation 2's gamepad. The PC version even retails for $10 less. Then again, Red Faction for the PC faces stiff competition from other, similar sci-fi-themed shooters that are older but still popular. Its relative lack of originality can therefore undermine Red Faction's appeal for more-experienced players, for whom the game will provide mostly familiar territory. Nevertheless, Red Faction is an accomplished shooter in its own right--it deserves a look from fans of the genre, as well as from those who've been impressed with Volition's other achievements."}