{"ref": "https://www.gamespot.com/reviews/jet-force-gemini-review/1900-2544594/", "date": "October 12, 1999", "game_name": "Jet Force Gemini", "text": "Like the Chicago Bulls of the early 1990s or the San Francisco 49ers of the 1980s, some teams just keep finding ways to win time and time again. It's no different for video-game developers, especially if the developer's name is Rareware Its latest endeavor, the 3D space adventure Jet Force Gemini, has such a wide variety of awesome gameplay that it could be broken up into four separate games - and still get strong reviews. That said, Jet Force Gemini easily joins Rareware's already impressive stable of hits, which includes GoldenEye 007 and Banjo-Kazooie.At first glance, Jet Force Gemini seems like a chemical compound that incorporates the best elements from several successful franchises: Take Turok's enemies, add in Banjo-Kazooie's gameplay, include GoldenEye's sniping action, then throw in a Star Wars-like theme complete with sidekick droids and furry Ewok-like creatures known as Tribals - and mix. The game's basic goal is to search for and rescue the Tribals, who've been attacked and enslaved by alien insects. To do this, you assume the role of three main characters (unlocked eventually as the game progresses): the fraternal twins Juno and Vela, plus their canine mascot, Lupus. Once they are unlocked, you can play any of those characters' unique, moderately sized quests in whatever order you please. There's also a wealth of multiplayer modes (more on that later).Since finding Tribals is the name of the game, its multipart levels offer plenty of exploration. However, it's possible to go an entire level without finding a single one, since many levels have branching paths and optional locations to visit. You may also find multiple exits in a level that lead to optional secret levels. The game's free-flowing nature gives virtually no hints, so you must figure things out on your own (a prospect that may frustrate novices; it's easy to get ~stuck~ in a few levels). Many of the levels offer simple puzzles that you can solve to save Tribals, such as one in which you move color-coded platforms to get across a room. However, most of the fun is reserved for killing baddies. In terms of AI, enemies have basic common sense: They can run for cover, dodge, weave, and they have weak points and defenses. Some enemies use different attacks, depending on whether they've spotted you or not. Others are mindless drones who use sheer numbers to overwhelm. This AI lets you develop your own playing style in response, which is highly rewarding for a game of this nature. You might prefer to snipe from afar and use available cover (such as boxes and walls) to avoid return fire. Or you might just want to pull a Rambo and go in guns a-blazin'. Each strategy has its drawbacks (losing time vs. losing life). You can also play from a third-person perspective, which is harder but necessary for jumping. You can always revert to first-person view on the fly, which makes targeting enemies much easier.The game's control scheme actually flip-flops between two views, depending on how the game's being played. In the default third-person view, the player uses the analog joystick to move around, the C buttons to strafe, jump and crawl, and the A, B and Z buttons to select weapons and fire. In this view, it's rather difficult to shoot enemies (especially at close range), which may prove frustrating to some gamers. To help alleviate this problem, the game uses the R button to switch to a first-person view more akin to Turok's. The C buttons become movement buttons, while the joystick becomes the crosshair target. Mastering this mode becomes essential, since you must aim directly at certain weak points to kill tougher enemies and bosses. This flip-flop in control can get confusing - and the confusion is only compounded by the lack of a jump button in first-person view. Those who've played Turok-type games may prefer to play most of the game in first-person view, which is OK except for the chore of keeping the R button down throughout the entire game. Overall, the control remains responsive at all times - but the awkwardness in using two very different control styles in the same game might prove distasteful to some.What makes Jet Force Gemini work is a philosophy that is prevalent throughout Rareware's games: Make it easy to beat, but difficult (and rewarding) to complete 100 percent. Since you'll find new power-ups along the way (such as robot droids, keys, weapons and jet packs), you'll want to backtrack through the levels to explore previously unreachable areas and find secrets - this boosts the game's replay value immensely. It's in this area of the game that Jet Force Gemini really shines. One of the best secrets is a robot named Floyd; after you've found all his hidden parts and put him together, he'll becomes your sidekick. What makes Floyd so innovative is that a second player can take control of Floyd's targeting scope and turn the one-player game into a two-player co-op mode. Plus, Floyd acts as a special ~key~ to areas that lead to special mini-missions (yet another new type of game), in which the robot must fly through courses within a certain time limit. Plus, there's always the reward for rescuing every single Tribal (and yes, you Ewok-clone haters will have the ability to kill every single one, as well). You can also find secrets to unlock hidden characters and modes for the multiplayer games. Plus, with tons of hidden areas in each level, where you can find weapons and weapon upgrades, there's seemingly no end to things to look out for. The four-player multiplayer mode, for the most part, follows the conventions of GoldenEye, Turok, and other similar titles. You can set weapons parameters, enable radar, and choose from a variety of levels. It's certainly fun and plays well, mainly because multiplayer games where killing is involved seem inherently fun. However, this game adds even more to the mix by offering a target-shooting game, and even a racing game (which can be unlocked by finding the corresponding secret in the adventure mode). In any case, the the variety of multiplayer modes alone makes the game worth your money.Of course, the great gameplay in the multiplayer and adventure modes looks and sounds highly impressive, no doubt due to the developers' knack for knowing the ins and outs of the Nintendo 64 hardware. Smooth animation and slick, sharp graphics reign throughout, with never any slowdown or choppiness. There isn't enough bandwidth online to catalog every example of stellar graphics (even without the expansion memory pak, it looks great), but here are a few highlights. As in Turok, enemies splatter with great gusto and die differently depending on how they're killed. The immense full-screen bosses and their massive attacks let players put their first-person targeting skills to the test. The explosions for grenades and missiles give off a radial glow that seems wholly convincing coupled with a Rumble Pak shake. Furthermore, each of the sprawling levels has a unique theme and colorful landscapes, accentuating the feeling that you are traveling from planet to planet - not just from level to level. In addition, the music and sound effects really inject the proper mood for each level: foreboding music in dark, rainy levels, or bleeps and bloops for those high-tech missions. Rare even added many great visual touches (such as flies over an enemy's carcass), and impressive effects in night-vision levels (where everything turns shades of green) and in levels where you're swimming. Ranting and raving aside, the game is not without its minor flaws. As with almost any 3D adventure game, certain areas play havoc on the third-person camera angles. This becomes a slight problem when you are negotiating jumps - especially those that fall short, resulting in death or tedious backtracking. In isolated instances, enemies glitch up by running into boxes and sticking to them, making them easy targets. The other problems seem more a fault of system limitations than of the game itself. First, some of the backgrounds and textures look a little flat, such as in the forest stages. Second, it would've been nice in cinema scenes to have voices for the characters rather than sound effects coupled with text boxes.However, these nitpicky complaints do little to spoil Jet Force Gemini's bottom line: It's chock-full of gameplay variety. Nintendo 64 fans should pick up this title without delay and hope that Rareware's team of top-notch talent will continue to churn out even more games like this one for years to come."}