{"ref": "https://www.gamespot.com/reviews/max-payne-review/1900-2831464/", "date": "December 10, 2001", "game_name": "Max Payne", "text": "Created by Finnish developer Remedy Entertainment, Max Payne was in production for a very long time. It's a gritty third-person shooter that's clearly inspired by the stylish cinematography and choreography of the Hong Kong action movie genre, particularly the work of director John Woo. Like many of Woo's films, Max Payne is rife with gunplay that's amazing to watch--and yet actually playing it is even better. Max Payne does have a few weaknesses. Action games for the PS2 generally aren't known for their longevity, and Max Payne is no exception--it's fairly short and lacks any multiplayer features. More importantly, the game loses much of the original PC version's polish in translation to the PS2--loading times are bad, and the game's sluggish frame rate and blurry textures aren't flattering, especially if you've seen the far-superior-looking PC and Xbox versions of Max Payne. If the differences were only skin-deep, they wouldn't matter that much, but they run deep enough to adversely affect Max Payne's gameplay. That's a lot of shortcomings to mention right off the bat, but the fact that they don't severely hinder this otherwise outstanding action game says a lot about how fun it is. You play as the title character throughout the game. Max is a modern-day New York undercover cop whose wife and baby daughter were brutally murdered and who has since been framed for a heinous crime. Thus begins his blood-soaked battle to find the truth--and to get revenge. The game has many great qualities, but one of the best things about it is how it actually plays. It's very easy to get into, because the control is smooth, simple, and responsive. The keyboard/mouse controls used in the PC version translate nicely to the stock PS2 gamepad--you use the left analog stick to move and the right analog stick to aim. The game's third-person camera perspective trails closely behind Max and gives a good sense of your surroundings, which is important since you'll need to move carefully through the game's enemy-infested environments. The top right shoulder button fires your equipped weapons as rapidly as possible, while the top left shoulder button triggers Max's ~bullet time~ special ability, which temporarily puts everything in slow motion, as in a John Woo movie or the 1999 sci-fi hit The Matrix. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Max Payne Video Review Bullet time is great. The sounds of gunfire become muted and distant, and you hear a rush of air and then the pounding of Max's heart. Bullet time isn't just for show--it effectively gives Max superhuman reflexes, and while all the action in the game is slowed, you can still aim as quickly as you can point the right analog stick. Hence, bullet time lets you perform incredible feats of marksmanship and, in combination with the left analog stick, deadly acrobatic leaps in any direction. This particular technique, called a ~shootdodge,~ is the key to surviving most of the game's gunfights. As you launch yourself through the air, you might actually make out the enemy's bullets zinging past you--a good effect, though not as dramatic as it is on the PC or the Xbox, where the game looks so detailed that you can even distinguish between bullets and shotgun pellets. Bullet time is a serious advantage, but you're limited to using it in small increments and thus can't afford to use it unless you need it. Not only does this make the game seem very well balanced--especially since taking out bad guys is how you replenish your bullet time--but it also keeps the effect from feeling overused. Max will brandish a good variety of highly authentic real-world weapons throughout the game, including pistols, submachine guns, shotguns, sniper rifles, grenades, Molotov cocktails, and more. He can carry as many weapons as he can get his hands on, though you'll have to keep track of your ammunition reserves. There will always be plenty of bad guys around to soak up all your lead, so you'll have to use your different weapons as strategically and as conservatively as possible. Besides, Max is rather vulnerable--a bullet in the head, let alone a grenade, can kill him. But he can unflinchingly withstand relatively minor wounds. You can then completely recover the damage he's sustained by using painkillers, which you'll find scattered about in desks and bathrooms and such.These sorts of design decisions--the fact that you can carry an entire arsenal and keep on shootdodging even if you've been shot, as well as the fact that painkillers cure lead poisoning--stand in sharp contrast with the game's otherwise realistic appearance. But these aspects of the game are what help make it enjoyable. Max Payne isn't about fumbling for clips and putting tourniquets on wounds; it's about finesse, style, and fast pacing. It's too bad that the loading times in the PS2 version of Max Payne really hurt this pacing. Whenever you die--and you will--the game automatically reloads the level segment you were on from the beginning. These loading times are pretty bad, and they're exacerbated whenever the level begins with an in-engine cutscene. Inexplicably, you can't just skip these, but must sit through them every time before you can start playing again. Unlike in the PC or the Xbox versions, you can't save anywhere in the PS2 version of the game. In the later stages, which get pretty difficult, having to constantly restart the level can get very frustrating. It's a shame, since these design problems aren't inherent to Max Payne. The game's story is surprisingly involved. It unfolds partly through noninteractive sequences in the actual game engine, but mostly in still images that are meant to look like pages from a graphic novel. These comic-book-style cutscenes--which you can tell use stylized photographs to depict the various characters in the game--detail an over-the-top crime story that's as confounding as it is engaging. Unfortunately, these cutscenes also lose a lot of their original charm in the PS2 version of Max Payne. Not only do big, ugly block letters replace the subtle comic-book-style lettering of the original cutscenes, but whereas the original cutscenes would often show you several images in timed sequences, here every image is dumped onto the screen all at once. All the dialogue from the cutscenes is spoken, but you'll have to read the punch line in the last panel long before the dialogue gets there. Even if you haven't seen the original version of Max Payne, you can simply tell that these cutscenes are less than what they should have been. Max speaks quite a bit during the game itself. You might initially be taken aback by the rather forced performances of all the actors, but in time, you'll find that the style is well suited to the theme of the game and that Max's deadpan yet melodramatic delivery is particularly affecting. The graphic novel imagery, the hammy voice acting, and the heavy-handed dialogue actually all fit well together, and the story sequences are interspersed frequently and consistently enough throughout the game that the story always remains prominent. It's too bad, then, that the loading times before and after cutscenes are long enough to be noticeable and that the cutscenes themselves could have looked better. For years leading up to its release, Max Payne looked great in what few screenshots Remedy released of the work in progress. The PC version's visual quality--on a suitably good PC--managed to completely live up to the very high expectations produced by the early press. No game to date had featured such sharp, starkly realistic graphical detail. But the fact is that Max Payne for the PS2 lacks the original game's picture clarity, high resolution, color depth, lighting effects, and smooth frame rate. The frame rate is pretty slow in general but gets way slower when several enemies are onscreen--this can make aiming unnecessarily difficult during those times when you need to be the most precise. Even considering all that, Max Payne manages to be a good-looking game. You'll quickly learn to distinguish one gun's muzzle flash from another's, and the effect of errant gunfire hitting glass and various other environmental objects is convincing. Grenade explosions produce spectacular results, as they send nearby bodies careening head over heels through the air. Exclusively in the PS2 version of Max Payne, there's also an optional motion-blur effect, which makes the whole game look like a cutscene from Metal Gear Solid. It's a decent effect and probably helps disguise some of the frame rate issues. The animation in Max Payne is excellent for the most part, especially for Max, who is very lifelike in everything he does and looks exactly like the great heroes of Hong Kong action cinema as he shootdodges.These sorts of design decisions--the fact that you can carry an entire arsenal and keep on shootdodging even if you've been shot, as well as the fact that painkillers cure lead poisoning--stand in sharp contrast with the game's otherwise realistic appearance. But these aspects of the game are what help make it enjoyable. Max Payne isn't about fumbling for clips and putting tourniquets on wounds; it's about finesse, style, and fast pacing. It's too bad that the loading times in the PS2 version of Max Payne really hurt this pacing. Whenever you die--and you will--the game automatically reloads the level segment you were on from the beginning. These loading times are pretty bad, and they're exacerbated whenever the level begins with an in-engine cutscene. Inexplicably, you can't just skip these, but must sit through them every time before you can start playing again. Unlike in the PC or the Xbox versions, you can't save anywhere in the PS2 version of the game. In the later stages, which get pretty difficult, having to constantly restart the level can get very frustrating. It's a shame, since these design problems aren't inherent to Max Payne. The game's story is surprisingly involved. It unfolds partly through noninteractive sequences in the actual game engine, but mostly in still images that are meant to look like pages from a graphic novel. These comic-book-style cutscenes--which you can tell use stylized photographs to depict the various characters in the game--detail an over-the-top crime story that's as confounding as it is engaging. Unfortunately, these cutscenes also lose a lot of their original charm in the PS2 version of Max Payne. Not only do big, ugly block letters replace the subtle comic-book-style lettering of the original cutscenes, but whereas the original cutscenes would often show you several images in timed sequences, here every image is dumped onto the screen all at once. All the dialogue from the cutscenes is spoken, but you'll have to read the punch line in the last panel long before the dialogue gets there. Even if you haven't seen the original version of Max Payne, you can simply tell that these cutscenes are less than what they should have been. Max speaks quite a bit during the game itself. You might initially be taken aback by the rather forced performances of all the actors, but in time, you'll find that the style is well suited to the theme of the game and that Max's deadpan yet melodramatic delivery is particularly affecting. The graphic novel imagery, the hammy voice acting, and the heavy-handed dialogue actually all fit well together, and the story sequences are interspersed frequently and consistently enough throughout the game that the story always remains prominent. It's too bad, then, that the loading times before and after cutscenes are long enough to be noticeable and that the cutscenes themselves could have looked better. For years leading up to its release, Max Payne looked great in what few screenshots Remedy released of the work in progress. The PC version's visual quality--on a suitably good PC--managed to completely live up to the very high expectations produced by the early press. No game to date had featured such sharp, starkly realistic graphical detail. But the fact is that Max Payne for the PS2 lacks the original game's picture clarity, high resolution, color depth, lighting effects, and smooth frame rate. The frame rate is pretty slow in general but gets way slower when several enemies are onscreen--this can make aiming unnecessarily difficult during those times when you need to be the most precise. Even considering all that, Max Payne manages to be a good-looking game. You'll quickly learn to distinguish one gun's muzzle flash from another's, and the effect of errant gunfire hitting glass and various other environmental objects is convincing. Grenade explosions produce spectacular results, as they send nearby bodies careening head over heels through the air. Exclusively in the PS2 version of Max Payne, there's also an optional motion-blur effect, which makes the whole game look like a cutscene from Metal Gear Solid. It's a decent effect and probably helps disguise some of the frame rate issues. The animation in Max Payne is excellent for the most part, especially for Max, who is very lifelike in everything he does and looks exactly like the great heroes of Hong Kong action cinema as he shootdodges.Unlike the graphics, the audio of Max Payne survived the trip from the PC well intact. The game's use of sound is excellent--though enemy goons have a fairly limited variety of death knells, the game's weapon effects, environmental sounds, and its intermittent use of music are all extremely well done. Most of Max Payne necessarily revolves around shooting, though there are a few sequences that break up the action. A few of these require some carefully timed jumps and something like tightrope walking, and these sorts of precision maneuvers can be frustrating due to the imprecise nature of the analog control--and all the more so because of the game's loading times. Beyond that, there isn't any significant variety in the types of foes you'll face--whether you're shooting gang members, hired guns, or crooked cops, you'll need to employ the same sorts of tactics to succeed. Fortunately, all the bad guys in Max Payne do a great job. You can sometimes sneak up on them before they notice you. In battle, they'll take cover when possible, they'll toss grenades to flush you out, or they'll flank you. They're consistently challenging and fun to fight, and you'll find that their intelligent behavior will always keep you on your toes. A lot happens in Max Payne, but it isn't particularly long--it should take you about 10 to 15 hours to finish. The game has no multiplayer mode, but finishing it the first time does unlock additional new modes of play, including one that's simply more difficult because it makes you more vulnerable and your enemies tougher. Finishing this mode unlocks an even more difficult option. The other extra mode, called New York Minute, makes you race against the clock on every level. You have just one minute to finish each of the game's stages, and killing foes adds a few precious seconds to make this possible. The core game always remains fundamentally the same despite these offshoot gameplay options. Fortunately, the basic gameplay in Max Payne is enjoyable enough to justify spending some time with the extra modes. Still, many players will undoubtedly wish that the core game were even longer. The PS2 version of Max Payne lives in the shadow of its original namesake. If you've never seen and don't care to see Max Payne running on a good PC or on an Xbox, then maybe you think that drawing comparisons between the versions is irrelevant. You just want to know whether Max Payne is a good shooter for the PS2. Well, it is. So if you can't play this intense, original action game on any platform except the PS2, then that's where you should play it--but only by default.Unlike the graphics, the audio of Max Payne survived the trip from the PC well intact. The game's use of sound is excellent--though enemy goons have a fairly limited variety of death knells, the game's weapon effects, environmental sounds, and its intermittent use of music are all extremely well done. Most of Max Payne necessarily revolves around shooting, though there are a few sequences that break up the action. A few of these require some carefully timed jumps and something like tightrope walking, and these sorts of precision maneuvers can be frustrating due to the imprecise nature of the analog control--and all the more so because of the game's loading times. Beyond that, there isn't any significant variety in the types of foes you'll face--whether you're shooting gang members, hired guns, or crooked cops, you'll need to employ the same sorts of tactics to succeed. Fortunately, all the bad guys in Max Payne do a great job. You can sometimes sneak up on them before they notice you. In battle, they'll take cover when possible, they'll toss grenades to flush you out, or they'll flank you. They're consistently challenging and fun to fight, and you'll find that their intelligent behavior will always keep you on your toes. A lot happens in Max Payne, but it isn't particularly long--it should take you about 10 to 15 hours to finish. The game has no multiplayer mode, but finishing it the first time does unlock additional new modes of play, including one that's simply more difficult because it makes you more vulnerable and your enemies tougher. Finishing this mode unlocks an even more difficult option. The other extra mode, called New York Minute, makes you race against the clock on every level. You have just one minute to finish each of the game's stages, and killing foes adds a few precious seconds to make this possible. The core game always remains fundamentally the same despite these offshoot gameplay options. Fortunately, the basic gameplay in Max Payne is enjoyable enough to justify spending some time with the extra modes. Still, many players will undoubtedly wish that the core game were even longer. The PS2 version of Max Payne lives in the shadow of its original namesake. If you've never seen and don't care to see Max Payne running on a good PC or on an Xbox, then maybe you think that drawing comparisons between the versions is irrelevant. You just want to know whether Max Payne is a good shooter for the PS2. Well, it is. So if you can't play this intense, original action game on any platform except the PS2, then that's where you should play it--but only by default."}