{"ref": "https://www.gamespot.com/reviews/quake-iii-arena-review/1900-2532553/", "date": "December 16, 1999", "game_name": "Quake III Arena", "text": "When most people think of first-person shooters, id Software immediately springs to mind. The small Texas-based company has been involved in almost all of the first-person shooters that are considered classics. Quake spawned a rabid fan base on the Internet that still watches id's every move. So when id revealed that the next game in the series, Quake III Arena, would be specifically designed as a multiplayer game, fans weren't quite sure what to think. But id's purpose became increasingly clear when it released a succession of Quake III Arena technology demos for public scrutiny. The resulting game is not only worthy of its lineage, but it may very well be the best Quake yet.While Quake III Arena's focus may be its multiplayer deathmatch component, it does have a single-player mode. When playing alone, you can go up against artificial intelligence-controlled bots. The bots do their best to act like human players, and on the higher difficulty settings, they put up an excellent fight. Each bot has different characteristics that govern the way it fights. The portly biker chick Lucy tends to duck a lot. Xaero, a Zen master and the final boss of the single-player mode, is also master of the railgun. The single-player mode is a lot like the kind in an arcade-fighting game, such as Mortal Kombat. You'll move through several different competitive tiers, each with different arenas and bots. At the end of each tier is a one-on-one showdown; these fights take place in smaller, tournament-style arenas. The bots are downright chatty - when you get a group of them together, they'll hold small conversations with each other, which are displayed in text onscreen. In team games, you can order bots around, or even let a bot take control of your team and tell you what to do.The single-player mode is fun up to a point, but the multiplayer mode is where the real action is. Quake III Arena moves very quickly, and it has a real pick-up-and-play design to it. The game feels slightly simplified as compared to other recent shooters, but for the most part its simplicity is a good thing. The game has been stripped down to its first-person shooter essence, and any extraneous weapons or power-ups that might have gotten in the way of great deathmatch gameplay have been omitted. However, a few things stick out as having been overly simplified. For instance, as in most shooters, there is an auto-switch weapons option that lets you automatically switch to the new weapon when you pick it up. It's a convenient feature because it lets you rearm yourself with a stronger weapon almost immediately instead of having to press a key or spin the mouse wheel to select it. But when you're in the middle of a close-quarters shotgun fight, you really don't want to accidentally switch to the rocket launcher or railgun if you happen to walk over one. In that case, you can disable the auto-switch feature. Similarly, if you're running away from someone who's firing BFG blasts at you, the time it takes to manually select your new rocket launcher could be the difference between life and death. A weapon-priority scale that lets you decide specifically which weapons you'd like to switch to automatically, as in Unreal Tournament or QuakeWorld, would have easily solved the problem.The level design and texture design throughout Quake III Arena are quite good, even if the levels feel a little generic. None of the levels ever feel like real-world places; they are one futuristic castle setting after another, occasionally broken up by a level composed of a bunch of floating platforms in the middle of a black void. That said, the textures, especially the animated ones, are really amazing, and the game engine allows for curved surfaces, which deliver a more plausible feel to the architecture. The levels have obviously been designed with gameplay in mind - most of them are great fun to play in. However, the game seems to focus on levels that are great for only six to ten players. With more than ten players, most of the maps seem really crowded. Aside from standard deathmatch, you can also play team deathmatch, a one-on-one tournament mode that acts like a scaled-down version of the popular rocket-arena mod that appeared in Quake and Quake II, and capture the flag. Unfortunately, capture the flag seems almost like an afterthought. There are only four CTF levels included in the game, and all of them seem suited to smaller teams.Like the great-looking textures, the game's 3D models and special effects are very impressive. The character models and skins look terrific, and the animation really brings a lot of personality to the different characters. The various models are highly varied, and range from giant hopping-eye creatures to skeletons. Models based on the characters from Doom, Quake, and Quake II are also available. Curved surfaces help improve the quality of the level design, but other effects like fog and great colored lighting add even more atmosphere to some of the game's levels. The weapon models also look good for the most part, and they're easily identifiable in your enemies' hands. Unfortunately, the sound in Quake III Arena is inconsistent. All of the weapon fire is outstanding. The sound of rockets whizzing by your head as you dodge from side to side is especially impressive. The different character voices (each model has its own set of sounds) are pretty good, though you may become annoyed with Orbb the eyeball's screeching noises - all the more reason to kill him quickly. But the real problem with the audio is the announcer, who says things like ~five minutes remaining~ or ~impressive~ when applicable. Id obviously tried to duplicate the sound and style of the announcer's menacing voice from the Mortal Kombat games. But instead of hiring an appropriate voice actor, id simply took a typical voice (specifically that of level designer Christian Antkow) and pitched it down a few octaves to make it sound sinister. Instead, it just comes off as amateurish. Given the frequency with which the announcer speaks during the game, you'd think that the voice would have received a bit more attention.Regardless of how it sounds, after playing Quake III Arena, it's easy to see that moving toward a multiplayer-centered game was an excellent idea. With cable modems and DSL connections slowly gaining mainstream acceptance, the bandwidth is there for a lot of people to finally enjoy a good deathmatch game at a high speed. Fortunately, provided you find a good server, the game also manages to be playable over a 56K modem connection.All things considered, it isn't a stretch to call Quake III Arena an outstanding game. But whether it's superior to its rival Unreal Tournament is less certain. If you're interested in sophisticated team-play modes like those featured in Unreal Tournament, then Quake III Arena comes up short. However, Quake III Arena provides the ultimate deathmatch experience. If deathmatch is the particular style of play you're interested in, then Arena is your game."}