{"ref": "https://www.gamespot.com/reviews/quake-iii-arena-review/1900-2644317/", "date": "May 17, 2006", "game_name": "Quake III Arena", "text": "When it comes to first-person shooters, no company has been as prolific as the company that popularized the genre, id Software. From Wolfenstein 3D, up through the Doom series, and on through the Quake series, id is widely recognized as the center of the FPS universe. As is usually the case with PC to console first-person shooter ports, id's games weren't represented too well on the consoles. The console gamepad is largely to blame, as it simply doesn't offer the level of control that you get with the standard PC mouse and keyboard combo. So, if you're Sega, and you want to ensure that people will be happy with your upcoming version of Quake III Arena, what do you do? Yes, that's right, Sega already had a keyboard available, and with the release of Quake III, you can now pick up a mouse for your Dreamcast, giving you a significant advantage over gamepad-tethered players. Add to that the DC's innate online abilities, and you're left with a first-person shooter that finally stands up to its PC-based big brother. While Quake III Arena's focus may be its multiplayer deathmatch component, it does have a single-player mode. When playing alone, you can go up against AI-controlled bots. The bots do their best to act like human players, and on the higher difficulty settings, they put up an excellent fight. Each bot has different characteristics that govern the way it fights. The portly biker chick Lucy tends to duck a lot. Xaero, a Zen master and the final boss of the single-player mode, is a master of the railgun. The single-player mode is a lot like the kind in an arcade fighting game, such as Mortal Kombat. You'll move through several different competitive tiers, each with different arenas and bots. At the end of each tier is a one-on-one showdown, and these fights take place in smaller tournament-style arenas. The Dreamcast release features most of the maps from the PC release, as well as some maps that are exclusive to the Dreamcast. The DC maps are easily as good as most of the original maps, and they work well with the game's four-player limit. The single-player mode is fun up to a point, but Quake III Arena truly shines in the multiplayer department. The game is simple enough to give it a real ~pick up and play~ feel. You can play with up to four players in the split-screen mode, but doing so limits you to using the standard DC pad for control, since the mouse and keyboard each take up one controller slot. The multiplayer mode lets you set up a match in any of the game's modes, be it deathmatch, team deathmatch, capture the flag, or tournament. But playing the game in the split-screen mode isn't quite as rewarding as playing it online is. The online component of Quake III Arena is its most important section. Once you get online, via SegaNet or most other dial-up ISPs, you're taken to a list of around 500 servers. Each server can hold up to four players, and different servers run the game's different modes. As with anything that involves the Internet, Quake III's online play isn't perfect - if you don't have a crystal clean connection to the server, the game can range anywhere between occasionally stuttering all the way down to completely unacceptable. Suffice it to say, if you don't have a problem playing NFL 2K1 online, you probably won't have any serious trouble with Quake III Arena. Somewhere down the line, Sega and id will release an add-on for the PC version of Quake III that contains the DC versions of the original maps and will allow PC players to connect to hybrid PC/DC servers. PC players won't, however, get any of the DC exclusive maps, and there will be plenty of DC-only servers, so 56K modem players won't be forced to face someone sitting on a T3 line. The game also supports Sega's upcoming broadband adapter, allowing you to use a cable modem or DSL line to play, but this device was unavailable as of this writing. While you're sacrificing the ability to download and play major mods (Urban Terror, Painkeep Arena, and Rocket Arena, just to name a few) with the Dreamcast release, the game has the ability to play server-side mods, so Sega could adapt some of its servers with Instagib, Excessive, or the like.The textures in the Dreamcast version look pretty amazing. In some cases, they look even better than the textures in the PC version. Like the great looking textures, the game's 3D models and special effects are very impressive. The character models and skins look terrific, and the animation really brings a lot of personality to the different characters. The various models are highly varied, and they range from giant hopping-eye creatures to skeletons. Models based on the characters from Doom, Quake, and Quake II are also available. Curved surfaces help improve the quality of the level design, but other effects like fog and great colored lighting add even more atmosphere to some of the game's levels. The weapon models also look good for the most part, and they're easily identifiable in your enemies' hands. Unfortunately, the sound in Quake III Arena is inconsistent. All of the weapon fire is outstanding. The sound of rockets whizzing by your head as you dodge from side to side is especially impressive. The different character voices (each model has its own set of sounds) are pretty good, though you may become annoyed with Orbb the eyeball's screeching noises - all the more reason to kill him quickly. And the music in each level is really, really great. But the real problem with the audio is the announcer, who says things like ~five minutes remaining~ or ~impressive~ when applicable. id obviously tried to duplicate the sound and style of the announcer's menacing voice from the Mortal Kombat games. But instead of hiring an appropriate voice actor, id simply took a typical voice (specifically that of id level designer Christian Antkow) and pitched it down a few octaves to make it sound sinister. Instead, it just comes off as amateurish. Given the frequency with which the announcer speaks during the game, you'd think that the voice would have received a bit more attention. Quake III Arena for the Dreamcast, along with Unreal Tournament for the PlayStation 2, marks one of the few times that a PC first-person shooter has moved over to a console system without sacrificing much of its playability or options - something that hasn't really happened since Wolfenstein 3D came out on the Atari Jaguar. All things considered, Quake III Arena is a must-have for Dreamcast owners - provided that they also purchase a mouse and keyboard.The textures in the Dreamcast version look pretty amazing. In some cases, they look even better than the textures in the PC version. Like the great looking textures, the game's 3D models and special effects are very impressive. The character models and skins look terrific, and the animation really brings a lot of personality to the different characters. The various models are highly varied, and they range from giant hopping-eye creatures to skeletons. Models based on the characters from Doom, Quake, and Quake II are also available. Curved surfaces help improve the quality of the level design, but other effects like fog and great colored lighting add even more atmosphere to some of the game's levels. The weapon models also look good for the most part, and they're easily identifiable in your enemies' hands. Unfortunately, the sound in Quake III Arena is inconsistent. All of the weapon fire is outstanding. The sound of rockets whizzing by your head as you dodge from side to side is especially impressive. The different character voices (each model has its own set of sounds) are pretty good, though you may become annoyed with Orbb the eyeball's screeching noises - all the more reason to kill him quickly. And the music in each level is really, really great. But the real problem with the audio is the announcer, who says things like ~five minutes remaining~ or ~impressive~ when applicable. id obviously tried to duplicate the sound and style of the announcer's menacing voice from the Mortal Kombat games. But instead of hiring an appropriate voice actor, id simply took a typical voice (specifically that of id level designer Christian Antkow) and pitched it down a few octaves to make it sound sinister. Instead, it just comes off as amateurish. Given the frequency with which the announcer speaks during the game, you'd think that the voice would have received a bit more attention. Quake III Arena for the Dreamcast, along with Unreal Tournament for the PlayStation 2, marks one of the few times that a PC first-person shooter has moved over to a console system without sacrificing much of its playability or options - something that hasn't really happened since Wolfenstein 3D came out on the Atari Jaguar. All things considered, Quake III Arena is a must-have for Dreamcast owners - provided that they also purchase a mouse and keyboard."}