{"ref": "https://www.gamespot.com/reviews/command-and-conquer-3-kanes-wrath-review/1900-6188528/", "date": "March 28, 2008", "game_name": "Command & Conquer 3: Tiberium Wars", "text": "Last year's Command & Conquer 3: Tiberium Wars featured a horde of freaky alien units, hammy acting, and lots and lots of explosions. With Kane's Wrath, Electronic Arts provides freakier aliens, hammier acting, and bigger explosions, and mixes them into an expansion pack that doesn't improve the core game in any meaningful way. Of course, it gives us more ways to experience the terrific gameplay, and for that we can be grateful. Nevertheless, Kane's Wrath misses the mark in many ways and comes across as a wasted opportunity. Mechapedes = awesome. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Command & Conquer 3: Kane's Wrath Video Review 1 The story, such as it is, fills a number of gaps in Command & Conquer history, jumping around like a jackrabbit on speed. For example, the first act takes place between the second and third Tiberium Wars, whereas the second act jumps to events that took place during C&C3. As a result, when Kane and other characters address you during the live-action cutscenes, you're not even the same character each time. Joe Kucan as Kane, God bless him, almost saves this scattershot structure with his usual superb mix of spittled monologues and ominous glares. As Alexa, though, actress Natasha Henstridge misses the whole point by misunderstanding the difference between histrionics and plain bad acting. Her bouncy hairdo is more energetic than she is. We expect cheese in a Command & Conquer campaign, but its taste is altogether overpowering here. With the third act, Kane's Wrath starts hitting the right notes and then comes to a halt, leaving the promise of yet another expansion...the same promise Tiberium Wars left with us. Let's hope that the inevitable second expansion pack makes good on it. Once you take command of the battlefield, things pick up, but not in the ways you might expect from an expansion pack. You play as the Nod faction through the whole of the 13-mission campaign, which is fine, but it fails to capitalize on the pitifully brief Scrin campaign of Tiberium Wars. Nevertheless, this is at heart the same gameplay that made last year's game such a success. It's fast-paced, fun, and eminently playable. When the game emphasizes these strengths, such as in a mission where you have to capture a GDI researcher, the gameplay soars. Other missions just speak to overlooked possibilities. For instance, in one scenario, you're teased with the possibility of experiencing one of Tiberium Wars' best missions from the perspective of a different commander. But rather than delivering on the promise of a heart-pounding battle, the game whips the rug out from under you, and you get stuck using a commando and saboteur--and then a dinky attack bike. Talk about an anticlimax. Thankfully, all of the issues that the campaign presents are mostly offset by the variety of new toys available. Many of them come courtesy of the subfactions in Kane's Wrath. You can still play skirmishes against other players and the AI as the standard GDI, Nod, and Scrin factions, and they've seen some minor changes. However, you should check out the subfactions if you want access to the best goodies. For the most part, the subfactions aren't radically different from their vanilla counterparts, but they bring some subtle and interesting additions and changes to the battlefield nonetheless. For example, the Nod subfaction called the Black Hand replaces the avatar warmech with a flame-spewing monstrosity called the purifier. The Black Hand has no flying units, though, so this isn't the faction for you if you like to spam venoms. Other tweaks have very little impact, such as the addition of shields to harvesters of the Reaper-17 Scrin subfaction, though such small changes undoubtedly have effects on the overall balance. Some of the new units are available to the main faction and subfactions alike. For example, all GDI players get the hammerhead helicopter, which is invaluable for troop transport and can stay aloft for a while without having to refuel. The Scrin mechapede is a particular (and slightly overpowered) favorite, given that you can extend its length by adding pods to it, and there are four different types of pods you can use. This flexibility makes the mechapede one of the most versatile units in the game, but in the spirit of the Scrin, it requires a healthy amount of micromanagement. The most superficially dramatic units are the new epic units. Each faction and its subfactions get access to a new powerful unit: the MARV tank in the case of the GDI, the redeemer for the Nod, and the eradicator hexapod for the Scrin. How important they are to your strategy depends on how long your matches draw out, which is always a crapshoot in the rush-heavy Command & Conquer. However, should you get to the point where you can create one, you'll enjoy the additional help it provides on the battlefield. They have powerful attacks (even more powerful if infantry is garrisoned inside), but their other abilities can be helpful as well. For example, if you need extra credits, just drive your MARV over some Tiberium, and it will be added to your coffers instantly. Natasha = not so awesome. And in a sign that Electronic Arts kept throwing different things at Command & Conquer 3 to see what would stick, they've introduced Global Conquest, which is a Risk-inspired turn-based mode similar to the ones in Rise of Nations or Dawn of War. In it, you create strike forces that let you expand across the globe to crush your enemies while exerting influence on cities. It's an interesting diversion, but it's esoteric without having the depth to match. Not only is the gameplay diluted compared to other turn-based games, but the world map isn't separated into distinct areas, which diminishes the thrill of expansion. It feels as if you're trying to take over vast tracts of empty land, and without the geographic and visual divisions you'd expect, you never get that ~just...one...more...turn...~ compulsion. There are more than 25 new maps to skirmish on, too, against either other players or the AI. All these additions--new units, a new mode, and so on--add more ways to play, but they don't add up to an essential expansion pack. It all makes for a broader package, but not necessarily a better one. Sure, the new subfactions give you more variety, but not every addition is significant, and in some cases, they're underwhelming (Steel Talon subfaction, this means you). Throw in a competent campaign, and you have a good expansion that should have been much, much better."}