{"ref": "https://www.gamespot.com/reviews/neocron-review/1900-2901825/", "date": "December 16, 2002", "game_name": "Neocron", "text": "Background story sets Neocron apart from other massively multiplayer games. In Neocron, German developer Reakktor has created a highly detailed world with a setting as complex as that of a hard-core science-fiction novel. Anyone who enjoys good storytelling will appreciate the quality of the game's writing, which is so impressive in spots that it even manages to rejuvenate the hackneyed postapocalyptic sci-fi setting featured in Neocron and countless other games before it. Unfortunately, the game's design doesn't keep pace with its interesting background story. Reakktor may have created a captivating world, but it hasn't fleshed out players' roles in it. While the promise of political intrigue among colorful factions in a futuristic setting will draw you into the game, Neocron's inability to make a significant impact with any of these things will push you away. Neocron is set in the middle of the 28th century, approximately 600 years after a nuclear war between the Federation of the Free World and the Chinese Empire turned Earth into a wasteland. This premise is really nothing new, but Reakktor has done a great job of freshening up what seems like a tired concept. Neocron's story, which is related in the game's manual, is very well written and makes use of all the traditional postapocalyptic story elements: much of the world is dirty and run-down, mutant animals and insects can be found everywhere, and civilization is confined to closed cities like Neocron. Neocron's character creation system is almost as complicated as the game's plot. Reakktor and publisher CDV are billing Neocron as an RPG-shooter hybrid with the depth of the former and the ease of use of the latter, but that isn't really the case. There are a lot of details to keep track of in Neocron. Although the game has just four character classes--private eye, spy, psi-monk, and gentank--your choices are complicated, since each class has multiple job options and must also affiliate itself with one of a dozen or so political factions. So even though it takes just a few minutes to decide whether you want to be a fighterlike gentank, wizardlike psi-monk, thieflike spy, or jack-of-all-trades private eye, it takes a lot longer to pick a job, sort through nearly 40 skills, and read over the detailed histories of the factions. The number of different factions actually makes for an intricate web of alliances and rivalries. Neocron features a ~sympathy point~ system that governs how you can offer your services to different factions. You can work for your own faction and its closest allies at first, and later branch out to working for allies of allies when sympathy points accumulate. Unfortunately, understanding how all the groups relate to one another will require a lot of reading, both in the game and in the manual. You can of course skim over all this stuff and get started in a hurry, but you'll inevitably end up restarting after learning a few things the hard way. Your base of operations is your apartment. There you can access lockers, restore your health, get resurrected with the genetic replicator, use the mobile goguardian storage system, or log on to the citycom computer terminal to accept missions, check e-mail, and so forth. All major game functions are performed in this one place, and the citycom lets you keep in touch with the Neocron community, so the system works very well. You'll even get a different apartment depending on your class and faction--if you join the Tsunami Syndicate, for example, you'll get a place in the seedy Pepper Park district, complete with neon signs outside your windows. No matter where you start, it's fairly easy to find your way around town. Although there are five big city districts, you can call up the nav-ray system at any time to provide yourself with a dotted line leading right to your destination. Also, a subway provides rapid transit to and from all the districts, and antigravity tubes transport you between the city's many levels. After you've dedicated all this effort to figuring out the lay of the land, it's hard not to be disappointed when you start actually playing the game. No matter which character class, job, or faction you choose, you begin with only a few options--and the most obvious of these is performing missions, brief quests that resemble the missions of Anarchy Online. Unfortunately, there really aren't many interesting missions. At this point, the only ones available are ~runners,~ though they might as well be called ~dull errands.~ Most of them are combat-intensive expeditions in which you kill irradiated vermin of one sort or another for a reward of cash and experience. It's about as interesting as it sounds. Fighting a battle in Neocron is like playing a first-person shooter, meaning that you select a weapon, point, and shoot at your enemies. The most challenging part of these adventures is staying awake, as most enemies do nothing but sit there and alternately absorb damage and dish it out. Many missions have been made artificially time-consuming with long respawn times--for instance, you may need to kill five spiders, but you'll find only a few at first, and after you kill them, you'll have to wait for at least 10 minutes for more to appear. Otherwise, Neocron's other missions involve delivering packages from one faction headquarters to another, taking up recycling, or working on research blueprints. These missions are even more boring than the bug hunts, although they do help you learn the layout of the city.Neocron's missions also don't emphasize the differences between the game's character classes. A private eye gets the same job offers as a gentank, and a psi-monk seems to get the same job offers as a spy. This lack of diversity understandably hurts character development. And because so many missions involve combat, it's much easier to play as and advance characters who are skilled in fighting. Taking a spy or a psi-monk into the sewers to go on a bug hunt for credits and experience can be frustrating, because they lack the physical skills necessary for effective melee combat. These characters may become very powerful once they gain many experience levels, but most players probably won't have the patience to advance that far. Using the nav-ray is as easy as following a dotted line. In addition, although Neocron has an interesting background story, the game itself is pretty illogical. Factions assign generic tasks regardless of their own agendas or areas of expertise. For instance, Diamond Real Estate asks you to kill bats, while the City Mercs need help with construction jobs--it doesn't really make sense, and none of the factions make any distinctions when assigning missions to different character classes. Combat-heavy tasks are perfect for the dull-witted gentanks, who are bred solely for fighting, but there's nothing specifically for psi-monks, private eyes, and spies. You'd at least hope that these missions would consist of low-level busywork that you could complete and then move on to the really interesting part of the game, but there doesn't seem to be a really interesting part of the game to move on to. Since these missions are the best way to earn cash, you'll find them particularly repetitive, especially if you hope to purchase one of Neocron's criminally expensive high-level items. Though the game has some intriguing items you can buy, including combat vehicles like tanks and hoverbikes, they're prohibitively expensive for casual players who can't afford to spend countless hours performing the same 400-credit mission over and over so they can buy a 35,000-credit laser pistol, to say nothing of the vehicles, which cost hundreds of thousands of credits. Though some high-level players do own and enjoy vehicles and other expensive amenities, it's difficult to imagine anyone other than hard-core fans earning enough credits to buy them. Player-killing isn't even a viable option, since a chip implanted in your character's head prevents you from killing other players or being killed by them. You can remove it, but you still can't effectively begin a life of crime because copbots watch many streets and open fire whenever a weapon is drawn. Also, if you kill too many other players, you'll become a wanted criminal subject to police assault and player killing whenever you log in. About the only interesting thing you can afford to do with other players, at least early on, is holomatch deathmatching (which is free)--and this is so similar to stereotypical deathmatch play that you could just as easily load up a traditional online shooter without even playing Neocron. But few traditional shooters offer the kind of atmosphere that Neocron does. For one thing, Neocron's different city districts are very distinct. The posh downtown Plaza and Via Rosso districts offer spectacular views of the outside world and secure streets constantly watched by copbots. On the other hand, Pepper Park is the red-light district, a confined and grimy area where sex is the biggest business (this district alone earns Neocron its ~M~ rating, though there is no explicit nudity) and lawlessness abounds. All bets are off in the outzone, a territory completely abandoned to criminals and anarchists. Neocron's character models are equally well-drawn and animated, although like many other online RPGs, it offers only a limited number of face, body, and clothing types, so you'll sometimes feel like you're surrounded by an army of clones. Neocron's audio also brings the world to life. Every monster in the game has a signature sound effect, and the game's musical score somehow mixes sci-fi majesty with depressing noir. Plus, the city's public announcement system keeps you up-to-date on current events and threats. Some of Neocron's content is decidedly risqu. Neocron is also remarkably stable. The game plays smoothly and is virtually lag-free, even on a 56k dialup connection. Crashes are rare. We experienced just a few bugs and never lost connection to any of the four game servers completely, an impressive feat for a massively multiplayer online game. Reakktor is also constantly adding content and fixing bugs by way of patch downloads. Nearly 20 patches have been released since the game hit stores, and though you may experience problems getting the patch program to actually patch the game, it's clear that Reakktor is dedicated to improving the game in the future. Like so many massively multiplayer games in the weeks after their launch dates, Neocron ultimately doesn't live up to its potential. The game's technology is impressive, its background story is interesting, its character-creation process is detailed, and its setting is an intriguing combination of traditional science fiction and noir. It's possible that Reakktor could improve the game considerably with new features and more-diverse missions, but for now, none of Neocron's interesting story elements or great atmosphere mean much when all you're able to do is stomp bugs and deliver packages.Neocron's missions also don't emphasize the differences between the game's character classes. A private eye gets the same job offers as a gentank, and a psi-monk seems to get the same job offers as a spy. This lack of diversity understandably hurts character development. And because so many missions involve combat, it's much easier to play as and advance characters who are skilled in fighting. Taking a spy or a psi-monk into the sewers to go on a bug hunt for credits and experience can be frustrating, because they lack the physical skills necessary for effective melee combat. These characters may become very powerful once they gain many experience levels, but most players probably won't have the patience to advance that far. In addition, although Neocron has an interesting background story, the game itself is pretty illogical. Factions assign generic tasks regardless of their own agendas or areas of expertise. For instance, Diamond Real Estate asks you to kill bats, while the City Mercs need help with construction jobs--it doesn't really make sense, and none of the factions make any distinctions when assigning missions to different character classes. Combat-heavy tasks are perfect for the dull-witted gentanks, who are bred solely for fighting, but there's nothing specifically for psi-monks, private eyes, and spies. You'd at least hope that these missions would consist of low-level busywork that you could complete and then move on to the really interesting part of the game, but there doesn't seem to be a really interesting part of the game to move on to. Since these missions are the best way to earn cash, you'll find them particularly repetitive, especially if you hope to purchase one of Neocron's criminally expensive high-level items. Though the game has some intriguing items you can buy, including combat vehicles like tanks and hoverbikes, they're prohibitively expensive for casual players who can't afford to spend countless hours performing the same 400-credit mission over and over so they can buy a 35,000-credit laser pistol, to say nothing of the vehicles, which cost hundreds of thousands of credits. Though some high-level players do own and enjoy vehicles and other expensive amenities, it's difficult to imagine anyone other than hard-core fans earning enough credits to buy them. Player-killing isn't even a viable option, since a chip implanted in your character's head prevents you from killing other players or being killed by them. You can remove it, but you still can't effectively begin a life of crime because copbots watch many streets and open fire whenever a weapon is drawn. Also, if you kill too many other players, you'll become a wanted criminal subject to police assault and player killing whenever you log in. About the only interesting thing you can afford to do with other players, at least early on, is holomatch deathmatching (which is free)--and this is so similar to stereotypical deathmatch play that you could just as easily load up a traditional online shooter without even playing Neocron. But few traditional shooters offer the kind of atmosphere that Neocron does. For one thing, Neocron's different city districts are very distinct. The posh downtown Plaza and Via Rosso districts offer spectacular views of the outside world and secure streets constantly watched by copbots. On the other hand, Pepper Park is the red-light district, a confined and grimy area where sex is the biggest business (this district alone earns Neocron its ~M~ rating, though there is no explicit nudity) and lawlessness abounds. All bets are off in the outzone, a territory completely abandoned to criminals and anarchists. Neocron's character models are equally well-drawn and animated, although like many other online RPGs, it offers only a limited number of face, body, and clothing types, so you'll sometimes feel like you're surrounded by an army of clones. Neocron's audio also brings the world to life. Every monster in the game has a signature sound effect, and the game's musical score somehow mixes sci-fi majesty with depressing noir. Plus, the city's public announcement system keeps you up-to-date on current events and threats. Neocron is also remarkably stable. The game plays smoothly and is virtually lag-free, even on a 56k dialup connection. Crashes are rare. We experienced just a few bugs and never lost connection to any of the four game servers completely, an impressive feat for a massively multiplayer online game. Reakktor is also constantly adding content and fixing bugs by way of patch downloads. Nearly 20 patches have been released since the game hit stores, and though you may experience problems getting the patch program to actually patch the game, it's clear that Reakktor is dedicated to improving the game in the future. Like so many massively multiplayer games in the weeks after their launch dates, Neocron ultimately doesn't live up to its potential. The game's technology is impressive, its background story is interesting, its character-creation process is detailed, and its setting is an intriguing combination of traditional science fiction and noir. It's possible that Reakktor could improve the game considerably with new features and more-diverse missions, but for now, none of Neocron's interesting story elements or great atmosphere mean much when all you're able to do is stomp bugs and deliver packages."}