{"ref": "https://www.gamespot.com/reviews/steelrising-review-like-clockwork/1900-6417953/", "date": "September 7, 2022", "game_name": "Steelrising", "text": "Dead humans and livestock litter the muddy cobblestone streets of Paris, their corpses left discarded in rotting piles or with muskets in hand where they took a final stand. Scattered fires burn bright across the city, each one sending suffocating black smoke billowing into the night sky. The only living residents are hunkered down in barricaded houses and shops, cowering from the clockwork automatons now prowling the ruins of the French capital. It's 1789, and in Steelrising's alternative history, the tyrannical King Louis XVI has suppressed the French Revolution by unleashing a mechanical army that massacres the populace, reinforcing his rule with literal iron fists.This unique dark fantasy setting helps Steelrising stand apart from its many contemporaries. 2022 has already seen a slew of Souls-likes, with games such as Tunic, Salt and Sacrifice, and Thymesia each offering a different perspective on the genre. The latest game from French developer Spiders--a studio known for creating action-RPGs such as Greedfall--is derivative in its design, featuring all of the familiar elements we've come to expect of the genre. But Steelrising impresses with the way it's able to combine so many disparate elements together and make them all work.You play as Aegis, a mechanical masterpiece and bodyguard to Queen Marie Antoinette. Unlike the mindless automatons roaming the streets, Aegis has a conscience and a form of free will, so you're sent into the heart of Paris to find your creator and fight fire with fire to put an end to the king's despotic bloodshed. From the outset, you choose from one of three classes that dictate your starting weapon and attributes, opting to be a powerful bodyguard, a quick and lethal dancer, or an alchemist who shoots enemies from afar. Aegis is malleable enough that it's fairly easy to switch playstyles after this initial choice, although it's difficult to experiment with different weapons, particularly once you're a few hours in, because upgrade resources are so pricey and base-level weapons aren't feasible later in the game. This is a shame, since it's the variety of weapons at your disposal that have the most significant impact on combat.Steelrising will feel familiar to anyone used to the Souls-like style of measured combat and thoughtful encounter design. Your offensive repertoire consists of both light and heavy attacks, including a charged attack that's slow but deals heavy damage. A responsive dodge lets you weave out of danger, but Steelrising doesn't have a dedicated block button; instead, each weapon has either an attacking or defensive special move. I spent most of the game using Aegis' steel fans, which, when combined together, form a shield that can block enemy attacks. Other weapons, such as dual swords, maces, and heavy wheels, utilize other special moves like counters and lengthy balletic attacks. Because your choice of weapon might not always give you the chance to defend yourself, combat in Steelrising promotes aggression above all else. The pace of each fight is still relatively slow, but Aegis is enjoyably mobile as you dodge and jump to avoid incoming blows before replying with your own attacks.Each of these actions is governed by a familiar stamina system, but a well-timed button press when your endurance is depleted will top it back up by instantly cooling your internal mechanisms. The only drawback to this is that if you use it too many times in quick succession, your cooling system will freeze you in place and leave you wide open to attack. Not only is this a tonally clever addition, but mastering the mechanic helps to keep you on the front foot. This is key, because Steelrising also features an auspicious staggering mechanic known as Immobilisation. By giving an enemy no reprieve, you'll fill up a diamond-shaped gauge until it reaches a breaking point, at which point your unfortunate foe will become immobilized and vulnerable to a high-damage critical strike. There's a rewarding rush of adrenaline that comes from wailing on an enemy and tacitly using your cooling system to maintain your offensive onslaught, only to then finish them off with a decisive flourish.Though each of these mechanics is geared toward an aggressive fighting style, Steelrising is still a traditional Souls-like, focusing on deliberate combat against tough enemies who can't be underestimated. Each enemy requires consideration to defeat, at least until you've learned their deadly-yet-exploitable attack patterns. There are dozens of enemy types, too, some of which have been cleverly designed to further inform you of the world prior to its current state. For every machine wielding conventional weaponry, there are others that clearly served a different purpose in everyday Parisian life, like the musical machines that reduce you to scrap with their trumpets and violins or former lampposts who now use their metal braziers to crush anything standing in their way. Your natural inclination might be to get behind each enemy, but some can twist their bodies 360 degrees to catch you off-guard, subverting a classic Souls-like strategy to keep you on your toes. Fighting multiple opponents at once is interesting as well, since different enemy types can inflict damage on one another. I would often try to position myself in such a way that they'd lend an unintentional helping hand by striking each other when trying to hit me.Enemy movements are notably jerky and sometimes stiff, with some overly exaggerated wind-ups for attacks, but this is all in keeping with the game's clockwork aesthetic. That said, Steelrising's combat doesn't always feel entirely fluid. Aegis' animations don't flow together as smoothly as one might hope, which takes some getting used to, and actions like swapping weapons aren't always the most responsive. It's something I eventually adapted to, however, to the point where it never felt detrimental.In fact, the telegraphed nature of enemy attacks and Aegis' mobility compared to the majority of enemy types meant I found Steelrising easier than most other Souls-likes. Mistakes are still punished accordingly, but it doesn't take long to accrue a massive amount of healing items that will keep your health topped up in between battles. If you are struggling, there is a handy Assist Mode that allows you to adjust different factors to tailor the game's difficulty to your liking. You can change how quickly stamina replenishes, or reduce the amount of damage enemies can inflict. You can also opt to keep your Anima Essense on death--which is the resource you use to purchase upgrades and is lost upon death if you don't recover it--to alleviate some of the challenge. The difficulty debate around video games, and Souls-likes in particular, is a dull one with a needlessly stubborn side, but Spiders joins a list of developers that are finding innovative ways to help more people enjoy the genre, which can only be a good thing.The only time its difficulty negatively impacts gameplay is during Steelrising's disappointing boss battles. The visual design of each boss is fantastic, whether you're facing off against a giant monstrosity with a guillotine for a body or a bishop armed with a massive Bible on a chain. Defeating them is surprisingly rote, though. It's easy enough to stand behind each one and dodge at the appropriate times with little resistance, and grenades make things even easier. It doesn't take much to purchase these varied throwables, and you'll gather plenty as you explore each area. Then it's just a case of standing back and peppering each boss with explosives until they're dead or close enough. This is a balancing issue more than anything, but even if you forgo the advantage these items and tactics bring, Steelrising's boss fights are still simplistic and bland.As you explore the various districts of a deserted Paris, you'll unlock gates and shortcuts that circle back on one another, and upgrade Aegis' attributes and weapons at Vestals that respawn any enemies you've already defeated. There's some backtracking involved as you return to previously explored areas, but the maps open up once you unlock various abilities like a grappling hook, air dash, and a powerful kick that can knock down unstable walls. This adds some verticality to the level design that sometimes forces you to think upward. Platforming is a tad finicky but never demands much from you. However, it's hard to escape the feeling that the maps are more like intricate mazes than lived-in neighborhoods now in the midst of political carnage. You'll find the odd note, but otherwise, any sense of environmental storytelling is absent.There's some refreshing variety to these environments, at least, with sandbanks running along the Rhine, extravagant gardens at the Louvre, and opulent mansions torn asunder. For the most part, though, you'll be exploring the tight confines of Paris' blood-soaked streets. With no in-game map to peruse, backtracking often devolves into a chore when you're trying to find a location you previously visited five hours earlier on one of many similar-looking streets. You do have access to a compass that provides waypoints for the main quest and any side quests you've undertaken, but this doesn't always point you in the right direction. There's also the fact that some side quests can only be accessed after you've reached a particular point in the story, yet the game neglects to inform you of this vital tidbit. I thought I had stumbled upon a glitch when trying to open a gate leading to a side quest, but the reason it wouldn't unlock was because opening it was part of a later story mission.These faults are frustrating, mainly because they waste time, but they don't completely deter from Steelrising's unexpected charm. You can be cynical about Spiders' brazen inspiration of other Souls-like games--yes, it's derivative, and it's all too easy to get hung up on the similarities--but once you look past resemblances and notice the differences, you'll see all of the ways in which Steelrising stands out. From the disparate parts that make up its satisfying combat, to the wonderful setting and worldbuilding that meshes dark fantasy with alternative French history, there's much to enjoy in what sets Steelrising apart from its peers. It's one of the better Souls-likes in a now-crowded genre."}