{"ref": "https://www.gamespot.com/reviews/world-championship-pool-2004-review/1900-6087506/", "date": "February 5, 2004", "game_name": "World Championship Pool 2004", "text": "Though the pool simulation genre has certainly had some great games over the years, the primary bulk of these titles have only been available for the PC. Sadly, most console-based attempts at the sport of pool have generally not fared as well as their PC counterparts, thus leaving console-owning pool fans out in the cold. Jaleco's World Championship Pool 2004 for the Xbox changes all of this. It isn't the flashiest or even the most well-put-together pool game released in recent years, but it's easily one of the most feature-rich games of pool ever put onto a console, and it features an excellent variety of pool games in addition to Xbox Live support. Furthermore, it plays quite intuitively by allowing anyone--from the greenest of amateurs to the most seasoned of pool veterans--to pick it up and play without having to experience any sort of steep learning curve. World Championship Pool 2004 features a wide variety of pool games and offers some very well-designed pool mechanics to back them up. World Championship Pool 2004's controls are quite easy to pick up, while still managing to be very realistically designed. You first begin by lining up your shot using either the left thumbstick or the directional pad. Depending on the difficulty level chosen, you will have the option of highlighting a path guide that shows where the ball you're aiming at will go and where the cue ball will go. After appropriately aiming your shot, you press the A button once to move to a power meter that determines how hard your shot will be. After that, another press of the A button brings you either to your shot animation, or in the case of a game that requires you to call your shot, you're brought to an overhead view that lets you select exactly which ball you're calling--as well as which pocket you plan to shoot it into. Additionally, during the setup of the shot, you can adjust the elevation of your pool cue by holding down the X button and moving the left stick up and down. You can also put a little English on the cue ball by holding down the B button and moving the left stick. Even if you don't immediately understand what doing things like putting English onto a ball or elevating your pool cue does for you, the game's manual explains things pretty well, and all it takes is a minimal amount of practice. Though its basic gameplay mechanics are more than sound, where WCP 2004 really shines is in its gameplay depth. At its core, the game features several variations of the game of pool, including 8 Ball, 9 Ball, and snooker, as well as the more traditional, standard game of pool. Each of these games can be played in either single game or tournament form--except for snooker, which can only be played in a single game form. You can designate the number of frames in each game for a single round--all the way up to a best of 17 match--and you can customize features like location, table type, ball set, and the rules of the game. WCP 2004 also features a lengthy career mode in which you create your own customized player and then take him or her through a series of professional tournaments in hopes of earning enough cash so that you can purchase items in the game's shop mode. Items available in the mode include new clothing articles for your player, as well as new ball sets, tables, and pool cues. You can also store the trophies you win in the career mode. The game's graphics aren't spectacular in any way, but they do feature some nicely detailed environments and player models Further adding to the depth of WCP 2004 are a couple of additional modes: trick shot and bonus game. The bonus game mode gives you a roster of seven games with unique rulesets. Some examples of these games include MineField, in which certain ~mined~ areas of a table cause balls to jump off the table if you hit them, and Unexploded Ball, which is played like a basic game of 9 Ball. However, if you don't get your shot off within a certain amount of time, the targeted ball explodes, and your turn ends. Most of these games are only simplistic variations on the basic pool games, but they're still quite amusing to play. As for the trick shot mode, here you are presented with a number of gimmicked trick shots that you must perform to unlock new shots. Think of it as the trick shot competitions you see on ESPN2--but without an opponent. Both of these modes are ultimately quite nice to have around and serve as enjoyable diversions from standard pool playing. The last of WCP 2004's featured modes is its Xbox Live support, which, while generally good, isn't nearly as fleshed-out as it could have been. Essentially, you can do the usual array of things with the interface, which includes creating or joining matches, managing your friends list, and using the Xbox headset for voice chat. However, there are only two play modes available online: 8 Ball and 9 Ball. You can't play any of the other game modes online--not even snooker. On the plus side, playing both 8 Ball and 9 Ball online worked just fine, and both were plenty of fun overall. It is rather disappointing that there aren't more play options available for WCP 2004's online functionality, so ultimately, it makes the mode less appealing. Where WCP 2004 starts to stumble is in its presentational values. Graphically, the game looks about as it should. The various in-game environments are pretty nicely detailed and look like some of the typical locales you'd encounter when watching a professional pool tournament. Each of the 70 featured professional players looks surprisingly good, with a nice assortment of body and facial details that make each look very true-to-life. Unfortunately, they don't animate quite as well as they look when they walk around. However, when taking a shot, players move extremely smoothly. As for the on-table action, it all looks pretty much like you would hope it would. The balls reflect light nicely, the physics are top-notch, and all told, it's pretty authentic-looking. If you like pool and you own an Xbox, World Championship Pool 2004 is what you're looking for. Where the game really falls off is in regard to its sound quality, which is just plain awful. For starters, the in-game commentary is atrocious. The two commentators sound nearly identical--to the point where you have to wonder if it isn't just the same guy doing marginally different voices. The actual commentary itself is so wooden and unpleasant that turning it off is an absolute must. Most of the in-game sound effects are barely audible in any mode that doesn't feature commentary--even with the volume turned the whole way up. The audio is so poor that you're basically playing a completely muted game in certain situations. There is no music in the game, except for the menu music. Thankfully, the game does support custom soundtracks, which somewhat salvages the whole audio experience. When you put the sum of World Championship Pool 2004's parts together, you'll find yourself with one of the better billiards outings released for consoles in quite a long time. Yes, there are things to complain about, such as the decidedly lackluster sound quality and the lack of online gameplay modes, but outside of these complaints, the game performs very well and provides you with enough variations on the game of pool to keep you entertained for quite a while. If you're a pool enthusiast with an Xbox, you shouldn't hesitate to give World Championship Pool 2004 a look."}