{"ref": "https://www.gamespot.com/reviews/micro-machines-v4-review/1900-6153254/", "date": "June 27, 2006", "game_name": "Micro Machines V4", "text": "Micro Machines aren't nearly as popular now as they once were, but the miniature collectible cars are still racing in Micro Machines V4, yet another top-down racing game from Codemasters. It's been 15 years since the original Micro Machines game appeared on the NES, and the formula hasn't changed a bit in all that time. Rather than focusing on bringing the series up to date, or even just polishing up the presentation, V4 simply adds more of the same--a lot more, in fact. This game has more weapons, more tracks, and more cars than you could possibly know what to do with. But for all that content, V4 just isn't fun to play. The novelty of racing tiny cars isn't as entertaining as it used to be, which leaves V4 sitting on four flat tires. There are 750 vehicles to collect, but unfortunately, most of them are generic and bland. The most notable feature of V4 is its impressive array of collectible miniatures. There are a whopping 750 cars to collect in the game, and you can even trade them with your friends or transfer them between the PSP and PlayStation 2 versions of the game. The vehicles are divided into 25 classes, such as concept, muscle, off-road, and even gas guzzlers. You collect these cars by completing more than 75 single-player challenges in the game. The collection aspect of the game makes sense given the Micro Machines license, and it provides you with plenty of incentive to keep playing the game. You can race any of the cars that you've collected, or you can just go into the garage and look at them. The problem is that the cars look very generic and lack some much-needed detail. They look blocky and are painted in dull, flat colors, and there isn't much variety because although there are a ton of vehicles in the game, many are just different-colored versions of the same model. Most of the vehicles don't sound especially distinct either, with a constant and annoyingly high-pitched whine being the universal engine noise in the game. Despite their standardized appearance, the vehicles do handle somewhat differently. Each vehicle has ratings for speed, acceleration, grip, and weight, which all affect how the car moves on the course. The difference between a car with a high speed rating and one with a low speed rating are very noticeable, although with so many vehicles you'll invariably end up racing a lot of vehicles that feel pretty average in their performance. As a result, you'll feel as though you're driving the same car most of the game until you get behind the wheel of some of the nonstandard vehicles, like trucks or dragsters. Regardless of which type of car you drive, the racing technique is always the same. You hold the gas button down constantly, powerslide around every corner, and try not to fall off the edge of the track. As in previous Micro Machines games, the tracks you race on are all set in average, everyday places, like a kitchen countertop, a garden, or a workbench. The game does a good job of providing a sense of scale, duplicating the Honey, I Shrunk the Kids effect of having ordinary items that you see every day appear massive and daunting. You'll see giant hairbrushes, chickens that seem to be 10 stories tall, rain gutters wide enough to fit three cars comfortably, and so on. Some of the tracks are creative and fun, while others cover the same themes that you've seen in every Micro Machines game ever made. Most of the tracks are quite perilous given the very slippery handling of the cars, a problem that is compounded by the fact that it can be extremely difficult to even see where you're going, due to a constantly shifting top-down perspective. In the game's battle mode, you have to get enough of a lead over your opponent to cause him to leave the screen. In these events the camera zooms out to keep all of the vehicles in the picture, so if you're in the lead you have no view of the track ahead and have to rely entirely on memory to determine when to turn. As soon as one racer drops out the camera finally zooms back in, which is helpful because it usually improves your view of the course; but at the same time, the frequent movement of the camera can be disorienting because you never get the chance to get used to one perspective. Even when the camera stays put, as it does in the standard race mode, it can still be difficult to navigate the courses unless you've driven them several times before and have memorized each turn. If you miss a turn you'll go flying off the edge of the track, and some of the tracks are very narrow and feature plenty of deviously sharp turns. The way that most of the single-player challenges are structured, even one slight mistake is enough to make you fail; so there is very little room for error. There are three basic types of races in Micro Machines V4. The most common race is the battle race, where you earn points by driving so far ahead of your opponents that they leave the screen. There are also standard three-lap races and checkpoint races. In the checkpoint races, you have to reach the next checkpoint on the track before your time runs out. Passing through a checkpoint earns you more time, but just barely enough to allow you to reach the next checkpoint--as long as you don't make any mistakes. While the focus of V4 is on driving fast and staying on the course, there's also a combat element to the game. When you're racing or battling, you'll collect items scattered throughout the course that can be used to attack your enemies or heal yourself. There are a variety of weapons, including machine guns, missiles, bombs, and even giant hammers. When you attack an opponent, his car will take damage. As the car becomes damaged it drives slower and doesn't handle as well, and if a car takes enough damage it will lose wheels and eventually stop altogether. The weapons add a bit more chaos and excitement to the game, but more often than not it's easier to simply bump an opponent off the track or outrun him than it is to blow him up. In most races you'll lose if you leave the track even once, which means you'll need to memorize each and every turn of each and every track to survive. Micro Machines V4 supports up to four players via split-screen and a multitap. You can trade cars, race for fun, or even race for pink slips. The multiplayer suffers from the same problems as the single-player game, but it can be slightly more fun to battle it out against your friends rather than the artificial intelligence in the game, because as with any great multiplayer game, V4 offers plenty of opportunities to completely screw over your friends. When racing in multiplayer, it becomes less a matter of racing skill and more a matter of who can get the best position or weapon, or who can be the first to knock the other guy off a particularly difficult stretch of track. There's also a track editor in the game, but it doesn't let you create entire tracks from scratch. Instead, you simply set waypoints to determine the course to be taken around a premade track. With only a handful of premade tracks to choose from, the editor doesn't hold much appeal. The sheer number of cars and tracks in Micro Machines V4 is impressive, but the actual racing just hasn't held up over the years. Some of the tracks are cleverly designed and are genuinely interesting, but even then, the frustrating camera and loose handling of the vehicles can make for a trying and tiresome race. Even at a slightly reduced price, V4 just isn't worth adding to your collection."}