{"ref": "https://www.gamespot.com/reviews/breath-of-fire-dragon-quarter-review/1900-2911589/", "date": "February 25, 2003", "game_name": "Breath of Fire: Dragon Quarter", "text": "Capcom's long-running Breath of Fire series of role-playing games takes a bold step in a new direction in Breath of Fire: Dragon Quarter, the fifth installment in the series. While its predecessors have been about as straightforward as console RPGs get, Breath of Fire: Dragon Quarter features an original tactical combat system and numerous gameplay twists that will surprise players well accustomed to the standard RPG blueprint. The story is surprisingly good as well and has thematic ties to the other Breath of Fire games, but it's set in Dragon Quarter's own unique subterranean world. It's true that Dragon Quarter can be punishing at times and that its unusual combat system can still get very repetitive, but the game offers plenty of challenge, replay value, and impressive graphics and sound, making Breath of Fire: Dragon Quarter another very strong role-playing game for the PS2. And it's especially well suited for those players who still like the genre but are no longer willing to settle for the same old console RPG formula that's been done to death over the last decade. Like all previous Breath of Fire games, this one focuses on a blue-haired young character named Ryu, who, it turns out, can harness the power of a dragon. Ryu works as a ranger, sort of a patrolling guardsman, in Deep Earth. Down in Deep Earth, people in society are born with a unique number called their D-ratio, a measure of their latent abilities as well as a status symbol--those with high D-ratios are society's upper class. Ryu's D-ratio seems much too low for him to get ahead in the world, but early on in the game, a brush with an ancient dragon awakens in Ryu some unknown and terrifying power. Soon Ryu finds himself protecting a wispy and mysterious girl named Nina and also traveling alongside a tough sharpshooter named Lin, and the three of them will face many perils during their difficult adventure as they head for the world's surface. The game's story unfolds via cutscenes done in the game's 3D engine, and these really showcase Dragon Quarter's expressive characters while giving you a constant incentive to press onward, to find out what happens next to the seemingly ill-fated trio. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Breath of Fire: Dragon Quarter Video Review The gameplay itself is mostly a third-person-perspective dungeon crawl, which will have Ryu and his companions fighting their way through countless levels of claustrophobic mazes populated by lots of different types of monsters. Ryu (or whichever character you have in the lead) runs quickly and can often outrun his foes before they engage him in battle. There are no random encounters in Breath of Fire: Dragon Quarter, so you'll pretty much always see your opponents in the field prior to any combat taking place. Being a ranger, Ryu turns out to be skilled in the use of traps and other bait and can hurl things like bombs and dynamite at groups of foes to soften them up before engaging them head-on. Meat can also be used as bait, to draw out individual opponents or to distract them. Ryu can also slash at an enemy to take the initiative in battle. However, if the enemy makes contact with him first, then that enemy will get to attack beforehand. The game calls all this the ~positive encounter and tactics system,~ or PETS. It's not so complicated that it deserves an acronym, but it's definitely more engaging than the nonstop random battles that are epidemic in console RPGs. The turn-based combat system uses the same graphics as the dungeon-crawling portions of the game but presents the action from a higher-up isometric vantage point. You'll see all your characters on the field and all the monsters in the immediate vicinity, and you all will take turns attacking each other based on the speed ratings of the combatants involved. Each character's actions per turn are governed by the number of action points (AP) he or she has, and moving about the battlefield and attacking use up AP. You can conserve some of your AP to unleash a particularly devastating combination attack in a subsequent round, but strangely, using items takes no AP whatsoever. So for instance, if you need to heal all your characters during Ryu's turn when he's only got 1 AP left, you can. This generally isn't a big deal, since healing items often are in preciously short supply and the combat is all about swiftly eliminating foes before they can get at you. Late in the game, however, the combat unfortunately devolves into the sorts of slugfests typical of RPGs, where enemies have tons of health, and each time they hit you, you're brought to death's door and must spend part of the next round healing back up. By then, the combat seems less tactical and more focused on how high of an experience level your characters are at and how good their weapons are. Combat also generally doesn't reward you for flanking a foe or attacking it from behind. It's not like Breath of Fire: Dragon Quarter's combat system will appeal more to those who prefer strategy games over RPGs. Nevertheless, Breath of Fire: Dragon Quarter's intriguing skill system keeps the combat interesting all the way until the end of the game, and beyond. Each character has three levels of attacks, and you'll need to discover all these special moves by clearing out dungeon levels for all their best loot. In battle, you can string together multiple different attacks as long as you have enough AP, and these combos can often inflict debilitating status effects on foes in addition to seriously injuring them. Some skills are more powerful than others, and not all weapons can be used with every type of skill, and as a result, you'll always be looking out for better and better equipment and new special abilities. One of the game's most unusual features is that it lets you restart from the beginning (after you finish the game or at any point beforehand), retaining all your skills and abilities intact. Upon replaying Breath of Fire: Dragon Quarter, you'll see some new story events unfold that you didn't catch the first time, and you'll find even more new weapons and skills and take on even tougher foes. Breath of Fire: Dragon Quarter may be a dungeon crawl, but it's got an involving story for good measure. The game rewards you for playing through repeatedly and efficiently. Finishing the game the first time through will take about 20 hours, though it can be done in less than half that time if you know exactly what you're up against--that all adds up to a significant amount of gameplay. Of course, finishing Breath of Fire: Dragon Quarter even the first time through will prove to be difficult for most players, not just because some of the battles are very tough, but also because the game has a save system that can be pretty punishing. If you just want to stop playing for a while, you have the option to use a ~temporary save~ as you quit the game--this temporary save file is deleted as soon as you continue play, so using it won't do you any good before a tough boss battle, for instance. Meanwhile, permanent save points are few and far between and also require you to have save tokens on hand, which themselves are scarce. So you may potentially find yourself playing for hours without having saved, only to have your party get killed off in a particularly tough fight. All isn't lost--you have the option to restore your progress from the last save point, retaining some of the experience and all the skills you acquired up until then. You'll also likely run across some story sequences on your next run that you didn't see before. It's a strange system that can be frustrating, but the designers certainly succeeded in concocting a save system that makes the game more tense and suspenseful. Another element that adds to the tension and suspense is Ryu's D-counter, which kicks in at a certain point in the game and measures Ryu's remaining grip on his humanity. Ryu's dragon powers are sort of a curse--while he becomes able to transform into an astonishingly powerful half-dragon form, each time he uses its various powers in battle, Ryu's D-counter rises by a percentage point or two. The D-counter also slowly rises on its own, even outside of battle, meaning Ryu is living on borrowed time for the majority of the game. If the counter ever reaches 100 percent, he's dead, and you need to start over. Realistically, this isn't going to happen unless you use Ryu's secret powers often, but you'll constantly be tempted to unleash them since they make most every battle a total cakewalk. If you want something different from a role-playing game, Breath of Fire: Dragon Quarter is definitely for you. Breath of Fire: Dragon Quarter is a great-looking game, featuring inspired character designs and a visual style that's reminiscent of cel-shading, in that characters are outlined by a dark black line. You'll see Ryu, Nina, and Lin express realistic emotions during cutscenes even though there's no speech in them. All three characters often look terribly concerned over the course of the game, making the proceedings seem that much more serious and making the heroes seem that much more determined as they press on. Dragon Quarter runs at a very smooth frame rate, and while many of the environments can start to look repetitive and the running animations look a bit awkward, all in all the game's visual design is memorable and well done. Likewise, an excellent musical score and great (though occasionally repetitive) sound effects round out the game's first-rate production values. Breath of Fire: Dragon Quarter proves that role-playing games don't all have to be alike. The game has many unusual features to it, including a town-building minigame where you manage an ant colony by interviewing and hiring ants with different skills, ordering them to excavate caverns, and then having them build things like marketplaces, cafeterias, fitness centers, and more. Dragon Quarter can be very challenging and even frustrating at times, and though its combat system is decidedly different, it could have had more depth to it. Plus the gameplay does revolve around hacking through one dungeon level after another, meaning Dragon Quarter doesn't have the same epic feel as some other RPGs, despite its good storyline. Yet the game is still extremely well done for what it is and is easily recommendable to all fans of role-playing games. Nevertheless, Breath of Fire: Dragon Quarter's intriguing skill system keeps the combat interesting all the way until the end of the game, and beyond. Each character has three levels of attacks, and you'll need to discover all these special moves by clearing out dungeon levels for all their best loot. In battle, you can string together multiple different attacks as long as you have enough AP, and these combos can often inflict debilitating status effects on foes in addition to seriously injuring them. Some skills are more powerful than others, and not all weapons can be used with every type of skill, and as a result, you'll always be looking out for better and better equipment and new special abilities. One of the game's most unusual features is that it lets you restart from the beginning (after you finish the game or at any point beforehand), retaining all your skills and abilities intact. Upon replaying Breath of Fire: Dragon Quarter, you'll see some new story events unfold that you didn't catch the first time, and you'll find even more new weapons and skills and take on even tougher foes. The game rewards you for playing through repeatedly and efficiently. Finishing the game the first time through will take about 20 hours, though it can be done in less than half that time if you know exactly what you're up against--that all adds up to a significant amount of gameplay. Of course, finishing Breath of Fire: Dragon Quarter even the first time through will prove to be difficult for most players, not just because some of the battles are very tough, but also because the game has a save system that can be pretty punishing. If you just want to stop playing for a while, you have the option to use a ~temporary save~ as you quit the game--this temporary save file is deleted as soon as you continue play, so using it won't do you any good before a tough boss battle, for instance. Meanwhile, permanent save points are few and far between and also require you to have save tokens on hand, which themselves are scarce. So you may potentially find yourself playing for hours without having saved, only to have your party get killed off in a particularly tough fight. All isn't lost--you have the option to restore your progress from the last save point, retaining some of the experience and all the skills you acquired up until then. You'll also likely run across some story sequences on your next run that you didn't see before. It's a strange system that can be frustrating, but the designers certainly succeeded in concocting a save system that makes the game more tense and suspenseful. Another element that adds to the tension and suspense is Ryu's D-counter, which kicks in at a certain point in the game and measures Ryu's remaining grip on his humanity. Ryu's dragon powers are sort of a curse--while he becomes able to transform into an astonishingly powerful half-dragon form, each time he uses its various powers in battle, Ryu's D-counter rises by a percentage point or two. The D-counter also slowly rises on its own, even outside of battle, meaning Ryu is living on borrowed time for the majority of the game. If the counter ever reaches 100 percent, he's dead, and you need to start over. Realistically, this isn't going to happen unless you use Ryu's secret powers often, but you'll constantly be tempted to unleash them since they make most every battle a total cakewalk. Breath of Fire: Dragon Quarter is a great-looking game, featuring inspired character designs and a visual style that's reminiscent of cel-shading, in that characters are outlined by a dark black line. You'll see Ryu, Nina, and Lin express realistic emotions during cutscenes even though there's no speech in them. All three characters often look terribly concerned over the course of the game, making the proceedings seem that much more serious and making the heroes seem that much more determined as they press on. Dragon Quarter runs at a very smooth frame rate, and while many of the environments can start to look repetitive and the running animations look a bit awkward, all in all the game's visual design is memorable and well done. Likewise, an excellent musical score and great (though occasionally repetitive) sound effects round out the game's first-rate production values. Breath of Fire: Dragon Quarter proves that role-playing games don't all have to be alike. The game has many unusual features to it, including a town-building minigame where you manage an ant colony by interviewing and hiring ants with different skills, ordering them to excavate caverns, and then having them build things like marketplaces, cafeterias, fitness centers, and more. Dragon Quarter can be very challenging and even frustrating at times, and though its combat system is decidedly different, it could have had more depth to it. Plus the gameplay does revolve around hacking through one dungeon level after another, meaning Dragon Quarter doesn't have the same epic feel as some other RPGs, despite its good storyline. Yet the game is still extremely well done for what it is and is easily recommendable to all fans of role-playing games."}