{"ref": "https://www.gamespot.com/reviews/cooking-mama-review/1900-6157831/", "date": "September 19, 2006", "game_name": "Cooking Mama", "text": "For the aspiring Rachael Rays and Bobby Flays of the world comes Cooking Mama, a culinary-themed puzzler for the Nintendo DS that makes liberal use of the touch screen to have you perform just about any kind of cooking-related task you can think of. The game tasks you with all the preparatory work for a variety of recipes through a quick and slightly disjointed series of minigames, all while Mama, a bright-eyed anime chef, judges your progress and eventually assigns you a grade based on how quickly and accurately you performed the tasks at hand. It's a bright, colorful game with a lot of charm and some amusing minigames, but it's also exceedingly light on difficulty or depth, and it does eventually get old. Set it, and forget it! Everything you do in Cooking Mama revolves around your master kitchen tool, which is the game's term for the DS's stylus. With this master kitchen tool, you can do anything. It slices, it dices, it mixes, it presses, it grates, and it even delivers sauces smoothly and evenly. It's basically the kitchen appliance of Ron Popeil's greatest dreams, and it's a breeze to use. Each time you are presented with a task, you simply tap, swipe, or scribble with the stylus. Say you're presented with some garlic over a grater. Just put the stylus on the garlic, and swipe it back and forth to grate, while periodically clearing out the collected garlic gunk on the bottom side of the grater. Want to pan fry some meat and vegetables? Watch as a specific progression of tasks slides by telling you when to raise and drop the oven temperature, periodically stir with the stylus, and perhaps even flip the food in the pan from time to time. You even get to blow into the microphone in certain games to cool things off. It's all very simple action, relying on quick, easy movements with the stylus and some good timing, but it's all quite fun too, at least at first. There are at least a few dozen minigames in Cooking Mama, though some of those are variants on the same basic game, and all of them are tied together through a specific progression of games for each recipe. The dishes themselves are made up of a wide variety of foods, ranging from boiled rice to spaghetti Bolognese, pork-fried kebabs, and so on. There are 76 in all, and there's even a mode that lets you combine certain recipes into new dishes. Unfortunately, as neat as that sounds, the basic progression of the game doesn't lend itself to long-term enjoyment. The main problem with Cooking Mama is that it just doesn't have a very good progression to it. With each dish you play a series of the various minigames, but not in any kind of logical order. Basically, each time you complete one of the games, you're spit back out into the main dish menu, and have to click the icon for the next minigame to start it. With this kind of structuring, you lose the sense that you're actually involved in the cooking process, and instead just feel like you're actually playing a scattered series of minigames with no real overarching point to them. The game simply lacks the frenetic pacing of something like a WarioWare, or the cohesive structuring of a game like Trauma Center, and without either, you're left with a series of similar, simplistic minigames that feel disconnected and eventually lose their novelty after a few hours of play. Incidentally, a few hours are all you'll need to try out every dish in the game. Creating each dish doesn't take more than a couple of minutes, and each minigame only takes up anywhere from a few seconds to maybe a minute, tops. The only real reason to go back and play them again is to earn higher scores, but after you've seen and done each game, they don't really inspire any desire for multiple plays, especially considering you'll undoubtedly end up doing many of the same games dozens of times throughout all of the available dishes. It also bears mention that Cooking Mama isn't really going to teach you very much about cooking. You might glean a bit of info on what goes into some of these dishes, but this isn't a virtual cookbook. There are no precise recipes to be accessed anywhere in the game. There's also no multiplayer component of any kind, though the advertised four-player wireless icon on the back of the box might lead you to believe otherwise. All you can do is send a demo recipe to friends' DSes that they can download and play themselves, and it's not multiplayer. As amusing as the notion of chopping up vegetables via the stylus is initially, it wears thin after a short while. Cooking Mama does earn a few style points, however. Its colorful cartoon graphics are pleasing to look at, even when all you're staring at are things like raw meat and uncooked vegetables. Mama herself takes up the top screen while you're busy with the bottom screen doing your cookery, and though she doesn't move around too much, she makes some amusing faces when you succeed, and gives an even more amusing, flame-eyed look when you fail. The game's audio contains a number of cooking-related sound effects (sizzling pans, knives chopping, and the like) and some cheery piano music that repeats too often to be pleasant. It's disappointing that Cooking Mama doesn't hold up over time, as it does make an exceptionally good first impression. But once you settle into the repetitious, disjointed nature of the minigames, you'll find yourself wondering when the game is going to graduate to something more interesting, or at least challenging. Sadly, it never does, instead devolving into the sort of game that can be played in quick bursts for pure time-killing purposes, but is basically impossible to play for longer than that without becoming entirely tedious. On the plus side, Cooking Mama won't cost you more than a budget price at retail, and as a rental, it'll surely provide you with at least a few hours of solid amusement. But you can't help but feel like those few hours of amusement could have turned into a lot more with a more ambitious design."}