{"ref": "https://www.gamespot.com/reviews/nfl-blitz-2001-review/1900-2631691/", "date": "May 17, 2006", "game_name": "NFL Blitz 2001", "text": "As sure as football season has returned for another five months, so too has the latest chapter in Midway's NFL Blitz series, NFL Blitz 2001. Thanks to refined graphics, smarter AI, four-player support, brutal post-play tackles, and comprehensive play-editing features, last year's NFL Blitz 2000 represented a major leap over its predecessor. In contrast, NFL Blitz 2001 takes a low-key approach, delivering much the same features as last year's release while offering a number of minor refinements in key areas. Fans and newcomers alike will be glad to note that NFL Blitz 2001 is overflowing with features. As a licensed NFL product, the game contains all 31 NFL teams and more than 200 real-life players. The game's arcade, season, and tournament modes offer gaming for any skill level. Arcade mode incorporates CPU assistance and cheat codes, ensuring that games are never too one-sided, while season and tournament modes eschew assistance and power-ups for a more pure football experience. Since the game supports four players simultaneously, you can also challenge human opponents in one-on-one, two-on-two, or one-on-two matchups. Further, since the game now tracks season progress for multiple players, there's no longer any reason to shut friends out on your road to Super Bowl glory. Statistically speaking, NFL Blitz 2001 records 11 game stats and nine season stats as you progress, running the gamut from first downs, fumbles, and fourth down conversions to season passing yards, return yards, and sacks. These are in addition to the obligatory recording of win/loss statistics and percentages. There are no individual player statistics kept, however. The comprehensive playbook editor, which debuted last year, returns again in NFL Blitz 2001, allowing you to mix and match your own set of 27 offensive and nine defensive plays from a stock set of 50 predesigned battle plans. Should these premade strategies not suit your taste, you're afforded nine extra slots in each category with which to create your own plays. The editor doesn't allow pixel-perfect player manipulation, but the number of man to man, zone, and rush choices - combined with player positioning and coverage designations - leaves a lot to enjoy. Although the game contains all of last year's features, NFL Blitz 2001 also adds three new minigames. The first minigame, first-and-goal frenzy, places you on the ten-yard line in an attempt to score a touchdown in four downs or less. Should you succeed, you'll then try from the 20, then the 30, and so on. The second minigame, goal-line stand, is the exact opposite, as you must prevent your opponent from scoring touchdowns. The final minigame, QB challenge, is where true multiplayer riots are sure to ensue. You're hiked three balls and ordered to pass to three receivers, each of which is following his own route down the field. The order in which you must pass to them and the routes they run are chosen by the computer milliseconds before you throw. You get almost no time to think, and since there are multiple attempts, the result is a ~Simon says~ game as frustrating and addictive as Konami's Beatmania. Despite the addition of minigames, NFL Blitz 2001 doesn't feel that much different from last year's release in terms of gameplay. The computer-controlled AI is just as intelligent and aggravating as in last year's release, putting up the kind of fight you'd expect from a Madden or Gameday title. In season and tournament mode, CPU players predict your moves and react to passes so quickly that you'll wonder if they're not seasoned professionals out for a Monday-night killing. In arcade mode, this factor is boosted by the game's computer assistance, which ensures an even game by adjusting the frequency of fumbles and interceptions in the losing team's favor. If anything, NFL Blitz 2001's gameplay adjustments center on the areas of play calling and rushing. Even more so than in last year's Blitz, correct play choice is crucial. If the opposing team has a strong defense, taking risks with long passes or conversion-type plays isn't recommended. If their offense is strong, a decent blitz or zone play is a good idea, but you'll be handed your shorts if you try a suicide move. In a similar fashion, while spin moves and hurdles are a good way to avoid opposing tackles, they also increase the odds that you'll fumble the ball. Should you fumble, you'll find that NFL Blitz 2001 gives the CPU a suspicious number of turnovers and offers much less room for error than NFL Blitz 2000. At least the game still contains the same lack of penalties, abbreviated game time, and post-play beatings that have made the Blitz series popular. Just as with NFL Blitz 2001's gameplay, little has changed in terms of graphics and sound, either. Midway tweaked the player models and animations to make them flow smoother, but the actual players look blockier as a result. Field visuals and weather effects are crisper and there's less graininess, but things get really jagged in close-ups. It's a toss up as to which version looks better, but the line between pro and con definitely wasn't as noticeable in last year's release. The weather effects, such as snow and rain, certainly look nicer this time around. As for audio, NFL Blitz 2001 is NFL Blitz 2000 all over again. Most of the same sayings and sound effects that gave last year's game personality are back this year, right down to the dreaded ~Score, score, score!!!~ Midway mixed it up a little, but the frequency with which the sayings are repeated leaves much room for improvement. In all fairness, people are going to read this review, look at the scores, and wonder why they're so much lower than the scores for last year's game. The visuals are just as good, and yes, the gameplay and features are solid as well. However, there's just not all that much new over last year's game. Furthermore, the two things that NFL Blitz 2000 had going for it - approachability and freshness - are diminished in this year's version by the fact that the CPU AI is tougher and the fact that the game evokes a distinct feeling of dj vu. Thankfully, NFL Blitz 2001 is enjoyable nonetheless."}