{"ref": "https://www.gamespot.com/reviews/carmageddon-reincarnation-review/1900-6416163/", "date": "June 4, 2015", "game_name": "Carmageddon: Reincarnation", "text": "Carmageddon, released in 1997, was a bloody and entertaining car combat racer for its time. It was one of those oft-declared violent games of the 90s, featuring enough wanton carnage to attract the ire of hand-wringing parents, politicians, and censors. You raced and killed your way to victory in one of many exaggerated vehicles, each of them strapped with rough blades, spikes, and other nasty parts, as you wrecked opponents and turned mobs of wandering pedestrians into chunks of flayed meat. The game was defined by its era. Carmageddon: Reincarnation attempts to bring that game back to life, but it does little to improve on the old formula, and the result feels out of its time. The game would be mediocre at best, but a host of serious performance issues and slippery controls ultimately leave enjoyment idling in the garage, choking on fumes.Carmageddon: Reincarnation has many problems under the hood, but clunky performance is worst of all. The frame rate struggles to stay around 30, occasionally diving to create something akin to a Red Asphalt slide show; at times, it sputters and chugs worse than a 1970s-era Chevy truck left to rot in the backyard. One map in particular, a small arena with a large metal saucer that periodically drops on any hapless vehicles below, is nearly unplayable. As cars and trucks get crushed, the game screeches to a halt, leaving you to ponder the games fragile state and wonder just when it will all fall apart. But you wont have to wait for long--the game crashes, freezes, and locks up your computer, forcing restarts. Of course, you can lower your graphics settings to squeeze out more frames, but doing so offers no favors in a game that already looks aesthetically dull. The performance, however, would be at least somewhat bearable with vehicles that are fun to drive. Well, buckle up.A host of serious performance issues and slippery controls ultimately leave enjoyment idling in the garage, choking on fumes.You would expect a game entirely focused on vehicles, from racing to combat, to put the utmost care and effort into how well they handle. Carmageddon: Reincarnation, however, could have spent more time under a mechanics careful eye--a lot more time. You can unlock a large roster of vehicles--most will be familiar to longtime Carmageddon fans--and send them soaring through frightened crowds of cows and human pedestrians (or peds, as the game refers to them), but precious few are worth taking out for a drive. Some of the heavier vehicles take to the road with the grace of a lobbed brick, but the majority control as though theyre being driven over greased ice.At the slightest provocation, from bump to severed body part, vehicles spin out of control, making you fight to stay on the road. Even a minimal increment, such as diving from road to sidewalk, can cause your car to wildly jerk to the side, or worse, flip end over end. Small ramps also hide untold danger because hitting them at the wrong angle will more often than not send you flipping through the air to land on your roof. Large vehicles with large tires to match tend to have more stability on and off the road, but they lack the speed of the faster, sportier cars. And because most of Reincarnations game types favor zippy cars over slow-moving trucks, its not likely that youll stay behind the wheel of one for long.At the slightest provocation, from bump to severed body part, vehicles spin out of control, making you fight to stay on the road. Speaking of game modes, lets go over which ones are good and which ones are bad. Ok, that was a trick statement: none of them are that good. In Classic Carma, you can win in one of three ways: finish a race, kill all the pedestrians, or destroy every opponent. Colored oil drums that dot the map provide you with the means for victory. Red barrels provide weapons and items, including flying Acme-sized anvils, explosive mines, oil slicks, and springs that propel nearby opponents and pedestrians through the air or into walls. Yellow barrels add a few more seconds to a countdown timer or some extra points. Those points can also be used to purchase weapons or defensive boosts, which you can add to a set of hotkeys. The mode takes you on a tour of the maps in Carmageddon: Reincarnation, which are surprisingly large (leading to lengthy load times), providing long, winding races across beaches, through sea towns, under icy caverns, and past industrial complexes.Classic Carma is Reincarnations best form. To my surprise, I stumbled into rare moments in which racing along as my opponents and I exchanged metal and flak was actually fun. But these offered short bursts of excitement, and they were dragged down by technical issues and, after a while, boredom. Yes, you can only spend so many hours smashing lazy pedestrians and tumbling onto your roof for the umpteenth time before the games cheesy metal soundtrack gets drowned out by your tired sighs.The other modes, many of which are inspired by those from the original Carmageddon, are mostly omissible. Two of them, Checkpoint Stampede and Ped Chase, are practically the same. One has you and your foes drive through a checkpoint, and the other asks you to crush a highlighted pedestrian on one side of a map. In the Car Crusher arena, you must destroy opponents to gain a point, while getting wasted costs you one. Another mode, Death Race, is fairly self-explanatory.Fox n Hounds, however, is just bad. In this mode, one player is the fox and is highlighted in blue. To win, you must spend a certain amount of time as the fox while avoiding being touched by other combatants, who otherwise become the new fox. Naturally, you would think that just avoiding enemies would be enough to snag an easy win. But the elementary intelligence powering your foes deflates any fun and challenge the game type could offer. Enemy cars smash into the fox, creating a twisting, writhing clump of metal as the fox title gets passed around so quickly that the game announcer has a hard time keeping up. This is the majority of my experience in Fox n Hounds, a mode I eventually avoided like it was an oncoming bus.The frame rate struggles to stay around 30, occasionally diving to create something akin to a Red Asphalt slide show.The game also offers an online mode, in which you can test your ped-crunching skills against actual humans, who are smarter and deadlier than any CPU opponent. Here you are privy to all game modes, save Classic Carma, with the only major change being that resetting your vehicle takes three seconds instead of happening instantly. I didnt get as many hours into the online portion as I wanted, mainly because I rarely found a game with people to play against.So, with poor performance, stiff controls, and relatively dull game modes, I suppose the only thing Carmageddon: Reincarnation has left to offer is its dazzling sense of humor. Perhaps I have simply grown up, but I no longer chuckle at splattering dumb pedestrians against the hood of a digital car, with heads and viscera flying in all directions. I remember playing the original Carmageddon in my youth, giggling at a flying severed arm or three as I tore down a street. Its all the same in Reincarnation, and I cant get over how tame it feels. Its not just that other games do violence better; this is the games humor, and it just doesnt cause a reaction. During your travels, you will also spot a phallic-shaped building in the distance or hear frightened people screaming on a runaway elevated train as it tears around a city. There are rare chuckles, and I am not completely humorless, so hearing my car squeezing out a mine to the tune of a gurgling fart as it pummels disco-dancing bovines did provide a short laugh. But there isnt much beyond that. After playing for a few hours, the humor was all but spent, as was much of the game.Carmageddon: Reincarnation has the same flavor as the Carmageddon of yore, but not much attempt has been made at a revolution. Its the same as it always was, and that isnt exactly a point in its favor. Mowing down hundreds of the same meandering pedestrians demonstrating the same lousy animations is no longer as fun. Some games today, such as anything from Saints Row, do a much better job at car combat, racing, and killing heaps of pedestrians. Instead, the only thing Reincarnation actually achieves is standing as a reminder of how far gaming has come. The vehicular manslaughter of thousands of listless fodder swiftly falls into tedium after only a handful of hours, long before reaching the end of the games surprisingly lengthy 16-chapter campaign. The rose-tinted glasses are off; I was glad to have experienced Carmageddon all those years ago, but thats where it should have remained."}