{"ref": "https://www.gamespot.com/reviews/new-super-mario-bros-wii-review/1900-6239677/", "date": "November 13, 2009", "game_name": "New Super Mario Bros. Wii", "text": "You better bring your butt-stomping A-game to New Super Mario Bros. Wii. Like the best Mario 2D games of decades past, this game is unashamedly and deliciously challenging. It will even test the most seasoned platforming veterans. And it's not just the difficulty that evokes comparisons with such classics as Super Mario Bros. 3. While New Super Mario Bros. Wii feels and plays like its esteemed side-scrolling forebears, there are enough additions here--such as the ability to have four players take on Bowser's minions at the same time--to make it a completely engaging game in its own right. Whether you decide to tackle it solo or submit yourself to the at-times fun, at-times frustrating multiplayer, New Super Mario Bros. Wii is a thoroughly worthwhile experience. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: New Super Mario Bros. Wii Video Review It's an experience that will feel instantly recognizable to anyone who grew up with the mustachioed plumber's various adventures throughout the years. Nintendo hasn't fiddled with its successful formula too much in New Super Mario Bros. Wii, with gameplay additions limited to tweaks rather than total revamps. Your task is still to make your way from point A to point B while avoiding various environmental obstacles and enemies, which requires increasingly accurate timing, intricate planning, and ninjalike reflexes as you progress through the game's eight varied worlds. Mario himself gets two new power-ups; first, there's the astoundingly useful penguin suit, which grants Mario the ability to hurl snowballs that can freeze opponents (as well gives him better traction on ice and the ability to navigate through water like a fish). Then, there's the just-as-useful helicopter suit, which allows Mario to shoot himself into the air and hover for short periods of time. All of Mario's other power-ups and abilities are old favorites--fire-flowers, ice-flowers (that can also hurl freezing snowballs), starmans, and more make a comeback. The loveable Yoshi also makes an all-too-brief appearance in a few levels. You'll need to dig deep and mine whatever experience you have with previous Mario offerings because New Super Mario Bros. Wii is by far the most challenging game in the series for many years (certainly more so than New Super Mario Bros. on the DS or Super Mario Galaxy). It starts off innocuously enough, but by the start of the second world, things get noticeably more difficult. It doesn't let up as you make your way through to the fiery eighth world and a particularly epic Bowser boss battle. It's a welcome challenge because despite the fact that you'll no doubt lose plenty of lives and at times be tempted to throw the Wii Remote in frustration, the game never feels cheap, thanks to its consistently outstanding level design. Avoiding half a dozen Bullet Bills while navigating various shifting platforms may seem impossible to begin with, but patient study and fast reactions will always get you through (with enough practice, that is). The game's high difficulty may initially scare off new players, but it wouldn't be the Nintendo of today if the game didn't try to make concessions for casual gamers. The Super Guide is the game's way of helping you past sections you may find tough and is activated as an option once you lose eight lives in any particular level. If you choose to use the guide, a computer-controlled Luigi will sub in for Mario and essentially run through the entire level for you (including any boss fights that may be part of the level). Once complete, you're given the option to either try the level again yourself or just skip it completely. It's an interesting addition, and while it initially seems to make the game too easy, the high lives count needed before it activates means that, for the most part, you'll probably be able to figure out the best way through a level on your own even before the Super Guide kicks in for you. And while it does show you the optimum path through levels, the AI Luigi doesn't uncover all the secret areas or star coins, which means Mario completionists will still have to figure out how to grab these bonuses on their own. The game gets tough quickly--this is just the first world. As with previous Mario games, there are plenty of these secret areas and bonuses to be found, which adds greatly to the replay value of New Super Mario Bros. Wii. Each level features star and red coins to collect, as well as the usual warp pipes, hidden blocks, secret extra lives, and more. Collected star coins can be used to unlock bonus movies that show where hidden areas can be found, speed runs, and more. But more importantly, you'll need star coins to access a supersecret area that is only unlocked after you complete the game, giving you even more incentive to continue playing. Your quest to find all those coins and save perennially kidnapped victim Princess Peach is backed up by mainly solid controls that have kept the simplicity of previous Mario games. You play with the Wii Remote held sideways, with the 2 button used for the all-important jump and the 1 button used to throw projectiles. It works fine for the most part, but some of the motion-control-based moves--such as shaking the Wii Remote to launch a spin attack or quickly jerking the Wii Remote down to pick up objects--can sometimes lead to unexpected lapses of control as your hands shift. It's not a game breaker, but there will be the occasional instance where a carefully planned and intricate sequence of jumps and attacks is undone by waggling-induced control loss. And while you can play with a nunchuk attached, for some odd reason, there's no Classic Controller support built into the game, which is a disappointing omission. Multiplayer can be fun, as long as you're not playing with jerks. New Super Mario Bros. Wii's biggest new feature is the ability for four people to play the game at once. Players take on the role of Mario, Luigi, Blue Toad, and Yellow Toad. Though technically they're different characters, they all share the same abilities and moves. Playing with friends is initially great fun--you can bounce off other characters, push each other into crevices, or even pick up and throw other characters. It's chaotic and can provide plenty of laughs; that is, as long as you're not actually serious about quickly reaching the end of a level. The ability to bounce off other's characters makes navigating most tough levels with more than one player a slow process, and it reaches frustration levels if you're partnered with Mario newcomers who will, more often than not, accidentally get in the way. That's not to say you should avoid multiplayer--with other experienced players at the helm, it can be fun, if a little tedious, to make it through a world. Multiplayer can also be a great teaching tool, with experienced players taking the lead and showing the ropes to platformer novices who want to build up their skills. Outside of the main game, players can also compete in two dedicated multiplayer modes--Free mode and Coin Battle. Both these modes allow you to play any level you've already unlocked, but while Free mode is just a straight-up replay, Coin Battle sees you competing with your friends to see who can make it to the end with the most coins collected. While New Super Mario Bros. Wii is the second Mario platform game offering for the Nintendo home console, it pales in comparison to the looks of the first game: Super Mario Galaxy. This new Mario for the Wii features the usual bright colors and cartoon look of the series, but it lacks the sharpness and detail that Galaxy showed off. Sound is more a collection of nostalgia-inducing music and noises from previous Mario games than anything groundbreaking or new, including sounds from the 8-bit era, such as the distinctive noise made when Mario first grabs a super mushroom. Controls are mostly fine, but some waggle and motion moves can be annoying. Thankfully, New Super Mario Bros. Wii has more than nostalgia to back it up. While it doesn't stray too far from what's come before it, New Super Mario Bros. Wii's tight gameplay, multitude of secrets, accessibility for newcomers thanks to the nifty Super Guide, and some fun multiplayer additions all add up to a great platformer that Mario fans and nonfans alike should enjoy. Your quest to find all those coins and save perennially kidnapped victim Princess Peach is backed up by mainly solid controls that have kept the simplicity of previous Mario games. You play with the Wii Remote held sideways, with the 2 button used for the all-important jump and the 1 button used to throw projectiles. It works fine for the most part, but some of the motion-control-based moves--such as shaking the Wii Remote to launch a spin attack or quickly jerking the Wii Remote down to pick up objects--can sometimes lead to unexpected lapses of control as your hands shift. It's not a game breaker, but there will be the occasional instance where a carefully planned and intricate sequence of jumps and attacks is undone by waggling-induced control loss. And while you can play with a nunchuk attached, for some odd reason, there's no Classic Controller support built into the game, which is a disappointing omission. Multiplayer can be fun, as long as you're not playing with jerks. New Super Mario Bros. Wii's biggest new feature is the ability for four people to play the game at once. Players take on the role of Mario, Luigi, Blue Toad, and Yellow Toad. Though technically they're different characters, they all share the same abilities and moves. Playing with friends is initially great fun--you can bounce off other characters, push each other into crevices, or even pick up and throw other characters. It's chaotic and can provide plenty of laughs; that is, as long as you're not actually serious about quickly reaching the end of a level. The ability to bounce off other's characters makes navigating most tough levels with more than one player a slow process, and it reaches frustration levels if you're partnered with Mario newcomers who will, more often than not, accidentally get in the way. That's not to say you should avoid multiplayer--with other experienced players at the helm, it can be fun, if a little tedious, to make it through a world. Multiplayer can also be a great teaching tool, with experienced players taking the lead and showing the ropes to platformer novices who want to build up their skills. Outside of the main game, players can also compete in two dedicated multiplayer modes--Free mode and Coin Battle. Both these modes allow you to play any level you've already unlocked, but while Free mode is just a straight-up replay, Coin Battle sees you competing with your friends to see who can make it to the end with the most coins collected. While New Super Mario Bros. Wii is the second Mario platform game offering for the Nintendo home console, it pales in comparison to the looks of the first game: Super Mario Galaxy. This new Mario for the Wii features the usual bright colors and cartoon look of the series, but it lacks the sharpness and detail that Galaxy showed off. Sound is more a collection of nostalgia-inducing music and noises from previous Mario games than anything groundbreaking or new, including sounds from the 8-bit era, such as the distinctive noise made when Mario first grabs a super mushroom. Controls are mostly fine, but some waggle and motion moves can be annoying. Thankfully, New Super Mario Bros. Wii has more than nostalgia to back it up. While it doesn't stray too far from what's come before it, New Super Mario Bros. Wii's tight gameplay, multitude of secrets, accessibility for newcomers thanks to the nifty Super Guide, and some fun multiplayer additions all add up to a great platformer that Mario fans and nonfans alike should enjoy."}