{"ref": "https://www.gamespot.com/reviews/lostmagic-review/1900-6148582/", "date": "April 28, 2006", "game_name": "Lost Magic", "text": "The Nintendo DS stylus has performed many different functions in its relatively short life, ranging from the inspired to the impractical. In LostMagic, an action role-playing game from Taito, you get to use your stylus both as a magic wand and as a tool for commanding units on real-time strategy battlefields. LostMagic's varied use of the stylus is undoubtedly one of its strongest features, and the good news is that the game backs up its great control system with an engaging, story-driven adventure mode; good multiplayer support; clean, colorful visuals; a decent soundtrack; and loads of cool monsters that you can choose to kill or capture in every level. LostMagic's story is told through conversations that the protagonist has with other characters. In LostMagic, you assume the role of a young mage named Isaac who sets out to find the father that he hasn't seen in years and winds up with the fate of the whole world resting on his shoulders. The storyline has plenty of interesting twists and turns, and although Isaac's noncombat interactions with other characters are mostly limited to linear conversations, they're an interesting bunch and you never really know who you can trust. Many of the other mages that you encounter in the game, for example, spend parts of the game under the influence of the evil Diva of Twilight, and the only way for you to free them from her spell is to defeat them in battle. Real-time battles are what LostMagic is all about--you don't walk around towns and talk to people, you don't wander aimlessly around a world map hoping to avoid random encounters, and you certainly don't waste any time scouring areas for clues as to what you're supposed to do next. You fight battles, you move between key locations on the world map instantly, you fight more battles, and you occasionally get a dose of storyline via brief and mostly linear conversations that Isaac has with other characters. LostMagic deals with exploration and conversation in such a way that neither can really be considered gameplay features, which is just fine, because the last thing you want is to get bogged down with that stuff in between the game's enjoyable and surprisingly varied battles. At the start of your adventure, you have access to only a handful of spells, including fireball and ice-shard projectiles, as well as the ability to heal yourself. There are six schools of magic in the game, which can be divided up into three pairs that are particularly effective when used against each other: fire versus water, light versus dark, and earth versus wind. Most of the monsters that you'll be battling are attuned to one of the six elements, and you can generally tell which one it is by paying attention to what color they are. Water monsters are blue for the most part, for example, while earth monsters are brown and light monsters are yellow. Choosing the right spells for the job is crucial when attempting to kill monsters, but the real challenge comes when you decide that you want to catch one so that you can choose to have it fight alongside you in subsequent engagements. You'll need a good selection of monsters on your roster if you want to save the world. To catch a monster in LostMagic, you have to beat it to within a pixel of its life and then cast a trap spell in its vicinity. If the trap succeeds, you'll add the monster (a pair or a trio of them, in fact) to your roster, which has room for almost 70 different types. Your mission objectives in LostMagic invariably involve killing all of the monsters on a level, protecting villagers while killing all of the monsters on a level, or killing a bunch of monsters en route to a battle with a rival mage. Sounds simple right? Wrong. Succeeding in many of the game's levels--which are played against some pretty tight time limits--requires not only mad stylus spell-casting skills, but also good strategic thinking and, in many cases, the right monsters at your side. Choosing monsters that are attuned to an element that works well against your enemies is one of the most obvious examples of this, but you'll also find that certain levels are a lot easier if you have minions that can fly, fire projectiles, or move quickly. Furthermore, you'll find items that you can use to buff monsters' abilities as you progress through the game, and these can make a huge difference when used wisely. Controlling all of the monsters under your command is pretty simple. You use the stylus to click on or drag a circle around the monsters that you want to move, and then you touch the area that you want them to move to. Your monsters will engage enemies that come within range automatically, and their only real failing is their complete inability to navigate corners and obstacles without some degree of micromanagement. You start the majority of the battles alongside your chosen monsters, and aside from the monsters that you occasionally leave behind to block up enemy-spawning portals, you can pretty much keep them close for the entire level--healing them with your magic as necessary. Some of the more challenging levels force you to split up your winning team, though, and they even go so far as to start you at opposite ends of the map, which is when having to micromanage your monsters every move gets problematic. For better or for worse, beating levels in LostMagic is often a case of trial and error. You'll have no idea what enemies and objectives are waiting for you the first time you enter a level, so you'll often end up playing them at least twice just so that you have the right monsters at your side. With that said, there are very few levels in the game that are impossible to beat if you're rolling with the wrong crowd--they're just a lot harder. The difficulty level of the game can feel like a rollercoaster at times, but you've always got the option to backtrack to previous battlefields to capture monsters that you need or simply to level up before attempting a difficult level again. Some of the more-powerful spells in the game are quite spectacular. Trial and error also comes into play when you gain the ability to combine multiple spells. You'll be taught a total of 18 different spells (each with its own shape for you to draw) as you progress through the game, and by combining two or even three of these shapes, it's possible to cast far more powerful spells. A simple example of this would be the fireball spell, which is performed simply by drawing an inverted V on the touch screen. Follow that shape with one from another school of magic, and it'll be a completely different projectile that gets hurled at your enemy. There are almost 400 different spells for you to find in LostMagic, and while many of them are variations on the same themes but using different elements, some really are quite spectacular. Fireballs are nice and all, but they're not nearly as cool as being able to summon dragons, turn enemies into walking time bombs, or call meteorites down from the sky--all of which are possible once you figure out the correct spell combinations. In addition to its enjoyable single-player adventure, LostMagic boasts a multiplayer duel mode in which you can pit your skills (and your monsters) against those of other players. If you choose to use the character and monsters that you've collected and leveled up in the single-player game, they'll continue to earn experience on the multiplayer battlefield provided your opponent is of a similar or higher level. Alternatively, the both of you can choose to use preset characters and monsters of the same level, although the majority of these choices can only be selected once you've defeated them in the single-player game. Duels can be played wirelessly with friends nearby or online with other players from all over the world, though we found the two experiences to be quite different. When playing locally, the game was completely lag-free, and although some of our battles ended up being quite tactical, splitting up the group was rarely a winning strategy, regardless of the fact that there are plenty of powerful area-of-effect spells in a mage's arsenal. Roll with the right monsters, and there's no enemy you can't defeat. Without exception, the games of LostMagic that we played online suffered from noticeable lag. After choosing to play against a friend, a rival (player of similar ability), or a completely random opponent, both players will have an opportunity to vote for the map that they'd like to play on, and then the duel to the death plays out in the same way as it does when playing locally--except that it's completely different due to the lag. Fractions of a second can mean the difference between life and death in LostMagic, so playing the game when every spell you cast and move you make is delayed can be an exercise in frustration at times. Playing the game while dealing with lag can feel a bit like chess at times, since you need to think two moves ahead and anticipate your opponent's actions whenever possible. Online play is still fun, but the lag is unfortunate nonetheless. LostMagic, then, is a game that combines some of the best features of action RPGs and real-time strategy games, and then throws a Pokmon-style monster collection and a moves (ok, spells) list that's comparable to those of any fighting game into the mix. The result is a thoroughly enjoyable game that, although not without a few flaws and frustrations, starts well and simply gets deeper and better as you spend more time with it. For better or for worse, beating levels in LostMagic is often a case of trial and error. You'll have no idea what enemies and objectives are waiting for you the first time you enter a level, so you'll often end up playing them at least twice just so that you have the right monsters at your side. With that said, there are very few levels in the game that are impossible to beat if you're rolling with the wrong crowd--they're just a lot harder. The difficulty level of the game can feel like a rollercoaster at times, but you've always got the option to backtrack to previous battlefields to capture monsters that you need or simply to level up before attempting a difficult level again. Some of the more-powerful spells in the game are quite spectacular. Trial and error also comes into play when you gain the ability to combine multiple spells. You'll be taught a total of 18 different spells (each with its own shape for you to draw) as you progress through the game, and by combining two or even three of these shapes, it's possible to cast far more powerful spells. A simple example of this would be the fireball spell, which is performed simply by drawing an inverted V on the touch screen. Follow that shape with one from another school of magic, and it'll be a completely different projectile that gets hurled at your enemy. There are almost 400 different spells for you to find in LostMagic, and while many of them are variations on the same themes but using different elements, some really are quite spectacular. Fireballs are nice and all, but they're not nearly as cool as being able to summon dragons, turn enemies into walking time bombs, or call meteorites down from the sky--all of which are possible once you figure out the correct spell combinations. In addition to its enjoyable single-player adventure, LostMagic boasts a multiplayer duel mode in which you can pit your skills (and your monsters) against those of other players. If you choose to use the character and monsters that you've collected and leveled up in the single-player game, they'll continue to earn experience on the multiplayer battlefield provided your opponent is of a similar or higher level. Alternatively, the both of you can choose to use preset characters and monsters of the same level, although the majority of these choices can only be selected once you've defeated them in the single-player game. Duels can be played wirelessly with friends nearby or online with other players from all over the world, though we found the two experiences to be quite different. When playing locally, the game was completely lag-free, and although some of our battles ended up being quite tactical, splitting up the group was rarely a winning strategy, regardless of the fact that there are plenty of powerful area-of-effect spells in a mage's arsenal. Roll with the right monsters, and there's no enemy you can't defeat. Without exception, the games of LostMagic that we played online suffered from noticeable lag. After choosing to play against a friend, a rival (player of similar ability), or a completely random opponent, both players will have an opportunity to vote for the map that they'd like to play on, and then the duel to the death plays out in the same way as it does when playing locally--except that it's completely different due to the lag. Fractions of a second can mean the difference between life and death in LostMagic, so playing the game when every spell you cast and move you make is delayed can be an exercise in frustration at times. Playing the game while dealing with lag can feel a bit like chess at times, since you need to think two moves ahead and anticipate your opponent's actions whenever possible. Online play is still fun, but the lag is unfortunate nonetheless. LostMagic, then, is a game that combines some of the best features of action RPGs and real-time strategy games, and then throws a Pokmon-style monster collection and a moves (ok, spells) list that's comparable to those of any fighting game into the mix. The result is a thoroughly enjoyable game that, although not without a few flaws and frustrations, starts well and simply gets deeper and better as you spend more time with it."}