{"ref": "https://www.gamespot.com/reviews/super-mario-3d-world-bowsers-fury-review-switch-release-reinvigorates-a-classic/1900-6417639/", "date": "February 10, 2021", "game_name": "Super Mario 3D World", "text": "Super Mario 3D World will be re-released on the Nintendo Switch on February 12, 2021, with a new addition in Bowser's Fury. You can read our review below, or check out what other critics thought in our review roundup. We also have a breakdown of how long it takes to beat and how it works with Amiibo.Super Mario 3D World + Bowser's Fury is a candy confection of fine-tuned platforming that marries some of the best elements of 2D and 3D Mario in two very different ways. The package is mostly a re-release of a Wii U game, but this version upgrades the original with a faster pace and online play, and then adds the experimental and gloriously strange Bowser's Fury on top of it.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Super Mario 3D World + Bowser's Fury Video ReviewThe two experiences are bifurcated to the point where you need to quit out of one completely to start the other. This makes sense--the two share some superficial traits but are otherwise very different design philosophies and platforming approaches. Because of this very split design, though, it only makes sense to examine them as separate games.It's easier to see Super Mario 3D World's place in Mario canon with the benefit of hindsight. It's a successor to Mario Galaxy, not in direct mechanics but in a broader design philosophy. The stages are relatively small, self-contained bouts of creative platforming, often with their own theme or mechanics at the forefront. Each stage is presented as a diorama slice and usually include a limited degree of Z-axis depth, but the core idea between them is the same: Get in, see a clever application of Mario mechanics, then get out before the concept overstays its welcome.The sheer variety of ideas on display in 3D World is its biggest asset. One stage might have you navigating a forest or a battleship, while another will time its rhythmic block switching to a steady beat. The game also frequently pays homage to other pieces of Nintendo history. One stage is essentially a Mario Kart riff, recognizable from its rainbow-colored bumpers and dash pads that speed you along the entire length of ~track.~ Another is clearly modeled after a classic Zelda dungeon, with your Fire Flower power-up serving to ignite lanterns and solve simple puzzles. The game keeps up this regular pace of delightful surprise from start to finish.Super Mario 3D World on Wii U was also the debut of Captain Toad, and it's easy to see why he became a breakout star. His platforming puzzles are cute departures from the main platforming challenges. They feel familiar enough to Mario's standard platforming that it isn't distracting, but Captain Toad's natural pacifism makes for a unique challenge. He can't jump on enemies due to his comically massive backpack, so instead, Captain Toad puzzles become subtle games of timing and patience, manipulating the camera to view the 3D space from all angles and plumbing its depths for treasure.The Captain Toad stages are one key way that 3D World fills your coffers with green stars, a sort of in-game currency for unlocking new stages. Most of the traditional platforming stages have three green stars tucked away in hidden nooks, encouraging exploration or challenging you to hang onto a power-up like the Double Cherry long enough to unlock a gate. Captain Toad stages, by comparison, each have five stars to collect, and finding them all is key to finishing the stage. The world also has occasional time attack stages to finish a gauntlet of mini-bosses or platforming challenges for a total of 10 green stars.The recent Mario trend of gating progress behind collectible doodads can be annoying. But I found that visiting each stage just to see what creative idea is behind every corner gave me more than enough stars to progress normally without needing to backtrack. If you skip over one part of a branching path to get to the next world that much faster, you probably will hit the wall.When revisiting stages, you can add a little variety to the mix by choosing a new character. Mario games don't traditionally let you select alternate characters--Luigi was just a palette swap and the one game most famous for multiple characters, Super Mario Bros. 2, wasn't even originally a Mario game. But Mario 3D World actually does introduce multiple characters, and they're well-differentiated to suit different playstyles or even gameplay goals. Does this stage have a lot of tricky falling platforms? Consider using Peach, who can float right past them. Is this stage particularly vertically-oriented? Luigi's your man, thanks to his fluttery high-jump. Find yourself running out of time? Use Toad, who's extra-speedy.Then again, everyone is extra-speedy in this version of the game. While the original Super Mario 3D World was a great Mario game in its own right, it received some valid criticism that the pace was sometimes languid and unchallenging. That has been tweaked in this version, with all characters getting a noticeable speed boost. It's not enough of a boost to feel like you've lost control, but it does require more finesse and some of the narrower platforming bits can be skill-testing.The other major addition to this version is the online play, which essentially replicates the existing couch co-op for an online environment. Mario co-op is often frenetic as players bump into, lift up, and toss one another around, so what you lose in platforming precision you make up for with chaotic frolics. My time spent in the online mode was more or less the same as playing locally, with only the occasional moment of stutter. Within the context of a multiplayer mode that's mostly just disorderly smack-around fun anyway, this doesn't distract too much.The online mode is a nice but not strictly necessary addition to the core game, which still stands as one of the best Mario games in recent history. That alone would make the package worthwhile, even without an entire second game stacked atop of it.If Super Mario 3D World is classic Mario platforming at its most polished, Bowser's Fury is the series at its most experimental. Whereas 3D World plops you straight into a finely tuned stage where your direction and goals are obvious, Bowser's Fury uses an open-world approach that invites exploration. It's easy to see how this odd side story could be Nintendo toying with new ideas, and while not all of them are quite perfected yet, it's fascinating to see them in this state.In Bowser's Fury, Mario finds himself on a set of small islands as Bowser Jr. begs him to help snap his dad out of some kind of mysterious fury-funk. For some reason, Bowser has grown even more massive in size than usual, and he's seemingly corrupted by the same black tar-like substance that dots the landscape and limits your travel to the other islands. Only by collecting new Cat Shines can you restart the lighthouses that will keep Fury Bowser at bay, clear some of the tar, and open more islands to explore.Bowser's Fury is first and foremost a single-player game, albeit with a constant AI companion in Bowser Jr. A second player can take over for him in couch co-op, but he doesn't have a similar set of skills, so Mario is still the main hero. If you're playing single-player, you can set Bowser Jr. to help a lot, a little, or not at all. The default setting, ~A Little,~ makes him just enough of a presence to remind you that he's there, without stepping on your toes or getting in the way. (I did, admittedly, grumble that he stole my kill when he took out an errant goomba.)And the islands of Lake Lapcat make for a strange setting. Everything is cat-themed, and I do mean everything. The landmarks, the enemies, the lighthouses, even the shrubbery has a touch of feline aesthetic. This gives it some thematic similarity to Super Mario 3D World, which debuted the Cat Bell power-up. In Bowser's Fury, it's like the entire world got one.But that's not the only connection to 3D World. Nearly all of the power-ups make an appearance, and many of the stage elements and platforming pieces are recognizable. It feels like a mash-up of Super Mario Odyssey and Super Mario 3D World, injecting pieces of the latter into the structure of the former. Odyssey was notable for introducing wide-open worlds to explore, and Bowser's Fury expands on that concept in a larger space and with a similar visual style. It even retains Super Mario Odyssey's somewhat radical idea to ditch numbered lives.One major difference from Mario Odyssey, though, is that there is no marketplace to spend your hard-earned coins on new costumes. Instead, the coins interact with a new system, the item bank. Bowser's Fury is an open world, so unlike previous Mario games, you constantly have access to your item bank. If you're mid-challenge and decide you need a Cat Bell or a Fire Flower, just select it and Bowser Jr. will toss it to you. Any other equipped power-up will go back into the bank. Collecting 100 coins banks another random power-up, while dying detracts from your coin total.It's a clever system that works well within this specific context, where the open-world structure means you often need to hot-swap items, and the constant threat of Fury Bowser invites the need for an occasional emergency lifeline. It feels experimental, as if Nintendo is still exploring ways to make coins valuable when numbered lives are becoming anachronistic. Still, it's difficult to tell if this is the kind of experiment that would work outside the narrow parameters of Bowser's Fury and live on in other Mario games.Each of the major and relatively self-contained islands has five Cat Shines to collect, along with others dotted around the landscape. You can catch a ride on Plessie (who is somehow almost omnipresent here) to venture between islands, which you'll need to do a good bit. The flow of Bowser's Fury is venturing to an island, collecting a Cat Shine, and dodging or sheltering from the screen-filling Fury Bowser attacks whenever he awakens on a regular timer. You can wait for him to leave or trigger a lighthouse with a Cat Shine to shoo him away. Then once you've collected enough Cat Shines, you can access a Giga Bell to take part in a kaiju battle as a huge Cat-Suited Mario, complete with a Super Saiyan hair spike straight out of Dragon Ball Z. It is as transcendently ridiculous as it sounds.But more than just a silly boss battle, these segments actually recontextualize the environment that has already been your playground. You might find a tower that you painstakingly climbed only minutes earlier and put it between yourself and Fury Bowser so that he ricochets off of it when he comes at you with a spin attack. The idea lends itself to playing with scale, and seeing the world transformed in this way is a thrill.Your stage goals are outlined when you enter an island's main gate, which is shaped like--you guessed it--a cat. But since you're frequently skipping around to different islands and there are no options to create waypoints, finding your direction isn't as easy and convenient as it should be. And while lots of the goals are enjoyable platforming action, some feel like padding. Each island has a ~Fury Block~ goal, which essentially just means waiting around for Fury Bowser to breathe fire at you and letting it explode the blocks to reveal a Cat Shine. A few times a mother cat is missing her kittens, making for a pretty staid fetch quest. There are enough Cat Shines drifting around to let you complete the game while only engaging with the challenges you want to finish, but getting to 100% will require completing these less enjoyable ones.When you're nearly finished with the main story of Bowser's Fury, the gigantic Bowser becomes a near-constant threat. This is a neat way to add extra menace and urgency as you near the endgame, but it's a double-edged sword. By this point in the game I was running low on Cat Shines that I knew how to locate, and the ones I hadn't grabbed were among the trickiest ones left. So not only was I trying to complete the last few that I had regarded as extra-hard, I also had to do it while dodging Fury Bowser's attacks. I wished at that moment I'd known this difficulty spike was coming, so that I could have tackled some of those harder Cat Shines earlier.Occasional frustrations aside, though, Bowser's Fury is a short-but-sweet and extremely zany curiosity of a game. I actually missed the advent of the item bank when I ventured back into Mario 3D World, showing that at least some of Fury's new ideas have staying power.Put together, Super Mario 3D World + Bowser's Fury is a spectacular package. Super Mario 3D World is an absolute joy of classic platforming excellence, and this is the best version of it thanks to some well-calibrated improvements. Bowser's Fury is peculiar and less polished, but it dares to poke fun at its own oddities and it has a wild creative streak. The two share thematic similarities, but more importantly, they work hand-in-hand to show the full extent of versatility in what a Mario game can be."}