{"ref": "https://www.gamespot.com/reviews/rayman-raving-rabbids-review/1900-6162052/", "date": "December 11, 2006", "game_name": "Rayman Raving Rabbids", "text": "One style of game that seems like it won't be underrepresented on the Wii is the party game, if the Wii's launch lineup is any indication. In Rayman Raving Rabbids, Ubisoft has taken its popular Rayman platformer franchise and turned it into a party game. There is a major single-player component to Raving Rabbids; however, this single-player game doesn't use any of the traditional Rayman gameplay. The entire package consists of different minigames, with many layered throughout the single-player game and also built out into multiplayer. Fortunately, this structure works just fine. The bulk of the game's 70-odd minigames are clever and inventive uses of the Wii's motion-sensing technology, and the game's completely off-the-wall slapstick humor stays fresh and funny all the way through. It could have used more in the way of multiplayer support, but that quibble aside, you'll find plenty of amusement in Raving Rabbids. It might have Rayman in the title, but the real stars of the show are the adorably bizarre raving rabbids. When Raving Rabbids opens, Rayman is having a picnic with some of his globox pals. Suddenly, the happy picnic is interrupted by a violent rumbling. This turns out to be the tunneling of several rabbids--vacant, buck-toothed bunny creatures that apparently want to take over the world. Rayman and the globoxes are kidnapped, and Rayman is forced to entertain the masses of rabbids by performing in gladiatorial combat. Of course, gladiatorial combat in this case means playing a variety of silly, utterly random minigames for hours on end. The premise is a flimsy one, but it's a good-enough way to get you into those dastardly minigames. Every single minigame in Raving Rabbids takes advantage of the Wii's motion-sensing technology in some way or another. Trying to list them all would be an exercise in excess. To toss out a few completely insane examples, one game tasks you to use the remote to draw over an outlined image on the screen, which then creates some kind of food for a hungry rabbid, like a can of sardines, or perhaps a baseball; another is basically a game of whack-a-mole, where several rabbids sit inside multiple bathroom stalls, and you have to repeatedly move the remote pointer back and forth across the screen, shaking the Nunchuk to close the doors as they pop open; yet another is a Dance Dance Revolution-style musical sequence where you use the remote and Nunchuk as drum sticks to hit in time as various dancing bunnies dance onto the stage and hit timed markers; and another still is a hammer-throw minigame where you spin the remote around, while onscreen, Rayman violently spins a cow--not a hammer--around and around, attempting to time the release to hit the playing field and gain as much distance as possible. Suffice it to say, there's a lot of variety to Raving Rabbids' gameplay. Most of these games are short and designed for bite-size chunks of action, and that's largely to the game's credit, since some of the games require more strenuous use of the controller than others. Of course, not every game in the bunch is a winner. Some are arguably too short to be much fun, and others don't use the remote in a particularly precise or intuitive way. These are more aberration than the norm, though, and the majority of the games are at least amusing, if not hilarious. The dancing minigames are some of the best fun you'll have in the game, due in no small part to the totally insane soundtrack. And that seems to be more the focus of Raving Rabbids. As generally fun as the motion controls are, the comedy of the game is what sells it. The rabbids themselves are almost exclusively responsible for this, as they are, without a doubt, hysterical. They're adorably designed, with their dumb stares, high-pitched shrieks, and a penchant for taking comedic bumps. For some reason, they're totally obsessed with plungers and will often use them as a weapon against you. The best parts of the game, both from a gameplay perspective and a comedy perspective, are the first-person rail-shooting missions that take more than a few cues from on-rails light gun games like The House of the Dead and Time Crisis. Each stage is themed after one thing or another, like an Old West ghost town, or a creepy cemetery, and the bunnies often take after these scenes, coming after you with cowboy hats and plunger six-shooters, for example. Or, sometimes, the bunnies just go in totally random directions, like the Splinter Cell-styled bunnies that sneak around, wearing Sam Fisher's token night-vision goggles. All the while, you're guiding an aiming reticle with the remote and firing off plungers at advancing rabbids. You can even grab hold of them if they get too close to you and fling them back at their bunny brethren. These sequences are a great bit of fun, even if they do repeat a few of the same gags a few too many times. In fact, the single-player mode tends to get a bit repetitive when you get into the later stages, because the game starts tossing in variants of the same minigames you've already played. The process of getting through the single-player game also has a very lather-rinse-repeat kind of progression to it. Each segment is broken out into four available minigames, at least three of which you have to complete to unlock the final game, which is usually one of the first-person shooter sequences or a race of some sort. You keep going through these chunks of games over and over again until you've beaten it, and that's about it. That'll take at least a few hours, but once you're done, you probably won't want to go back to it. It's good, then, that the game supports the ability to go back to individual games you are rather fond of, as well as multiplayer. To be clear, not every minigame in Raving Rabbids can be played in simultaneous multiplayer. Many of the games are sequenced multiplayer, where players take turns and try to get the highest score, and others are exclusively for two players. However, the good news is that the ones that do work simultaneously are quite fun when played with friends. Sometimes the directions for the games aren't clear, specifically in explaining how a game differs in multiplayer versus single-player, but this is one of those games where fumbling around like an idiot often leads to inadvertent fun. And it's not like anything this game does is complicated. What do you even say about something like this? The rabbids may be an adorable bunch, but Raving Rabbids' graphics aren't quite as pleasant. They're good enough for what the game tries to do, but for all intents and purposes, this looks like a decent GameCube game. There's no progressive scan support of any kind, the textures and lighting are sort of bland, and we noticed some really ugly scan lines appearing over certain sections of the screen, often where the remote's pointer happened to be moving around. However, on the flip side, Raving Rabbids does have a lot of visual charm, simply because of the character design and the way it's animated. The rabbids are just so bloody adorable, and the way they constantly fall all over the place, run around like screaming lunatics, and generally do silly stuff, it's hard not to fall in love with it all on some level. The game also does some nice stuff with level designs, creating some colorful scenery that backdrops the action nicely. Ultimately, while the game's no technical masterpiece, the style does a lot to make up for those shortcomings. The audio is on a similar level. There's not much that's impressive here, but the cheery in-game music and the rather strange but totally captivating licensed soundtrack (with versions of ~Misirlou,~ ~Girls Just Want to Have Fun,~ and ~La Bamba,~ among others) do a lot to keep things interesting. The totally wacky screams of the rabbids are also oddly amusing. Normally stuff like this comes off as grating, but whoever did the audio for the rabbids totally nailed it. Rayman Raving Rabbids succeeds because it finds creative and very funny ways to make the Wii's motion-sensing technology work for it. It features a nice variety of games to play with, and it stays entertaining thanks to some great humor. Here's hoping the rabbids find their way into many more games in the future."}