{"ref": "https://www.gamespot.com/reviews/the-saga-of-ryzom-review/1900-6111471/", "date": "November 8, 2004", "game_name": "The Saga of Ryzom", "text": "The Saga of Ryzom is the latest unfinished massively multiplayer role-playing game to be inflicted upon gamers. Its unrefined gameplay is too simplistic to have enduring appeal and yet, paradoxically, its character-development system is needlessly complex. While Ryzom may eventually evolve into a more interesting game, right now most of its novel features have yet to be fully implemented, so its gameplay consists almost exclusively of tediously improving character attributes. There's some graphical eye candy in Ryzom, including the convincing water effects. Ryzom was released earlier this year in Europe, so it's surprising that the game is still missing so many promised features. It's set in a colorful, original setting that's thankfully devoid of typical fantasy-world creatures and characters. The setting has an intriguing background plot that involves the humanoid races recovering from being overrun by a horde of marauding Starship Troopers-ish insects called the Kitin. There are four playable humanoid races to choose from, and instead of offering a rigid class-development system, the game allows characters to develop skills in four basic skill groups (combat, magic, harvesting, and crafting). Once your character attains a rudimentary degree of competence in a basic skill group, you gain access to more-specialized and more-powerful skills to develop. For instance, after gaining 20 levels of skill in basic crafting, your character can then develop an additional 30 levels of more-specialized armor crafting or melee-weapon crafting. Choosing to develop one group of skills does not limit your ability to learn the others, so devoted players could eventually develop a character who has fully mastered all available skills. As a result, players tend to develop jack-of-all-trades characters, and there's little incentive to create more than one character, although the developers intend to introduce further differentiation between races. Ryzom's biggest problem is that there really isn't anything to do in the game other than work on improving character stats, and doing so is far more monotonous than engaging. The melee combat looks dull and consists of only simplistic animations and uninspired special attacks such as ~increase accuracy 3.~ Magic combat is more involved, and eventually features some massively damaging area-of-effect spells that are atypical in an MMORPG, but it's initially so badly underpowered that the developers are planning some significant rebalancing. Once engaged in combat, it's generally impossible to retreat, since character movement is slow and angry creatures will pursue you indefinitely unless you trap them on landmarks or lure them to NPC guards. Harvesting is extremely time-consuming and dull, generally taking over a minute to obtain a single resource item, and the special abilities you can acquire to improve your efforts are poorly explained. Crafting is similarly dreary, since you have to acquire a new skill plan for each item you want to craft, and each plan costs three levels' worth of crafting experience points. In other words, after acquiring 10 levels in crafting, your character will likely be able to craft only a couple of pieces of armor and a basic weapon. Player-crafted goods are far superior to any available for purchase from NPCs, but there's no auction or marketplace feature, so you're forced to spam the chat system to buy or sell goods. Characters also have an extremely limited inventory capacity, so it's generally impossible to carry enough resources or crafted items to maintain a decent mercantile lifestyle. There's a rudimentary ecology at work, as predators will attack herbivores they run across. The developers plan to introduce a quest system, but right now you're limited to taking on simplistic tasks, such as killing a particular number of a type of creature or finding a specific resource, and these tasks offer only monetary rewards. Many of the tasks in the tutorial area can't actually be accomplished, since the items you're asked to locate aren't available, or the tasks themselves have broken or buggy scripting. There's actually a disincentive to teaming up with other players to take on tasks, since only the player who lands the killing blow gets credit, even if other team members have the same objective. Even worse, there's no proportionate allocation of experience points in recognition of a character's contribution to a kill. That doesn't matter if all the characters are on the same team, since they'll share the experience-point reward equally, but if they're not teamed up, only the character who ultimately kills the creature gets experience points, which encourages kill stealing. There are other features mentioned in the manual that would help distinguish Ryzom and deepen its gameplay, but they haven't been fully implemented yet. Character mounts are mentioned, but are so far absent. The manual also describes guilds using immense siege weapons to conquer outposts, but those sorts of battles haven't made it into the game yet. To acquire the best resources, characters can team up and protect resource nodes that would otherwise be damaged during harvesting. Aggressively harvesting the best resources is supposed to be discouraged by the risk that the Kami, a magical race, will directly or indirectly intervene to punish such actions. But the Kami don't seem to be able to intervene yet. Probably the most interesting feature of Ryzom is the promise that the insectlike Kitin will likely return in huge raids, and during the first month of the game's North American release the Kitin did attack one race's primary settlement. But such events aren't frequent enough to ensure that players can participate in them, and although Ryzom was designed to facilitate them, the game still suffers from lag issues when a lot is happening onscreen. While it's cool that creatures tend flock together in giant packs, it causes performance issues, as creatures frequently ~slingshot~ around the environment. Ryzom features a colorful array of creatures and environments and some great water effects, but its production values generally seem substandard. The animations are simplistic and choppy, and there are only cursory music and sound effects. Characters are effectively glued to the ground, so they can't pass seemingly minor variations in terrain. The con system--which assesses the relative strength of other creatures--doesn't properly indicate whether a creature is aggressive or not, and gives you only a very broad indication of its difficulty level. You can't practically use the ~take all~ function when looting beasts because their hides ridiculously contain a whole range of pointless items that you can't sell or craft with, and that will quickly encumber your character. There's only a single, sparsely populated North American server, and once you create a profile you can't access the European servers. There are very few character-customization options, and each tweak seems designed to inevitably transform your character into a doppelgnger of Gerard Depardieu. Major towns are large and confusing, but there's a decent automap to help you navigate. The game is also incredibly inaccessible to new players. Aside from referencing missing features, the manual inaccurately describes character attributes and doesn't explain skill functionality at all. In addition to buying special abilities with skill points, you can buy individual components of special abilities, called ~stanzas.~ You can then mix and match positive and negative stanzas to create additional special abilities. While it's a novel mechanic, in practice the functionality variations are quickly adopted by seasoned players, but effectively make it more difficult for less-motivated players to be successful in the game. You're forced to spend an extensive amount of time in the tutorial area to be able to have a reasonable prospect of surviving on the mainland, but the game gives no indication that such is the case. It's extremely difficult to effectively solo on the mainland, particularly as a predominately magic-using character, since the abilities are badly unbalanced and creatures have a tendency to attack in groups. There are also hardware issues with Linksys routers and older ATI video cards, and a persistent bug traps players in the tutorial training areas, requiring you to endure a lengthy reboot. The friendly player community partially compensates for these flaws, and can help new players adjust to the game, but it's difficult to justify enduring Ryzom when there are currently so many better alternatives. In many ways Ryzom seems like a throwback to the first generation of MMORPGs, since it seems to have more in common with the first Asheron's Call than, say, this year's City of Heroes. If some of its more innovative features, such as the Kitin raids and guild quests, ultimately figure more prominently in the gameplay, then Ryzom may merit another look, but currently it's a disappointment."}