{"ref": "https://www.gamespot.com/reviews/icewind-dale-review/1900-2600192/", "date": "July 7, 2000", "game_name": "Icewind Dale", "text": "The highly anticipated sequel to BioWare's hit role-playing game Baldur's Gate is just a few months away, and its publisher, Interplay, released Icewind Dale to tide over role-playing game fans while they wait. But Icewind Dale isn't just a pastime; it's an excellent game in its own right. Though it's based on the Baldur's Gate engine and is also set in the same Advanced Dungeons & Dragons universe, Icewind Dale's originality and fast pacing make the game uniquely satisfying. Icewind Dale is self-consciously similar to Baldur's Gate: Both games take place in the Forgotten Realms, and Icewind Dale recycles not only Baldur's Gate's engine but also a good deal of the older game's graphics. Specifically, your six player characters are represented with the same small, animated sprites from BioWare's older game, and you might quickly recognize a lot of the equipment that was carried over. Otherwise, Icewind Dale is a good-looking game that has an especially noteworthy original symphonic soundtrack by composer Jeremy Soule. The sweeping score seems to lend purpose to everything that goes on in the game. Icewind Dale also uses an effective storytelling technique in which the game's six chapters are broken down into narrated cinematic sequences detailing the game's events as chapters in a beautifully illustrated tome. Unfortunately, some of the player-character voices sound really bad, especially compared with the rest of the spoken dialogue in the game: Icewind Dale features many exceptional voice-acting performances for the game's major nonplayer characters. The game's main villain is especially memorable. Aside from its contextual similarity, Icewind Dale actually has little in common with Baldur's Gate. You'll rarely if ever get caught up in solving various puzzles or finding miscellaneous trinkets for townspeople. Instead, you'll fight monsters, find powerful artifacts, and explore some very interesting environments. Over the course of the game, you'll fight huge quantities of an even greater variety of different creatures. Your small squad of characters will gradually grow from mere weaklings into stupendously powerful warriors and magic users, and the game is deftly balanced so that you never advance too quickly or too slowly, but are always well prepared for the challenges that lie ahead. Several species of classic AD&D monsters that didn't appear in Baldur's Gate, such as trolls, umber hulks, and giants, are just a few of the many different foes you'll face over the course of Icewind Dale's epic quest. The game is suitably long, but the best part is that there's virtually never a dull moment: Each area in the game is exciting to explore, like the city nestled in the warmth of a huge life-giving oak, or the frozen subterranean aquarium. In spite of its generally fast pacing, Icewind Dale gets off to a slow start. You begin by creating six characters from scratch, using standard second-edition AD&D race and class combinations. You must come up with a well-balanced team that can dish out damage as well as take it, and also be able to adapt to new types of situations. Creating your characters is a laborious process, as you not only need to randomly roll up and redistribute your attribute points, but you also need to choose the character's weapon proficiencies, his portrait, and even his voice. Like Baldur's Gate, Icewind Dale lets you import your own pictures and sounds into the game, and it even lets you write your character's biography if you so choose. However, it's unfortunate that there's no way to get some guidance during the crucial character-creation phase; the game instead assumes you have an intimate familiarity with the nuances of the AD&D class system, though it does let you import a few basic pre-generated characters into your party if you'd rather get started more quickly. The game's isometric perspective is identical to that in Baldur's Gate, but the view angle isn't as close to the characters as in the more recent Planescape: Torment, which also used BioWare's Infinity engine. Like both previous Infinity engine games, exploration in Icewind Dale uses an interface that seems better suited to real-time strategy games: You just select your characters and click where you want them to move. Each area in the game lies shrouded in a fog of war until you pass your characters through, revealing the terrain beneath. Icewind Dale doesn't let you play at a resolution higher than the default 640x480, and though the game has an unsupported 3D-accelerated mode, all it seems to do is make the fog of war look a little smoother on the edges. Furthermore, inventory management in Icewind Dale remains identical to that in Baldur's Gate and Torment so that each character is restricted both by encumbrance and also by having room for only a small number of individual items. Later in the game, it can get frustrating trying to find room for anything else to carry just because Icewind Dale treats a magic ring or a gemstone as being the same size as a battle-ax or a suit of armor.The game also sometimes suffers from bad pathfinding; your characters will inevitably split up when you try to make them negotiate the game's many corridors. It's problematic, but if you've played an Infinity engine game before, then chances are you're already used to putting up with it. Fortunately, it's true that while your characters can't run in Icewind Dale, they do move appreciably faster than in Baldur's Gate, but otherwise, the Infinity engine hasn't undergone any significant enhancements to make it better suited for its particular genre. At least Icewind Dale carries over the multiplayer functionality of Baldur's Gate, so you can play the game with up to six people if you can coordinate all the players to work together. As with both Planescape: Torment and Baldur's Gate, the limitations of the game engine don't keep Icewind Dale from being a great, original game. In fact, the game's emphasis on combat actually helps a lot of the features in Infinity engine games, like squad formations and fog of war, make more sense. Though the game plays in real time, you have the ability to pause play and reissue move and attack orders at any point, which lets you readily adapt to the changing conditions of battle. Frequently having to pause play might at first seem to disrupt the flow of the game, but you can effectively use the feature to retreat injured party members at the last possible moment, cast certain spells in a pinch, and switch from ranged to melee weapons without delay. Icewind Dale also has an automatic-pause option that simulates turn-based combat by stopping the action in between each short round of battle. In general, no matter how you play it, the combat in Icewind Dale provides a good combination of gory action and interesting tactical opportunity. Since your characters go from first level all the way into their teen levels over the course of the game - a range that's well beyond the scope of most AD&D-based computer games to date - you'll continuously revise your battle tactics as your party increases in power. Icewind Dale does suffer from a few problems besides the inherent shortcomings of the aging Infinity engine. Although the game doesn't have too many side quests and generally keeps you focused on a particular goal, it does occasionally run into trouble whenever it becomes more open-ended. There are several scripting bugs that may crash the game if you don't do things in the same order the designers intended; you can get into nonsensical dialogue loops with many of the game's nonplayer characters; and the automatic journal-entry feature produces too many convoluted or contradictory entries for it to be useful. Also, the game's handful of puzzles can be frustrating to solve and can slow the game's otherwise brisk pace. Since most of the game's combat sequences are scripted, enemy creatures will attack only once you've triggered them by approaching close enough. Thus you'll find that the game holds few surprises the second time around and also that it's easy to lure just a few enemies at a time in many situations. Furthermore, your characters' moral alignments don't seem to play any part in the game, except to limit them from using certain powerful artifacts - and similarly, your six characters will never actually interact with one another. Although Icewind Dale's gameplay is combat-intensive, the game's interesting story will make you wish your individual characters played a larger role in it. Ultimately, its story makes Icewind Dale all the more satisfying, and its exciting action makes its occasional problems negligible. There's always a purpose behind all the hacking and slashing, which makes the gameplay seem rewarding and challenging, rather than like a cheap thrill. In this sense, Icewind Dale is surprisingly effective, much like Planescape: Torment managed to be impressive largely on account of its involving plot. Likewise, Icewind Dale proves to be another great addition to Black Isle Studios' roster of high-quality role-playing games. It's well suited for fans of Black Isle Studios' previous games, fans of classic hack-and-slash AD&D computer games, and anyone looking for an action-packed role-playing game with a lot of depth.The game also sometimes suffers from bad pathfinding; your characters will inevitably split up when you try to make them negotiate the game's many corridors. It's problematic, but if you've played an Infinity engine game before, then chances are you're already used to putting up with it. Fortunately, it's true that while your characters can't run in Icewind Dale, they do move appreciably faster than in Baldur's Gate, but otherwise, the Infinity engine hasn't undergone any significant enhancements to make it better suited for its particular genre. At least Icewind Dale carries over the multiplayer functionality of Baldur's Gate, so you can play the game with up to six people if you can coordinate all the players to work together. As with both Planescape: Torment and Baldur's Gate, the limitations of the game engine don't keep Icewind Dale from being a great, original game. In fact, the game's emphasis on combat actually helps a lot of the features in Infinity engine games, like squad formations and fog of war, make more sense. Though the game plays in real time, you have the ability to pause play and reissue move and attack orders at any point, which lets you readily adapt to the changing conditions of battle. Frequently having to pause play might at first seem to disrupt the flow of the game, but you can effectively use the feature to retreat injured party members at the last possible moment, cast certain spells in a pinch, and switch from ranged to melee weapons without delay. Icewind Dale also has an automatic-pause option that simulates turn-based combat by stopping the action in between each short round of battle. In general, no matter how you play it, the combat in Icewind Dale provides a good combination of gory action and interesting tactical opportunity. Since your characters go from first level all the way into their teen levels over the course of the game - a range that's well beyond the scope of most AD&D-based computer games to date - you'll continuously revise your battle tactics as your party increases in power. Icewind Dale does suffer from a few problems besides the inherent shortcomings of the aging Infinity engine. Although the game doesn't have too many side quests and generally keeps you focused on a particular goal, it does occasionally run into trouble whenever it becomes more open-ended. There are several scripting bugs that may crash the game if you don't do things in the same order the designers intended; you can get into nonsensical dialogue loops with many of the game's nonplayer characters; and the automatic journal-entry feature produces too many convoluted or contradictory entries for it to be useful. Also, the game's handful of puzzles can be frustrating to solve and can slow the game's otherwise brisk pace. Since most of the game's combat sequences are scripted, enemy creatures will attack only once you've triggered them by approaching close enough. Thus you'll find that the game holds few surprises the second time around and also that it's easy to lure just a few enemies at a time in many situations. Furthermore, your characters' moral alignments don't seem to play any part in the game, except to limit them from using certain powerful artifacts - and similarly, your six characters will never actually interact with one another. Although Icewind Dale's gameplay is combat-intensive, the game's interesting story will make you wish your individual characters played a larger role in it. Ultimately, its story makes Icewind Dale all the more satisfying, and its exciting action makes its occasional problems negligible. There's always a purpose behind all the hacking and slashing, which makes the gameplay seem rewarding and challenging, rather than like a cheap thrill. In this sense, Icewind Dale is surprisingly effective, much like Planescape: Torment managed to be impressive largely on account of its involving plot. Likewise, Icewind Dale proves to be another great addition to Black Isle Studios' roster of high-quality role-playing games. It's well suited for fans of Black Isle Studios' previous games, fans of classic hack-and-slash AD&D computer games, and anyone looking for an action-packed role-playing game with a lot of depth."}