{"ref": "https://www.gamespot.com/reviews/dynasty-warriors-5-review/1900-6133034/", "date": "September 12, 2005", "game_name": "Dynasty Warriors 5", "text": "There are exactly two things you can count on in this world: one, you're going to die someday, and two, there will always, and we mean always, be a new Dynasty Warriors game each and every year. Koei's 800-pound gorilla of a game franchise continues to come back time and time again, making just enough slight changes to the overall framework of the gameplay to please the series' fan base. However, while that's managed to work well enough over the years, with the fifth official entry in the series (not counting all the Xtreme Legends and other spin-offs), the Dynasty Warriors brand is showing its age. The simplistic beat-'em-up gameplay, while marginally adjusted, simply isn't cutting it quite the way it used to. This sequel actually lacks features found in the Xtreme Legends and Empires versions of Dynasty Warriors 4, which ultimately leaves it feeling a bit lackluster overall. Not to mention that this Xbox release of the game comes six months after the PlayStation 2 version and contains little, if any, bonus content worth getting excited over. Ancient China? Check. Crazy-costumed Chinese warriors? Check. Goofy dialogue? Check. Hundreds of bad guys to stab? Check. Ladies and gentlemen, looks like we've got ourselves a new Dynasty Warriors game. Odds are you already know what Dynasty Warriors is all about. But, for the sake of those who haven't been following along over the last few years, here's all you need to know. The setting is ancient China, the playable characters are a veritable ensemble cast of legendary Chinese warriors (dressed up in fancy-pants, anime-inspired costumes), and the gameplay pretty much consists of you cutting your way through hundreds upon hundreds of enemies. That's how it's been for years now, and DW5 is absolutely no different. There are 48 playable characters in the game (most of which have to be unlocked, and six of which are totally new to the series), and they're all based on some figure from the war-torn period from Chinese history in which Dynasty Warriors lives year-round. Each character has his or her own individual storyline, though that story mostly consists of a lot of bad voice-overs set against static images of your character, with occasional CG cutscenes thrown in for good measure. The actual stories are rarely that interesting, and they act more like exaggerated history lessons than anything else, with a splash of goofy existential dialogue added for extra flavor. The meat of the gameplay comes from the musou mode, which is basically the story mode. With 48 different characters to play, that's a whole lot of game, especially since each story often takes a couple of hours to complete, at least. However, while there's certainly a lot of meat, there's really not much variety to speak of at all. This is the exact gameplay engine that fans of the series have come to know over the years. You've still got one main weapon, you still run at hordes and hordes of bad guys, and you still stab them repeatedly and then move on to the next section. The whole point of the Dynasty Warriors games is to sort of make you feel like a one-man army, like you're the most insanely overpowered warrior in the world. In that sense, Dynasty Warriors 5 succeeds, as there are more guys onscreen than ever before, and you can get into some severely thick battles as you play. But, the problem is that it wears thin quickly. Though you can pick up a few upgraded weapons and pull off a few different combo attacks for each character, ultimately, you're just hitting the same attacks over and over and beating up a whole lot of enemies for hours at a time. It's fun for a while, but it becomes taxing very quickly, especially if you've already played previous entries in the series. A few little changes have been made to the gameplay here and there. For instance, the bodyguard system has been overhauled. No longer do you just get a couple of random guys standing around you who barely take part in the action. Now you get one bodyguard, who actually isn't afraid to mix it up with any would-be attackers that come your way. Plus, there are times when you can combine special attacks into one fairly brutal attack, which is pretty cool. Another change isn't actually a change, really, but a carryover from Dynasty Warriors 4: Empires. This is the stronghold system that debuted in that game, where on a given battlefield, each side has several bases and checkpoints that can be taken over by killing the base's commander. Capturing these bases boosts your side's morale, which is helpful during battle. While having the stronghold system is nice, it's more than a little depressing that a lot of the strategy elements from Empires aren't found here. Namely, the empire mode itself is absent. While one could probably assume that this is because Koei is probably planning an Empires version of Dynasty Warriors 5 for the future, it's pretty disappointing to have experienced such an enjoyable step forward for the series, only to have it taken away in the follow-up, especially considering how much depth the empire mode added to the series' formula. Granted, Empires was never released on the Xbox, but even still, that doesn't make the omission of the Empires mode any less disappointing for this sequel. Apart from the story mode, there are a couple of other modes in Dynasty Warriors 5, the primary of which is the challenge mode. Here, you can engage in a number of minigames, like a time attack, a rampage mode, and a new game called bridge melee, where your goal simply is to knock as many enemies as you can off of a bridge within a certain time frame. Each of these games amounts to an amusing distraction, but there's not a lot of reason to keep coming back to them. There's also an encyclopedia where you can look up some fairly brief info on the various officers and battles contained in the game, as well as a free mode where you can just pick a battle and jump right in. Not exactly the most exciting of features, but nice to have around, nonetheless. As far as presentation goes, Dynasty Warriors 5 might as well be any of the last few games in the series, as its graphics and sound are practically identical to them. The game still runs at an excellent frame rate, despite there being about a billion guys onscreen at once, and the characters are just as garish and over the top as ever. Conversely, the environments still look fairly bland, the animation has little to offer in the way of variety, and there's still a decent amount of fog over everything off in the distance (though that has been lessened, somewhat, compared with the last few games). The Xbox version of the game is a minimal upgrade over the PS2 version, with slightly cleaner-looking models and just-as-ugly-looking environments. While one can hardly fault Koei for sticking with a successful formula, the formula feels more like old hat at this point. The audio is just as goofy as it's ever been, with the same Satriani-inspired guitar solos mixed with Chinese flutes and strings making up the soundtrack, along with plenty of ham-fisted, goofball voice acting. You'd think that with how popular this series has become, Koei might go out on a limb and spring for some better voice actors. Incidentally, all the new content to be found in Dynasty Warriors 5 comes in the audio category. Dolby Digital surround sound has been included, as has the original Japanese dialogue. The surround audio is a nice touch, but the Japanese dialogue seems somewhat badly mixed and requires some audio-setting tweaking before it can be fully enjoyed. Dynasty Warriors 5 is a game that feels like dj vu all over again. While diehard fans of the series will probably once again enjoy being able to slice their way through all the same battles once again, even they may be disappointed at the removal of the empire mode, which is seemingly for no good reason, save perhaps to add it back in for another Empires spin-off. As for the non-diehard fans, the core gameplay here will be all too familiar, even with the scant few changes that have been made. And odds are you'll simply grow tired of grinding through the same battles yet again, with only a half-baked storyline to keep you interested. Plus, if you already got your hands on the PS2 version of the game, the Xbox port offers nothing of substance to make you want to run out and grab this one too. Ultimately, this version feels like too little, too late."}