{"ref": "https://www.gamespot.com/reviews/svc-chaos-snk-vs-capcom-review/1900-6110244/", "date": "October 11, 2004", "game_name": "SVC Chaos: SNK vs. Capcom", "text": "An incredible Who's Who of fighting game superstars is largely squandered on SVC Chaos for the Xbox, which is an Xbox Live-enabled port of a NeoGeo fighting game. Much like the Capcom-developed Capcom vs. SNK games, SVC Chaos combines tons of different characters from each publisher's respective decades-old fighting game franchises, and lets them (and you) have at it in traditional one-on-one martial arts matches. The results really should have been great, especially since SNK really tends to do a much better job of putting together fast-paced, responsive, and complex fighting action than what's on display here. Diehard fans of some of these characters will find some redeeming value in this game just from seeing some of their old favorites with updated appearances and voices, but even they won't escape disappointment. Not only does SVC Chaos simply not play particularly well by the standards of 2D fighting games, but also the game's implementation of Xbox Live support is flawed. SVC Chaos features an excellent cast of characters, but its gameplay doesn't live up to them. The main problem with the Live support is that you can't choose to have a rematch against the other player once a fight is over. That means, as soon as you win or lose, you're first awkwardly prompted either to save a replay of the match or not, and then you're unceremoniously dropped at the Xbox Live main menu, where you can choose from the standard quick match and optimatch features all over again. Finding an opponent via quick match or optimatch really doesn't take that long, but the inability to easily continue playing against the same opponent after one match seems like a huge oversight. It's frustrating, especially since the handful of other online-enabled Xbox Live fighting games all conveniently let you rematch your opponent. Fortunately, there's the option to enter into a player lobby, in which you can invite and then subsequently reinvite players for a match. This is the best way to quickly play some bouts. Online play itself is functional, though the action is vulnerable to lag, which causes the controls (even on the character select screen) to sometimes feel finicky and unresponsive. For what it's worth, there are a few decent options available when playing online, such as limiting the roster of characters only to the Capcom or SNK side, or preventing the use of some of the game's more powerful ~hidden~ characters (guys like Shin Akuma and SVC Chaos' very own ~Violent Ken~--they normally appear on the character select screen when you press and hold the right shoulder button). And, despite the problems with the Live functionality and in the actual gameplay, SVC Chaos can still be pretty fun if you find yourself pitted against a similarly skilled opponent. Nevertheless, the sorts of longtime fighting game fans who'd be interested in this game will be quick to pick up on the flaws in the fighting mechanics. Simply put, the game feels rushed. The fundamentals of any good fighting game--namely, the collision detection, which is to say, the stuff that happens when one character hits another character--just aren't very well implemented in SVC Chaos. Punches and kicks may look good in still frames but they just have a sloppy feel to them in practice. There's little feedback to differentiate between whether you've completely whiffed an attack, hit the opponent, or had the attack blocked by the opponent. Attacks in the game just don't have any weight to them--something that's most readily apparent and disappointing as when you finish off an opponent with a powerful special move of some sort, only to see him or her flop down to the ground without any kind of flash or drama. It's just like any other knockdown during the course of a match. So, there's no satisfaction to be found in finishing off an opponent with flair. In fact, ironically, ending a fight with just a simple jab tends to be much more impressive than doing it with a stronger move, because at least that way there's a special ~slump to the ground~ animation that you'll get to see. The action has a flat, unrefined feel to it. As mentioned, SVC Chaos' cast of characters is obviously the main attraction, although little care seems to have been given to ensure that the fighters were appropriately balanced. However, the usual suspects are here, including Street Fighter's Ryu, Ken, Chun-Li, and Guile, and King of Fighters' Kyo and Iori, and Fatal Fury's Terry and Mai. Some surprising additions include Samurai Shodown II's Genjuro and DarkStalkers' Demitri, as well as King of Fighters' Athena, who is seen in her goddess outfit from the original 1986 arcade game in which she appeared. The nearly three dozen different characters in the game ultimately comprise an exciting selection of fighters, but, in another of the game's rather glaring omissions, there are very few grappler-type characters--there's really only one. Where are Street Fighter's Zangief and King of Fighters' Goro? Actually, you might suspect that the absence of grapplers has more to do with the limitations of the combat system rather than with a mere oversight. Throws are just one of the aspects of play that are awkwardly handled by SVC Chaos. In theory, the fighting system here is good, even if it is a by-the-numbers system. The various characters each have his or her own variety of special moves and supermoves, as well as normal punches and kicks. The game uses SNK's King of Fighters' time-honored control scheme of four primary attack buttons: weak and strong punches and kicks. Using these buttons in conjunction with different directional pad motions lets you access more normal moves than you'd expect, so if you're used to Capcom's six-button gameplay, you'll find an equivalent number of moves per character in SVC Chaos. As is now conventional in 2D fighting games, as you fight during a round, you build up a supermeter that either lets you dish out some ultradamaging, high-priority moves, or lets you execute a few other techniques, including guard cancels (moves that let you pass straight through an opponent's attack and counter with your own). At any rate, the game basically plays OK, if just barely; the controls are responsive, for instance. You'll just wish that the whole thing felt more solid, instead of all flimsy and ramshackle. Xbox Live support doesn't make the game's problems any easier to overlook, and the Live support itself is flawed. SVC Chaos is very bare bones for a full-priced product (though, arguably, it's a steal for NeoGeo fans used to paying $300 or more for cartridges). Apart from the addition of Xbox Live features, there are your conventional modes of play to look forward to: an arcade mode, a versus mode for two players, a practice mode, and a survival mode. Survival mode is nice in that you gain back health after each match based on the type of move you used to finish the match, and it's also the key to unlocking the game's small smattering of gallery artwork, which is nice artwork, mind you. There's also a color edit mode similar to the one in Capcom vs. SNK 2. And, of course, you can watch all those replays you'll save while wishing the ~save replay~ screen on Xbox Live instead prompted you for a rematch. The game's arcade mode has some nice touches. All the different combinations of characters in SVC Chaos exchange a few lines of dialogue before a fight, and fans of these different characters should generally enjoy those exchanges as well as the endings for each character. Arcade mode can be quite difficult toward the end, since the computer fights with the inhuman precision of a computer, and it will mostly only be susceptible to cheap patterns and exploits at higher levels. This is nothing new for a 2D fighting game, but it doesn't help make the game any more entertaining when playing solo. When you're beaten, at least you have the option to try the fight again with the opponent at one-third of his or her strength (among a couple of other options), as if playing the game is just a formality for seeing the endings. Could be worse--you could've paid $300 for this. SVC Chaos looks like a NeoGeo fighting game, and the venerable NeoGeo hardware is about 15 years old now, so don't expect to be dazzled by the visuals here. In fact, if you're a fan of SNK fighting games, then don't expect to see a ton of new graphics. All of the returning SNK characters' sprites are recycled from previous games. Geese Howard and Goenitz date way back to 1996, though, to make up for it, at least many of the Capcom fighters have been redrawn. It's nice to see old guys like Guile and Sagat at least looking different for a change, although thanks to the sketchy collision detection, none of the characters or combat look all that great in motion. Of further note, SVC Chaos' glaringly off-tune and annoying musical score is only marginally offset by weak sound effects and spotty voice work. Some of the characters' voices are inappropriately loud and obnoxious, and characters tend to say something even when just executing normal punches or kicks. That is to say, the audio aspect of the game is what puts the ~chaos~ in SVC Chaos. Even the most hardcore fans of SNK's fighting games (or Capcom's, for that matter) would still be quick to admit that the company has had its ups and downs over the many years in which it has refined this particular genre. Unfortunately, SVC is decidedly one of the downs. It's a shame that one of SNK's first forays onto the Xbox--and its first attempts at taking its fighting games online--is with a game that's decidedly below par, and yet still somehow promising. In theory, the fighting system here is good, even if it is a by-the-numbers system. The various characters each have his or her own variety of special moves and supermoves, as well as normal punches and kicks. The game uses SNK's King of Fighters' time-honored control scheme of four primary attack buttons: weak and strong punches and kicks. Using these buttons in conjunction with different directional pad motions lets you access more normal moves than you'd expect, so if you're used to Capcom's six-button gameplay, you'll find an equivalent number of moves per character in SVC Chaos. As is now conventional in 2D fighting games, as you fight during a round, you build up a supermeter that either lets you dish out some ultradamaging, high-priority moves, or lets you execute a few other techniques, including guard cancels (moves that let you pass straight through an opponent's attack and counter with your own). At any rate, the game basically plays OK, if just barely; the controls are responsive, for instance. You'll just wish that the whole thing felt more solid, instead of all flimsy and ramshackle. Xbox Live support doesn't make the game's problems any easier to overlook, and the Live support itself is flawed. SVC Chaos is very bare bones for a full-priced product (though, arguably, it's a steal for NeoGeo fans used to paying $300 or more for cartridges). Apart from the addition of Xbox Live features, there are your conventional modes of play to look forward to: an arcade mode, a versus mode for two players, a practice mode, and a survival mode. Survival mode is nice in that you gain back health after each match based on the type of move you used to finish the match, and it's also the key to unlocking the game's small smattering of gallery artwork, which is nice artwork, mind you. There's also a color edit mode similar to the one in Capcom vs. SNK 2. And, of course, you can watch all those replays you'll save while wishing the ~save replay~ screen on Xbox Live instead prompted you for a rematch. The game's arcade mode has some nice touches. All the different combinations of characters in SVC Chaos exchange a few lines of dialogue before a fight, and fans of these different characters should generally enjoy those exchanges as well as the endings for each character. Arcade mode can be quite difficult toward the end, since the computer fights with the inhuman precision of a computer, and it will mostly only be susceptible to cheap patterns and exploits at higher levels. This is nothing new for a 2D fighting game, but it doesn't help make the game any more entertaining when playing solo. When you're beaten, at least you have the option to try the fight again with the opponent at one-third of his or her strength (among a couple of other options), as if playing the game is just a formality for seeing the endings. Could be worse--you could've paid $300 for this. SVC Chaos looks like a NeoGeo fighting game, and the venerable NeoGeo hardware is about 15 years old now, so don't expect to be dazzled by the visuals here. In fact, if you're a fan of SNK fighting games, then don't expect to see a ton of new graphics. All of the returning SNK characters' sprites are recycled from previous games. Geese Howard and Goenitz date way back to 1996, though, to make up for it, at least many of the Capcom fighters have been redrawn. It's nice to see old guys like Guile and Sagat at least looking different for a change, although thanks to the sketchy collision detection, none of the characters or combat look all that great in motion. Of further note, SVC Chaos' glaringly off-tune and annoying musical score is only marginally offset by weak sound effects and spotty voice work. Some of the characters' voices are inappropriately loud and obnoxious, and characters tend to say something even when just executing normal punches or kicks. That is to say, the audio aspect of the game is what puts the ~chaos~ in SVC Chaos. Even the most hardcore fans of SNK's fighting games (or Capcom's, for that matter) would still be quick to admit that the company has had its ups and downs over the many years in which it has refined this particular genre. Unfortunately, SVC is decidedly one of the downs. It's a shame that one of SNK's first forays onto the Xbox--and its first attempts at taking its fighting games online--is with a game that's decidedly below par, and yet still somehow promising."}