{"ref": "https://www.gamespot.com/reviews/turok-dinosaur-hunter-review/1900-2535197/", "date": "May 2, 2000", "game_name": "Turok: Dinosaur Hunter", "text": "When Turok came out for the N64, it was met with mixed opinions. While fans of first-person action games championed Turok as a game innovative in its class, many were up in arms about the game's over-the-top bloodshed, causing certain stores to embargo the cartridge. Either way, playing Iguana Entertainment's violent masterpiece - with its flashy arsenal of weapons and lifelike cretins - is a technically arresting adventure. Acclaim's latest PC version of Turok is no exception, though some of the gameplay criticisms originally fired at its Nintendo cousin still apply.To mimic the N64's SGI level graphics, Turok PC requires a Direct3D-compatible accelerator. Once that's in place, the Nintendo's smooth-edged graphics give way to sharper, faster shapes and colors on your video monitor: Slinky raptors charge up and gnash their hideous teeth; underworld assassins aim blow darts and fire in unison; mounted triceratops emerge from the mist to attack. Using a 3Dfx chipset, Turok's environments really come alive on the PC - with the exception of the occasional slowdown caused by an overpopulation of baddies on the screen.There is no multiplayer option in Turok PC: You are on an eight-level single-player adventure to collect the pieces of the Chronoscepter, a weapon so powerful that it has captured the interest of an evil overlord who plans to use it to rule the world. Between your trusty tek bow and the Chronoscepter there lies an extensive trail of unusual weapons: a whirring, portable Gatling gun; a launcher that sends four rockets trailing into the horizon; and finally, the end-all-be-all hand cannon that releases a brilliant fuchsia apocalypse in a single shot. When critically hit, soldiers and creatures grab their throats to stop an outpouring of blood, some diving back onto the ground to writhe around and yelp in their last throes of death. If you're into guns and graphic violence, Turok is sure to keep you entertained for hours. But when those hours are up, you may find that the game seldom rises above the monotony of simply running and shooting.Many will be disappointed that Turok PC still utilizes the ~save stations~ from the N64, and does not permit saving your game at any chosen point. But Turok does allow you customized mouse and keyboard configurations as in Doom or Quake. Compared with those classics, Turok seems to make up for its flat progression of events with graphics that are as engaging as they are spellbinding, but whether or not Acclaim's dinosaur can compete with the latest wave of accelerated PC shooters remains to be seen."}