{"ref": "https://www.gamespot.com/reviews/turning-point-fall-of-liberty-review/1900-6187661/", "date": "March 12, 2008", "game_name": "Turning Point: Fall of Liberty", "text": "Turning Point: Fall of Liberty is a perfect example of how a great concept doesn't always make for a great game. In this case, the concept is Turning Point's intriguing premise: Without the voice of Winston Churchill to rally Allied forces, Hitler's Nazi regime spreads like wildfire across Europe and Africa, eventually staging an all-out assault on the United States. It doesn't take long to realize that Turning Point makes almost no use of this potential. The result is a shooter that fluctuates between mediocre and disastrously buggy. For a game that relies so heavily on the backdrop, it's remarkable how little it does with the actual story. Turning Point begins with your character working on the girders of an unfinished skyscraper in New York City as the Luftwaffe comes swarming into view. The fact that your character works construction is one of exactly two things you learn about him through the course of the game (the other being his name, Carson). That's as much character progression as you'll find. The plot itself can hardly be considered robust, either. We know the Nazis have exerted their control over the presidency and that some level of resistance is fighting through the invasion, but that's more or less it. There are no real examples of life under Nazi power and no memorable characters to share in the struggle. Powerful set pieces like this one are a rare treat. While the story fails to do much with the game's premise, the setting of this alternate history has a few breakthrough moments. A handful of set pieces do a good job of stirring your emotions. The first few minutes of the game are fairly nerve-wracking as you race down the aforementioned skyscraper while German airships litter the sky. There's also one scene where you're stationed on a turret gun fighting back several waves of soldiers as the top of the Chrysler Building lies in ruins before you. However, these powerful moments are the exception rather than the rule. Most of the time, you're running through nondescript buildings or underground corridors. It's much too easy to forget you're fighting Nazis on American soil (and in London, toward the end of the game). For the most part, it feels like Turning Point could be any old World War II shooter, albeit with weapons that never made it into production. The combat fails to pick up the slack, because it's simply a poor imitation of the Call of Duty series. You can switch between two weapons and grenades as you run through linear levels, with most of the action dependent on using the iron sights to take out a room full of enemies. A major problem is that the targeting isn't very reliable, because the gun takes up so much of the screen. This often leaves you guessing where an enemy is before shooting. Even if you do guess correctly, you're usually punished by a wildly inconsistent hit-detection system that can't tell the difference between a headshot and a bullet to the leg. There's a melee system that's almost entirely useless throughout most of the game, but occasionally you'll happen upon an unlucky enemy that can be taken out with an environmental-based melee attack. Some are predictable, like throwing an enemy from a ledge, but some will have you laughing out loud, like forcing a soldier's head down a toilet after finding them using the bathroom. . A variety of odd design choices and technical problems further mar the game's combat. Enemies aren't the least bit intimidating due to their predictable AI and cartoonlike running animations. When the game tries to compensate by ballooning the number of Nazis in your path, the frame rate takes a very severe nosedive--something that also happens in nearly every scripted destruction sequence, like walls collapsing. There are a variety of other problems that range from the comical (enemy corpses fall through walls, but their guns become stuck halfway through) to the infuriating (squadmates stand in your way in narrow corridors and refuse to move). All of this is compounded by a stingy checkpoint system that forces you to experience these flaws several times over. Turning Point's presentation offers one notable high point. The sound effects are good, but the music is fantastic. It's a grand, orchestral score that expertly recalls 1940s-era Hollywood. The music does its best to add a little extra excitement to the action-packed moments while also lending tension to the slower, more subdued sections of the game. Unfortunately, much of that is canceled out by the game's poor visuals. You'll often see a blurry surface texture and assume it'll snap into clarity once it's loaded, but as you approach it you'll come to realize that it's not getting any better. The PS3 version looks slightly better than the Xbox 360 game, but it's still far from impressive. Visuals aside there really isn't much to differentiate the two console versions of Turning Point: Fall of Liberty, though the Xbox 360 game benefits from some genuinely amusing achievements. They might not be original, but environmental kills are often good for a laugh. After finishing the brief and uninspiring campaign, there's little temptation to try the multiplayer mode. If you choose to avoid it, you won't be missing much. The same gameplay woes that plague the campaign are here in the deathmatch and team deathmatch modes, which support a meager eight players. Multiplayer doesn't add a lot to the overall experience, in the same way that the campaign doesn't build upon the overall premise. This theme of missed opportunity is a consistent one throughout Turning Point. What could have been a refreshing twist on the World War II genre instead is a lesson on how not to implement an interesting concept."}