{"ref": "https://www.gamespot.com/reviews/dragon-warrior-vii-review/1900-2826206/", "date": "November 20, 2001", "game_name": "Dragon Quest VII: Fragments of the Forgotten Past", "text": "As video game systems age, developers usually get better at coming up with new graphical tricks or cranking the last little bit of performance out of the hardware. So it's surprising to find a game like Dragon Warrior VII being released now, at the very end of the PlayStation's life as a viable mainstream console. There's no nice way to say this: Dragon Warrior VII looks like it was released in 1995. Die-hard RPG fans will already be screaming, ~It's not the graphics, it's the gameplay!~ and really, they're right. Only a true connoisseur of the genre, however, will be able to quickly overlook such lackluster visuals to see if there's really meat under there; everyone else will snort and walk away. And ultimately, that will probably determine the fate of Dragon Warrior VII in America. For serious RPG fans who couldn't care less about the Final Fantasy brand of flash, though, it's hard to envision a more appropriate game.Like all the games in the series, Dragon Warrior VII casts you as a nameless hero--this time, you're a 16-year-old boy who lives in a tiny fishing village with his parents. The small island that your character calls home is thought by its inhabitants to be the solitary landmass in a wide ocean, but through a series of nighttime shenanigans at the local ancient ruins, the young hero and his friends are warped to another unfamiliar island. They soon discover that by finding a large number of old stone tablets scattered throughout the land, they can restore the continents that make up the rest of their world's geography. As each new island is recovered, of course, the plot grows to more and more epic proportions until, as in any good RPG, the fate of the world hangs in the balance.Now we can get the graphics part over with: They're not good. The look of Dragon Warrior VII is composed of very sparsely detailed 3D town and dungeon environments on which small, sparingly animated sprite-based characters are superimposed. Here's your first clue that the game recalls the really old days of RPGs, back when graphics were mere placeholders for ideas like ~hero~ or ~treasure chest.~ Dragon Warrior VII's images aren't nearly that bad, of course--you can certainly tell what's what. But if the most rewarding things you got out of Final Fantasy VII were the full-motion video interludes, you definitely won't be wowed by anything you see in Dragon Warrior VII.Fortunately for people who mean to play the game instead of just look at it, Dragon Warrior VII has an RPG core so dense that few current examples of the genre can rival it. How many RPGs--ones that you've played lately--make you fight slimes with your bare hands for half an hour before you can afford a single sword? Indeed, Dragon Warrior VII sometimes seems so hard core that it will test even those who get off on self-applying that term. The game is so deeply rooted in the old pre-cinematic style of RPGs that it refuses some of the technical innovations that have allowed other long running series in the genre to evolve into their current forms. The interface of the game seems needlessly complicated in general, making things such as item management and battle operations slightly laborious. Likewise, things like saving are complicated by excess button pressing and menu navigation more than they should be. These problems certainly aren't serious enough to daunt true RPG devotees, but it may drive off those who would otherwise give the game a chance.Dragon Warrior VII's battle system is similarly archaic, as it heavily resembles the system that's been in place since the very first installment of the series. As usual, you view things from a first-person perspective, and the enemies appear as static sprites on top of a fairly drab background. Amusingly, the only graphical nicety of the entire game is the very fluid animation of the enemies as they attack. In addition to regular attacks, your characters have a variety of spells and special skills to be wielded in battle, and these are learned automatically as they level up. For the first few hours of the game, though, you might be wondering why your magic user has only one attack spell and your fighter has been using the same sword technique for the last few hours. But you'll be wondering only until you finally encounter the vaunted job system. This Dragon Warrior staple lets you assign a specialty like fighter, mage, or thief to any of your characters, and as they fight more battles using that class, they'll learn the techniques and skills associated with it. When you've mastered one job, you can begin learning another without losing the skills you've already gained. Multiple jobs can be combined to gain even more skills, and second- and third-tier jobs can be unlocked when you've mastered the right basic classes. Needless to say, this system provides a wealth of essential commands and techniques for your characters, as well as an endless opportunity for customizing them. Despite the disappointing graphics and the few minor gameplay issues, Dragon Warrior VII has one more ace up its sleeve, but this one is a little hard to articulate, and it will definitely ring true only for serious fans. The best way to put it is that it just feels like a 16-bit RPG. If you can discount the presence of polygons--and that's not very difficult--you could easily envision the game as an SNES title. Perhaps the paltry visuals even contribute to this feeling of ~classicness,~ which is enhanced by the scads of random battle encounters, the world-spanning plot, and the typically RPG-like soundtrack. Starting a new game in Dragon Warrior VII, embarking on ye olde grand quest, is sure to remind you of your halcyon days of video game role playing, if you have them--and that's one of the biggest compliments a game like this can be given. Dragon Warrior VII comes from one of the most popular series of video games in Japanese history, but it won't be reaching the astronomical sales figures here that it did in the East. However, it's a game that knows its target audience well, and it will undoubtedly find a niche among American RPG players. If you know you're in the market for a very lengthy and ultimately satisfying RPG and know you can get over the visuals, you owe it to yourself to give Dragon Warrior VII a try.Dragon Warrior VII's battle system is similarly archaic, as it heavily resembles the system that's been in place since the very first installment of the series. As usual, you view things from a first-person perspective, and the enemies appear as static sprites on top of a fairly drab background. Amusingly, the only graphical nicety of the entire game is the very fluid animation of the enemies as they attack. In addition to regular attacks, your characters have a variety of spells and special skills to be wielded in battle, and these are learned automatically as they level up. For the first few hours of the game, though, you might be wondering why your magic user has only one attack spell and your fighter has been using the same sword technique for the last few hours.But you'll be wondering only until you finally encounter the vaunted job system. This Dragon Warrior staple lets you assign a specialty like fighter, mage, or thief to any of your characters, and as they fight more battles using that class, they'll learn the techniques and skills associated with it. When you've mastered one job, you can begin learning another without losing the skills you've already gained. Multiple jobs can be combined to gain even more skills, and second- and third-tier jobs can be unlocked when you've mastered the right basic classes. Needless to say, this system provides a wealth of essential commands and techniques for your characters, as well as an endless opportunity for customizing them.Despite the disappointing graphics and the few minor gameplay issues, Dragon Warrior VII has one more ace up its sleeve, but this one is a little hard to articulate, and it will definitely ring true only for serious fans. The best way to put it is that it just feels like a 16-bit RPG. If you can discount the presence of polygons--and that's not very difficult--you could easily envision the game as an SNES title. Perhaps the paltry visuals even contribute to this feeling of ~classicness,~ which is enhanced by the scads of random battle encounters, the world-spanning plot, and the typically RPG-like soundtrack. Starting a new game in Dragon Warrior VII, embarking on ye olde grand quest, is sure to remind you of your halcyon days of video game role playing, if you have them--and that's one of the biggest compliments a game like this can be given.Dragon Warrior VII comes from one of the most popular series of video games in Japanese history, but it won't be reaching the astronomical sales figures here that it did in the East. However, it's a game that knows its target audience well, and it will undoubtedly find a niche among American RPG players. If you know you're in the market for a very lengthy and ultimately satisfying RPG and know you can get over the visuals, you owe it to yourself to give Dragon Warrior VII a try."}