{"ref": "https://www.gamespot.com/reviews/mach-modified-air-combat-heroes-review/1900-6166759/", "date": "March 2, 2007", "game_name": "M.A.C.H. Modified Air Combat Heroes", "text": "If you think of M.A.C.H. as Mario Kart meets Top Gun, you'll have a good idea of what to expect from Sierra's latest PSP game. M.A.C.H. stands for Modified Air Combat Heroes, and it's a flight racing and combat game that's light on realism but heavy on speed and firepower. The controls are simple, the graphics are great, and the gameplay provides action-packed excitement. Its value is diminished by a paltry selection of stages and events, but while it lasts, M.A.C.H. is a good game that's perfect for quick game sessions on the go. The great sense of speed and slick level design make for plenty of exciting races. The story behind M.A.C.H. is so ridiculous that you can't help but love it, even though it has no bearing on the game. In 2049, the various military superpowers in the world decide to switch from manned fighter jets to unmanned aircraft. This puts a lot of fighter pilots out of work and results in a lot of obsolete military aircraft being sold off to the highest bidders. So a community of wealthy fighter pilots, crazy hobbyists, and black-market arms dealers get together to form ~an underground~ where they put the decommissioned aircraft to use in elaborate races and dogfights for the ever-elusive prize of ~...fame, glory, and fortune.~ At this point, you'd almost expect to hear something about drifting or pink slips, but M.A.C.H. doesn't take it quite that far, which would just be silly. There are three single-player modes to choose from in M.A.C.H: arcade, career, and challenge. In arcade mode, you can choose to play a single race or dogfight on the map of your choice. Challenge mode mixes things up by giving you specific objectives to complete, such as competing in time trials, collecting coins as you race around a track, or holding on to a dog tag for as long as possible without getting shot down. But the meat of the single-player experience is in career mode, which is divided into five different difficulty levels, each with several events. Each event is a series of races and dogfights where you earn points depending on how you place. The pilot with the most points at the end of the series wins the event. If you place first in an event, you'll earn cash and sometimes unlock a new plane. The two main game types are racing and dogfighting. The races all take place on courses that have you flying over water, through tunnels and caves, under bridges, and so on. The plane automatically flies, but you can hold the X button to speed up. You can also double-tap the X button for a turbo boost as long as your turbo gauge is full to a certain point. The plane also automatically follows the course to an extent, so you don't have to worry about precise steering. However, many of the tracks have branching paths and shortcuts, and there are plenty of hazards to crash into, so you need some fairly quick reflexes to deftly navigate each track. Still, the game is very forgiving when it comes to crashes. You can bump against walls and rocks and continue flying unscathed. It's only when you fly directly into an obstacle that you'll actually crash, and even then, you'll be reset almost instantly right where you crashed. As you race, you can pick up items by flying through floating question mark icons. You can get such items as missiles, cluster bombs, mines, and turbo boosts, which you can then use to gain an advantage in the race. If you're in the front of the pack in a race, you can expect to get almost constant warnings about incoming missiles, which are extremely difficult to avoid. If you tap the circle button, you'll do a barrel roll to avoid incoming fire, but doing a barrel roll is extremely disorienting during a race and will lead to a crash more often than not. The combat element adds a bit of a twist to the racing to make it more fun and occasionally more frustrating because you always seem to get blown up with a missile right at the finish line. It plays very much like a kart-racing game with high-powered jets, which proves to be a great combination. Dogfights are a bit more conventional. They take place in large open areas where you're free to fly around, pick up items, and blast your opponents out of the sky. These missions are timed, so you usually have to try to rack up as many kills in two minutes as possible. You always have machine guns, which home in on your target as long as you're aiming in the general direction. It takes only a short burst of fire from a machine gun to kill an enemy, but the guns overheat quickly, so you'll usually want to resort to missiles. The missiles lock on to targets, making them by far the most useful item in dogfights. Early in the game, you can easily rack up 15 or more kills in two minutes using missiles alone. As fun as M.A.C.H. is, it does get repetitive quickly with only two different game types in career mode. The problem is exacerbated by the fact that there are only five different stages. There are slightly rearranged and mirrored versions of each stage, but you'll still be racing the same five courses over and over again. It's a shame because the tracks here are well designed and thematically varied, and they all look great. There is at least a bit more variety to the aircraft in the game. You can unlock 11 different jets, each one with specific strengths and weaknesses. You can use the money that you earn in career events to purchase new engines, wings, guns, and other parts to power up your jet. The jets all handle differently, and you'll notice a significant difference when you step up to a more powerful aircraft. You can also use your money to paint your plane different colors and adorn it with decals. Races and dogfights are available in multiplayer as well. The game supports up to eight players over an ad hoc connection and has game sharing, although you can access only two planes and one map that way. The multiplayer lets you take your customized planes into battle against your friends, and you can also set the options to include computer-controlled opponents. According to the back of the box, M.A.C.H. also supports the PSP headset, although that doesn't make much sense because the multiplayer is ad hoc only. Forget yachts and sports cars; in the future, eccentric millionaires will own military jets and fly them through lava-filled caverns at 600mph. M.A.C.H. not only plays well, but also looks great. The tracks are full of detail and have you flying around tropical islands, dingy oil rigs, and the icy tundra. Although the planes are fictional, they all look very cool. Most importantly, the game runs smoothly and offers a great sense of speed. The sound is much less impressive than the graphics. Jet engines and weapons don't sound especially powerful, and the music is quiet and subdued. Also, the missile lock-on sound is one of the most annoying sounds you'll ever hear, and you'll hear it a lot in this game. If you're looking for a simple, satisfying game that can be played in quick doses, M.A.C.H. is a good choice. The flying won't do anything for sim fans, but the great sense of speed and colorful visuals will please just about everyone. With more variety in the events and at least double the number of stages, M.A.C.H. would be a great game. As it is, it's a very good game that falls just short of its potential."}