{"ref": "https://www.gamespot.com/reviews/mike-tyson-boxing-review/1900-2859024/", "date": "May 17, 2006", "game_name": "Mike Tyson Boxing", "text": "Mike Tyson Boxing for the Game Boy Advance may look like the Nintendo classic Ring King on the back of the box, but make no mistake--this is not a classic, and it's not anything like Ring King. Mike Tyson Boxing is a boring, repetitive exercise in countering your opponent. The only thing that's particularly impressive about Mike Tyson boxing for the Game Boy Advance is the amount of depth in the game's career mode. The game contains four game modes in all, versus, world, practice, and showcase. The game's world mode serves as the game's single-player career mode, allowing you to train your fighter and build him up from scratch. This mode features Mike Tyson as your trainer, and he tells you what type of training regimen you should be adhering to and what you have to work on. Training simply consists of selecting one of eight different types of exercises. You don't actually get to take part in the training exercise, but rather just see the change to your stats. If you like, you can even switch on the manager-only mode, which allows you to simply call the shots during training and then send your boxer into battle. The biggest problem with Mike Tyson Boxing is that the gameplay is incredibly limited and totally unexciting. It consists of moving your fighter within range to fire off a punch and then moving him away when your opponent throws a punch. While that may sound like boxing, the limited types of punches and way you throw them keeps this game from being anything more than an approximation of the real-life sport. You can throw a left and right jabs, left and right hooks, left and right uppercuts, and left and right super punches. Simply tapping a button throws a jab, but holding down a button for a second or two charges your punch and delivers a more powerful hook. The actual gameplay frequently degrades to you simply punching your opponent with a regular jab or hook when he is charging his punch, which is indicated by a series of yellow rings around his glove and a sound effect, and landing charged punches of your own when he misses or leaves himself open. The controls aren't all that responsive, and punches sometimes don't get thrown when you want them to. Visually, Mike Tyson Boxing is boring. The camera angle stays locked on the back of your fighter, following him around the ring. The boxer models are rather small, and they don't have a whole lot of animation or detail. What animation there is isn't very smooth, and the only visual differences between the venues are simply different colors and logos on the canvas. In the audio department, the sound effects are mediocre at best, and the sound effect when charging a punch quickly becomes quite annoying. In the end, Mike Tyson Boxing is simply not much fun to play. The gameplay is laborious, repetitive, and limited to throwing a charged punch when you can land it and countering your opponent's attack with a regular punch when you can't. The bottom line is that the game doesn't look, sound, or play particularly well. If you're looking for a boxing game for the Game Boy Advance, you'd be better served by checking out Ready 2 Rumble or Boxing Fever."}