{"ref": "https://www.gamespot.com/reviews/kingdom-hearts-358-2-days-review/1900-6230511/", "date": "September 25, 2009", "game_name": "Kingdom Hearts 358/2 Days", "text": "Kingdom Hearts 358/2 Days is a compelling action role-playing game that successfully blends Disney elements with an original cast and an absorbing plot that will both intrigue and surprise you. The game's fun battle system is exceptionally fast-paced, while new customization options, thrilling boss fights and an entertaining multiplayer mode will further hook you. 358/2 Days offers an enjoyable, nostalgic experience that never lets its simplicity or its occasional quirks undermine its appeal. Tackle challenging heartless with ruthless combos and limit breaks. The game's greatest draw is its gripping and beautifully simple story of friendship, which features some dynamic characters and a number of interesting twists. Rather than playing as series protagonist Sora, in 358/2 Days you assume role of Roxas, his ~nobody~: a mirror image bereft of memories. With nothing to cling to but a name and a dubious group called Organization XIII, Roxas hopes to recapture his past by defeating shadow monsters known as heartless. Plenty of familiar faces and Disney locales are faithfully woven into the story, but they never steal the plot's thunder as you unravel the Organization's dark secrets. Unlike in previous games in the series, gameplay is broken up into challenging missions that let you set your own pace while encouraging exploration. Missions are staged throughout seven classic Disney worlds that are segmented, but you'll quickly encounter new areas to explore and fun platforming elements. You're afforded a lot of control over which tasks you accept, so you have the freedom to work on those that advance the story or dabble in extra assignments for greater rewards. Key tasks are sometimes repeated, which can get a little dull, but story events and surprise mini-bosses ensure that monotony rarely has a chance to set in. Other missions, such as exploring Agrabah's Cave of Wonders, increase immersion by altering objectives while you're on the field. For example, you might have to suddenly engage in aerial battles while searching for new heartless. A detailed map makes locating heartless easy, while a useful checkpoint system saves you from repeating objectives if you slip up. The fun, fast-paced battle system occurs in real time and offers an exhilarating combat experience accentuated by combos. Comfortable controls and a variety of camera options make it easy to keep up with the action, while a convenient targeting mode frees you from hassling with the camera by locking it on a foe. A handy shortcut menu drastically cuts down on the amount of time spent cycling through items and spells in the midst of battle, which allows combat to flow smoothly in the toughest of fights. A fun chaining system rewards you with bonus points for defeating heartless within time restraints, adding a nice element of pressure. Lengthy combos, which are quick and easy to use, enliven the gameplay along with devastating limit breaks that you strategically activate when your health is low. Spellcasting is somewhat slow to respond, which is unfortunate when you're trying to heal yourself or a companion, but the only real annoyance is the minor slowdown you'll encounter when unleashing combos against large batches of foes. Crafty enemies keep combat enticing by employing a variety of effective tactics, such as repeatedly freezing you in place. Boss fights are especially fun and intense, with most bosses implementing clever tricks to test your mettle while requiring you to outmaneuver patterned attacks. Unfortunately, some bosses are so large that the camera hinders depth perception, but it's only slightly aggravating. Roxas' abilities are governed through a unique grid-based panel system that lets you customize abilities according to your play style as you progress. It grants you the freedom to focus on one or a variety of different talents, such as magical prowess or speed, which is a refreshing level of personalization. Numerous panel types--from accessories to magic--directly impact your abilities when inserted into panel slots. You're also able to link panels by matching them up with special counterparts, providing drastic improvements. For example, linking a fire spell to a ~double cast~ panel lets you cast that spell twice. Though it may sound complex, the system is relatively easy to learn and lets you save different arrangements--such as one emphasizing magic and another focusing on physical attacks--as decks, so you can easily switch between strategies. The panel system's only oddity is that you're unable to tweak your abilities during missions, but this challenges you to use your limited slots effectively. A great presentation reveals a new tale of friendship. The impressive presentation features highly detailed environments that appropriately match their Disney sources. Moonlight filters through windows and shines on elaborate statuary decorating the Beast's castle, while Twilight Town's colorful sunset is soft and stunning. The 3D character models are comparable to their PlayStation 2 counterparts, which is a notable feat for the DS; however, texturing is a little muddled for character clothing, and jagged edges are noticeable. Some gorgeous cutscenes and good voicing highlight key plot elements, while the game's powerful, though largely recycled, soundtrack provides sweet melodies and invigorating battle music. The captivating opening theme, ~Sanctuary,~ as performed by Japanese pop singer Utada Hikaru, is pulled from Kingdom Hearts II and sounds great. Sound effects, from explosions to the swipe of your keyblade, are clear and nicely embellish combat. You'll spend roughly 30 hours completing the story mode, assuming you take the time to play through some practice missions and to search for cleverly hidden items. Unlockable challenge missions boost replayability by presenting you with tougher objectives while simultaneously restricting your abilities, such as having you defeat heartless without jumping. If you prefer more savage battles, you can adjust the difficulty level accordingly, which dramatically increases the game's intensity. A satisfying mission mode with a bevy of playable characters from Organization XIII lets you redo missions solo, or you can join up to three friends with their own copies of the game to show off your personalized combat style in co-operative play--a fun first for the series. Replaying missions from the story with friends at your side makes them significantly easier, but there's some fun to be had racing to collect coins before your friends get them all. Kingdom Hearts: 358/2 Days stays true to the series by utilizing a variety of popular Disney worlds, an enthralling plot, and classic gameplay freshened up with fully customizable abilities. Though it has a few minor faults, it remains a charming and rewarding adventure that's a real treat to play."}