{"ref": "https://www.gamespot.com/reviews/ready-2-rumble-round-2-ps-review/1900-2657894/", "date": "May 17, 2006", "game_name": "Ready 2 Rumble Boxing: Round 2", "text": "Ready 2 Rumble: Round 2 has more boxers and moves than the first game, but aside from a few slight changes here and there, the game remains largely unchanged, which for people who've never played the original is perfectly fine. However, for those of us who were fans of the original game, the gameplay and presentation of R2RB: R2 are all too familiar, making the sequel seem more like a simple roster update. The game has two main modes of play, arcade and championship. Arcade mode lets you start a match against the computer or another player without worrying about any statistics or unnecessary setup options. Championship mode is the game's main single-player mode, and it allows you to take a fighter from the depths of obscurity to the top of the ranks in search of a shot at the title. This mode has been slightly dressed up since the original game, and it now includes a fight schedule that basically forces you to pay more attention to your fighter's training regimen. Training consists of seven real-life boxing exercises: jumping rope, the heavy bag, the speed bag, the sway bag, rumble pads, lifting weights, and aerobics. These exercises are represented in the form of minigames, which you must actually do well in to get the full benefit of the exercise. These benefits come in the form of increased abilities such as greater punching power, greater foot and hand speed, and additional endurance. The majority of the minigames are fairly simple exercises in timing, speed, and memory that get progressively harder with each step. The bulk of the time you spend playing Ready 2 Rumble Boxing: Round 2's championship mode is spent playing these minigames, which do get a bit stale after a while. As far as the game's control and gameplay mechanics are concerned, R2RB: R2 hasn't actually changed that much from the original game. While many of the returning characters in the game have new combos, the punches have remained the same. The only gameplay changes are the fighter's new ability to parry punches instead of just blocking them. The game also has a rumble combo that builds up every time you hit someone with a good shot or taunt. Letters appear that eventually spell the word ~rumble,~ and at this point you can activate a moment of near invincibility or choose to continue building up your power. In all, there are three levels of rumble power, and waiting to fill all three levels up results in the ability to throw a knockout punch that can literally send your opponent out of the ring. Visually, Ready 2 Rumble Boxing: Round 2 is on par with last year's version, which was a decent looking PlayStation game. The models of the fighters are surprisingly detailed, and the animation is quite good. The textures for some of the banners hanging in the rafters of the arena and the patterns that appear on the canvas of the ring look a little fuzzy, but the game as a whole looks good. In the audio department, the voices of the characters, the sound effects, and the music are of varying quality, but they end up blending well enough to add to the game. Overall, Ready 2 Rumble Boxing: Round 2 is a fun game that will undoubtedly impress those who've never played the original. Unfortunately for those of us who have played the first game, Ready 2 Rumble Boxing: Round 2 wears thin quickly, as little aside from the game's character lineup has changed. The game's AI and gameplay are still as simple as those of the first game, which ultimately makes R2RB: R2 a game that's better suited for rental than purchase."}