{"ref": "https://www.gamespot.com/reviews/x2-the-threat-review/1900-6086003/", "date": "December 22, 2003", "game_name": "X2: The Threat", "text": "Space simulations have done so poorly commercially over the past five years that the genre has almost completely vanished. The trend began when large publishers EA and LucasArts abandoned their respective Wing Commander and Star Wars space sim franchises, and it accelerated when even acclaimed titles, like FreeSpace 2, were unable to attract a significant commercial market. During the past year, Microsoft released Freelancer, which a hybrid action space sim with a storied and protracted development. Aside from this offering, the genre has essentially been handed over to small, mostly European, developers. X2: The Threat is the latest space sim to be developed by a small European developer, and like its recent peers, it's an extremely ambitious but not very accessible game. It starts very slowly and has a steep learning curve, but if you're patient enough to stick with it, you'll probably find that X2 is a diamond in the rough. Space looks great in X2, as it's full of colorful nebulae and other interesting scenery. The scope of X2 is quite immense. Like Privateer or Elite, it's an open-ended space simulation that gives you the freedom to trade goods, hunt pirates, loot transports, mine asteroids, escort dignitaries, or just freely explore an expansive gaming universe. X2 is even more ambitious than any of those games, since it's also a respectable strategy offering that allows you to build factories, control capital ships, and ultimately assemble a fleet to dominate territory and influence economic markets. It's also set in a relatively dynamic universe that is controlled by six different races who are all threatened by an ominous newcomer. As you develop your own economic empire and military force, you have to learn how to effectively manage and defend your dispersed assets. Even more impressively, just about everything works as intended, so, as a result, X2 is one of the most involved space simulations ever. However, the cost of this depth is apparently polish, since many aspects of X2 feel amateurish or just don't work as well as they do in other space sims. X2 may have the worst cinematics and egregiously paced dialogue that the genre has ever seen. X2 is the sequel to X: Beyond the Frontier, which received such poor distribution in North America that its more impressive Xtension upgrade was never released on this side of the Atlantic. Most of the notable additions introduced by Xtension, such as being able to control carriers, have been incorporated into X2. Unlike other games of the genre, however, the X games haven't featured an involving overall plot, and developer Egosoft has tried to remedy that omission in X2 by including a handful of scripted missions and cinematics. Unfortunately, the cinematics have a terribly mistimed cadence, primitive animation, juvenile dialogue, and a viewing perspective that annoyingly tends to bob around. Sometimes even a badly executed storyline can add purpose or interest to gameplay, but the inclusion of X2's storyline sequences is a major misstep, and the development resources it received would have been better spent elsewhere. Fortunately, when judged as a ~sandbox~ game, X2 is much more rewarding. With a large spread of monitors like this, you can quickly assume direct control of turret defenses or supporting ships. The spaceflight engine is also a bit clunky. Unlike the Independence War games, the physics system doesn't meaningfully incorporate inertia, so you don't get much sense of motion. Even worse, the controls are finicky, thus making it difficult to aim precisely. That's less of an encumbrance than you'd expect, since success in combat is far less dependent upon twitch skills than it is upon having the right shields and weaponry. Combat AI is rudimentary, as computer-controlled ships seem to almost turn randomly in search of opponents, and collisions are extremely frequent. The engine feels unrefined, and the battles are simplistic, especially when compared to mission-based space sims like Freespace 2. So, to enjoy X2 you have to truly appreciate its economic and strategic aspects. There are also rewarding role-playing elements in X2. You can personalize your empire by importing your own picture or logo to use for your pilot's photo or to paste on your vessels. As you successfully deliver goods and fight off enemies, you'll frequently be awarded gratifying titles and standing with various factions. Increasing your reputation will earn you access to additional missions, and it will also increase the likelihood that you'll become a target of fortune hunters or vengeance seekers. There are also dozens of ship upgrades to acquire, ranging from more powerful weapons and engine upgrades to equipment that will give you the ability to mine or collect organic samples. Since you can also buy or steal new ships, you're constantly improving or upgrading your fleet--or trying to accumulate the resources to do so. Additionally, since you're consistently getting accolades or tangible benefits for achievements, gameplay is addictive. As in most space sims, you use jump gates to move between discrete sectors. The graphics are colorful and detailed and represent a huge improvement over those in the original X: Beyond the Frontier. In keeping with the ~throw in the kitchen sink~ design of the rest of X2, there's support for shadows, bump mapping, and antialiasing, though you'll need a high-powered system with a top-of-the-line graphics card to run the game with all the graphical bells and whistles at full blast. As such, balancing graphical quality and performance may be a bit of a challenge, and frame rates tend to fluctuate radically even with few options enabled. Nevertheless, X2 is a great-looking game overall, filled with imaginative and spectacular outer-space scenery. Unfortunately, its sound is mediocre, at best. There are few memorable effects, and the music consists of unexceptional electronic compositions. As you'd expect with a game as complex as X2, there's a steep learning curve to overcome in order to appreciate all of the game's features. There really are an incredible number of things to do aside from just exploring and taking in the sights. There are simple missions that you can pick up at bases, but the game really comes into its own as a free-form simulation. You can hire ships, set up supply routes between factories for a fleet of transports, maintain spy satellites, blockade enemy installations to manipulate the dynamic economy, space walk to assume control of a different vessel, or just carve a swath of destruction. The interface is, unfortunately, correspondingly complex, with lots of hotkeys and menus to navigate. Each ship has a system of monitors that you can activate to maintain situational awareness from different perspectives. You're not limited to controlling your own ship, since you can give orders to ships and installations in other locations remotely, and you can use the monitors to assume direct control of supporting ships. There's usually more than one way to take an action, and often, the easiest way isn't the most apparent. Unfortunately, the truly awful system of tutorials isn't much assistance since it doesn't actually identify the requisite key commands. Collectively, the poor tutorials and complexity of the game require you to invest a couple of hours before you'll feel comfortable with the interface. Once you've mastered it, however, it works quite well. There are numerous installation types, and each one has different resource requirements and produces its own products. While there are a few shortcuts you can take, it will generally take many hours before you can start building an economic empire or take the helm of the more formidable vessels. Unfortunately, it's easy to be turned off by X2 because of the initial time commitment required to become adept with its controls and because of the unrefined engine and unsophisticated combat. However, X2 does offer some highly satisfying gameplay--if you're willing to stick with it. It's not a game that has any reasonable prospect of revitalizing the space sim genre, since it's from a small developer and isn't particularly accessible, but it's a game that highlights why the genre was once much more popular. There are also rewarding role-playing elements in X2. You can personalize your empire by importing your own picture or logo to use for your pilot's photo or to paste on your vessels. As you successfully deliver goods and fight off enemies, you'll frequently be awarded gratifying titles and standing with various factions. Increasing your reputation will earn you access to additional missions, and it will also increase the likelihood that you'll become a target of fortune hunters or vengeance seekers. There are also dozens of ship upgrades to acquire, ranging from more powerful weapons and engine upgrades to equipment that will give you the ability to mine or collect organic samples. Since you can also buy or steal new ships, you're constantly improving or upgrading your fleet--or trying to accumulate the resources to do so. Additionally, since you're consistently getting accolades or tangible benefits for achievements, gameplay is addictive. As in most space sims, you use jump gates to move between discrete sectors. The graphics are colorful and detailed and represent a huge improvement over those in the original X: Beyond the Frontier. In keeping with the ~throw in the kitchen sink~ design of the rest of X2, there's support for shadows, bump mapping, and antialiasing, though you'll need a high-powered system with a top-of-the-line graphics card to run the game with all the graphical bells and whistles at full blast. As such, balancing graphical quality and performance may be a bit of a challenge, and frame rates tend to fluctuate radically even with few options enabled. Nevertheless, X2 is a great-looking game overall, filled with imaginative and spectacular outer-space scenery. Unfortunately, its sound is mediocre, at best. There are few memorable effects, and the music consists of unexceptional electronic compositions. As you'd expect with a game as complex as X2, there's a steep learning curve to overcome in order to appreciate all of the game's features. There really are an incredible number of things to do aside from just exploring and taking in the sights. There are simple missions that you can pick up at bases, but the game really comes into its own as a free-form simulation. You can hire ships, set up supply routes between factories for a fleet of transports, maintain spy satellites, blockade enemy installations to manipulate the dynamic economy, space walk to assume control of a different vessel, or just carve a swath of destruction. The interface is, unfortunately, correspondingly complex, with lots of hotkeys and menus to navigate. Each ship has a system of monitors that you can activate to maintain situational awareness from different perspectives. You're not limited to controlling your own ship, since you can give orders to ships and installations in other locations remotely, and you can use the monitors to assume direct control of supporting ships. There's usually more than one way to take an action, and often, the easiest way isn't the most apparent. Unfortunately, the truly awful system of tutorials isn't much assistance since it doesn't actually identify the requisite key commands. Collectively, the poor tutorials and complexity of the game require you to invest a couple of hours before you'll feel comfortable with the interface. Once you've mastered it, however, it works quite well. There are numerous installation types, and each one has different resource requirements and produces its own products. While there are a few shortcuts you can take, it will generally take many hours before you can start building an economic empire or take the helm of the more formidable vessels. Unfortunately, it's easy to be turned off by X2 because of the initial time commitment required to become adept with its controls and because of the unrefined engine and unsophisticated combat. However, X2 does offer some highly satisfying gameplay--if you're willing to stick with it. It's not a game that has any reasonable prospect of revitalizing the space sim genre, since it's from a small developer and isn't particularly accessible, but it's a game that highlights why the genre was once much more popular."}