{"ref": "https://www.gamespot.com/reviews/the-forgotten-city-review-seven-deadly-sins/1900-6417712/", "date": "August 17, 2021", "game_name": "The Forgotten City", "text": "In the years prior to Julius Caesar's rule of ancient Rome, the legions of the empire were led by a wealthy general known as Marcus Crassus. He was infamous for many things, one of which was his revival of decimation--a harrowing means to control the army by punishing the collective for the actions of singular dissidents. Soldiers were divided into groups of ten, where each would draw stones. The one unfortunate enough to draw a white one would be beaten to death by the remaining nine, regardless of their involvement in any crimes against the empire. It instilled not only fear, but a strong sense of responsibility among the legions of soldiers, who quickly learned to self-discipline in the face of such punishment.The Forgotten City, a narrative puzzle game that started out as a Skyrim mod, uses the principle of decimation as its basis. It's an anecdote used to describe the game's most prominent mechanic, The Golden Rule, which is an ever-present threat to the small community trapped in a desolate and secluded city deep in the Roman mountains. A god watching over the community threatens to turn everyone into gold should anyone commit a sin. In theory this should lead to a utopia, a land where its people are forced into peaceful co-existence through the persistent threat of imminent and absolute destruction. But it's not long before you realize that the ideals of right and wrong, and, more importantly, who defines them, allow the definitions of sin to be bent and stretched in creative and cruel ways.Not long after the game's opening, you're teleported back in time to this ancient city and caught within the web of its passive aggressive personalities and bubbling politics. The magistrate of the society is the only one aware of who you are, tasking you with using an infinite time loop to figure out who will eventually break The Golden Rule and stop them before it happens. This also turns out to be the only way that you can get back to your time, motivating you to get very familiar with each of the city's varied inhabitants and decipher who might be on the verge of teasing out the apocalypse. Each loop is an opportunity to learn more about each citizen through dialogue, deciphering what their daily routines are, which other citizens they're bound to interact with, and which of their problems you can potentially solve. Eventually each day comes to an end, bringing about the fruition of The Golden Rule and forcing you to sprint towards the shrine you entered through to start the day over again.Each loop isn't strictly governed by time though, meaning that you can pursue leads in any order you see fit throughout. A citizen stricken with an illness won't die if you don't choose to prioritize them first, for example, letting you explore other threads without the stress of having to check off some tasks quickly at the start of each loop. Characters do operate according to a routine, however, meaning they might be in entirely different parts of the city depending on the time of day, which can lead to some scrambling to find the right person when you need to engage in a specific conversation. For the most part, however, The Forgotten City doesn't waste any of your time by forcing you to repeat actions. A character you meet at the start of each loop is emblematic of that, letting you avoid the same tiresome introductory dialogue with a single reply each time. This comfort of being able to skip through swathes of dialogue and get right back into the same lines of inquisition you were pursuing last time permeates through the citizens you interact with, each of which have their own ways of trying to understand how you know so much.Although you aren't from the same time period, you are beholden to the same rules as the city, meaning any sins you might commit will immediately trigger The Golden Rule and force you to reset. Some of these are easy to understand, such as stealing a vial of medicine or just recklessly killing someone. Others are more subtle and do well to expose just how challenging it might be to live with this threat hanging over you. A threat of violence, for example, may trigger the end of the world irrespective of whether it came from a place of sarcasm or anger. Other times, just trying to turn the tables on a bribe could have the same effect, teaching you just how cunning some characters are at exploiting loopholes in The Golden Rule. Learning how to do the same is part of the fun, and you'll quickly figure out how to get rid of a dangerous assassin or acquire large sums of money without having to reset your loop each time. It's satisfying the first time you find these solutions, but even more so when you see how each one acts as a piece of the larger puzzle, opening new avenues for you to investigate in the process.Almost all of this is done through dialogue, with your progress in The Forgotten City coming mostly from conversations. You're given numerous lines of inquisition to follow, each with branching paths of dialogue that can resolve some leads while opening entirely new ones. Most of the time, The Forgotten City does a decent job of indicating what paths of dialogue have been exhausted, while ensuring you know when new ones (based on new information you might have gathered) have opened. There are some instances, however, where a new line of inquiry is buried under others that you've already engaged with, only revealing themselves once you've repeated some dialogue that, even more frustratingly, doesn't always align with the new information you might want to explore. This was rare but did halt my progress significantly at one time, making me second guess whether I had encountered a bug or just not triggered a new lead correctly. For the most part though, the trees of dialogue harmoniously interact with each other, never leaving you guessing where to head to next or who to question immediately after your current conversation.Exploration factors into progression almost as much as your conversational wit. You're often required to gather evidence to back up bold claims or find clues to lead you down a new investigative thread, letting you use the authority given to you by the magistrate to investigate every home you're able to find your way into. Inhabitants won't always be happy about it, but it's surprising that the existence of The Golden Rule allows them to feel confident that you won't be taking anything you aren't supposed to. This is where you'll be offered the chance to get slightly experimental with the limits of the rule itself, since items you obtain persist between runs. If you're not content with the meager dribs and drabs of currency you find around the town, you can dedicate an entire run to stealing as much as you can without being turned into gold yourself. The Forgotten City anticipates these misdeeds every time, never allowing you to completely circumvent its progression in massive ways, but letting you color outside of the lines at times with satisfying results.To that end, The Forgotten City also never gets in the way of itself when it comes to forward momentum, with a deft sense of pacing that ensures no single run feels pointless. This is achieved with objective markers that are used to guide you around the city, as well as spooky hints whispered to you from a mysterious, disembodied voice. The combination of the two means you're always prodded towards the next big revelation, without getting overbearing to the point where the revelation feels undeserved. At times your next step won't be indicated by a marker at all, making it clear that there's some information you still need to draw from some citizens or a crucial item you need to find until you get some more help. The Forgotten City ultimately wants you to succeed without feeling like you're running around aimlessly in circles, and it balances this so expertly that each of its story beats feels triumphantly earned.There are also sparse moments of more traditional action-adventure tropes, with one optional section of the story (conveniently signposted for those who don't want to interact with it) dedicated entirely to some light horror and first-person action. This part can feel slightly janky, with a clear focus of development being on the game's narrative and branching conversations and not its fluidity when fighting enemies with a bow. That said, there's nothing wrong with the sections either, especially given that they're one-off instances that don't need to be repeated in any other loop if you don't want to. They're self-encapsulated detours from the main attraction, while also offering some of the most harrowing story progressions that take the tone of The Forgotten City down even more morally ambiguous avenues.Although there's serious themes underpinning the overall narrative of The Forgotten City, each of which are explored to different degrees depending on which of the four endings you land at, there's a playfulness to the journey that endears you towards each of its characters. An early example of this is having to explain what a meme is to an ancient Roman priestess, who in turn attempts to contextualize your explanation with the only points of reference available to her at the time. She settles on understanding memes as hieroglyphs with negative connotations towards people with the name Karen, which got such a laugh out of me at the time that I consistently associated the priestess with that moment. The Forgotten City is filled with moments like these, consistently adding a layer of levity to its otherwise death-filled narrative that cuts the tension at great moments.It's this careful mix of themes and the effortless manner in which The Forgotten City serves them up that makes each of its many memorable moments stick with you long after credits have rolled. They provide the impetus that drives you to discover more, with the game teasing you to discover its alternative endings for the most comprehensive conclusion to its often morally-complex tale. And it'll be hard to ignore the pull of diving back into the loop once again, if only to see small character reactions to new lines of dialogue, or the reactive nature that relationships have to slight changes in approach you might not have initially considered. The Forgotten City rewards your inquisitive mind with equally satisfying rewards at every turn, making its time-travelling tale one not to miss out on."}