{"ref": "https://www.gamespot.com/reviews/planet-coaster-review/1900-6416582/", "date": "December 5, 2016", "game_name": "Planet Coaster", "text": "Building and managing an amusement park is a difficult job. There are a surprising number of things to consider: keeping your rides safe and well maintained, making sure you have enough trash cans and janitors to keep things clean, forecasting and managing your finances to avoid crippling debt, and deciding how many pickles should or should not be on a burger. But most importantly, you need to keep everyone happy. You need to keep your visitors entertained, your employees motivated, and your business a successPlanet Coaster is a game full of optimistic, fun-loving character that conjures up fond memories of visiting local carnivals as kids, full of bright lights and jaunty calliope music, or maybe a more recent excursion to a big-name amusement park, full of thematic details everywhere you look. The desire to try to replicate these experiences is a driving force that makes it easy to get swept up in every aspect of Planet Coaster. This is a simulation where you can find satisfaction in tweaking your park on a macro scale: managing your park's overall cash flow and adjusting variables to influence average guest behavior, for example. But you can also lose yourself in the more frivolous micro level, placing that decorative shrub in just the right spot or making sure a roller coaster triggers confetti cannons at just the right time.It's possible to feel lost when you first dive into construction and management. There's no integrated beginner's tutorial--only links to YouTube videos explaining some of the basics. But this quickly proves to be an ample solution since the systems in place are so clear and simple to use. With construction, the tools for creating and manipulating walkways, shops, rides, and scenery are efficient and enjoyable. Snaking a path between obstacles or creating a spiral staircase to reach an elevated platform, for example, is painless. Instead of drawing out a route, the pathing tool involves laying down suggested pieces. You can adjust the direction and elevation of a piece with subtle mouse movements, and clicking anywhere places the segment. Mistakes can instantly be undone using the universal Ctrl+Z shortcut, with any money spent instantly being refunded in full. It's an intuitive process that encourages experimentation without the fear of punishment.Constructing a roller coaster--which may sound as intimidating as riding one--is, thankfully, just as simple. Laying down tracks relies on a similar predictive pathing tool, but with a few handy additions: there are buttons to help adjust the curvature and rotation of each track piece, a number of complex, pre-made turns are available to quickly attach, and the track can be automatically completed and smoothed out. Portions of a coaster can also be adjusted non-destructively after it's been fully built. It's an accessible process that will allow even the most novice of players to comfortably create thrill-rides of their own.This intuitiveness is consistent among all of Planet Coaster's tools. They're all extremely versatile, but it doesn't take long for them to feel like second nature. You can pull the earth up through pre-existing structures to mold tunnels like it's no big deal. A series of interlocking, elevated walkways spanning across vast chasms takes minutes. In making the labor of construction easy, Planet Coaster fast-tracks you into feeling like the game's creative possibilities are endless.While you can use pre-designed shops and scenery in your park planning, you can also build your own from scratch. Learning how to construct buildings requires a little more diligence, but only to get your head around the abundance of individual pieces you have to choose from: walls, roofs, windows, lights, animatronic characters, special stage effects, and foliage. Anything you construct can easily be saved as a template for future use or shared with the community. Given that creation is a painless process, it comes as no surprise that Steam Workshop integration is robust, seamless, and virtually limitless. Thanks to the game's long stint in Early Access, there are more than 44,000 items available for use--beautifully intricate structures and stores, ambitious, carefully engineered rides, and detailed replicas of real-world attractions. Casual discovery can be a problem outside of prolific creators, but if you know what you want, chances are it's probably already there.Planet Coaster offers three different modes of play: Challenge, Sandbox and Career. Challenge mode offers the classic blank-canvas scenario where you begin with limited funds, a limited selection of rides, and an empty lot. Sandbox mode is the same as Challenge mode only you're given unlimited finances, and Career mode puts you in the middle of pre-made scenarios. Initially, Career seems unattractive, especially since the game's tools for creativity are so well realized and beg to be used on a fresh plot of land. However, it's here where you're pitted against the game's management variables and learn how to work with and around them.Career entrusts you with a number of impressive, half-designed parks--which on their own, are an awe-inspiring glimpse into what you can achieve with the game's tools. It then dumps you in very tricky situations and requires you to learn how to get out of them with what you have on hand. A scenario may ask that you make a park located on treacherous terrain, without resorting to flattening the world with terraforming tools. It might limit you to traditional rides like carousels, requiring you to make the most of them, and tweak your park so it specifically caters to families. It may place a monolith in the center of your park that mysteriously makes attractions break down faster, forcing you to become competent in managing technicians, work rosters, and maintenance schedules.There's little guidance on the steps you should take to resolve these situations, and succeeding in a Career map may take more patience than other modes. But it's satisfying to solve a big problem in a trial by fire, using hard-earned knowledge. Working hard to pull yourself out of bad situations, slowly improve your finances, and continuing to create bigger, better, and more attractive things under strict limitations is a great challenge. Once you've accomplished your goals, you're left with a profitable, well-attended, attractive park to keep building on.This is what makes Career mode compelling: it encourages you to dive deep into the management layer and focuses your attention on the elements that you may have ignored without consequence in the other modes. With the traditional blank-canvas Challenge mode, it's easy to coast along, since ride integrity and human happiness don't degrade fast enough to require constant attention, at least on the default difficulty. Planet Coaster has a wealth of easily digestible variables to tweak, all of which have tangible effects--the cost of your food and what toppings you have on them, the duration and specific movement cycles of your rides--but if you have no interest in this kind of micromanagement, it's easy enough to leave everything on the default settings and still be profitable, leaving you to focus on the creation aspect.Planet Coaster's construction tools are effortlessly intuitive and encouraging, and the minutiae of its management variables are fun to tinker with for obsessive players, though it won't punish those who don't find satisfaction there. This is a game focused on the positivity that amusement parks can bring, one that fosters even the smallest spark of imagination and creativity. Planet Coaster's scenario-based maps are a delightful challenge, the included assets are full of character, and its Steam Workshop community is a stupefying bounty of creative talent and inexhaustible content. It's a game that occupies your thoughts when you're not playing it, and it's thoroughly captivating when you are."}