{"ref": "https://www.gamespot.com/reviews/tomb-raider-legend-review/1900-6163094/", "date": "June 25, 2007", "game_name": "Tomb Raider: Legend", "text": "Even though it's a side-scrolling platformer put together with 2D graphics, Tomb Raider: Legend for the Game Boy Advance manages to deliver the same sort of gunplay and environmental puzzles as the console versions of the game. Players must help Lara traverse eight massive levels, using her twin pistols and high-flying acrobatics to get past enemies and reach the deepest recesses of some of the world's most ancient ruins. The acrobatic puzzles in each level are fun and sometimes offer a healthy challenge. The game as a whole does a good job of keeping things varied with a liberal mix of gunfights, swimming sections, and motorcycle challenges. You'll need to use Lara's acrobatics to jump, climb, and swing your way through each environment. Like the console versions of Legend that were released months ago, Tomb Raider: Legend on the GBA follows the exploits of Lara Croft as she investigates the mysterious circumstances of her mother's death some 20 years earlier. Her search begins at an old Incan temple in Bolivia; but, of course, one thing leads to another, and she ends up canvassing various ruins and smuggling dens all over the world to track down the pieces of an ancient sword that is somehow the key to her mommy's demise. The story is told through a sequence of static comic book scenes and text boxes. While the plot isn't altogether interesting, it does provide an excuse for Lara to visit places like Bolivia, Peru, Tokyo, Kazakhstan, Ghana, Nepal, and England in her search for the missing sword fragments. Because the Game Boy Advance can't do 3D graphics very well, the GBA version of Legend was put together as a side-scrolling platformer with traditional 2D backgrounds and character sprites. Despite the change in perspective, the GBA game offers the same sort of gameplay as in the console versions. You'll spend a good portion of the time figuring out how to use Lara's many acrobatic abilities to move forward and upward in the environment. Lara can leap, grab onto ledges, swing on ropes, vault off of horizontal beams, swing between platforms using her magnetic grapple, as well as shimmy across and propel herself upward from sheer handholds. She can also push and pull certain heavy objects, as well as use her guns and grapple to shoot or yank certain environmental decorations, which play into the switch puzzles that you'll come across at regular intervals. Some levels also include swimming or riding a motorcycle that require quick reflexes to navigate without running out of air or wiping out too much. Falling from a lofty height or getting sliced to bits by a trap can eat away Lara's health and result in death. Thankfully, you can use first-aid packs to regain health, and the only penalty for dying is that you have to restart from the last checkpoint. Throughout the journey, you'll also encounter hungry tigers and armed smugglers that usually aren't happy to see Lara. Lara's twin pistols are perfect for such occasions, but she can also pick up and use the shotguns, machine guns, and grenades that dying enemies leave behind. Sometimes you can grapple or shoot objects in the environment to make them explode or topple on top of enemies. Generally speaking, the game mixes in a little bit of everything. One of the drawbacks about the side-scrolling viewpoint is that it doesn't give players the same freedom to explore levels and experiment as the 3D viewpoint allowed in the other versions. Regardless, there are plenty of ledges, poles, and other objects to interact with in the GBA version's environments. The 2D backdrops also generally exhibit a good amount of detail and depth. Ruins look sufficiently old, with animated waterfalls and birds here and there that serve no purpose except to catch the eye. Meanwhile, Lara has a multitude of graceful animations for everything from landing too hard on the ground to vaulting in circles while hanging onto a horizontal beam. The audio is generally low-key, but the dramatic musical pieces, ambient sounds, and various gunshots and groans manage to provide a sufficient soundtrack. Motorcycle stages offer a break from the gunplay and gymnastics found in the side-scrolling areas. Going through the story mode will probably take you about six or seven hours the first time through. It actually feels like it takes longer because each of the game's eight levels is so massive. Every level is split up into 20 or so small sections. Each section only takes about a minute to complete, but when you add all of those sections together, it can take as much as 45 minutes to reach the end of a single level. Thankfully, you don't have to finish a level in one sitting. The game automatically saves checkpoint data at the beginning of each section, which means you can quit your game and reload it later without having to retrace too many steps or start the entire level over. After you beat the game, you can play levels again to find any bonus artifacts you missed or to improve your time trial scores. You can use those bonus artifacts to unlock minigames, artwork, and cheats that can be accessed from the extras menu. The minigames are nothing amazing--just Tomb Raider-themed variations of classic logic puzzles. But they do offer a welcome diversion from the main game. Tomb Raider: Legend on the GBA may not offer the same degree of exploration or visual flair as the console versions, but it's still a solid platformer. All of Lara's trademark abilities are in the game, there are plenty of different things to do, and the environmental puzzles provide a clever change of pace from the typical run-and-jump formula."}