{"ref": "https://www.gamespot.com/reviews/outlaw-tennis-review/1900-6131087/", "date": "August 15, 2005", "game_name": "Outlaw Tennis", "text": "Outlaw Tennis is Hypnotix's latest attempt to subvert a haughty country-club pastime, and it proves to be roughly as successful as the other Outlaw sports games before it. Which is to say, Outlaw Tennis is a fun and accessible tennis game with some playful gameplay touches, but it's hampered by a dully sophomoric sense of humor. For what it's worth, though, the low, low price tag of $19.99 does make the barrage of limp slapstick and corny double entendres easier to tolerate. Get ready to cause a racket! Get it? Racquet? Racket? Ugh. When you're out on the court, the basic handling in Outlaw Tennis takes most of its cues from the de facto yardstick for tennis games: Virtua Tennis. The computer-controlled opponents in Outlaw Tennis aren't quite as cunning, and, generally speaking, the game doesn't have the same level of technical depth as Virtua Tennis. Still, the character controls are appropriately responsive, and variables such as the court surface affect the overall handling. As you might notice from the tattooed freaks and menagerie of strippers on the front of the box, Outlaw Tennis is more interested in going for the extreme and the outlandish, and this bleeds over a bit into the gameplay. Most important is your player's turbo meter, which is limited in quantity but can be tapped at any time. When activated, the turbo meter will let you move across the court more quickly. And with the right timing, it can be used to deliver extremely fast and powerful serves or strokes. Your turbo meter regenerates slowly over time, though you get turbo bonuses for every volley you win. Unsurprisingly, the turbo system has a noticeable effect on the pacing of the game, and it also makes it easy for you to pull off crosscourt saves, making for longer volleys and (for better or worse) making the computer-controlled opponents less menacing. Spicing up sports with senseless violence has simultaneously been one of the hallmarks of the Outlaw series, as well as one of its most regrettable indulgences. Not that there's anything inherently wrong with athletes beating one another within inches of their lives, but the fighting in the Outlaw series has always been exceptionally simplistic and clunky. Outlaw Tennis simplifies things even further, requiring you to do nothing more than mash on your controller's four face buttons faster than your opponent. Winning a fight nets you unlimited turbo for 30 seconds, which is handy. The fight sequences, while usually lasting less than a minute, are unsatisfying and come off as a chore you have to endure for the turbo bonus. Though you can expect to play some straight-up tennis games in the exhibition, tour, and multiplayer modes (both online and off), Outlaw Tennis is rife with bizarre variations, some of which feel more like drinking games than honest-to-goodness sports. There's the pretty mundane Ping-Pong game, which just adopts the table tennis scoring system. Hot potato plays like standard tennis, except for the introduction of a meter that gradually fills up and will cause the ball to explode once full. If the ball happens to be on your side of the court when it pops, then you're detonated in kind. The baseball and football games apply concepts from those particular sports to the scoring system, and pinball actually puts giant pinball bumpers on the court. They might make tennis purists cringe, but frankly, tennis purists seriously shouldn't be playing Outlaw Tennis anyway. Furthermore, these special rule sets do a good job of mixing things up, and they make the whole experience more engaging. There are roughly 16 different characters in Outlaw Tennis, and each and every one of them plays off some kind of crass stereotype or shallow caricature. Returning from previous Outlaw games are characters like Ice Trey, the white, affluent wannabe hip-hopper; El Suave, the sock-stuffing self-absorbed Latin lover; Donna, the loudmouthed, mildly hirsute Jersey bridge-and-tunnel trash; and, everyone's favorite, Summer, the blonde, leggy, and inherently promiscuous stripper-slash-PhD. The new characters are only somewhat more inspired, such as the tennis playing ninja, Bruce Lieberman, and the archetypal 1970s Nordic tennis pro, Sven Svenvenvenson. Just by the sheer volume of belabored sexual allusions and half-assed play on words, the humor occasionally strikes a chord. But for the most part, it just tries too hard and becomes tiresome. Some people will find Outlaw Tennis to be genuinely funny. But then again, some people really like Carrot Top. The point is that the gameplay is good enough that Outlaw Tennis could rely on it alone. If it offered just this and shed the in-your-face attitude, it would likely become much more broadly appealing. Aside from packing lots of really lame jokes, each character has unique stats that dictate how he or she handles on the court. These stats can be improved by going through a series of drills that generally teach you how to better control the ball, though in some rather unorthodox ways. One of the drills requires you to aim your shots at a conga line of butchers that's making its way toward a cow, while another has you defending tiny cities on your side of the court from malevolent ball-launchers, Missile Command-style. Underneath the wacky exteriors, these drills are no different from the skill-building exercises that Virtua Tennis put you through. They remain fun and effective nonetheless. The visuals in Outlaw Tennis don't really push the technical capacities of either the PlayStation 2 or Xbox hardware, but they're good enough as to not distract you from the action. The courts carry their bizarre themes fairly well, which range from a slaughterhouse to an Arctic outpost, though the textures can be inconsistent, and the crowds, while being pretty thin, still end up looking like 3D stick figures. The most care seems to have gone into the player models, which feature a good amount of detail and, aside from occasionally sliding eerily from side to side without actually moving their feet, feature some smooth, natural-looking animations. It's unfortunate that all the players seem to share the exact same set of animations, because it would have been nice to have seen some unique movement. The soundtrack in Outlaw Tennis is just all over the map. There's a jokey rap track ostensibly performed by Ice Trey, some straight-ahead house music, a jokey butt-rock song, some high-energy rap-rock, and so on. The soundtrack can't decide if it wants to be funny or really edgy, so what you end up with sounds like half of it was produced by Weird Al and the other half by Fred Durst. The Daily Show's Stephen Colbert provides the off-color commentary for the game, but his usually uptight, smarmy wit doesn't quite fit the rather bawdy material, and the commentary repeats often enough that lines which may have been funny at one point lose their potency through repetition. The in-game sound effects are pretty sparse, consisting mostly of some basic grunts and shouts from the players, as well as a smattering of crowd noise. They're not bad sound effects, but they're not exceptional enough to be worth praising. Bad attitude aside, Outlaw Tennis is a genuinely enjoyable tennis game. The difference in presentation between the PS2 and Xbox versions of Outlaw Tennis is noticeable. Textures look grainier and the player models aren't quite as smooth on the PlayStation 2 version. Additionally, there are sound effects in the Xbox version that seem to be just missing entirely from the PS2 version. The game is otherwise virtually identical between the two consoles, though the technical shortcomings of the PS2 version definitely make the Xbox version preferable. The Outlaw series has been on the verge of something great since its inception, and it seems like the game could easily achieve greatness were it not for the chronic compulsion to be all Jerry Springer. If you can get past that, though, Outlaw Tennis is a great value--from both a single-player and a multiplayer perspective--and it introduces some genuinely unique spins on the sport of tennis."}