{"ref": "https://www.gamespot.com/reviews/carnivores-cityscape-review/1900-2860681/", "date": "April 9, 2002", "game_name": "Carnivores: Cityscape", "text": "Since the ~hunting dinosaurs~ genre isn't an overcrowded one, the original Carnivores at least had a high novelty factor. For Carnivores: Cityscape, the fourth installment in the budget-priced series, Deer Hunter developer Sunstorm Interactive took over for Action Forms, the company that made the first three Carnivores games, and abandoned the hunting game structure of the series. Instead, Cityscape is a straightforward run-and-gun shooter. In this new format, the good will Carnivores received for being a clever twist on traditional hunting simulations is no longer applicable. What's left is a thoroughly second-rate action game. Cityscape is essentially a value-priced version of Aliens Versus Predator. However, in the budget tradition of feature removal, it only has two playable species. Each of the game's 20 levels can be completed as either a human or a dinosaur. Rather than having unique levels for the two campaigns, the levels generally remain the same with the mission goals inverted for the different species. For instance, if you have to rescue two scientists as a human, you'll have to eat two scientists as a dinosaur. Twenty levels may sound like a lot, but many of them are pretty tiny--a few involve little more than getting from one side of a room to another. In fact, the game's set of 20 levels is really five environments broken up into four small sections each, and the game is artificially lengthened by the fact that you can only save at the end of each section. As a human, you'll fight through levels populated with merely five different types of dinosaurs. Once they see you, the dinosaurs run straight at you, which is probably realistic, but doesn't make for great gameplay. As the Serious Sam games proved, simple enemy behaviors can still provide an interesting tactical challenge provided there are several different behaviors occurring simultaneously across a range of opponents. Cityscape's enemies all exhibit exactly the same attack pattern. As a result, combat is simply not very engaging. Since the combat is all there is, that's a real problem. The weapon selection is also threadbare. There are six weapons available in the game, from which you choose two to take on each mission (along with a default pistol). This lack of weapon variety further reduces the number of tactical choices you have to make in combat. Things aren't any better as a dinosaur. Instead of five types of enemies, you're pitted against the same human opponent with a few different weapon configurations. Instead of five types of weapons, you have one--your claws. Technically, you have a jump attack as well. So, if you're in a generous mood, you can call it two weapons. And unlike the Alien in the Aliens Versus Predator series, the dinosaur has no unusual and game-changing wall-climbing mechanic to master. It's essentially a human that has to punch enemies to death. The developers licensed the graphics engine used in Serious Sam, and the visuals are sporadically excellent. Graphically, the high point is a set of missions that takes place in a futuristic city at twilight. Though for every striking setting, there are two that appear to be big cubes with a few pipes running across the ceilings. A multiplayer deathmatch mode is included, along with a mode that permits up to eight people to play cooperatively through the single-player missions. This would be a pleasant surprise if anything about the gameplay were interesting enough to warrant assembling eight people to tackle it. Just so there's some historical record of it, there are actually two good things about Carnivores: Cityscape. The first is a mission that takes place on a darkened subway train. Each time the train passes through a lighted area of the track, the ambient light from outside briefly illuminates the interior. The confined space combined with the fitful lighting creates some real tension. The second good thing is the music, which is surprisingly well done. Other than those two things, though, Cityscape is a total wash. It may be half the price of Aliens Versus Predator 2, but--in an admittedly unscientific measurement--Aliens Versus Predator 2 is 10 times better. And that leads to the question you have to ask yourself with a lot of budget titles: Is a mediocre game for $20 really a better deal than a good game for $40?"}