{"ref": "https://www.gamespot.com/reviews/rugby-06-review/1900-6144287/", "date": "May 17, 2006", "game_name": "Rugby 06", "text": "For many Americans, rugby is sort of like the quiet girl in your high school art class. You know the one--she sits in the corner most of the time and doesn't talk much. Even when she does talk, she doesn't make much sense. But if spend a little time with her, you realize there's a lot there under the surface. That's an apt description for Rugby 06 too, the latest in EA Sports' rugby series. It's a fast-paced sports game that doesn't always make sense--especially at first--but, much like your wallflower classmate, turns out to be a lot of fun once you get to know it. And he's in for six! Err, make that five. At its heart, rugby looks a lot like American football. It has its equivalent to the touchdown, the field goal, and the extra point; it has big beefy guys holding the line up front, and speedy ball handlers who move the ball up and down the field; it has passes, it has kicks, and, perhaps most importantly, it has tackles galore. But it's the twists in the gridiron formula that make rugby its own entity. It's also those twists--once you're familiar with them--which make Rugby 06 an enjoyable game to play. Last year's game had a Rugby 101 tutorial with information on the basic elements of the game--from the distinctive backward passes that are indelible to the sport, to the finer points of the ruck and the scrum. The same tutorial is back this year, which means you'll have a pretty good idea of how to use the basic controls of the game, but not a very good understanding of when to use these varying mechanics. For that, you'll need to set up a match, start playing, and learn by trial and error. It takes a while to figure out, for example, why everyone is always punting the ball away. Unlike the NFL, there are no ~downs~ in rugby, so why would you ever want to give away possession of the ball? With enough experience, you'll realize that ball possession is not as important as field position. In a single half, you can expect possession to change many times. As a general rule of thumb, if you're caught deep in your own territory, it's best to simply punt the ball away--often out-of-bounds--as opposed to possibly turning the ball over and setting your opposition up for an easy score. To further assist you, Rugby 06 also features a basic training tutorial that teaches you some of the finer points of player control, such as the side step, the shoulder charge, and the hand off. Unfortunately, the default sideline camera angle makes some of these control mechanics--such as the side step--difficult to pull off on a regular basis. Unlike regular matches, where you can change the camera angle to a much more player-friendly end-to-end view, the sideline view in the basic training drill cannot be changed. Rugby 06 features designed plays (also known as set plays) that unfold on the field in predetermined fashion, and at the higher difficulty levels you're going to need to be familiar with how plays like the dummy switch and the miss pivot work. While the game does give you the ability to practice set plays, it doesn't give you much more than a basic diagram of how the play is drawn up. It's conceivable that if you stare at the diagrams long enough, you'll figure them out. However, a bit more context--or even a more in-depth set-play tutorial beyond the nominal introduction video in the game--would have been welcome. You think NFL guys are tougher than rugby guys? Go ahead and tell him that. That said, you don't need to be a master rugby tactician to have fun with Rugby 06. Dive into a game on club-level difficulty (the lowest level available) and you'll likely have a good time running around willy-nilly, making those strange backward passes and kicking the ball all you like, without getting beat up too badly by the competition. The kicking controls are unchanged from last year's game and, once again, trying dropkicks (the rugby equivalent of a field goal) is all but impossible with the sideline view in the game, as you just don't get a good enough view of the angle on the field-goal uprights. Once you've got some matches under your scrum cap, you can bump the difficulty up to pro or elite levels and really get a feel for some of the improvements that have been made to Rugby 06's gameplay. Most importantly, control tweaks such as the off-load passes, quick penalties, and quick line-outs add to the overall pace of the game and give you more options than ever for keeping the ball moving. The off-load pass is an especially important addition, as it gives you the ability to pass the ball to a teammate while being brought down by a defender. Players are generally smart when passing the ball in a tackle, though it's important to use it at the right time. If you attempt a pass when no teammates are around, you're setting yourself up for an easy interception. Once you've played with off-load passing for a while and realize its value to keep a play moving, you'll wonder why it was ever missing from previous games in the series in the first place. Similarly, quick penalties and quick line-outs are also opportunities for you to keep the pace of the game moving. The quick-penalty feature lets you take certain penalty kicks instantly to keep up the offensive pressure. Quick line-outs let you toss the ball out from the sidelines without having to get into the typical three-layer line-out setup. Neither of these are available to you all the time and, frankly, it isn't always clear why you can do a quick penalty or a line-out in one spot but not in another. But, nonetheless, these moves most definitely keep things exciting and are welcome additions to the game. Line-outs sort of look like male cheerleading routines. Beyond these additions, there have been some other improvements to Rugby 06. For one thing, the players on the field seem to move in a more natural way this year. The ~school of fish~ running that was pretty obvious in last year's game has been toned down this time, and the result is a more natural look to the action on the pitch. In fact, the artificial intelligence on pro level (the medium difficulty level) is more tenacious than ever on offense--especially when threatening in your ~red zone~--and smarter on defense as well. Running the loose forward directly out of a ruck without passing the ball back--the equivalent of an NFL quarterback sneak--meets with far less success than it has in the past. Still, things aren't perfect. Ball physics can be odd, especially on long cross-field kicks that have a left or right wing or fullback running to catch the punt. Even if the ball isn't close to them, it will often warp into their hands and give them plenty of open field to run as a result. At some points in a match, the AI-controlled opposition seems to be confused if you run up the middle of the field at an angle, and so it chooses to run beside you instead of going for the tackle. Finally, we're not huge fans of the line-out mechanic, which still feels too much like a game of rock-paper-scissors. With no online play available, it's Rugby 06's nine available tournaments that will provide the lion's share of the value here. With series such as the Ten Nations, the RBS 6 Nations, the Guinness Premiership, and the World League all available to you, you won't lack for variety when it comes to getting your rugby tourney on. The teams available to you vary between tournaments. The Super 14, for example, features teams from New Zealand, Australia, and South Africa, while the World Championship features national teams from the likes of Romania, USA, Namibia, and traditional powerhouses like Fiji, Wales, and Ireland. Depending on the tournament you choose, you can pick authentic schedules (such as the 1999, 2003, or 2007 World Championship schedules) or you can completely randomize your fixtures. If you're looking for something akin to a general manager mode, you'll want to spend your time in Rugby 06's World League tournament. Here you'll be charged with taking the reigns of a Division 3 team, such as Treviso or Ulster, and completing team goals like reaching the semifinals of the Knockout Cup or earning a promotion to the next division at the end of the season. Regardless of your specific goals, your best bet is winning games--the more you win, the more secure your job will be. As the boss, you'll also have funds to transfer players and recruit new talent to your team. It's nice to have this kind of mode available, especially considering the loads of authentic teams and players found in the game. But, for those who aren't intimately familiar with rugby clubs and personalities, it's simply more fun to be on the field and bashing heads. Because the field of view in Rugby 06 is so large, you don't really get a feel for individual players on the pitch, which is probably why the player models themselves aren't that detailed. However, that sacrifice in quality means that the game runs at a smooth clip, which is a fair trade. Tackle animations are varied and pack a solid punch, even though the lack of gang-tackle animations is an obvious omission. Player uniforms gather dirt and grime as matches continue, while the pitch itself doesn't take nearly as much of a visual beating as the players do. If you can make heads or tails of this, you can run set plays in Rugby 06. Many of the tracks found on Rugby 06's soundtrack are probably just as annoying to European folks as EA Sports' Trax licensed tunes are to us in games like NBA Live 06. To our ears, though, the mix of jangly rock from the likes of The Rivers and the sinister stomp of Mainline are just different enough to be charming in Rugby 06. Commentary duties from Ian Robertson and Grant Fox are serviceable and mostly accurate to the action on the pitch as well, and new lines seem to be delivered with a bit more gusto than last year. Thanks to some crucial new control mechanics, the introduction of star impact players that can blow a match wide open, real clubs and players, and a faithful re-creation of the high-impact sport of rugby, Rugby 06 improves on last year's effort and remains an engaging and fun game. If you've never played a rugby game before, this will serve as a good introduction, provided you're willing to stick with it. If you're looking for a change in your sports-gaming doldrums and are into learning something new, Rugby 06 is a good choice. Similarly, quick penalties and quick line-outs are also opportunities for you to keep the pace of the game moving. The quick-penalty feature lets you take certain penalty kicks instantly to keep up the offensive pressure. Quick line-outs let you toss the ball out from the sidelines without having to get into the typical three-layer line-out setup. Neither of these are available to you all the time and, frankly, it isn't always clear why you can do a quick penalty or a line-out in one spot but not in another. But, nonetheless, these moves most definitely keep things exciting and are welcome additions to the game. Line-outs sort of look like male cheerleading routines. Beyond these additions, there have been some other improvements to Rugby 06. For one thing, the players on the field seem to move in a more natural way this year. The ~school of fish~ running that was pretty obvious in last year's game has been toned down this time, and the result is a more natural look to the action on the pitch. In fact, the artificial intelligence on pro level (the medium difficulty level) is more tenacious than ever on offense--especially when threatening in your ~red zone~--and smarter on defense as well. Running the loose forward directly out of a ruck without passing the ball back--the equivalent of an NFL quarterback sneak--meets with far less success than it has in the past. Still, things aren't perfect. Ball physics can be odd, especially on long cross-field kicks that have a left or right wing or fullback running to catch the punt. Even if the ball isn't close to them, it will often warp into their hands and give them plenty of open field to run as a result. At some points in a match, the AI-controlled opposition seems to be confused if you run up the middle of the field at an angle, and so it chooses to run beside you instead of going for the tackle. Finally, we're not huge fans of the line-out mechanic, which still feels too much like a game of rock-paper-scissors. With no online play available, it's Rugby 06's nine available tournaments that will provide the lion's share of the value here. With series such as the Ten Nations, the RBS 6 Nations, the Guinness Premiership, and the World League all available to you, you won't lack for variety when it comes to getting your rugby tourney on. The teams available to you vary between tournaments. The Super 14, for example, features teams from New Zealand, Australia, and South Africa, while the World Championship features national teams from the likes of Romania, USA, Namibia, and traditional powerhouses like Fiji, Wales, and Ireland. Depending on the tournament you choose, you can pick authentic schedules (such as the 1999, 2003, or 2007 World Championship schedules) or you can completely randomize your fixtures. If you're looking for something akin to a general manager mode, you'll want to spend your time in Rugby 06's World League tournament. Here you'll be charged with taking the reigns of a Division 3 team, such as Treviso or Ulster, and completing team goals like reaching the semifinals of the Knockout Cup or earning a promotion to the next division at the end of the season. Regardless of your specific goals, your best bet is winning games--the more you win, the more secure your job will be. As the boss, you'll also have funds to transfer players and recruit new talent to your team. It's nice to have this kind of mode available, especially considering the loads of authentic teams and players found in the game. But, for those who aren't intimately familiar with rugby clubs and personalities, it's simply more fun to be on the field and bashing heads. Because the field of view in Rugby 06 is so large, you don't really get a feel for individual players on the pitch, which is probably why the player models themselves aren't that detailed. However, that sacrifice in quality means that the game runs at a smooth clip, which is a fair trade. Tackle animations are varied and pack a solid punch, even though the lack of gang-tackle animations is an obvious omission. Player uniforms gather dirt and grime as matches continue, while the pitch itself doesn't take nearly as much of a visual beating as the players do. If you can make heads or tails of this, you can run set plays in Rugby 06. Many of the tracks found on Rugby 06's soundtrack are probably just as annoying to European folks as EA Sports' Trax licensed tunes are to us in games like NBA Live 06. To our ears, though, the mix of jangly rock from the likes of The Rivers and the sinister stomp of Mainline are just different enough to be charming in Rugby 06. Commentary duties from Ian Robertson and Grant Fox are serviceable and mostly accurate to the action on the pitch as well, and new lines seem to be delivered with a bit more gusto than last year. Thanks to some crucial new control mechanics, the introduction of star impact players that can blow a match wide open, real clubs and players, and a faithful re-creation of the high-impact sport of rugby, Rugby 06 improves on last year's effort and remains an engaging and fun game. If you've never played a rugby game before, this will serve as a good introduction, provided you're willing to stick with it. If you're looking for a change in your sports-gaming doldrums and are into learning something new, Rugby 06 is a good choice."}