{"ref": "https://www.gamespot.com/reviews/evil-dead-the-game-review-somewhat-groovy/1900-6417881/", "date": "May 20, 2022", "game_name": "Evil Dead: The Game", "text": "Horror fans are living in a golden age. It seems like a few major horror franchises are adapted into games every year, most often in the asymmetrical multiplayer genre. Casting a group of friends as hapless survivors against another player hunting them as a supernatural foe is a great idea on paper every time, even as end results can dramatically vary. Evil Dead: The Game doesn't stray far from this foundational premise. However, it smartly leans on its B-movie hijinx to deliver fans something worthy of being in their horror game rotation, even if it doesn't have the soul to swallow all of their time single-handedly.While Evil Dead: The Game is its official title, you could rightly call it Fan Service: The Game instead. Drawing from the original three movies and the Starz series--sorry, reboot fans--Evil Dead beams with pride and fandom from its developers, collecting all manner of weapons, Easter eggs, locations, and corny one-liners that made the series famous. Original actors are brought back in most cases, including the all-important Bruce Campbell, whose many versions of Ash Williams make up a good portion of the character roster.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Evil Dead: The Game Video ReviewWandering across the game's several large maps can feel like a museum tour through one of horror's cult-favorite franchises. The audio and visuals lend themselves to this glowing first impression, too. Music straight from the series and faithful character models--including the nauseatingly detailed Deadites--makes Evil Dead: The Game feel as lovingly crafted as the movies.I do wish the characters had more voice lines, however. There are only so many times I can hear Ash make the same joke about his flashlight before the B-movie hero loses his luster. Thankfully, much of the game's other overt fan service sets an enjoyable scene to play within. Stepping into the Knowby Cabin fills me with the same sort of wonder a child might feel when they first cross the threshold into Disneyland. While the woods of Evil Dead are notches below iconic settings like Elm Street or Camp Crystal Lake, the swirling winds give each map a recognizable feeling of uneasiness and oppression, even as it's all still mixed with the campy series' odd hatchet-wielding monsters wearing puffy vests.This set-dressing makes Evil Dead a game loyal to its source material, but in trying to be so faithful, sometimes the gameplay suffers. The game's central mode is Survivors versus Demons, and while the four survivors are played by humans, the monster opposing them can be battled in PvE or asymmetrical PvP. Cleverly, the demon player does not control just one Deadite, but acts more like the director of each round's chaos.As the demon, you can float around the map unseen to survivors, set traps, spawn enemies, or briefly possess the bodies of Deadites or even survivors if you scare them enough. Playing as the monster is unpredictable because you're first tasked with hunting down the survivors, then ruining their chances of winning, but as the survivors, the objectives are much more routine, and as a result they can become boring.Because the movies focus so much on the Book of the Dead and a very specific ritual for exorcising the Deadite infestation, the multiplayer objectives don't ever stray from that canon path. In a game like Friday the 13th, part of the excitement is the number of ways survivors can win: calling the cops, killing Jason, escaping in a vehicle, and so on. But in Evil Dead, the same exact steps must be taken to win in every single round: find three map fragments, survive two short horde waves, then kill the Dark Ones--which tends to feel too easy--before protecting the Necronomicon while a final two-minute countdown unfolds. It's formulaic in service to its source. Sure, the location of key items like map fragments will vary from round to round, but it starts to feel rote after just a few hours.One refreshing change Evil Dead does bring to the genre is survivors who can fend for themselves. In similar games, the survivors' choices essentially boil down to running or dying, but those seeking the Necronomicon can equip weapons found as tiered loot, upgrade their abilities both during and between rounds, and, when working closely together, leave the demon player or AI with very little room for error.The class-based heroes each have special abilities that promote organized teamwork, like a healing ability for Support characters and a calming effect that the game's Leaders can apply so the rest of the group keeps their cool in the face of danger--without this, characters' fear meter can rise, leaving them vulnerable to possession. Survivors can slash and bash heads off of monsters and apply amulets like body armor, standing toe to toe with hordes of Deadites at a time.The melee animations can be a bit janky, as finishers will lock you into kill animations while your allies may still be slashing and shooting at the same enemy for a moment thereafter, but an easy-to-learn dodge mechanic and rather small health bars give combat some much-needed tension in even run-of-the-mill enemy encounters. It looks messy in practice, but it's as reliable as it needs to be.Out of the gate, the game actually feels slightly unbalanced in favor of the survivors, as the demon's ability cooldowns can be lengthy and unforgiving. In a round where both teams are playing at a high level, it feels like the early objectives are weighted toward the demon, while the latter objectives favor the survivors, which means any demon player who struggles to find the group fast is likely boxing themselves out of a win. It's fun to be able to possess the survivors as the demon, taking unabated control of their bodies for a short while, which lets you hack away at their friends or run them away from objectives and toward other dangers in isolation, but a group of survivors playing like a well-oiled machine is basically insurmountable even for an adept demon player.Like a lot of games of this nature, Evil Dead is best played with a group of friends, and the experience often degrades when played with strangers online. Worst of all, those who want to play the game totally alone will find Evil Dead to be hostile toward the preference. Playing in solo PvE lobbies awards you with no experience points, so you can't unlock new character abilities, and the game's short run of campaign missions doesn't add much to the experience. Each is inspired by scenarios from the series, like Ash needing to bury his girlfriend Linda's severed head while the demon inhabiting her oscillates between mocking him and pleading for his mercy.That's a fun nod to the first two movies, but it's also hard to see each of the game's five missions (a sixth mission is planned for release later) as anything other than a 20-minute detour away from the game's true mode, which actually doles out XP and has progression.The series' focus on Ash Williams means about a third of the class-based roster is just different versions of the protagonist from the last 40 years. It's neat to see different versions of Ash are given different classes, such as Hunter, Support, or Leader, to reflect his character growth over the years, but when I load into a game and the entire team is a different version of Bruce Campbell, it's a reminder that this franchise doesn't actually have many characters and isn't as suited to a game like this as other series.At least no matter who you play as, the XP system is welcoming. There is both character XP and account XP, and you can spend the latter on any character you'd like. This is very helpful, as it means even if your preferred survivor is claimed by another player for a round, you can finish out the match and commit your account XP to your favorite character. Alternatively, you could min-max one hero or villain at a time and double down by moving all XP gains into a single character.The XP rewards are slow and require a lot of time to max out even just one character, but like the aforementioned demon cooldowns, this is an issue that could presumably be solved with a basic patch. It's not game-breaking by any means, but in its current state, it definitely needs some work.Evil Dead: The Game is faithful, but sometimes to a fault. If there were more game modes or even more varied objectives in its one attractive game mode, it would feel more like a game for horror fans to play for a long time, maybe even moving competitors like Dead By Daylight or Hunt Showdown off their vaunted pedestals. As it stands at launch, however, Evil Dead only reaches beyond something pretty good when it's played with a close-knit group of Evil Dead fans. General horror or co-op enthusiasts may get some mileage out of it, but Ash and his boomstick are storming into a crowded field of competitors and can't quite overcome the horde of similar games already available."}