{"ref": "https://www.gamespot.com/reviews/kentucky-route-zero-act-iv-review/1900-6416491/", "date": "August 4, 2016", "game_name": "Kentucky Route Zero", "text": "The very first image you see in Act IV of Kentucky Route Zero is a mammoth. Not a real mammoth, though that wouldn't surprise anyone familiar with this series. No, a slow pull-away shot reveals the ostentatious, animatronic figurehead at the front of the Mucky Mammoth, a cramped yet lively boat helmed by a college dropout named Will who is supposed to be writing a book based on his college research.The vessel at Will's command is ferrying travelers down Lake Lethe, one of Kentucky Route Zero's literary references that may ultimately mean everything or nothing. If the allusion was deliberate, then its likely the Lethe of Greek myth, the waters where the dead come to forget who they once were so they can travel through the afterlife unburdened. It would explain quite a bit about Kentucky Route Zero up to this point, though nothing about the series has offered such an easy explanation so far.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Kentucky Route Zero Act IV - Observational TrailerIf Lethe is merely a name, its simply a place of respite, fair greetings, and weary, nostalgic travels for the denizens of the abstract nowhere place Kentucky Route Zero portrays. It could be this, but that also wouldnt explain all the magic that has happened, does happen, and will happen while traversing its space.Ultimately, there isn't a wrong or right answer because Kentucky Route Zero isn't a game about answers, but of journeys. Theres an overarching plot--the deceptively mundane quest to deliver grizzled old trucker Conway's last load of antiques to Dogwood Drive--but that started to become a tertiary concern somewhere around Act III. That isnt to say that Act IV suffers for it. Almost effortlessly, it upholds the same captivating writing and storytelling of its predecessors. All it means is that the focus is shifting. At some point, the end goal lost priority to experiencing the trip with Conway's cohorts and finding a new purpose along the way.Suddenly, Conway is no longer our anchor to Kentucky Route Zero's strange universe. Instead, the entirety of the episode takes place aboard the Mucky Mammoth as it sails across Lake Lethe, making frequent stops along the way. The gameplay is still fundamentally the same, using rudimentary point-and-click mechanics to let you nagivate small environments. You select dialogue and actions from a menu at certain points, but they dictate the flow of a conversation for its own sake rather than garnering good/evil points as you careen toward a moment of reckoning.In this episode, each stop the Mucky Mammoth makes gives you the opportunity to choose a perspective. The child, Ezra, might stay on the boat to pick up strange sounds with a tape recorder, listen to recordings of Will's university lectures on the nature of death, or choose to follow his friends ashore to play in the woods. What you learn about life, other people, and the seemingly endless cruise down the lake is entirely in the player's hands, and the only compass is one's own curiosity.If there is anything resembling a consequence of the change in perspective, Act IV does lack a certain urgency compared to its predecessors. Acts I through III made it very easy to become lost in a character's story--stuck in a loop of Moebius strip highways trying to find the next destination or very literally transported somewhere else by a song. There was still a true north through it all, however, in Conway's search for the Zero, the route to reach Dogwood Drive and complete his last run. He would still get lost and injured, but there was always the end to consider.True north no longer exists here. The events of Act III caused Conway to surrender to his new duties ahead of schedule, making his dedication to finding Dogwood Drive unreliable at best. Act IV flits among the rest of his menagerie instead, their disparate journeys showing the first signs of divergence toward a new purpose.Act IV reinforces the general feeling of the first three acts, the persistent theme of obsolete people coming to the Zero to do obsolete jobs, where the only reward is the work itself. The American Dream is in perpetual deferment here, never to be achieved by those who live there but something to be built on the foundations of their hard work.When Johnny and Junebug stop at a floating gas station for snacks, the attendant speaks of his lowly duty as isolating but dignified, a step in a larger journey for others. There's something spiritual about being the engine behind the wonders of the world, and this act, in particular, has nothing but reverence for that idea. It's beautiful as a result--a beauty reflected in the brief, impressive glimpses we get of the world outside the Zero, a sumptuous, painterly place of color and abundance.Its not enough to say that theres nothing like Kentucky Route Zero. An intentionally threadbare but powerful art-style draws you into a spellbinding tale of accepted loss that's relatable in ways few games ever are. Theres power, wonder, even a bit of existential dread to be found in even the shortest conversation. Theyre feelings that make this act's new, diverging path, an extraordinary experience.We're no closer to understanding the meaning behind this journey through Kentucky Route Zero, and it's hard to say if we'll even arrive at the point of it all during the game's fifth and final act. But Act IV proves the journey is everything, and what people take from and give to each other--even in the most desolate, purgatorial version of America imaginable--still matters. It's heartening thinking about what other players might take away from the stories shared during our motley crew's time sailing Lake Lethe--and what it might spur them to do in the real world."}