{"ref": "https://www.gamespot.com/reviews/the-sims-online-review/1900-2908060/", "date": "January 6, 2003", "game_name": "The Sims Online", "text": "The Sims Online is the online version of the best-selling PC game in history, so you might expect it to be a guaranteed success. And while it does take everyone's favorite little computer people in an interesting new direction, at this point in time, there's much less for players to do in the online game than in the original game. In the original game, you are the creator, designer, and controller of an entire neighborhood of computerized people, or sims, and you're free to build and tear down homes, and give various orders to your family of sims, as you see fit. In The Sims Online, you play as only one character, with very few options and very limited control over your environment, and since the game takes place in a persistent world, you can't simply tear everything down and start over from scratch when you want a change of scenery. The Sims Online also currently lacks several features--such as a functional player-driven economy--that probably should have been implemented and tested before the game was released to retail. Then again, The Sims Online is enjoyable enough for its various social interactions. If you're the sort of person who enjoys chatting with other people online in chat rooms or message boards, you'll enjoy using The Sims Online's great variety of expressive and humorous character animations to interact with other players. Starting a new game in The Sims Online seems easy enough--you create a male or female sim from a series of different heads, bodies, and skin colors and then jump into one of the game's different towns. Just as in the original game, your sims will be limited by their own needs, such as hunger, bladder, and energy, so you'll need to periodically drop everything and eat, take a bathroom break, or sleep. However, from there, things aren't quite as clear-cut. You might intuitively think that the first thing you should do is buy your own lot to build your own house, but as things stand right now, it's not a very useful option. All sims start with a bank balance of 10,000 simoleans (The Sims' equivalent of dollars), and building even a small house filled with standard amenities, like restrooms, beds, and a simple refrigerator, will completely exhaust your starting balance. It's currently a much better idea to visit a house that was built and furnished by other players and then attempt to join up as a roommate, or just visit houses to improve your skills and make money so you can save up for a place of your own. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: The Sims Online Video Review Currently, the most efficient way to make money is to improve a certain money-making skill for your sim (based on the original skills of charisma, body, logic, mechanical, creativity, or cooking from the original game) and then repetitively use a ~job object,~ such as a telemarketing phone or a chemistry set. Unfortunately, improving your skills is a repetitive task in and of itself, and you'll frequently walk into a richly furnished house and find that instead of throwing a lavish party, all the players in the house are frantically playing chess to improve their logic skill. Though in some cases, everyone else will be too absorbed building their skills to talk, you'll still be able to use these meetings as an excuse to strike up a conversation with other players. However, making money isn't much more interesting--though a few of the game's job objects, such as the pizza machine, require the cooperation of several players at once, they're about as repetitive to use as skill objects are. Job objects and skill objects are much more effective when used in groups. But that means that trying to improve your skills or make money at home by yourself is so slow and so inefficient by comparison that it's essentially the ~wrong~ way to play--for instance, you can improve your skills 10 times faster in a group than you can alone. As such, much of The Sims Online's gameplay consists of going to different houses and using other peoples' skill objects and job objects repeatedly in groups in the hope that you'll eventually be able to save up enough money to build a similar house of your own. But the game's economy is currently so underdeveloped that houses stocked with a number of the same objects are both the only way to make any money and the only real thing you can spend money on. The game's development team has stated that it has plans in the works to further develop and diversify the game's economy. However, after spending hours with your sim's nose alternately in a book studying mechanical skill and at the grindstone feverishly carving lawn gnomes for money, you'll probably agree that these forthcoming additions should have been implemented and tested during the game's beta phase, before the game was actually released.It's difficult to avoid comparing The Sims Online with the original game, especially since the two games look and sound virtually identical. Nearly all The Sims Online's characters, objects, music, and sound samples have already appeared in The Sims and its various expansion packs. The game's graphics are still colorful, and the animation of the blocky, polygonal 3D sims is just as clever and funny as it's always been. Then again, if you've been playing The Sims for a while, you'll probably have a hard time getting excited about looking at the same old graphics and listening to the same old sound samples, many of which are extremely dated, since they've been around since 2000. And just like the original game, The Sims Online has a sluggish camera that scrolls extremely slowly. The Sims Online seems to have slightly better pathfinding for its sims--they're much better about traveling from one place to another past obstacles and doors, though they'll still occasionally get confused by a single chair blocking their way. A common sight in The Sims Online. Many players use skill objects at once to increase their skills. Unfortunately, The Sims Online also has a number of issues that weren't a problem in the original game. The Sims Online is currently plagued by brief but annoying periods of lag, even over a broadband connection, though its performance has improved since release. Furthermore, The Sims Online itself seems much more restrictive than the original game. For example, because the game's world is persistent, you can't build or tear down houses and lots whenever you wish--in fact, it'll take you quite a while to save enough cash to even build a decent house. You can't build a sizeable house unless you have some roommates, so you'll have to agree on a house layout, rather than just building what you want. And just about every sim you'll meet in the game will be controlled by another human, which opens up opportunities for socializing but removes the random, computer-controlled sim behavior that helped make The Sims such an intriguing game in the first place. Then again, for some players, the social interaction is more than enough reason enough to play. If you've ever visited a chat room or an Internet message board and had fun adding jokes and smiley-face emoticons to your messages, you may find The Sims Online to be your new chat room of choice. The Sims Online's many humorous animations and sound samples take the emoticon to the next level. Instead of replying to a funny message in an Internet forum by typing, ~Ha ha, that was funny,~ you'll actually be able to make your sim express your feelings by performing one of many different animations that let you chat and role-play as a certain kind of character, and you can even unlock new social animations if you improve your skills or make new friends online. That is, as long as your character is reasonably polite to other players, doesn't violate the game's terms of service for player behavior, and takes frequent breaks to eat, sleep, and go to the bathroom. Just like in the original game, you can't create an ~evil~ sim by mistreating it, as a starving or exhausted sim will simply become useless and refuse to follow orders. And if you attempt to play as a rude, offensive sim, you may find that other players will get upset at you, rather than play along. Many house owners will often throw parties in which your sim can use group objects to interact with other players, and these serve as good opportunities to meet with other sims and even incorporate them into your friendship web, an online network of friends that measures how popular your sim is in the game. However, the friendship web, like the game's economy, doesn't seem developed enough to be worthwhile at this point in time. At least The Sims Online has amusing character animations to help you chat with other players. For players who aren't already fans of the series, The Sims Online probably won't offer enough to persuade them to keep playing and paying the game's monthly fees. Even though it had tremendous potential, The Sims Online currently isn't a complete game--several of its features are incomplete, and the game itself seems rather limited as a result, despite the fact that it affords you plenty of opportunity to chat with other, like-minded players. Though the game's developer plans to make many additions to the game, for now, The Sims Online lacks many of the options that made the original game so intriguing, and it doesn't really replace them.It's difficult to avoid comparing The Sims Online with the original game, especially since the two games look and sound virtually identical. Nearly all The Sims Online's characters, objects, music, and sound samples have already appeared in The Sims and its various expansion packs. The game's graphics are still colorful, and the animation of the blocky, polygonal 3D sims is just as clever and funny as it's always been. Then again, if you've been playing The Sims for a while, you'll probably have a hard time getting excited about looking at the same old graphics and listening to the same old sound samples, many of which are extremely dated, since they've been around since 2000. And just like the original game, The Sims Online has a sluggish camera that scrolls extremely slowly. The Sims Online seems to have slightly better pathfinding for its sims--they're much better about traveling from one place to another past obstacles and doors, though they'll still occasionally get confused by a single chair blocking their way. Unfortunately, The Sims Online also has a number of issues that weren't a problem in the original game. The Sims Online is currently plagued by brief but annoying periods of lag, even over a broadband connection, though its performance has improved since release. Furthermore, The Sims Online itself seems much more restrictive than the original game. For example, because the game's world is persistent, you can't build or tear down houses and lots whenever you wish--in fact, it'll take you quite a while to save enough cash to even build a decent house. You can't build a sizeable house unless you have some roommates, so you'll have to agree on a house layout, rather than just building what you want. And just about every sim you'll meet in the game will be controlled by another human, which opens up opportunities for socializing but removes the random, computer-controlled sim behavior that helped make The Sims such an intriguing game in the first place. Then again, for some players, the social interaction is more than enough reason enough to play. If you've ever visited a chat room or an Internet message board and had fun adding jokes and smiley-face emoticons to your messages, you may find The Sims Online to be your new chat room of choice. The Sims Online's many humorous animations and sound samples take the emoticon to the next level. Instead of replying to a funny message in an Internet forum by typing, ~Ha ha, that was funny,~ you'll actually be able to make your sim express your feelings by performing one of many different animations that let you chat and role-play as a certain kind of character, and you can even unlock new social animations if you improve your skills or make new friends online. That is, as long as your character is reasonably polite to other players, doesn't violate the game's terms of service for player behavior, and takes frequent breaks to eat, sleep, and go to the bathroom. Just like in the original game, you can't create an ~evil~ sim by mistreating it, as a starving or exhausted sim will simply become useless and refuse to follow orders. And if you attempt to play as a rude, offensive sim, you may find that other players will get upset at you, rather than play along. Many house owners will often throw parties in which your sim can use group objects to interact with other players, and these serve as good opportunities to meet with other sims and even incorporate them into your friendship web, an online network of friends that measures how popular your sim is in the game. However, the friendship web, like the game's economy, doesn't seem developed enough to be worthwhile at this point in time. For players who aren't already fans of the series, The Sims Online probably won't offer enough to persuade them to keep playing and paying the game's monthly fees. Even though it had tremendous potential, The Sims Online currently isn't a complete game--several of its features are incomplete, and the game itself seems rather limited as a result, despite the fact that it affords you plenty of opportunity to chat with other, like-minded players. Though the game's developer plans to make many additions to the game, for now, The Sims Online lacks many of the options that made the original game so intriguing, and it doesn't really replace them."}