{"ref": "https://www.gamespot.com/reviews/bittrip-core-review/1900-6213204/", "date": "July 9, 2009", "game_name": "Bit.Trip Core", "text": "Bit.Trip Beat was a retro take on the rhythm genre that utilized the Nintendo Wii's motion controls in a Pong-meets-Rez experience. Though it adheres to the same basic design aesthetic and Technicolor palette as its predecessor, Bit.Trip Core plays remarkably different thanks to a radically new control scheme and added shooter elements. This new experience remains faithful to the series' style while offering an entirely different type of challenge, and though it makes some of the same mistakes as Bit.Trip Beat, it's the better game. If you're on the lookout for a fun and engaging music-themed action game that packs a punch, this is it. The plot's not really a huge thing here, and the brief, dialogue-free cutscenes that show up are devoid of context. What is important is that you control the immobile plus-sign-shaped ship in the center of the screen, and you've got to shoot down the jumbo pixels called beats as they soar past in order to continue your adventure. With the Wii Remote on its side, you hold down one of the four directions on the D pad and hit the 2 button to fire a beam of energy from your craft that can strike down however many beats may be in its path. As you progress through each of the three levels, the attack patterns of the beats become harder and harder to decipher. However, as long as you stay focused and are able to keep the tempo--which the game helps out with by gently vibrating the controller in sync with it--you should be able to figure them out. It may take a few tries, and if you find yourself in need of some extra help, you've got a single bomb per level that can clear out every beat onscreen, and you can bring in a friend for some co-op action at any time by turning on a second controller. Having two players doesn't change the levels in any way, but it doesn't simplify things as much as you may think, because divvying up the four directions and sticking to the plan is often challenging by itself. Each level in Core is a single chiptune, or synthesized song about 15 minutes in length that you play an integral part in. As your shots find their marks, you add a musical bleep or bloop to the background track, and every time you collect the rainbow-colored transition beats that separate each song into smaller segments, you add another musical layer onto the constantly evolving whole. By hitting multiple beats in a row, you build up a combo chain, which in turn fills your mega meter and eventually graduates you to higher scoring modes. If you miss a beat, your chain is broken and your nether meter is increased, which can drop you down to lower scoring modes until you're eventually reduced to a music-less black and white netherworld. If you fail again in this purgatory, it's game over--but if you hit enough beats, it's back into the land of the living. This unique system is not only fun and addictive but fair as you always get a chance to bounce back and turn a losing streak into victory. Each level is capped by a fun, surprising, and memorable boss encounter modeled after a classic arcade game, and these battles test your skills to their absolute limits. With practice and plenty of hand-eye coordination, you too will figure out how to pass waves like this! Besides making the transition from motion controls to more dexterous button manipulation, Core includes a number of visual improvements over its predecessor. The backgrounds, while still bright, psychedelic, and crazy, don't seem quite as distracting, making it a bit easier to distinguish beats and take them out. It's always easy to see your current scoring level now as its name thumps along with the background rhythm near the center of the screen, and there's now a visual indication of how far along you are in each song. Despite these improvements, though, Core still falls prey to some of the problems that plagued its forerunner: it's still an all-too-brief experience, but more importantly, there still aren't any online leaderboards. With a completely different type of gameplay and control, Bit.Trip Core puts an engaging rhythm-based twist on the bullet-hell shooter genre. Figuring out each wave of attack from all four directions and learning how to counter them is difficult but rewarding, and the new mechanics improve upon the already strong foundation set by Bit.Trip Beat even though there still aren't online leaderboards. If you've got 600 Wii points ($6.00) to spare and are looking for a challenge that will keep you and your friends coming back for more, you will be hard-pressed to do better than Bit.Trip Core."}