{"ref": "https://www.gamespot.com/reviews/i-ninja-review/1900-6085910/", "date": "May 17, 2006", "game_name": "I-Ninja", "text": "For most of the tenure of modern electronic entertainment as we know it, ninjas have been a staple theme. Though I-Ninja, Argonaut's new third-person action game, features a ninja protagonist who fights swarms and swarms of evil ninjas, the ninjitsu is not taken terribly seriously. Even the Teenage Mutant Ninja Turtles present a more somber take on the hidden art, and this Namco-published game has more in common with the likes of Super Monkey Ball and Ratchet & Clank than something like Tenchu. The quality of the game is largely dictated by its influences, though, luckily for I-Ninja, it chose some good games to imitate. I-Ninja wears its influences on its sleeve, but it chooses some great games to emulate. The story in I-Ninja doesn't make very much sense. The game starts off with our hero (known only as Ninja) as he discovers a powerful ~rage stone.~ Ninja then flips out and beheads his sensei. The ghost of his sensei shows up shortly thereafter to let Ninja know about an evil scourge of synthetic ninjas who must be stopped. Following this revelation, Ninja is off to save the day. There's a little bit of humor tucked into the corners of I-Ninja, such as the inclusion of the sensei's quirky habit of mixing metaphors to confusing effect. Aside from a few laughs, the story doesn't offer much else. The narrative's pacing is manic and disjointed, and it introduces and discards characters in the same breath. There isn't much time spent dwelling on character backgrounds or motivations either. This, coupled with the game's already isolated mission structure, sort of gives you the feeling that you're playing through an episodic adventure, and you're missing a few chapters. Though each level of I-Ninja is punctuated by a boss fight that introduces some proprietary control scheme, I-Ninja plays pretty much the same from start to finish, thus presenting you with the rudimentary challenge of getting from one end to the next in each level. The means to success, however, can vary greatly, as Ninja is a versatile guy. When you need to fight, which is pretty often, you can get up-close and personal with your sword, or you can take out enemies from afar with shuriken or explosive darts. You'll also happen upon cannons of various shapes and sizes, which are handy not only for dispatching large groups of enemies but for knocking down doors and destroying various obstacles. Aside from being handy with a blade, Ninja is quite nimble too. He can run, jump, double-jump, and use his sword as a helicopter for a slow-descent glide effect. Also, when the situation calls for it, he can run along walls for short distances. Additionally, he can run straight up walls, he can triangle-jump between two adjacent walls, and he can use a grappling hook in some usual and unusual ways. These skills are all contextual and can be executed only in specific situations, but the game is handy with the visual cues, and it's rare that you'll be unclear as to what skills you'll need to use to pass a certain area. This is mostly stuff you can pretty much expect from a third-person action game these days, but I-Ninja has some tricks up its sleeves, too. As you progress through the game, you'll find yourself rolling along narrow platforms while clinging to a giant sphere, you'll control a giant robot in a boxing match, you'll balance atop a wooden keg that's full of explosive black powder, and you'll defend a beach from a fleet of attackers. Looking at the game from a pure gameplay perspective, I-Ninja has a lot to offer, and the majority of it is adeptly executed. But for all it has to offer in terms of gameplay, the experience is over pretty quickly. Fortunately, you could easily play I-Ninja for several hours beyond the game's final length. Though you're presented with a few optional challenges along the way, for the most part, I-Ninja's mission structure is very straightforward and very linear. It's apparent that I-Ninja doesn't have a lot of pretense about creating a vivid, realistic, or immersive world for you to dive into. It knows it's a game, and it doesn't care if you know it, too. It's straightforward, but do not mistake this for easy--which the game is not. There are plenty of do-or-die moments that will purely test your reflexes and your steadiness of hand, but the game is also liberal enough with save points and extra lives that you can take several cracks at a certain challenge without too much worry. One of the first things you'll notice upon loading up I-Ninja is Ninja himself--or, at least, his giant, round head. He's undeniably cute, but much like with Link in The Wind Waker, his adorability only makes his awesome array of abilities that much more impressive. He looks something like a cross between Bomberman and Shinobi, and the rest of the game carries an aesthetic that's bright and cartoony but also fairly violent. When defeated, an enemy will explode in a burst of green goo, or if you use your sword to slice him or her down the middle, each half will slowly fall to the side, thus exposing the enemy's green innards. There are some nice little animation flairs too, like the backward stab that Ninja uses against enemies who are behind him and the one-handed handstand that he'll use to get up and over ledges. There's plenty of variety in the environments, including the insides of a giant robot, a rocket factory, some kind of pirate shantytown, and a dense jungle. The game maintains a consistent visual quality and avoids recycling many elements. The Xbox version doesn't look radically different from the other two versions of the game. The frame rate is just slightly less stable than that of the PS2 version, but it's so minute that you really have to be looking for it to notice. Though it lacks any real great set pieces or technically impressive moments, I-Ninja gets the job done without a lot of fuss. Don't let its looks fool you--I-Ninja will give you a proper challenge. The game sounds pretty good, too, though there are a few missteps in terms of I-Ninja's aural presentation--with the biggest misstep being Ninja's voice. In contrast to his darling appearance, Ninja has a sort of gruff cartoon tough-guy voice, and it just doesn't seem quite appropriate. He's also in fairly short supply of catchphrases for those instances when he defeats a foe, so you'll hear the same four or five lines repeated as you slice and dice your opponents. The game's soundtrack is appropriately high-energy, and it fuses techno, funk, hip-hop, and rock influences into a sound that isn't great but is good enough to keep the game moving. In-game sound effects perpetuate the game's exaggerated visual style by offering big whooshing sword swipes and presenting nice, squishy sounds when you run an enemy through with your blade. At first glance, I-Ninja may appear to be a simple action game designed for kids, but in reality, it is anything but. The visual style may seem kid-friendly, but the level of challenge I-Ninja has to offer keeps the game interesting for a wider audience. Those who are up to the task will find I-Ninja to be a short but well-crafted third-person action game with a surprising variety of gameplay."}