{"ref": "https://www.gamespot.com/reviews/pro-cast-sports-fishing-review/1900-6073927/", "date": "August 25, 2003", "game_name": "Pro Cast Sports Fishing", "text": "If there's one thing that you can count on with owning a console, it's that sooner or later, a fishing game will become available for it. It may have taken a while, but the Xbox finally has its very own fishing simulation in the form of Pro Cast Sports Fishing from Capcom. The game might not have all the features that hard-core fans of the genre have come to expect, but it more than makes up for its shortcomings with a pick-up-and-play style of gameplay. Fans of the Sega fishing games will be right at home with this one. While fishing games have evolved over the years to become more and more faithful to the real sport, Pro Cast Sports Fishing takes a slightly different approach by sticking to an easier-to-grasp formula. While other fishing games take an esoteric approach by taking weather, seasonal, and time of day aspects into account, this game chooses to stay closer to the infectious and addictive gameplay style of the Sega fishing games for the Dreamcast. That is to say, this game gets down to what makes fishing games fun to play--hooking, reeling in, and landing the best fish you can. That being said, those looking for a simulation-heavy game might be somewhat disappointed by the lack of customization, but if you give the game even half a chance, you'll find a thoroughly enjoyable fishing title. To make things even more accessible, the game has a simple control scheme that can be mastered in a matter of minutes. The face buttons control casting and lure selection, the left control stick moves your boat and aims your fishing rod, and the right and left shoulder buttons control reeling and striking, respectively. The game may be short on depth when compared with other fishing games on the market, but it does have all the modes that fans of the genre have to come to expect, albeit with a slight twist. Present is the laid-back free fishing mode, which is useful for getting you acquainted with how the game plays and little else, and the standard arcade and simulation modes. Arcade, as the name suggests, is a fast-paced battle against the clock to see how many bass you can land. The simulation mode is where the heart of the game lies, and also where it deviates from other fishing games. While you still take part in tournaments to prove your prowess as an angler, every fish you land is worth a certain amount of points. You'll need to amass points to purchase new equipment and enter tournaments. You'll come away from a successful run in a tournament with a hefty purse, but you'll soon start collecting new lures, rods, and boats. Thankfully, the simulation mode contains a practice mode so you can spend a day on the water collecting fish and points to progress in the game. Sorely missing from the game is any kind of multiplayer component. Given that this game appears on the Xbox, it would have been great if it there had been some kind of Xbox Live support. That's a very nice fish! A parallel between this game and the Sega fishing games has already been drawn in terms of gameplay, but it doesn't stop there. Sadly, Pro Cast Sports Fishing doesn't look much better graphically, if at all, than Sega Bass Fishing 2, which was released two years ago. The game doesn't necessarily look bad, but when in the context of what the Xbox is capable of, it certainly is disappointing. Your angler and the fish you're aiming to catch are rendered with a fair amount of detail, and the environments are lush with the foliage you'd see on a tranquil pond, but it just isn't anything special. Thankfully, the game plays well enough that it's possible to look past the average graphics. You can also expect a similarly average experience in the audio department. The game is stocked with a decent array of environment sounds, such as gurgling water and splashes, as well as a soundtrack filled with laid-back instrumental music. It certainly serves its purpose well, but it definitely isn't memorable. Pro Cast Sports Fishing might not have all the little details that hard-core fans of the genre have come to expect from a fishing game, but it certainly is fun to play. It might not stand out graphically or have Xbox Live support, but for the moment, Xbox owners looking to scratch the itch that only a rod and reel can don't have much of a choice. If you're looking for a fishing game that is easy and fun to play, you need look no further."}