{"ref": "https://www.gamespot.com/reviews/henry-hatsworth-in-the-puzzling-adventure-review/1900-6206865/", "date": "March 26, 2009", "game_name": "Henry Hatsworth in the Puzzling Adventure", "text": "When a game is classified as a puzzle platformer, that usually means you'll need to use your brain powers to guide your hero to the exit. Henry Hatsworth in the Puzzling Adventure is a far different take on that hybrid genre. The action spans two screens that you can switch between with the push of a button, but they have two completely different gameplay types. On the top screen, you control Hatsworth in a standard, though extremely enjoyable, 2D platformer, vanquishing a horde of enemies with your fancy sword while you try not to spill the tea you're holding in your left hand. On the bottom screen is a puzzle game that is heavily inspired by Tetris Attack. You slide blocks around until you match three of the same color, clearing the slowly rising tower before it reaches the top of the screen. As strange as this combination sounds, it works really well. The later levels exhibit a sizable leap in the difficulty, making your journey harder than an old man should have to deal with, but the sheer joy of matching blocks and blasting foes makes this a unique and fun adventure. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Henry Hatsworth in the Puzzling Adventure Video Review Despite his advanced age, Henry Hatsworth is a genuine adventurer. He plunders buried tombs like a man half his age, but he isn't driven by just any priceless treasure. In The Puzzling Adventure, Hatsworth discovers a long-forgotten suit that is made out of pure gold and gives the wearer special powers. Every few levels, you find a new piece of the treasure, which gives you new abilities to play around with. Your standard jumping is complemented by a golden pipe that lets you breathe underwater and a pair of gilded shoes that let you leap off of vertical walls, among other things. Although you can use these powerful clothes to travel back to earlier levels to explore previously unreachable sections, it is the later levels that take full advantage of these new moves. The intricately laid-out levels force you to bounce off walls and run past disappearing paths, making the jumping portions thrilling and nerve-wracking. Even though you have enough different moves to make this old man seem far more agile than his gray mustache suggests, levels focus more on combat than on clever jumping tricks. You have a sword with you at all times and can pick up various types of guns--straight shots, bombs, and boomerangs--along the way. It doesn't take much effort to dispatch one lone enemy trying to halt your progress, but the game frequently fills the screens with deadly foes. The early levels are fairly kind in this regard, making sure the enemies require little more than one hit before they meet their end. As the game progresses, the difficulty spikes straight up, and the screen will frequently be flooded with enemies you'll need to strike a half-dozen or more times to vanquish. Trying to take down torpedo-spewing enemies while dodging tiny bomb-toting foes and maniacal sword swingers in one tight room can be a daunting endeavor, and the sparsely laid-out checkpoints ensure that you will have to replay the same stretch over and over until you can successfully kill them all. The tight controls make this exciting even when you're severely outnumbered, but the difficulty does seem a tad unfair at times. When you kill enemies, their souls float down to the bottom of the screen and take the form of one of your blocks. You can switch to the bottom screen with a push of a button, and you'll have to frequently bust blocks if you want to stay alive on the top screen. Like in Tetris Attack, the tower of blocks slowly rises from the bottom and you have to match three consecutive colors (using either traditional controls or the stylus) to make the blocks disappear. Although most of the blocks are benign, doing no damage if they reach the top of the screen, the enemy blocks must be eliminated to avoid the wrath of the resurrected undead. As the game progresses, new block types are introduced that make the puzzle world every bit as difficult as the platforming sections. For instance, some enemy types turn into blocks that cannot be moved, while others turn into speed blocks that make your tower rise more quickly. However, the bad blocks are offset by good ones in the form of items that will help you on both screens. For example, a lightning block will clear every block of that color while stunning every enemy in the main world. Loot recovered from enemies can be used to upgrade Hatsworth's powers, which goes some way to counteracting the increasing difficulty. You can make his sword and gun attacks stronger, add to the amount of time you can spend in the puzzle realm, and even make sure helpful item pieces appear more frequently. If you find yourself dying more often than you'd like, you can replay earlier stages to build up your cash reserve to further upgrade Hatsworth. There is also a special meter that can be built up by chaining combos in the puzzle world. Once the meter is full, you can tap the bottom screen to turn into an invulnerable robot for a little while. Called Tea Time, this is a welcome reprieve from the onslaught of enemy attackers, letting you clear the top screen without worrying about falling to their unrelenting might. Hatsworth doesn't have to take guff from enemies when he's in robot form. Even though you have to switch between two completely different play styles, the pacing in Henry Hatsworth never stumbles. The tight controls and varied environments in the platforming realm keep things entertaining throughout, making every moment you spend striking down foes and jumping across treacherous pits rewarding and fun. Because of the pure joy found in the platforming world, it seems that an abrupt shift to busting blocks would be a chore, but that is far from the truth. Clearing blocks is fast and frantic, and it's especially rewarding to clear a line at the last possible second in the later levels with their multitude of evil block types. Both sections are an absolute blast, so even though you must switch between these wildly different play types many times throughout each level, the game always stays engaging. The combination of traditional platforming and block-busting puzzles is an odd marriage, but Henry Hatsworth makes it worthwhile. Both aspects of the game are first-class, mixing intricately designed platforming stages with frantic puzzle action. The visuals make your elderly protagonist quite endearing and bring the world to life with vibrant colors. The music is also top-notch, complementing the hectic action perfectly with some energetic beats. The high difficulty in the later stages can be frustrating at times, but that is the only tear in the otherwise immaculate suit Hatsworth proudly wears. Henry Hatsworth in the Puzzling Adventure is not only one of the strangest platformers on the Nintendo DS, it's also one of the best."}