{"ref": "https://www.gamespot.com/reviews/brave-fencer-musashi-review/1900-2545927/", "date": "May 5, 2000", "game_name": "Brave Fencer Musashi", "text": "The setting is 160 years ago, and a great tension is brewing between two rival nations: the Yaquinik Kingdom and the LeCoir Empire. The LeCoir Empire stages a surprise attack on the Yaquinik Kingdom, with the intent to steal Reygund, the legendary sword of light. Yaquinik was not prepared for such an encounter and was, consequently, in great danger. At the moment of their greatest distress, the supervisor of the kingdom decided it was time for the ~hero summoning.~ So 160 years after he had last saved the world from complete destruction, Musashi was called upon once more to serve the kingdom.Musashi. Legendary warrior of ancient Japan. Originator of the Ni TenIchi Ryu method of sword fighting. Philosopher. Samurai. Poet. He's also the star of Square's new action/RPG, Brave Fencer Musashi. Touted by some as Square's Zelda killer, Brave Fencer Musashi is really a much different game. Sure, it's an action/RPG in the sense that there's a lot of action, and there are RPG elements in the game, but at its core, Brave Fencer is really more of an action/platformer than anything else.Imagine, if you will, a game that looks like a cross between Klonoa and Gex: Enter the Gecko, and you'll have a fair approximation of Brave Fencer's stylistic approach. The game is made up of polygonal characters and fully 3D backgrounds. Some backgrounds can be rotated 360 degrees, like when you're exploring towns. Other times, the backgrounds remain fixed, so as to let you concentrate on solving the matter at hand, and since problem-solving is a main fixture in Brave Fencer, it becomes apparent that lots of thought went into the design. Each level has its own logical set of challenges that careful thinking will solve every time. It's very rewarding to escape the perils of the first few stages, which neatly sets the tone for the game. Control in the game is very good. If you have a Dual Shock pad, you'll be glad to know that Brave Fencer fully supports both analog mode and Dual Shock vibrations. In an RPG of this nature, it's fun to feel the hits and spell effects in action. However, if you don't have a Dual Shock pad, digital control is just fine, too. In any case, the L2 and R2 buttons control the camera angle, while the square and triangle buttons perform such functions as checking treasure chests, attacking, using the Book of Five Rings, and reading signs. The X button is used for jumps, while the circle button activates the ~get in~ technique. More on that later. Lastly, the R1 button is used for blocking, which, if you want to get anywhere in the game, must be used effectively or else your numerous enemies will make quick work of you. Musashi, when he has the appropriate equipment, can perform all sorts of functions. For example, when you first start the game you must embark on a mission to recover Lumina, Musashi's powerful Sword of Light. Additionally, when he finds a certain item, he'll be able to climb rock walls using his two swords.One technique that gamers will find particularly useful is the get-in technique. By holding down the block button, a gauge on the side of the screen begins to fill. When the gauge is full, you'll press the square button to throw Raikoumaru (your short sword) in the direction you're facing. Assuming you threw it at an enemy, once it hits he will be immobilized for a few seconds. While your enemy is trapped in this attack, quickly press the square button to absorb his power. Your enemy will disappear, and you will have temporarily gained a new get-in attack, which can be used, at the expense of BP points, by pressing the circle button. Later in the game you will find different spell books. Each book has different attributes, such as the Book of Earth, which can cause earthquakes when properly powered up. Additional sword techniques, like the Ni TenIchi Ryu Slash, may also be learned as the game progresses. Each of these skills will become necessary to overcome the increasingly difficult challenges the game will provide. One of the things that should be noted is that the game takes place in a virtual time zone. Although not quite real time, Brave Fencer has a clock that continuously runs, whether you do anything or not. You'll see the day turn from morning to noon to night all within the space of 15 minutes (although it seems to stay night longer than it does day). Accordingly, you must rest Musashi regularly, either at the local inn, or have him just lie on the ground and catch some winks. If you don't, you'll have an increasingly lethargic and ineffective Musashi on your hands. Not the best way to finish the game. Whether or not this was such a good idea is up for debate, since you seem to be spending as much time resting the poor bastard as you do questing (although, thankfully, when sleeping, time moves superfast). As far as the RPG elements are concerned, there is the usual interaction in the towns, like buying items, food, accessories; sleeping; eating at the local inn; drinking and talking to the people in the taverns; talking to townsfolk or anyone who happens to be wandering around; etc. Whew.As previously stated, the graphics in this game are very well done. Better looking than Square's other recent RPG, Xenogears, Brave Fencer features well-designed towns and environments and good-looking textures with very little warping or pop-up. One slight problem with the towns, however, is that there is no zoom-out function. A feature like this would be greatly appreciated, since trying to find your way around towns is reduced to simply running around until you find something that's familiar and starting from there. And the fact that the towns can be completely rotated adds unnecessary confusion. A transparent overhead map would have helped tremendously, but unfortunately there isn't one. Players who liked the look of the characters in Final Fantasy VII (during the exploration, not the battle scenes) will enjoy the graphics here. Each character is Gouraud-shaded and rendered in polygons, with a superdeformed look. Musashi himself is the most obvious example, with a small body, huge head, and even bigger set of hair. The music in Brave Fencer is a combination of all kinds of sounds, ranging from traditional Japanese music to medieval orchestrations that suit the game very well. Sound effects are up to the usual Square quality, with sharp metallic clangs during sword fights and ambient sounds like running water. The game also features an extraordinarily large amount of voice acting, most of which is very good. Musashi himself can be a little overzealous, but otherwise it's a welcome relief from the crappy voice acting found in games like Resident Evil and The Granstream Saga.Overall, Brave Fencer Musashi goes a long way towards repairing Square's reputation, which had taken a beating after the release of shaky efforts like Soukaigi, Saga Frontier, and Chocobo's Mysterious Dungeon. It's a fun game that relies more on gameplay and exploration than it does on flashy special effects, and it features a lengthy (although linear) quest that should satisfy even the most critical gamer. A Zelda killer it's not, but considering what's being offered here, it should more than make up for any unfortunate comparisons."}