{"ref": "https://www.gamespot.com/reviews/battleforge-review/1900-6207374/", "date": "April 3, 2009", "game_name": "BattleForge", "text": "Hybridization in PC games has rarely been as ambitious and as well executed as in BattleForge, which expertly merges real-time strategy play with a collectible card game, thereby spawning its own genre, the RTS card game. The result is an innovative RTS game that rewards thinking on your feet, and a card game that puts thousands of opponents at your fingertips and brings your fantastic minions to life. Despite a few imperfections, BattleForge has the potential to captivate fans of both of its component genres. Who needs a barracks? Summon reinforcements wherever you have ground forces. At its core, BattleForge is a real-time strategy game with a seamlessly integrated card game mechanic. You control an army of fantasy creatures, ranging in size from tiny to gargantuan, and undertake missions, which are resolved through real-time battles with standard point-and-click controls and an excellent drag-and-drop control group interface. Instead of building structures to produce units, you summon your forces directly onto the battlefield by playing cards from your onscreen deck. Likewise, you can summon defensive towers and cast healing, damage, and crowd-control spells in the same manner. Each card has a power cost, so you need to seize resource buildings called power wells to fund your war, as well as monuments, at which you build orbs that allow you to use increasingly powerful cards. For instance, you start each match with one orb and can play only level 1 cards, but when you build your second orb, you'll be able to play level 1 and 2 cards. This makes capturing and defending monuments and power wells central to your strategy. As for tactics, one important technique is matching the attack type of your units to the armor class of enemy units. Another tactical consideration is deciding between summoning your forces anywhere you have a ground unit or tower, causing the new troops to suffer a temporary health and ability loss, or summoning them at one of your power wells or monuments for instant full effectiveness. Playing RTS matches in BattleForge is a blast, but you can also derive hours of enjoyment outside the battlefield by planning, designing, and tweaking your virtual decks. There's no limit to the number of different decks you can make, so there's no limit to the number of classes or ~specs~ you can play with the same character. Each deck can have up to 20 cards, and each card belongs to one of four schools of magic--fire, frost, nature, or shadow--and is color-coded red, blue, green, or purple, respectively. Similarly, the crucial orbs you control on the battlefield are color-coded, and you need to decide what color orb to build when you capture a monument. To play a shadow card, for instance, you must have a purple orb, and so on. Figuring out how many orbs and what colors you need may sound complicated, but it's executed with a simple and intuitive dot system. Like in certain physical card games, your decks will be most effective when they stick to either one or two colors, but the game doesn't restrict your design freedom in any way. You start the game with four premade decks and 3,000 BattleForge points, the game's main currency, which you can spend to buy cards from other players or directly from the game, in the form of boosters (eight mystery cards for 250 BF points) or tomes (six boosters for 1,250). Each booster contains one rare or ultra-rare card, which you can often sell to other players for enough points to buy a whole new booster. In short, the game starts you off with plenty of cards and points to keep you entertained for a long time, but if you want more, you can buy points at the rate of $6.62 for 500 or $26.56 for 2,250. While you won't get free cards for beating missions, you will receive upgrades to improve the cards you already own, which will make your decks more powerful. Building a Better Werebeast: You can upgrade your cards to improve their attributes. In contrast to the idyllic synergy among BattleForge's various gameplay elements is the dysfunctional relationship between gameplay and storyline. You'll find only the barest details of a story and minimal character development within the missions themselves, and in all likelihood you'll feel closer to your decks than to any of the game's non-player characters. Although the game has a thorough and lengthy story to explain why you're hovering over the battlefield throwing lightning bolts at giant purple crustaceans, it is primarily told through a virtual book, which you can either read or skip. Frustratingly, the book doesn't save your place between viewings, so you have to click through dozens of pages to get to sections that you haven't read yet. Here's the basic story: Many years ago, the gods made you a Skylord for your valiant contribution to their war against the giants. In the intervening years, you spent your time using the Forge of Creation to summon up fantastic creatures (and apparently playing cards with other Skylords), but now you must use your powers to help humankind, because the gods have disappeared in their hour of need. However, you can simply choose to ignore humankind and challenge other Skylords to competitive matches until the end of time, if that's what makes you happy. Of course, tackling the story-driven campaign means that you must show mercy and help the humans, even though they can be rather incompetent allies and do annoying things like send out convoys before you are ready to escort them. The campaign consists of 19 unique missions, requiring varying numbers of players, from 1 to 12. Finding enough players for the big missions is usually pretty painless, but a few other aspects of the campaign can be troublesome, like dealing with teammates who take more than their share of the resources and racing the clock to complete timed objectives. The biggest problem with the campaign in BattleForge, though, is simply that it's over too quickly. And though you can lengthen the experience by playing most of the missions on standard, advanced, and expert difficulties, this option is a poor replacement for more content. Unsatisfied with the monstrosities in your deck? Buy new ones at the auction house. Competitive multiplayer is a staple of RTS and card games, and BattleForge nails it. On 12 bare-bones maps designed for either one-vs.-one or two-vs.-two combat, you'll face opponents matched to your PVP experience level. While powerful cards can swing the advantage, these battles are essentially tests of skill, first in designing effective decks, second in tailoring your offensive strategy to fit your opponent, and third in choosing quick and effective counters for your enemy's attacks. Even though there is no fog of war and you can see everything on the battlefield, you'll never know exactly what your opponent is going to throw at you, since he can summon units anywhere he has a ground presence, including the middle of your base. As a result, it's important to always keep enough power on hand to summon an effective counter and, likewise, you should try to estimate when your opponent is low on power so you can ensure that his weak spot will stay weak. These are just a few of the tactical options that result from instant unit-summoning, which makes multiplayer battles exciting, fast-paced, and constantly evolving. BattleForge's community interaction is functional but unrefined. One example is the auction house, where you can buy and sell cards for BattleForge points. Although it's convenient to search for cards by color, orb level (1, 2, 3, or 4), rarity, and type (unit, spell, or tower), you can't sort the search results by price or time remaining. As well, searches return only the first 50 results and display only five results at a time. Another feature that could be improved is the chat. Adding the ability to link cards into trade chat would not only make life easier for potential buyers and sellers, but would also help bridge the gap between BattleForge's American and European players by enabling easy trade communication among different language speakers. The environments in BattleForge at first bear a striking resemblance to the RTS classic Warcraft III, but the game quickly differentiates itself with a menagerie of creatures great and small. Werewolves, insects, skeletons, dragons, giant worms, and bulbous monstrosities represent only a few of the creatures at your disposal, and they give the game a larger-than-life aesthetic. Additionally, you'll notice fun visual flourishes, like how the flying frost battleship shoots confetti when you summon reinforcements and how the Fathom Lord does a shuffling lobster-man dance when inactive. The graphics and sound aren't groundbreaking, but the visual effects don't disappoint, the unit voice-acting is solid, and the score is beautifully orchestrated and dynamic. After beating this boss, the players still have some gigantic units on hand. Attack on Toyko, anyone? BattleForge is remarkable not only because its component genres are integrated together so well, or because it's unique, playable, and fun, but also because it can make an RTS fan enjoy a collectible card game. You'd do well to check it out if you're even remotely interested in either genre, and provided the player community sticks around there's no reason why you shouldn't still be enjoying BattleForge many months from now. Of course, tackling the story-driven campaign means that you must show mercy and help the humans, even though they can be rather incompetent allies and do annoying things like send out convoys before you are ready to escort them. The campaign consists of 19 unique missions, requiring varying numbers of players, from 1 to 12. Finding enough players for the big missions is usually pretty painless, but a few other aspects of the campaign can be troublesome, like dealing with teammates who take more than their share of the resources and racing the clock to complete timed objectives. The biggest problem with the campaign in BattleForge, though, is simply that it's over too quickly. And though you can lengthen the experience by playing most of the missions on standard, advanced, and expert difficulties, this option is a poor replacement for more content. Unsatisfied with the monstrosities in your deck? Buy new ones at the auction house. Competitive multiplayer is a staple of RTS and card games, and BattleForge nails it. On 12 bare-bones maps designed for either one-vs.-one or two-vs.-two combat, you'll face opponents matched to your PVP experience level. While powerful cards can swing the advantage, these battles are essentially tests of skill, first in designing effective decks, second in tailoring your offensive strategy to fit your opponent, and third in choosing quick and effective counters for your enemy's attacks. Even though there is no fog of war and you can see everything on the battlefield, you'll never know exactly what your opponent is going to throw at you, since he can summon units anywhere he has a ground presence, including the middle of your base. As a result, it's important to always keep enough power on hand to summon an effective counter and, likewise, you should try to estimate when your opponent is low on power so you can ensure that his weak spot will stay weak. These are just a few of the tactical options that result from instant unit-summoning, which makes multiplayer battles exciting, fast-paced, and constantly evolving. BattleForge's community interaction is functional but unrefined. One example is the auction house, where you can buy and sell cards for BattleForge points. Although it's convenient to search for cards by color, orb level (1, 2, 3, or 4), rarity, and type (unit, spell, or tower), you can't sort the search results by price or time remaining. As well, searches return only the first 50 results and display only five results at a time. Another feature that could be improved is the chat. Adding the ability to link cards into trade chat would not only make life easier for potential buyers and sellers, but would also help bridge the gap between BattleForge's American and European players by enabling easy trade communication among different language speakers. The environments in BattleForge at first bear a striking resemblance to the RTS classic Warcraft III, but the game quickly differentiates itself with a menagerie of creatures great and small. Werewolves, insects, skeletons, dragons, giant worms, and bulbous monstrosities represent only a few of the creatures at your disposal, and they give the game a larger-than-life aesthetic. Additionally, you'll notice fun visual flourishes, like how the flying frost battleship shoots confetti when you summon reinforcements and how the Fathom Lord does a shuffling lobster-man dance when inactive. The graphics and sound aren't groundbreaking, but the visual effects don't disappoint, the unit voice-acting is solid, and the score is beautifully orchestrated and dynamic. After beating this boss, the players still have some gigantic units on hand. Attack on Toyko, anyone? BattleForge is remarkable not only because its component genres are integrated together so well, or because it's unique, playable, and fun, but also because it can make an RTS fan enjoy a collectible card game. You'd do well to check it out if you're even remotely interested in either genre, and provided the player community sticks around there's no reason why you shouldn't still be enjoying BattleForge many months from now."}