{"ref": "https://www.gamespot.com/reviews/singstar-queen-review/1900-6214711/", "date": "August 3, 2009", "game_name": "SingStar Queen", "text": "Queen survives. While the death of ultratalented and flamboyant lead singer Freddie Mercury in 1991 essentially signaled the end of an era, the remaining members have teamed up with other vocalists in the years since. Paul Rodgers, Robbie Williams, and others have grabbed the microphone in various concerts and recording projects, but let's face it: Robbie Williams is no Freddie Mercury. And chances are, neither are you. But if you think you've got the vocal chops, or at least don't mind looking extra foolish in front of your friends (even by karaoke standards), SingStar Queen lets you belt out Mercury's high notes in grand fashion. This may just be a retail track pack, but it's a really good one, and every track is fun to sing along to, which is exactly what you'd want from a karaoke game. There are 25 songs included in SingStar Queen, which includes almost every song you'd hope for in such a compilation. ~Bohemian Rhapsody,~ ~We Will Rock You,~ ~Another One Bites the Dust,~ ~Fat Bottomed Girls~--the songs you'd want to sing along to--are all here, along with a variety of other great, singable tracks. Queen fanatics may bemoan what's missing; the two earliest albums aren't represented, nor is the awesome, campy Flash Gordon theme. But the included music is a solid cross-section of the band's output, and it's fun (and sometimes hard) to sing along with these songs. Mercury was a one-of-a-kind singer with a broad vocal range; be sure to have a bottle of water nearby to soothe your aching vocal cords. And if you want to sing along with a friend on duets, be ready to put a bit of work into your performance. Such songs as the famous ~Bohemian Rhapsody~ feature complex, multitracked harmonies, and SingStar's simplistic karaoke interface makes it tough to figure out which harmony notes you're supposed to sing. If you've played SingStar before, there's nothing here you won't recognize. You sing along with the songs, trying to hit the correct pitch and length of each note, and you are scored on your performance. You can do this alone, or you can grab a friend or seven and play around with the local multiplayer options. These include the aforementioned duets; head-to-head battles in which you compete for the highest score; pass-the-mic face-offs between two teams of up to four players; and more. Because Queen's music is so dramatic and harder to sing than you might think, it is particularly enjoyable to play SingStar Queen with friends. If you can keep up with Mercury's soaring vocals, you look extra-talented; if you can't, you look extra-foolish, just as your buddies were secretly hoping. You still can't compete with others online (let's hope the series eventually catches up to the music-game competition in this regard), but you can upload photos and videos of you and your friends looking silly if you connect a PlayStation Eye camera while you strut about. The online community features are slickly organized and fun to check out, if just to see the absurd antics of other players. And as with other SingStar games, you get access to the impressive library of downloadable music in the SingStore. This doesn't mean that nothing is new. Trophy support has finally arrived--but of more interest is the microphone-powered menu navigation. You can now speak into the mic to flip through songs and choose menu options, and the game does a good job of recognizing your voice commands, so you can set the controller down for the duration if you want. It's not about your vocal abilities, it's about the passion. SingStar Queen's video imagery is as iconic as its music, given that Freddie Mercury is as amazing to watch as he is to hear. The way he struts across the stage while singing ~Another One Bites the Dust,~ and his sly wink to the camera while dressed as a housewife in ~I Want to Break Free,~ will both energize your karaoke party and make you appreciate Queen more than ever. It's still the same-old SingStar, and getting the most out of this one will take a little more work than usual. But the band's excellent layered sound makes for a good time with friends--all while hoping the neighbors can't hear your voice crack while screeching ~Who Wants to Live Forever~ into the microphone."}