{"ref": "https://www.gamespot.com/reviews/retro-atari-classics-review/1900-6120954/", "date": "March 23, 2005", "game_name": "Retro Atari Classics", "text": "Retro Atari Classics may look like a standard collection of classic Atari arcade games, but in reality, it's not your average compilation. The 10 games featured here have been redesigned in an attempt to take advantage of the Nintendo DS's touch screen. The results are slightly mixed, though the re-creations here still fall squarely into the ~bad idea~ category. Warlords is a rad game, but the control suffers a bit here. The games in this collection read like a murderer's row of killer arcade classics. You'll find Warlords, Missile Command, Centipede, Tempest, Pong, Breakout, Sprint, Gravitar, Asteroids, and Lunar Lander here. The default way to play these games is in ~original style,~ which mimics the graphics of the original games. However, the gameplay has changed quite a bit in some cases. Centipede is probably the biggest change, and it goes a long way to show that these games were reprogrammed, rather than emulated. The spider movement is idiotic, and the centipedes themselves don't behave quite right, either. Warlords doesn't add multiple fireballs to the game when the four castles are destroyed. Missile Command automatically selects which firebase to launch missiles from depending on where you're firing. The list goes on and on, and most of these changes really hurt the nostalgic appeal of the overall package. Control in these games is spotty at best. Each game has been designed to take advantage of the Nintendo DS touch screen. Considering the analog nature of many of these games, you'll get more refined control from the touch screen than you could with the D pad, but the control never feels quite right. Missile Command makes the most sense, as the arcade trackball was replaced entirely and now ABMs can be launched by touching the screen. In Warlords and Pong, lines are drawn on the touch screen, and you must drag a control icon around on the lines to move your paddles. Tempest puts a box on the screen that will move your crawling shiplike thing around when you drag it past the box. But one full line across the screen isn't enough to make one full rotation in most levels, so you're left repeatedly stabbing the screen like you were playing Pokemon Dash. Asteroids is...a mess. For the most part, the control you get from the touch screen isn't refined enough to give you the same level of control you might be used to from the arcades. This style gives all the games a slightly more frantic feel, but it's also a frustrating way of doing things. Lunar Lander gets fully iced-out in remix mode. Once you get bored with ~original style,~ you can click over to remix mode. These versions of the game play and sound identically to the other mode, but all of the graphics have been replaced by art from a few fairly prominent graffiti artists. The result is reminiscent of those bootleg NES ROM hacks. But instead of getting to see a Super Mario Bros. game with an all-naked cast, you get to see an MC Escher-like design behind Asteroids and a square box with a man's face on it that replaces the satellites in Missile Command. It's silly, and the artwork really isn't implemented very well. Both modes are playable by multiple players, up to and including four-player support for Warlords, provided everyone has his or her own copy of the game. Retro Atari Classics is the sort of game that's unpleasing to every possible audience. The hardcore retro fan base will scoff at the way these games have been shoddily reprogrammed. Fans of the graffiti artists will wonder why all the artwork is so poorly used. And anyone looking for a fun DS game will wonder how they got suckered into picking this one up. Do yourself a favor and don't be the sucker."}