{"ref": "https://www.gamespot.com/reviews/rugby-2005-review/1900-6120908/", "date": "March 22, 2005", "game_name": "Rugby 2005", "text": "Besides being fun, any sports simulation has a secondary measuring stick that remains nearly as important: How accurately does it portray the sport on which it's based? For American sports fans, that secondary question can be answered easily for games based on familiar sports entities, such as the NFL, the NBA, and NASCAR, regardless of experience. After all, you don't have to know the depths of the infield fly rule to know whether a baseball game ~feels~ right or not. Then there are games like Rugby 2005, the latest in EA Sports' rugby series. Because of the sport's low level of popularity in the US, the game doesn't benefit from the luxury of familiarity that a football, oval racing, or baseball game might enjoy. Indeed, for many curious gamers, Rugby 2005 may be their first entry into a sport they've only seen on cable television. While the game serves as only an adequate primer to this tough-guy sport, it's a fairly approachable and fun game, and it's one that does a decent job of conveying the finer aspects of the sport it portrays. Bust out the scrum tape! It's time for another rugby game. If you've never entered a real scrum, much less a virtual one, the game's rugby 101 introduction is probably the best place to start. This five-minute movie is an introduction to some of the most elementary concepts found in the sport, and it demonstrates the various scoring methods, the size and scope of the playing field, and some of the different methods for moving the ball down the field. During your first session with Rugby 2005, you'll also go through a mandatory practice session that will introduce basic controls, such as running, tackling, and passing, as well as more-advanced topics, such as scrum and ruck controls. Finally, the practice mode lets you work on advanced ball-running controls (such as shoulder charges and side steps), tackling drills, punting on both offense and defense, and drop goal kicks. After completing these three training sessions, you'll have a pretty good understanding of the controls...and only a rudimentary understanding of how to apply these different controls to the sport of rugby. While some things are obvious, namely how to score tries and drop goal kicks and how to successfully move the ball up the field using only backwards passes (the only legal type of pass in the sport), your understanding of some of the sport's vagaries--especially regarding offensive and defensive punting and just why and what causes penalties in a match--will be left to either in-game exposure or your own research. The user interface doesn't help matters here. During our first exposure to the game, we were caught offsides more than we could count, finally choosing not to go after loose balls after tackles for fear of drawing additional penalties. It wasn't until a little exploration in the menu revealed an offsides line toggle switch, which is set to ~off~ by default. Similarly, the default sideline camera angle--which works well for football and soccer--makes the kicking game tough in Rugby 2005, especially with regard to drop goal kicks, which need to be aimed between the uprights while running. Switching to one of the two vertical camera views eliminated the problem, but, annoyingly, we could not find an option to make this new camera the default after restarting the system. The rugby equivalent of rock-paper-scissors. Line-out throws take a strategic mind and delicate timing. On the positive side, the controls are easy to pick up, even if you don't always understand when to do what. Running is controlled with the left analog stick, special offensive moves with the right analog stick, and kicking with various face buttons. Controls on both the PlayStation 2 and Xbox game are responsive, though we found the defensive game slightly easier to master on the Xbox due to its sharper graphics. In terms of gameplay, Rugby 2005 features three levels of difficultly, most clearly defined by the artificially intelligent opponents' willingness to punt the ball for position and the aggression of the AI defense. Picking up the ball out of a ruck (a sort of mini-scrum that determines possession after each tackle) and immediately running up the middle--as opposed to pitching the ball to a back or forward--is a simple way to gain field position on easy or medium difficulty. On hard difficulty, however, it's an easy way to lose possession of the ball, as those holes in the middle of the field will not be open. Most new players will quickly lose interest on the easiest difficulty, as scoring tries (the rugby equivalent of touchdowns) is a relatively simple affair. However, players will find a good amount of challenge on medium difficulty, especially in matches between teams of similar skill. One of the most peculiar aspects of rugby is the preponderance of kicking. Offensive and defensive punts abound, but there are also grubber kicks (short boots designed to quickly evade defenders as you run upfield), kickoffs, drop goal kicks (essentially running field goal attempts), and up-and-under kicks (where an offensive player kicks the ball high into the air, hoping a teammate catches it when it comes to and then continues upfield). While this multitude of kicking options might seem foreign to those new to the game, especially football fans who associate ~punting~ with relinquishing control, it's actually an essential and tactical aspect of the sport. As such, it's important to note that the kicking controls take some getting used to, especially since many of the kicks you'll execute will be while running at top speed. A line-out punt, for example, designed to go out of bounds on either side of the field, is aimed with the left analog stick, which is the same control used to move your players around the field. Drop goal kicks can be especially strange, as you'll be aiming your kick, judging the correct distance, and running from your opponents all at the same time. Extra point kicks, on the other hand, are based on the same kicking meter mechanic found in the Madden NFL series. While the controls in Rugby 2005 work fine, especially with a little practice, the AI tends to be a bit suspect. There's a definite ~school of fish~ running pattern for the majority of players on both teams, which means they tend to all change direction at the exact same moment when chasing down a runner. Furthermore, loose balls are often ignored by players on both offense and defense, forcing you to take control of the closest player to the ball so you can scoop it up for yourself. The computer-controlled players will also often ignore obvious tackle opportunities, especially when you're running in the middle of a pack. The game includes set plays...but doesn't give you much clue on how to run them. Rugby 2005 offers a number of offensive and defensive set plays that you can choose by pressing the directional pad during a ruck or a scrum, but the game doesn't give you any indication of how these set plays are supposed to be run. The manual is of no help either, so if you're looking to find out the difference between a pivot play and a dummy switch or the simple definition of a ~classic~ set play, you're left to your own devices. On defense, the set plays are a bit more obvious. They consist of standard, kick, wide, and tight. However, a bit of explanation as to how to best execute all these set plays would have been welcome. Modes found in Rugby 2005 include quick game, practice, and tournament. Playing a quick game lets you take control of any of the 61 teams found in the game from the Super 12, European, Representative, and International leagues. Each team has an assigned rating associated with it so, if you want to start out strong, you'll want to pick a team like New Zealand, France, or England. Rugby 2005's aforementioned practice feature lets you work on the game's controls through a number of training challenges, as well as through scrimmage, free play, and goal kicking modes. The tournament mode is the heart and soul of Rugby 2005. Featuring eight tournaments from all over the globe--World Championship, Tri-Nations, Six Nations, Ten Nations, Super 12, European Trophy, World League, and Lions Tour--these tourneys are where you'll be spending the majority of your time in Rugby 2005. Of these, the World League is the most compelling, as it's the closest thing to a franchise mode found in the game. Here you'll take control of one of 36 teams, over multiple seasons, in your quest to move up the divisional ladder to eventually win the championship. The World League will also let you make trades during the season, though there's a cap on the number of trades per season. Trades are dependent on your store of trade points, which are earned throughout the season based on your individual game results. The better your team performs on the pitch, the more trade points you earn and the better players you can recruit. Recruitment is fairly straightforward because player worth is denoted only by a value rating and maintenance fee, and no team will refuse a trade, no matter how lopsided. Other extras include a create-a-player mode, which, in keeping with many EA Sports games, contains a number of adjustable attributes for your created player. It's not quite as easy to use as the create-a-player mode found in Tiger Woods or Fight Night Round 2, and you won't be able to create a potbellied, comb-over-sporting flanker, but for those who like that kind of thing, it should keep you busy. One of the reasons Rugby 2005's create-a-player mode isn't that compelling is the general lackluster feel of the player models. While there's a nice discrepancy of size among the beefy inside forwards and the sleek outside backs, the general look of the player models are vanilla and lacking in definition. When on the field, it's not that big of a deal, as the camera angle is high overhead anyway. It's during replays or pre- and postgame animations that the weakness of the player models makes an impression. Some of the animations can be sort of janky. When passing to the opposite direction you're running, the passing animations tend to be jerky and unrealistic-looking. Finally, while there's a good variety of tackling animations, clipping is common between players, and there's a pretty notorious ~black hole~ effect that will suck you into tackle animations when running near opposing players. The longer the game goes, the dirtier the uniforms get. When the most compelling audio portion of an EA Sports game are the tunes featured on EA Trax, it doesn't bode well for the rest of the sound. The in-game commentary team gets old pretty quickly. The play-by-play calls are accurate but repetitive, and you'll be lucky to hear the color guy more than twice in a contest. While tackles have a nice muffled punch to them, and the constant chatter of the ref shouting orders to the players is nice, there's not much else to talk about. On the other hand, the Futureheads' ~Decent Days and Night,~ one of the featured tracks on the soundtrack, hasn't left our head for days. Rugby 2005 will likely appeal to that minority of gamers already familiar with the sport it portrays. For the rest, the game serves as a decent introduction to rugby that, with a little practice, offers some fun and challenge, though not much in the way of long-term appeal. If you love rugby, you probably already own this one. If this is your first time with a rugby game, you'll likely spend your first few hours wondering just what's going on. While the controls in Rugby 2005 work fine, especially with a little practice, the AI tends to be a bit suspect. There's a definite ~school of fish~ running pattern for the majority of players on both teams, which means they tend to all change direction at the exact same moment when chasing down a runner. Furthermore, loose balls are often ignored by players on both offense and defense, forcing you to take control of the closest player to the ball so you can scoop it up for yourself. The computer-controlled players will also often ignore obvious tackle opportunities, especially when you're running in the middle of a pack. The game includes set plays...but doesn't give you much clue on how to run them. Rugby 2005 offers a number of offensive and defensive set plays that you can choose by pressing the directional pad during a ruck or a scrum, but the game doesn't give you any indication of how these set plays are supposed to be run. The manual is of no help either, so if you're looking to find out the difference between a pivot play and a dummy switch or the simple definition of a ~classic~ set play, you're left to your own devices. On defense, the set plays are a bit more obvious. They consist of standard, kick, wide, and tight. However, a bit of explanation as to how to best execute all these set plays would have been welcome. Modes found in Rugby 2005 include quick game, practice, and tournament. Playing a quick game lets you take control of any of the 61 teams found in the game from the Super 12, European, Representative, and International leagues. Each team has an assigned rating associated with it so, if you want to start out strong, you'll want to pick a team like New Zealand, France, or England. Rugby 2005's aforementioned practice feature lets you work on the game's controls through a number of training challenges, as well as through scrimmage, free play, and goal kicking modes. The tournament mode is the heart and soul of Rugby 2005. Featuring eight tournaments from all over the globe--World Championship, Tri-Nations, Six Nations, Ten Nations, Super 12, European Trophy, World League, and Lions Tour--these tourneys are where you'll be spending the majority of your time in Rugby 2005. Of these, the World League is the most compelling, as it's the closest thing to a franchise mode found in the game. Here you'll take control of one of 36 teams, over multiple seasons, in your quest to move up the divisional ladder to eventually win the championship. The World League will also let you make trades during the season, though there's a cap on the number of trades per season. Trades are dependent on your store of trade points, which are earned throughout the season based on your individual game results. The better your team performs on the pitch, the more trade points you earn and the better players you can recruit. Recruitment is fairly straightforward because player worth is denoted only by a value rating and maintenance fee, and no team will refuse a trade, no matter how lopsided. Other extras include a create-a-player mode, which, in keeping with many EA Sports games, contains a number of adjustable attributes for your created player. It's not quite as easy to use as the create-a-player mode found in Tiger Woods or Fight Night Round 2, and you won't be able to create a potbellied, comb-over-sporting flanker, but for those who like that kind of thing, it should keep you busy. One of the reasons Rugby 2005's create-a-player mode isn't that compelling is the general lackluster feel of the player models. While there's a nice discrepancy of size among the beefy inside forwards and the sleek outside backs, the general look of the player models are vanilla and lacking in definition. When on the field, it's not that big of a deal, as the camera angle is high overhead anyway. It's during replays or pre- and postgame animations that the weakness of the player models makes an impression. Some of the animations can be sort of janky. When passing to the opposite direction you're running, the passing animations tend to be jerky and unrealistic-looking. Finally, while there's a good variety of tackling animations, clipping is common between players, and there's a pretty notorious ~black hole~ effect that will suck you into tackle animations when running near opposing players. The longer the game goes, the dirtier the uniforms get. When the most compelling audio portion of an EA Sports game are the tunes featured on EA Trax, it doesn't bode well for the rest of the sound. The in-game commentary team gets old pretty quickly. The play-by-play calls are accurate but repetitive, and you'll be lucky to hear the color guy more than twice in a contest. While tackles have a nice muffled punch to them, and the constant chatter of the ref shouting orders to the players is nice, there's not much else to talk about. On the other hand, the Futureheads' ~Decent Days and Night,~ one of the featured tracks on the soundtrack, hasn't left our head for days. Rugby 2005 will likely appeal to that minority of gamers already familiar with the sport it portrays. For the rest, the game serves as a decent introduction to rugby that, with a little practice, offers some fun and challenge, though not much in the way of long-term appeal. If you love rugby, you probably already own this one. If this is your first time with a rugby game, you'll likely spend your first few hours wondering just what's going on."}