{"ref": "https://www.gamespot.com/reviews/headhunter-redemption-review/1900-6108224/", "date": "May 17, 2006", "game_name": "Headhunter: Redemption", "text": "Developer Amuze's original Headhunter game was one of those few, random Dreamcast titles that, despite the handicap of not ever garnering a US release, still managed to attract a decent-sized cult following. Though the game did receive a port-job to the PS2 back in 2002, only now is it being followed up with a proper sequel. Titled Headhunter: Redemption, this Headhunter game once again follows the futuristic adventures of Jack Wade, a grizzled half-cop, half-bounty hunter. Like a lot of action sequels, Redemption conveys a lot of the same ideals and core concepts found in its predecessor and also adds a couple of new factors to the mix, including a second playable character. Unfortunately, the familiar parts of Redemption feel more like archaic retreads than anything else, and Jack's new partner is just about one of the least likable game characters introduced to audiences in quite a long time. Frankly, Redemption just isn't a very interesting game, from any angle. Meet Leeza X--Headhunter trainee and all-around vapid and annoying riot grrrl. Headhunter: Redemption takes place a full 20 years after its predecessor. Jack Wade, once a gruff but handsome fellow, has fossilized a bit, sinking further into embitterment and settling into a nice drinking habit to boot. In the game's opening cutscene, we learn that on top of the outbreak of the deadly Bloody Mary virus, which had ravaged the world at the end of the last game, a gigantic earthquake had also managed to wipe out a fair portion of the population. Now, the high rollers of society live in a massive city called Above, which sits above the ruins of the olden society. The world of Below is where the malcontents and dirtbags reside, and it's a half-city, half-penal colony where all of the menial labor that keeps Above running is performed. Think of this place as a mix between the worlds found in the films Demolition Man and Judge Dredd, and you'll have a pretty good idea of what's going on. During this opening sequence, we're also introduced to a flashback of one of Wade's old assignments, in which he took down a man who was about to murder his young daughter. Moments later, we're back to the present--or the future, or whatever--while Jack is on assignment busting a young woman who had apparently tried to hack into some major corporation's computer system. Of course, this young woman turns out to be none other than the very same girl Jack rescued all those years ago from her murderous father. Though she is now a scofflaw who's working under the moniker of Leeza X, Jack decides to forgo busting her in favor of offering her a chance to become a Headhunter-in-training. Seeing little choice, Leeza joins Wade. She then goes through a brief training sequence, discovers that he is really the man who sent her father to prison, decides she doesn't really care, and then joins Jack in a government-mandated fight against a subversive uprising that is taking shape down in Below. Most of this plays out in the first 20 minutes of the game, and this is about as interesting as the story gets. Once you launch into the actual game, the story kind of degenerates into a generically plotted sci-fi story about rebel forces trying to take down the totalitarian, corporation-driven government of the future, and vice versa. It is, of course, entirely possible to make a plot like this interesting, but as Redemption jumps from one dull, drawn-out, and poorly written cutscene to another, it's quickly apparent that this story is going nowhere. You spend the bulk of Redemption's early levels playing as Leeza while she learns the ropes about Headhunter life. Eventually you switch over to control Jack Wade, but the game tends to go back and forth a lot after that, and since both characters control almost identically, it doesn't add much variety to the game beyond presenting a different character model to stare at from a third-person view. The basic control mechanics in Redemption are pretty standard for an average third-person shooter. You control your character with the left control stick, and you shift the camera around with the right one. By pressing and holding the right trigger button on the Xbox, or the R1 button on the PS2, you'll put your character into a target mode, where, if an enemy is nearby, a reticle will suddenly appear over that enemy. By tapping the right stick in one direction or another, you can switch between multiple targets, and by pressing the X button on the PS2 or the A button on the Xbox, you'll shoot. The basic shooting in Headhunter feels fine. None of the weapons are anything particularly special, but each one does feel like it inflicts a satisfying amount of damage for its relative size and firepower. The one kind of obnoxious element early on in the game is that Leeza, since she's a rookie, doesn't have the best sense of aim. So, when you target an enemy, the reticle will kind of jump all over the place, especially on weapons with a lot of recoil. This goes away almost entirely over time, thankfully, but it does make some of the earlier portions of the game more frustrating than they need to be. Redemption's plotline is sort of a mishmash of a lot of overused sci-fi conventions, and it doesn't really do anything with said conventions to create a particularly captivating story. Both Leeza and Jack have the ability enter a stealth mode as well. By holding the left trigger button or L2 button, depending on the game version, your character crouches down or will wall-hug if you're close enough to one. When wall hugging, by moving to the edge of the wall, you can peer around to get a bearing on where the nearest attackers are. Then you can jump out from around the corner to begin firing. You can also creep up behind unsuspecting enemies to take them down from behind by using this mode. The problem with the stealth stuff, though, is that it's both largely unnecessary, and it's also a little broken, at times. It's definitely a good idea in some situations to hang out behind a corner when you've got three or four bad guys wandering about in a hallway ahead of you, but save for these few situations, more often than not you can just run and gun the whole way through. This isn't such a bad thing, since it does tend to make the action more exciting than it would be if you were just creeping around all the time. However, what is not a good thing is how the stealth mode can occasionally hurt you more than help you. Sometimes you'll be creeping along, and all of the sudden you'll get just close enough to a wall to where you'll be sucked into it, which causes the camera to snap about and also causes you to momentarily lose your bearings; this, of course, can sometimes lead to an extra bullet or two to the face that you might not have taken otherwise. When you're not shooting bad guys in the face, you'll find yourself solving a copious amount of lousy, fetch, quest-style puzzles. In fact, pretty much all you'll be doing outside of combat is running around these labyrinthine environments while looking for card keys, hidden entrances, missing cogwheels and other sorts of generic action game puzzle fodder so that you can progress to the next checkpoint so that you can then do it all over again. Again, much like the plotline, it's inherently possible to do this sort of gameplay style well, but Redemption really doesn't. Redemption's enemy AI shows off some solid thinking by making good use of cover and flanking mechanics. For one thing, at least a third of the game's mission objectives are sure to leave you scratching your head for a while, not because of challenge, but just because the game does a horrid job of explaining exactly what you need to do--or where you need to go to do it. The game's map system is no help at all, and, more often than not, you'll have to scan the area using your character's crazy, futuristic sunglasses (apparently they're standard issue for future cops) to get any idea of what you're supposed to do next. In fact, Redemption has an almost relentless obsession with the Metroid: Prime-style scanning mechanic, but it uses it in a very obnoxious way. Sometimes you'll have to shoot a rusty clamp or a hanging rope to get on with a mission, and before you can even target that object with your gun, you'll have to scan it first. This just seems unnecessary and really kind of dumb. The one good thing Redemption's gameplay has going for it is its enemy artificial intelligence. When you first enter an area, enemies will be on a set patrol path that they won't deviate from unless alerted. Once they're on alert, though, they're pretty good about pulling back, using cover, and specifically attacking when they see a respite from your oncoming gunfire. This is not to say that enemies are especially hard, because it rarely takes more than a few well-placed shots to take most of the generic baddies down, but at the very least, they do put up a fairly intelligent fight. Unfortunately, bad guys do have an occasional tendency to bug out and then get stuck around walls or other obstacles, but this doesn't happen enough to be a serious problem. Graphically, Redemption is definitely a cut above the original Headhunter's Dreamcast beginnings, but it's not a particularly big cut. The characters in the game don't look or move especially well. The character models themselves are generally not very detailed, which becomes readily apparent throughout each cutscene, since they're all pretty much in-engine. Both Leeza and Jack move stiffly, and both lack much in the way of varying animation. The surrounding world featured in Headhunter: Redemption is cut from the same prototypical, industrialized, pseudofuturistic cloth as a lot of other sci-fi action games, so it features a lot of machine-heavy set designs and washed-out color tones. Headhunter: Redemption also uses something of a soft lighting effect throughout the course of the game that does add a bit of smoothness to its overall look and feel, but it also feels a bit overdone in certain spots. Both the PS2 and Xbox versions of the game look about even, though one could say that the PS2 version is slightly more visually impressive, since it does look almost totally on par with the Xbox version. Then again, neither looks exactly spectacular, either. If you were a fan of the original Headhunter game, chances are that Redemption will just leaving you feeling as though Jack Wade deserved better than this hackneyed sequel. Redemption's biggest fault lies with its characters; specifically, the game's biggest fault lies with the actors who voice its characters. Yes, the dialogue is campy and stupid on its own, but the people who voice Jack, Leeza, and the supporting characters really serve to bring the dialogue down far more than the game's script. The actor playing Jack sounds like he's doing his best ~Dirty~ Harry Callahan impression, but his vocal styling comes off more like some kind of creepy erotic phone line operator than a rough-and-tumble law enforcer. And as for Leeza, she comes across with about as much ferocity and street smarts as a junior varsity cheerleader. Her line delivery is so bad, at times, that she really kills any scene where she has to engage in dialogue, because you just don't want to listen to her insipid, Valley girl-esque inflection. The rest of Redemption's sound design is pretty mundane, though it's generally inoffensive. The soundtrack is pretty archetypal, orchestral stuff of which there isn't a whole lot of variety, so you'll tend to hear a lot of the same music loops again and again. However, the in-game sound effects are decent enough. Good gunshot sounds are somewhat counterbalanced by generally unimpressive background ambience, and, overall, none of the sound effects do anything to distinguish themselves. Headhunter: Redemption is a tough game to recommend to anyone who isn't a raging fan of the first Headhunter, and even then, this sequel really does little to endear itself as a worthy addition to the Headhunter plotline. Apart from being a fairly lengthy affair that requires you to play for roughly 20 hours total to complete the storyline (and perhaps a bit longer to find all of the lame unlockable movies and character art you can acquire), Redemption just doesn't feature anything new or intriguing--or anything at all, for that matter--to make it stand out. If this game were to travel back in time about three years to find its way onto the Dreamcast, it might have fared better. But in this day and age, with a bevy of better designed and far more entertaining third-person shooters available for both the PS2 and Xbox, Redemption falls quite a bit short of the bar. When you're not shooting bad guys in the face, you'll find yourself solving a copious amount of lousy, fetch, quest-style puzzles. In fact, pretty much all you'll be doing outside of combat is running around these labyrinthine environments while looking for card keys, hidden entrances, missing cogwheels and other sorts of generic action game puzzle fodder so that you can progress to the next checkpoint so that you can then do it all over again. Again, much like the plotline, it's inherently possible to do this sort of gameplay style well, but Redemption really doesn't. Redemption's enemy AI shows off some solid thinking by making good use of cover and flanking mechanics. For one thing, at least a third of the game's mission objectives are sure to leave you scratching your head for a while, not because of challenge, but just because the game does a horrid job of explaining exactly what you need to do--or where you need to go to do it. The game's map system is no help at all, and, more often than not, you'll have to scan the area using your character's crazy, futuristic sunglasses (apparently they're standard issue for future cops) to get any idea of what you're supposed to do next. In fact, Redemption has an almost relentless obsession with the Metroid: Prime-style scanning mechanic, but it uses it in a very obnoxious way. Sometimes you'll have to shoot a rusty clamp or a hanging rope to get on with a mission, and before you can even target that object with your gun, you'll have to scan it first. This just seems unnecessary and really kind of dumb. The one good thing Redemption's gameplay has going for it is its enemy artificial intelligence. When you first enter an area, enemies will be on a set patrol path that they won't deviate from unless alerted. Once they're on alert, though, they're pretty good about pulling back, using cover, and specifically attacking when they see a respite from your oncoming gunfire. This is not to say that enemies are especially hard, because it rarely takes more than a few well-placed shots to take most of the generic baddies down, but at the very least, they do put up a fairly intelligent fight. Unfortunately, bad guys do have an occasional tendency to bug out and then get stuck around walls or other obstacles, but this doesn't happen enough to be a serious problem. Graphically, Redemption is definitely a cut above the original Headhunter's Dreamcast beginnings, but it's not a particularly big cut. The characters in the game don't look or move especially well. The character models themselves are generally not very detailed, which becomes readily apparent throughout each cutscene, since they're all pretty much in-engine. Both Leeza and Jack move stiffly, and both lack much in the way of varying animation. The surrounding world featured in Headhunter: Redemption is cut from the same prototypical, industrialized, pseudofuturistic cloth as a lot of other sci-fi action games, so it features a lot of machine-heavy set designs and washed-out color tones. Headhunter: Redemption also uses something of a soft lighting effect throughout the course of the game that does add a bit of smoothness to its overall look and feel, but it also feels a bit overdone in certain spots. Both the PS2 and Xbox versions of the game look about even, though one could say that the PS2 version is slightly more visually impressive, since it does look almost totally on par with the Xbox version. Then again, neither looks exactly spectacular, either. If you were a fan of the original Headhunter game, chances are that Redemption will just leaving you feeling as though Jack Wade deserved better than this hackneyed sequel. Redemption's biggest fault lies with its characters; specifically, the game's biggest fault lies with the actors who voice its characters. Yes, the dialogue is campy and stupid on its own, but the people who voice Jack, Leeza, and the supporting characters really serve to bring the dialogue down far more than the game's script. The actor playing Jack sounds like he's doing his best ~Dirty~ Harry Callahan impression, but his vocal styling comes off more like some kind of creepy erotic phone line operator than a rough-and-tumble law enforcer. And as for Leeza, she comes across with about as much ferocity and street smarts as a junior varsity cheerleader. Her line delivery is so bad, at times, that she really kills any scene where she has to engage in dialogue, because you just don't want to listen to her insipid, Valley girl-esque inflection. The rest of Redemption's sound design is pretty mundane, though it's generally inoffensive. The soundtrack is pretty archetypal, orchestral stuff of which there isn't a whole lot of variety, so you'll tend to hear a lot of the same music loops again and again. However, the in-game sound effects are decent enough. Good gunshot sounds are somewhat counterbalanced by generally unimpressive background ambience, and, overall, none of the sound effects do anything to distinguish themselves. Headhunter: Redemption is a tough game to recommend to anyone who isn't a raging fan of the first Headhunter, and even then, this sequel really does little to endear itself as a worthy addition to the Headhunter plotline. Apart from being a fairly lengthy affair that requires you to play for roughly 20 hours total to complete the storyline (and perhaps a bit longer to find all of the lame unlockable movies and character art you can acquire), Redemption just doesn't feature anything new or intriguing--or anything at all, for that matter--to make it stand out. If this game were to travel back in time about three years to find its way onto the Dreamcast, it might have fared better. But in this day and age, with a bevy of better designed and far more entertaining third-person shooters available for both the PS2 and Xbox, Redemption falls quite a bit short of the bar."}