{"ref": "https://www.gamespot.com/reviews/deadly-premonition-2-a-blessing-in-disguise-review/1900-6417493/", "date": "July 9, 2020", "game_name": "Deadly Premonition 2: A Blessing in Disguise", "text": "Warning: This review contains spoilers for the first Deadly Premonition.The first Deadly Premonition was an anomaly, a seemingly unintentional oddity that enjoyed cult success by happenstance. It was an oxymoron of character development and unpredictable storytelling accompanied by a clunky, unintuitive gameplay experience. Its sequel, Deadly Premonition 2: A Blessing In Disguise, follows suit; however, though the return of the original's off-kilter writing, outlandish characters, and disturbing twists is an exciting prospect, it all feels diluted this time around, missing many of the flavor notes that defined its predecessor. There are incredible moments worth experiencing, all of which are held together by the game's protagonist, Francis York Morgan. But inexcusably poor performance issues (even by Deadly Premonition standards) make it hard to recommend to anyone outside the existing fandom. And even then, Deadly Premonition 2 stumbles in some of the places that made the first truly special.You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Deadly Premonition 2: A Blessing In Disguise Video ReviewThe game flips between the past and the present, first beginning in 2019, which is 10 years after the Greenvale case from the first game. FBI agent Francis York Morgan, now Francis Zach Morgan, has neither fully recovered from the tragic loss of his love, nor the revelation of his dual identity, and is now a retired recluse in his Boston, Massachusetts apartment. Seeing Morgan for the first time is jarring; he looks frail, sick, and alarmingly grey. He doesn't come off as slick and charming as he once did, but rather deranged and unstable, murmuring and talking to himself in the midst of a hoarder's dirty apartment--it's a stark contrast from the agent we know and love. The once illustrious agent, regaled for his inexplicable, and rather supernatural, investigation techniques, is now under scrutiny by the very bureau he once worked for.In these segments you play as Aaliyah Davis, a young and fierce FBI agent spearheading the investigation against Morgan. His unconventional methods are called into question after the discovery of Lise Clarkson's remains,one of the many victims from the 2005 murder case in the fictional Louisana city Le Carr that Morgan happened to stumble into at the time. Shortly after the discovery, Patricia Woods, a young girl associated with Morgan during the Le Carr case, goes missing, making Morgan a key suspect. It's a mirror story to Morgan's involvement with the Greenvale case. Aaliyah is convinced that Morgan is not, in fact, the crowning agent of the FBI.Watching Aaliyah battle the wits of veteran agent Morgan is truly thrilling, with each of them oozing their own brand of charisma. They go back and forth using FBI profiling tactics against the other in a battle of intellect. It paints a clear picture of their characters and the stake they both have in the case--Aaliyah being a factual realist trying to serve justice in a case once deemed solved by someone using unaccountable means, Morgan slyly dodging around her interrogations and trying to take control of the conversation. All the while, Aaliyah's partner, Simon Jones, balances the tension of the scenes with his innocence and ignorance by interjecting levity. These scenes are straightforward, focused primarily on dialogue exchanged by all three characters, and are some of the best in the game.But the game doesn't truly take form until you go back in time to 2005 to Le Carr, Louisiana, where you step into the shoes of a younger Francis York Morgan. On vacation to New Orleans, York takes a detour through Le Carr after getting word that a hallucinogenic drug he's been investigating, Saint Rogue, may be involved with the murder of Lise Clarkson.Within moments, playing York again is invigorating. From his quirky quips and offbeat candor to his conversations with his inner friend, Zach, York's identifying traits are in full force, and it never gets tiring.You're then introduced to Casa Pineapple, the hotel in which you'll be spending most of your time eating, sleeping, bathing, and shaving while in Le Carr. Before you even get to the lobby, you're introduced to some of the game's most bizarre inhabitants, like the multipersonality cook, bellboy, and concierge, David Jawara. Or the voodoo skeletal man, Houngan, who exists only in reflections and who only York can see.The game's dialogue is its crowning achievement; each line holds a sense of weight and wisdom. With every character interaction or observation, dialogue touches on anything from Louisiana history to philosophy to religion. Even when York first views the map to Le Carr, he speaks critically of its square shape, saying It's just another symbol of mankind's obsession with molding nature to fit our rules. It's a small moment, but it's a testament to York's astute nature.These opening moments were building towards an experience that should make any Deadly Premonition fan giddy; A Blessing in Disguise quickly felt strange and special, alluding to a bizarre, surreal adventure to come. All the boxes were being checked in setting up the foundation for a world I was desperate to explore. That is, until I stepped outside into the open world.A Blessing in Disguise quickly felt strange and special ... All the boxes were being checked in setting up the foundation for a world I was desperate to explore. That is, until I stepped outside into the open world.Up until this point, the game runs smoothly. But once you get out into Le Carr, the frame rate falls off a cliff; it feels as though the game is in a perpetual loading state, like it's constantly trying to catch up to your actions. As you trudge through the streets, trees and buildings render and appear only yards in front of you, with some pedestrians popping in when they're just feet away.Poor performance has become a part of Deadly Premonition's identity, but this is difficult to justify in the sequel. Most upsetting is that the world of Le Carr actually has plenty to do and explore--that is, of course, if you're willing to endure the jarringly inconsistent frame rate of the open world. It's concentrated with collectibles that are used for crafting, hidden and tucked into alleyways and back streets; parks and greenery stretch across open fields, populated with wolves, beehives, and alligators near the water. Through suburban streets, squirrels litter front yards, and miniature UFOs linger in the sky or are tucked sneakily into trees. The world has things to explore, see, and interact with, but none of it is worth exploring under the weight of the game's poor performance. The result of exploring and collecting is an arbitrary attempt in making the world feel alive, but ultimately distracts from the game's core: its story.When you're forced to move through the open world, you'll be maneuvering the choppy Southern European streets by skateboard. Yes, skateboard. You're an FBI agent investigating the gruesome and disturbing murder of a teenage girl on a skateboard, and it works immaculately in the bizarre, surreal world that Deadly Premonition exists in. But the very concept loses its impact due to the game's performance. You do eventually unlock fast travel, but there are whole chunks of the game, many of them being important story moments, that take place completely outside, so the game is often funneling you into areas where the performance suffers and your experience is diminished.But if there's one reason to push through the world's problems, it's Patricia Woods. Patricia is a young girl who develops a sudden affinity for Francis York Morgan and makes a pact with him to protect her from all evil in the world. There's an incredible dynamic between her and York; she constantly calls his methods into question, acting as a balance to logic and reason while York's understanding of everything seems fantastical. York, in his completely unaware candor, constantly patronizes her and berates her for not having seen The Terminator. The conversations are endearing in the way two siblings would bicker, and the oil and water dynamic between York's absurd views and Patricia's maturity is enjoyable to watch unfold.She accompanies you as you peel back layers upon layers of the Lise Clarkson murder case, unveiling a conspiracy surrounding a rich and powerful family that owns and controls most of the town. Very quickly, the story takes disturbing and horrific turns. The speed of this pivot comes at the expense of characterization. Too often you're introduced to new characters in the story who are murdered shortly after meeting them, which is unfortunate, because it leaves little time for mysteries to simmer. Questions are answered before you can even ask them.The more you explore Le Carr, and the more of the case you discover, the more the excitement introduced in the opening moments of the game deflates. While characters are worth meeting, their depth is only surface level. The first Deadly Premonition, while regarded for seemingly unintentional juxtaposition of serious dark mystery and unorthodox humor, was always weighted by its character development, which often shined most when going off the beaten path of the case. But these moments are unfortunately not really present in Deadly Premonition 2. Le Carr's residents do have routines and can be found at different areas of the map at different times. But making the effort to deal with the open world's performance and talk to these characters in your free time isn't nearly as rewarding or satisfying as it was in the first game.That isn't to say there aren't special moments with these characters or reasons to interact with them, as talking to them will trigger side quests. But even then, side quests rarely amount to a reward worth seeking. Certain characters like Xavier Johson, the tighty whitey-wearing bartender and sax player, is a character worth going out of your way to meet. But his side quest requires you to visit his bar once a day for an entire week--a time-consuming task that left much to be desired when it was over.A Blessing In Disguise's saving grace is its main characters. Francis Zach Morgan's arc, from the repercussions he faces for his supernatural methods to the hard journey he must take to close loose ends, is worth the time; Aaliyah Davis is a great contrast to York and is deserving of a story all her own, and Patricia Woods gives urgency to the story. In the end, its conclusion is an emotionally gratifying one for its characters, but an underwhelming finish for the Clarkson case and an experience wrought with performance issues for the player.If you can get past its performance, there are glimpses of a good story here, and moments that make it a worthy installment in the Francis Zach Morgan saga. But, ultimately, Deadly Premonition 2 lacks the emotional resonance found in the first game. It's a different brew of coffee from your favorite roaster, but one that's more bitter than you probably hoped for."}