{"ref": "https://www.gamespot.com/reviews/ion-assault-review/1900-6232140/", "date": "October 7, 2009", "game_name": "Ion Assault", "text": "It would be easy to dismiss Ion Assault as another game jumping on the dual-stick bandwagon, but if you're willing to give it a chance, you'll find a good amount of depth and difficulty beneath the space shooter exterior. If you've played Geometry Wars or Super Stardust, then you know roughly what to expect from the game's fundamentals. You take control of a small spaceship, and in much the same way as in the classic arcade shooter Asteroids, you must destroy all of the meteorites and floating rocks in a small arena in order to progress. There are four levels, each broken down into five stages and a boss fight. Along the way you also encounter many smaller enemies, each with different characteristics and weapons, which provide a good variety of challenge. Some, for example, will chase you around the arenas at speed, while others will hide behind asteroids and launch homing rockets at you from a distance. Good luck finding your ship in this screenshot if you've ever failed an Ishihara color test. Initially, these seemingly simple concepts can be confusing. This is because of an unusual control scheme that requires you to shoot with the left trigger, going against the conventions of almost every other shooter on the market. Rather than shoot with the right stick, as you might expect, you only aim with it, and every single blast requires a lengthy charging sequence before you can unleash laser doom on your foes. You can briefly reduce the charging time by flying near energy particles left by destroyed asteroids. At first, this mechanic is intrusive and slows down the pace of the action. However, once you become accustomed to absorbing the energy particles, everything begins to feel much more tactical, and you can prioritize your targets, getting faster and faster. You can even shepherd rocks together to earn multikill bonuses by taking several out with one blast. While you're dodging debris from exploded asteroids, enemy ships will enter the arena periodically, making things incredibly chaotic. You may struggle in the early stages as you get used to charging your main weapon. Thankfully the game does a good enough job of dropping shield and gravity power-ups in the early stages to help you cope. The gravity power-ups are among the most useful, because they enable you to draw energy particles to your ship from a much greater distance. As you progress through the four levels, you also get your hands on some serious firepower, including bombs that create vortexes to suck hostile ships and asteroids into oblivion. The pace of the gameplay increases quickly once you're using all of the power-ups, and it can be a very steep learning curve if you're not used to this style of gameplay. The change from slow, methodical battles to all-out chaos happens in a flash. And speaking of flash, some of the visual effects associated with special weapons are gorgeous. Claims from the developer that Ion Assault uses an ~unprecedented particle physics engine~ don't quite ring true, but it certainly looks good enough to get you excited. If you're a sucker for great visuals, then you won't be disappointed. On the other hand, you might find the audio annoying. All of your actions and even your menu choices are commented on by an irritating generic computer voice that even manages to make unlocking achievements sound dull. Youll find the whole experience much more relaxing if you just turn it off. You won't get to rest for long, though, because there is always an intense boss battle waiting just around the corner. After the fifth stage of each of the four levels, you'll be greeted by a huge enemy that often fills the whole arena. These fights require the sorts of skills you might expect from classic side-scrolling shooters, but sadly they never reach the same heights of imagination and difficulty. Once you've worked out their patterns, these bosses can usually be passed with relative ease. That's not to say this game isn't hard. In the later stages, you'll have to take on huge numbers of ships at the same time you're dealing with the floating asteroids. The screen quickly becomes filled with laser fire and missiles, turning into something of a fireworks show. It may be pretty to look at, but these sections can become infuriating, because it's easy to lose sight of your own ship amid the chaos. Multiplayer can be both entertaining and confusing. This confusion is made even worse if you're playing with a friend. Ion Assault supports co-op, both online and off, but even though the frame rate and net code cope well with the amount of madness happening onscreen, it becomes even harder to keep track of your own ship when there are two sets of friendly lasers flying around the screen on top of all the explosions being caused by your enemies. Multiplayer is also fleshed out with a versus mode that lets up to four players battle it out in a simple deathmatch setting. This mode certainly doesn't play to the game's tactical strengths, but it's a pleasant enough inclusion, even if it feels tacked on. The single-player game takes two to three hours to complete, depending on your ability level and how often you get stuck on the tougher sections. Replayability is helped by some difficult achievements and a decent leaderboard setup, though unfortunately you can't see your friends' scores while you play, so competition isn't encouraged. Nevertheless, at 800 Microsoft Points ($10), Ion Assault represents good value for the money. It has its share of shortcomings, but the core experience is compelling enough that if you enjoy the shooter genre, you'll have a good time. However, if you're looking to try the genre for the first time, then you ought to look elsewhere, because the learning curve and controls in Ion Assault can take a lot of getting used to."}