{"ref": "https://www.gamespot.com/reviews/shattered-union-review/1900-6136727/", "date": "October 27, 2005", "game_name": "Shattered Union", "text": "It's easy to dismiss Shattered Union as a clone of the hyperpopular Advance Wars games found on Nintendo's handheld systems. Yes, there are certainly similarities to Advance Wars. For example, Shattered Union is a turn-based combat game that features simple yet deep mechanics that are easy to pick up but hard to master, just like Advance Wars. But Shattered Union feels more like a spiritual heir to Panzer General, the great PC wargame of the early '90s that helped define the ~beer-and-pretzels~ style of wargaming. Panzer General was a huge hit because it offered elegant and simple gameplay that belied a considerable amount of strategic depth and replaybility. In other words, it was a game that just about anyone could pick up and enjoy, from the complete newcomer to the grizzled wargame veteran. The same could almost be said of Shattered Union, because it's a lightweight wargame that anyone can play and enjoy. In fact, Shattered Union gets the combat so right that it's a pity that the rest of the game doesn't measure up; otherwise, this could have been a classic in the making. As it is, it's an enjoyable, though somewhat flawed, strategy game with a ton of potential. Shattered Union depicts a modern-day American civil war, so choose your favorite faction and go take your aggression out on the rest of the country. The problem with most modern-day military wargames is that it's tough to find a fitting opponent for the United States and its military. So the solution in Shattered Union is to pit the United States against itself. Thanks to a deeply divided electorate (sound familiar?) and some dastardly Russian sabotage, the United States shatters into six regional factions, including Pacifica, the California Commonwealth, the Great Plains Federation, and the New England Alliance. To further complicate things, the European Union ~invades~ the smoking ruins of Washington D.C. (destroyed by a terrorist nuclear bomb) to restore order, thus setting the stage for the mother of all civil wars. Your job: Take control of a faction and reunite the shattered union by force. At your disposal is an arsenal of modern-day weapons--M1 tanks, B2 stealth bombers, Apache gunships, and infantry units, as well as a few hypothetical ones. And while the American factions tend to have the same arsenals (the Europeans, naturally, have their own gear), each faction does have at its disposal its own unique units and special powers. These special powers vary, but they come in both ~good~ and ~evil~ types, and you gain access to them by your political reputation in the game--but we'll get to that a bit later. Shattered Union takes place on two levels. The first is the strategic map, which divides the country into territories, though not necessarily states. Each faction starts with a handful of territories, which generate revenue that can be used to purchase new equipment or repair existing ones. During each turn, you can manage your units, and you must decide whether to attack a neighboring territory, or whether to defend a territory when invaded. Whether you go on offense or defense, you have to allocate forces to that battle; those forces will be unavailable for other battles later that turn, so it's important to keep a reserve, in case someone counterattacks you in a different territory. When you go into battle, you have the option of letting the computer automatically deploy your forces or doing the honor yourself. Your can have a wide variety of units at your command, and each has a role to play. Infantry are cheap and numerous, though relatively lacking in firepower and protection. Stick them in the confines of a city, though, and they might be tough to dig out. Engineers can lay mines and other obstacles to try and channel advancing enemies. Light armor have decent firepower and speed, making them great scouts, but they're vulnerable. Heavy armor are the kings of the battlefield, but they're slow and expensive. Antiaircraft units are worth their weight in gold, because they may be your only defense against fighters, bombers, and helicopters, but that also makes them a priority target for the enemy. Artillery can pummel most light units, but they're also high on the target list for the enemy. Units can only attack once per turn, and when two units engage one another, the game shows only those units and the results of the battle. There's very much a rock-scissors-paper balance to the units, but that doesn't mean that combat turns out the same way every time. There are modifiers that can improve or decrease your odds of success (for instance, is the enemy unit dug in to the confines of a city while your units are exposed on the open land outside the city?), as well as just plain luck in the way the virtual dice roll. The combat is incredibly easy to pick up, yet there's a lot of depth in the gameplay. Of course, the relationship between the units is important, but what's also cool in Shattered Union is how they relate to the battlefield. Basically, as you battle over chunks of America, the game keeps track and remembers everything that happens. Blow up a bridge and it'll stay destroyed in subsequent battles. Pummel a city to rubble and it'll remain rubble, should you happen to revisit that battlefield. That also brings up an important feature in the game: political reputation. If you inflict too much collateral damage (by, say, leveling a city with a B-2 bomber to kill some infantry), then your political reputation will take a hit, as the global media instantly transmits your deeds around the world. This will affect you in battle several ways. For one, it may result in more partisan units appearing to battle against you, and these units, though extremely vulnerable, serve as excellent scouts, and more importantly, canon fodder that can make a unit waste its attack for that turn. More importantly, your reputation will affect your special powers, which are abilities that are unique to each faction. The better your reputation, the more ~good~ your special abilities, such as being able to heal units or to extend their visibility range. Conversely, the worse your reputation, the more ~evil~ abilities you can unlock, such as tactical nuclear cruise missiles and depleted uranium munitions for that extra punch. Shattered Union also abstracts otherwise complex issues into simple terms. For instance, logistics is handled well; your units have limited amount of fuel, and when that's all burned up, they can't move anymore. This means that you can't race across the map, but must halt to allow logistics to catch up to you, refueling and repairing damage. But this also gives the enemy a chance to regroup, so you have to carefully decide when to go all out, because the worst thing that can happen is to run out of gas with your units vulnerable and isolated from one another. Your units actually gain experience over time, becoming tougher, more powerful, and essentially, more valuable. That makes you go out of your way to try and preserve them in battle, and it also increases the sting when one of them is destroyed. Combat is simple and makes sense, and it rewards good tactics, such as seeking protection in cities. Put it all together and the combat in Shattered Union shines. The tactical battles are fast-paced and simple to play, yet they offer lots of challenging tactical gameplay. For instance, when you're on the attack, you'll quickly learn to amass your firepower and use scouts (which are cheap and disposable) to locate the enemy so you can bring the hammer to bear down upon them. Meanwhile, when on defense, it's all about setting up a layered defense to whittle down the enemy. And, generally, the computer is a decent opponent, though it does make some stupid mistakes. The artificial intelligence is pretty good when on defense, as it knows how to keep forces in reserve and it likes to attack when your forces are strung out in a march. On offense, though, it's fairly predictable and sends units at you somewhat piecemeal. And the computer also doesn't seem to identify the ~real~ threat. Since units can attack only once per turn, it makes sense to take out the most potent threat first; however, the AI will occasionally pass up the logical target and go after a less obvious one. While that's great for you, it's also the kind of rookie mistake that kind of ruins the illusion that you're battling a ruthless foe. Thankfully, Shattered Union does allow you to play skirmish modes in both single-player and multiplayer, and in the case of the latter, it offers hot-seat and network play that works fairly well, though you're in for a long wait for your turn if your opponent takes his or her own sweet time. A bigger issue is that the strategic portion of the game feels fairly basic compared to the richness of the battles. For one thing, there's a notable lack of even rudimentary diplomacy, and it would be nice to have been able to create alliances of convenience, so that you can gang up on the faction that's currently in the lead. Speaking of which, the computer factions tend to do a horrible job of recognizing the real threat. If one faction has a dominant lead and momentum, the other factions don't seem to recognize that and will exhaust their strength battling one another, or you, rather than the real threat. This can be a bit frustrating, because that gives the major faction a free pass to bulk up while you're constantly being harassed by the minor factions. And progress in the game can come slowly; it often feels like you take one step backwards every time you progress two steps. For instance, take a territory, and odds are you'll be counterattacked in that territory in the coming turn, which means that you'll have to fight there again. It's not unusual to have to battle in the same territory time after time until you finally boot the enemy out of any adjacent territories. And while that captures the back-and-forth of warfare (just think of the Civil War), it can often make you feel as though you're mired in a quagmire. In between battles you can repair damaged units or purchase hideously expensive new ones to replace losses. Shattered Union very much has a board game feel to it, right down to the hex-based maps and the huge unit counters that make tanks and helicopters Godzilla-size compared to cities and the terrain. Because this is a game about a second American Civil War, you'll get to battle all across the great land, and landmarks in individual cities help identify them, such as the famous St. Louis Gateway Arch, or the Pentagon in the burnt-out ruins of Washington D.C. (By the way, destroying landmarks is an extrabig negative in your reputation column.) Though nowhere near as pretty or as cutting-edge as other strategy games, the style of Shattered Union works for the game; it has an old-school look and feel to it, which is fitting since it's an old-school strategy game. The Xbox version of the game simply isn't as crisp-looking as the PC version, though, and as a result, it's harder to get a ~big picture~ of the battle--you have to keep the game zoomed in most of the time to tell what's going on. The Xbox version also suffers from some annoying load times between battles. The game's simple mechanics lend themselves well to the Xbox's gamepad, and it's easy to control, at least. The sound effects and music are pretty solid, though pretty much what'd you expect from a modern-day strategy game. You can hear the rumble of tank engines, the thrum of helicopter blades, and the whoosh of missiles flying in the air. Despite Shattered Union's flaws, we still found ourselves enjoying the gameplay quite a bit. This is the kind of lightweight wargame that no one seems to make anymore, and it's still a bit surprising that a major publisher would be behind this in a day and age when turn-based wargames are the domain of the niche publishers. There's certainly room for improvement, and we hope that Shattered Union will get a chance for a sequel, because this is a game with a ton of potential. Make no mistake, though; this is still an interesting and engaging wargame that anyone can pick up and play, and the subject matter is undeniably cool. Shattered Union also abstracts otherwise complex issues into simple terms. For instance, logistics is handled well; your units have limited amount of fuel, and when that's all burned up, they can't move anymore. This means that you can't race across the map, but must halt to allow logistics to catch up to you, refueling and repairing damage. But this also gives the enemy a chance to regroup, so you have to carefully decide when to go all out, because the worst thing that can happen is to run out of gas with your units vulnerable and isolated from one another. Your units actually gain experience over time, becoming tougher, more powerful, and essentially, more valuable. That makes you go out of your way to try and preserve them in battle, and it also increases the sting when one of them is destroyed. Combat is simple and makes sense, and it rewards good tactics, such as seeking protection in cities. Put it all together and the combat in Shattered Union shines. The tactical battles are fast-paced and simple to play, yet they offer lots of challenging tactical gameplay. For instance, when you're on the attack, you'll quickly learn to amass your firepower and use scouts (which are cheap and disposable) to locate the enemy so you can bring the hammer to bear down upon them. Meanwhile, when on defense, it's all about setting up a layered defense to whittle down the enemy. And, generally, the computer is a decent opponent, though it does make some stupid mistakes. The artificial intelligence is pretty good when on defense, as it knows how to keep forces in reserve and it likes to attack when your forces are strung out in a march. On offense, though, it's fairly predictable and sends units at you somewhat piecemeal. And the computer also doesn't seem to identify the ~real~ threat. Since units can attack only once per turn, it makes sense to take out the most potent threat first; however, the AI will occasionally pass up the logical target and go after a less obvious one. While that's great for you, it's also the kind of rookie mistake that kind of ruins the illusion that you're battling a ruthless foe. Thankfully, Shattered Union does allow you to play skirmish modes in both single-player and multiplayer, and in the case of the latter, it offers hot-seat and network play that works fairly well, though you're in for a long wait for your turn if your opponent takes his or her own sweet time. A bigger issue is that the strategic portion of the game feels fairly basic compared to the richness of the battles. For one thing, there's a notable lack of even rudimentary diplomacy, and it would be nice to have been able to create alliances of convenience, so that you can gang up on the faction that's currently in the lead. Speaking of which, the computer factions tend to do a horrible job of recognizing the real threat. If one faction has a dominant lead and momentum, the other factions don't seem to recognize that and will exhaust their strength battling one another, or you, rather than the real threat. This can be a bit frustrating, because that gives the major faction a free pass to bulk up while you're constantly being harassed by the minor factions. And progress in the game can come slowly; it often feels like you take one step backwards every time you progress two steps. For instance, take a territory, and odds are you'll be counterattacked in that territory in the coming turn, which means that you'll have to fight there again. It's not unusual to have to battle in the same territory time after time until you finally boot the enemy out of any adjacent territories. And while that captures the back-and-forth of warfare (just think of the Civil War), it can often make you feel as though you're mired in a quagmire. In between battles you can repair damaged units or purchase hideously expensive new ones to replace losses. Shattered Union very much has a board game feel to it, right down to the hex-based maps and the huge unit counters that make tanks and helicopters Godzilla-size compared to cities and the terrain. Because this is a game about a second American Civil War, you'll get to battle all across the great land, and landmarks in individual cities help identify them, such as the famous St. Louis Gateway Arch, or the Pentagon in the burnt-out ruins of Washington D.C. (By the way, destroying landmarks is an extrabig negative in your reputation column.) Though nowhere near as pretty or as cutting-edge as other strategy games, the style of Shattered Union works for the game; it has an old-school look and feel to it, which is fitting since it's an old-school strategy game. The Xbox version of the game simply isn't as crisp-looking as the PC version, though, and as a result, it's harder to get a ~big picture~ of the battle--you have to keep the game zoomed in most of the time to tell what's going on. The Xbox version also suffers from some annoying load times between battles. The game's simple mechanics lend themselves well to the Xbox's gamepad, and it's easy to control, at least. The sound effects and music are pretty solid, though pretty much what'd you expect from a modern-day strategy game. You can hear the rumble of tank engines, the thrum of helicopter blades, and the whoosh of missiles flying in the air. Despite Shattered Union's flaws, we still found ourselves enjoying the gameplay quite a bit. This is the kind of lightweight wargame that no one seems to make anymore, and it's still a bit surprising that a major publisher would be behind this in a day and age when turn-based wargames are the domain of the niche publishers. There's certainly room for improvement, and we hope that Shattered Union will get a chance for a sequel, because this is a game with a ton of potential. Make no mistake, though; this is still an interesting and engaging wargame that anyone can pick up and play, and the subject matter is undeniably cool."}