{"ref": "https://www.gamespot.com/reviews/deal-or-no-deal-review/1900-6164749/", "date": "January 25, 2007", "game_name": "Deal or No Deal", "text": "Deal or No Deal presents a bit of a conundrum. Yes, it's a fairly accurate PC-game rendition of the uberpopular NBC game show starring Mr. St. Elsewhere himself, Howie Mandel, and yes, it is a budget-priced game. Fans of the game show are likely to squeal with delight at the prospect of being able to play their favorite game at home--but before you run out and drop a twin on this one, stop and think. Think to yourself, why? Why pay for a Deal or No Deal game, when dozens of free flash games with the same formula exist (on NBC's Web site, at that)? Is it for the cheap, lousy minigames included? Is it for the promise of multiplayer action? Is it because you're hopelessly in love with Howie Mandel's soul patch? Ponder these questions as we delve deeper into the enigma that is the value of owning Deal or No Deal. All those failed modeling careers... Deal or No Deal offers the exact game you've probably seen on TV numerous times. In this, the world's most skill-free game show, contestants are offered 26 metal briefcases, each containing a dollar amount. You start the show by picking one, and that one becomes your case. Through of series of rounds, you then begin selecting the other cases on the board. The idea is to try to eliminate all the low amounts currently displayed (though the high amounts tend to disappear as well). At the end of each round, a mysterious ~banker,~ who sits in a dark room staring at a computer screen, offers you an amount of money (seemingly based on your play style, and the aggregate average of the amounts still left on the board) to buy your case. From there, it's, ~Deal, or no deal?~ Get it? Good. This PC game offers precisely the same game formula, but without the hope of winning real money. Perhaps the one advantage is that this game offers the same pacing of the show, as well as many of Mandel's trademark lines (though not all of them, and the dialogue tends to start repeating after just a few plays), but apart from those bells and whistles, there's not much on offer here to set the game apart from the many, many freeware versions of Deal or No Deal that exist all over the Internet. Why buy the cow when the milk is free just about everywhere? Hopefully, it isn't for the ~bonus features.~ Multiplayer and minigames are also offered in this package, and neither are very good. Minigames consist of little more than a cheap slider puzzle, a memory game, and a three-card monte variant. None of them are fun for more than a single play. The multiplayer is perhaps the most intriguing option, since it futzes with the main game formula a bit and has you and another player trading off turns, trying to make the best deal possible. There's also a ~family-friendly~ version of the game, where players can create custom prizes. Some of the default options include household chores and tasks for new parents (changing diapers, feedings, and such). While this might work for the most boring people alive, the rest of you can opt to create your own prizes. Perhaps those with more active imaginations (or, at the very least, filthier minds) can create more-sordid prizes with their significant other(s). Clearly, this is the most useful function the game has to offer. But is that enough to make Deal or No Deal worth paying for? Hardly. Sure, it's amusing for the first one or two plays, and maybe there's a bit of devious amusement to be had with the custom prize mode, but the fact remains that the necessity of owning a Deal or No Deal game just isn't there. There isn't even that level of trivial skill involved that you tend to get with most game show games, because there's no trivial knowledge required. There's no skill required at all! You're just picking random numbers and hoping for the best. It's all well and good to watch on TV when there's real money involved, and there's nothing wrong with playing something like this for free on the Internet. But actually going to the trouble of paying for a fake-money version of it? That's a poor deal any way you slice it."}