{"ref": "https://www.gamespot.com/reviews/ace-combat-04-shattered-skies-review/1900-2819749/", "date": "May 17, 2006", "game_name": "Ace Combat 04: Shattered Skies", "text": "The first Ace Combat game to be released on the PlayStation 2 is finally here, and fans of Namco's venerable series of casual flight sims will undoubtedly find it to have been well worth the wait. Ace Combat 04: Shattered Skies isn't only the best looking of the series, but also the first to integrate a compelling plot and believable characters with the typical harried action that's associated with these types of games.Easily the most interesting aspect of the game is its unique narrative. Even though Ace Combat 04 boasts 21 real-world flyable aircraft, the game takes place around the fictitious continent of Eugea and its plot unfolds through the eyes of a young boy living in the occupied town of San Salvacion. The entire story is narrated by this boy through a series of beautiful hand-drawn animation stills, and he tells the tale of the occupying force's ace pilot, Yellow 13, and how your actions throughout the 18-mission single-player campaign affect his demeanor. Interestingly enough, you'll get to know more about this boy and Yellow 13 than you will about your own character, who remains faceless and nameless (except for your code name of Mobius One) throughout the entire game. You'll be greeted by these stills, which are further brought to life by a melodic soundtrack and great sound effects at the end of every other mission, and once you finish the game, you'll have the ability to watch any of these clips at your leisure.This same attentiveness to detail can be found throughout the game as well. Ace Combat 04's graphics engine is an impressive one that can render beautiful environments, realistic weather effects, and numerous detailed airborne and ground-based objects while maintaining a steady 60fps. With varied terrain types such as canyon environments, beachheads, glaciers, and archipelagoes, none of the game's 18 levels look alike. Likewise, each of the 21 playable planes (as well as the noninteractive ones) boasts a very high level of detail, such as self-shadowing, local environment reflection, moving parts, and jet wash. The interface is similarly very clean, allowing you to quickly take note of your weapon stores, the amount of damage your plane has sustained, and scanning your radar. And as the levels themselves are varied, so too are the individual missions. While all 18 of Ace Combat 04's missions are timed, their objectives differ from one level to the next and include everything from standard escort missions to a strike on an air base. These sorties are very well executed, and they always remain interesting from level to level. Some particularly noteworthy missions include intercepting several nuclear-tipped cruise missiles that explode in dramatic fashion, ground support for a beach invasion that's reminiscent of the opening scenes of Saving Private Ryan, and a massive air war over a rocket launch site involving no less than 30 aircraft at once. Each of these levels has its own soundtrack, and this music ranges from sharp beats that convey the tense moments before an attack to an operatic score during a pitch battle amid a monsoon.As you'd expect, the game doesn't let you assume control of all 21 planes initially; rather, you'll be relegated to the relatively weak F-4 and F-5 initially. As you complete more missions, you'll earn enough points to purchase more advanced fighters, such as the F-2, F-22, SU-37, and F-15 Active. Additionally, each of the missions has a couple of ace pilots who aren't part of that level's objectives. If you manage to shoot these pilots down, you'll gain access to several different paint jobs to the planes in your hangar. It's interesting to note the interplay between Ace Combat 04's many planes. KC-10s will often be seen refueling fighter planes; E-767s will fly high above the action in an attempt to provide electronic support to its fighters and jam its enemies; SU-27s will perform the Cobra maneuver; A-10s will flip upside down to acquire their targets. And this interactivity isn't limited to aircraft alone, either, as you can easily make out ground battles between tanks and other armored vehicles as well. This is certainly a subtle touch that only a die-hard fan of combat flight simulation will be able to appreciate, but it goes a long way in making Ace Combat 04 a believable game and not just an action game in flight-sim clothing.Because Ace Combat 04 will let you reattempt any of its missions once you finish the single-player campaign, the game does have some replay value. There are even five multiplayer levels that will let you and a friend go head-to-head in planes of your choosing. In the end, it's hard to find fault in the game. Ace Combat 04: Shattered Skies is a highly enjoyable, well-executed flight sim that perfectly blends the action elements found in the series' earlier games with the sort of narrative typically reserved for other genres."}