{"ref": "https://www.gamespot.com/reviews/breath-of-fire-review/1900-2837301/", "date": "January 8, 2002", "game_name": "Breath of Fire", "text": "Since its June launch, the Game Boy Advance has slowly been developing its identity as a gaming platform. While the system is capable of truly impressive 3D visuals for a handheld, the 2D games that have come out for it make a strong case for the GBA becoming the spiritual progeny of the legendary SNES. Capcom's recent conversion of the classic SNES RPG Breath of Fire lends credence to that label. A pixel-perfect translation of the SNES game with a link cable feature and some graphical tweaks thrown in for good measure, Breath of Fire is an engaging piece of work that's worth checking out. The story is classic RPG all the way. You play as Ryu, a member of the ancient Light Dragon Clan, who sets out on a journey to discover the mysteries of his people in order to save them. As is always the case with such a quest, Ryu will meet a motley crew of colorful individuals along the way who join him on his quest. You'll eventually have a stable of eight characters to swap into your party, and you can have a max of four in combat, each with his or her own strengths, weaknesses, abilities, and back story. You'll also find that each character will have his or her own unique special abilities, which will come in handy in your travels when that character is at the head of the party. For example, Ryu will be able to fish, Bo will be able to walk through forests on the world map, Nina will be able to get you to seemingly inaccessible areas, Ox will be able to slam into objects to shake loose items or open new paths, and so on. The gameplay is standard RPG fare. You'll explore the world by traveling across a world map and interacting with various characters in towns. During your travels, you'll enter into combat with enemies via random encounters and boss battles. As you explore dungeons and caves in search of items or to complete quests discovered by chatting with NPCs, your party members will level up, gaining new attacks and finding items. The combat is of the turn-based variety, although a nice feature allows you to have the AI automatically fight a battle, which comes in handy if you keep ending up in fights with low-level enemies. The game now features an option to run automatically in the game, which you'll appreciate as you trek through your quest.Graphically, the game is an excellent conversion of the SNES game, right down to the partially animated cinematic shots that come up during certain events. In addition, the character portraits have been redone to keep the cast looking spry. Despite the problems of properly lighting the Game Boy Advance's screen while playing a game, Breath of Fire looks great on the GBA. Do bear in mind that, in this case, ~great~ means the GBA Breath of Fire matches the quality of its 9-year-old SNES predecessor with little trouble. Capcom has opted not to upgrade the game's look visually for the GBA, which results in graphics that don't quite sync up with the quality of currently available GBA games. Fortunately, in spite of its slightly dated graphics, Breath of Fire still looks very good. The characters sport a bit of animation when attacking and are detailed. The spell effects are nice but humble, featuring plain animation. The sound in the game is pretty sparse, as was the case with a lot of RPGs back in the early '90s. You'll hear a few chirps and sound effects during combat and assorted themes as you make your way through the world map. Unfortunately, what worked on the SNES doesn't really test the GBA's impressive sound hardware. While it all works well enough, it just sounds tinny on the GBA. While the graphics and sound don't really take advantage of the GBA's power, there is a nod to the system's abilities, thanks to a link cable feature that allows you to trade items with a friend in need. The feature will also randomly grant you extra items when trading, which keeps things interesting. While it's not the best-looking or most technically impressive RPG out for the system, Breath of Fire is still a rock-solid game. Thanks to the faithful translation of the SNES game, the lengthy quest offers a meaty challenge for RPG fans to get sucked into. If you haven't played the game before or want to relive some choice gaming moments, you should check it out."}