{"ref": "https://www.gamespot.com/reviews/ghost-master-review/1900-6074005/", "date": "August 26, 2003", "game_name": "Ghost Master (2003)", "text": "If you're looking for a new twist on ghoulies, ghosties, long-legged beasties, and things that go bump in the night, look no further than Ghost Master. Sick Puppies' real-time strategy game stands horror-game traditions on their heads, swapping the spooks and scares of Resident Evil and Silent Hill for supernatural management duties reminiscent of Dungeon Master. It's a great novelty, first of all, but it's also a real success in terms of gameplay, thanks to outstanding scenario design and an irreverent sense of humor. Some of the haunting stunts you can pull are straight out of Ghostbusters. The core elements of Ghost Master are simple. Reverse the stereotypical ghost story and you have a pretty good idea what this game is all about. Unlike in your garden-variety horror game, where you wander the halls of a haunted house waiting to be frightened into a fresh pair of BVDs, here you're some kind of dead civil servant (insert ~are there any other kind?~ or similar joke here) in charge of the rattling chains and disembodied footsteps. Problems in the small town of Gravenville have attracted the notice of the Haunter Committee, and you're sent to set things right by generally scaring the bejesus out of the flesh-and-blood types. You do this by recruiting a team of ghosts for each scenario. This spook squad is drawn from six categories--sprites, disturbances, elementals, vapours, frighteners, and horrors--named for the chief characteristics and skills of their members. The sprites class, for instance, consists of minor spirits who mess up electrical appliances, like the cogjammer gremlin and the ghostly spider, clatterclaws. Elementals features aether and earthwall, who have the capabilities of air and earth elementals, respectively. Horrors represents the worst of the worst, such as the mortal-possessing ghastly and the headless horseman. Every sort of spook that's ever made type B-positive run down the walls in a fright flick is at your beck and call here. Using your team in the field is a balancing act. Ghosts must be fettered to specific objects, so you can't spread them all over the map. Gremlins have to be attached to electronic appliances, such as microwaves and televisions. Apparitions, shadows, and wraiths are stuck to murder scenes. Weatherwitches and headless horsemen are linked to thoroughfares like hallways and roads. And so on. Role-playing concerns also crop up. While certain types of ghosts are necessities in some situations, there's a benefit to using the same spooks in multiple missions, because they gain experience and become easier to control. They can also be upgraded with new skills, which are purchased in the ghoul room with the gold plasm awarded at the end of each successful scenario. Managing your spook squad is about more than just picking the right ghoul for the job. Few things will scare homeowners as much as revealing rotting corpses in boarded-up rooms. Regular plasm consumption is another issue. This is the sole resource in the game, powering your ability to manifest ghosts and all their spectral abilities. Overtax yourself and you can run out of this vital substance, a dire scenario that ends the current haunt and throws you out of the mortal realm. Plasm is earned by scaring people, forcing you to keep a focus on screams and shudders even when the scenario objectives involve something more subtle than driving residents out of their homes. Even with these physical anchors and resource restrictions, a lot of moving around is required. For starters, your victims don't stand still. Humans in the game communicate in thought balloons and gibberish voices, much like those in The Sims, and are rated in terms of belief, terror, and madness. Build their belief that something out of the ordinary is going on and you'll be able to terrify them or drive them mad. Affect either of the latter categories through something like an eerie laugh, a chill wind blowing through a sealed room, or a ghost playing peekaboo, and the victim will flee, forcing you to adjust your tactics. They even have individual fears, like lightning or insects, which can be revealed with powers like know aura and then used to your advantage. People will run out of rooms, go from one floor to another, and even dash into the backyard or street to get away from your ghosts, so you need to keep up the assault by locating new fetters. After a little time on each level, you'll get an idea of your victims' escape routes. The level design typically includes lots of locations where you can set up traps to keep mortals so scared that they soon run off into the night or simply go nuts. Needless to say, you can derive a lot of sadistic glee from this. Put a ghastly in a living room, a spook and a cogjammer in a kitchen, and a weatherwitch in the hallway separating them and you can watch your victims slowly lose their minds as they go from one spine-tingling jolt to the next. Collect gold plasm and you can train your ghosts with different spooky skills. The scenarios themselves are well designed and fairly plentiful (more than a dozen are spread across three acts). Most are more tongue-in-cheek than openly ghoulish, although there are lots of corpses to be unearthed amid the guffaws. All poke fun at movies and TV shows, both horror and mainstream. Scenario names include Ghostbreakers, Poultrygeist, and Phantom of the Operating Room, and plots have been lifted from movies like Evil Dead (faithfully adapted lock, stock, and Necronomicon) and Sleepy Hollow. Look closely at the names of your victims and you'll notice some surprises as well. The Haunting 101 tutorial mission, for example, sees you sending apparitions against Blair, Tootie, and their pals from the '80s sitcom The Facts of Life. There isn't really an overarching plot, though the people you scare in one scenario often show up in another. You really do get the sense that you're haunting a small town. For example, the Hutz family you haunted in The Calamityville Horror and the kids you drove away from their frat house in Weird Sance show up in the Gravenville police station in The Unusual Suspects. The only problem with this approach is that Gravenville is a little too small, seeing as you have to haunt some places more than once. The design goes beyond grade-school puns. Scenarios consist of a mixture of puzzles and straightforward rock-paper-scissors design elements, so that you're attempting to complete different objectives each time out. You scare jocks out of frat houses, unveil hidden corpses, assist university students with occult rites, convince a mob boss to believe in ghosts, frighten the locked-up criminals out of a police station, and so forth. Sometimes you even have to avoid scaring people away or driving them mad, as you need them in a lucid state so you can fulfill certain objectives. Puzzles are paramount, as the houses to be haunted always include fettered spirits that can be freed to join your ranks by accomplishing set goals. Some of these are fairly simple--to release Raindance from his toilet prison in the Evil Dead homage Summoners Not Included, all you have to do is clear some bees from in front of a Porta Potti, and to spring Sparkle in The Blair Wisp Project, you just need to start a campfire. Others are fairly difficult and involve multiple steps, although there are never so many steps that you'll curse the absence of a mid-mission save option (even the most complex scenario can be wrapped up in around 30 minutes). Getting Static out of the chimney in The Calamityville Horror is a good example of this. You start by using earthwall to create a tremor on the roof, knocking the spirit's mortal remains to the fireplace below. Then you have to attract people to the remains by ordering a spook to use telekinesis to throw a femur or two around the living room. Or chill the living room down with spectral cold, which causes humans to light a fire and discover the bones in the grate. There are different ways to handle almost all objectives, which enhances the game's replay value. Pay attention to clues and ghost abilities, and be patient enough to lure victims into the right place at the right time, and you'll soon discover many ways to scare people out of their wits. High production values add a lot of atmosphere. The graphics are bright and cartoony, if a little dated. Similarities to The Sims are so pronounced that the game could have been built on that engine. Ghosts and their spectral special effects show a strong Ghostbusters influence. Many of the entities bear more than a passing resemblance to Slimer, and you can use telekinesis to toss around books like in the movie's famous library scene. Fettered ghosts like Wilbur always have interesting epitaphs. The audio is simply spectacular. The atmospheric effects are solidly spooky, bolstered by EAX support. Whenever you order a ghost to create disembodied footsteps or an eerie laugh, you'll hear them echo. And the bouncy musical soundtrack sounds like a Danny Elfman creation, reminiscent of the opening score he did for the old Tales From the Crypt television show. Jazz and traditional pop are used to create a slightly uneasy mood where you're never sure what's coming next. About the only thing missing from Ghost Master is a multiplayer mode, although it's hard to imagine how Sick Puppies could have incorporated such an option into a puzzle-oriented title like this. And the game isn't exactly any poorer for the omission of multiplayer features, since the numerous missions and impressive replay value will keep it on your hard drive for quite some time. People will run out of rooms, go from one floor to another, and even dash into the backyard or street to get away from your ghosts, so you need to keep up the assault by locating new fetters. After a little time on each level, you'll get an idea of your victims' escape routes. The level design typically includes lots of locations where you can set up traps to keep mortals so scared that they soon run off into the night or simply go nuts. Needless to say, you can derive a lot of sadistic glee from this. Put a ghastly in a living room, a spook and a cogjammer in a kitchen, and a weatherwitch in the hallway separating them and you can watch your victims slowly lose their minds as they go from one spine-tingling jolt to the next. Collect gold plasm and you can train your ghosts with different spooky skills. The scenarios themselves are well designed and fairly plentiful (more than a dozen are spread across three acts). Most are more tongue-in-cheek than openly ghoulish, although there are lots of corpses to be unearthed amid the guffaws. All poke fun at movies and TV shows, both horror and mainstream. Scenario names include Ghostbreakers, Poultrygeist, and Phantom of the Operating Room, and plots have been lifted from movies like Evil Dead (faithfully adapted lock, stock, and Necronomicon) and Sleepy Hollow. Look closely at the names of your victims and you'll notice some surprises as well. The Haunting 101 tutorial mission, for example, sees you sending apparitions against Blair, Tootie, and their pals from the '80s sitcom The Facts of Life. There isn't really an overarching plot, though the people you scare in one scenario often show up in another. You really do get the sense that you're haunting a small town. For example, the Hutz family you haunted in The Calamityville Horror and the kids you drove away from their frat house in Weird Sance show up in the Gravenville police station in The Unusual Suspects. The only problem with this approach is that Gravenville is a little too small, seeing as you have to haunt some places more than once. The design goes beyond grade-school puns. Scenarios consist of a mixture of puzzles and straightforward rock-paper-scissors design elements, so that you're attempting to complete different objectives each time out. You scare jocks out of frat houses, unveil hidden corpses, assist university students with occult rites, convince a mob boss to believe in ghosts, frighten the locked-up criminals out of a police station, and so forth. Sometimes you even have to avoid scaring people away or driving them mad, as you need them in a lucid state so you can fulfill certain objectives. Puzzles are paramount, as the houses to be haunted always include fettered spirits that can be freed to join your ranks by accomplishing set goals. Some of these are fairly simple--to release Raindance from his toilet prison in the Evil Dead homage Summoners Not Included, all you have to do is clear some bees from in front of a Porta Potti, and to spring Sparkle in The Blair Wisp Project, you just need to start a campfire. Others are fairly difficult and involve multiple steps, although there are never so many steps that you'll curse the absence of a mid-mission save option (even the most complex scenario can be wrapped up in around 30 minutes). Getting Static out of the chimney in The Calamityville Horror is a good example of this. You start by using earthwall to create a tremor on the roof, knocking the spirit's mortal remains to the fireplace below. Then you have to attract people to the remains by ordering a spook to use telekinesis to throw a femur or two around the living room. Or chill the living room down with spectral cold, which causes humans to light a fire and discover the bones in the grate. There are different ways to handle almost all objectives, which enhances the game's replay value. Pay attention to clues and ghost abilities, and be patient enough to lure victims into the right place at the right time, and you'll soon discover many ways to scare people out of their wits. High production values add a lot of atmosphere. The graphics are bright and cartoony, if a little dated. Similarities to The Sims are so pronounced that the game could have been built on that engine. Ghosts and their spectral special effects show a strong Ghostbusters influence. Many of the entities bear more than a passing resemblance to Slimer, and you can use telekinesis to toss around books like in the movie's famous library scene. Fettered ghosts like Wilbur always have interesting epitaphs. The audio is simply spectacular. The atmospheric effects are solidly spooky, bolstered by EAX support. Whenever you order a ghost to create disembodied footsteps or an eerie laugh, you'll hear them echo. And the bouncy musical soundtrack sounds like a Danny Elfman creation, reminiscent of the opening score he did for the old Tales From the Crypt television show. Jazz and traditional pop are used to create a slightly uneasy mood where you're never sure what's coming next. About the only thing missing from Ghost Master is a multiplayer mode, although it's hard to imagine how Sick Puppies could have incorporated such an option into a puzzle-oriented title like this. And the game isn't exactly any poorer for the omission of multiplayer features, since the numerous missions and impressive replay value will keep it on your hard drive for quite some time."}