{"ref": "https://www.gamespot.com/reviews/beautiful-katamari-review/1900-6181130/", "date": "October 16, 2007", "game_name": "Beautiful Katamari", "text": "Something about Beautiful Katamari feels a little bit...off. Not in a ~this game is bad~ kind of way, but more of a ~haven't we done all this before?~ kind of way. Beautiful Katamari is the fourth entry in Namco Bandai's utterly loopy franchise about space royalty, painstakingly laid-out clutter, and magical balls that roll up anything in their path into massive planet-replacing clumps, and it's quite a lot like its predecessors. Of course, that's not exactly a bad thing. The same cheery vibe and frequent ludicrousness from the previous games permeate every aspect of this newest installment. But at the same time, all that ludicrousness isn't quite as ludicrous anymore, now that it's been done so many times. Still, there's plenty of good-natured silliness and clump-making fun to be had in Beautiful Katamari, even if it is all too familiar. You've rolled this clump before, but you'll be happy to do it again in Beautiful Katamari. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Beautiful Katamari Video Review 1 For those unfamiliar with the Katamari series up to this point, it revolves around the clump-rolling adventures of the Prince of All Cosmos, an adorably teensy sprite of a creature who is dwarfed both in size and ego by his pompous, flamboyant, and deeply unhinged father, the King of All Cosmos. With each game, the king finds some excuse to force the prince to roll up various parts of Earth into delightful katamaris, so that he can use his powers to turn them into new stars, planets, satellites, and other celestial bric-a-brac. In the case of Beautiful Katamari, the royal family of the cosmos is on vacation and enjoying a game of tennis. When the king delivers his patented serve, he accidentally tears a hole in the universe, which begins sucking up all the planetary bodies in the vicinity. Never one to fix his own mistakes, the king sends the prince to Earth to replace all the lost space landmarks. You do this by rolling a katamari around one of several bizarre environments. Controlling the katamari simply involves moving the two sticks on the Xbox 360 controller around as if you were controlling a tank. The catch is that you can only roll up items that are relative in size to your katamari. So if you're presented with a teensy katamari, you can only roll up small things, like thumbtacks, coins, and candy pieces, until you're big enough to move on to the next tier of items. Eventually you'll be rolling up people, cars, floating cows, giant mushrooms, Ferris wheels, giant squids, clouds, Trinidad & Tobago, and Orion's Belt, among many, many, many other things. Most likely this sounds completely insane, and it certainly is, especially if you've never played one of these games before. But if you have, it might sound all too familiar to you. Beautiful Katamari really is just an exercise in the same formula that the series has been relying on since its inception. You get a few gimmicky stages, like the one where you have to roll up nothing but hot things to get the katamari's temperature to 10,000 degrees, and the peculiar final stage certainly offers something of an interesting twist; but otherwise, it's the exact same formula as the previous games. Still, as predictable and generally unaltered as Beautiful Katamari is, it's quite a bit of fun. Rolling up katamaris is as inexplicably addictive and amusing as it ever was, and though you go into the game knowing the King of All Cosmos is going to deliver a bunch of peculiar one-liners, you'll still chuckle at some of his delivered absurdities. It's not the best or most original comedy to be found in the series, but it's entertaining stuff all the same. Unfortunately, like its predecessors, Beautiful Katamari is over all too quickly. You can bust through all the game's stages in just a few hours, though odds are that you won't get anywhere near the biggest katamaris you could within that time span, meaning you'll want to go back and play each stage again and again, especially now that there are online leaderboards to glance at to see how you stack up against the world. There are also hidden items to be found, like cousins of the prince who you can play as, and clothing items to dress your prince in. Of course, you might also be inspired to go and get all of the game's achievements, though they aren't terribly exciting by any means. There are also multiplayer modes, both versus and co-op. The co-op mode is offline only, and is the same exact one from We Love Katamari on the PlayStation 2. You and your friend both control the same katamari at the same time, with one player controlling the left side, and the other the right. It's a slightly awkward mode, since you'll basically have to yell at your friend to get them to steer where you want them to, but it can be quite fun when you and your buddy are in a good rhythm. Versus mode is the only mode that can be played both online and offline, and it, too, is quite familiar. The king tasks you with rolling up the most of a very specific item, and then you're plopped down in a relatively small version of one of the main game environments. It's not a bad mode, especially since you can attack your opponent and knock some of their items off. But you can't help but wish for something a bit less restrictive. A versus mode version of the standard game would be awesome, and with the jump to the Xbox 360 technology, you'd think the game could handle the scaling issues that might stem from such a mode. Then again, Beautiful Katamari doesn't look much like an Xbox 360 game. If anything, it looks like the PS2 game engine upscaled to the brink of exploding. Granted, the Katamari games have never been graphical powerhouses in the traditional sense--instead, it's always been more about the weird, angular art style and crazy sense of scale as you grow ever larger. All of those things are certainly intact here, but we hoped for visuals that represented some kind of significant advance over those in previous games. The world and things that dwell within it just look kind of fuzzy up close, and while there are plenty of colorful backdrops and square-shaped people, again, all of it seems ripped right out of the PS2 games. Even the same flawed camera from the old PS2 games hasn't seen much improvement. In tight spaces, you tend to get hung up on objects you can't see, and walls will sometimes obscure your view entirely. There's an x-ray vision mode of sorts that pops up in some situations and lets you see through the walls, but it's inconsistently effective. The King of All Cosmos would like to take this opportunity to remind you that he is 120% loco en la cabeza. At least the audio is still pretty awesome. Once again, Beautiful Katamari delivers one of the quirkiest and most oddly listenable soundtracks in gaming. It's the same sort of mix of J-pop, techno-infused jazz, and ambient electro that the earlier games employed (and, in fact, it does reuse a couple of songs from earlier games), and it still fits the oddball vibe of the game perfectly. Sound effects seem largely untouched from the PS2 games, and the king still speaks in nothing but record scratches, but what's there is still highly amusing stuff. Some players will undoubtedly be disappointed by Beautiful Katamari's lack of forward progress. After all, for a series that was founded on such an out-of-left-field and highly original concept, it hasn't made much headway over the last few years, instead turning in sequel after sequel that follows the same precise formula of the original Katamari Damacy. But even for all its sidestepping, Beautiful Katamari is undeniably charming and remains entertaining. It's familiar yet still feels fresh and fun, primarily because there just isn't much else out there like this game. Whether you're a longtime fan of the franchise or a newcomer to the wonderfully weird world of Katamari, Beautiful Katamari is worth a look."}