{"ref": "https://www.gamespot.com/reviews/marvel-vs-capcom-2-review/1900-6227712/", "date": "September 22, 2009", "game_name": "Marvel vs. Capcom 2", "text": "Marvel vs. Capcom 2 has certainly done the rounds. After debuting at the arcade in the year 2000, it went on to find a home on the original Xbox, Dreamcast, and PlayStation 2. Now almost a decade old, the venerable 2D fighter has been brought kicking and screaming into the present with rereleases on Xbox Live Arcade and Sony's PlayStation Network. And while it appears Capcom and developer Backbone Entertainment are aiming to rekindling the feelings of nostalgia associated with pumping fistfuls of dollars into arcade machines by putting it on a current-gen system and adding online play, the transition hasn't been without its hiccups. Spidey is in his element wrapping up foes with his webs. Like its cousins in the Street Fighter series of games, MVC2 takes the tried-and-true formula of pitting players against each other in head-to-head combat on a 2D plane and then flips the concept sideways by offering a team of three selectable characters in place of a single bruiser. The game's expansive 56-player roster includes characters from the X-Men, Avengers, Spider-Man, Street Fighter, Darkstalkers, and Mega Man series. It also includes broader Marvel and Capcom universes, as well as a handful of original personalities. Unlike previous versions of the game that required you to earn points and spend them at the in-game store to unlock additional characters, arenas, and costumes, everything is available here straight out of the blocks. The game is divided into two parts: single-player and multiplayer battles. Single-player includes mainstay fighter modes: Arcade, Training, and Score Attack. Arcade gives you an infinite number of continues to complete the game's seven rounds (in one of four difficulties) before facing off with final boss, Abyss. Score Attack works similarly to Arcade mode but grants you only a single credit with which to finish the game. Training gives you the chance to put together a team and give them a dry run against three opponents of your choosing. There's no tutorial here to help improve your skills, but practice and a little trial and error will definitely help you nail the timing required to string together serious combos. You'll also be able to fiddle with your super gauge power as well as toggle your target dummy character's stance and guard settings. Though Training appears fairly basic in terms of customisability, regardless of whether you're a returning MVC2 veteran or first timer looking to scope out the options, it is a great place to come to terms with the various abilities, and combat rules before you test your mettle. Undoubtedly, the biggest new addition in this version of MVC2 is the inclusion of online play. Multiplayer supports both offline two-player battles and online ranked and player matches. Player matches allow you to have lobbies with up to six players, and you're cycled in and out of play as matches begin and end. A Spectator mode follows the players during character selection and into the match, which means you can cheer on your friends or study rivals as you watch from the bench. Ranked matches pair you with one other player of roughly the same skill level, and while his or her gamertag is obscured until your game begins, you're able to watch the other player make character selections in real time. The lack of a ready-check system similar to the one in Street Fighter IV means you'll often sit there mashing the X button to start a game without being given any indication of whether it is working or showing the other player's ready status. Marvel vs. Capcom 2s super attacks are just as over-the-top as ever with three team players on screen at once. As with any online game, ping is king, and when matched with another player with a decent connection you'll receive a solid fighting experience. Poor connection games can become an exercise in frustration as players warp around the screen, and you're left to watch as combos are executed against you. While the PSN version doesnt appear to suffer as readily from the player disconnection issues plaguing the Xbox 360 release, we did find that searching for custom matches was prone to locking up the system, necessitating a complete console restart. Like the Xbox 360 version, search options for custom games are quite basic and only allow you to filter games by voice chat and number of players. You control Marvel vs. Capcom 2 using a slightly modified six-button setup, and in place of heavy punches and kicks, you'll find two assist buttons. While you'll only actively control one character onscreen at a time, these buttons allow you to have one of your sidelined buddies jump in and perform supporting projectile, antiair, dash, and capture moves. Resting characters as they take damage becomes crucial to survival and allows you to recharge a chunk of their health bar by keeping them out of combat for a period of time. Basic, light, and heavy button spam with the odd assist is enough to be competitive against other first-time players, but MVC2's robust combo, counterattack, and snapback system--which when a special hit is successfully landed knocks the selected character out of the ring depending on which assist button you use--allows players to determine the tempo of a match. The accessibility of the game's controls means that even novice brawlers can be up and unleashing multihit combos in a short period of time. MVC2's ludicrous, screen-filling super attacks are as simple to perform as tapping both assists simultaneously once you have enough energy, though stringing them together as part of larger combos will deal the most damage. The lack of double-quarter circle moves for super attacks means this game is perfectly serviceable when played on a gamepad, and the PlayStation 3s DualShock D pad is considerably better than that of its Xbox 360 counterpart. Arcade sticks are also supported. Unlike Backbone's other revival project, Street Fighter II Turbo HD Remix, Marvel vs. Capcom 2 hasn't received the HD treatment and offers only a handful of visual settings. The game features widescreen support for modern televisions and stretches to fill the frame without distorting, though on a few occasions, overlays stop short and leave blank space at the edges of the screen. The 3D environments from the original game make a triumphant return and have come up a treat. The contrast of these animated backdrops against the sprites of the original 2D character models can be a little jarring to begin with, but you won't even notice them once the fists start flying. Two new character detail settings--crisp and smooth--are available and do a good job of scaling up image quality. Traditionalists certainly haven't been left out in the cold here, and should you wish to use it, the game supports a 4:3 aspect ratio and classic character models complete with the original sprites. Like the original version of the game, the frame rate remains sold during play, but where the Xbox 360 version experienced slowdown during intense super combos and character-selection, the PlayStation 3 doesnt appear to suffer the same fate. Attacking with your assist characters is just as important as resting them when they take damage. The game's audio sticks closely to the original arcade and console source material. It also includes the annoying announcer and out-of-place jazzy lounge soundtrack. Though we find them delightfully cheesy, if they're not to your tastes, you'll be able to mute them from within the audio settings. This may save your sanity as you hear the same short, looping ~take you for a ride~ sample during character selection each and every time. At $14.99, Marvel vs. Capcom 2 represents good value for those who missed out on playing the game the first time around or those who want to play it again without dusting off an old console. Though it's a little rough around the edges in the implementation of its biggest new feature, online play, 2D fighter fans will find that Marvel vs. Capcom 2 is well worth adding, or re-adding, to their collection."}