{"ref": "https://www.gamespot.com/reviews/final-fantasy-crystal-chronicles-my-life-as-a-king/1900-6191059/", "date": "May 15, 2008", "game_name": "Final Fantasy Crystal Chronicles: My Life as a King", "text": "As the boy-king of a burgeoning young kingdom, you've got your hands full. Your beloved papa is missing and presumed dead, the cackling dark lord is on the loose, and a penguin keeps following you around while tossing barbed insults in your general direction. There is an upside, though. For one, you can use a magic power called Architek to summon buildings (and their residents) onto your town's empty lots, which helps increase your sparse population. For another, you don't need to personally bother with the local monster population; instead, you just hire adventurers to do the dirty deeds for you. This sounds like a solid setup for Square Enix's sunny strategy romp, Final Fantasy Crystal Chronicles: My Life as a King. But while its title might be imposing, the gameplay is shallow, repetitive, and fundamentally unbalanced. Furthermore, if you want to get the most out of this $15 WiiWare download, you need to spend even more money. Want a new outfit for the king? It'll cost you $1. Want a new house to supplement the paltry selection of abodes included with the standard download? It's another $3. Getting the most out of this thin game requires spending twice the asking amount, and that's a bona fide rip-off. Your adventurers are eager to get to the dungeon. You can't blame them, since they have more fun than you ever will. Of course, even the player-named king knows that nothing in life is truly free. To build homes and produce a population, you need crystal, and to get it, you have to hire adventurers and send them into the local dungeons, where deposits of the stuff are guarded by ferocious monsters. At least, the game tells us they're ferocious; you'll never see one for yourself. In any case, you start off each day by posting a couple of behests to the town bulletin boards, and the adventurers you've hired all gather there. You can then send them off on assignment, ask them to go gain some experience, or even appoint them to a new job, such as a black mage or a thief. Once they've got their mission, your hirelings gather supplies from the local shop and traipse toward their destination. While your adventurers are out, you can gallivant about the town using your kingly avatar. Assuming you have enough crystal and haven't surpassed the building limit, you can create additional structures. To do so, you run to an empty plot and wave the Wii Remote, which summons Chime, your perky and pretty adviser. Then you choose a building from the menu, and poof! Your glowing vacant lot is now a house, or a bakery, or an emporium. As with most city-building games, it's enjoyable to watch your unoccupied land turn into a bustling village, and you'll look forward to unlocking new possibilities. When you aren't building, you can visit each shop you've built to purchase upgrades so your adventurers can buy new equipment, abilities, or items; you can hire new adventurers; or, most commonly, you can run around looking for citizens so you can increase their morale. Once morale is high enough, you use it to upgrade your town's official status (from city to kingdom, for example), temporarily boost your explorers' stats, or boost household relationships, which helps your hired hands recover from battle faster. All of this makes it seem like there's a lot to do, but playing My Life as a King quickly boils down to the same rote tasks every day: Review the prior day's activities, choose your behests, visit the bulletin boards and send off your adventurers, and then run around town to click on citizens for morale boosts and to purchase an upgrade or two. When your adventurers return, you grab as much morale from them as you can before Chime pops up and sends you to bed. While there is a seeming wealth of information to peruse in the downtime, it's all window dressing, and any sense of depth you might discern from it is a complete masquerade. The kingdom's limited lots lock you in virtual handcuffs, so while there is some freedom in how you develop your travelers, My Life as a King isn't strategic at all. The limitations pile on, one after another. Fans of city builders will deplore the lack of real options: There are very few structures at your disposal, and you can have only a limited number of each. You can't tell your adventurers how to spend their money. You can't fire them in favor of new candidates. You can't even adjust your tax rates. Furthermore, these limitations lead to severe imbalances. When an adventurer completes a behest, you can assign a medal that increases his or her stats. However, this creates an odd catch-22, because your more powerful adventurers are the ones to successfully complete your behests. As a result, you'll assign medals to the same fighters over and over, while the ones most in need of a boost return defeated. You can work around this by benching the most powerful adventurers in favor of the ones needing a helping hand, but doing so increases the amount of time you spend dealing with the tedium of everyday city-meandering. In addition, when there are multiple behests available to your adventurers, you can't choose which adventurer takes which behest, so you may end up wasting high-level helpers on low-level tasks. The missing depth and breadth would be easier to stomach if the gameplay itself were more engaging. Admittedly, the upcoming increase to your house-building cap can push you to finish off another boss, but it's the same four houses anyway, unless you decide to purchase downloadable content. And there's the rub: If you want a diverse population that includes every race from the Crystal Chronicles universe, you have to pony up the dough. $15 doesn't seem like a lot for a game that could take you 9 or 10 hours to finish, but much of that time is useless padding spent clicking on random townspeople for morale (and to give you something to do). To charge $3 just to add a different house to the tiny existing selection is outrageous, especially if you buy the content after you've played the game for a few hours. If you've already reached your adventurer cap, the Yukes you produce by building Yuke shacks can't be sent to dungeons in the current game, which means you'll need to start another city from scratch to get the most out of them. If you want a little variety, something the basic package doesn't offer on its own, expect to spend twice the asking price. Even then, don't expect a lot of bang for your buck--unless you consider a new outfit for Chime to be worth that buck. The Lilty hut you see forming here isn't included with your purchase. The Crystal Chronicles visual charm flourishes in every corner of My Life as a King, from its simple but sweet character designs to the way adventurers will occasionally trip and fall as they run. Building a structure results in a beautiful flurry of particles and other clever effects, though it unfortunately causes a bit of slowdown as well. Characters, including your own, move with speed and grace, and the buildings themselves shimmer with color and vibrancy. The chirpy soundtrack is cute, but it gets annoying after a short while, since the same jaunty tune repeats ad nauseam. If you hit the mute button, you won't miss much, since the rest of the sound design is pleasant but unimportant. My Life as a King is a disappointing use of two name brands associated with quality games. It's shallow, limiting, and padded with unrewarding gameplay. It's also a blatant grab at our wallets--not because downloadable content is available at launch, but because that content is essentially required if you want any variety in a shallow game that begs for it. This cheery game is a nice length and has some superficial appeal, but your valuable money is better spent elsewhere."}