{"ref": "https://www.gamespot.com/reviews/major-league-baseball-2k8-review/1900-6187574/", "date": "March 11, 2008", "game_name": "Major League Baseball 2K8", "text": "2K Sports deserves credit for trying to deliver more than a roster update with MLB 2K8. There's a new pitching mechanic, fielding has been revamped, and you can now put together your own team using in-game baseball cards. There are also new bugs and poor design choices that come with every new feature, making MLB 2K8 as frustrating as it is enjoyable. The new pitching mechanic is flawed, but it's a step in the right direction. The most notable change to how 2K8 plays when compared to 2K7 is the new pitching mechanic. To throw a pitch, you pull the right analog stick in the direction shown in the pitch's diagram and then wait for the expanding ring to flash. This determines the effectiveness of the pitch. Then you release the stick when the ring has contracted into the release zone to throw the pitch. For example, to throw a curveball, you would move the stick diagonally to the lower left and then make a counterclockwise motion. If you time it all right, the pitch goes where you want it to, but if you're just a bit off, the ball will end up several inches from its intended target--a big problem if you're trying to paint the corners. Certainly, pitchers miss their spots in real life, but very seldom are they punished like in 2K8. If you're really off with your timing or stick movement, you'll throw a meatball, and if you throw a meatball, chances are pretty good that you're giving up a home run. The problem is that the game is extremely demanding when it comes to throwing a pitch properly, but how it determines what is and isn't a good pitch doesn't seem to be as precise. Sometimes you'll see the red flash that indicates you're getting ready to throw a meatball before you've completed the first gesture; at other times, the game will think you're throwing one pitch when you're trying to throw another. This is extremely frustrating and will likely cause you to switch to the traditional button-pressing method of pitching if you care at all about winning close games. Pitching is just one of several mechanics that utilize the right analog stick. Once again, hitting is mapped to the right stick, though you can swing via buttons if you prefer. To swing, you pull the right stick back when the pitcher is getting ready to release the ball and then push forward to swing. The game manual says you release the stick after pulling it back to perform a contact swing, but this doesn't actually do anything. Although it may not work as described in the manual, this method of hitting generally works well. It certainly works better than last year, though it's still extremely difficult to judge a pitch's location and still have time to swing. Fielding also eschews buttons for the right analog stick. You move your fielder with the left analog stick, and to throw the ball, you push the right analog stick in the direction of your desired base. As soon as you move the stick, a meter begins to fill. When it's filled to the center section, you release the stick and the player makes the throw. If you move the stick to the wrong spot or you release too late or early, you'll unleash an errant throw and either pull your man off base or the ball will go right past the base. For the most part, this new method works well, and it makes routine throws a little less routine, which in turn keeps them interesting. That's not to say fielding doesn't have its problems--because it has plenty. Players will fail to even attempt to pick up slow-rolling ground balls at least once a game, and they'll stay down on the ground as if they've been shot for what feels like an eternity if they miss a diving catch. Outfielders really have it rough. You have to call one of them off if they're anywhere near one another or they'll knock each other down, and they'll get in each other's way if they're both trying to pick up a ball in the outfield. While they make like Willie Mays on balls hit over their heads, they have a tough time getting to any ball hit in front of them. The trend of new ideas that is almost really cool but has a fatal flaw continues with 2K8's 2K cards: in-game baseball cards you can earn by performing certain feats with specific players. For example: To unlock Randy Johnson, you need to strike out eight batters in a game; to earn David Ortiz, you must hit two homers in a game; and to unlock Derrek Lee, you need to get three hits in a single game. The cards aren't just for collecting; you can put a team together and then take that team online to play other users' card teams. There's quite a bit of strategy involved when putting together a team because each card has a monetary value assigned to it that counts against your team's $150 million cap. There are three different types of cards: black, gold, and platinum. Each player has one of each type, with the difference being that a black card counts the most against the cap and platinum the least. The higher the difficulty you play, the better your odds are of earning a gold or platinum card. Collecting cards is time-consuming but fun. This is a really neat feature that's held back by a number of problems. For starters, it's incredibly time-consuming to put together a team because most of the feats required to unlock a player are rather difficult. You can't unlock player cards using a custom difficulty setting either. You can purchase packs, but they cost 500 credits, and the only way to earn credits is to sell cards you've already unlocked. These typically go for five to 20 credits apiece, so you're looking at playing quite a few games to earn enough just to buy one pack because you'll probably only unlock two to five cards a game. The game promises a legend player in every pack, but we won or purchased seven or eight new packs and never received one. You can unlock wild cards by hitting home runs, stealing bases, and striking out players, but unless you're playing on the punishing harder difficulties, you're not likely to earn very many; thus, you're not likely to earn any gold or platinum cards. When you play online with your card team, the game randomly selects both teams' starting pitcher, thereby encouraging you to put together a proper five-man rotation, but as soon as the game starts, you can put in any starting pitcher you like, thereby negating the random selection process. That doesn't really matter though, because you're not likely to play online. It lags so much that it's nearly unplayable, and it's definitely not fun. 2K Sports is onto something with this card feature, but it needs another year in the minors before it's user-friendly enough for the show. MLB 2K8 includes a robust franchise mode that on the surface appears to give hardcore stat geeks everything they'd want. Most notable is how much control you have over your entire franchise's farm system from AAA to A. You can call up or demote players, manage the rosters of each squad, and carefully monitor every player in your organization. The menus are clean, and thanks to the excellent player finder that can pick out players by first or last name, position, handedness, age, experience, salary, or rating, it's a breeze to locate any player in a matter of seconds. It's one of the most user-friendly franchise modes in any sports game. Signature styles for pitchers and hitters are one of the game's best features. It's too bad, then, that the franchise mode has so many annoyances that will frustrate the same audience to which it's trying to appeal. You might as well not even play as the Padres; every time you promote or demote a starting pitcher, the game changes his position to long reliever, and there doesn't appear to be any way to change it back in franchise mode. The Padres don't have a monopoly on glitches though. We also experienced weird statistics in the minors--rotations that would reset for no apparent reason. On two occasions, we were unable to play past a certain date on the schedule and had to start all over. The trend of glitches and technical problems carries right over to the game's presentation. There is some good, though. There are more signature styles than ever--most of the hitters have the same stance and swing in the game as they do in real life. And for the most part, pitchers' deliveries seem to be spot-on. This gives the game a lot of character, highlighting the difference between one player and another. The ballparks look about the same as last year, which is not a problem because they're generally dead-on with the real thing. There are quite a few spring training and minor league stadiums as well. Now, for the bad. The frame rate is downright pitiful once the ball is put into play. It can get so choppy that it's difficult to field and throw the ball. It also makes any camera transitions terrible--the game will pause and stutter, often leaving player shadows on the ground after the player has vanished. Don't even bother with the postgame highlights; they're typically so jittery that they're unwatchable. We thought turning off the ticker that runs across the bottom of the screen might help, but turning it off in the menu doesn't actually get rid of it. PlayStation 3 owners get the worst of the lousy frame rate, but Xbox 360 owners don't get much better. But wait, there's more. Players don't have to be tagged with the ball to be called out; they just have to come into contact with the fielder. At least you assume the player is coming into contact with the fielder because the clipping is so bad they actually pass right through one another. The game has a difficult time transitioning from one animation to another, which often results in players making late, acrobatic throws on routine plays. Sometimes the game just gets confused, and fielders will hold on to the ball while runners run the bases. Or the artificial intelligence won't recognize a play is over and will stand there for seven or eight seconds before finally waking up to move on to the next batter. It shouldn't come as any surprise that MLB 2K8's audio suffers from the same sort of technical issues as the rest of the game. Jon Miller and Joe Morgan generally do a competent job calling the action, but it doesn't sound like they recorded any new dialogue. They seem to offer less insight into the proceedings than last year and have a propensity for making the incorrect call or calling out two entirely different plays during the same play. Jon will say a ball goes through for a base hit and then follow that up by saying the fielder scooped it up for a routine play. One nice feature, or one that should have been nice, is you can assign walk-up music using your own music--it's too bad that doing so frequently causes the game to lock up. The poor frame rate makes fielding difficult. Despite a bevy of technical problems, those of you who are just looking to play a few games and aren't worried about playing a franchise or trying to win close games on a higher difficulty will probably be reasonably pleased with MLB 2K8. With new pitching, hitting, and fielding mechanics, as well as new player cards, there's a lot to like if you're the forgiving type. However, if you're someone who relishes the finer points of the game, you'll walk away in disgust after just a few games. MLB 2K8 is a fine example of how exclusive sports licenses hurt the average consumer. PlayStation 3 owners at least have the option of MLB 08, but if you're an Xbox 360 owner and looking for a baseball game, it's either MLB 2K8 or the highway. And that's just not right. MLB 2K8 includes a robust franchise mode that on the surface appears to give hardcore stat geeks everything they'd want. Most notable is how much control you have over your entire franchise's farm system from AAA to A. You can call up or demote players, manage the rosters of each squad, and carefully monitor every player in your organization. The menus are clean, and thanks to the excellent player finder that can pick out players by first or last name, position, handedness, age, experience, salary, or rating, it's a breeze to locate any player in a matter of seconds. It's one of the most user-friendly franchise modes in any sports game. Signature styles for pitchers and hitters are one of the game's best features. It's too bad, then, that the franchise mode has so many annoyances that will frustrate the same audience to which it's trying to appeal. You might as well not even play as the Padres; every time you promote or demote a starting pitcher, the game changes his position to long reliever, and there doesn't appear to be any way to change it back in franchise mode. The Padres don't have a monopoly on glitches though. We also experienced weird statistics in the minors--rotations that would reset for no apparent reason. On two occasions, we were unable to play past a certain date on the schedule and had to start all over. The trend of glitches and technical problems carries right over to the game's presentation. There is some good, though. There are more signature styles than ever--most of the hitters have the same stance and swing in the game as they do in real life. And for the most part, pitchers' deliveries seem to be spot-on. This gives the game a lot of character, highlighting the difference between one player and another. The ballparks look about the same as last year, which is not a problem because they're generally dead-on with the real thing. There are quite a few spring training and minor league stadiums as well. Now, for the bad. The frame rate is downright pitiful once the ball is put into play. It can get so choppy that it's difficult to field and throw the ball. It also makes any camera transitions terrible--the game will pause and stutter, often leaving player shadows on the ground after the player has vanished. Don't even bother with the postgame highlights; they're typically so jittery that they're unwatchable. We thought turning off the ticker that runs across the bottom of the screen might help, but turning it off in the menu doesn't actually get rid of it. PlayStation 3 owners get the worst of the lousy frame rate, but Xbox 360 owners don't get much better. But wait, there's more. Players don't have to be tagged with the ball to be called out; they just have to come into contact with the fielder. At least you assume the player is coming into contact with the fielder because the clipping is so bad they actually pass right through one another. The game has a difficult time transitioning from one animation to another, which often results in players making late, acrobatic throws on routine plays. Sometimes the game just gets confused, and fielders will hold on to the ball while runners run the bases. Or the artificial intelligence won't recognize a play is over and will stand there for seven or eight seconds before finally waking up to move on to the next batter. It shouldn't come as any surprise that MLB 2K8's audio suffers from the same sort of technical issues as the rest of the game. Jon Miller and Joe Morgan generally do a competent job calling the action, but it doesn't sound like they recorded any new dialogue. They seem to offer less insight into the proceedings than last year and have a propensity for making the incorrect call or calling out two entirely different plays during the same play. Jon will say a ball goes through for a base hit and then follow that up by saying the fielder scooped it up for a routine play. One nice feature, or one that should have been nice, is you can assign walk-up music using your own music--it's too bad that doing so frequently causes the game to lock up. The poor frame rate makes fielding difficult. Despite a bevy of technical problems, those of you who are just looking to play a few games and aren't worried about playing a franchise or trying to win close games on a higher difficulty will probably be reasonably pleased with MLB 2K8. With new pitching, hitting, and fielding mechanics, as well as new player cards, there's a lot to like if you're the forgiving type. However, if you're someone who relishes the finer points of the game, you'll walk away in disgust after just a few games. MLB 2K8 is a fine example of how exclusive sports licenses hurt the average consumer. PlayStation 3 owners at least have the option of MLB 08, but if you're an Xbox 360 owner and looking for a baseball game, it's either MLB 2K8 or the highway. And that's just not right."}