{"ref": "https://www.gamespot.com/reviews/mario-party-ds-review/1900-6183270/", "date": "November 21, 2007", "game_name": "Mario Party DS", "text": "To say that Mario Party DS is just a collection of competitive minigames is like saying the Louvre is just a warehouse of paintings. These quick tests of skill aren't the usual sort of generic button-mashers you'd normally find in games of this type. Nintendo and Hudson have come up with a spectacular set of ~pick up and play~ challenges for this handheld installment of the ongoing franchise. They've also crammed it full of play modes and have lavished it with the sort of cheerful polish you've come to expect from Nintendo-branded games. Best of all, the developers have made it so that you need only a single cartridge to get a party going with as many as four people. Compete in competitive minigames against the CPU or your friends. For years, the Mario Party franchise has been well-known for its minigames that anyone can pick up and play right off the bat. The Nintendo DS rendition offers the same types of games and general ease of use, only in a portable package. There are more than 70 different quick tests of skill to pick from, broken down into categories that let you battle one-on-one, in free-for-alls, in two-on-two teams, or in lopsided three-against-one situations. Some of the games use the buttons, some require that you tap or scribble on the touch screen, and a few even have you blowing or shouting into the microphone. Instructions and demonstrations are shown onscreen for every game, but they're usually not necessary since the controls typically require that you perform a few simple actions at the right time or scribble the stylus as fast as you can. More importantly, the games themselves are hilariously clever. Dodging thwomps to see who can be the last one standing, throwing food onto a conveyer belt to try to hinder your opponents that are running on it, turning the crank on a music box to lure goombas toward you like a video game version of Hungry Hungry Hipposthese are just a few of the crazy tasks you'll perform. Typically, a collection like this made for the Nintendo DS will give you 20 or 30 minigames. This one has more than 70. Remarkably, despite that lofty number, there aren't many duds. Sure, there are a couple of silly games of chance involving pressing a single button to reel in a cheep cheep or to land on a cup floating in a sea of muck. However, the majority are more engaging, such as when you have to try to take pictures of your opponents in a 3D maze or draw a crossbow line back to shoot at moving targets. The team-oriented games usually require teamwork. In one, you and your partner are carrying a loaded tray and must alternate button presses to spin the pair up a stack of books. In another, you each control one side of a racecar and have to work together to move ahead and steer around obstacles. Some of the minigames are truncated versions of popular Nintendo games. There's one that has you racing through a platform level reminiscent of Super Mario Bros. Another has you riding Jet Skis through a wet 3D course that's similar to a stage from Wave Race. In the board game mode, you complete minigames to collect coins and roam around the board gathering stars. All throughout, the presentation reflects the cheerful attitude you'd normally expect a game starring Mario to have. The menus, results screens, and story mode dialogue scenes juxtapose hand-drawn artwork with the expressive 2D character sprites of Mario, Luigi, and the rest of the gang. The rich stereophonic music will make you want to keep the volume turned up, and so will the goofy character voices, assuming you're not against Nintendo characters verbalizing their joy. While a few of the minigames are put together with flat 2D backgrounds and simple character sprites, the majority employ multilayered 2D artwork or detailed 3D settings and characters. And yes, references to past Mario games are everywhere. Goombas, koopas, and shyguys appear in numerous minigames. Boss minigames feature large versions of Piranha Pete, dry bones, and other Bowser henchmen. During the music box minigame, you'll notice that the tune the music box plays as you turn the crank is a melodic rendition of the Super Mario Bros. theme. Minigames can be selected individually or played in groups as part of a multi-event competition. You can compete to see who can win the most, who can accumulate the highest score, or who can navigate a staircase where a win moves you upward and a loss moves you downward. A fourth option serves up random pieces of a bridge for every win. The first person to collect all of the pieces and complete a bridge is the winner. Of course, a Mario Party game wouldn't be a Mario Party game without a turn-based board game mode. The one in Mario Party DS offers five different game boards and provides a random minigame at the end of each turn to dole out coins that can be used to buy items and stars. The design is easy enough to get the hang of. You roll dice to move ahead, you land on squares to collect coins, and you use items to stack the dice or lay traps for your opponents. At the end of the game, the player with the most stars gets to go on to try the boss minigame. Typically, one romp through the board game mode takes about 30 minutes to complete. Mario Party DS is best enjoyed with one, two, or three other people. However, if you want to play against the artificial intelligence, you definitely can. Be aware, though, that the AI puts up a decent, natural challenge only on the hard setting. On the easy and normal settings, the AI is a pushover, and on the expert setting you will almost never beat the AI, which has an uncanny ability to move at top speed and knows exactly where hazards are going to appear. For solo play, the cartridge also includes a story mode that organizes the five board game stages into a quest of sorts. As the story goes, Bowser has miniaturized Mario and friends using his miniaturizer rod, so now you have to pick a character and work through Bowzer's minions by beating the different game boards. Progress is saved after every turn and at the end of each board, which means you can easily take a break and resume the quest later. If you lose, you don't have to replay the boards you've already won. You do have to replay the current board, though, which is a bit of a bummer. Familiar Nintendo characters, settings, and music are everywhere. Alternatively, if you get tired of the individual minigames and the story mode, the cartridge also offers six different stand-alone puzzle games. Three of them are Mario-themed takes on Columns, Puyo Puyo, and Panel de Pon--with minor changes to protect the guilty. Of the other three, one involves rotating a cylinder to catch and match marbles, one involves grabbing pieces off of a conveyer belt to fill in a rectangular container, and the last involves rotating and matching like-colored groups of triangles in a never-ending cluster of triangles. If you've played Hexic on Xbox Live Arcade, this last one is eerily similar to that. While these stand-alone puzzle games seem out of place in a Mario Party game, they're actually nice time wasters that can easily take the place of Tetris DS or Planet Puzzle League on those long bus trips. Mario Party DS is an outright blast when played with other people, and since you need only one cartridge to enjoy everything, the odds are good that you'll be able to entice your DS-owning friends to play with you. As a solo endeavor, challenging the computer opponents does get old eventually. However, between all of the different minigames, play modes, and puzzle games, it'll be a while before you condemn the cartridge to your storage shelf."}