{"ref": "https://www.gamespot.com/reviews/blitzkrieg-2-review/1900-6141184/", "date": "December 13, 2005", "game_name": "Blitzkrieg 2", "text": "World War II has always been a favorite for Hollywood, mainly because it was a war that lends itself well to the big screen. This was a war of global scale with titanic battles, and there's something awe-inspiring about that. And you can't help but get the feeling that the designers of Blitzkrieg 2 felt the same thing, because this is a World War II real-time strategy game that focuses much more on the popular conception of the war being all about gigantic tank sweeps and epic air battles. And while it may not be historically accurate, it's still quite a bit of fun to let go and roll over a country as if it were a speed bump. Fight as the Americans, Germans, and Russians in that great tank battle known as World War II. This Blitzkrieg is quite a bit different from its predecessor, though. The original game required a lot of micromanagement in order to succeed. So much so that it almost became painful at times, because the smallest mistake could be fatal to the entire mission, forcing you to restart the battle or reload from an earlier save. This Blitzkrieg is much more forgiving, and the focus seems to be far more on fun than on realism. Of course, the sequel still models armor thickness and keeps count of each unit's ammunition, but those seem to be secondary concerns when all you have to do is lasso a group of tanks together and blast everything in your way. Once again, it's satisfying in a strange kind of way. Though it's a real-time strategy game, you won't do any kind of resource gathering or base building in Blitzkrieg 2; it's more of a light, tactical game in which you control combined arms units on the map as you attempt to crush the enemy. The game features some big levels that offer lots of variety; you'll battle from the jungles of the Pacific to the ice wastes of the Russian steppes. There are also tons of historically accurate vehicles and weapons in the game. On the normal difficulty level, you'll find yourself literally blitzing through the game's three campaigns, which let you play as the Americans, the Germans, and the Soviet Union. The campaign structure differs a bit from regular real-time strategy games in that between missions, you're presented with a strategic map and you can choose which battle to participate in next. In this way, you can chart your own campaign, as well as unlock new units for future campaigns. However, the entire ~rewrite the history of the war~ thing seems overdone. Your own victories don't seem to do much for the overall direction of the war (we won every battle in the Philippines decisively, but the Americans were still kicked off by the Japanese). The actual battles themselves aren't too accurate, from a historical point of view. For example, the Americans get tons of armor in situations when they historically didn't have any to spare. And you'd have to be pretty brain-dead not to win these battles, though your main challenge will be to try and preserve your force as much as possible, since units can earn experience over time. Still, if you get a group of tanks rolling, they can be darn near unstoppable. Meanwhile, the game's reinforcement system can generally make things easier, as you get a set number of reinforcements that you can call each battle and each campaign, and so you can use them all to maximize your chances, or use them minimally and husband them for future battles. For example, you can request more tanks, more infantry, fighter cover to take care of pesky bombers, or your own bombers to ~soften~ up a heavily defended target. It's pretty easy to get a decent-size tank force together and blow through the defenders, who aren't that smart in most cases. Often, defenders will try and attack you after you've been detected. Or, they'll huddle in trenches and wait for you to have to root them out. Again, it might not be too challenging, but it's still pretty cinematic and fun--you get the sense that your forces are darn near unstoppable. Things blow up real good in Blitzkrieg 2, and you won't need a high-end machine to appreciate it. Graphically, Blitzkrieg also keeps the 2D, sprite-based visual look of the original game, which is both old-school and sort of refreshing. The problem with 3D graphics engines is that trying to create any kind of destructible environment results in huge frame rate problems. That's not an issue in Blitzkrieg 2--you can pretty much blow up everything (or have tanks just knock over entire forests), and the frame rate doesn't hitch up. And though it doesn't look as cutting-edge as other games, it still looks pretty good. There's something to be said for the older, 2D look in this day and age, which looks more like a painting and less like a collection of polygons. And the good news is that it runs fairly well even on older, slower systems, which are the types of systems that wargame fans tend to have. The sound effects, meanwhile, are adequate, though the music dangerously borders on corny. Blitzkrieg 2 has a good mix of historical detail and light gameplay to appeal to a wide range of strategy fans. You can always turn up the difficulty level to up the challenge, or you can enjoy the game for what it is at the default levels: a fast-paced, light strategy game that lets you steamroll other countries into submission. And there's something to be said for that. If you're wary of the many hardcore, realistic, intense World War II games out there, you might want to check out Blitzkrieg 2 for some beer-and-pretzels-style real-time strategy gaming."}