{"ref": "https://www.gamespot.com/reviews/the-legend-of-zelda-tri-force-heroes-review/1900-6416288/", "date": "October 22, 2015", "game_name": "The Legend of Zelda: Tri Force Heroes", "text": "The Legend of Zelda: Tri Force Heroes is a drastic departure from series tradition, and at times, it shows real potential, with clever design rivaling the best of the series past. But those moments are few and far between. The rest is just filler in a shallow game that tries a slew of new things, but accomplishes only a few.Tri Force Heroes is Nintendos second original Zelda title on 3DS after 2013s stellar A Link Between Worlds. This new incarnation, however, is structured as a multiplayer title with a loot system, gear crafting, and cooperative dungeons with short run times.The story opens on Hytopia, a realm wherein a witch has cursed Princess Styla with a brown, form-fitting body suit. The princess feels ugly in her new garb, and the Hytopian king puts out a call for adventurers to break the curse with a grand ballroom dress. From there, you wade through a series of puzzles and combat arenas in search of materials to break the curse.Nintendo has told farfetched Zelda tales before, but Tri Force Heroes pushes that sentiment even farther. It tells a story of fashion gurus and designer dresses, complete with eccentric personalities and fashion tips. At first, the whimsical plot was so weird, it captivated me. But as it progressed, it deteriorated, with such poorly written characters and such inexplicable plot points, I dreaded every cutscenes approach. This games final boss embraces the fashion angle so literally, it feels as if Nintendo talked itself into a corner, only to justify the grievous plot at the last second.During your travels, youll collect materials to fashion your own new outfits. This loot system provides a rewarding feedback loop at first: complete dungeons, gather materials, fashion outfits, and gain new abilities. The Kokiri Clothes let you fire three arrows at a time. The Goron costume grants the ability to swim in lava. Some outfits change the way you approach dungeons entirely, making this new approach to character perks one of the entertaining ideas present in Tri Force Heroes.But earning these bonuses becomes a chore. Tri Force Heroes doesnt present the traditional Zelda open-world structure--instead it implements what feels just like a series of challenges. A warp room in the castle brings you to the Drablands, where you solve puzzles and slay monsters in expected Zelda fashion. Yet these dungeons are repetitive. Each begins with item acquisition, and proceeds through two more rooms before the boss or wave-based skirmish rear their heads.And these dungeons are short--I finished most in under 15 minutes. This is an effort to facilitate the loot system that demands repeat playthroughs, but it has a negative effect. The puzzles--except for a few--seem too simple. You learn how to use each item. You learn their applications. And just when it seems Nintendo might delve deeper into the branching possibilities of the challenges at hand, the dungeon ends.More often than not, there's a boss at the end of each area. My favorite is a giant Stalfos skeleton that only crumbles after all three heroes use their unique items to bring it down. But this is one of a small number of clever bosses, in a game with a slew of repetitive others. The vast majority of them ask the same question: how many heroes do you need to stack on top of one another, and when should you do so?In Tri Force Heroes, puzzles center around Totems. This gameplay conceit allows players to carry one or both of their partners, and sometimes throw them in the hopes of reaching distant ledges, or attacking taller varieties of monsters. It leads to rare great moments when teams solve a puzzle not as individuals, but as a collective council with three essential members.Heroes can throw each other across gaps, only to retrieve the one left behind with a subsequent boomerang throw. Others require stacking to hit otherwise untouchable switches. And I adore the fire temple, complete with all of its disappearing platforms and hazardous machinery. It encourages teamwork more than any other area. Its one of those shining places where Tri Force Heroes capitalizes on its conceptual potential, comprising puzzles that encourage teamwork, vertical thinking, and careful motor skills.There's a taxing dichotomy between the solo and cooperative modes, and the overall experience feels fractured.But a day later, I replayed the same puzzles. Only this time, I tried them in single player. And when it comes to this mode, Tri Force Heroes stumbles. In place of fellow humans, Nintendo provides you with doppels--heroes that, when not being used, become lifeless statues. You can switch between them with the handhelds touch screen, but moving each hero to the exit means carrying the others for much of the time.By choosing to play by yourself, you invite a level of micromanagement that transforms otherwise clever dungeons into heavy slogs. The solutions to the puzzles are the same, but some bosses, and some dungeons, are exponentially harder on your own.One example: a certain early boss focuses on one hero at a time, leaving its vulnerable tail open to other human players swords. But in single-player, switching between doppels, throwing the lifeless shells onto ledges for hearts, all while avoiding nearby lava pools, is an ordeal. Theres a taxing dichotomy between the solo and cooperative modes here, and despite the few puzzles that balance the two well, the overall experience feels fractured.This rings true when returning to puzzles as well. Once youve beaten a dungeons boss, Nintendo offers challenges that alter your approach. One removes your swords, arming you only with bombs. Another hangs monsters from the ceiling, forcing your team to keep moving at a hurried pace. Another adds balloons to each room, asking you to pop them before moving to the next, all the while focusing on enemies, as well as the puzzle at hand.These twists can make multiplayer more fun, as your group adapts to the changes imposed on them. However, some of them are near impossible on your own. It widens the gap between multiplayer and single player even more.There are several barriers preventing Tri Force Heroes from being great. But through it all, one of the series' greatest traits remains strong even here: the exceptional music. Lilting flutes, snappy strings, and tense battle drums pervade every area. The music reminds me how compelling this franchise can be, and how great it often is. Nintendo has deviated from the norm with the series before--but this time, many of its changes don't work.Consider this: in single player, Nintendo grants you the option to skip entire sections of each dungeon, so long as you're fine with the prospect of less loot. I avoided this route, but considered it often. There are hints of a great game here, and when three players are cooperating in frantic battles, or working through dynamic puzzles, it shows.But like its story of fashion and surface appeal, theres not much depth here, and the facade fades with time. Tri Force Heroes offers us the means to work together, but not enough reason to do so."}