{"ref": "https://www.gamespot.com/reviews/baldurs-gate-review/1900-6110738/", "date": "October 16, 2004", "game_name": "Baldur's Gate", "text": "The PC's Baldur's Gate and its sequels have undeniably made a tremendous impact on the world of role-playing gaming. From its nimble use of AD&D rule sets for combat to its well-written (and often amusing) non-player character dialogue, the Baldur's Gate series set the bar for future entries in the genre. To bring the franchise to mobile, Sorrent has shrunk Bioware's magnum opus to a remarkable 70 KB, making it an easy download on a variety of consumer-grade handsets. Although the game is much more linear and episodic than its predecessors, only allowing you to play as a ~lawfully good~ character through a series of levels, it retains much of the BG spirit and manages to incorporate a simplified take on the AD&D version 3.5 rule set to govern combat and character development. While the game isn't well balanced for all five of its included character classes, and it suffers from some repetitive level design, it's still an extremely enjoyable and competent take on one of the best RPGs of all time. Sorrent has provided us with a very action-oriented take on Baldur's Gate. Sorrent's Baldur's Gate is set firmly within the Forgotten Realms continuum, and its largely peripheral intrigue will only be interesting to fans of the FR universe. The venomous Vorn is apparently in collusion with the notorious Dragon Cult, who is conspiring to start a world war of apocalyptic proportions, pitting the Faernians (hailing, as you may have guessed, from Faern, the land where most Forgotten Realms games are set) against the Mulhorandi, a culture that, in ancient times, fell to decadence and decay, and is only just regaining power. The Mulhorandi once served the Imaskari Empire, a cruel race of wizards, and this has greatly impacted the Mulhorandi culture and temperament. Needless to say, a clash between these two worlds would be catastrophic, and the Dragon Cult must not be allowed to go unchecked. Of course, as the hero, the onus is upon you to single-handedly depose Vorn, if indeed he really is the mastermind behind the Dragon Cult's malevolent movements. To begin, you must choose a race and character class from several available options. There is little cosmetic difference between these groups; your caped crusader will just sport a different color palette, depending on your decision. These options have a big impact on gameplay, however, as your character class will determine how you fight, and particular races fare better in certain roles. For example, a half-orc would make a successful barbarian, as that race is naturally buff and brutish. Similarly, a half-elf would make a good sorcerer, as their intelligence and wisdom statistics are naturally higher (there is no charisma stat, which normally governs a sorcerer's ability, in this version of Baldur's Gate). Humans are the most versatile and are suitable for any role. Depending on your character class, you'll start the game with a certain base set of armament, which will be suitable for your particular proclivities. This is all very standard for the genre, and it adds a welcome degree of replayability to the mobile Baldur's Gate, which will take players six to eight hours to complete in full. BG's combat is twofold--all characters have some degree of melee skill as well as class-specific abilities, which take several forms. Some of these are passive skills, which are always in use, and therefore represent permanent enhancements for your character. The Rogue's improved ranged attack, for example, gives him superior archery skills and it doesn't need to be individually activated. Other abilities, such as the Paladin's various auras and curative spells, must be individually selected and activated. Unfortunately, projectile attacks, which are ordinarily used to great effect by the Sorcerer class, haven't been particularly well-implemented. As your screen real estate is so severely limited, it's hard to get an opponent in-frame, so he can be targeted, but still be far enough away for your projectile attacks to ward him off. The game is structured such that it'll basically be impossible to avoid having your Sorcerer drawn into close combat. Ordinarily, a Sorcerer is a difficult class to play initially, but eventually they can surpass the Fighters and Paladins of the world. Not so in Sorrent's Baldur's Gate, where the Sorcerer class should be treated as a ~hard~ difficulty option. The main portion of the game is a straight dungeon crawl. Nineteen varieties of foe, many of which look identical to friendly NPC characters, will come lumbering toward you with pernicious purpose. You can target them, ~scan~ them for immunities and alignment (evil or good), and attack them with a spell or a weapon. As for this latter tool, Baldur's Gate packs your standard complement of maces, morning stars, battle-axes, daggers, and swords of all kinds. Along with your armor and optional shield, these other weapons vary in strength and are sometimes imbued with special abilities, such as a higher chance of achieving a critical hit against an enemy that is not immune to criticals. Equipment can be found in chests, discovered, cached within the mangled corpses of those slain, or bought from itinerant merchants who are invariably happy to serve you, no matter how deep you venture into enemy territory. Working toward purchasing new toys is always a major goal in RPGs, and players are willing to endure more than a few side quests for this. Similarly, the mobile Baldur's Gate will monetarily reward you for performing these optional acts of heroism, and it's nice to be able to purchase a weapon as compensation for your efforts. Aside from a few little distractions, you won't be given a chance to stray from your main quest, the goals of which must be systematically completed if you want to advance to new areas. Unlike previous Baldur's Gate games, which stressed exploration as a core gameplay element, Sorrent's game is broken into levels. As a result, the game feels a little more action-oriented and slightly less immersive than its predecessors. Complete with stat-building, NPC interaction, and a fantasy setting, the mobile Baldur's Gate has all the trappings of a PC RPG, but lacks the freedom that previously defined the series as well as the best titles in the genre. The game is so ambitious in other areas, though, that it won't do to overly criticize it for this shortcoming. It's tough to squeeze enough content into a mainstream mobile title to allow players to--literally and figuratively--lose themselves for several hours. Baldur's Gate does just that; although, getting lost can be as much a product of repetitive level design as it is the result of the game's expansive environments. The Paladin class supplements its fighting skills with aura spells. Baldur's Gate's weakest feature is undoubtedly its presentation, which is arguably true of most RPGs that do not follow Square Enix's cinematic mold. On our test VX7000, the game animated fairly smoothly but was visually unremarkable. Acquiring new items won't change your character's appearance in the least; he'll always swipe at his enemies as if he has retractable claws. Spell effects look pretty underpowered as well, and they certainly don't give one the impression that the magic they represent is particularly effective or deadly. The game's audio is also above average, but it's certainly not a highlight. You've got some intro/exit music and some little ditties that play as you inflict or receive damage. For the most part, though, your primary auditory accompaniment will be the shrill beeps of your phone's keypad. What Baldur's Gate lacks in refinement it makes up for in depth. Sorrent has made a legitimate effort to port a hardcore RPG to mobile, thereby marketing it to an audience that is, most often, quite a bit less than hardcore. Baldur's Gate doesn't pull punches, and it makes clear overtures to fans of the series, occasionally referencing Faernian lore. This game will be immediately recognized and accepted by mobile-toting Forgotten Realms fans, and it is more than a worthy homage to Bioware's seminal franchise. While it's a little rough around the edges, Sorrent's Baldur's Gate is a very good game that proves that mobile can cater to more than just a casual audience."}