{"ref": "https://www.gamespot.com/reviews/the-king-of-fighters-xv-review-wanna-play-some-kof/1900-6417830/", "date": "February 16, 2022", "game_name": "The King of Fighters XV", "text": "Few fighting game series can claim to have the sort of cross-generational impact and enduring history that King of Fighters does, but in recent years, developer SNK has struggled to stay on equal footing with its competitors. With 2016's The King of Fighters XIV suffering from dated-looking visuals and wonky online matchmaking that even the most polished gameplay would struggle to overcome, the new generation of KoF stumbled out of the gate, turning off the new blood it wanted to bring in and leaving many series stalwarts somewhat dissatisfied. Sometimes you learn by taking hard knocks, though, and SNK has clearly taken KoF XIV's reception to heart, giving its newest title a pleasing visual revamp, tidying up the gameplay, tossing in some extras, and making the online combat better than it's ever been before. Though it won't mop the floor with its opponents, it's enough to make KoF XV a serious contender again.The King of Fighters series' claim to fame is that it introduced the concept of a team-based fighting game. Instead of a single character, in KoF you create a team of three fighters to go up against your opponent's squad. But unlike other well-known 3-on-3 games, like Marvel vs Capcom 2 and 3 and Dragon Ball FighterZ, there's no tag element. Once a character is in the arena, they aren't leaving until they're knocked out. This makes team construction a crucial part of strategy: The characters you place as point, center, and anchor can drastically affect the flow of a match.Another big part of KoF is its movement. While not quite as freeform as games like Guilty Gear, KoF still offers a lot of mobility options, like briefly-invincible dodge-rolls and quick-hop jumps, that give it a distinct feel and push the gameplay in a more offense-oriented direction. Accompanying these movement options are an array of normal and special moves unique to each character, along with cast-wide tools like a guard cancel dodge/counterattack, blowback attacks, the power-boosting MAX Mode, and a newly introduced ~Shatter Strike,~ a unique combination defensive/offensive counterattack that can also be used as a combo starter. Controls are smooth and fluid, and learning how movement and attacks flow into each other is a fun and rewarding part of fighting.But perhaps KoF's biggest appeal is its large roster of slickly designed and immediately memorable characters. King of Fighters XV doesn't have the biggest playable roster in the series, but it's still pretty packed, with 39 new and returning cast members out of the box. Every character has a unique look and playstyle that makes them stand out, such as the easy-to-grasp gameplay and rough charms of Fatal Fury veteran and recent Smash Bros. guest Terry Bogard, the sultry suplexes and fast-moving grappling attacks of the long-absent Shermie, and the special-move strings and aerial attacks of new main rival character Isla. Even if your favorite didn't make the roster, there are still plenty of new and old characters to spend time learning and building teams around.SNK has also included a fair few modes and extras in KoFXV to accompany its sizable cast. Story mode is a single-player arcade-style mode where you pick one of 13 pre-set teams (or make your own) to progress through a series of CPU opponents while watching cutscenes and exposition in between matches. The CPU AI is somewhat puzzling--it input-reads and can pull off superhuman reactions but also falls victim to some very simple patterns, which can make solo play a bit frustrating. However, the cutscenes and endings have a surprising amount of effort put into them--the endings, though they consist primarily of still images and text, are quite lengthy and feel like a good reward for your effort. Longtime KoF and SNK fans will get a kick out of certain team endings, which are packed with references and cameos and sometimes veer into very silly territory. There are also some secret endings and soundtracks in the DJ Station mode that are unlocked by using specific player-made teams. The concept is interesting, but the game deliberately obscures what character combinations are required for unlocks, leaving you to play a guessing game to get everything.Versus mode allows you to fight against another player or a CPU opponent in either standard 3-vs-3 or single-character bouts, while a new Draft VS mode prevents competitors from selecting any of the same characters as their opponent. Online modes include ranked, casual, and lobby matches, as well as match replay sharing and an online training mode to practice tech with a friend. Mission mode teaches you combos ranging from simple to advanced (without getting quite as demanding as previous KoF combo trials), and an adequate tutorial mode exists to teach you the basics of movement and attacking--though it doesn't really teach you much about using the skills in the context of an actual fight. There are some small but thoughtful extra options settings, too, like the ability to adjust contrast between the background and the characters to make the fighters easier to see against a busy backdrop.Perhaps the biggest selling point for competitive players, however, is the online rollback. Many of SNK's previous titles, like KoF XIV and Samurai Shodown, suffered from netcode that was decent at best but got very messy very quickly if anything on either player's end was suboptimal. While rollback netcode can't fix every connection issue, it goes a long way to making the online experience better and more playable for a wider audience. KoF XV runs very well online, with both neighboring-state and cross-country matches feeling smoother and more enjoyable than any new KoF has ever been on its initial release.KoFXV is undeniably a solid package, offering a lot of character variety and gameplay modes for your money. Perhaps the biggest knock against it, then, is that there isn't anything particularly new or revolutionary about the fighting itself. KoFXV's fighting mostly builds upon the base that King of Fighters XIV established, making some tweaks to how EX moves and MAX Mode work, tightening up move properties, rebalancing, and rearranging the roster a bit. The few new mechanics like Shatter Strike--at least in this very early stage of the game's life--haven't dramatically altered much about the game. Even the addition of online rollback seems less like a revolutionary step forward than SNK playing catch-up with the standards fighting game players expect. For a game whose tagline is ~shatter all expectations,~ KoF XV generally feels like it's simply meeting expectations rather than surpassing them.But most King of Fighters veterans and newbies looking for a new title to dive into probably won't care that KoF XV isn't shaking up the fighting game paradigm. It delivers fisticuffs that overflow with a unique style and personality unlike that of other fighting game series, and that's more than enough to satisfy a lot of players. The King is back, and personally, I'm glad to see SNK swinging strong yet again."}