{"ref": "https://www.gamespot.com/reviews/geon-emotions-review/1900-6179682/", "date": "September 21, 2007", "game_name": "GEON: emotions", "text": "For a game based around emotions, it's odd just how detached GEON is. Like many modern puzzle games, it tries to enhance the relatively simple gameplay at its core with bright, colorful visuals and various themes that, in theory, should have a hypnotic effect. In actuality, the emotion theme is practically pointless, so what you're left with is a mundane puzzler that lacks variety and is paced too slowly to be addictive. You may get a few hours of enjoyment out of it, but not enough to recommend spending $10 on it. GEON is like a combination of Pac-Man and soccer. You play on one side of the game grid, while your opponent plays on the flipside. You maneuver a cube around the grid, collecting dots that represent emotions. Once you collect enough dots to fill your emotion meter, you head to the edge of the board and hit X to flip it around, at which point you are on your opponent's side of the grid. Once there, you head to the goal, where you drop off all of your accumulated emotions and get sent back to your own side. The first player to deposit all of his or her dots is the winner. Here we go, loop-de-loo Diversity is added in the form of various powerballs scattered about the grid. One of them causes you to zoom across the grid, picking up a bunch of dots quickly. Another lets you do a kind of ground pound, which sends some of the dots your opponent has collected back to their starting positions. You can also combine powerballs by collecting one and then dropping it onto another one. Once activated, these combined powerballs place annoying enemy blocks on your opponent's grid that hinder movement or otherwise distract your challenger. When you begin a match, you choose an emotion to represent you, which in turn affects how effective certain powerballs are. That's all fine and dandy, but aside from that, emotions are essentially meaningless, having no other effects on the gameplay or even on how the game looks at any particular moment. You'd expect your chosen emotion to have its own idiosyncrasies, but in the end, the whole emotion business is just a tacked-on conceit that has nothing to do with, well, anything. The main saving grace are the grids themselves, some of which are cleverly designed with moving platforms, elevators, loops, and other nifty elements that mix things up a bit. Other problems crop up from time to time. While you can speed up your cube by collecting certain powerballs, movement is generally slow, which makes the act of rolling up dots pretty unexciting. The camera is also an occasional annoyance, particularly on the more complex grids. You can rotate the camera into one of four positions using the bumpers, or choose one of three zoom levels with the Y button. However, when you're searching for those last few dots, it would be helpful to be able to see the entire grid at once. Also, with so many neon-colored grid sections, some of which are layered on top of other sections and moving about, full camera control would make it easier to figure out how to get to a particular destination on the game board. The camera will also change positions on its own, which is sometimes helpful but sometimes unnecessary and changes which direction you need to push the thumbstick in the middle of collecting a line of dots. There are multiple ways of experiencing GEON. You can compete against the artificial intelligence in duel or time attack modes, play a few timed minigames, or take on up to three other players in split-screen play or on Xbox Live. But interestingly, playing with someone else doesn't make GEON any more fun than playing on your own. In the end, you can't help but feel something is missing. With the entire emotion theme wasted on simple terminology, rather than affecting the gameplay, GEON never rises above its simple premise."}