{"ref": "https://www.gamespot.com/reviews/ncaa-football-2002-review/1900-2797684/", "date": "May 17, 2006", "game_name": "NCAA Football 2002", "text": "In the very early years of the NCAA Football series, it received relatively little attention from Electronic Arts, as it was somewhat of an afterthought to its more robust NFL counterpart. Through the years, the series has slowly garnered an identity of its own. Although still quite similar to its NFL counterpart on the PlayStation 2, particularly in the graphics department, NCAA Football 2002 has continued to evolve and has captured the pageantry and tradition of the college game better than any NCAA football game before it. At first glance, NCAA Football 2002 looks almost like a carbon copy of Madden, with the pro players and stadiums being replaced by student athletes and college fields. Like Madden, the animation is ultrasmooth, and the player models sport a variety of accessories and team-specific trimmings on their jerseys. However, upon further inspection, there are some noticeable improvements in NCAA Football 2002, as opposed to last year's version of Madden. For example, the player faces aren't quite as unnatural anymore; the deadpan stare of the Madden players has been replaced by 3D facial models that show greater emotion and look more believable. The player animations have also improved, as transitions between different moves are noticeably smoother. New animations such as quarterback options and new jukes and tackles have been added in the game. The stadiums in NCAA Football 2002 seem more authentic than the stadiums in the game's NFL counterpart. Every last detail, such as the exaggerated upper-deck addition to Maryland's Byrd Stadium and the giant scoreboard in Florida State's Doak Campbell Stadium, are rendered in full 3D. Even the practice facility is ultradetailed and includes such subtle visual nuances as the team busses waiting in the parking lot and extra footballs and watercoolers lying on and around the benches. Another notable addition, inherent to the college game, is the team mascots and bands. The mascots in particular look eerily similar to their real-life counterparts, and their appearance in the game's title screen can be quite funny. Electronic Arts has done an amazing job of capturing the look of the college game, but as usual, it all comes down to the gameplay. Although generally quite good in this department, this is where NCAA Football 2002 starts to show a few chinks in its armor. The game's controls work very much like the PS2 version of Madden 2001, which means that the scheme is relatively complex and takes some acclimatization. Every button on the Dual Shock controller has a function. The shoulder buttons are assigned such functions as pitching the ball to backs, left and right jukes, and punk faking, among others--all depending on in-game situations. The face buttons are used for speed bursts, diving, tackling, and passing, among other options. Thus, it takes some time to become accustomed to the variety of control choices available at any given time, which could turn off some players at first. However, for the patient, the controls can become second nature--after some playtime with the game--and you begin to appreciate the high level of command over the gameplay available in the game. Aside from the control options themselves, some of the same problems that plagued Madden 2001 persist in NCAA Football 2002: The game's overall feel is a bit sluggish and unresponsive. The use of a momentum-based physics engine means that it takes a fraction of a second for the player to reverse his inertia and make cutbacks. For example, your running back may be going parallel to the line and you happen to notice a hole, you press the analog to direct your back toward the hole, but it takes a second for him to stop his momentum and make his move upfield. By that time, a pursing linebacker has already pounced on your running back and has thrown him down for a loss. This can be frustrating at times, as you may feel as though you don't have complete control over the players in the game. Electronic Arts chose to err on the side of realism, but this realistic physics engine keeps NCAA Football 2002 from being a truly hard-hitting, high-intensity football game.The second, readily evident problem with the gameplay in NCAA Football 2002 is that there are some money plays in the game. The out route in particular can be called on at most instances to pick up an automatic 8 yards or so. Most times, it really doesn't matter whether the defense is playing a bump-'n'-run or double teaming the outside receivers; if timed properly, the receiver will usually break away on the short out routes and can be found open near the sidelines. However, aside from a handful of money plays, the game's AI is generally quite good. Teams have specific plays that they like to run. For example, Nebraska runs its predominantly option offense, while teams like BYU air it out using a sophisticated passing game. This advanced AI translates right down to the individual players, as they are equally as adept in the department of computer intelligence. For example, quarterbacks running the option will hold onto the ball if the option-man is covered, and aggressive linebackers will pursue with reckless abandon to snuff out the ball carrier. The game has excellent AI, extensive college-specific playbooks, and the deepest control scheme of any college football game before it, but such glowing positives in the gameplay department are held back just a bit by the generally sluggish controls. Certain gameplay issues aside, as with its NFL counterpart, NCAA Football 2002 is oozing with a variety of features and gameplay options. Requisite gameplay modes such as season, dynasty, and practice are all in the game, but they're now jam-packed with stats, relevant information, and customization options. There are individual team stats for every player and cumulative team stats for all 117 I-A and 27 division I-AA squads in both the season and dynasty modes. The game's stats tracking are so complete that it even keeps track of second tier stats, such as the number of pancakes by offensive linemen and a team's turnover differential. And all of these stats can be viewed for all NCAA teams or by conference. Stats junkies can spend hours on end tracking team rankings and individual player's career numbers in this game. However, the deluge of information doesn't end there, NCAA Football 2002 keeps track of the top 25 coaches and writers polls, BCS rankings and bowl bids, and All-American and Heisman Trophy candidates, and it even names the best offensive and defensive player of the week. The amount of relevant information collected, stored, and presented in the game is truly staggering and unprecedented. Aside from the extensive stats tracking, NCAA Football 2002 also features the Campus Challenge. Here you can redeem points collected by completing specific in-game challenges--such as completing a 40-plus yard pass or running for more than 100 yards in a game--to unlock such Easter eggs as a team full of mascots, old all-American teams, and 15 all-time classic teams. Similar to Madden's own challenge mode, the Campus Challenge adds significantly to the game's value, which is already quite robust.The second, readily evident problem with the gameplay in NCAA Football 2002 is that there are some money plays in the game. The out route in particular can be called on at most instances to pick up an automatic 8 yards or so. Most times, it really doesn't matter whether the defense is playing a bump-'n'-run or double teaming the outside receivers; if timed properly, the receiver will usually break away on the short out routes and can be found open near the sidelines. However, aside from a handful of money plays, the game's AI is generally quite good. Teams have specific plays that they like to run. For example, Nebraska runs its predominantly option offense, while teams like BYU air it out using a sophisticated passing game. This advanced AI translates right down to the individual players, as they are equally as adept in the department of computer intelligence. For example, quarterbacks running the option will hold onto the ball if the option-man is covered, and aggressive linebackers will pursue with reckless abandon to snuff out the ball carrier. The game has excellent AI, extensive college-specific playbooks, and the deepest control scheme of any college football game before it, but such glowing positives in the gameplay department are held back just a bit by the generally sluggish controls. Certain gameplay issues aside, as with its NFL counterpart, NCAA Football 2002 is oozing with a variety of features and gameplay options. Requisite gameplay modes such as season, dynasty, and practice are all in the game, but they're now jam-packed with stats, relevant information, and customization options. There are individual team stats for every player and cumulative team stats for all 117 I-A and 27 division I-AA squads in both the season and dynasty modes. The game's stats tracking are so complete that it even keeps track of second tier stats, such as the number of pancakes by offensive linemen and a team's turnover differential. And all of these stats can be viewed for all NCAA teams or by conference. Stats junkies can spend hours on end tracking team rankings and individual player's career numbers in this game. However, the deluge of information doesn't end there, NCAA Football 2002 keeps track of the top 25 coaches and writers polls, BCS rankings and bowl bids, and All-American and Heisman Trophy candidates, and it even names the best offensive and defensive player of the week. The amount of relevant information collected, stored, and presented in the game is truly staggering and unprecedented. Aside from the extensive stats tracking, NCAA Football 2002 also features the Campus Challenge. Here you can redeem points collected by completing specific in-game challenges--such as completing a 40-plus yard pass or running for more than 100 yards in a game--to unlock such Easter eggs as a team full of mascots, old all-American teams, and 15 all-time classic teams. Similar to Madden's own challenge mode, the Campus Challenge adds significantly to the game's value, which is already quite robust.The ample modes and features are complemented by a sleek presentation. TV-style graphics highlight key performers and relevant stats throughout the course of the game, while an intuitive interface makes browsing the seemingly endless layers of menu items a breeze. The game's music appropriately captures the pageantry of the college game. And situation-specific sound effects, such as the player's grunts and taunts, are played perfectly in unison with the in-game action. In any given season schedule, there are both televised and nontelevised games. The announcing team of Brad Nessler, Lee Corso, and Kirk Herstreet calls all the local and nationally televised games with precision and a good deal of variety, but in the nontelevised games, the stadium's public address announcer provides limited commentary. This can seem disconcerting at first, since we're so used to announcers calling the game, but in the end, it falls into Electronic Arts' goal of creating an ultrarealistic college game, and it works out relatively well. NCAA Football 2002 is saddled with the same gameplay kinks, such as the sluggish controls and money passing plays, as its NFL counterpart. However, these problems are easily offset, as the game has plenty of positives to offer. The season and dynasty modes are packed with a variety of features and options, the stats tracking is incredibly intensive and comprehensive, the graphics are ultrarefined and unsurpassed in the level of detail, and in general the game authentically captures the institution of college football. A lot of care has been imparted in the development of the game, and it clearly shows. NCAA Football 2002 takes another step in creating its own identity, separate from the Madden series, and is able to stand on its own merits. Whether you're a dorm rat, faithful alum, or just a college football fan in general, you need to experience NCAA Football 2002 on the PlayStation 2.The ample modes and features are complemented by a sleek presentation. TV-style graphics highlight key performers and relevant stats throughout the course of the game, while an intuitive interface makes browsing the seemingly endless layers of menu items a breeze. The game's music appropriately captures the pageantry of the college game. And situation-specific sound effects, such as the player's grunts and taunts, are played perfectly in unison with the in-game action. In any given season schedule, there are both televised and nontelevised games. The announcing team of Brad Nessler, Lee Corso, and Kirk Herstreet calls all the local and nationally televised games with precision and a good deal of variety, but in the nontelevised games, the stadium's public address announcer provides limited commentary. This can seem disconcerting at first, since we're so used to announcers calling the game, but in the end, it falls into Electronic Arts' goal of creating an ultrarealistic college game, and it works out relatively well. NCAA Football 2002 is saddled with the same gameplay kinks, such as the sluggish controls and money passing plays, as its NFL counterpart. However, these problems are easily offset, as the game has plenty of positives to offer. The season and dynasty modes are packed with a variety of features and options, the stats tracking is incredibly intensive and comprehensive, the graphics are ultrarefined and unsurpassed in the level of detail, and in general the game authentically captures the institution of college football. A lot of care has been imparted in the development of the game, and it clearly shows. NCAA Football 2002 takes another step in creating its own identity, separate from the Madden series, and is able to stand on its own merits. Whether you're a dorm rat, faithful alum, or just a college football fan in general, you need to experience NCAA Football 2002 on the PlayStation 2."}