{"ref": "https://www.gamespot.com/reviews/need-for-speed-underground-2-review/1900-6126602/", "date": "May 17, 2006", "game_name": "Need for Speed: Underground 2", "text": "EA's Need for Speed series has come in several different shapes and sizes over the years. More recently, the series has taken to the late-night city streets with the import tuner-focused Need for Speed Underground games. The popular subseries now comes to the Nintendo DS with the release of Need for Speed Underground 2, a game that packs in cars, upgrades, and a decent number of different races. However, less-than-optimal control holds the whole thing back a little bit. Underground 2 delivers a good sense of speed. You'll start your street racing career by picking one of two fairly weak licensed cars. As you win races, you'll earn points, and these can either be spent on upgrades or new vehicles. New cars are unlocked as you play, so you won't be able to simply start saving up for the most expensive car right away. You'll incrementally work your way from car to car, improving your chances by buying cars with higher base ratings for speed, acceleration, and handling. You'll also unlock visual upgrades for your cars as you play, which lets you customize your car by putting on body kits, spoilers, hood scoops, rims, and so on. You can recolor your car and put plenty of vinyl stickers on it as well. These changes are purely cosmetic, but they do let you differentiate your car from the pack pretty well. There are really only two different ways to race in the game, but the standard circuit style gets broken down into a handful of variants. Sometimes you'll be racing against the clock, other times you'll face off against opponents, and occasionally you'll participate in knockout races, where the last-place driver is eliminated after every lap. ~Own the zone~ races break the circuit up into different segments, and you need to claim as many segments as possible by having the fastest time through each one. The other style of racing in Underground 2 is the drag race, which takes place on a straight track and is more focused on your shifting properly and avoiding obstacles than on your steering prowess. The drag racing is exciting, has a great sense of speed, and is probably the game's high point. You can also play with up to three other players wirelessly, which is great if you happen to have race-hungry friends in your area. A driving game is really only as good as its control. You could stack on a billion tracks and the most elaborate damage model in the world, but if the cars themselves aren't fun to drive, none of that extra stuff really matters. Given the fairly limited control options of the Nintendo DS, NFS Underground 2 takes a stand and assigns all your steering control to the D pad, rather than trying to concoct some sort of unwieldy touch-screen steering, like Ridge Racer DS did. This has its ups and downs. The standard, conventional control is easy to pick up, but the inherently coarse control of a D pad isn't as smooth as an analog-based solution would be. So you'll have to tap the D pad carefully to navigate turns, or you'll have to deal with a lot of oversteering and correction. Either way, it's something you'll get used to, although the game still doesn't control as well as any other recent entry in the Need for Speed series. Drag racing lets you focus on shifting properly instead of navigating heavy curves. Graphically, Need for Speed Underground 2 has made a trade-off. The plus side is that the game runs at a great, smooth frame rate at all times, something that's key for a fast-moving racing game. But that speed comes at the cost of graphical quality. You'll notice a great deal of pop-up as you drive, and the overall look of the tracks is pretty muddy and poorly defined. Still, the car models look quite good, and overall, the smooth frame rate and nice-looking cars make the graphics palatable. The sound in the game doesn't fare quite as well. The MIDI-style music just doesn't fit with the action, in most cases. It just sounds hokey. Stuff like engine noise and the screech of your tires sounds much better. Overall, Need for Speed Underground 2 gets the job done. There's enough variety here to keep you busy; it delivers a strong sense of speed; and the control, while not perfect, is good enough to keep you coming back. If you're a DS owner in need of a good driving game, NFS Underground 2 most definitely fits the bill."}