{"ref": "https://www.gamespot.com/reviews/real-world-golf-review/1900-6149043/", "date": "May 4, 2006", "game_name": "Real World Golf", "text": "There's a very significant level of abstraction that happens in video games that imitate real-life activities. When it comes to golf video games, even the analog swing mechanic found in the Tiger Woods PGA Tour games, while a visceral improvement over the meter-based swing mechanics that previously dominated golf video games, is still only symbolic of actually standing out on the fairway and swinging a golf club. MadCatz, a company best known for aftermarket video game console peripherals, attempts to deliver an even more authentic golfing experience with Real World Golf for the PlayStation 2 and Xbox. There's an undeniable novelty to standing in your living room and pretending you're actually playing golf, and if you're the kind of person who can't spend enough time at the driving range, Real World Golf is probably right up your alley. But if you're interested in more than just some kind of golf pantomime, Real World Golf will leave you wanting. It's hard not to feel like a marionette when playing Real World Golf. Ditching any kind of conventional controller, Real World Golf comes packed with a black box, dubbed the Gametrak, which you set on the floor in front of you. Two mesh gloves attach to a pair of ball-and-socket ports on the top of the Gametrak via thin plastic retracting cords. Wearing the gloves, you stand over the Gametrak while holding a stumpy plastic golf club, which is also included with the game, and swing through like you would when actually playing golf. The game calibrates itself by having you place your hands on your head while wearing the gloves, providing it with a rough estimate of your swing potential--so, if you want to trick the game into thinking you're some kind of mutant golf powerhouse, just hold your hands at chest level, and then presto, you're launching the ball 300 yards off the tee. Save for this obvious loophole, the Gametrak is pretty good at what it does, and it's able to pick up on certain nuances, such as how you're making contact with the imaginary ball or how you're facing the golf club. For those with real-world golf experience, it can feel really awkward holding a hollow, plastic, foot-long abbreviation of an actual golf club at first, though it's better than holding nothing at all, and it works as a visual touchstone for determining how the game thinks you are facing the in-game club. Once you get the hang of it, though, it doesn't take long to figure out how to slice and fade shots, or add a little backspin. It can, however, be difficult to produce those results with real consistency. As much subtlety as Real World Golf is able to pick up when you're out on the fairway, the illusion falls apart once you get your ball onto the putting green, where it lines up the shot perfectly for you, and all you have to do is put the appropriate amount of power behind your swing. It's a trend that isn't unusual for any golf video game, really, though it is that much more glaring when Real World Golf goes to considerable lengths to engender a sense of realism. The gimmicky gameplay is honestly curious enough in and of itself to hook you into Real World Golf. It's probably not going to improve your actual golf swing, since it's still several steps too far removed from the real thing, but it's a decent hook. Beyond the initial novelty, though, Real World Golf doesn't have much to offer. The modes of play are pedestrian and pretty shallow. You can play a regular 9- or 18-hole game on one of the fictional courses using match, stroke, or Stableford rules, or you can compete against artificial intelligence opponents in a four-course tournament. For some less-conventional play, Real World Golf offers a handful of minigames that challenge you to hit specific segments on a gigantic dart board, shoot the ball through giant colored hoops floating in the air, or hit specific targets on a driving range. The game offers multiplayer variations on most of the gameplay modes for up to four players, but the fact that you have to share the same pair of mesh gloves with everyone else in a round-robin fashion makes it kind of clumsy, and honestly, a little bit gross. Real World Golf also has the unfortunate distinction of being one of the more unattractive golf games to come along in a long while. The courses lack detail, and the awful, splotchy ground textures make it nearly impossible to distinguish between the fairway, the putting green, and the rough. The pre-fab golfers you'll play as don't look much better, with stiff, repetitive animations and an awkward, chunky look. The whole game looks muddy, and the poor graphics do a lot to negate the game's inherent sense of ~being there.~ The Xbox version does have 480p support, which does little but give you a widescreen perspective on the action. Beyond this difference, the two versions of Real World Golf are functionally identical. The inherent novelty just isn't enough to carry Real World Golf. There's barely any sound design to speak of here. There's no gallery of spectators to ooh and ahh at your ups and downs, and there's no real ambient sound effects to speak of. The sounds for when you make contact with the ball are weak and canned, and most of the time you'll be playing in silence. The most pronounced piece of sound is some bland voice work from a guy who is supposed to be your caddy, who doesn't say anything of value but says it repeatedly anyways. The menus and a few of the modes of play feature a little background music, which could best be described as sweetly annoying. There's something to be said for the very literal way that Real World Golf approaches the core gameplay, and this could've been something worthwhile if the developer had built a full-featured game around that concept. What you get, though, is far too bare bones to justify the package's fairly hefty price tag."}