{"ref": "https://www.gamespot.com/reviews/pro-evolution-soccer-2009/1900-6199819/", "date": "October 22, 2008", "game_name": "Pro Evolution Soccer 2009", "text": "UK REVIEW--Although Pro Evolution Soccer fans bought last year's game in droves, it was unfortunately an all-time low for the series on the PlayStation 3. Poor graphics, dreadful presentation, and basic online play failed to make the most of the hardware, and it was a step back in gameplay terms. Pro Evolution Soccer 2009 doesn't completely redress the balance, but it's a step in the right direction, with new game modes, an improved editor, and even a Champions League licence. Additionally, this is a more enjoyable game to play thanks to its slower pace, more responsive control system, and simple passing mechanic. Unfortunately these are only small fixes, and though there's a solid game at the core, it's one that still fails to keep up with the times. Pro Evolution Soccer 2009 includes the Champions League for the first time, complete with a TV-like audiovisual presentation. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: Pro Evolution Soccer 2009 Video Review Pro Evolution Soccer 2009 continues the series accessible and deep gameplay. A couple of key changes bring the gameplay back toward Pro Evo 6, which should make fans of the series feel right at home. The overall pace has been reduced this year, and the ball feels heavier, both of which mean that it's easier than ever to link passes. The game is also incredibly fluid when you're trying to link together through-balls and crosses, and moving the ball around generally feels more natural and instinctive than before. However, football is an unpredictable game, and this is something that Pro Evo 2009 really struggles to capture. Part of this is down to the animation system, which lets players change direction quickly but looks outdated and overly procedural. Run a player down the wing and you'll see his animation routine repeating over and over, and though a fast player can outrun a slower one, there's no real sense of physical tussling in midfield. This year's players bounce off of goalposts and one another, but famous players such as Rooney and Ronaldinho have none of their other defining physical qualities. Although the gameplay has merely been given a face-lift, a number of game modes are completely new for this year. At the top of the list is the new Champions League mode, which means that Europe's biggest club tournament is included with some of its key teams and sponsors. This is quite a boon for Konami, who have long failed to secure any official competitions for the series. The Champions League mode is not only given prime position on this year's main menu, but it's also given the full TV-style presentational treatment. You get the same dramatically shot videos, replays, and banner ads that adorn the TV presentation of the competition, and most crucially, Handels Zadok the Priest features throughout. It's quite a refreshing change from previous games that have had an unofficial feel to them, but it's not perfect; only 13 teams from this year's competition are included in their official capacity. Key squads such as Arsenal and Chelsea are still called ~North London~ and ~London FC,~ and are listed outside of the official Champions League roster. In Become a Legend Mode, you control a single player throughout his football career. The other major addition is the Become a Legend mode, in which you concentrate on an individual player rather than an entire team. You create your own player from scratch, choosing his height, weight, and facial details, even his celebration routines and likelihood of injury. You can also scan your own face if you have a PlayStation Eye camera, but the game just sticks your face on top of an existing model. This means that you need to adjust the skin tones on both the model and the photo to attain some sort of parity, and even then the results look oddly disjointed. That said, there's an absolute wealth of options to tweak, and it's great to see yourself score a goal in the game. Ultimately, though, Become a Legend is a novel but rather boring take on the standard game. You spend most of the time running around off the ball, while midfield players will need to constantly chase down attackers while forwards will have to help score goals. Unlike the similar Be a Pro mode in FIFA 09, there's no incentive for actually performing your job on the pitch, given that you're not rewarded for your individual passing and tackling. If your team is scoring goals and winning games, then you'll be able to move to new teams, which means that your AI teammates become stronger along the way. The online version of Legend is much better because it does reward people for making successful passes and tackles, and the score multiplies the longer you hold on to the ball. The downside is that it only offers support for up to four players, and you have to play against an AI opponent. The lack of official licences is something that Pro Evo fans should be used to by now, so its good that the edit mode has become even more extensive. You can manually edit everything from individual players and teams to stadiums and competitions, and if you spend a bit of time, you can update all of your favourite teams and leagues. Seeing ~Yorkshire Orange~ instead of ~Hull City~ can make any suspension of disbelief much harder, so it's worth doing. Even better, you can now import your own images and photos via USB memory stick or the PlayStation Eye camera. This still results in some funny-looking player faces, but it works well on club emblems. Konami has clearly put some work into presentation this year, and though the results are still far from stylish, they are definitely trying. The menu system has been given a pop art/Gilbert & George overhaul that may look dated, but it certainly differentiates in the world of commercial sports games. The sound is atrocious, with generic music for the menus and what is without doubt the worst commentary yet. The duo of John Champion and Mark Lawrenson have unwisely tried to inject some humour into this year's proceedings, saying things like, ~This match will end in defeat for one party, and in a party for the other.~ Even worse, they make frequent factual inaccuracies, praising defenders who haven't even touched the ball or midfielders who made passes that went straight to the opposing team. There are also no trophies for the PS3 version, which is a shame because the Xbox 360 version does feature achievements. Camera and photo integration lets you put yourself in the game. Last year's online mode was laggy, simple, and prone to connection dropout, and though it was updated postrelease, it never reached the state that it really should have. This year's game is better, but it's still lacking on both features and performance. The registration process involves separate IDs for both the game and Konami, and even when you get into the online mode, it's a confusing collection of menus and options. Servers are split by language, probably because you can text chat in the lobby before a game, and then each lobby has a maximum player count of 100. You can challenge individual players to matches or pair up automatically with the quick-match option, but getting into an online game still requires much more time and effort than it should. Lag is also a problem, with balls that act erratically and players that transport from one location to another. Strangely, this seemed to afflict the standard 1-versus-1 online mode rather than it did the four-player Legends mode. Pro Evolution Soccer 2009 is a good game, but it's one that has significantly failed to evolve over the last few years. The new modes add some potential interest for owners of last years game, but the Champions League is just flashy dressing for a competition that still doesn't feature all of the official teams, and the Become a Legend mode is neither as feature-packed nor as fun to play as FIFA 09's equivalent. If you love Pro Evolution Soccer's gameplay and simple control system then this year's game is worth checking out, but everyone has a right to demand much more from Konami's increasingly stale series."}