{"ref": "https://www.gamespot.com/reviews/batman-dark-tomorrow-review/1900-6025392/", "date": "April 21, 2003", "game_name": "Batman: Dark Tomorrow", "text": "Batman: Dark Tomorrow was first shown as a GameCube-exclusive title at E3 2001, and it suffered a number of delays along the way. Now that the game is finally available, it's pretty safe to say that everyone concerned would have been better off if it had been delayed even longer. Die-hard Batman fans might enjoy the story behind the game, but the actual experience of playing Batman: Dark Tomorrow is so awful that avoiding the game altogether is the best course of action. Batman returns. As is the case with most Batman games, the story revolves around the happenings in Gotham City, the mysterious hero Batman, and a motley crew of twisted villains. Told through a series of decent-looking cutscenes with passable voice acting, the story is one that any fan of the series will instantly be familiar with. Crime is running rampant, and only Batman can save the day. Batman, of course, has his standard set of tools at his disposal, including the batcuffs, the batcable, and the ever-popular batarang. In addition to these, you'll be able to use a flashlight, night-vision goggles, and more. While you have plenty of gadgets to aid you in your crime fighting, controlling your character is where the game begins to unravel. Unfortunately, no amount of cool gadgetry can make up for the fact that controlling Batman is downright painful. Poorly animated, stiff as a board, and generally unresponsive, Batman: Dark Tomorrow is simply not much fun to play. The tone is set in the very first level, which requires you to jump from rooftop to rooftop. Expect to die continually as you come to grips with how to compensate for the lack of accurate controls. The gameplay is a combination of stealth and action. Enemies are often grouped in packs, and they'll relentlessly attack you as soon as you're spotted. Your foes cannot be killed--only knocked out for a couple of seconds, which is long enough to apply the batcuffs to ensure that they won't pose any further threat. The cuffing animation plays every time you cuff someone, and it gets really old after you see it repeated a few hundred times. The combat itself is very simplistic and for the most part is hand-to-hand. Two face buttons perform kicks and punches, and holding the left trigger allows you to perform combination attacks. The bulk of the game consists of delivering a few blows to an enemy, knocking him down, cuffing him, and then moving on to the next scene. In other words, not only is the game plagued by poor controls, but it's also repetitive. But we'd probably be better off without him. Batman: Dark Tomorrow doesn't do a very good job of re-creating Gotham City visually. For a GameCube game, it simply isn't anywhere near the competition. The game's graphics are dark and dreary, with blurry, overused textures. The enemies you meet on the streets basically all look the same, and they're animated about as well as Batman, which isn't very well at all. Sadly, the only thing that really stands out is the animation of Batman's flowing cape. There is also no camera control--each scene is locked in a preset view, like in a Resident Evil game. One of the game's most serious problems crops up whenever you move on to the next screen, as the camera angles in adjacent screens will often be the exact opposites of each other. So, upon entering the next screen, the joystick movement will be the opposite of what you'd naturally expect. Imagine exiting one screen to the left-hand side, appearing on the right-hand side of the next, all while still holding the control stick to the left and moving to the right. If you let off the stick for a second, the movement will reset to be more logical. Until you get the hang of it, you'll be spending quite a bit of time moving back and forth between screens. Why the developers chose to go with a control system this convoluted is beyond comprehension. When you combine the stiff gameplay, muddy graphics, and clunky movement in the game's levels, Batman: Dark Tomorrow ends up feeling like it was thrown together with half-finished components. You'd figure that all the delays would have allowed the game's developer, HotGen, to deliver a well-polished final product, but in the end, Batman: Dark Tomorrow plays like a game that simply isn't finished. The story and voice acting may be decent, but actually playing the game is not worth the price of admission, let alone the price of a rental."}