{"ref": "https://www.gamespot.com/reviews/iridion-3-d-review/1900-2770814/", "date": "May 17, 2006", "game_name": "Iridion 3D", "text": "Iridion 3-D--a creation of German developer Shin'en--is easily one of the Game Boy Advance's most visually impressive launch titles. While it in no way taxes the handheld's as-of-yet mostly untapped 3D capabilities, the magic that the game manages to work with its advanced 2D engine is nothing short of amazing. From a gameplay standpoint, the game falls flat, however--this shooter is made up of seven stages of mostly uninspired blast-and-swerve sequences.Iridion 3-D mostly resembles ~on rails~ shooters, such as Star Fox and Space Harrier. Essentially, your ship glides through a perpetually scrolling environment while shooting distant enemies and avoiding their shots. The space in which you can move, though, is pretty large, and in most cases it's considerably larger than the GBA's screen in every direction. The enemies that attack you speed in your direction en masse in tightly defined formations, and the assaults are usually several waves thick. Each stage will feature around three or four enemy types, at best, throngs of which will alternately attack you until you reach the stage's boss. Boss fights are both the game design's highlight (which isn't saying much) and an opportunity for the game's engine to shine. The actual bosses are usually full-screen affairs, with patterned attacks and graphical frills aplenty. They're always small ministages in themselves, albeit without the game's patented scrolling backgrounds. Instead of giving the illusion of spatial movement, the boss fights utilize the engine's scrolling properties to imbue the boss sequences with life, animating certain aspects of the backgrounds for dramatic effect. Iridion's design makes heavy use of the GBA's scaling capabilities. Enemy ships will gradually increase in size as they approach your ship, and the effect is rather smooth. Unfortunately, the distance of smaller objects--such as enemy bullets--is a bit more difficult to gauge. Also, fast-moving enemies seem to scale less accurately than slower ones, making the game's kamikaze ships particularly frustrating to encounter.The game's design flaws ultimately compromise its experience. Since enemies attack in rigidly defined patterns, you'll quickly learn how best to dodge them (rather than shoot them) after playing each stage a couple of times. And since the scope of the game's control is limited to begin with (you can move in four directions and shoot with the A button), you won't feel particularly inspired to fight the urge to simply dodge your way through the game. The game's power-ups do little to relieve the doldrums--they just change the appearance and damage rating of your shot. Admittedly, though, the twin shot is pretty effective, and, when coupled with the fact that your ship can take multiple hits without blowing up, can make the game a breeze.But if you're looking for a game that aptly showcases the power of Nintendo's handheld marvel, Iridion 3-D just might be worth your while. As mentioned, the game makes use of a superimpressive 2D engine that does a rather good job of convincing you it's 3D. While it's ultimately all smoke and mirrors, Iridion's world is richly detailed, has remarkable depth, and is unbelievably fluid. It's often hard to tell if the game's backgrounds are composed of streaming FMV or just some really fancy math-powered 2D bitmaps. Regardless, the backgrounds scale realistically as you move over them, very effectively giving the illusion of 3D. Their surfaces are incredibly detailed, and their themes vary for each level. The first stage takes place inside of a refuse tunnel, and the surfaces are suitably dark, gritty, and precipitous. Later stages take place over oceans, planet surfaces, and lava worlds. Each has its native environmental effects, which really add to the atmosphere. The ship designs are mostly uninspired, drawing heavily from the canon of shooters of years past. Your own ship looks like a mix between Star Fox's Arwing and a Star Wars A-Wing fighter, while your enemies run the gamut of abstract hostile shapes to animal-esque craft.Do yourself a favor and take a look at Iridion 3-D before buying it. It looks great, and it will really sell you on this whole portable gaming thing. If you decide to pick it up, be warned that, after the initial ~wow~ wears off, you'll be stuck with an empty experience. That said, we look forward to seeing future games make use of Iridion's 3-D technology to more inspired ends."}