{"ref": "https://www.gamespot.com/reviews/prison-break-the-conspiracy-review/1900-6257794/", "date": "April 13, 2010", "game_name": "Prison Break: The Conspiracy", "text": "Prison life is difficult to emulate within the realm of video games. Because you always have the choice to turn off a torturous game and move on to something more fulfilling, the feeling of being locked away in a suffocating cell with no hope for freedom is hard to accurately convey through digital media. However, Prison Break: The Conspiracy does an admirable job of making every moment within its world mimic the utter hopelessness one must feel when trapped behind bars. This claustrophobic reenactment of the now-defunct television series never even reaches the level of tolerable. There's no reprieve from the boring fist fights and tedious stealth missions that constantly assault you throughout these eight-hours of grueling monotony. The story may appeal to fans of the series who long to interact with virtual representations of their favorite characters, but even the most ardent Prison Break fanatic should stay far away from The Conspiracy. The Conspiracy cannot even give fans of the show the pleasure of controlling one of their favorite characters from the television series. Instead, you assume the role of Tom Paxton, a character created just for this game. Although he appears to be an ordinary prisoner--one convicted of first-degree murder--he is really a covert agent working for The Company. Your job is to do some sleuthing around the big house to figure out why Michael Scofield is really behind bars and ensure that his brother, Lincoln Borrows, goes through with his electric-chair execution. The various alliances and under-the-table dealings you must engage in may pique the interest of those who are intrigued by the shady lives of convicts, but the abrasive voice acting and stilted animations make it difficult for the uninitiated to be pulled into the layers of underhanded partnerships. At the beginning of the story, a surly prisoner snaps Im not here to make friends, but you run odd errands for everyone who asks in a desperate attempt to get on people's good side. Most of your time in The Conspiracy is spent on mind-numbing, stealth-based fetch quests, shuttling you from one dreary section of jail to another as you scrounge around for whatever random tool your mission requires. You do have a modicum of freedom within the prison walls, but there is little reason to venture off the well-worn path. Weight-lifting and bag-punching exercises encompass the worst aspects of minigames. Not only are these incredibly easy, requiring neither skill nor concentration to complete, but they also offer minimal reward; thus, your efforts are not worth the drudgery. There are also underground fights to be put to sleep by and a tattoo parlor to class up your convict, but since there's no fun to be had in any of these endeavors, it's best to march obediently to your next objective without stopping to explore. What's a prison fight without a scissor-kick finish? But it's not as if the story missions are any more interesting than the dull side quests. The majority of The Conspiracy comprises a series of stealth-based missions, but reality has been stripped completely away and replaced by situations that are so contrived they are almost laughable. The AI is as artificial as it gets. There are guards and delivery men scattered everywhere, but it is impossible to predict how they'll react to your presence. Sometimes, they can spot you from across the room, even in low light with pillars and walls blocking their view. Other times, you can walk right in front of them in broad daylight, yet they look right through you. Their patterns are also inane and illogical. A delivery man will ask where he should drop off a package; when told where to go, he will begin to walk aimlessly around the room, turning robotically at odd intervals and generally acting like a man without a brain. Dealing with incomprehensible AI is bad enough, but it's so much worse when you can't even see your enemies. The camera in The Conspiracy is way too tight, giving you a stunning view of Paxton's back but little ability to see the environment. This is inexcusable in a stealth game. If you're seen by man or camera, your game ends and you must restart from a checkpoint. But because it's so difficult to get a good look at everyone who poses a threat, you'll fail missions until you memorize where everything is situated. But even after you have everything committed to memory, you'll still fail because the AI so frequently breaks its own logic. This is a terribly frustrating game, and even when you finally overcome a situation that has been aggravating you, there is still no satisfaction to be had because luck and enemy incompetence are the keys to success. If you think lousy AI and a see-nothing camera are bad, just wait until you try to control Paxton. He moves as if he's trudging through a lake of molasses with a 20-ton squid on his back. There is no sense of urgency, so you can only scream for him to shimmy up that pipe faster because there is no way to make him move like a normal person. You can run while on the ground if you want to move faster at the risk of being loud, but the awful AI ruins any strategy this option could have presented. Guards may end up hearing you when you're creeping or play deaf when you start sprinting, so you just have to guess and hope for the best. Furthermore, button presses don't even register half the time. The difference between success and failure is frequently less than a second, but it can take four or more button presses before you finally get into cover or drop off a ledge from which you're hanging. On top of that nonsense, Paxton drifts like a Tokyo racecar. If you remove your hand from the analog stick, you'll watch in horror as he slinks slowly out of cover and into view. If those mechanical problems weren't enough to steer you far away from this anger-inducing game, there are loads of immersion-breaking touches everywhere you look. The reaction of the guards when you're caught is stunning in its ineptitude. The camera will zoom to their expressionless faces, but they won't shout or even try to capture you. Instead, your game just ends, with the camera still stuck on their stoic faces. Surveillance cameras line the walls, but you can just tap them from below, tilting their lens skyward, if you want to walk right by them. Don't worry; no one will notice that they're filming the ceiling. To get around the prison, you enter man-sized air ducts that no one bothers to guard, which is certainly stupid, but the toilet that doubles as a secret trap door is even more implausible. And because you're a covert agent, you need to update your employers frequently. You do this by either dialing out from one of the many payphones that line the yard or you just speak into your finger-sized recorder mere feet away from the people you're trying to fool. The stealth elements are painfully tedious and frustrating, but at least they elicit some emotion. You get to punch dudes in the face when you aren't matching wits with the bumbling guards, but these fist fights can only conjure a hearty yawn. You need only slam on the punch buttons (one weak and fast, the other slow and powerful), block occasionally, and watch your hapless opponent crumple to the ground. It's exceedingly simple, but there are even problems present here. The controls are once again awful, barely registering as you mash madly on the button. Once you knock your opponent to the ground, your weak punch turns into a kick, but you will frequently punch air instead of nailing your downed opponent in the stomach. When you drain an opponent's life away, you have to perform a finishing move to end it. The animations on these takedowns look less believable than professional wrestling. During one, you toss your opponent on his back and leap on his chest, but the haymaker you throw that's supposed to knock him out doesn't even make contact. Conveniently placed man-sized holes make it easy to get around the prison. The one mildly interesting element in the entire game occurs when you have to pick locks. It's not the most novel mechanic in the world--align the pins in the right spot--but because you're frequently rushed to do this while a guard ambles slowly toward you, it is the only time in The Conspiracy when you actually feel tension. Of course, these instances happen infrequently and last only 10 seconds at a time, but they are the standout moments within the game. Quick-time events appear with the same sort of regularity, but whereas picking locks added a brief reprieve from the suffering, these only add to it. The most common action is to rapidly tap a specific button, which seems harmless enough, but this is almost always followed by a solitary tap for a different button. There is no pause between these two commands, though, so you will often mess up because you were still slamming on that first button. There is also an offline-only Versus mode in The Conspiracy, pitting you against a friend in first-to-three fights, but this is every bit as lackluster as the single-player combat. The controls are stiff and unresponsive, and the iffy collision detection further hampers any chance of enjoyment. It's extremely difficult to line up a punch correctly, making this novelty good for no more than one attempt. It's even more difficult to try to find a way to enjoy this game. With unsatisfying stealth, puzzling logic, and simple-minded combat, there is almost nothing in Prison Break that is actually fun. That the lock-picking minigame is the highlight just shows how lousy the other aspects truly are in this game. People who have never watched the show should stay far away, but fans should stay even further away. Playing the Conspiracy can only tarnish your memories of the source material. If you think lousy AI and a see-nothing camera are bad, just wait until you try to control Paxton. He moves as if he's trudging through a lake of molasses with a 20-ton squid on his back. There is no sense of urgency, so you can only scream for him to shimmy up that pipe faster because there is no way to make him move like a normal person. You can run while on the ground if you want to move faster at the risk of being loud, but the awful AI ruins any strategy this option could have presented. Guards may end up hearing you when you're creeping or play deaf when you start sprinting, so you just have to guess and hope for the best. Furthermore, button presses don't even register half the time. The difference between success and failure is frequently less than a second, but it can take four or more button presses before you finally get into cover or drop off a ledge from which you're hanging. On top of that nonsense, Paxton drifts like a Tokyo racecar. If you remove your hand from the analog stick, you'll watch in horror as he slinks slowly out of cover and into view. If those mechanical problems weren't enough to steer you far away from this anger-inducing game, there are loads of immersion-breaking touches everywhere you look. The reaction of the guards when you're caught is stunning in its ineptitude. The camera will zoom to their expressionless faces, but they won't shout or even try to capture you. Instead, your game just ends, with the camera still stuck on their stoic faces. Surveillance cameras line the walls, but you can just tap them from below, tilting their lens skyward, if you want to walk right by them. Don't worry; no one will notice that they're filming the ceiling. To get around the prison, you enter man-sized air ducts that no one bothers to guard, which is certainly stupid, but the toilet that doubles as a secret trap door is even more implausible. And because you're a covert agent, you need to update your employers frequently. You do this by either dialing out from one of the many payphones that line the yard or you just speak into your finger-sized recorder mere feet away from the people you're trying to fool. The stealth elements are painfully tedious and frustrating, but at least they elicit some emotion. You get to punch dudes in the face when you aren't matching wits with the bumbling guards, but these fist fights can only conjure a hearty yawn. You need only slam on the punch buttons (one weak and fast, the other slow and powerful), block occasionally, and watch your hapless opponent crumple to the ground. It's exceedingly simple, but there are even problems present here. The controls are once again awful, barely registering as you mash madly on the button. Once you knock your opponent to the ground, your weak punch turns into a kick, but you will frequently punch air instead of nailing your downed opponent in the stomach. When you drain an opponent's life away, you have to perform a finishing move to end it. The animations on these takedowns look less believable than professional wrestling. During one, you toss your opponent on his back and leap on his chest, but the haymaker you throw that's supposed to knock him out doesn't even make contact. Conveniently placed man-sized holes make it easy to get around the prison. The one mildly interesting element in the entire game occurs when you have to pick locks. It's not the most novel mechanic in the world--align the pins in the right spot--but because you're frequently rushed to do this while a guard ambles slowly toward you, it is the only time in The Conspiracy when you actually feel tension. Of course, these instances happen infrequently and last only 10 seconds at a time, but they are the standout moments within the game. Quick-time events appear with the same sort of regularity, but whereas picking locks added a brief reprieve from the suffering, these only add to it. The most common action is to rapidly tap a specific button, which seems harmless enough, but this is almost always followed by a solitary tap for a different button. There is no pause between these two commands, though, so you will often mess up because you were still slamming on that first button. There is also an offline-only Versus mode in The Conspiracy, pitting you against a friend in first-to-three fights, but this is every bit as lackluster as the single-player combat. The controls are stiff and unresponsive, and the iffy collision detection further hampers any chance of enjoyment. It's extremely difficult to line up a punch correctly, making this novelty good for no more than one attempt. It's even more difficult to try to find a way to enjoy this game. With unsatisfying stealth, puzzling logic, and simple-minded combat, there is almost nothing in Prison Break that is actually fun. That the lock-picking minigame is the highlight just shows how lousy the other aspects truly are in this game. People who have never watched the show should stay far away, but fans should stay even further away. Playing the Conspiracy can only tarnish your memories of the source material."}