{"ref": "https://www.gamespot.com/reviews/call-of-duty-finest-hour-review/1900-6113588/", "date": "November 18, 2004", "game_name": "Call of Duty: Finest Hour", "text": "The original Call of Duty, released on the PC late last year, distinguished itself as a great first-person shooter, despite the glut of other World War II-themed shooters already on the market at the time. Its intense, well-paced single-player campaign was a great complement to its excellent multiplayer modes. A year later, the franchise finds itself on all three major consoles in an entirely new game called Call of Duty: Finest Hour. While Finest Hour is a competent shooter on most counts, a few important things have been lost in the franchise's transition between platforms. The Call of Duty series makes its first jump onto consoles with Finest Hour. Like the original PC game, Finest Hour's single-player component actually consists of three small campaigns told from the perspective of the Russian, British, and American armies. While some may find this type of campaign disjointed from a story perspective, it allows for a good variety of settings. As the Russians, you'll begin by crossing the Volga River in an attempt to push the German army out of the besieged city of Stalingrad. The British campaign is set in the deserts of North Africa, while the American missions have you starting the push into Western Germany with the capture of Aachen. Throughout the game, you'll be accompanied by AI-controlled comrades who will fight by your side and help you advance through the missions. These teammates can and will die, but they're often replaced by more fodder as you proceed through the missions. Experienced shooter fans will find several familiar mission types in Finest Hour. There are a couple of tank-driving missions, a turret-style mission on the back of a jeep, and a shooting-gallery sequence with a sniper rifle. You'll also participate in some house-to-house fighting, kicking down doors and ferreting out entrenched Germans. Unfortunately, the memorable moments in Finest Hour are separated by lengthy sequences of filler. In spite of this, the 10-hour campaign might still have been a good overall experience if not for some fundamental problems in the gameplay. One issue is the lack of checkpoints. The difficulty of the game ratchets up noticeably between the Russian campaign and the British one, yet for some reason there's usually only one checkpoint in each mission, even the lengthier, multipart ones. Inexperienced players may become frustrated at having to repeat long sequences of gameplay over and over again because of the lack of checkpoints in each level. Ironically, the original PC game, which allowed for quicksaves, still included several checkpoints in each of its levels. The campaign takes you through a variety of historical settings and battles. One of the other big problems in Call of Duty: Finest Hour is the feel of the weaponry. You do have an array of real-life weapons at your disposal, such as Thompson and PPSH submachine guns, and Kar98 rifles. And like in the original Call of Duty, you can aim down the iron sight of your weapons for additional accuracy and a partial zoom. You're allowed to carry two weapons at any given time, along with grenades and other types of explosives. The problem is that it's often difficult to tell how much damage you're doing to an enemy, and when your target is actually dead. Dying enemies often go through lengthy (and overacted) death animations, which leads you to wonder if they're still alive or actually dead. This causes confusion, as enemies who are getting peppered with fire often go through reactionary animations that look similar to death animations. The developers have attempted to alleviate this problem by including a visual indicator in the crosshair that tells you when you're hitting an enemy, but you'll find yourself expending too much precious ammunition anyway just to make sure your targets go down. The grenade tosses in Finest Hour are also implemented very poorly. Many first-person shooters allow you to vary the distance of your grenade tosses, and even cook grenades before tossing them, but Finest Hour allows you absolutely no control over your grenades. You press the button, sit through a lengthy grenade-prep animation, and then watch as the toss is made with the exact same force every time. The bounces that the grenades take off the walls and ground are also difficult to predict, as the grenades themselves don't appear to have any weight, or be constrained by physics. The lack of fine control over grenades can be very frustrating in the house-to-house sequences--clearing out rooms full of enemies is more difficult than it has to be, as misthrows are a commonplace occurrence. There are other strange inconsistencies. While firing the tank cannon, for example, there's absolutely no need to account for arc. Place the crosshairs on the target, and no matter how far away it is, you will hit that target. Presumably that design decision was made to simplify aiming, yet for some reason, using a panzerschreck rocket launcher as an infantryman requires you to adjust your aim for the arc of the shot. As far as presentation goes, Finest Hour's graphics engine is adequate to the task, offering detailed weapon and vehicle models. The texturing, however, lacks detail and is disappointingly blotchy, even in the Xbox version of the game. Finest Hour also has some noticeable slowdown during intense firefights, and especially when a nearby explosion kicks up a lot of dust and smoke. On the audio front, Finest Hour's sound effects are decent, but nothing special. In contrast to many other World War II-based shooters, Finest Hour's weapon sounds feel muted and much less sharp. You'll also hear a limited amount of voice work during in-engine cutscenes, but none of it is particularly noteworthy. Actor Dennis Haysbert (24, Heat) does part of the narration, setting the historical context for each campaign, but his contribution doesn't really add much to the overall package. Finest Hour offers an array of real-life guns from each of three different countries. While there are no split-screen multiplayer options on any of the three platforms, the Xbox and PS2 versions of the game offer online multiplayer for up to 16 players. There are eight maps and four game modes. Standard deathmatch, team deathmatch, and capture the flag modes are included, as well as ~search and destroy,~ which is a team-based mode in which one team attempts to set a time bomb on a target, while the other team tries to thwart the bombing. This mode turned out to be very popular in the PC version of the game, probably because it's fairly similar to Counter-Strike. For some reason, though, Finest Hour's interpretation of search and destroy is not round-based. Instead, members of each team can spawn continually, like in capture the flag, making it all but impossible for the offensive team to successfully plant and detonate a bomb. On the plus side, online play is fairly smooth on both the PS2 and Xbox Live, even on servers with 12 or more players. Overall, Call of Duty: Finest Hour is still a competent shooter, and those who enjoy World War II-based games will still have a good time with it. Had the feel of the weapons been a little better, and had the campaign been more consistently intense, Finest Hour could have been a much better game. As it is, though, it enters a market that becomes more and more competitive with each passing month. Judged against the standards of so many other quality first-person shooters, Finest Hour is difficult to wholeheartedly recommend."}