{"ref": "https://www.gamespot.com/reviews/desperados-3-review-revolvers-and-redos/1900-6417500/", "date": "August 4, 2020", "game_name": "Desperados III", "text": "Imagine being able to take back every mistake you make, instantly, reliving each moment over and over until it plays out as you hoped. In less astute hands, it could feel like an exercise in trial and error. In Desperados 3, however, it unfolds in masterful fashion, providing ample scope for you to dream up a multitude of creative plans alongside the ability to reset the board in a flash should the plan fail. It's a rapidfire process of forming an hypothesis, testing it and tossing it aside. By encouraging experimentation at every turn, Desperados 3 proves a stealth tactics game where invention thrives.Stealth games can often degenerate into a loop of quick-saving and quick-loading. Desperados 3 is built around that loop, an aspect reinforced by a tutorial which instructs you on how to quick-save and quick-load before it tells you how to deal with an enemy. It's hammered home by regular pop-up notifications informing you of the time since you last quick-saved. You can customise this reminder--tweaking the delay or disabling it entirely--but the fact the default setting is to nudge you every 60 seconds ought to stress the importance of quick-saving.Archetypal gunslinger John Cooper and his friends are rather fragile, even on the normal difficulty setting, while the cadres of thugs, gunwomen and assorted rifle-toting outlaws they find themselves up against are very much of the ~shoot first, ask questions later~ mindset. So when a plan heads south--as even the most meticulously observed ones are wont to do, usually when one of the gang gets spotted or occasionally a carelessly discarded body is found--it's very much a case of the quick-load and the dead. Cooper's out for revenge. He's spent his whole adult life on the trail of a man named Frank. Desperados 3 is Cooper's story primarily, but it also weaves in the shorter tales of the four companions he recruits to form his gang: McCoy, the sharpshooting doctor; Hector, the grizzled merc; Kate, the runaway bride and rancher; and Isabelle, the ~black magic~ practitioner. It's a pulpy Western revenge narrative at heart and throughout these characters all struggle to escape the shackles of stereotype. They're rescued by writing that doesn't weigh down their conversations between missions with exposition and peppers mid-mission exchanges with a surprising amount of context-sensitive banter that draws out their relationships. Move McCoy and Isabelle into the same hiding spot, for example, and chances are one of them will comment on the situation, teasing out some finer strands of character detail. This chat--often funny and wryly observed--serves well as character development, building personal bonds between the gang of five who might otherwise come across as a little one-dimensional.On a mission, much of Desperados 3 is spent in a state of observation, scratching your chin, deep in thought as you ponder your next move. Enemies patrol each level, a quick right-click on them revealing their vision cones, and it's your job to monitor their routes, noting where their cones intersect with other enemies and attempting to isolate a blind spot where you can slip through undetected. Each map becomes a web of overlapping data, with every enemy guard linked to one or more others by constantly roving sight lines. Contemplating the mission before you can feel like attempting some kind of horizontally sprawling Jenga puzzle where you're tasked with removing each piece without any of the other pieces noticing its disappearance. Patience and diligence are rewarded. It's easy to spend minutes at a time just watching, trying to absorb all the information about the obstacles you're about to tackle. What makes formulating your next move so tactically satisfying is the interplay between the different behaviour types of various enemies and the broad range of skills your gang possesses. It works because enemy behaviour is predictable according to their type, theoretically meaning you can make a plan armed with full knowledge of how every enemy will react. You know that when Cooper tosses a coin behind that thug, he's going to turn around for just long enough to allow Hector to slip past. And you know that Isabelle can blow darts into two guards to spiritually connect them so that when McCoy shoots one with his Colt Buntline, both guards will drop. Theoretically, that is.But these levels are so intricately designed, so crammed with interlocking parts, that when you go to execute your plan there's always something you didn't take into account, some additional factor that interrupts your ideal intention. The guard up on the roof who can see Kate kneeing that thug in the groin, perhaps, or the enemy you were hoping to distract instead spots Hector's footprints in the mud, or maybe Cooper just didn't have enough time to get rid of the body. Occasionally it's possible to improvise your way out of such trouble, but the vast majority of the time the best move is simply to hit the quick-load key and try again.What's remarkable is that this quick-save and quick-load routine never becomes frustrating. Instead it feels liberating. You're free to try new things and give all kinds of wild ideas a shot. Most of the time, though, it feels as if you're gradually honing in on what is at first a vague gambit, and each fresh attempt adds more definition until eventually the successful strategy takes shape. It helps that the set of sixteen increasingly lengthy and convoluted missions continually shake up the scenarios, rearranging or introducing new elements--in this one there are regular civilians, this one's at night and some guards carry lanterns, or you've only got some of the gang available for this one--so that every mission manages to throw up a new challenge and test you to reinvent new strategies to progress. And it culminates in a brilliantly orchestrated final encounter that should be a textbook example of how to enable players to demonstrate all the lessons they've learned along the way. Even better, once you've finished the sixteen story missions--which, I should emphasise, took me a good 40 or so hours--they can all be replayed to earn badges by completing certain tricky tasks, such as beating the mission without using firearms or not stepping on certain surfaces or killing multiple enemies with the same environmental accident. I particularly enjoyed diving into these because the restrictions forced me to play in new ways and find alternative solutions, making me appreciate anew the creativity and flexibility of the game's tactical options. There are even additional challenge missions unlocked throughout that repurpose existing maps with utterly new objectives, some of which proved to be among the most enjoyable and tactically satisfying in the whole game.Desperados 3 is a superb package. It's a clever, cunning game of stealth and tactical thinking that, thanks to a generous quick-save system and wealth of informative visual cues, entices you to tinker with all the toys it has on offer and fully explore the possibility spaces of its elaborate levels. There's no need for a do-over here; Desperados 3 is a dead-eye shot on the very first try."}