{"ref": "https://www.gamespot.com/reviews/mike-tyson-heavyweight-boxing/1900-2876447/", "date": "August 2, 2002", "game_name": "Mike Tyson Heavyweight Boxing", "text": "Mike Tyson's Punch-Out!! for the Nintendo Entertainment System was the first licensed Mike Tyson boxing game. It was an amazingly fun game that pit you, as the archetypal underdog known as Little Mac, against a cavalcade of colorful opponents, leading up to the title bout against the then-role-model-worthy champ, ~Iron~ Mike Tyson. But a lot has changed since then, and Mike isn't the Nintendo-friendly hero he once was. Undaunted, Codemasters has picked up the license to use Mike's likeness in a game, and the result is Mike Tyson Heavyweight Boxing, which is quite possibly one of the most confused games and most definitely one of the worst games to be released so far in 2002. Xbox fans are getting a slightly better looking and better-balanced version of the game than PS2 owners received, but the game still doesn't deliver anything resembling a good time. The confusion comes into play almost immediately. What is this game trying to accomplish? Looking at its long list of boxing maneuvers, which includes hooks, jabs, uppercuts, counterpunches, and a handful of defensive moves, you might think it's supposed to be a complex boxing simulation of sorts. But as soon as you see the game in action, it becomes quite apparent that none of this even comes close to resembling the actual sport. Instead, the game tries to appeal to both boxing and fighting game fans by offering up lots of canned combo moves, complete with flashy effects, that you can unleash only after earning a couple of combo points. The game's AI seems a little more even than the AI in the PS2 release, which would alternate between easy and impossible for no good reason. Here, the boxers put up a decent fight, and they appear to put forth a more consistent performance. Nevertheless, the game's collision detection is spotty, so you'll never be terribly sure if an uppercut is going to connect with the other boxer or not. The game has a lot of different punches and moves, but the perspective and the models' odd, stilted animation make it pretty difficult to figure out what is going on in the ring at any given moment. Graphically, Mike Tyson Heavyweight Boxing is passable, but never impressive. The stretched-out appearance of the PS2 version is history, and this version doesn't slow down nearly as much, either. The boxer models still look weird, though, and the animation is pretty jerky. The game's sound is also completely underwhelming. The game's box touts ~commentary by Ian Darke and Bobby Czyz,~ but in practice, that amounts to a broken, stunted sentence or two between rounds and after the fight. The game features a handful of different modes, and there's even a ton of unlockable items to be found that can be used to customize your own boxer. Unfortunately, the game plays so poorly that you'll never feel compelled to actually trudge through and see what it has to offer. Anyway, the unlockable items and light improvements on the essentially broken PS2 version don't do anything to salvage this game. Do yourself a favor and look elsewhere for boxing excitement."}