{"ref": "https://www.gamespot.com/reviews/elements-of-destruction-review/1900-6192814/", "date": "June 20, 2008", "game_name": "Elements of Destruction", "text": "If you've delighted in building a sandcastle only to smash it down like Godzilla or enjoyed creating a SimCity only to burn it to the ground, you should feel right at home with Elements of Destruction. It's a very simple game that is unabashedly about one thing and one thing only: destroying lots of really big stuff. You play as Dr. Edgar Herbert, a brilliant but crazy research scientist who is bent on revenge against the AIC, a company that fired him after he worked there for a whopping 60 years. The disgruntled Herbert takes his environmental manipulation technology, as well as his deep-seated resentment of white-collar workers, and sets out looking for vengeance. The graphics aren't very detailed, but they get the job done. You exact said vengeance by moving a glowing orb around the screen to unleash tornadoes, earthquakes, and lightning bolts on AIC installations. These attacks feel powerful, and harnessing the power of the elements to wreak havoc is like a mad scientist's dream come true. Lightning is a quick attack that only drains a bit of your energy and only does a bit of damage, but you can fire off a number of bolts in quick succession. Earthquakes take time to build up and consume more energy but are a lot more devastating. Tornadoes can be stopped at any time or can be kept going until you're completely out of energy. Each of your attack types requires a different sort of controller input. Calling forth a fully charged lightning bolt requires a carefully timed button press, unleashing a tornado has you rotating the left stick, and building up an earthquake involves rapidly pounding on the X button. As you progress through the game, you can purchase upgraded versions of your attacks--the ones you start off with are much less powerful and satisfying than those you can upgrade. Elements of Destruction looks and feels like a cross between an action game and an extremely simple real-time strategy game--one in which you don't need to gather resources or build up armies but rather just skip right to the part where you launch an all-out assault on the enemy base. There's still a bit of strategy involved because the AIC has defensive installations and attack units galore. Each of these is particularly effective against one of your elemental attacks and particularly vulnerable to another. This contributes a rock-paper-scissors facet to the game, but any strategic concerns still take a backseat to the action of zooming around the map and trying to blow up as much stuff in as little time as possible while not getting killed. Not getting killed is easy enough early on, but a few levels into the campaign, you'll find yourself constantly barraged by an endless onslaught of AIC units, and you'll need to periodically scurry off to one of the recharge stations scattered about each area. The campaign in Elements of Destruction is extremely short, but then, the gameplay is so simple that it couldn't really sustain much more content anyway. After a not particularly helpful tutorial, you begin the three-part campaign. Each part consists of two levels in which you need to achieve a few destruction goals before time runs out, followed by one boss battle. The bosses sure look imposing, but there's a very simple trick to each one that makes them all quite easy. After you complete the campaign, you unlock a harder difficulty mode. You can also play through the campaign with a partner online or in split-screen multiplayer, or you can compete to see who can do the most damage in five minutes. The game doesn't lend itself to exciting multiplayer action and is at its best when played alone, but these modes work well enough. Burn, baby, burn. The graphics are serviceable but unremarkable. Levels are marked by sameness--each town is made up of rows of identical, very simple buildings. Some better destruction effects might have made all the devastation you unleash more enjoyable. As it is, buildings become increasingly engulfed in flames as they get more and more damaged, then they vanish in sudden explosions, regardless of the destructive power you've used. The game's sound is considerably better, though, and really contributes to the sense of havoc. Everything sounds just right, from the thunderclap that accompanies a lightning strike to the deep rumble of your earthquakes. Gleeful comments from the crackpot scientist and occasional radio chatter from the AIC units also liven up the audio presentation. Elements of Destruction doesn't have enough depth to stay interesting for very long, but it does what it sets out to do pretty well. It gives you some fun destructive abilities, making you feel powerful as you unleash them and witness the resulting devastation. If you have an inner mad scientist who is yearning to blow some stuff up real good, Elements of Destruction will at least scratch that itch."}