{"ref": "https://www.gamespot.com/reviews/pokemon-puzzle-league-review/1900-2635287/", "date": "September 29, 2000", "game_name": "Pokemon Puzzle League", "text": "Pokmon is a certifiable phenomenon - calling it anything short of that would be foolish. Between the half dozen Pokmon-themed video games, the cartoon, the card games, the movies, and the other merchandising, it's been proven that if you slap a Pokmon on something, people will buy it. And while at first glance Pokmon Puzzle League appears to be the continued exploitation of the popular Pokmon property, there's actually a decent puzzle game to be found here as well. Once in the game, puzzle fans may experience an intense sensation of dj vu, and with good reason, as Pokmon Puzzle League uses the exact same gameplay found in the old SNES and Game Boy title Tetris Attack. For those not familiar with Tetris Attack, you're given a Tetris-like field full of colored blocks, which you must arrange into horizontal or vertical lines of three or more, all the while rows of blocks are being pushed up from the bottom. If you are unable to clear out enough blocks to keep the entire field from filling up, it's curtains. While not as versatile as the game mechanics found in other puzzle games, Pokmon Puzzle League compensates with several different gameplay modes. There's a single-player game where you face off against computer-controlled Pokmon trainers, the goal being to fill your opponent's field by clearing out blocks on your field. The two-player mode functions in the exact same fashion. The spa service mode requires you to clear all the blocks down to a certain designated point; the time zone mode pits you against the clock to clear as many blocks as you can before time runs out; and the marathon mode, much like the single-player mode in Tetris, just keeps going and going. Then there's the mind-bending puzzle mode, where you are given a number of blocks that you must clear out with a limited number of moves; this mode can prove to be both extremely addictive and difficult. Unlike Tetris Attack, however, the two-player, marathon, and time zone games can also be played using a 3D puzzle environment. This mode functions similarly to its 2D counterpart, though instead of a flat field, you're given a cylinder, which you scroll left and right around, clearing out blocks. The variety of the gameplay provided by these modes greatly enhances what would've otherwise been just another puzzle game. While puzzle games tend not to be showcase pieces of the graphic and sound capabilities of a console, Pokmon Puzzle League is no slouch. The game starts off with an animated clip featuring Ash and Pikachu that looks and sounds like it was snatched directly from the Pokmon cartoon. This sets the tone for the rest of the game; consistently crisp, brightly colored graphics are the order of the day. There is also a fair number of high quality sound samples, though the trainer's exclamations during the game (~I'm gonna win!~) can be grating and may eventually wear out their welcome. First-time puzzle gamers may want to take a pass on this one, though. Puzzle League isn't a bad game, but there are definitely better puzzle games to cut your teeth on. Those who've already played Tetris Attack may want to take a pass on this as well, as the addition of the 3D mode and the Pokmon license aren't enough to justify this purchase. But even if Nintendo is just slapping the Pokmon name on what would've otherwise been a completely unrelated game, the developers have more than made up for it with the quality of the presentation."}