{"ref": "https://www.gamespot.com/reviews/new-legends-review/1900-2848723/", "date": "May 17, 2006", "game_name": "New Legends", "text": "Designed by Infinite Machine, whose founder, Justin Chin, previously worked on the hit PC shooter Jedi Knight, New Legends is one of the few Xbox games that originally started its life as a PC game. But the development team saw fit to change gears and switch the targeted platform to the Xbox. In the end, New Legends isn't a game that will win any awards for its graphics, nor will it be known for having an engaging story or being an incredibly polished game, but New Legends does one thing right: It plays great. The game's combat system is executed so well that it saves the game from being just another cookie-cutter beat-'em-up. New Legends' story begins with Sun Soo--the game's lead character--defending his homeland from the forces of Xao Gon, who has started his bid to take over all of futuristic China. Soo is eventually defeated and exiled from his home to a prison camp where he meets up with a half-demon, half-human brute named Boo, and the two quickly become allies and attempt to escape the prison camp. As you progress through the game, you'll meet up with even more characters, some of whom will actually join your party and help fight Xao Gon's army. The story is pretty one-dimensional, and later on it simply becomes a tool for relaying mission objectives. That's unfortunate because New Legends has some interesting characters that probably could've been expanded upon, such as Topo and her dragon Talos, who speak three or four lines of dialogue throughout the entire game. Most of the spoken dialogue in the game comes from Boo and another one of Sun's allies, Zhang, but again, most of it is for the purpose of explaining mission objectives with a few lines of banter between Boo and Zhang thrown into the mix. Regardless of whether or not it adds any depth to the story, it's always a good idea to listen to Sun's sidekicks because they can offer some information on how to complete missions in the game. The action in New Legends takes place in several locations across China, such as the Forbidden City in Beijing, a Buddhist temple located in the mountains, and even on the top of a runway. Nearly every area is divided into two or three subsections, each having its own set of objectives that range from simply defeating enemies in the area or finding buttons to open doors, to setting explosive charges in specific areas. Fortunately, the objectives are varied enough that the game doesn't feel particularly repetitive. However, some problems with level design combined with an almost worthless objective ~aid~ can create some frustration. Many of the levels in New Legends are absolutely massive, and it's quite possible to get lost if you're not really paying attention to your surroundings. Foreseeing such a problem, Infinite Machine incorporated a pointer icon that functions much in the same way that the arrow works in Crazy Taxi: When you're heading in the direction that the arrow is pointing, it can turn either red or blue to indicate whether you're on the correct or the incorrect path. If that sounds confusing, it is, and you'll spend a significant amount of time running around, looking for the right way to go. This problem becomes amplified particularly in indoor levels because rooms look so similar--you'll be running around in circles for some time. As is the case with so many other games, New Legends also suffers from some horrible camera problems. The camera usually stays behind Sun Soo, and at any time you can rotate it around using the right analog stick on the Xbox controller. But there are more than a few moments when the camera will change perspective on its own, making it difficult to get a good perspective on the action. This gets much worse in tight areas or during indoor levels compared with outdoor levels--you can't move the camera through any walls, and as you might have guessed, the jittery camera doesn't work well in areas that require precise jumping (and there are a few such areas in New Legends).Despite all that, the combat in New Legends is what will keep you playing through to the end--which actually won't take you very long, because the game is relatively short. Sun has a number of different combinations he can use depending on the type of weapon or weapons he happens to be holding. He can either carry one-handed weapons in each hand, such as a dagger, a blade, or even a pistol--or he can use both hands to wield some of the more powerful weapons such as spears, small cannons, or two-handed swords. Combinations can be executed using the weapon in either the left or the right hand by pressing the corresponding button repeatedly--though in the case of two-handed weapons, the alternate attack button simply yields a different combination. In addition, each weapon has a special move that you can execute by pressing two buttons at once, and some of these attacks are incredibly useful. For example, the ax hammer has a special earthquake-like attack that creates small cracks in the ground that travel toward enemies in the area, causing them to fall over and take damage. Another weapon, the triple wind, has two daggers attached by a chain. The special move for this weapon lets Sun spin around with the weapon, which becomes helpful if you're ever surrounded. All of these special attacks can actually be made even more powerful by using Sun's chi power, which causes him to turn blue whenever it's used. If you use chi in combination with the triple wind, not only will Sun spin around, swinging the weapon, but the attack will also draw enemies in and shoot small bolts of lightening at them. However, your chi will drain over time, so it's usually best to save it for really tough situations or during one of the six boss battles in the game. These boss battles are not unlike the boss battles in a Mega Man game, as you'll discover that certain weapons are much more effective against certain characters than others. The fighting system isn't quite as deep as what you'd find in a dedicated fighting game, but the fact that you're almost forced to use different weapons and combinations makes it vastly more interesting and fun than the majority of 3D action games out there. If the combat weren't so entertaining, then New Legends wouldn't really have anything else to fall back on. The graphics in the game are pretty substandard--the blurry textures look as though they belong in a Nintendo 64 game, and with the exception of Sun and Talos, who look good, most of the character models are disappointing. The graphical highlights of the game lie in Sun's martial arts attack animations, some of which look great. Unlike Sun's moves, most of the levels are bland, but there are a few surprising moments that help keep you on your toes. The game's inconsistent frame rate also becomes somewhat of a problem since it can disrupt the timing on your combinations, but nothing is more irritating than the game's disc-accessing times. At random points in the game, you'll hear your Xbox accessing the disc, which inexplicably causes the game to stop for a few seconds and then continue. Part of the problem has to do with New Legends' music. The soundtrack fits the theme of the game incredibly well, but there are long stretches where the music stops playing entirely and then suddenly starts up again, causing the game to stop dead for a few seconds. Otherwise the sound is solid and features some decent voice acting and plenty of effects to accompany different weapon attacks. New Legends spent a long time in development. But after playing through it, you'll likely feel that if Infinite Machine had only had a little more time to work on New Legends, it could have easily been one of the must-have games for the Xbox. The combat is certainly fun, but not to the extent that you can overlook some of New Legends' other problems, like its camera issues and its short length. The game lasts only a little longer than five hours and lacks any extra features. Once you've finished playing the game, you probably won't have much incentive to play it again.Despite all that, the combat in New Legends is what will keep you playing through to the end--which actually won't take you very long, because the game is relatively short. Sun has a number of different combinations he can use depending on the type of weapon or weapons he happens to be holding. He can either carry one-handed weapons in each hand, such as a dagger, a blade, or even a pistol--or he can use both hands to wield some of the more powerful weapons such as spears, small cannons, or two-handed swords. Combinations can be executed using the weapon in either the left or the right hand by pressing the corresponding button repeatedly--though in the case of two-handed weapons, the alternate attack button simply yields a different combination. In addition, each weapon has a special move that you can execute by pressing two buttons at once, and some of these attacks are incredibly useful. For example, the ax hammer has a special earthquake-like attack that creates small cracks in the ground that travel toward enemies in the area, causing them to fall over and take damage. Another weapon, the triple wind, has two daggers attached by a chain. The special move for this weapon lets Sun spin around with the weapon, which becomes helpful if you're ever surrounded. All of these special attacks can actually be made even more powerful by using Sun's chi power, which causes him to turn blue whenever it's used. If you use chi in combination with the triple wind, not only will Sun spin around, swinging the weapon, but the attack will also draw enemies in and shoot small bolts of lightening at them. However, your chi will drain over time, so it's usually best to save it for really tough situations or during one of the six boss battles in the game. These boss battles are not unlike the boss battles in a Mega Man game, as you'll discover that certain weapons are much more effective against certain characters than others. The fighting system isn't quite as deep as what you'd find in a dedicated fighting game, but the fact that you're almost forced to use different weapons and combinations makes it vastly more interesting and fun than the majority of 3D action games out there. If the combat weren't so entertaining, then New Legends wouldn't really have anything else to fall back on. The graphics in the game are pretty substandard--the blurry textures look as though they belong in a Nintendo 64 game, and with the exception of Sun and Talos, who look good, most of the character models are disappointing. The graphical highlights of the game lie in Sun's martial arts attack animations, some of which look great. Unlike Sun's moves, most of the levels are bland, but there are a few surprising moments that help keep you on your toes. The game's inconsistent frame rate also becomes somewhat of a problem since it can disrupt the timing on your combinations, but nothing is more irritating than the game's disc-accessing times. At random points in the game, you'll hear your Xbox accessing the disc, which inexplicably causes the game to stop for a few seconds and then continue. Part of the problem has to do with New Legends' music. The soundtrack fits the theme of the game incredibly well, but there are long stretches where the music stops playing entirely and then suddenly starts up again, causing the game to stop dead for a few seconds. Otherwise the sound is solid and features some decent voice acting and plenty of effects to accompany different weapon attacks. New Legends spent a long time in development. But after playing through it, you'll likely feel that if Infinite Machine had only had a little more time to work on New Legends, it could have easily been one of the must-have games for the Xbox. The combat is certainly fun, but not to the extent that you can overlook some of New Legends' other problems, like its camera issues and its short length. The game lasts only a little longer than five hours and lacks any extra features. Once you've finished playing the game, you probably won't have much incentive to play it again."}