{"ref": "https://www.gamespot.com/reviews/airblade-review/1900-2843768/", "date": "May 17, 2006", "game_name": "AirBlade", "text": "Criterion Games, the team behind AirBlade and the developer of the much-licensed Renderware engine, is no stranger to hoverboard games. TrickStyle, its previous take on the genre, was easy on the eyes but became tedious quickly. Having learned from its mistakes, Criterion brings AirBlade to the PlayStation 2 with significantly better results.AirBlade's story mode kicks off with some corporate bad guys busting into your house and kidnapping your roommate, Oscar. It seems that right before quitting his job as a scientist for the big bad GCP Corporation, Oscar stole a prototype hoverboard made with technology that could render fossil fuels obsolete, and his former employers want it back. It's up to you as the vaguely counterculture Ethan to use the hoverboard, dubbed the AirBlade, to rescue Oscar and turn the GCP's operations upside down. The premise is pretty weak, and the subsequent in-game movies contain plenty of sophomoric ~stick it to The Man~ sentiments that culminate in a rather anticlimactic conclusion. But thankfully, AirBlade puts a greater emphasis on gameplay than it does on back story.Taking a page from the rest of the Tony Hawk-inspired action-sports games out there, the main story mode in AirBlade is mission-based. This means that each level has a set number of objectives, such as knocking over GCP thugs, smashing through wanted signs with your picture on them, or destroying various pieces of GCP equipment, all of which you must complete before your allotted time runs out. The time limit adds a certain urgency to the game, as you'll need to complete every objective in a single run in order to advance to the next level. It also can also make the game exceptionally frustrating, as it can take a lot of trial and error to figure out how to complete all the objectives, making it necessary to run through most levels several times. This is compounded by the game's brutal difficulty level, which ramps up significantly by the third level. Sometimes this level of challenge will make it that much more satisfying when you complete a level; other times, it'll inspire you to throw the controller at the screen. As hard as AirBlade is, the main story mode consists of only six levels, and it shouldn't take most players too long to complete it.The other single-player modes are slightly more conventional. The stunt attack mode gives you performance-specific goals to complete, like pulling off an especially long grind or a big trick combo, before letting you advance to the next level. Score attack, which also serves as a multiplayer mode, simply challenges you to beat certain level scores. AirBlade also features four multiplayer-specific modes. There's trick list, in which players compete to perform specific tricks before the other. In ribbon tag, an altered version of king of the hill, the objective is to hold on to a piece of ribbon longer than your opponent. The longer you have the ribbon, however, the longer it gets, making it that much easier for your opponent to grab it from you. In show off mode, players are scored based on big air and big combos. The party mode is the most unique of AirBlade's multiplayer modes, allowing up to eight players compete in a round-robin-style score competition. Each player is given one minute to score as many points as he or she can, and whoever has the lowest score at the end of the round is eliminated. This goes on until there's only one person left standing. Any of these modes can be a satisfactory diversion, though they're not the main attraction.At first glance, the gameplay in AirBlade bears a great resemblance to that of the ubiquitous Tony Hawk games, though there are a few key differences. Since your hoverboard never touches the ground, it's possible to perform flip tricks without jumping first. When you're grinding a rail, tapping the L1 or R1 button quickly will cause you to start spinning, which will increase your speed but make balancing on the rail slightly trickier. There is also a boost meter that fills up as you do tricks, and it can be tapped to give you more speed on the ground or more airtime on your jumps. The most unique feature is AirBlade's grab mechanic, which lets you grab on to any vertical or horizontal bar and spin around it. This mechanic is vital to the gameplay, as each level is designed in a way that makes it necessary to pull off multiple bar-to-bar swings in order to complete many mission objectives in the single-player mode. The gameplay may feel a little floaty if you're coming fresh off a straight skateboarding game, but it's fitting for a hoverboard game, and once you've adjusted to it, it doesn't really hinder the experience. Using Criterion's own Renderware engine, AirBlade handles the graphics well. The environments are all large multitiered affairs populated with an appropriate number of rails, ramps, and half-pipes. The levels are also busy with pedestrians who, much like real-life pedestrians, don't much care for it when you race by them on your hoverboard, and they'll tell you so regularly. Ethan's trick animations all look good, and there are a few nice smaller touches, such as the dust that kicks up behind your hoverboard. The environmental textures are generally large and clean, though they have a tendency to look a little flat, and Ethan's skin tone just doesn't look right. The frame rate in the single-player modes is rock-solid, though it drops significantly in multiplayer games. Considering the precedent set by previous action-sports titles, it's a bit surprising that AirBlade features entirely original music. The soundtrack is a decent enough mix of hip-hop beats and dance music, but with only one music track for each level, it can get repetitive after extended play. The environmental sounds are fairly sparse, consisting mostly of the low hum of your hoverboard and a few pedestrian exclamations that seem to be repeated more often than they should be. In all, the aural presentation in AirBlade is passable, though it's definitely not the game's strongest point. AirBlade is an infinitely more polished game than TrickStyle, though there is still plenty of room for improvement. The level of difficulty and the limited number of levels make the game feel artificially hard, as if the developers were trying to compensate for the game's shortness. Even with its flaws, AirBlade is a fun, entirely playable game that puts a unique twist on the current trend in skateboarding games. If you're a fan of the genre looking for something new, AirBlade fits the bill.At first glance, the gameplay in AirBlade bears a great resemblance to that of the ubiquitous Tony Hawk games, though there are a few key differences. Since your hoverboard never touches the ground, it's possible to perform flip tricks without jumping first. When you're grinding a rail, tapping the L1 or R1 button quickly will cause you to start spinning, which will increase your speed but make balancing on the rail slightly trickier. There is also a boost meter that fills up as you do tricks, and it can be tapped to give you more speed on the ground or more airtime on your jumps. The most unique feature is AirBlade's grab mechanic, which lets you grab on to any vertical or horizontal bar and spin around it. This mechanic is vital to the gameplay, as each level is designed in a way that makes it necessary to pull off multiple bar-to-bar swings in order to complete many mission objectives in the single-player mode. The gameplay may feel a little floaty if you're coming fresh off a straight skateboarding game, but it's fitting for a hoverboard game, and once you've adjusted to it, it doesn't really hinder the experience. Using Criterion's own Renderware engine, AirBlade handles the graphics well. The environments are all large multitiered affairs populated with an appropriate number of rails, ramps, and half-pipes. The levels are also busy with pedestrians who, much like real-life pedestrians, don't much care for it when you race by them on your hoverboard, and they'll tell you so regularly. Ethan's trick animations all look good, and there are a few nice smaller touches, such as the dust that kicks up behind your hoverboard. The environmental textures are generally large and clean, though they have a tendency to look a little flat, and Ethan's skin tone just doesn't look right. The frame rate in the single-player modes is rock-solid, though it drops significantly in multiplayer games.Considering the precedent set by previous action-sports titles, it's a bit surprising that AirBlade features entirely original music. The soundtrack is a decent enough mix of hip-hop beats and dance music, but with only one music track for each level, it can get repetitive after extended play. The environmental sounds are fairly sparse, consisting mostly of the low hum of your hoverboard and a few pedestrian exclamations that seem to be repeated more often than they should be. In all, the aural presentation in AirBlade is passable, though it's definitely not the game's strongest point.AirBlade is an infinitely more polished game than TrickStyle, though there is still plenty of room for improvement. The level of difficulty and the limited number of levels make the game feel artificially hard, as if the developers were trying to compensate for the game's shortness. Even with its flaws, AirBlade is a fun, entirely playable game that puts a unique twist on the current trend in skateboarding games. If you're a fan of the genre looking for something new, AirBlade fits the bill."}