{"ref": "https://www.gamespot.com/reviews/jedi-starfighter/1900-2865432/", "date": "May 17, 2006", "game_name": "Star Wars: Jedi Starfighter", "text": "Jedi Starfighter is the second Starfighter game to appear on the Xbox, and like its predecessor, it's an action-packed shooting game set in the Star Wars universe. The earlier Xbox release of Starfighter Special Edition was an enhanced version of the original PlayStation 2 game. Unfortunately, Jedi Starfighter didn't receive the same special treatment as its predecessor, though some steps have been taken toward optimizing the game to run better on the Xbox. Jedi Starfighter continues the story of Nym, one of the characters from the original game, and drops the other two in favor of a new character, Adi Gallia, a Jedi master with force powers. The loss of the other two peripheral characters allowed LucasArts to focus the storyline on Nym and Adi and give you more time with each. As a result, the new storyline can be quite engaging, and while the game plays almost identically to the original, a few improvements have been made in that regard as well. However, that's not to say that the game is without its share of flaws. Ultimately, the Xbox version is essentially identical to the PlayStation 2 version, and it shows. You'll begin the game by taking the role of Adi Gallia, formerly a padawan learner under Mace Windu, Samuel L. Jackson's character from Episode I and Episode II--a notable Jedi master and member of the Jedi Council. In the game, Mace Windu has caught wind of a plot to draw star systems away from the influence of the Republic, which is being orchestrated by a mysterious character named Count Dooku. Such a defection would diminish the Republic's power and reduce the influence of the Jedi Council. Dooku enlists the help of Cavic Toth, a wicked man bent on taking control of the Karthak system and its rich natural resources to further his plan. Toth begins his power play in earnest by enlisting the help of the Trade Federation and a group of mercenaries known as the Saboath to help with the invasion of Karthak. As Adi Gallia, you're charged with preventing this invasion, as the majority of the Jedi are drawn away into other mysterious events, revealed in Star Wars Episode II. One of the first things you'll do as Adi Gallia is enlist the help of Nym, who joins in the fight in the same reluctant way that Han Solo did in the classic movies. The Jedi Starfighter is a new craft that is introduced in Episode II. Sleek and triangular, it's a craft of simple yet effective design. Rather than using a set of secondary weapons like Nym's Havoc, the Jedi Starfighter offers only basic lasers and agile maneuvering. Adi Gallia's proficiency in the use of the force makes up for the lack of alternate weapons, however. Initially, you'll have a force shield available, which, as you might have guessed, brings up a protective field that prevents damage to your ship for a limited amount of time. Later, you'll gain force lightning, which emits a powerful electric blast that can arc from ship to ship, causing more damage. This attack works only on smaller craft, as the larger ships are more insulated and therefore immune to it. Much later in the game, you'll gain force reflex and force shock wave, which offer more powerful offensive and defensive effects. Force reflex slows time and lets you inflict more damage on enemies, as well as increase the maneuverability of your ship. Force shock wave sends out a circular blast that damages all enemies in your immediate vicinity. In the missions where you find yourself flying as Nym, you'll have the powerful Havoc spacecraft at your disposal. Almost the polar opposite of Adi's Jedi Starfighter, the Havoc is a beast, with less maneuverability and much more armor. The ship also has a wider variety of secondary weapons that improve as you progress. You'll start off with an unlimited supply of energy bombs that will slowly replenish as you use them up. As time goes on, you'll acquire powerful missiles, proximity mines, and cluster seeker missiles as well. Toward the end of the game, you'll even gain control over a planetary cannon, which is particularly devastating when used against larger and slower targets such as Trade Federation frigates and missile boats. This weapon is quite entertaining as well, due to the fact that it feels as if you have a miniature Death Star at your command. The control in the game is almost identical to the setup used in the first game, with a few additions. Instead of just using the directional pad to issue commands to your wingmates, as you did in the first game, you'll also use it to select your secondary weapons, whether they're Adi's force powers or Nym's bombs and missiles. As far as targeting enemies is concerned, you just hold down the Y button to highlight all enemies currently onscreen with a red indicator and then bring your targeting reticule to bear over a selected enemy. You can cycle through enemy targets by pressing the black button repeatedly--doing so brings up the nearest enemy or the last one to shoot you. Unfortunately, despite the two different buttons dedicated to targeting, you'll often find yourself frantically pressing the black button as you try to bring up targets that aren't immediately visible. This can be frustrating if you're searching for an essential target, and it can cause you to fail to achieve some of the bonus objectives on occasions. In the worst-case scenario, you'll even fail a mission altogether as a result of this.In spite of the control issues, the actual mechanics of the targeting interface are one of the most intuitive aspects of the game. The setup will give you access to important information in a quick and easy manner. The targeting indicator reflects the shield and hull integrity of enemy or allied craft. In addition to this, while using the Y button to target multiple enemies, the indicators surrounding enemies will fade from near-transparency to being brightly lit, depending on the enemy's distance from your current location. Yellow brackets also pop up around any ship that is currently broadcasting communications. Your targeting reticule changes shape according to the secondary weapon you have selected as well, allowing you to know which weapon you have selected at a glance without having to look down at your HUD, which occupies the lower corners of the screen. It can be frustrating trying to cycle through enemy targets. As was the case in the PlayStation 2 version, the graphics are probably the weakest point of the game--but more so on the Xbox, where you've come to expect superior graphics. Visually, Jedi Starfighter was a decent-looking PS2 game with some frame rate issues. On the Xbox, it still looks like a decent PS2 game, though the frame rate problems have been improved somewhat. The game runs more smoothly, despite the frame rate still getting jumpy on occasion, but for the most part, it's much better than the PS2 in that regard. Ship models and terrain are decent, but they are outfitted with bland textures that take away from the overall visual appeal. This is compounded by the ability to zoom in on targets, which makes for an even less savory view when you're up close and personal. One improvement seen in the Xbox version is the use of colored lighting. For example, in the first mission, you find yourself meeting a contact outside a red nebula. The nebula casts off a red glow that bathes your ship in a dark red light and makes the level much more moody and atmospheric. Your ship also casts shadows on itself as a result of the lighting. The effect is quite nice when it's used; unfortunately, though, it seems restricted to only a handful of missions. The sound is what you would expect from a LucasArts game, complete with all the appropriate sound effects. The soundtrack is a mix of the Episode I music, along with a few new tracks. The voice work for all of the speaking characters in the game is well done, but as was an issue with the first game, there are only a few different responses you'll hear repeatedly. However, there is a significant amount of scripted dialogue that takes place in each mission, and some of the radio chatter is quite good and helps move the story and mission at hand along rather nicely. Another thing that Jedi Starfighter has going for it is the two-player mode, in which you have missions designed for two players and can play the game through entirely in a split-screen co-op mode. In co-op mode, there are more ships to initially choose from. In addition to the Havoc and the Jedi Starfighter, you'll have access to the ships piloted by allies in the regular missions. The two-player-specific levels act, for the most part, as they would in co-op mode, but in some missions, you can divide control of the Advanced Havoc, an improved version of Nym's regular ship. In this mode, one player assumes control of the ship, while another mans a turret that has been added to the top of the craft. A new mission has also been added to the Xbox version. In it, two players fight for control over platforms, which are tagged when either of the players shoots them. The mission takes place on the busy city-planet of Coruscant and sports hi-res textures that are of a much higher quality than those seen in the rest of the game. It's a small bonus for Xbox owners, but a bonus nonetheless. Jedi Jedi Starfighter offers a two-player mode and other extras for good measure. Along with the two-player modes, there are a handful of single-player missions that can be unlocked and played outside of the game's main story mode. Each mission in the story mode has a list of required objectives that you must complete to finish the mission, but there are bonus and hidden objectives lurking in each mission too. Achieving these objectives will unlock up to nine more ships for use in the story mode (several of which will please fans of the classic movies and games), new single-player and multiplayer missions, and DVD-style extras. Some of these extras include trailers for upcoming and recently released LucasArts games, concept art, team photos, and a gag reel like the one seen during the end credits of A Bug's Life, Pixar's computer-animated movie. In the end, Star Wars: Starfighter is a solid game that fans of the previous entry in the series should check out without giving it a second thought. While it's not the prettiest Xbox game out there, let alone the best-looking Star Wars game, it does offer good control and entertaining gameplay, as well as the sound and music we've come to expect from a Star Wars game. These merits combined with the multitude of ships and missions that can be unlocked through extensive play further add to the value of Jedi Starfighter, a good Star Wars game that's not quite great.In spite of the control issues, the actual mechanics of the targeting interface are one of the most intuitive aspects of the game. The setup will give you access to important information in a quick and easy manner. The targeting indicator reflects the shield and hull integrity of enemy or allied craft. In addition to this, while using the Y button to target multiple enemies, the indicators surrounding enemies will fade from near-transparency to being brightly lit, depending on the enemy's distance from your current location. Yellow brackets also pop up around any ship that is currently broadcasting communications. Your targeting reticule changes shape according to the secondary weapon you have selected as well, allowing you to know which weapon you have selected at a glance without having to look down at your HUD, which occupies the lower corners of the screen. As was the case in the PlayStation 2 version, the graphics are probably the weakest point of the game--but more so on the Xbox, where you've come to expect superior graphics. Visually, Jedi Starfighter was a decent-looking PS2 game with some frame rate issues. On the Xbox, it still looks like a decent PS2 game, though the frame rate problems have been improved somewhat. The game runs more smoothly, despite the frame rate still getting jumpy on occasion, but for the most part, it's much better than the PS2 in that regard. Ship models and terrain are decent, but they are outfitted with bland textures that take away from the overall visual appeal. This is compounded by the ability to zoom in on targets, which makes for an even less savory view when you're up close and personal. One improvement seen in the Xbox version is the use of colored lighting. For example, in the first mission, you find yourself meeting a contact outside a red nebula. The nebula casts off a red glow that bathes your ship in a dark red light and makes the level much more moody and atmospheric. Your ship also casts shadows on itself as a result of the lighting. The effect is quite nice when it's used; unfortunately, though, it seems restricted to only a handful of missions. The sound is what you would expect from a LucasArts game, complete with all the appropriate sound effects. The soundtrack is a mix of the Episode I music, along with a few new tracks. The voice work for all of the speaking characters in the game is well done, but as was an issue with the first game, there are only a few different responses you'll hear repeatedly. However, there is a significant amount of scripted dialogue that takes place in each mission, and some of the radio chatter is quite good and helps move the story and mission at hand along rather nicely. Another thing that Jedi Starfighter has going for it is the two-player mode, in which you have missions designed for two players and can play the game through entirely in a split-screen co-op mode. In co-op mode, there are more ships to initially choose from. In addition to the Havoc and the Jedi Starfighter, you'll have access to the ships piloted by allies in the regular missions. The two-player-specific levels act, for the most part, as they would in co-op mode, but in some missions, you can divide control of the Advanced Havoc, an improved version of Nym's regular ship. In this mode, one player assumes control of the ship, while another mans a turret that has been added to the top of the craft. A new mission has also been added to the Xbox version. In it, two players fight for control over platforms, which are tagged when either of the players shoots them. The mission takes place on the busy city-planet of Coruscant and sports hi-res textures that are of a much higher quality than those seen in the rest of the game. It's a small bonus for Xbox owners, but a bonus nonetheless. Along with the two-player modes, there are a handful of single-player missions that can be unlocked and played outside of the game's main story mode. Each mission in the story mode has a list of required objectives that you must complete to finish the mission, but there are bonus and hidden objectives lurking in each mission too. Achieving these objectives will unlock up to nine more ships for use in the story mode (several of which will please fans of the classic movies and games), new single-player and multiplayer missions, and DVD-style extras. Some of these extras include trailers for upcoming and recently released LucasArts games, concept art, team photos, and a gag reel like the one seen during the end credits of A Bug's Life, Pixar's computer-animated movie. In the end, Star Wars: Starfighter is a solid game that fans of the previous entry in the series should check out without giving it a second thought. While it's not the prettiest Xbox game out there, let alone the best-looking Star Wars game, it does offer good control and entertaining gameplay, as well as the sound and music we've come to expect from a Star Wars game. These merits combined with the multitude of ships and missions that can be unlocked through extensive play further add to the value of Jedi Starfighter, a good Star Wars game that's not quite great."}