{"ref": "https://www.gamespot.com/reviews/tna-impact-review/1900-6197534/", "date": "September 10, 2008", "game_name": "TNA iMPACT!", "text": "Professional wrestling has long been maligned and celebrated as a place where spandex-clad ogre-men go to act out contrived rivalries and pretend to actually wrestle. While these simplifications certainly hit on some truths about ~sports entertainment,~ the remarkable talents and impressive athleticism of its practitioners cannot be denied. If you're the kind of person who enjoys the high-flying, hard-hitting spectacle of pro wrestling in spite of its myriad absurdities, then TNA Impact may be the game for you. It has some aggravating problems, but it does a great job of translating the excitement of TNA Wrestling into fluid action and visceral fun. A wrestling game is only as fun as the moves you can perform, and in this regard, TNA Impact does quite well. You ratchet up your basic punch and kick attacks by holding the strong modifier or by performing them from a run or in a grapple. This simple layering allows for a wide range of moves without requiring complex button combinations, so it's easy to unleash your nastiest attacks right from the get-go. Each move makes you feel powerful, from a backhand that sends your opponent staggering to a DDT that lays him out. You can also reverse almost any attack with a well-timed button press, and many reversals can be reversed again. The accessible variety of attacks, the crashing impact of each clout, and the ever-looming possibility of reversals make the action fast, furious, and fun. You need a javascript enabled browser to watch videos. Want us to remember this setting for all your devices? Sign up or Sign in now! By clicking 'enter', you agree to GameSpot's Terms of Use and Privacy PolicyenterNow Playing: TNA iMPACT! Video Review 1 AJ Styles goes about liberating some of Shark Boy's teeth. The more you mix up your moves, the more likely you are to come across some of the game's many technical hitches. When the animations run smoothly, they look great and produce exceedingly satisfying impacts. When they don't quite line up, you see fists and feet clipping through torsos, as well as apparent misses registering as hits. These oddities, common to most modern wrestling games, are a minor distraction, and won't hinder your pugilistic endeavors. The more frustrating glitches cause your character to perform unintended maneuvers, often with disastrous results. These are prone to surface in a few situations, the most frequent of which are transitions, such as when your character is getting up off the mat, climbing a turnbuckle, or exiting the ring. Because your attack changes depending on your opponent's position, you may often find yourself aiming to punch an enemy as soon as he stands up, only to execute an elbow drop and lay yourself out at his stomp-happy feet. You can also dodge grapples or attacks when you're near the edge of the ring because the animation of rolling out of the ring will often negate incoming moves. Then, there's the particularly tricky situation when your opponent is down near the edge of the ring. Climbing up on the turnbuckle, rolling out of the ring, and pinning an opponent are all mapped to the same button, which makes it very difficult to figure out how to position yourself to execute the action you want. In this case, you're better off avoiding those three actions altogether. When you're playing against other human players, these hang-ups don't feel so frustrating because you are all subject to the same pitfalls. Everyone can take advantage of each others' missteps and laugh about it. Even on moderate difficulty levels, you can still suffer a few miscues and scrape out a win. However, as you play through the single-player Story mode, you'll eventually hit a wall. As the foes get tougher, the room for error diminishes so much so that one missed move or missed opportunity can cost you the match. This is vexing enough when it's an honest mistake, but it becomes downright infuriating when it's an animation glitch. The Story mode begins when you design a new wrestler using the fairly robust character creator. You then fight your way through a serviceable plot that is pretty much par for the pro wrestling course. The voice acting is lackluster and feels somewhat flat in contrast with the vigorous banter featured on the actual show, but the real shame is that the actor who voices your wrestler is just awful. His performance casts a shadow on the TNA stars, one you should try to shake off by checking out the training videos featured in the extras menu (the short ring entrances probably won't do much for you). The real incentive to play the Story mode is to unlock new characters, moves, and arenas. You do this by earning style points in each match. The riskier and more varied your moves are, the more points you'll earn, which is a nice motivation to mix things up. Equipping more impressive moves is fun, though each time you want to change your move set, you'll have to reenter character-customization tool and sit through a long save time. Samoa Joe uses a chair to smack Sting right in the face paint. Multiplayer is the best way to enjoy TNA Impact, and there's a wide array of match types. One-on-one matches, three-way free-for-alls, four-player tag-team brawls, handicap contests, and the signature Ultimate X matches are all playable locally, though the online selection is a bit more limited. Ultimate X matches, while dramatic on television, often feel less exciting than normal matches because the focus becomes staying aloft on the cables rather than pummeling your opponents. There's nothing unexciting about that per se, but the hanging combat is awkward and limited. Actually grabbing the X also requires you to tap a button when a moving cursor lines up with a target area--an action that could be diplomatically described as ~anticlimactic.~ Additionally, online matches are sometimes hindered by lag, which can make pulling off reversals, grabbing the X, and getting out of pins trickier than usual. So, TNA Impact is not without its flaws. The character models are excellent while the animation is fluid and lively, but the physics of fighting definitely lack polish and can create some frustrating situations. Yet despite these technical shortcomings, it's still great fun to clothesline, drop kick, and power bomb your friends in and out of the ring. And, ultimately, isn't that what pro wrestling is all about?"}