{"ref": "https://www.eurogamer.net/her-story-review", "date": "29 Jun 2015", "game_name": "Her Story", "text": "Editor's note: Our review is very light on narrative details, but if you want to head into Her Story with completely fresh eyes be warned there are very mild spoilers below.During the summer of June 1994 Hannah Smith reported her husband, Simon, as missing. The missing person file was, shortly thereafter, stamped with murder. We don't know whether or not the case was solved at the time, but in Her Story, the latest game from Sam Barlow - designer of Aisle and Silent Hill: Shattered Memories - you're given access to the historic interview tapes. The database, a mess buried inside the tape archive at Portsmouth police station's homicide department, holds close to three hundred individual clips, spliced from a series of interview sessions with detectives, held during the summer of 1994. You cannot access the clips in chronological sequence. Rather, you must use search terms to query the database. If your chosen term, such as ~Robbery~ or ~Yes, I was there~ appears in the transcript of one or more clips in the database, they are presented for viewing.In this way you begin to dredge through the archive, gradually piecing together the bones of a story about what happened during those weeks. While the information you receive has no particular chronology, something of a meaningful arc emerges naturally, as you use scraps of detail from one clip to inform your next search term. Hannah might mention the name of a co-worker, or of a place that the couple liked to visit, and you hurriedly tap the term into the waiting box, in the hope that it'll fill in further, somehow related blanks.You fire search terms at the game in the same way that one fires missiles at co-ordinates in a game of Battleships, hoping to hit a target through a combination of guesswork and clues that guide your strikes. ~Hope~ might turn up just a single entry, but if the snippet is short, with only a few words of monologue, then it can be a valuable hit. ~Simon,~ by contrast, returns 61 results. As you are only ever able to view the first five clips of any popular search term, you'll need to find less common words and phrases to wheedle out the more obscure clips. Your progress can be checked at any time, by using a desktop application that visualises which of the 271 clips in the database you've viewed, and which remain unseen. This graphical representation intensifies the feeling that you're playing a game of hide and seek. Indeed, you are hunting for the truth on more than one axis. And in this aim you must remain vigilant, taking notes on a scrap of paper, perhaps even dragging family trees and relationship diagrams. In this way, the game not only casts you in the role of amateur sleuth, it also inspires you to think and act like a detective at work.As you uncover information, two timelines begin to accumulate in your mind. Firstly, the sequence of events that happened in this woman's life, from her childhood up to the murder of her husband. As you dart back and forth in her history, you construct a collage from the snippets. Details lock into place, allowing you to contextualise, with greater accuracy, every new piece of information and recollection. And secondly, you build up the sequence in which the story was told to the police during the course of a few weeks in the summer of 1994, pieced together from the tapes themselves, with the subject's breezy changes of clothes and hairdo, and, of course, the flickering time stamp, which grounds everything in the context of the calendar, a reassuring foothold into which you can put your full trust, where everything else inspires caution and doubt.The period setting is emphasised by a mixture of aesthetic (the CRT scan lines on the monitor that frames the entire game, the references in the monologues to Ceefax, Lloyd Grossman and Amstrad computers, the Windows 95 operating system). 1994 is an ideal time period in which to set this exact game. The technology of the time was nascent enough to make the clumsiness of the database and its ludicrous means of interface appear realistic. And 1994 is also far enough away to infuse the experience with an eerie nostalgia, the sense that this is an old dusty case file, filled with details of long faded intrigue, forgotten love affairs, and ghosted dinner parties. Like all good thrillers, Her Story issues the odd revelation that changes the way in which you view everything that has come before. What's extraordinary is the way in which these twists manage to be effective, when nobody - including the designer, Barlow - has orchestrated their timing. It runs contrary to the rules of conventional storytelling, and its armoury of devices such as foreshadowing and flashbacks. Barlow cannot have known how well the technique would have worked before he started work on the project. The experience is admittedly different to that of a well-constructed detective novel, or carefully charted HBO thriller, but the effects are similar. You are captivated, manipulated and spun around by the plot. Perhaps, in an era where filmmakers so keenly play with chronology, and regularly leave conclusions unwrapped, we are prepared for this kind of patchwork narrative, which leaves you, mostly, to draw your own conclusion of what really happened by the end. Or perhaps it would always have worked this well. Regardless, Her Story is a singular, unfamiliar work, essential viewing for both filmmakers and game designers."}