{"ref": "https://www.eurogamer.net/batman-arkham-knight-review-4", "date": "23 Jun 2015", "game_name": "Batman: Arkham Knight", "text": "Arkham Knight opens with a spoiler, and it sets the tone for what is to come. This is that rare beast: a blockbuster game with plot twists that matter and narrative flourishes you'll want to experience rather than skipping every cut scene.That first spoiler is open season, though, since it's a spoiler for 2011's Arkham City and if you've not even played that, why are you reading this?So, we open on The Joker's dead body, and the game wastes no time in reassuring fans that this isn't a fake out. The very first thing that happens when you touch the controls is that the furnace fires up to cremate the Crown Prince of Crime. That's it. He's ash. Gone for good. The next thing you do is step into the first-person shoes of a Gotham beat cop who stops at a diner for waffles and bacon - ~Don't tell my wife~ he pleads with the waitress - before Scarecrow turns the scene into a nightmare with a souped-up version of his toxic fear gas.From there things get more familiar, as Scarecrow threatens to dose the whole city, prompting a mass evacuation. Once again, the criminals take over and the camera pans up from the chaos on the streets to Batman, watching from the rooftops, ready for you to take control and start putting things right.It's worth lingering on those opening scenes though, as they better illustrate what Rocksteady is doing than the polished but largely predictable core gameplay. This is a game with lofty ideas. It's a psychological character study wrapped up in a modern sandbox action adventure. The moment by moment business at hand may involve heading to waypoint markers and progressing multiple quest lines through combat, stealth and puzzle solving, but the game is really a culmination of storylines that begun in 2009's Arkham Asylum.This is a game about Batman unravelling, partly because of Scarecrow's gas, partly because of the ruthless machinations of the mysterious Arkham Knight who always seems to know what the Caped Crusader will do next, but mostly because this is Batman as an almost literally haunted figure; a man so weighed down by the toll his vigilante career has on himself and those around him, that making it through this night of madness feels like a trial worthy of Orpheus.The ways in which this seeping madness is portrayed lead us too far into spoiler territory for a review, but suffice to say that much like the Arkham Knight himself, Rocksteady knows what you're thinking and is almost always one step ahead of you. Those occasional flourishes of surreal genius from Arkham Asylum, the moments of meta-textual insanity where you realise the medium of gaming itself is being used to bamboozle you, they take full flight here and the result is bracing, thrilling video game narrative that could only ever work with joypad in hand. It's not often you get to say that about a AAA franchise title, and it's an achievement worth celebrating.Between those flourishes, however, is a game that fans will already know well. The combat, the gadgets, the grapple-and-glide traversal are all pretty much exactly as you remember. So too are the puzzles, the batarangs that must be guided to switches and the trails that must be followed using your cowl's Detective Vision. There are a handful of moments where you get to fight alongside other Batman characters, swapping between them with a button press and setting up tag team takedowns, but it's less of a new feature and more of a fan-baiting twist on a tried and trusted mechanic.The only truly new addition is the Batmobile, and it improves the game in notable ways. Most obviously, it simply makes Gotham a more enjoyable place to navigate. The Arkham City of 2011 could become a chore to get around, thanks to respawning gangs of thugs on every corner and cramped streets, ensuring that every time your boots touched asphalt you'd usually end up embroiled in yet another scrap for no reason.Now, with a prod of the shoulder button, you can summon the Batmobile and drive from place to place at high speed. That means the streets are wider, the junctions are more open, and it feels more like an actual city, albeit one where we still don't get to see any normal everyday civilian life. The Batmobile can be used for pursuits, which crib from Burnout of all things. Sideswiping the Arkham Knight's unmanned tank drones into walls for slow motion takedowns, and using lock-on missiles to destroy the ones in front, it's an experience that feels genuinely fresh - for the Batman series if not gaming in general. Control is nicely tuned as well, a little skittish at first but soon responsive enough that you can throw the Batmobile into sharp turns and off ramps with aplomb. There are even story mode puzzles that make use of the vehicle's gadgetry and guns.The Batmobile's other mode is more like a hovercraft, activating the cannons and allowing you to glide and strafe in every direction. It's in this mode that you'll handle most of your vehicle engagements, dodging the sight lines of enemy units and pounding away at their armour with your weaponry. It's fun enough, in small doses, but sadly the game often opts for increasingly larger doses. Some of the later story missions are a real grind to get through, as you blast away at dozens of tanks while your armour chips away, and the game's worst boss fights also make excessive use of the tank mode.Yet elsewhere, Rocksteady shows shrewd restraint. Although the overall structure of the game superficially resembles that of Ubisoft's many open world franchises, with a sprawling map dotted with markers and a surplus of stuff to find, the way it is packaged up makes it much more digestible.Batman has multiple situations on the go at the same time, understandably since Gotham is once again mired in criminal anarchy. Penguin is running guns all over the city while Two Face is on a spree of bank robberies. Riddler has kidnapped Catwoman, Firefly is burning down fire stations, and a mysterious serial killer is crucifying bodies all over town. Progress in each of these secondary quest lines becomes available at well-judged intervals, rather than simply throwing everything at you in lumps, and they tell effective little stories of their own. As one problem is dealt with, another comes back to the boil. A simple but effective mission wheel means you can instantly see where you're up to with each set of missions, and when there's new progress to be made.Beyond those story-driven diversions, there's the expected array of additional jobs to tick off: gang outposts to take down, observation towers to cripple, convoys to eradicate and bombs embedded in the streets that must be defused. There are also over 200 Riddler trophies to find, though like the side quests these are not as intrusive as in Arkham City. They're available for those completists who want to find and tackle them, but they no longer cover every rooftop and wall with their taunting green glow. One thing that certainly comes across is how incredibly complex this series has become. As you trade in your XP for more and more abilities, so the control scheme expands exponentially. There are multiple button combinations for the Batmobile in both modes, different combos to use when both gliding and grappling, when sneaking and stealthing, and especially when fighting. Though the basic combat is still built around the attack-and counter rhythm of old, Batman probably has more move inputs in this game than he did in the Injustice fighting game. Combos to use different gadgets in combat, combos for when facing giant enemies, enemies with blades, enemies with shields or electric batons, enemies with guns...It's only occasionally overwhelming, but even then it makes sense that the control map looks more like something from a flight simulator than an arcade game, since what is this game if not the ultimate Batman sim? There have been plenty of comic book games that have faithfully recreated popular characters and their most famous abilities, but Rocksteady understands - and has understood since 2009 - that it's only by combining multiple elements in very specific ways that you really put the player in the costume.This is a game that knows you want to feel like ninja and a detective. As familiar as Arkham Knight is, it still triggers that same giddy thrill as you perch on a ledge before leaping off, cape fluttering, into the night. It doesn't matter how many times you repeat it, because in that moment you are, always and forever, the goddam Batman.If the game has a weak point, it's unfortunately the villain of the title. The Arkham Knight, as a character, is a wash out. By turns gruff and petulant, his one-note militaristic antagonism is bland and forgettable when stacked up against Batman's usual rogue's gallery, and the mystery of his identity is such an anti-climax that you'll feel stupid for ever investing any thought in it.That, and the stodgy boss battles that dominate the final stretch of the story, are all that hold Arkham Knight back from being an essential purchase. What's frustrating as a reviewer is that the stuff that really elevates the game, and will sear it into your memory, is the stuff that can't really be talked about. There are major elements of the game that I'm itching to talk about, story decisions brought to life in ways that are quite brilliant, but I'll bite my tongue.At a time when licensed games are rare, and licensed games that are willing to radically impact their source material rarer still, and when blockbuster games prefer to play it safe rather than getting seriously weird and inventive in the way they tell their stories, Arkham Knight bucks the trends in all the best ways.The gameplay is good, and very often great, but we knew that already. It's a known quantity. As a Batman story, this is something else. It dares to tackle not just the surface details of the character, but explores his psyche. It portrays him as, frankly, kind of a dick and also as a man of unflinching honour. The Batman of Arkham Knight is a complex, contradictory figure, a hero with real depth and dimension, and we get to wear the iconic cowl for one last mind-boggling night of mayhem. Miss out on that? You must be joking.Editor's note: For the purposes of this review we tested retail code on both Xbox One and PS4. Digital Foundry is currently looking into the reportedly compromised PC version, and will be publishing its findings later in the week."}