{"ref": "https://www.eurogamer.net/monstrum-review", "date": "27 May 2015", "game_name": "Monstrum", "text": "Ships are the perfect location for horror, yet they're rarely used. There's the occasional movie, a couple of games, but nine times out of ten you're likely to find yourself poking around in yet another abandoned asylum or a creepy forest.Monstrum understands what makes a ship such a scary place. Totally isolated and painfully claustrophobic, it's an environment from which escape is never as easy as just running out of the front door. From the moment you wake up, the only human on a rusted and drifting cargo vessel in the late 1970s you are, quite literally, stuck between the devil and the deep blue sea.In the case of Monstrum, a first-person ~survival horror labyrinth~ developed by former Abertay students Team Junkfish, there are actually three devils - or monsters, at least - and which one you face is down to random chance. The same is true of the layout of the ship on which you are mysteriously marooned. Each time you play, the decks rearrange themselves.Escape is your solitary goal, and there are several ways to achieve this. You could make for a life raft, try to start the helicopter tethered to the main deck, or else head into the bowels of the ship and try to flee in the submersible, if you can work out how to get it into the water.Each method of escape requires different objects to complete. You'll need bolt cutters to remove the moorings on the helicopter. The life raft is handled by a crane that must be fixed. The sub needs power cells and a replacement headlight (although, when being pursued by a monster, the need to pass your MOT seems excessively fussy). The objects needed to meet these goals are also subject to Monstrum's roguelike qualities, and shuffled and repositioned along with the corridors and rooms. The only constant is that you always start next to a room containing a torch and a fuse.Gameplay, then, takes the form of careful and methodical exploration, checking every room for essential items, as well as other objects that might prove useful: glowsticks, a fire extinguisher or flare gun, or just things like radios and egg timers that can create a distraction. There are also environmental hazards, such as broken steam pipes that can (annoyingly) kill you instantly and security cameras which will sound a monster-alerting alarm if you linger in their frame for too long.It's really all about the monsters though. So much so that revealing too much about them feels like the only thing in the game that could count as a spoiler. The one revealed in screenshots and trailers is The Brute, a shambling muck-monster with gaping, glowing eyes and mouth. There are also creatures known as The Hunter and The Fiend, each of which has its own unique and creepy design, and their own distinctive attack patterns. You'll know The Fiend is nearby, for example, as it disrupts electricity, causing the lights to flicker.This is, inevitably, a ruthless permadeath game. The only things that carry across from one playthrough to the next are the notes you'll find scattered around the ship, filling in the backstory of the strangely absent crew and offering not terribly subtle hints as to what's required to secure the various escape routes. Games can be as brutally short as a few minutes, while a successful escape can take anywhere from 20 to 40 minutes depending on how lucky or cautious you are.It's the luck factor that eventually turns Monstrum from thrillingly sinister exploration adventure into a frustrating crap shoot. The game is so random that there's almost no room for the player to exert any kind of agency or strategy. Which escape plan you opt for depends largely on which useful item you stumble across first, while finding the other items needed to complete the task are basically needles in a haystack. You'll only work out what you need through accumulated failure, but even once you know exactly what to do, your chances of success are governed more by your luck, good or otherwise, with regard to the monster and items.The monsters themselves are genuinely unnerving creations - even if The Brute has a touch of the Scooby Doo about him - but while they apparently have different AI criteria dictating how they hunt you, your encounters with them are almost always the same: walk round a corner, get spotted, run, hide, get found, get killed. The chances to use the ship to your advantage, by locking doors or setting distractions, are minimised by the fact that you have no idea when or where you'll encounter the beast, and when you do it becomes more about outrunning them than outsmarting them.The ship location doesn't help in this regard, offering too many narrow linear corridors and dead end rooms with no hiding places. It's a shame, since it's a fantastic environment, and the no doubt budget-conscious reuse of corridors and rooms lends the game a nightmarish quality, which also turns to frustration as you ferret around for the last elusive thing you need, aware that any encounter with the monster is likely to find you starting over from scratch. Alien Isolation, one of Monstrum's most obvious forebears, works because you come to know the station, which has been designed in such a way that there's always a place to hide or escape route to follow for the player who pays attention. Monstrum's spaces, limited as they are by their need to fit together in infinite ways, too often leave you with nowhere to go.As such, Monstrum works best in the first hour you spend with it. That's when its monsters are still scary, the location is still mysterious and the randomised layouts are still able to excite you with their unknowable nature. It's no surprise that the game has been designed for VR - though it doesn't seem to be implemented yet in this release - as the immersion would certainly help to sustain that initial frisson of genuine terror for a while longer.But that terror does eventually ebb away, sooner rather than later, not because the scares run dry but because progress so often falls to chance. Blundering around identical corridors, hoping to stumble across a solution before being slaughtered, makes for a brilliant one-off experience but is no bedrock for a satisfying long term challenge. There comes a point where the player has to feel some element of control, some sense that they might emerge victorious through their own ingenuity rather than blind luck, and Monstrum offers such moments too inconsistently."}