{"ref": "https://www.eurogamer.net/project-cars-review", "date": "8 May 2015", "game_name": "Project CARS", "text": "Since it was revealed that Project Cars would be coming to consoles as well as PC, it's been touted by both the press and its developer Slightly Mad Studios as an upstart competitor to the big beasts of the console racing game scene, Gran Turismo and Forza Motorsport. In truth, it's something better than that: it's a genuine alternative.GT and Forza structure massive campaigns around a journey from humble production models to elite racing cars, during which you grind out cash to upgrade your vehicles and add to your collection. Project Cars offers something else, something closer to its PC simulator brethren: a fully unlocked and highly customisable playpen of motorsport, with a focus on an intense, purist on-track experience. It's not inherently better, it's just different - very different.The good news travels both ways, because on PC - arguably its heartland - Project Cars can hold its own among the darlings of the enthusiast scene, games like iRacing and Assetto Corsa, while offering something none of them do: a life beyond hot-laps for offline players. With its extensive and rewarding career mode and superior opponent AI, it's the best choice for the solo simulation fan.Earlier this week, I sang the praises of a game that, I feel, ~puts the sport back into motorsport games~ and recalls the mid-2000s heyday of Codemasters' TOCA Race Driver series. Although it does feature a handful of shiny street-legal supercars and track day favourites, Project Cars is a motorsport game at heart - from the pinnacle of Le Mans Prototype sportscar racing down to the scrappy, grease-stained, grassroots milieu of hatchback touring cars, junior single-seaters and go-karts. Although it's lacking in official licences, this is a game with motor racing in its blood.You get two tiers of karting and the fullest representation of open-wheel racing in video games for some time, from the no-frills pocket rockets of Formula Rookie through a series of analogues for real-world series - each more powerful and more loaded with aerodynamic downforce than the last - to the F1-style Formula A. (As part of Slightly Mad's unconventional crowdfunding and crowdsourcing scheme, World of Mass Development, members of the game's community contributed to the design of its unlicensed racing cars.) Over in tin-tops, the range extends from Renault Clio and Ginetta single-make series through several tiers of GT car to the likes of McLaren and Mercedes SLS racecars. And then there are multiple classes of sports prototypes, right up to the formidable LMP1 Audi R18, meaning this game can cover the full range of a Le Mans grid.These are the formulae you can race in the game's excellent career mode. They're all unlocked from the start and you can choose whether to aim straight for the top or start from the bottom (or do both at once, as multiple career saves are supported). The game offers several meta-goals that will give any starting point a purpose. If you choose to work your way up through the ranks, you'll have to place well in the championships to earn a contract offer to race in a higher series; championships are composed of race weekends, which are split into practice, qualifying and sometimes multiple race sessions. You can skip sessions, or even simulate their results, but with Project Cars' well-pitched interpretation of motorsport rules - it's not frustratingly harsh, but mistakes can cost you dear - putting in the extra practice and qualifying laps is both worthwhile and quite exciting, as you slither around on cold tyres and try to find some clear space on a busy track.The races are more exciting still, thanks to racing AI which puts up a fight while respecting your track position, and which is far less prone to blundering into you than the drones found in rival games - allowing you to contest the racing line with cautious aggression, just like a real racing driver. There are changeable conditions too, with weather spanning everything from haze and fog to thunderstorms that turn the tarmac into an ice rink. Some of these effects are simply extraordinary in their atmospheric spectacle; this is a very, very handsome game.Although the resolute concentration on contemporary motorsport is welcome, it's a shame that this excludes some of Project Cars' garage from the career mode: all the road machinery and a small but delightful selection of retro race cars, including some beastly tin-tops of the 70s and 80s. (All hail the Cosworth Sierra!) You can set up your own custom races in these cars - full race weekends even - but this process is fussy and can be a little buggy. (One race I started actually spawned a Caterham on top of an Audi on the grid.) A few curated race set-ups from the developers for road and classic cars would have been appreciated; perhaps these will fill the mysterious ~coming soon~ row of the career mode.If there's a sign of Project Cars' relatively humble, crowdsourced beginnings, it's in the car list. It's not that it's not huge - you can't expect it to rival the vast digital catalogues put together by major publishers and platform holders - it's that it's rather spotty. With several holes in its repertoire (classic and American road cars, anything Italian at all), a rather random selection of production vehicles and all those unlicensed racecars, it doesn't feel as lovingly assembled as a game like Assetto Corsa, where every car in the small garage is a legend in its own right. The full extent of Project Cars' motorsport options goes a very long way to making up for that, though.Conversely, the suite of tracks is one of the best available anywhere, and all the more impressive considering it was put together without much in the way of commercial clout. There's an unsurprising focus on lesser British circuits, including wonderful little writhing rollercoasters like Oulton Park and Donington; several classic Grand Prix venues - Spa, Monza, Imola, Silverstone; a better-than-average US selection, including Willow Springs, Road America and Watkins Glen; and motorsport's most mighty and fearful theatres, the Circuit des 24 heures du Mans, Australia's Bathurst, and the ubiquitous Nordschleife. There are even a few fictional venues too, including scenic point-to-point stages along twisting coastal roads in California and France. Magnificent stuff, enough to absorb you for months to come.Also absorbing your attention will be the game's handling physics - and here I have to eat my words to some extent. My initial impressions of Project Cars earlier this week were that it was ~not the most exactingly realistic or physically involving sim out there~, and while I'd stand by that - I don't find it as demanding a drive as iRacing, or as good at communicating the physicality of the car as Assetto Corsa - I think I did underestimate it as a simulator. Handling realism is a surprisingly subjective topic, but the more I drive Project Cars, the more involving I find it, and the more information and challenge I'm able to extract from its impressive physics sim - especially the way it handles tyre temperature, track conditions, and bumps in the road surface. It's all there, but it's not as immediately obvious in the handling feel as it is in some other games.This could be because what started life as a PC simulator that would most likely be played on wheels has had to be rebalanced for the predominantly gamepad-wielding console audience. It could also be because, when playing on a wheel, Project Cars takes a different approach to force feedback than many other games, which doesn't communicate steering resistance or weight transfer as strongly. The depth of the simulation is considerable but you may have to dig it out for yourself, not just by turning assists like traction control off but by messing around with the default settings for wheels and even for pads (I found I had to reduce sensitivity on a pad to tame the twitchy steering).This illustrates Project Cars' biggest problem. Slightly Mad has to be commended for the wealth of features and customisation options in the game: weather change and the passage of time, damage modelling, mechanical failure, strength and number of opponents (up to some impressively huge grids), car set-up, fuel use, tyre wear and more can all be tailored to your liking, sometimes to a remarkably granular degree. But aside from some basic choices when you first boot the game, most of this is left to you, not all of it is simple to understand, and there's a lack of clear direction. It is, to a large extent, up to you to find your own level and find your own fun.This is most obvious online. With no real matchmaking and - a particular shame this - no playlists curated by the developer, Project Cars online is something of a wild frontier. All games are custom games; you can browse from a list, create your own, or jump randomly into one created by another player, which could be anything from a three-lap sprint to a three-hour, multi-session epic. Online racing is perfectly stable and terrific fun, thanks to a respectful community that, in the majority, seems committed to enjoying real-world motorsport as it's meant to be played. But if you're after something specific or only have a fixed amount of time to spend, you're going to be spending a lot of time dipping in and out of lobbies looking for a set-up that appeals or waiting a while for your own to fill. Better search options are a must, and playlists should be at the top of Slightly Mad's to-do list. (To be fair, the white heat of online competition will always be in time trial, and here at least Slightly Mad is offering a selection of week-long community events on specific cars and tracks, as part of an ambitious season-long plan.)Project Cars is, then, a serious game for serious racers. It's not inaccessible as such; on moderate difficulty settings, the career mode must be one of the most appealing and engaging interpretations of real-world motorsport video games have ever produced. But it is a game that doesn't come to you. You need to go to it: finding precisely the right settings for your taste and skill level, discovering its more out-of-the way content and features for yourself, learning to appreciate its community's love of a tight line and a fair fight.If you make the effort, you'll find that Slightly Mad has built a motorsport game for the people, at once flexible and uncompromising: a single-minded hymn to the gritty thrills of the pit-lane and the back straight. There's room for improvement and we'll be watching future updates with keen interest, but these foundations are strong indeed."}