{"ref": "https://www.eurogamer.net/war-for-the-overworld-review", "date": "21 Apr 2015", "game_name": "War For The Overworld", "text": "The more I played War for the Overworld, the more I began feeling that its name summed up why it wasn't quite working for me. It sounds like a small point, and it is, but it's one rooted in what people got from Dungeon Keeper in the first place. For me, the appeal was in, well, keeping a dungeon. It was building my little enclave of evil, enjoying the little squabbles and slithers of monsters drawn to my dark heart, and watching them work for my amusement. All of that is, of course, in War for the Overworld too, which is in most ways achingly close to the Dungeon Keeper 3 that we've all been waiting for so damn long. Still, there's something about it that doesn't quite ring right, which stops it - for me - being all I'd hoped for.In most ways, it's a big success. It's certainly a better game than Dungeons, and while EA should always have been ashamed at inflicting Dungeon Keeper Mobile on the world, the fact that an indie team has done more to honour the original's memory than they ever have is cause for seppuku. With a rusty spoon. Much of why War for the Overworld works though is that it's not afraid to simply be Dungeon Keeper, and recreate what worked before. It replicates the format admirably, even bringing back the original narrator to lubricate entire dungeons with his familiar malevolence, and with a deep love always sparkling away behind its evil facade of spikes and cold stone. That means a few new ideas, including a more flexible tech-tree, but generally design based on an appreciation from the original. Evolutions on themes, generally, which seems fair enough given that nobody else has really sat down and given them a try since Evil Genius. Carving out each dungeon is as satisfying as ever, as is filling them with rooms to recruit and train, traps to pointedly deter invaders, and a library of magic spells that of course includes Possession - the ability to jump into your monsters' heads and both see and fight from their first-person perspective. It's still generally pretty useless as an ability, but it's still fun too, as is watching your minions squirm when you pick them up by the scruff of their necks.The focus throughout though is less on creating the perfect dungeon than it is assembling an army for that War in the title, and being pressured to do it both quickly and well. Now, agreed, that's not particularly new. Dungeon Keeper was always essentially an RTS pretending to be a bit of a building game. Here though, it's for two reasons - the objectives, but also that the dungeons themselves just aren't as interesting or worth perfecting as they used to be. The bland monsters at your disposal don't have half the charisma of Horny and his more amusing pals, nor do their interactions and ecology make your domain feel like a living dungeon holding a fractious peace, rather than merely a buzzing hive waiting to be smashed over an opponent's head.Instead, it's a bit of a mess of icons and tabbed interfaces and a useless mini-map stuffed in the corner, with much of the action getting lost against the murky backgrounds and indistinct room designs. With less satisfaction in what you create, it inevitably becomes more of a tool than a thing to feel proud of in itself. In Dungeon Keeper World more than most, theme is crucial. Evil is good, after all. That's the point.Second, it often feels like the developers have come at the game a little too hard from the point of view of expert Dungeon Keeper players. This is of course a personal call, and based as much on nostalgia for the experience the original offered as the challenge it provided, but still. The action is typically brutal, designed firmly around combat, challenge and conquest, and with little time to sit back and smell the brimstone. The best metaphor I can think of is to imagine a Civilisation game that only really cares about the military victory. Sure, other tools are available, and that's always been a big part of the experience, but even the superficial change of focus would still kill the mood faster than reskinning Super Mario Bros with Oswald Mosley. Unfortunately, however you play, there's no getting around the fact that War for the Overworld has been released far too early. It's buggy, prone to memory leaks and slowdown, and full of reminders that it's just not done. In-game items for instance throw up tooltips full of developer-language like ~Prop Tavern Primary - Satisfied Needs: TAVERNOVEN~. The multiplayer menu outright states ~The Multiplayer menu is unfinished and will be updated in the coming weeks.~ Really? There are also only three maps available for multiplayer and skirmish modes, with no random generator or map editor yet available. Even then, only two-player multiplayer is supported, with four-player still to be added. Most jarring is the Survival mode, which warns that it's just a prototype, with the real deal coming later this year, along with leaderboards and mutators.This is nowhere near finished enough for a release build. War for the Overworld shouldn't be out of Early Access, never mind pushing an ~Early Adopter~ bonus of DLC intended to cap off the glitchy campaign.Behind these issues though, still a little crusted around the edges, a decent Dungeon Keeper successor awaits. It's impressive how close a raw team has managed to get to recreating a beloved classic whose actual owners can think of nothing better to do with than whore out for a few quick bucks. At the moment, it's hard to recommend actually buying it. It's not hard, however, to imagine that the few months when it should have remained Early Access will be able to make the difference - to file off the rough edges, add the missing features, and create a dungeon experience that can appeal to both the hardcore fans out for a challenge and more casual Keepers looking for the darkly dripping horrors of a place to realise their evil whims."}