{"ref": "https://www.eurogamer.net/mario-vs-donkey-kong-tipping-stars-review", "date": "26 Mar 2015", "game_name": "Mario vs. Donkey Kong: Tipping Stars", "text": "There are wheels within wheels at Nintendo these days, and even before the company announced last week that it was moving into mobile games (as well as prepping a new console, codenamed NX), it was hard not to approach many of its releases like Trojan horses. Would this one be prototyping a free-to-play business model, or playing with the possibilities of Amiibo, or pushing the boundaries of franchising, or experimenting with cross-platform play, or dipping yet another tentative toe in the frothing waters of online gaming? The more modest the release, the more likely it seemed that it was smuggling some shareholder-friendly initiative by you - the recent Pokémon Shuffle being a case in point.We needn't be too cynical. In its long history, Nintendo's experimental moods have been frequent - and frequently healthy and fruitful. Also, Nintendo's quality control being what it is, the games themselves are usually good. Mario vs. Donkey Kong: Tipping Stars, the sixth in a curious series of handheld puzzle-platformers (arguably the seventh, if you include their original inspiration, the marvellous Game Boy version of Donkey Kong) is just such a game. It's good enough for what it is but you suspect an ulterior motive in its creation.In this case, that motive is cross-platform development - something Nintendo's president Satoru Iwata spoke about last year, and that there's reason to believe is at the heart of its plans for Nintendo NX. Tipping Stars began life as a demo for a new web-based development framework, and the challenge that seems to have been set its developer NST - Nintendo's in-house American studio - is to create a visually and functionally identical game for 3DS and Wii U. Well, they can put a tick in that box: mission accomplished. Appropriately, it's also Nintendo's first ~cross-buy~ game, giving you both versions for one purchase price - although Nintendo's clunky eShop predictably doesn't handle this as smoothly as Sony's PlayStation Store does with PS4, PS3 and Vita games (purchase either version and you're sent a download code for the other).If you played any of the three DS iterations of Mario vs. Donkey Kong, you'll know what to expect from Tipping Stars. Once again, it's about guiding the relentless onward march of clockwork Mini-Mario toys to the level goal - but the PipeMania-style gameplay twist of 2013's Minis on the Move, in which you had to place blocks to create a path, has been binned. It's back to tight little 2D platform game levels, with you using the stylus on either the 3DS' touch-screen or the Wii U's GamePad to prod Minis into action and to collect and place platforms, conveyors, springs and other bits and bobs in such a way as to steer them away from hazards and towards coins, the goal or each other.Though simple enough to start with, the level layouts are ingenious, encouraging a nice balance of forward planning and risk-taking. Sometimes you'll stare at the layout for a minute or two, plotting the Minis' routes in your head before you start, but it's often just as useful (and more fun) to set the Minis running and see where the level's mechanism takes you, sketching out platforms on the fly. In most cases, the basic solution will be easy enough, but collecting all the coins and shaving your completion time down to optimise your score will require deeper thought and a faster stylus hand.Typically for a Nintendo game, Tipping Stars is more interested in exploring new ideas and layering them on top of one another than simply ramping up difficulty with convoluted brain-teasers or tests of dexterity. The main game is divided into suites of eight levels, and each suite introduces at least one new concept - pipes, travelators, escalators, free-form building blocks, hammers, clockwork Donkey Kongs with cannons for heads, cursed Minis which need to be reclaimed - before mixing it in with others.The game's challenge and satisfaction is in mastering each mechanic and how it interacts with all the others: solid, by-the-book puzzle game design, in other words. It's pleasing to work through, if not especially taxing or gripping stuff. It's a game that's fun to tinker with for a while but easy to put down - and it's territory that was pretty fully explored by the three DS games, March of the Minis, Minis March Again and Mini-Land Mayhem.Like those games, Tipping Stars features a level editor. Mario vs. Donkey Kong's highly schematic plug-and-play level designs are ideally suited for this, and the possibilities of even the most basic toolset are broad enough that asking you to unlock new features and items in the Workshop Store feels like a fun reward rather than a mean restriction. Unusually, the unlocking process is tied both to your progress in the main game and to Tipping Stars' expanded Community section for sharing levels - which is where the game's odd subtitle comes in.In the now-standard puzzle game style, you get one to three stars for completing a level, corresponding to bronze, silver and gold awards for your score. The awards unlock bonus levels while the stars unlock Workshop items - but you'll need thousands of stars to acquire them all, many more than a perfect run through every level and bonus stage will furnish. You'll need to earn the rest by playing levels in the Community section - and uploading your own. Uploaded levels earn stars when they're played, and you can also tip the creator additional stars, although you'll have to reach into your own precious pot of stars to do so. You can also upvote a level by giving it a ~Yeah~ on Nintendo's social network, Miiverse.There are some interesting ideas here for motivating and (forgive me) ~gamifying~ a healthy creative community around a game, but there are some conflicting impulses at work, too. Tipping is too hard a decision to take when you're saving up for some much-desired Workshop feature, and the stars economy encourages the creation of easy levels for star-farming over genuinely creative and interesting designs. Miiverse voting does balance that out to some extent; go by ~Yeahs~ and it's not too hard to find good levels which greatly increase the lifespan of the game. The stars economy definitely makes this a busier community than it might otherwise have been, too, and it's a strong encouragement to try building your own levels.But the lack of actual cross-platform integration is a desperate shame. It's bad enough that your game progress isn't shared between 3DS and Wii U - if rather predictably beyond the Nintendo of today to achieve - but the apparent separation of your Miiverse profiles and stars totals across the two platforms just feels wrong. Hopefully, cloud saving and other account-level features will be at the heart of the new cross-platform network Nintendo is building with Japanese mobile gaming giant DeNA.As an experiment - a doodle in Nintendo's margins - Tipping Stars is interesting, if not exactly exciting. It's good to see Nintendo taking a typically oddball approach to building an online community and getting halfway towards catching up with gaming's cross-platform future. It's a perfectly sound little game whichever console you play it on - although it has a rather flat, plain, budget presentation that is unusual for a company that usually takes an obsessive interest in the polished harmony of software and hardware. Here's hoping that's not an indicator of tomorrow's Nintendo games.And as a game in its own right? You can't accuse it of being short on content, features or ideas, but it's hardly long on them either, and it's a shade overpriced for what it is. Perhaps worse, you can tell that Tipping Stars is a game made with care but without passion, a game that isn't its own raison d'être. Like the little clockwork Marios marching toward their goal, it's got purpose, but it's not the real, joyful thing."}