{"ref": "https://www.eurogamer.net/cities-skylines-review", "date": "19 Mar 2015", "game_name": "Cities: Skylines", "text": "Bodies are piling up everywhere. My city of Buttingham begins to convulse with disease as its infrastructure fails to keep it running. I build cemeteries and crematoria on every block, but it's not enough. The damage is done. In a few weeks, everyone is dead, my buildings either abandoned or burning, and I've got to admit failure as my budget spirals out of control. My frustration mounts as I realise that the failure isn't my fault.I like Cities: Skylines, but the more I play, the more flawed it seems. Its foundation appears strong - built as it is upon the now-dead legacy of the once-great SimCity - but the cracks are still there. In many ways Skylines picks up where SimCity left off, and it seems to tick off a checklist of features that fans of the series wanted to see. Bigger cities? You got it. Agrarian economies? Done. Offline play? Yes. Mods? Absolutely. At first, it's glorious. My brain filled with all the different possibilities. I wanted to express myself, I wanted to craft and carve so many different types and kinds of places. I wanted to push the game to its limits and see just what kind of weird concoctions I could get away with. But as my creations grew and grew and grew, I ran into one of the dumbest and most obnoxious problems from SimCity - poorly managed traffic. On the surface, traffic seems to work. Cars move around realistically, they go to and fro delivering goods here and there. But after a while it becomes clear that the whole system is broken. With my second city, I divert a lot of extra funds to create a second city core about 2 kilometres away from anything else. It has power, water, police officers, and more, but all of them are provided independently with no roads or power lines or pipes linking the two. Despite the separation, my sub-city showed some peculiar traits. It had the same level of education as everywhere else - despite my refusal to add a school. It also had the same problems with dead bodies and a bit later with rubbish. Nothing I did helped the problem. I built subways, bus routes, and more. Regardless, traffic would always deadlock in arbitrary spots causing everything to fall to pieces. Despite its new appearance, that's the same problem that killed SimCity even after the online problems were fixed. As frustrating as that was, Skylines does have an incredible edge on EA's 2013 city-builder: mods. Even mere days after release, Steam Workshop had thousands of fan-made downloadables that solved every problem I had with Skylines. At time of writing, I couldn't find anything to fix motorway congestion specifically, but I could address all its symptoms. Rubbish piled up much more slowly and manageably, for example. It was enough that even the nonsensical system for handling garbage collection eased up enough for me to appreciate the beauty of the game lying beneath. My new city of Westfield fared much, much better. After about 20 hours and a dozen or so restructuring sessions, I built my megalopolis, my crown jewel. I had several commercial districts feeding into and out of one another, sharing and selling the goods cranked out by my industrial sectors, and topped with an educated and safe citizenry that I kept supplied with fresh water and unlimited clean power. This was it, this was my ideal. Along the way I carved out unique districts with their own policies - some that banned high rises or pets while decriminalising drugs - to create specialised neighbourhoods for every kind of person imaginable. Sprawling across 100 square kilometres, Westfield had different districts with different needs and personalities. Skylines supports this with what may be one of the best features I've seen for a game like this in quite some time. I painted areas of my urban paradise with a variety of brushes, selecting everything from variable tax rates to industrial policy. When combined with a much more advanced approach to transit, and a few choice mods, I made sure that non-polluting industries were kept close to poorer neighbourhoods so they could reach their destinations without suffering from the literal toxicity of heavier industry. I lumped high-rise offices and commerce together. Then I tied them to wealthier population centres with mass transit. This forced the rich to commute in a way that kept the roads clear of unnecessary passengers. All my city services worked as intended from the beginning. My people prospered from that cooperation and connectedness. After a bit though, I noticed one problem that mods haven't yet fixed - the sense of aimlessness that underpins it all. I'll admit, I had a fantastic time building Westfield up from nothing. Without the artificial barriers and bugs inherent to the basic game, I could grow and build my own personal metropolitan ideal. That's important. It opens up this wonderful world of municipally-driven creative expression, and that is worthy of celebration and adoration. At the same time, I found myself wishing I was - well - wishing I was playing SimCity. As odd as that may sound, once I had achieved what I wanted in Skylines, it all felt a little pointless. If there was one thing I did actually like about Maxis' otherwise colossal failure it was that I always felt like there was something interesting to do. Connecting the game to the internet was a pain, and rarely worked, but when it did, it created this global marketplace for goods, and a continuous challenge to maintain your city in the face of an ever-shifting milieu. SimCity challenged players to work together to build massive, regional projects that benefit everyone. Cities: Skylines has a similar system, but it feels like a complete afterthought. Instead of requiring a complex set of interconnected goals, Skylines asks that you meet basic requirements with lots of spare cash to build a big thing. That distinction between the two doesn't retroactively make SimCity a better game. A failure is still a failure. It does, however distinguish a visionary-but-broken game and one that works enough to please an itch without pushing boundaries. Skylines is a merely competent game that's smart enough to let the community innovate for it. All its problems and all its genuine innovation will come from the creative ambition of its players. It's comforting in a way, because with that you feel that you share your struggles with a larger community, but there's still the nagging feeling Cities: Skylines lacks a magic of its own."}