{"ref": "https://www.eurogamer.net/phogs-review-phantastic-stuff", "date": "10 Dec 2020", "game_name": "PHOGS!", "text": "Sliding about on a bedrock of blancmange, moving past boulder-sized strawberry slices and mountains of pink-tipped whipped cream, I pinball myself off chunks of milk chocolate straight into a gooey, molten vat of the stuff. The strange but friendly creatures lounging at the sides appraise me silently, unconcerned that I didn't get the memo that it was Giant Fruit-Shaped Hat Day - I am shamelessly sporting a snorkel and a nightcap - and sigh contently. I'm a little envious as they slip a little further into their delicious hot tub.I spend the next ten minutes or so doing a whole lot of nothing much. Phogs! - a sweet, if peculiar, puzzler that stars an elasticated, two-headed dog (now there's a sentence I never thought I'd write) - doesn't intervene. Like my hot tub companions, its calm and unhurried, content just to wait for me to noodle about and work it out on my own. I know pulling the (marshmallow) cork free from the (chocolate) cauldron up above must have done something but... ah! Wait! I didn't know I could grab onto this fountain! Phogs! is full of those ~ah!~ moments. Mostly it's exclaimed in delight, incited by the whimsy of it's sweet, dreamy environments and sharp puzzling, and sometimes it's uttered through clenched teeth like a curse word. This, my friends, is a physics game, where you can solve a puzzle properly, bumble your way through and cheese it, or end up sacking it off entirely because you've wedged yourself between a jammy dodger water wheel and a giant Victoria Sandwich cliff-face.I spent a lot of time being caught on things, actually. Your two-headed monster dog - which looks like two front parts of a car welded together by a cold-hearted second-hand car salesman - not only has an extra head, but they're missing their legs entirely, too, which wouldn't be so bad if their conjoined stomach hadn't been greased up like Clark Griswold's sled. This makes precision movement pretty much impossible, and while it's is astonishingly forgiving when it comes to mistakes - an untimely plunge off the side sees you respawn, without penalty, pretty much where you were - that doesn't mean it's not frustrating, particularly as a lot of errors are forced by tight angles and an uncooperative camera. Phogs! isn't a fighting game, and yet fighting makes up such a big part of the experience. If I'm not fighting the camera, I'm fighting the physics, and if I'm not fighting the physics, I'm fighting the urge to drop kick shrieking alarm clocks into oblivion. I started off my adventure in Sleep World, which is a shame because Sleep World might be the weakest of the three, but as I progressed through Play World and Food World respectively - yup, the place with the chocolate hot tub - I grew to enjoy my time wandering through this strange little game. Each area offers a different motif, a different assortment of puzzles, and a different array of cute characters; thank goodness Play's cheesy arcade games and Food's wafer walkways were less of a chore than the introductory puzzles I met in Sleep. It's all a bit confusing when you start, though, with four busy, meandering overworld hubs - a home hub, and three for each individual world, too - all strung together by ginormous worms that gobble you up once you've woken them, unlocked them with stars, or tempted them with an edible treat. Sometimes, you'll traverse by way of rollercoaster, and yes, that is just as delightful as it sounds.You play it as a twin-stick shooter, manipulating both ends - which are, ironically, not ends but heads - of your pups to solve environmental challenges by either biting stuff to tether yourself or grab an item, or by stretching out your poor pups' torso. They don't seem to mind it, to be fair; though they'll sweat a bit when expanded to capacity, they're back to their yappy selves in no time afterwards. And that's it, really. Phogs! has a minimalistic control scheme and exactly zero tutorials. Everything you learn is done so by doing, slaloming around the place and poking your dual snouts into everything and everyone, barking and biting and stretching to see what, if anything, sticks. It's a confident, hands-off approach, particularly for an indie studio, but one that works admirably here.It can also be played in couch or online co-op, and while I couldn't test the latter ahead of release, attempting this with my other half almost ended in divorce. It's hard enough controlling these skittish pups when you're in charge of both of them - passing the reigns to someone else is unthinkable, quite honestly. Kudos to those of you brave enough to try it!There's a fantastic array of diverse puzzles, enough that I didn't get bored as I worked my way through the worlds and their levels. Sometimes you need to freeze yourself into a long stick to cross treacherous gaps; other times, you might need to anchor one pup's mouth to a fountain and stretch the other to water distant shrubs. Occasionally, you'll use the heat of chillis to melt things - it never fails to amuse me that it's the other end of the pup that suffers - and every now and then you'll need to fire cannons, or help creatures locate lost items, or sink a hole in one, or find a way across a bothersome see-saw. While the puzzles, on the whole, aren't particularly cerebral, there are a couple of deliciously devilish ones in the mix, too, with one complete rotter involving factory pipes stumping me longer than I care to admit.Phogs! is playful and wholesome and stuffed with adorable creatures in a world where everything's larger than life and just a teeny bit odd. There's barely a story, but it doesn't matter as you slip around this peculiar place with its peculiar people and a peculiar, if perfectly happy, two-headed doggy that adores being petted by friendly townsfolk. Bright, bold, and wonderfully accessible, Phogs! is phantastic stuff."}