{"ref": "https://www.eurogamer.net/assassins-creed-rogue-review", "date": "11 Mar 2015", "game_name": "Assassin's Creed: Rogue", "text": "It's easy to forget that Ubisoft really hit on something with Assassin's Creed 4: Black Flag. It was one of those open-world games where you might set off towards a mission marker with good intentions, but you would seldom get there because you would be too busy being dragged this way and that by compelling diversions. It turns out Assassin's Creed Rogue is effectively Black Flag 2, and that's fine by me.Rogue stars Shay Patrick Cormac, an extremely Irish man (who sounds too much like football commentator Jim Beglin for me to take seriously) who falls out of love with the Assassin order after they accidentally kill thousands of people while digging up First Civilisation artefacts. He subsequently joins the Templars.There was a time when the lure of playing the bad guys in Assassin's Creed would have been irresistible. I still remember the first game, waking up in a futuristic science prison where I was forced to explore my genetic memories by a shady organisation. I remember desperately wanting to get out of those glossy grey rooms and discover what was going on.Seven games later, however, the inner workings of the Templars have been so thoroughly demystified that there isn't much of a curtain left to draw back - and certainly not in the period Shay's adventure covers, the late 1700s. To add insult to injury, they aren't that different to the Assassins anyway. Sure, one group lurks in the shadows fighting for freedom while the other hides in plain sight maintaining order, but as the characters often point out, the difference is really just a matter of interpretation.Rogue certainly supports that view. To accommodate Shay's turncoat ways, the writers merely recast the Assassins' activities as power-hungry meddling in forces they don't understand and the Templars' as brave interventions designed to create stability and prosperity. They do this with embarrassing ease. In fact, Shay's story is indistinguishable from the average Assassin's - he just goes about his business after stuffy conversations with English colonels rather than hooded mentors.Still, none of that will matter for very long, because while the unremarkable main missions and their tedious cut-scenes give the game its backbone, you spend most of your time thinking about doing a story mission and then not bothering because you're having too much fun.The key to this is all the things that made Black Flag great: Shay quickly acquires a ship, the Morrigan, which he can upgrade by acquiring booty. He gets booty by fighting other ships for their cargo and exploring the villages and outposts he finds when he visits tantalising unidentified locations on the map. Upgrading the Morrigan allows him to pursue booty in more treacherous waters.The cycle of discovering, collecting and upgrading works perfectly, with just enough variation (treasure maps, forts, shipwrecks, etc) and parallel activities to keep you bouncing this way and that, while splitting the action between seafaring and going ashore makes it easier to ignore the decrepitude of the game mechanics. Which is to say that Shay still jumps the wrong way all the time and stealth and combat are past their sell-by dates, but you get enough time to cool off between moments of frustration that it doesn't build up in your veins in quite the same way it does in Assassin's Creed Unity.Rogue is split across three maps. New York is just a city, although it's a perfectly nice one and last year's lighting model imbues it with warmth and optimism, while the River Valley is an enclosed network of massive deltas and the North Atlantic is a patch of ocean with lots of icebergs and interesting things to visit.I might have preferred one massive play area, Black Flag style, but there is still plenty to like here. The North Atlantic section in particular stands out. Colder waters bring ice floes and walls that you can smash through, and the more isolated spots you reach have an ends-of-the-Earth feel to them that makes crawling over the shattered, forgotten hull of an old Templar ship that much more fun and memorable.Rogue takes a few things away (no diving bell this time, I'm afraid) but keeps most of Black Flag's core activities, like harpooning and Kenway's Fleet (now called The Naval Campaign), and throws in enough new toys and ideas to avoid accusations of cynicism. Shay gets his hands on an air rifle and even a grenade launcher, both of which add pep to his already sparky arsenal of hidden blades, cutlasses, darts and whatnot, while his change of allegiances is also harnessed to make outpost takedowns more interesting.Borrowing from the absent multiplayer mode, Eagle Vision now shows the rough direction of nearby assassin attackers, who may be hiding in crowds or shrubbery or lurking on rooftops, and Shay has to avoid their lethal attentions as he stalks enemy bases trying to kill commanders, lift keys and cut down flags. This stuff never feels as slick and varied as it does in Far Cry, where it has become the series' calling card, but that's not the point. It's one of a huge variety of pretty entertaining things you can do, all of which help Rogue to feel like more than the sum of its parts.As usual, the action is framed by modern-day sections involving the grand Assassin's Creed meta story, and you could argue these do a much better job of anchoring your activities than Shay's story itself. Unlike Unity, which focused almost exclusively on adventures within the Animus, you spend a lot of time outside the machine poking around Abstergo Entertainment, much as you did in Black Flag, and despite various revelations over the years about the modern-day Assassins and Templars, not to mention the First Civilisation, this is also where the most intrigue still lingers. I still enjoy rifling through PDAs and unattended computer terminals listening to recordings and reading old emails, which are filled with a mixture of tantalising Templar details and fan service.Assassin's Creed Rogue may well have begun life as a hedged bet - a PS3 and Xbox 360 game knocked together in case the next-gen consoles hadn't taken off by now - but despite its slightly awkward role as b-side to Assassin's Creed Unity, the result is a welcome follow-up to Black Flag. It's a shame that being a Templar isn't very different to being an Assassin (given that Haytham Kenway turns up occasionally, bristling with charisma, you could also argue they made a game about the wrong Templar), but if you remember Black Flag fondly and fancy a bit more of that, this is actually pretty great."}