{"ref": "https://www.eurogamer.net/oddworld-new-n-tasty-review", "date": "25 Feb 2015", "game_name": "Oddworld: New 'n' Tasty", "text": "HD remakes - even sumptuous all-new-asset reimaginings like Oddworld: New 'n' Tasty! - are often doomed to a rather melancholic fate. For all the care and attention, there can be something perversely cruel about them. Beneath that warm familiarity and the sharp-edged dazzle, you see beloved games from the past rendered elderly, blinking and confused as they're bustled into the harsh light of the present day. Seriously, we used to do things like that? We used to think this was fun? Oddworld is different. But wasn't Oddworld always different? Forget the grotesque artfulness of the animation and the slapstick pratfalls of the action: back in 1997, Oddworld: Abe's Oddysee was a puzzle-platformer driven by its theme, not its tech. This was satire in a medium that was still more used to buttery fairy tales or unthinking propaganda. Oddworld had something to say about our world - and the things it says are, sadly, more relevant now than ever.New 'n' Tasty! is a ground-up reworking of Abe's Oddysee, keeping the characters, the storyline, the puzzles and the level design, but chucking out the old assets and the flipscreen progression in favour of brand new 3D character models, backgrounds and cinematics, and scrolling levels enhanced by a playful camera that tilts and moves in close to get the most out of the glorious artwork. Like the best remakes, it changes just about everything to give you back the game almost exactly as you remember it - and the game you remember is still a vicious sideways glance at the way the industrialised world preys on the environment and on the dispossessed.Poor old Abe, toiling away in the depths of a huge food-processing plant, discovers that falling profits mean that he and his fellow Mudokons are next on the menu. The feeblest of the feeble, he somehow decides to break free and escape, to uncover his true destiny, and to return transformed to bring the whole place to its knees.This could have been shrill and hectoring, but Oddworld Inhabitants always knew how to make you stick around for the message. Back in 1997, Abe's Oddysee was a real looker, for example, and so is New 'n' Tasty!, from the first pan over the glinting skyline of RuptureFarms, its villainous silos and smokestacks basking in the toxic yellow half-light of a Blade Runner sunset, to the rickety wooden trails and towering pines of Paramonia and the Wile E. Coyote mesas and bluffs of Scrabania.Abe's as gloriously emotive as he ever was, with those huge, wet eyes and stitched-up mouth, and the carnival of freaks he's faced off against have never looked more disgusting: the twitching, creeping paramites and the red-eyed cybernetic sligs, who come with limp, long-fingered hands where their mouths should be. My favourite - although favourite is perhaps the wrong word - are the slogs: ravenous turkey-fleshed dog things with practically no brains but plenty of sharp teeth. Fall to a slog, and they dive on you with an ugly swiftness, ripping you to pieces in the shadows.Despite such major graphical surgery, the soul of the game has survived along with the aesthetic - even when that soul is somewhat ornery. The transition from flipscreen progression to smooth scrolling might allow you a greater understanding of how Oddworld's complex environments fit together, but the classic - and rather awkward - controls have been retained, so Abe's still heavy to move and difficult to maneuver in very tight areas. It's weighty, deliberate movement, and it's occasionally a little lead-footed too. Elsewhere, contextual actions like switch-pulls and ledge grabs have hot spots that can feel pretty miserly by today's generous standards - and if you miss a jump in New 'n' Tasty!, you really do miss it. Down into the gears or the pit you go, with no special-case programming to draw you magically to the safe ground that, in truth, you failed to connect with.It's still a game in which it's sometimes easier to work out what you have to do than to actually get it done - but while it's occasionally frustrating, I'm not sure if it would really be Abe's Oddysee without all that. The whole point of the game is that Abe's not a natural hero, so a certain hesitancy, a certain clumsiness, felt through the fingers and the sticks, seems like it should go with the territory. Thankfully, at least the checkpointing's a lot more generous in New 'n' Tasty!, and there's a handy quick save option in place, along with a new range of difficulty settings.And, after all this time, the levels themselves hold up surprisingly well, as Abe's journey from RuptureFarms and out into the wilderness runs from stealth sections to platforming challenges and a series of deadly puzzle rooms. There are sequences where you sneak through the shadows, throwing rocks or bottle caps to distract patrolling guards or maneuver them over trap doors and under industrial shredding machines, and there are set-pieces where you race away from paramites, ducking into pipework and leaping over gaps, always an inch away from a truly awful death - now rendered even more awful by a proper physics engine. In my memory, Abe's Oddysee was not a violent game. My memory, it transpires, was not correct. For the most part, though, the violence is still relatively indirect: you possess enemies before leading them on killing sprees and then exploding their heads, and you encourage wild beasts to run into their own security mines. The game's still at its absolute best when it drops you into the challenge rooms of the middle and late sections, each level a devious mousetrap to be toyed with until you've unravelled the sequence that allows you to complete it safely.Invisible tweaks and updates are lurking here and there - is this race a bit longer? Are those platforms added to ease a transition? Where New 'n' Tasty! does deviate openly from the classic design, however, it tends to work really well: whether it's the clever updating and embellishing of the secret areas where Abe finds stray Mudokons (lots and lots of Mudokons) to rescue, or sequences in which the ditching of those flipscreens allows the headlong pelt through Scrab's Nest to become a true, wits-fraying gauntlet, or any moment featuring Abe's dino-like pal Elum building up a frightening speed as he rushes you over traps and sudden drops, endless runner-style.Sprinkled in amidst all this, the Gamespeak puzzles in which you match passwords with other Mudokons to earn temporary power-ups or open gates have not aged brilliantly, but you still get a sense of how ambitious the design is, not only blending puzzling, stealth and platforming, but also throwing in an attempt to make communication a meaningful part of gameplay. The babbling chat's also a reminder that Oddworld games never forget about characterisation, about the people driving the action. New 'n' Tasty! has a simple story, but it never stops telling it, and never stops layering in the texture. Every detail counts, from those stitches around Abe's mouth to the low-headed way Elum advances towards you at first - a creature used to cruelty, entertaining for the rogue possibility of kindness.More than anything, what really stands out about Oddworld: New 'n' Tasty! is the sheer coherency of the original design. It was startling back in 1997 on the PlayStation when games did not often turn up with proper themes to think about, and it's still just as startling in 2014, to be honest, where the grace with which the plot unfolds and the relevance it still has for the real world remain something of an anomaly. This is a story-driven game in which neither game nor story are made to suffer because of the close proximity of such traditionally toxic partners. It's a game in which the mechanics emerge from the central character - from his weakness in a straight fight, from his need to out-think foes who are more powerful than him, but also more stupid. It's still an angry game, too - and not because angriness is in vogue this year or because it provides a no-fuss justification for gratuitous payback in the final act. New 'n' Tasty! is angry because it holds a cartoon mirror up to the injustices of the modern world: to every clothes factory that falls down or blows up because corners were cut in the race to make 99p T-shirts, and to every water supply privatised in the name of hamburgers or fizzy drinks. Graphics lose their luster. Design tricks become predictable and then forgettable. Injustice, it turns out, rarely goes out of fashion."}