{"ref": "https://www.eurogamer.net/monster-hunter-4-ultimate-review", "date": "20 Feb 2015", "game_name": "Monster Hunter 4 Ultimate", "text": "Eurogamer has dropped review scores and replaced them with a new recommendation system. Read the editor's blog to find out more.In all the hundreds of hours I've spent on the series, there's a single frame of animation which defines Monster Hunter for me. It's an inconsequential little pose, a brief celebration: arms held aloft and chest puffed out with pride. You can't be certain, but I'm pretty sure your hunter is also wearing a massive, turd-eating grin.It's not a grand victory pose, it's the mark of a tiny achievement: just what happens every time you drink a potion, or an energy drink, or one of the little mugs of virtual cocoa that stop you freezing to death in icebound regions. Sip sip sip. Tadaaa! It's cute and quirky and completely unnecessary. It's also incredibly annoying, because whilst your avatar smugs it up for managing to have a drink some treacherous bastard inevitably lumbers up behind you and clatters you in the soft parts.Usually, you knew it was going to happen. You knew you were chancing your arm. You knew that, just as always, there would be that pose and that, during it, you'd get caught. Those few frames of utter vulnerability, total braggadocio. It annoys the living crap out of me every time I see it, but I wouldn't have it any other way. Without that grating, time-wasting, self-aggrandising pose, it just wouldn't be the same.It's the quintessence of the series, and the key to its genius too: even when it's firmly extending the middle digit, Monster Hunter absolutely recognises the need to not take itself too seriously.I might be getting ahead of myself, so for the benefit of anyone who's never played a Monster Hunter game before, here's how it goes down. You kit up your hunter with potions, food, whetstones - all the usual jazz. Then, you roll out and (usually) try to kill something. Then you cut bits off it and make them into stuff. Then you equip that stuff and go back to kill something else, or sometimes the same sort of thing again. (You'll often find yourself belting a monster in the face with a sword made out bits of its own mother's arse.) It's a lot more complicated than that, though. There are literally thousands of materials and craftables, and very little of it is very obvious. There's a ton of status effects and elemental varieties, over a dozen weapon classes - each with God knows how many examples, wildly diverging armour trees, convoluted stat-buffing and obfuscated skill systems. It's vast and complex and difficult and brilliant. If that sounds off-putting, don't worry. With every iteration this once impenetrable series becomes more and more accessible, and Monster Hunter 4 Ultimate is the zenith of that progress so far.It's (still) hard. It's (still) opaque. But you'll (still) be picking fights with a dragon whilst armed with a bagpipe, a frozen tuna or a cat's face on a broom handle, so it's (still) completely ridiculous too. Like every game in the series before it, Monster Hunter 4 Ultimate will punish every mistake, belittle every gambit, crush every bit of cheek, but there'll always be just enough of a wry smile on its face for you to ungrit your teeth and head back into the fray.Take your hunting companions. Gone are tiresome last-gen pygmies Kayamba and Cha-Cha, replaced by the friendly Felynes which should never have been dropped after Freedom Unite in the first place. These 'Palicoes', recruited in-game or via streetpass, chum along with you on hunts, smacking monsters about and generally helping you out.They're pretty good at it too, rather than just being the aggro-bait they were previously - but the best thing about them is that you can dress them up like idiots. Send them on missions between quests and they'll return with materials, so you can craft armour to make them look like a tiny, super-deformed Kut-Ku, or a ridiculous bobble-headed cat. It's hard to be too angry with a monster that pins you up against the wall for a near-unbreakable death combo when a tiny, furious franken-chicken is crashing a wooden rocket-ship into its head. This line between farce and fury is a fine one, but Capcom rides it beautifully: always ready with a prat-fall for the axe-murderer. The new mechanic for 'mounting' is a fine example. Jump on something's back and you'll begin hacking away at the screaming beast, a knife in each hand as your hunter rides a grim rodeo. Blood gushes wildly as you flense and pare, but it's still funny, because you're an insane little lunatic, dressed like some sort of nightmarish Sesame Street reject, playing deadly Buckaroo on the back of a massive bloody dinosaur. Frustration, ever the bane of the series, is nearly always kept at bay with these silly, empowering distractions. This is a friendlier game all round, in fact, but the trademark difficulty remains. Monster Hunter 4 Ultimate has the gentlest on-ramp of any of the games so far, with better explanations of systems and controls than ever, but it's still a learning curve which swings away well past the horizon. At the time of writing I'd clocked over 120 hours, largely split between soloing the slightly easier village quests and the tougher gathering hall equivalents, and I'd still not hit the end game G-rank missions. What I've played of local and online multiplayer is a breeze - a long way from the clunky lobbies and fiddly connections of past games. There's still a little obfuscation in the workings of the buddy-summoning gong system and the hunters-for-hire, but it all shakes down after a few experiments. If you're still in the dark, a quick Google will lead you to a world of tutorials, walkthroughs and explanations.Group hunts are where it's at - although you might want to sort out a Skype link or Google hangout if you're expeditioning with friends - but solo mode has really hit its stride in Monster Hunter 4 Ultimate. Tri's islanders were full of charm and motivation, but 4's cast and story take you on an engaging journey around a number of base locations with their own unique benefits, interrupting the usual murder/skin/tailor quest cycle enjoyably. The fiddliness of farming has also been replaced with a much smoother system, gradually extended to less and less commonplace ingredients, cutting out the need to spend hours gathering mundane plants and ores.To that end, 4 also sees the introduction of expeditions, which are a partial replacement for the Moga Hills in the last generation of games. These short quests consist of a point-to-point run through a short, procedurally generated succession of areas, during which you'll encounter various monsters, from single Kut-Ku to processions of four or more mixed Rathian, Nerscylla or Gore Magala. In fact, anything you've bested in the course of your questing can be encountered here, with the randomly generated line-up changing every time you finish a quest. To complete each run, hunters need only survive to reach the Veggie Elder at the end of the area, but if you take the time to best the wyverns on the way, you'll find them added as 'guild quests' which can be completed again and again at the gathering hall, levelling up in difficulty at each completion.In addition, mining at certain points during these expeditions will turn up battered armour and weapons which can be cleaned at a special furnace, revealing randomly spec'ed pieces of equipment which are easier to upgrade than regular kit. Weapons gained this way vary hugely, but they're occasionally so over-powered that they risk unbalancing this so precipitously poised of games.There'll likely be some grumbles from the experienced over just how powerful these random drops can prove to be, and not without justification. It's an odd and not particularly well-meshed mechanic, but completely optional all the same. I suspect its been included in order to alleviate the bewilderment which new players might find with the famously Byzantine upgrade trees, but in doing so it provides a shortcut which kind of misses the point.The series' biggest bugbear, which I've grown to almost ignore by now, remains the camera. If you're used to the slick panning and directorial nous of a lot of third-person action systems then be prepared, as the game's combination of sheer pace, confined spaces and enormous enemies results in some tricky and bewildering angles. You'll still find yourself trapped by walls you've inadvertently run into,  camera stuck uselessly inside the living mountain currently grinding you to a fine, fiery pulp. The small screen also means that a limited field of view will often cut off most of a larger monster, making you miss vital attack cues. It's better this time around, especially with the addition of the nubbin if you're playing on a New 3DS, but expect to blame at least a few critical failures on a invisible ledges or a bad view.Speaking of views, this is a gorgeous game. Incredibly colourful and bright, it still has weapon and armour designs which for my money are unmatched anywhere else. The environments are a massive improvement on previous efforts, with a real sense of verticality which sees giant spiders crashing down through forest canopies and rampant apes pouncing from cliff tops. Because of this, wall climbing and cliff diving become crucial tools for mounting enemies, making clever use of terrain a must.There's so much I've not even had the chance to mention. The new Charge Blade (half greatsword, half S&S, half Switch Axe, all amazing) and fiddly-but-versatile Insect Staff, the arena modes, the odd little side quests for the various threads of non-critical progression. And Poogie! Poogie, the pet pig who you can find costumes for, who you can pick up and cuddle and take outside for your cats to ride around on. Poogie, who it's debated has far-reaching and unfathomable effects on the loot tables depending on whether you tickle him just right before each mission. Poogie who, in fact, is probably just a pig dressed as a watermelon. It doesn't matter! There is so much depth here, so much complexity, so much insane, impenetrable content. But so much raw, stupid fun too.If you're in any doubt, this is easily the best Monster Hunter so far, for veterans and newcomers alike. With it, I think Capcom has achieved exactly what the series has been aiming for since it started edging gently Westward: a perfect balance of Circus Maximus and just plain old circus. Get it. Stick with it. Buy yourself some thumb plasters.  If this is your first time wielding a Hunting Horn, we've got a Monster Hunter 4 guide to get you up and running fast."}