{"ref": "https://www.eurogamer.net/terraria-review", "date": "9 Feb 2015", "game_name": "Terraria", "text": "I like to think of the Albino Antlion Memorial Highway as a grand public work in the Victorian, or perhaps even Roman, tradition. For miles and miles it chisels a clean, unbroken line across the sky, taking me from the dwindling forests of my base camp to the ragged sands of the frontier. The highway's made of dirt and of stone, with occasional glinting chunks of glass thrown in for good measure, and, like most modern highways, it was put in place because there was something nearby that its architects wished to avoid. In this case - you guessed it - that was the barking, spitting, uber-aggressive albino antlions that lurk just beneath it. It's a shame, really, that such a vast project terminates, for the time being, a little short of its genuine destination, with a weird stump of rock and a gravestone marking the spot where I was agitated into squishy pieces by a wandering swarm of vultures.The mad thing about Terraria - which has finally made the leap from PCs to Xbox Live Arcade and the PlayStation Store with this lovely new port - isn't that it encourages you to construct a highway across a good chunk of one of its procedurally-generated worlds. It's that it gives you the tools and the context to allow you to essentially invent highways, organically and from scratch. You'll build them because you need them, and only afterwards will you reflect, ~Oh, I guess that was a highway.~This sort of thing seems to get at the heart of Re-Logic's endless, freewheeling game. What is civilisation, Terraria asks, if not the process of moving stuff around? You know, taking mud from here and turning it into bricks over there. Taking bricks from over there and turning them into buildings back over here. Giza, Athens, New York: these are all testament to logistics: to picking stuff up and then dropping it off. Man the thinker? Man the removal guy, more like.In other words, console audiences are about to find out that Terraria's a small game - literally, at least, since it clocks in at far less than 100MB - but one with a worrying capacity to engender big thoughts. It's not a highly populated experience, but it will make you think about society. It's not a narrative-driven experience, but it will encourage you to write your own story. It has a gently comic tone and a chunky retro aesthetic, both of which hint at breezy inconsequence. Do not be fooled: Terraria is not a game to be taken lightly. It is a serious undertaking, and - thankfully - an extremely enjoyable one.The simplest description is also the most intoxicating: Terraria feels a bit like Minecraft blended with Spelunky. From Minecraft it gets the focus on drilling the earth out in neat chunks and then building those chunks into new structures. It gets an emphasis on crafting new tools and weapons, and a day/night cycle enlivened with zombies and other horrendous fiends that enforces a rhythm of play. Explore while the sun's out and hunker down when the moon appears. Terraria also has that whole Robinson-Crusoe-microcosm-of-man-made-progress thing, despite the transition to simple sprites and a 2D plane. You're dropped into a wild, often deadly environment: make a cave, gain a foothold on the landscape, and then steadily work to bend your new home to your will.The game's crafting chains are a little quicker to weaponise themselves than Minecraft's, though, and here's where Spelunky comes in. Terraria has scattered bosses who are summoned, quite a lot of the time, by arcane sequences of events. It has a deep, rich underworld that is shaped by features that always emerge from the procedural generation the same way - if not quite in the same places. There's always a dungeon off to one side of the map, and it will always force you to fight the Skeletron if you want to explore its glinting depths. There's always a jungle, there's always an ocean and a floating island, and there's always danger waiting to find you if you head in any direction long enough.You'll still be seeing new stuff by your 20th, your 30th, your 50th hourThis aspect of Terraria is dizzying. You can spend days and days plugging away here, exploring the map in a series of discrete lunges into the unknown - each ending with your hilarious death and respawn back in a safe zone - and you'll still be seeing new stuff by your 20th, your 30th, your 50th hour. You can spend days digging down into the ground scavenging ore and crystal hearts and accidentally tipping yourself into pools of lava. You can spend days plodding across sandscapes or building staircases up into the sky, or simply refining your home base until you've added vanity battlements and encouraged a handy range of NPCs to move in. You can spend days crafting every kind of armour and weapon from the resources you almost died collecting. You can chisel through the endless darkness of the game's bedrock for whole afternoons and feel like the loneliest person who ever lived, or you can cheer yourself up with a miner's lamp and a pet to keep you company.Terraria's console version will even hold a few surprises for any PC veterans washing up on its shores. The worlds are still huge and riddled with randomised possibility, and you can still explore them with friends, but there's now four-player split-screen supported alongside eight-player online. There's a handy opening tutorial, too, which does its best to at least show newbies how to build their first house, even if it struggles to prepare anyone for the fiendish depths that await after its construction.And there are new pad-based controls, which offer both an automatic targeting system for your axe, your hammer, or your weapon of choice, as well as a manual option for moments when you're engaged in fiddly stuff. You can switch between the two modes at the click of a thumbstick, and they're both useful in their own ways. Automatic digging targets blocks fairly intelligently and is great for just pointing the right stick in a set direction and then chewing through the ground with relative ease, while manual digging works best when you're trying to build things or gather specific pockets of ore. At times, the game can feel a bit like a twin-stick shooter on consoles, and while the setup isn't quite as elegant as the mouse-and-keyboard approach, it's still intelligently designed and surprisingly clear-headed.Automated control for tunnelling allows you to lean back and grind ruminatively through the earth's crust, daydreaming en route to hellIn terms of brand new world content, there's been a gentle bolstering of the game's decidedly non-gentle ecosystem (besides other arrivals, I think those albino antlions who caused me so much trouble are new, for example) alongside new weapons, new armour and a new final boss which, after many hours of toil, I'm still not particularly close to seeing. Such additions are exciting to stumble across but will only change the game in any meaningful sense for truly committed Terrarians, I suspect. For the rest of us, the inclusion of a world map is much more significant. The map gives shape to your play the way the limited tutorial never could. It allows you to judge the scope of your achievements - and marvel over the scale and complexity of Terraria itself. It's your constant companion if you want it to be, and it fills up with detail the more you travel into empty space - just like those cartographical playthings wielded by the likes of Vasco da Gama did. Also, in a suitably nasty flourish,  you won't be pausing the action as you consult with your map, meaning you can easily drown or be pecked to death by zombies while simply getting your bearings.For my play style, the map makes the console port the most complete version of Terraria available, but this game is ultimately a mirror, so personal preferences come down to what kind of Terrarian you are at heart. The PC version remains the best for the committed builder, I think, as you lean into the screen and work with surgical precision. The console game, with that automated control for tunnelling, allows you to lean back and grind ruminatively through the earth's crust, daydreaming en route to hell. It's Terraria for the kind of explorer who's planning to take their sofa with them.Regardless of how you approach things, though, the basic rhythm of this astonishing piece of work remains the same. For your first few hours, Terraria will seem like a bewildering - occasionally terrifying - strain of chore. Put in the effort, though, and it eventually reveals its true nature. This isn't a game or even a toy. At heart, it's a vocation."}