{"ref": "https://www.eurogamer.net/spelunky-review", "date": "9 Feb 2015", "game_name": "Spelunky", "text": "I haven't completed it. What I have done is die, hundreds of times, in a variety of gruesome and hilarious ways. I've been impaled on spikes. I've been nibbled to death by piranhas and clobbered into oblivion by angry shopkeepers. I've blown myself up with bombs, I've fallen down cavernous holes and I've been stung to the core by a giant queen bee.Death comes frequently in Spelunky. You'd be forgiven for rolling your eyes at yet another indie platformer with cute graphics and chirpy music - albeit one that goes out of its way to be as tough as possible. But the more you play, the more it surprises you.For starters, death isn't just frequent - it's also permanent. There's no saving in Spelunky. Get munched by a man-eating plant or stomped on by one too many frogs, and you'll have to start again from the beginning.But that's OK, because the game fabulously re-arranges itself each time you play. Level layouts, enemy placements, pick-ups, loot and more - they're all randomly generated, meaning that going back to the start never means re-treading old ground, but instead marks the start of a new adventure.There's a kind of magic at work in Spelunky's re-forming caverns and mine shafts which allows each level to feel personally and meticulously crafted, even though it's been built by maths. The positioning of every single tile and monster is immaculate, the multiple routes around each level all offer a perfected level of challenge and the game never backs you into a corner from which it's impossible to recover.You start at the top and your aim is to get to the bottom, where you'll find a doorway to the next level. The deeper you spelunk, the more vicious and numerous the enemies and obstacles become. Drops become larger, walls become higher and exits are surrounded by more environmental nasties to catch you off-guard. But bombs allow you to blast through the rock, carving your own custom-built shortcuts while mining for additional loot, and ropes let you safely descend huge distances or reach ledges that are too high to access with a jump.While you'll often find yourself clearing a level in under a minute, each time you locate that elusive exit feels like an enormous victory, every new map a terrifying adversary to face. Spelunky is the definition of unforgiving, but it's careful always to play fair: when you die, it's because you made a careless leap, pushed your luck against an unfamiliar monster, or weren't paying attention to your environment. You die because the game is better than you, and it drives you to better yourself.From the cave entrance you head into the mines, then into a vast underground jungle where natives attack you with boomerangs and giant snails bombard you with toxic bubbles. There's a stage where woolly mammoths stomp around caves of ice, and a secret temple that's home to unfathomable treasure.When you start out, reaching the later stages seems like an impossible dream, as you succumb time and time again within the first couple of levels. But, gradually, you start to make progress. You work out the best strategies for dealing with the surprises Spelunky throws at you, and you establish your favourite way to navigate the environment. When you finally reach that next stage, it's an extraordinary personal victory.Then you die, and it's all the way back to the beginning.~If this were a straight port of the already brilliant PC version, it'd be one of the easiest recommendations of the summer. But it's so much more.~It becomes Spelunky's most devious trick. The game dangles these new areas in front of you - areas which re-invent the rule set in brilliant new ways - then whips them away. It's a sort of beautiful frustration: the ultimate carrot on a stick, tempting you further into the game, teasing you by blocking your progress just when you think you've hit your stride.And it teases you until it's just about pushing its luck, then throws you a lifeline. Every time you reach a new stage, you meet a man who offers you a deal. Furnish him with some of your loot or resources and he'll get to work on building a short-cut. Strike enough of these deals and a new doorway opens up in the starting area, allowing you to head straight to the furthest stage you've reached. This becomes the new beginning of the game. You're one step closer to your goal.Those who spend their time mining the internet for hidden gaming gems might remember Spelunky as a freeware PC title from 2008. Perhaps surprisingly, this Xbox Live Arcade version makes few concessions to its bigger market. There is no 'dumbing down' of its brutal roots. There's a slightly expanded tutorial, but the pace at which the game introduces new elements means it's not much help past the first few levels: a good thing, as half the joy of Spelunky comes from working out its systems, second-guessing what it might throw at you and, ultimately, getting it wrong.Getting better at Spelunky means understanding that you should never trust your assumptions, and developing a hyper-awareness of the danger that lurks everywhere. But the exciting ways in which the game world reacts to your presence also open up wonderful opportunities for experimentation.It won't be long before you realise that a shop isn't just a place where you can spend some loot; it also presents an opportunity for armed robbery, shotgun face-offs and hidden treats further into the game. Quickly, traps become chances to lure in enemies, allowing you to take out the more difficult foes without getting uncomfortably close. And you realise that damsels in distress, who grant you an extra life if you carry them to the level exit, can also be sacrificed on an altar. What does that do? You'll have to try it to find out.There's extraordinary scope for trying out different strategies, too. You can meticulously collect loot to spend on fancy weaponry and gloves that let you climb up walls, or you can speed-run through levels in the hope that you'll never need to purchase a thing. You can save damsels to increase your life expectancy, or traverse obstacles carefully enough that doing so is less important. Crucially, the balance is perfect: no one style of play is clearly preferable to another, each boasting its own strengths and presenting unique risks.If this were a straight port of the already brilliant PC version, it'd be one of the easiest recommendations of the summer. But it's so much more. Most obviously, the charming pixels of the original have been replaced by a sea of high-definition artwork. It bathes the game in a vibrant cartoon aesthetic that blends the painterly tones of Braid with the personality of Plants vs. Zombies, and it's genuinely gorgeous as you head into the later stages.But most significant is the addition of multiplayer, which proves to be yet another roaring success. Up to four local players can take on the adventure co-operatively, working together to overcome its many obstacles and, inevitably, also getting in each other's way. As a result, co-op becomes a gleeful, maddening experience, the room alive with shouts when someone falls into yet another pit or blows up the rest of the team with a badly timed bomb-throw.In co-op, you end up playing with less pace, because those split-second decisions that helped you in single-player now have to be communicated and agreed upon in order to work. But fail to play quickly and the game gets cross, hurrying you along in properly panic-inducing ways. Co-op transforms the adventure into a nail-biting race against time as you argue about which would be the best tactic to use. It's a ridiculous amount of fun.What's more, there's a completely bonkers local deathmatch mode, which pits you against up to three others in small, trap-filled arenas and invites you to go nuts. Rounds are often over in a matter of seconds, with players plunging into spike pits to their doom or spamming the entire map with bombs, but the better games turn into frantic extended chase sequences involving ludicrous knives, unpredictable teleporters and guns that entangle people in spider webs.All of these items, incidentally, are available in the main adventure too: they're hidden inside treasure chests or available to purchase from the occasional specialist shops that spring up within a baffling network of caverns. There's just so much to uncover, all of it changing the game in fantastic and unexpected ways.Spelunky's astonishing creativity and the spectacular depth that opens up as you make progress make it easy to forget that it's also an extremely competent platformer, with tight, poppy controls that work far better on an Xbox 360 pad than they ever did with a computer keyboard. Playing feels tactile and physical yet precise and comfortable. It allows you to bounce around the world with ease, and focus on the meat of the game: the joy of discovery, the hilarity of death, the glorious secrets that pour from every crack.Every now and then, probably on a confident run, you'll enter a new level to find it drenched in darkness, a measly torch the only way to navigate its pathways. Spelunky switches off all the lights so it can shower you with surprises. For a game so obsessed with plotting your demise, it sure knows how to keep on giving."}