{"ref": "https://www.eurogamer.net/saints-row-4-review", "date": "9 Feb 2015", "game_name": "Saints Row 4", "text": "It feels strange to say it, but Saints Row has to be chalked up as one of the success stories of the current console generation. It's an unlikely kind of triumph: what began as little more than a poor man's GTA has evolved into a kind of anything-goes sandbox action game, but it's hard to pick out a defining characteristic beyond the fact that it lets you do stupid stuff.Four games in and it's reinventing itself again. Cars are no longer for stealing; they're far better used for throwing. Yes, we're in superhero territory, the ground occupied by the likes of Prototype and inFamous, and a potentially tricky area for a series as famously chaotic as Saints Row to attempt to conquer.  Happily, Volition has made it work, hitting that sweet spot between empowerment and vulnerability. It finds that balance partly in a fitting threat level. Saints Row's pimps and gangsters just aren't going to cut it any more, not least because, at the outset, it turns out the Saints' influence has spread as far as the White House. Your protagonist doesn't have long to enjoy his presidency, though, because no sooner have you passed a bill to cure cancer or end world hunger (a jab at Fable 3's moral dilemmas, perhaps), a race of alien invaders beams down and kidnaps all your friends, imprisoning you in a simulation of Steelport, the fictional city we saw in the last game.It's an arresting opening, and if its narrative riffs on The Matrix are dated, it serves as a useful framework for the action that follows. Former FBI agent Kinzie Kensington - an able and charmingly zesty presence throughout - hacks into the code of the simulation, giving you the powers you need to defeat the Zin threat and save your friends.In the early game, at least, it feels a lot like Realtime Worlds' Crackdown. You'll sprint and leap around Steelport, grabbing blue data clusters which can be spent on upgrading your abilities. There's a similar compulsion to ignore the story quests and simply hunt down the glowing collectibles - more so when you gain the power to glide between rooftops.Superpowers naturally feed into the game's combat, where Saints Row 4 takes cues from inFamous and Prototype, the latter's influence particularly obvious when you learn to sprint up the side of buildings. As you gain more powers, you'll blast fire and ice projectiles, throw things with telekinesis, create shockwaves with a powerful ground stomp, and combine them all with weapons like a tentacle bat (this game's similarly wobbly replacement for Saints Row: The Third's giant purple dildo) and a singularity gun that generates miniature black holes.Volition can't always decide whether it's parodying an idea or just embracing it, but there's a clear and wide-eyed affection for the games it either apes or mocksIt all sounds very silly, and it often is - yet that's precisely why a lot of people first bought into Saints Row as a genuine alternative to GTA. Encounters are chaotic and often downright shonky, but they crackle with unpredictable energy, and the range of options available from quite an early stage make these powers a joy to experiment with. If you're finding the cooldown times a little too long, then you can leap onto a roof and snipe the aliens from a high vantage point. Later, you might clear out an occupied zone by sprinting around madly setting everything on fire. You can freeze enemies and shatter them with a haymaker. You can opt for a dramatic entrance by gliding down to a truck, picking it up and lobbing it into a group of enemies, sending them scattering across two blocks.The frame-rate doesn't always hold up, but if that's the price to pay for such giddy mayhem, then it's a bill most will be happy to foot. Occasionally, it escalates a little too far: the endgame in particular is guilty of simply chucking larger numbers of enemies at you, all but requiring you to have completed the loyalty missions for all your teammates so they can help out in the final battle.If that idea sounds familiar to Mass Effect fans, then it shouldn't come as a surprise. Saints Row has always been a magpie, pilfering an assortment of ideas from other games and re-appropriating them for its own demented ends. Volition can't always decide whether it's parodying an idea or just embracing it, but there's a clear and wide-eyed affection for the games it either apes or mocks. And if at times it's aiming for obvious targets, it hits the mark surprisingly often. A Metal Gear-inspired mission sees your partner obsessed with shooting lights rather than enemies, and there's a wonderfully rudimentary take on BioWare's character romances, prompting a brief but splutteringly funny exchange that highlights a rather more even-handed treatment of Saints Row's female cast than in previous games.Indeed, Kinzie in particular is a delight: a bundle of energy, bravery and channelled anger and probably the closest the game gets to a likeable person you can relate to. That's not to say the others aren't fun - though attempts to introduce more serious character development are optimistic to say the least - and there's the return of a former favourite, a cameo from at least one famous wrestler, and Keith David playing a deliciously vainglorious version of himself.You'll cut through a slice of Fifties apple-pie Americana with a dubstep gun and fly through space to the strains of Haddaway's What Is Love? You can't accuse Volition of phoning it inIn the end, it boils down to a series of rescue missions, with each Saint trapped in their own simulation, usually based on their idea of hell. It's a conceit that allows Volition to really go to town with its most outlandish ideas: they don't all work, but there's fierce, restless invention at work here. You'll cut through a cheerful slice of Fifties apple-pie Americana with a dubstep gun, fight your way through three levels of an old-school side-scrolling brawler, battle a giant sentient can of energy drink from inside a statue wielding a ladle, and fly through space to the strains of Haddaway's What Is Love? You certainly can't accuse Volition of phoning it in.In places, Saints Row 4's systems could even be considered refined. The last game's excellent GPS returns, and this time there's more encouragement to point it towards one of the myriad side activities. As you complete these missions, you'll liberate Steelport's districts from alien control, gradually lightening the oppressively dark skies and increasing your hourly income from the areas in question, which gives you more money to spend on the generous range of abilities, weapons and perks. It helps that the missions themselves are pleasingly varied - a bit of vertiginous platforming here, a mech-suit rampage there - while the Fraud asides which see you hurl yourself into traffic for insurance money are more ludicrous than ever, your new powers seeing you cartwheel and somersault across bonnets and bumpers like a one-man Katamari.Of course, with such pervasive madness, there's little to subvert, and over long sessions it can get a little wearying. As daft as it gets, there's arguably nothing quite as gleefully anarchic as Saints Row 2's poo-spraying interludes, and the familiarity of some elements leads to the nagging sensation that we've been here before. It's disappointing, too, when your powers are briefly taken away, or you're forced to do something as mundane as stealing a car. But then you'll play a mission while baked on alien narcotics - temporarily affording you unlimited powers, of course - and all is forgiven in the chaos that follows. Saints Row 4 may lack refinement - nothing thwarts a superhero quite so frequently as an overhanging roof or your homies standing in a doorway - but it compensates with sheer exuberance. It's a heartfelt love letter to the superhero genre and to a medium that makes such madness possible. There's a fine art to being this gloriously dumb, it seems, which pretty much makes Saints Row 4 the Sistine Chapel ceiling of stupidity."}