{"ref": "https://www.eurogamer.net/rogue-legacy-review", "date": "9 Feb 2015", "game_name": "Rogue Legacy", "text": "There's an enemy called a McRib in Rogue Legacy. I can't tell you what these guys look like, but I know they exist because I was finished off by one, and the game's epitaph screen tells you precisely what it was that eventually did you in. I also know that they often lurk at the top of rooms, and they love to drop jaunty showers of human femurs down on their prey.Whatever shape they take, the McRib ended the career of Lady Chun-Li XV, a Spelunkette who had a surprisingly decent run of things despite colour-blindness and a bad case of dwarfism. She certainly fared better than Ladies Chun-Li XIV and XIII (thoughts to the family). All told, she brought in a haul of just under 4000 gold coins: not too shabby for a spelunker class, who are good with loot but otherwise pretty weak and feeble. I used the winnings to buy a health boost and an attack boost: I was investing in the future. I knew that when Lady Chun-Li XVI came around, she would now be slightly less weak and slightly less feeble.Rogue Legacy is witty, elegant, and cruel. I've spent the last week trying to work out whether I mostly love it or hate it, and I've finally made my mind up. I know I love it, because it feels like the weird medieval faire-attending cousin of Spelunky, offering a sequence of short 2D lives that are explored in a rich platforming ecology where even your 30th hour will reveal a fresh secret. I have occasionally wondered whether I might hate it at the same time, though. It's too good with the compulsion stuff. It draws you in with cleverness and soothing repetition, and once you're into the mid-game, it can sometimes seem to offer little but grind in return.That said, it might be better to think of it this way: it's a game that's really thought about grind, and it often makes the grind magnificent. Rogue Legacy takes the procedurally jumbled environments and fairly regular deaths of roguelikes, but it offers a vital twist. When your plucky knight meets his or her end in the game's sprawling castle, their stats and loot will live again, Infinity Blade style. You get to re-enter the fray as one of your own offspring: you'll stay at the same level and you'll inherit all the armour and perks your parent died with, but you'll also have a few random genetic quirks thrown in to keep things interesting. Just look at the next generation waddling into battle, chestplate clanking and sword held innocently aloft. This time things will turn out differently, they seem to be saying. Knock yourself out, says Rogue Legacy. And then Rogue Legacy laughs.Marvellous things, offspring. Beyond a change of class - you might be anything from a paladin, which is a great all-rounder, to one of those loot-hungry spelunkers, or even a lich king, who starts weak but earns a new HP upper limit with each kill - you'll also play the chromosomal lottery, picking between a trio of potential heirs who could have ailments ranging from OCD to dementia. Each of these traits affects the game in a specific way, whether it's something cosmetic, like stereo-blindness meaning that the enemies you face behave like paper cut-outs when they turn, and baldness, which replaces the loading screen's ~Building...~ text with ~Balding...~, or something a little more significant. Short- or far-sighted offspring see the game through carefully arranged splodges of Vaseline. ADHD offspring move faster. Endomorphs can't be knocked back by enemy attacks, while hypergonadism means your attacks knock enemies back further than normal. Welcome to the abnormality sweet shop.Genetic variation keeps things fresh as you work your way through the game's scrambled castle again and again. You earn a little more loot each time as you defeat enemies and smash up furniture, and then you spend it on permanent stat improvements and new armour when you've finally keeled over and your new kin emerges back at the gates, ready for battle. Inside and outside: two different rhythms, both ticking along in close proximityInside the castle, the combat has a lovely chop and crunch to it, while the enemies are a varied delight, from zombies who emerge suddenly from the floor, to hovering wraiths that might unleash fireballs or ice or bring pillars of jagged rock out of the ground. Travel further into the darkness and you'll find shuriken-flinging devils and giant chain-wielding armoured guards in Hulk-green armour. Loot chests give way to mimics, headless horses canter amidst wolves, and grumpy skulls float, just out of reach, ready to spam you with ungodly plasma. When you're not fighting, you're exploring a procedural world that, like Spelunky, seems to have been put together with a stubborn sense of authorship. In a misty attic you might encounter a juke box or a funfair concession that offers some kind of prize. In a glistening forest, you could discover a towering group of skeleton twins acting as a mini-boss, or a fairy chest - these give you precious runes - that will only unlock for you if you meet specific criteria, such as reaching it without taking any damage, or finishing off every nearby foe. The attic's always above the main castle, the forest's always to the right. And below is a hellish dungeon where visibility is reduced and awful things lurch from the shadows Outside the castle the game isn't bad, either. In between lives you can spend loot unlocking new classes and a range of fairly traditional stat boosts - they cover stuff like how much equipment you can carry, health, attacks and critical damage - and you can shell out for new armour once you've found the right blueprints, and new runes to stick in sockets. Both of these elements confer yet another layer of intricacy: I like to wander about decked out in Vampire duds, which leach health from my enemies, but it's one choice amongst many. Runes, meanwhile, can be stacked, regardless of whether you're using them to reflect damage back on foes or master movement tricks like a slide and a double jump. A stackable double-jump is a beautiful thing. Triple-jump, quadruple-jump: it's like climbing invisible stairs.Even here, though, when Rogue Legacy's being generous, it's also being cruel. Before your next journey, you can pay an architect a cut of your winnings to temporarily lock down specific configurations of the castle when you're after a boss. That's undeniably nice. On the other hand, Charon's always waiting at the gates of the castle for you, and he'll take almost all of your money each time you enter. You can't steadily amass a fortune to pay for the top tiers of stat boosts, in other words - you have to earn that fortune in a single heroic run and then cash it in immediately. As your skill and your stats start to improve, the prices you'll pay for things scale along with it, too. It's all very elegant and appealing, and not even a handful of progress-halting bosses can ruin things too much. Each area of the castle comes with one of these monsters, and they will initially bring the game to a juddering standstill until you level and learn - gaining the HP you need to take them down, but also coming to understand their particular tells, and their specific weaknesses.Levelling and learning: Rogue Legacy's race-tuned for capturing that wonderfully mindless strain of achievement you get from a dungeon crawler, then, but it offers antic platforming and a surprising level of tactical thoughtfulness layered on top. This combination - and some wonderful detailing in the enemy design - ultimately saves the whole thing from that sense of emptiness that can set in during the middle of a loot-grinding adventure where you feel you've seen a good proportion of what the game offers and now you're just trying to raise your stats and plough on to the end. Canny enough to keep you hooked, but sufficiently honest to throw in something a little more nourishing too, the genetics are pretty strong with this one."}