{"ref": "https://www.eurogamer.net/woah-dave-review", "date": "9 Feb 2015", "game_name": "Woah Dave!", "text": "Spelling matters. Take, by way of a convenient example, the word ~woah~. A slang term, popularised by the great sage Keanu Reeves, it is used to express surprise, delight and excitement. However, shuffle those same letters around a little and you get ~whoa~, which is horse language for ~stop~.Spelling matters. As the title suggests, Woah Dave is a game very much designed around the Keanu-approved version of the word. This is a game that surprises, delights and excites. Woah indeed. In contrast, should you attempt to play according to the second equine-skewed spelling, you will suffer badly. This is not a game where stopping is recommended. This is a game where to stop means pretty much instant death.Woah Dave is a single screen confection which reaches back to the very dawn of arcade gaming for its inspiration. Playing as Dave Lonut, a short and square little fellow who looks not unlike a minimalist pixel art version of Sesame Street's Bert, you must hop from platform to platform while eggs drop from the sky. After a short delay these eggs hatch into monsters, and every time a monster hits the lava at the bottom of the screen, it evolves into a new enemy type.The first simply walks non-stop in a single direction until it falls into the lava. The second does much the same, but this time it moves faster. The third type can jump, while the fourth and final monster type is something called an eye-bat. These flying eyeballs will home in on Dave relentlessly. In addition to this bestiary, there's also a UFO which will sometimes zip around the screen, blasting a laser out beneath it, frying Dave and destroying platforms.The final variables are skull-shaped bombs, which detonate after a short time, and Woah Blocks, which act as screen-clearing smart bombs. Dave only has one power to keep him alive in this hostile environment: he's great at picking things up and throwing them. Grab an egg and throw it in the lava. Grab a bomb and throw it next to some eggs to destroy them. Of course, if you're holding an egg when it hatches, or a bomb when it goes off, you die.Scoring is similarly streamlined. You earn coins for every monster killed, and the amount of coins depends on how evolved it was. This isn't a game where you'll be earning massive scores though. You literally earn one cent for every coin, so a score of anything over one dollar is pretty respectable.That's because, true to its arcade heritage, this is a game that gets insanely frantic very quickly, and it's here that its genius begins to show. This is a beautifully designed game, with the ruthless pared-back structure that was once the heart of all entertainment software.Consider the graphics, and the way they use colour and shape to immediately imprint specific behaviour types in the player's mind. Listen to the audio cues that tell you what is about to happen, not just what happened. Ponder the complete absence of tutorial or instructions, and the way the game teaches you how to play while actually playing. There's a real poetry to games like this, where rules become self-evident through experience, where strategies and expertise evolve organically through play, and where the two combine to create something that looks simple yet effortlessly prompts deeper and deeper understanding without any of the ~press this button to jump~ hand holding that modern games get bogged down in.Woah Dave's ancestors are as numerous as they are obvious. There's a healthy dose of the original Mario Bros in here, and the debt to Bubble Bobble is also unmistakable. It has a pace and a fluidity that is very modern, though. It's a delicate balancing act that is unusual even in the retro-obsessed indie gaming scene, until you realise that developer Choice Provisions used to go by the name Gaijin Games, and was responsible for the similarly brilliant Bit.Trip series.Woah Dave represents a definite but subtle shift in the studio's output, however. It's sillier, more manic, more characterful than the more abstract games under the Bit.Trip brand. If they were Japanese anime, stylish and obtuse, then Woah Dave is a Saturday morning cartoon, all googly eyes and goofy sound effects.It's simply a joy to play. The jump - that barometer of success for any platformer - says it all: a finely tuned hop that is lightning fast yet controllable to within the space of a pixel. It's pretty much the only thing you do in Woah Dave, and it still feels great hours later. And that's beautiful. The debate over games as art always seems to come down to serious, story-driven experiences, but Woah Dave is as much a work of art - if not more so - than any of those. Because this is the art of game design at its most pure and instinctive. This is the perfect three-minute pop song of gaming.At a time when games still define themselves by the sheer wealth of content they offer, by the hours of campaign missions, the however many hundreds of levels they contain, it's fantastically refreshing to be reminded of how absorbing a single screen, a handful of rules and some colourful squares can be."}