{"ref": "https://www.eurogamer.net/metal-gear-solid-5-ground-zeroes-review", "date": "9 Feb 2015", "game_name": "Metal Gear Solid 5: Ground Zeroes", "text": "By the time of Metal Gear Solid 4: Guns of the Patriots, Kojima Productions' series - often thrilling, sometimes tiring but never anything less than fascinating - had twisted itself into a dead end. In the creaking fatigue of the ageing Snake, a battle-weary individualist at odds with wars fought by faceless corporations and their automatons, it was hard not to see some of creator Hideo Kojima himself; a man with a singular vision lost in the broad, mundane chaos of contemporary games development, slowly tiring of the very thing that had forged his own legend. Peace Walker, the PSP entry that followed some two years later, stripped back the excess, partly through necessity upon finding itself on a portable platform, partly to inject new life into the series. Those excisions helped remind players that, for all the narrative bloat that had blighted Guns of the Patriots, beyond the cut-scenes and heavy-handed exposition Metal Gear Solid remained a video game - and an often exceptional one at that. Ground Zeroes, a sequel of sorts to Peace Walker and a prologue to the full-fat Metal Gear Solid 5: Phantom Pain, goes even further. It's a short, concentrated burst of the newly introduced open-world gameplay systems, and it suggests that Metal Gear Solid 5, across its two instalments, could be the most significant evolution in the series since it gained its Solid suffix. There are questions about how short exactly the experience is, and how that sits with Ground Zeroes' not insignificant price tag - but forget all that. Like the Ennio Morricone and Joan Baez anthem Ground Zeroes heavily leans on, it's a punchy, proud and stirring experience. You can't put a price on class like this. Ground Zeroes sees Kojima Productions analysing the blueprints of Rockstar's Grand Theft Auto and Ubisoft's Assassin's Creed, re-sculpting and retooling them to create a flexible spin on the stealth genre as pure as it is slick. The shift to the open-world genre ensures that the environment does much of the heavy lifting, and it helps that Ground Zeroes' own Camp Omega is something of a treat.An enemy installation in which Paz and Chico, two returning characters from Peace Walker, are being held captive, Camp Omega is a tangle of outhouses and courtyards scruffily bordered by rock-faces and foliage, with a warren of concrete tunnels running underneath. There's no fussiness in how you set about exploring the space, and nothing beyond an obligation to extract the captives and an invitation to tinker with Kojima Productions' often extravagant systems. It's not so much about what's been added in Ground Zeroes, more about what's been artfully taken away. Gone is the Soliton radar, your map relegated to a handheld device brought up in the pause menu, and absent too are waypoints bluntly marking your destination. They're omissions that only strengthen your immersion in Ground Zeroes' world - finding your mark becomes an exercise in deduction and exploration rather than relying on banal markers. In one swift cut, this edit solves a problem that's blighted the open-world genre for years. Snake, too, has been pared back. That much is clear when he first speaks - Kiefer Sutherland's performance moves away from the pantomime growl of David Hayter and brings a more balanced, human tone to the role - and then stretches outwards. The camouflage system of Peace Walker, Snake Eater and Guns of the Patriots, an amusing but often messy obfuscation across its many incarnations, has been removed completely. It's light, shadow and lines of sight that now blend together to create Ground Zeroes' new brand of stealth. Close-quarters combat has been refined, providing a less awkward, more fluid way of dealing with enemy soldiers - they can be hurled to the ground and knocked out cold, or a knife to the throat can be used to draw a fatal slit or to threaten and cajole fresh information out of them - while gunplay has been retooled to the standard of more trigger-happy third-person shooters. It makes going loud a more viable option - as do the turrets and armoured, weaponised APCs dotted throughout Camp Omega, begging you to steal them for a thunderous joyride - yet the silent path has also deepened, ensuring there's a healthy balance still in place. Stealth is more flowing and more organic; the loss of the Soliton radar is countered by your ability to mark enemies through Snake's binoculars, allowing a broader view of the battlefield, and when Snake's spotted there's a brief window of slow motion during which you can fire off a shot or perform a takedown before the alarm's triggered. It's a softening, perhaps, and it's possible to opt out of both features, but the sterner challenge presented by life away from a mini-map means the additions are more than welcome.Solutions, meanwhile, are plentiful. In the main campaign there's a fortified base that must be broken into; you can sneak in through a system of ducts, politely wait at the front door with a heavy armoury at your disposal to help you force your way in, or surreptitiously stow away in one of the trucks patrolling the perimeter and wait for it to drive inside. Or you could even plant some C4 on the underside of a truck, waiting for it to make its rounds and detonating the charge as it passes through the front entrance, leaving the gate wide open. Ground Zeroes is a joyous tangle of toys jostling around in a well-formed sandbox, and the various side missions that sit separately from the main campaign take great pleasure in pushing you to explore and exploit them. They're a playful bunch, revelling in emergent action that unravels in often unpredictable ways. Spend eight hours dabbling with Ground Zeros' playground and it will still find so many ways to surprise you. The very best thing about Ground Zeroes is how the series has cast away so many of its cinematic pretensions and fallen in love with being a video game all over againAll of which relegates Metal Gear Solid's notoriously contorted plot to a sideshow, swept into two major cut-scenes that top and tail the campaign as well as a horde of audio cassettes gradually unlocked throughout. It's slim and slightly inconsequential, with a villain who's all but absent and with threads left dangling throughout as it tees up the events of Phantom Pain. Yet still it manages to spin together a solemn, clumsily conscientious tale that pulls together heavy-handed swipes at US foreign policy, allusions to wrongly convicted Italian anarchists Sacco and Vanzetti and one particular lunge well beyond the realms of taste and decency. Thankfully, its more wayward moments are left in the background, ferreted away for those in tune with Metal Gear Solid's twisted lore to discover for themselves. For everyone else, the very best thing about Ground Zeroes is how the series has cast away so many of its cinematic pretensions and fallen in love with being a video game all over again. As a precursor to Phantom Pain, it suggests that greatness awaits, but even on its own terms Ground Zeroes is something special. In the purity of its systems and the focus of its action, it's not just an antidote to the glut that had begun to weigh down Metal Gear Solid but also to the bloat that weighs down so many of the series' big-budget peers.Welcome back, Snake. You've been missed."}