{"ref": "https://www.eurogamer.net/the-banner-saga-review", "date": "9 Feb 2015", "game_name": "The Banner Saga", "text": "The Banner Saga is a tactical RPG that's been pushing its way into my thoughts even when I'm occupied with other things. Its epic tale tells of a sun that no longer sets, the death of the old gods and a land on the brink of war - but it is the more mundane burdens of leadership that weigh most heavily on my mind.I'm haunted by the disheartening discovery of spoiled supplies that dented the morale of a beleaguered caravan, and the foolish gambit that saw a decorated warrior lost to the ignominy of freak accident. The crushing guilt of losing people to starvation because I purchased a trinket to protect a favoured archer in battle, rather than ensure a surplus of supplies for the journey ahead, acts as its own damning indictment of my leadership. You too may come to rue these misfortunes or, by exercising better judgement than I, you might avoid them entirely.The Banner Saga is a game of choice, and the fact that I can outline my mishaps here without fear of spoiling your own sense of discovery is testament to the myriad scenarios it presents, and the permutations of outcomes that can play out. It's a game in which a character can survive the 20-plus hours to the adventure's end or die minutes after they're introduced, and where well-meaning attempts to save an imperilled few can call down greater suffering on the heads of many.This constitutes one half of The Banner Saga experience: a series of multiple-choice scenarios throughout an epic journey that takes in sweeping vistas and frozen wastes, where hard-bitten communities eke out an existence on the edge of humanity and pilgrims trek to ancient Standing Stones to pay homage to dead gods. It's a world with a rich sense of history, filled with politically charged relationships that see the deep-seated superstitions of a clan chieftain threaten the long-standing alliance between humans and the giant race of varl, and where your conduct during seemingly incidental moments can change your path through the game. Given that your decisions play such a pivotal role, it's a shame that your deeds are not recorded in a log, as it would be wonderful to relive past glories or revisit shameful failures. This feels like a missed opportunity when you consider that the game's storyline features a strong focus on how vital it is to preserve history; the titular banner is a canvas upon which families stitch their stories for posterity.The painterly art style that depicts these moments of local colour and wider-world travel is one of The Banner Saga's most immediately obvious strengths. Although it occasionally suffers from reuse of assets and stilted transitions, it is a joy to behold. In the closing credits, inspiration is attributed to the late American artist, Eyvind Earle, whose work as an illustrator graced a number of Disney features in the 1950s, and the small team at developer Stoic has interpreted this style to great effect in both its epic landscapes and the subtle animation of its characters.When you're not cooing over the aesthetics or fretting over mismanagement of your caravan, you're engaging in the grid-based combat encounters that form the other half of The Banner Saga. Combat is predicated on a number of straightforward attributes that combine to form an elegant and complex system; it achieves that magic combination of easy to understand and difficult to master. At the heart of combat are strength and armour. The former indicates how much damage a character can do and also doubles as their life points, while the latter represents how many points of damage can be deflected, down to a minimum of one. Surplus armour points reduce the attacker's overall chance to hit, and so as a character's strength is reduced, so too is their effectiveness in combat - which results in a tactical trade-off between reducing an enemy's strength as quickly as possible and chipping away at their armour first in order to do more damage with future attacks. Willpower offers bonus points with which to bolster damage, extend movement range and use special abilities, while Exertion dictates how much willpower can be spent on any given action. While the benefits of high strength and armour values are immediately obvious, it's willpower that can often mean the difference between life and death - and although this limited resource does not naturally replenish during combat, its starting value is boosted if the caravan is enjoying a period of high morale. Similarly, it can be nerfed by low spirits, which serves to reinforce the importance of the decisions you take out on the road and how they can directly affect your chances in combat. As your characters level up, you attribute points to their stats up to a pre-determined maximum that is limited by the race, class and potential of the individual. The levelling system is transparent and based on spending Renown points that are earned by killing enemies, but by a stroke of cruel brilliance, Renown also serves as the game's single currency and is traded for supplies and to acquire stat-boosting artefacts. This makes for a precarious balance as you attempt to prepare for unseen dangers on the road and give your characters a fighting chance in combat.     A refreshing take on the tactical RPG with a story every bit as engaging as its combat... a beautiful game filled with ugly choicesFor the most part, characters that do fall in combat are usually injured rather than killed outright; they suffer stat penalties before recovering after a number of days. Initially, it feels cheap that your characters rarely die as a result of their wounds, but soon it becomes part of the challenge to have to rotate them to compensate for injuries. Besides, your narrative choices present danger enough to your characters, and Stoic is not beyond killing off major players that you might otherwise assume will be with you until the end. Furthermore, a well-judged auto-save-only system means that, while reloading a previous save to undo a poor decision is possible, it will usually result in losing several hours of play.A stronger criticism of the combat is its overall lack of variety. Neither terrain nor environmental obstacles affect movement or combat strategies to any significant degree, irrespective of whether you're fighting in a snowy forest or a cobbled town square. There's also a lack of variety when it comes to enemies, with the vast majority of your foes consisting of a heavily armoured race called the Dredge that are bereft of any real personality or design flair. Nonetheless, the strength of the combat system's mechanics manages to prevent it from becoming mired in repetition, keeping things interesting throughout.The Banner Saga offers a refreshing take on the tactical RPG with a story every bit as engaging as its combat. It is a beautiful game filled with ugly choices and tough consequences. While this crowd-funded instalment stands as a complete experience in itself, it deserves to sell well enough that the planned parts two and three might come to fruition. I don't envy the hundreds that have suffered under my ineffectual command, but it would be a shame not to see the saga through to its end."}