{"ref": "https://www.eurogamer.net/hakuoki-memories-of-the-shinsengumi-review", "date": "9 Feb 2015", "game_name": "Hakuoki: Memories of the Shinsengumi", "text": "I've long been in the market for a game that contains the following:You might think: jeez. You are never ever going to be that lucky. Well: I just got really lucky. Hakuoki: Memories of the Shinsengumi is a visual novel for the 3DS that contains everything in my list. Part of the Japanese dating sim genre called 'Otome games', Hakuoki is a robust, interesting and incredibly well-told tale of loyalty, betrayal, and potions that make people into demons.You play a wilful young woman in the late Tokugawa shogunate period. She finds herself alone in Kyoto after her father, who is a doctor, has important duties to undertake with the shogunate. She thinks to disguise herself as a boy to avoid being harassed, but one night is witness to a bloody murder undertaken by Kyoto's infamous Shinsengumi corps - the bakufu-employed, katana-toting special police force. The Shinsengumi initially take her hostage so that she cannot tell anyone about what she has seen, but they find out her father is an important figure, and hope to locate his whereabouts. You are gradually integrated into the inner circle of one of the most notorious samurai squads in Japan's long history. This premise sounds like it might alienate those who are interested in romancing only women, but I'm not convinced of this at all. The Hakuoki series has become, at least from cursory research, a particular favourite with PSP and 3DS owners who confess no predilection to dating men in real life. I put Memories of the Shinsengumi's pull down to how evocative of the samurai era it is and how well the inner squabbles of the Shinsengumi are portrayed.The daily strife of a samurai police force in the midst of the dissolution of Tokugawa power is painted in detailed, involving strokes that are romantic in the quixotic way. Each samurai has a particular job to do and different affiliations, while the art depicts Bakamatsu Japan in the friezes of cloistered tatami, sliding doors and daintily kept rock gardens that it deserves. A Gion courtesan turns up to have drinks dressed in elaborate wig and kimono; war and politics feature heavily in almost every conversation; very strong language is used throughout and bloody deaths are heavily implied through the animated blade sweeps across the screen. It's exciting to be among the hustle of six samurai debating whether to assassinate someone or not - even if your role is only to read and press 'next' until you can initiate your next kiss plan.Perhaps the most surprising thing about Hakuoki is its commitment to the time, place and historical significance of the samurai it winds its narrative around. There's a large 'Encyclopedia' where you can look up terms liberally used in the text, such as 'daimyo' (ruler of a fiefdom). This initially seems at odds with a game that markets itself as a dating sim. Most western romance narratives tend to be very overt when people are interested in each other - they will joke around with each other, go out of their way to touch each other, make excuses to see each other. Men in western films will make drastic gestures of love, give extravagant gifts, suddenly kiss the object of their desire, or will see a woman across a crowded room and immediately go to charm her. There's none of this overt sexuality on display in Hakuoki; instead it is left to the player to try to understand where the object of their affection will be debating important issues of the day and involve themselves in their lives that way. The narrative really benefits from taking the backdrop seriously - not only is it more immersive, but it becomes important to you as a reader. (For a little cultural context, my time living in Japan was spent interrogating Japanese friends on what they thought of western culture, and often, over frosted-glass nomihoudai, Japanese men would tell me of how cheesy, crudely ostentatious, and sometimes overbearing western men seemed in films deemed 'romantic'. When I dated Japanese men it was a drawn out, subtle process of a seeming multitude of signs and signals I assumed I was missing or misreading until I stopped trying; but I have since learned that often months can go by without any sign the Japanese man you are dating is intimately interested until they suddenly declare their love.)Hakuoki holds this refined restraint at its heart; narrative decisions you make throughout the text influence how much a certain rockstar samurai likes you ('romance' bars appear in the 'biography' page next to the six samurai names). When you make a decision that makes a 'positive impression' on a man, some cute cherry blossom dances across their visage, which is certainly something I'd have liked to happen in real life once or twice. There are six endings, depending on whom you become closest to. I've been coached by Otome game enthusiast and ex-Irrational lady Amanda Cosmos that this is typical of the genre. You can check out her excellent Otome game 101 for more info.And yet, I'd finished the game three times and never kissed anyone; I'd begun to think my foray into dating sims had become some sort elaborate joke on the part of the universe. I've played through Dragon Age and Mass Effect and begun a sex and relationship game column over at Rock Paper Shotgun (they let me call it S.EXE, for some reason), and every single time I've failed to attain the fantasy man of my dreams, which is very funny to all my friends. Garrus in particular never really stopped doing his calibrations, the baritone bastard.~It turns out I was role-playing myself, which was why I wasn't successful at attaining any of the fantasy men in Hakuoki.~I sought love-life advice. The advice came back: Hakuoki is not a game where you answer how your character would answer, instead it is a game about how well you know the man. It turns out I was role-playing myself, which was why I wasn't successful at attaining any of the fantasy men in Hakuoki. What I was doing was a spread bet: I'd go with dating everyone to test them out, see if I wanted to invest and then choose the best one. This resulted in the best story, Hijikata-san's, but it was also one of the saddest. Instead, the idea in Otome games is to commit early to a man of your choice and then replay the game to date a different one.Hakuoki's replayability in particular is facilitated by a number of excellent systems: the Y button is assigned purely to skipping text you have read before to go straight to decisions, the 'History' section shows already scrolled text, and you can select to rewind to a particular section - say, before a decision. As Amanda advised me, replaying to 'get' different men each time is essential, because in Otome games each guy is a 'capturable character': it's a sort of samurai-dude Pokémon situation. Gotta catch 'em all. And as if to reinforce this, Hakuoki: Memories of the Shinsengumi has an 'Extras' section where you can unlock different short stories told from the different characters' point of view, and a picture gallery of your hot samurai men is also available after you have unlocked parts of their narrative in-game. Worth mentioning is the immaculate voice acting: all of the original Japanese dialogue remains and only the text has been (similarly meticulously) translated into English. Understanding Japanese, I often find it difficult to watch Japanese dramas with English subtitles that don't quite fit the meaning of the original. There's none of that here. The translators and proofreaders have done an excellent job conveying both meaning and emotion through text. The music is cute, and the art is simple and beautiful. This game is so worth its eShop price.And: I did finally get my kiss. Do you hear that, Garrus? A samurai gave me a kiss. He had no calibrations to speak of, and he just stuck his tongue down my throat and it was GREAT. He also had a cool sword. Eat it, you big space lizard."}