{"ref": "https://www.eurogamer.net/professor-layton-vs-phoenix-wright-ace-attorney-review", "date": "9 Feb 2015", "game_name": "Professor Layton vs. Phoenix Wright", "text": "~All rise!~ ~Your Honour, we are here today to hear the case of Professor Layton vs Phoenix Wright: Ace Attorney, two popular 3DS puzzle series brought together for the first time by franchise creators Level-5 and Capcom. We will seek to establish that this collaboration has been both creatively fruitful and rewarding for fans of both.~~Your Honour, as the prosecution team, we wish to assert that this 'game' is nothing more than a cheap cash-in, with little artistic merit, that will annoy fans of either title. We also would like to assert that the defence team smells of wee.~~OBJECTION!~ ~Sustained. Prosecution, please refrain from personal attacks, this isn't the comments. Defence, please give us some background to the case.~~Your Honour, for the last decade, gamers have thrilled to the adventures of Phoenix Wright, a handsome lawyer who seeks, above all things, the truth. His five games (plus a couple of spin-offs) have always featured long court cases that play out almost like interactive novels, during which the player must point out inconsistencies in testimonies to prove his client's innocence. The games are filled with wry humour and are known for their excellent animation - particularly the freak-outs when guilty parties are finally exposed. The Professor Layton games, meanwhile, are gentle adventure games that revolve around finding and solving logic puzzles in a timeless setting. This crossover game sees Layton and Wright both transported to the world of Labyrinthia, a medieval city where magic exists and witch trials occur on a daily basis, thanks to the machinations of its mysterious ruler, The Story Teller.~Your Honour, the defence would like to call its first witness - Jon Hamblin.~~Granted. Prosecution, the witness is all yours.~~Mr Hamblin, could you please state for the court your full name and profession.~~My name is Jonathan William Hamblin, and I'm a games journalist.~~Could you please give us your background to the games in this series.~~Certainly, I've played all five Phoenix Wright games, and all but the most recent of the Layton games. I also once cos-played as Phoenix Wright at a video-game-themed fancy dress party.~~You mean you wore a blue suit because you were too lazy to dress up like Mario?~~Absolutely.~~So it would be fair to say that you were a fan of both series?~~I would say so, yes.~~Having played this latest game to its conclusion, did you find that the two franchises were well integrated?~~Yes, I think so - for a tie-in that could easily be dismissed as a cynical cash-in, there's a huge amount of love in this game. There's easily 20 hours of gameplay here, divided fairly equally between the two game styles. At first, the game see-saws between the Layton-style adventuring chapters and the Wright-style witch trials. But roughly halfway through it switches to several Layton chapters on the trot before a grand courtroom finale with Wright.~~Ha! So they've just cut and shut the two games together like an old Ford Escort then? I knew it!~~Well yes, but in practice, the split works well - The Wright chapters are very long, sometimes lasting a couple of hours, and it feels like a breath of fresh air to get to tackle a few logic puzzles after spending all that time poring over witness syntax. The two worlds do eventually start to bleed into each other, with puzzles appearing in the courtroom scenes and vice versa, although only a couple of times, and they could have made more of it.~ ~Witness, could it not be argued that there are few innovations though?~~Quite the opposite. There's a brand new courtroom mechanic as multiple witnesses take the stand simultaneously, allowing you to cross-reference their statements, and check out their body language while other witnesses are giving testimony. It's an interesting new wrinkle in the system, and it's often used to great comic effect. In fact, the hilarious scripts are the secret sauce that makes the Wright games so compelling to play, the clever wordplay mixing brilliantly with the broad slapstick of the character animation.~~But surely, setting the getting in a new location like Labyrinthia means few opportunities for cameos from the series regulars?~~To a point, but there's plenty of fan service here - Layton's buddy Chelmney makes an early appearance, although anyone excited to see him in an idiot-off against Detective Gumshoe from the Phoenix games will be sorely disappointed. Rest assured though, Wright fans, there is a stepladder joke.~~The story, though? Surely the story needs work?~~Actually, the story by Phoenix Wright creator Shu Takami is surprisingly rich. One of the key plot points is the idea that The Story Teller, Labyrinthia's ruler, is compelled to create stories for the masses, but while obsessively writing them, he neglects his own child. It's a fascinating look into the mind of a creative - and considering this was Shu's final Wright game to date (he didn't work on the more recent Dual Destinies), it's tempting to think that after spending a decade spent breathing life into Phoenix and Maya, he's writing from some bittersweet personal experience.~ Phoenix Wright creator Shu Takami is clearly thinking about things with a sense of retrospection and finality here~That's just cod psychology!~ ~Isn't that the name of the new James Pond game, Prosecution?~~Nah, you're thinking of Dark Soles 2.~~I'm still witnessing here!~~Sorry, carry on.~~I think it's legitimate, as Shu is clearly thinking about things with a sense of retrospection and finality here. There are also ruminations on what it means to declare a character to be guilty. Having a death penalty riding on each of the witch trials pushes the stakes considerably higher than in the Phoenix Wright games. It says a lot about the strength of the writing that when one of our beloved characters raises a fist in anger after one such trial, it's as powerful a storytelling moment as we're likely to see in a game this year.~~So you got quite involved then?~~Well, above and beyond these subtler story strands, Takami's story still delivers all the gut punches and turnabouts we've come to expect from his twisted tales, with shocking role reversals and twists that made me gasp out loud more than once - and how often can you say that about a video game storyline? If there is a fault, it's that the player eventually gets ahead of the story. Anyone who's seen a Hollywood twist movie in the last decade will guess the ending roughly an hour or two before the end, meaning that the last few hours of play are a war of attrition with the A button as you urgently tappy-tap-tap through the dialogue to get to the ending you're already expecting. It's a shame really, because the route the game takes to get there is so frequently fascinating and entertaining.~~Ah, so you admit it does have its faults? Now, defence, your cracks are beginning to show!~~Sure, the game does bring over problems from the two individual series - while the Layton puzzles offer a tiered hint system, they never quite give you the full solution, and there was one puzzle that I just could not solve despite opening up all four hints. The Wright sections too can be slightly obtuse, and you can suffer from making the correct logical leap, but having multiple items in your court record that could represent that contradiction.~~Brilliant! I have you on the run now!~~Ah, but in this regard, the game is a little more forgiving than traditional Wright games, as you can use Layton coins to narrow down the items to be presented - but there were still a couple of occasions when I was slightly bemused as to the significance of the item.~ ~Curses! Witness, at least tell me this: would you say this game would appeal more to one fan base than the other? Do you think, for example, that Layton fans will feel short-changed by the big thing that happens in...~~OBJECTION! SPOILERS! And, your Honour, that's a leading question.~~I'll allow it. Continue, witness.~~I guess the game will probably appeal more to Phoenix Wright fans than Layton acolytes - there's hours of courtroom drama, but only 70 logic puzzles hidden in this game, which is less than half what you'd usually get in a full Layton game, and some of the puzzle styles are repeated several times. The Japanese version of the game did feature a year's worth of additional downloadable content though, in the form of 12 puzzle packs, which will go some way to mitigating this complaint if this material is also made available in the West.~ ~Well there you have it, your Honour. I think you're probably capable of reaching a verdict now? Probably a guilty one? Eh, wink, wink?~~Prosecution, this is not a kangaroo court. We tried that, it didn't work. They kept hiding evidence in their pouches and punching the court recorder. But yes, it is verdict time. In the case of Professor Layton vs Phoenix Wright: Ace Attorney, this court awards a mark of... ~~HOLD IT!~~The defence has something more to add?~~Your Honour, I would just like to submit the amazing cameo in the post-credits sequence as evidence before you declare your verdict. ~~OK, let me take a look at... oh yes, that's extremely amusing. Very well. In the final verdict then, with the power vested in me by the court of Eurogamer, I award this game...~"}