{"ref": "https://www.eurogamer.net/mario-golf-world-tour-review", "date": "9 Feb 2015", "game_name": "Mario Golf: World Tour", "text": "Let's hear it for the three-click swing system, eh? Pioneered by Nintendo itself in 1984 NES game Golf, this simple but effective mechanic has been a staple of golfing video games ever since. It's endured because no one's really managed to better it: some would argue the case for Tiger Woods' analogue control, and Nintendo might point to the remote-based mimicry of Wii Sports Club. But neither quite captures the elegance and rhythm of a perfect swing the way this does.Mario Golf: World Tour is a particularly fine exponent of the three-click system. You tap A to begin your backswing, once more as your club reaches its peak to start bringing it forward again, and again to connect with the ball at the right time. It's the physical satisfaction of that final click that makes it. Analogue and particularly motion control lacks that all-important layer of abstraction: the closer you get to the real thing, the more you notice the differences. So while the camera might zoom down the course to track the path of your shot, without that sense of connection between club face and ball, it's like you're forever taking practice swings. Here, the bar moves at quite a fast pace - a full-blooded drive is easy enough to do fairly regularly but you'll need good timing to hit peak power every time. And middling the ball is an even finer art. Sure, after a while you'll be attuned to the rhythm of a perfect shot at full power, which zips down the fairway with the obligatory rainbow trail, but what about when you need to give it a bit less? What about when you're in the rough or the bunker and that sweet spot shrinks to just a pixel or two in width? Or when you're deliberately trying to catch a bit of draw or fade to curl it around an obstacle?Each sticky situation increases the margin for error. There will be a moment where you're stuck in a sand trap and the smart thing to do would be to play the percentages; to chip out and onto the fairway so you can aim for the green on your next shot. And yet you'll notice that a three-wood is enough to get there in one, assuming you can deal with the tiniest of sweet spots and a power bar that's been halved thanks to your awkward lie. You'll need to quickly adjust to swing forward and connect cleanly, otherwise you'll whiff it and likely end up in even worse bother. Decisions! Strategy! Flagrant risk-taking! It's all in those three clicks. Simply by virtue of its extremely solid implementation of the three-click swing, World Tour is already comfortably in 7/10 territory. All it needs for a really big score is a varied selection of well-designed courses, a generous number of options for solo play and versus modes, and a solid single-player structure underpinning it all.  Well, as famous golf fanatic Meat Loaf once crooned, two out of three ain't bad. World Tour's biggest problems lie in the second of the two options available from the main menu. Castle Club is a campaign of sorts for your Mii, but it's nothing like the RPG modes in Camelot's previous two portable golf games. Instead, you mooch around the titular venue, a plush, attractive setting in which you can talk to wandering Shy Guys, Koopas and Monty Moles, who'll either offer tips, observations about the club itself, or banal comments on your progress. Eventually, you'll stumble across the place you're meant to be, which is outdoors, at the Forest Course gate. You're invited to play a practice round, and then complete a tournament to establish your handicap, before finally tackling the course championship. Win, and you'll unlock the Seaside Course, and the process begins again. Beat that, and the tricky Mountain Course awaits. Triumph there, and I'm afraid that's your lot. And if you've played a Mario Golf game before, you won't need more than one shot at the first two courses, and maybe a couple of attempts at the third before you win the triple-crown.That's not to say there isn't more stuff to do. If you're struggling to deal with heavy winds or uneven terrain, you can take a series of lessons that will help you acclimatise. You can test your skills with driving, approach and putting challenges at beginner, intermediate and advanced levels. Head past the practice areas and a real test awaits: the gorgeous, moonlit Sky Island hosts a nine-hole pitch-and-putt where you've got a single shot to land your ball on the green and one more to sink it, with a single failure forcing you back to the first tee. It's frustrating and fun all at once, and Castle Club is sorely lacking more of these interesting asides.Still, it gives me cause to address the pachyderm on the putting green: the season pass DLC and day-one downloads. Just over £10 gets you six additional courses and three new characters, which seems like fairly reasonable value on the face of things. In reality, it's rare that DLC released on launch day or soon thereafter was actually completed during development, but in light of the Castle Club's featherweight campaign, it feels like Nintendo's axe has left a visible mark.When the game launches, you'll be able to play a round against anyone on your 3DS friends list (assuming, of course, they have a copy of the game) or take part in a community match against opponents worldwide. Head downstairs in the Castle Club, meanwhile, and you'll have access to ongoing European and global tournaments, in which you can earn limited edition gear for your Mii, via what looks like one of those electronic airport check-in machines.During our playtest there were five European tournaments - ranging from a regular 18-hole round on the Mountain Course to a nearest-the-pin challenge that totals your distance over nine hole, while a longest drive contest requires you land on the fairway in heavy winds to score. You'll earn new gear simply for competing, and can enter as many times as you like, choosing whether or not to upload your score or ghost data once you've completed the challenge.The latter takes unusual and ultimately rather meaningless form: while you're out on the course you'll sometimes see a ball flying around accompanied by a Mii's face in a speech bubble. The longer challenges are naturally more lucrative, though the entry reward for the sole available global tournament was better than the winner's prize - a complete set of Game Boy-themed items versus 24,000 coins.If you don't fancy competing as your Mii, you can enter one of the Mario Open tournaments instead: some use fixed characters, with others limiting you to a single item type. Setting up your own tournaments is a fairly swift, painless process, too: you can post them publicly for anyone to enter, or generate a private code to share with friends. The (tolerably brief) loading times are enlivened by the presence of cute little animations that riff on the original Super Mario Bros - you'll see the ball bounce off a trio of Bullet Bills into the hole, or hit the switch that plunges Bowser into his lava pit.All in all, it's a remarkably solid online offering from a company that tends to favour local play and compensates somewhat for the Castle Club's anaemic campaign.While that might leave a slightly bitter taste, everything outside the Castle Club's doors is a good deal sweeter. Those three courses are joined by several more from the Mushroom Kingdom, which are steadily unlocked by completing challenges. Some ask you to complete three holes within a strict time limit, while give you Star coins to collect or rings to shoot through en route to parring the hole.The placement of coins and rings is wonderfully devious, particularly from the third course onward: you're almost always forced into playing risky shots to reach them, and then it's all about extricating yourself in time to hole out. Club Slots challenges make you complete holes with just three clubs selected from spinning reels, and you'll unlock Star versions of existing characters - in each case giving their shots greater distance at the cost of fine control - by beating them in a nine-hole round of Match Play.The courses are every bit as vibrant and challenging as the ones in the GameCube's excellent Toadstool Tour. Peach Gardens is lined with topiary sculptures, while boost pads are scattered across its pink fairways, giving you an extra 10 yards or so if the ball rolls across them. Wiggler Park shrinks you down to the size of a Pikmin to play amongst the undergrowth, as flowers, Goombas and Koopas tower overhead, while Cheep Cheep Lagoon's underwater greens are predictably slow. Yoshi Lake takes its visual cues from the fabric aesthetic of Yoshi's Story, with patchwork trees, orange greens and springy floating platforms that resemble airborne mattresses.Then there's DK Jungle, which might be the pick of the bunch: there are TNT barrels surrounding the hole on the par-three third, while the seventh has a green in the shape of DK's mighty foot, and bunkers that resemble a pointed finger. In each case, there are hazards that can help as well as hinder, from stone statues that blow out gusts of air to Bob-ombs whose explosive tendencies are almost as likely to blast you to a decent lie as out of bounds.It really does benefit from that dose of Mushroom Kingdom charm. Sink a birdie putt as Mario and he'll collect a Starman and dash around gleefully. Win a hole as Waluigi and he'll pose and pirouette to celebrate. Toad gets his own cheer squad to pep him up after a bogey; an eagle prompts a crowd of supporters to rush onto the green, the camera zooming up and out to reveal they've formed the shape of a super mushroom. The music's great, too, adopting an ominous tone when you've got a 15-footer to save par, and getting all tense and excitable when you're potentially heading for a birdie or better. Only the lacklustre 3D effect spoils the otherwise immaculate presentation; indeed, with the slider down the frame-rate is more consistent while anti-aliasing smooths over those jagged edges.And while you can't get rid of each course's unique features, otherwise you can tailor the game to your needs. You can spread patterns of gold coins across even the standard courses, or have the fairways strewn with item boxes containing power-ups that range from note blocks for a higher first bounce to fire flowers that allow your ball to burn through obstructive foliage. In other words, you can have as outlandish or as pure a game of golf as you like, and that includes turning the predicted flight path off, the wind up and playing from tournament tees. You can even use the stylus to play your shot, with the touch-screen segmented into panels that allow you to set the impact point or add topspin or backspin. Finally, there's an Auto swing type for beginners which only requires you to set the power, though the trade-off is the loss of fine control over your club's impact.The natural comparison is with Everybody's Golf - which, of course, developer Camelot was responsible for in the first instance - and while the Vita game has, by a distance, the superior single-player structure, World Tour is more than a match for it in the quality of its courses and the breadth of its options. Both play a great round of golf, because both are founded upon a game mechanic that is the Holy Grail of sports games: easy to learn, difficult to master, reliable enough to empower players while leaving room for the unpredictability of human error. Click, click, click, BOOM."}