{"ref": "https://www.eurogamer.net/the-last-of-us-review", "date": "9 Feb 2015", "game_name": "Reviews", "text": "The Last of Us Remastered is released for PS4 this week. We're confident that our review of the original PS3 game applies to this edition too, so here's the original review - first published on 5th June 2013 - in full. In the left-hand column you'll find links to our review of the included add-on Left Behind and a few of our other favourite articles about the game. For a closer look at the PS4 edition, check Digital Foundry's analysis of the remaster, or its PS3 vs PS4 face-off.The Last of Us, a surpassingly confident and handsome survival thriller from the cinematic populists at Naughty Dog, serves the post-apocalypse straight. Set 20 years after a fungal disease brings American society down and turns the infected into mindless monsters, its gorgeously ruined world, zombie body horror and cynical portrayal of survivors turning on each other are all very familiar themes right now. They don't come from the collective subconscious of a world in crisis so much as from a dozen tastefully chosen inspirations, among them The Walking Dead, Half-Life 2, 28 Days Later and The Road.There's another layer of modern mythology at work though, and it's a quintessentially American one. The story follows Joel, a taciturn and bitter Texan smuggler, and Ellie, a precocious teenager, as they travel from Boston, through lawless Pittsburgh and all the way west to the Rockies, covering the best part of a year as it does so. The seasons change and the pair have to fight off bandits and scrape together what they can from their surroundings to survive, often travelling on foot, sometimes on horseback. It's the classic journey into the west, the pioneer's tale - but turned on its head, because this anti-Western isn't about the birth of a nation. It's about the death of one.This melancholy twist is just one of several things that lifts The Last of Us far above its clichéd basis. The others are the outstanding engineering and art and sound design, the fine direction and performances, the touching relationship of the two leads and the tough, tense action gameplay.Stace Harman reviewed The Last of Us' first and only story expansion in February, finding that it was every inch a worthy addendum to a classic campaign. ~Left Behind deftly avoids falling foul of clichéd convenience or too-cute contrivance to deliver time and again throughout its short duration,~ he wrote.The game starts slow, but it means business. After an unexpected and arresting bit of pre-credits scene-setting, we join Joel in Boston's Quarantine Zone. He's reluctantly saddled with Ellie after his partner leads him into a deal with the Fireflies, a resistance movement combating the oppressive martial law. Knowing only that he needs to get Ellie to a Firefly nerve centre somewhere across the continent, Joel heads off to find his estranged brother, a former Firefly. Along the way, they battle the infected and cross paths with a few friendly (and not so friendly) survivors as well as encountering the ruthless and sadistic Hunters, a faction that preys on the weak for their supplies.As beautifully mounted as it is - a jaw-dropping scene of epic decay around every corner, the sight lines arranged and lit with a care that would make Valve weep - The Last of Us takes some time to get under your skin. For the first few hours, the characters evade you to the point of seeming bland: Joel is terse and muted while Ellie, child of the apocalypse, is too blithe to convince. You've also fought stumbling and screeching zombies like the infected in too many games before, not to mention crouching behind cover and shooting at jackboots in riot gear.It's the gameplay that clicks first, which will come as a pleasant surprise to those left cold by the shallow, breezy spectacle of Naughty Dog's rollicking Uncharted games - especially the borderline incoherent smoke-and-mirrors of Uncharted 3. The Last of Us is made by a different team and is a very different beast. It's purposeful and mean, with lean meat on its bones.The remarkable coherence of The Last of Us' world is stretched thinnest in Factions, a competitive multiplayer mode with a rather forced thematic meta-game. Thankfully, this excuse to sell online passes is fun to play if you want to engage with it and easy to ignore if you don't.You commit to playing for one of two factions - Hunters or Fireflies - and then play through 12 ~weeks~ of action, with each match representing one day. You earn supplies for playing which are used to nurture your clan, a virtual colony of survivalists that exists as some dots, stats and names on your menu screen. The aim is to grow your clan, feed it and keep it alive for 12 weeks, and you can undertake specific challenges to help out in certain areas.It's an overly elaborate way to dress up a long-term hook, but the unlocks are useful and the framework is still welcome. Short-term hooks are better, with great perks and equipment available if you spend your score in-match.In the four-versus-four game itself, the stealth and crafting elements of The Last of Us' combat force a slower pace that make it tense and challenging but quite easy to get into. The maps are excellent, and the two game modes offer neat twists on team deathmatch that emphasise the survival theme: Supply Raid gives each team a pool of 20 lives before going to sudden death, while Survivor is the best of seven rounds with no respawns at all. Overall, a slim but strong offering.Blending stealth, cover shooting and survival horror styles, the game gives you lots of options and then pushes you to experiment with all of them by limiting your resources. Ammo is quite scarce, and so is everything else. You really feel like a survivor as you constantly scour the shattered and overgrown landscape for tape, alcohol, scissor blades or fertiliser to dress your wounds or improvise a shiv or a nail bomb. Scavenging and crafting may be de rigueur these days, but they've seldom made as much thematic sense, or tied as tightly into the action, as they do here.The stages for this action are not so much open as intricate: mazes of corridors, cover, empty spaces, stairways and windowsills to vault, ripe with opportunities for stealth and flanking. Human enemies track you by sight, infected largely by sound; the behaviour of both has a credible balance of scripting, logic and unpredictability. Joel can use his impressively acute hearing as a kind of X-ray vision, but you'll never feel overpowered and always threatened, and the game is difficult enough that you'll often need to restart the encounters. That's usually a pleasure, because you're given so many spatial and tactical avenues to play with.With a judicious dose of theatricality in the set-ups - a terrifying encounter with infected in a pitch-black basement, say, or a suspenseful advance on a sniper down a village main street - the designers make the absolute most of the broad palette of action at their disposal. It's scary, exciting and ferociously gripping stuff - and refreshingly reluctant to pull out a novelty set-piece. (The ones that do occur are great, though.)It's also extremely violent, but it's no power fantasy. Once again, The Last of Us displays a coherent, thought-through attitude that's a world away from the senseless excess of so many of its blockbuster peers. This is a harsh world and Joel is an angry and desperate man. The violence is as frightening as it is thrilling: guns go off with a shocking bang and each blow connects with a sickening crunch, taking a big bite of health. The camera work and edits are blunt and bitten-off. A few animations linger a little lasciviously on gruesome acts of brutality, and I suppose some will get off on it - but you can't call it desensitised or mindless.Nor is it relentless. Quieter passages are many and long, taken at a slow pace as you hunt for supplies and navigate the broken world. The challenge offered by puzzles or obstacles is only very mild, but that's not the point. These sections offer a chance to drink in the game's striking sights and its potent atmosphere of peaceful desolation - which is given ample room to breathe by the extremely sparing use of music. (The score is by the Argentine composer Gustavo Santaolalla, who won an Oscar for Brokeback Mountain, and is wonderful: sparse, elegant and sad, with a noticeable country twang.)These quiet moments also give Joel and Ellie time to talk. Much hyped by Naughty Dog and its publisher Sony, this relationship has been heralded as a powerful emotional hook, and Ellie as a marvel of artificial intelligence. On the latter point, while her behaviour hardly astonishes as she follows Joel around, she doesn't break the game's spell - and surely that's enough. The writing is left unmolested to do the work.The flowering of Joel's unwilling guardianship into fatherly affection runs a predictable course and is initially slow to engage. But writer and creative director Neil Druckmann builds both characters, Joel especially, with real patience and skill, using gradually layered detail and dropped hints, never forcing it. He's helped no end by sympathetic and understated performances from actors Troy Baker and Ashley Johnson.By the time the game reaches its second half and the plot and pacing step up a gear, Joel and Ellie have matured from clichés into rounded characters, and Druckmann lands a handful of big moments that are affecting without being overplayed. Meanwhile, the action moves through a stunning sequence of locations and gameplay variations with a momentum that is unhurried but immense. It's breathtakingly confident game-making.The Last of Us is Hollywood stuff, of course, but the good kind of Hollywood: big-hearted, humane, with just a shade of grey. And the ending, which casts a typical action crescendo in an unusual light, might surprise you. It's jarring and unsatisfying in some ways, powerful and thought-provoking in others, and you have to respect it for following through on the characters' motivations and ending, not with a bang, but on a simple line of dialogue. You won't forget it in a hurry.At a time when blockbuster action games are sinking into a mire of desperate overproduction, shallow gameplay and broken narrative logic, The Last of Us is a deeply impressive demonstration of how it can and should be done. It starts out safe but ends brave; it has heart and grit, and it hangs together beautifully. And it's a real video game, too. An elegy for a dying world, The Last of Us is also a beacon of hope for its genre.Check out our The Last of Us guide if you're struggling to find a collectable item."}