{"ref": "https://www.eurogamer.net/void-destroyer-review", "date": "4 Feb 2015", "game_name": "Reviews", "text": "Bloody typical. You wait 12 years for a Homeworld-style space strategy game to come along and, wouldn't you just Adam and Eve Online it, three of the blighters slip into space dock in a matter of weeks. Granted, two of them are still inbound and won't be with us until the end of the month, but even so, that's a fair old chunk of real-time command and conquering to be getting on with given how little of it there's been - space-wise - for most of the 21st Century.You'd think that being the first to berth would give Void Destroyer the advantage over those following close behind, but of course the two games in pursuit aren't just a couple of Homeworld knock-offs, they are - as many well know - the Homeworld games, their mighty engines brought back online and their hulls renovated for an imminent HD release - which begs the very valid question as to why anyone would take a risk with Void Destroyer when they can just hold fire for a couple more weeks and get their hands on remastered editions of two of the most revered strategy games in PC gaming history.In answer to that, not only is Void Destroyer very reasonably priced, it is in a sense twice the game Homeworld ever was, for as much as it borrows from Relic's pre-Dawn of War real-time strategy series, the likes of Freespace and other seminal space combat titles are just as inspirational. Void Destroyer is a hybrid game, a shooter and an RTS combined, with players able to directly pilot any ship under their command, from the flightiest fighter to the game's heavy-hitting command ships, switching at will between a third-person ship view and the spacebar-activated Tactical Mode as and when mission objectives dictate. Had there been a sliver of trading and exploration to go with the fleet fights and resource gathering, Void Destroyer could've laid claim to being one of the most inclusive space games around. Sadly, for various reasons, the game seems more intent on excluding space gaming fans than it does in uniting them.   The problem with Void Destroyer's mix of real-time strategy and spaceship shootery is one that has blighted many a hybrid game over the years, in that you find yourself battling with the control system as much as with the enemy. Here though the problem is exacerbated by featuring control options that by the developer's own admission are redundant, left in it seems by some misguided sense of freedom for the game to be played any number of ways simultaneously. A nice idea in theory, but in practise Void Destroyer is almost entirely scuppered by good intentions.Take for instance the flight controls, of which there are two varieties; Ship mode, which is intended for dogfighting and where the mouse directly controls movement, and Command mode, which is slightly more tactical and where the mouse is used to aim your turrets. Flying around in a fighter actually feels pretty good, reminiscent in fact of good old space shooters like Terminal Velocity and Freelancer. With a flight assist toggle, no speed limit and a very useful indicator that shows relative X/Y speed, sub-capital ship combat is both immediate and fluid, with plenty of scope for those eager to master advanced tactics like frictionless space strafing. Ship movement in Command mode however, necessary for commanding the all-important cruisers and flagships, is needlessly complicated, with no less than five different methods of repositioning your ship, two of which are adequate and the rest pointless. True, you quickly learn to avoid the systems you don't like, but it's a frustrating trial and error process that should never have survived past Early Access.Tactical mode, the Homeworld-inspired RTS interface and probably the area players will spend most of their time, functions much as you would expect and generally works well, but it too has numerous issues that serve to frustrate and annoy. Chief among them is a surplus of icons and an arrangement that seems to have evolved without much appreciation for ease-of-use. Context-sensitive right-clicking only seems partially implemented, and with no tool tips and barely any feedback from units to suggest orders are being carried out, a keen and patient eye is required to gauge the tactical situation at any given time.   Mission difficulty is another persistent issue with Void Destroyer, as evidenced by the fact that, as of time of writing, only 8 per cent of those with the game have gotten past the first mission sequence, which simply requires you to get through a stargate (easier said that done). Beyond it lies the player's first base, from which new tech can be researched, ships upgraded and the unit cap reached, thankfully without too much enemy attention. You soon come to realise however that unless you complete every scrap of research and build every ship available to you before activating the next mission trigger, the margin for error is so limiting that the loss of a single ship is enough to prompt a reload. Extreme situations - which most in the game seem to be - also sometimes call for extreme measures: One early mission sees you come up against a gigantic mining ship that relentlessly tries to drill you to death. The most effective way to deal with it is to outrun it while firing behind you, a process so tedious that I ended up taping down my mouse button and moving to the sofa to watch a bit of Newsnight.  It's a shame the mission design is so constrictive because everything else about the campaign is immediately likeable. The dialogue, while entirely text-based and liberally scored with typos, has moments that are genuinely amusing, playing on various sci-fi cliches and laden with sarcasm. The enemy, the Miners' Union, fittingly use hollowed out rocks for ships and in general all the ships look the part. It's something of a relief too to find that after the crushing difficulty of the first few missions, the challenge settles down a little, although whether that's down to a bout of generosity on the part of the designer or extreme over-cautiousness and abundant use of quick-saves is hard to say. As ill-considered as some of the controls are and in spite of some hair-pulling mission scenarios, Void Destroyer is a game that's clearly been put together, not just out of love for space gaming, but out of a genuine desire to create an experience that is my some measure unique from its contemporaries. In spite of the abundance of space games at the moment, VD is firmly in a genre of one; a throwback to the mash-ups of the late 1990s as much as it is to a certain pair 3D space RTS games that have taken so long to re-emerge. There is a soul to the game, an integrity that tries hard to smooth over many of the game's rough edges. There is generosity too, with a campaign that is for all its faults is lengthy, challenging and suitably augmented by skirmish missions that outside of the context of the main campaign are comparatively relaxing to indulge in. Because of its many issues however, unless you're a bit of a space gaming masochist (which in a sense all space gaming fans are), Void Destroyer is almost as difficult to recommend as it is to dislike."}