{"ref": "https://www.eurogamer.net/citizens-of-earth-review", "date": "27 Jan 2015", "game_name": "Citizens of Earth", "text": "Only in politics is the post of second-in-command considered a punchline. Here, unlike in sport or war, Vice President (or, indeed, Deputy Prime Minister) is the ultimate embodiment of the near miss - evidence of a grasp for power that fell just a little short, which, it turns out, is the precise distance necessary for tragi-comedy. The Veep is presented in both fiction and media as the arch-loser, a person whose ludicrous ambition outstripped their achievement, making them the perfect candidate for our scorn (and, perhaps, the perfect distraction from our own personal fears and failures). If exaggeration leads to comedy, then Citizens of Earth goes all in: you're cast as vice president of the world. This is failure on the grandest of all scales then, a joke that's made all the better by the fact that you still live with your mother and brother and, for much of the game, simply wander the streets of your hometown and its surrounding area carrying out errands for the locals. The comedy comes from the juxtaposition of premise and reality. At the beginning of the game you wake in your childhood bed (a Japanese RPG cliché familiar to every Chrono Trigger veteran) as the newly elected second-in-global-command. The game's first boss? A creature lurking in the basement of the local coffee shop, Moonbucks, who has stolen the coffee beans and must be defeated in order to ensure that the young barista can keep her job.The game's developer, Eden Industries - a young Canadian studio whose team includes artists and designers who worked on Luigi's Mansion: Dark Moon, Mario Strikers Charged and Tom Clancy's Ghost Recon - understands the appeal of the mundane when set against a world-saving context. Perhaps it's a lesson learned from those days spent with Nintendo. After all, Nintendo's Earthbound remains one of the most powerful and best-loved RPGs, and much of its enduring power derives from the way in which it explored the mystery and menace of American suburbs. In the same way, Citizens of Earth celebrates the rhythm and texture of small town life. You bicker with the newly defeated opposition leader. You chase after wanted criminals for the local police. You help a local journalist take pictures of a car that's fallen into a lake for a story she's working on. You inspire the town mascot to rediscover his school spirit.Structurally, this is traditional Japanese-style role-playing territory. You wander towns, cities, forests, beaches and beyond, searching houses, talking to the locals and engaging in fights with thugs and hostile flora and fauna while searching for new characters to add to your team. But in keeping with its theme of exaggeration and politicking, there are dozens of these characters to recruit to the veep's cause: bakers, baristas, teachers, policemen, mechanics, firemen, IT support staff and so on. Almost every NPC you meet has a 'recruit' dialogue option and, if you convince them to join, each can be slotted into your combat team of three. It's not an entirely new design (Suikoden popularised the army-building RPG) but turning each new character you meet into a potential resource is a powerful incentive.Each of the game's characters has their own move sets for use in battle as well as abilities that are used outside combat (for example, the baker can bake you restorative items, while the repairman can fix broken doors). Characters must be levelled to bring them to their full potential and, as you can only take three into a skirmish at any one time, unlocking the full range of attacks across your burgeoning squad is time-consuming. It's more likely that you'll soon settle on your favourites: Mother remains a stalwart thanks to her special abilities 'Nag' (which lowers an enemy's defence), 'Hug' (which raises a comrade's health), 'Time Out' (which prevents an enemy from attacking) and her battle cry: ~You're grounded!~ While there are no character classes as such, each potential team member curves toward an offence, defence or support role.Each character's move either accrues a unit of 'energy' or demands it. The system creates natural rhythms of offensive and defensive play as, for example, one character stores up energy while lowering an enemy's defence while another saves up for a health-restoring spell. While enemies are visible in the game world, this is a battle-heavy game (defeated enemies return to an area once you leave) and combat loses its appeal through repetition, even if it is possible to up the difficulty level on the fly in order to maintain challenge (as per Super Smash Bros, doing so increases the rewards you gain from each fight).Most of the game's enjoyment comes not from the battles or the dialogue (which is funny at times, but often scattershot) but from the ridiculous errands that some characters set for you. Not all of these are mere fetch-quests. In one you must allow the local therapist to lead you into a dream state where you confront some of your childhood demons. In another you must beat a used car salesman in a five-lap race around town using one of his vehicles. In one you must answer a series of trivia questions about the game correctly. More than a mere Pokémon-like quest to beat your potential comrades into submission, the recruitment tasks are imaginative and diverse. But elsewhere, Citizens of Earth falters. The central story is light and confused, failing to communicate any sense of urgency that might justify the wild recruitment drive that takes up most of your time in-game. Broadly speaking, the game avoids explicit commentary on American life - a missed opportunity, considering the setting. The police use Tasers in battle and the Veep is a model of self-interest and self-promotion (his progress through the game is entirely delegated), but these are narrative adornments rather than core themes.Nevertheless, Citizens of Earth succeeds in rediscovering something of the ingenuity of 1990s JRPGs in its playful twists on genre clichés. And as a kooky and inventive contemporary re-imagining of the Super Nintendo-era role-player, this, like its protagonist's campaign, is but a near miss."}