{"ref": "https://www.eurogamer.net/resident-evil-hd-review", "date": "21 Jan 2015", "game_name": "Resident Evil", "text": "Was Resident Evil misclassified? Returning to the game that popularised the genre term 'survival horror' 19 years after its original release invites the question. Sure, Spencer Mansion's warren of corridors and alcoves is riddled with tenacious horrors. There are hardy zombies that won't stay down unless you drench the corpse in gasoline and take a flame to its rags. There are rabid Doberman that round corners at full pelt. There are mad bees and hellish crows not to mention terror snakes and spiders seemingly imported straight from Greek myth. Yes, the game makes good on its horror promise. Meanwhile, ensuring the survival of your protagonist - you choose between local special force operatives Chris Redfield or Jill Valentine at the start - is an ever-present theme (albeit no more than in any other video game). But 'survival horror' is not the game's principle theme. Rather, most of your stay here is spent solving puzzles. Resident Evil has the appearance of a lost George A. Romero classic, but the function is pure Myst.For one thing the mansion (whose labyrinthine layout is a symptom of the puzzles; no architect would ever put their name to this mess) is a meta-puzzle that must be solved, its improbable layout committed to memory as you trudge back and forth between far-flung rooms, ferrying crucial items in a tortuous game of match-the-key-to-the-lock. Meanwhile the discrete puzzles are laughably obtuse. In one area you must replace an item resting on a pressure plate with a replica if you are to avoid certain death. The fake is found inside a contraption that's hidden on a dog's collar. Before you can kill the dog and remove its glinting collar, you must first summon it with a whistle blown while standing on a specific portion of balcony outside the mansion. There are scant in-game clues to lead you through the various stages of this complicated errand. Presumably developer Capcom released the puzzle's solution into playgrounds in the hope that it would spread between players like the T-virus, before finally making its way into the tips pages of games magazines and online FAQs. You must not only survive the dangers that lurk in the mansion, then, but also the threat of frustration. In addition to the puzzle design, this arrives from various sources. Your character's inventory is painfully limited and must be micro-managed. Each time you head out from one of the mansion's safe rooms you must select what items to take with you (surplus items can be left in a aluminium crate, accessible in each safe room) lest you arrive at the your destination only to discover you brought a brooch when you should have brought a crest. Then there's the basic frustration of moving through the game world, an unnecessary difficulty derived from the transitions between camera angles which befuddles your fingers as you move from one are to the next only to find that 'up' now equates to 'down'. You'll soon bemoan the lingering door animations that interrupt your passage from one room to the next too, a design intended to ramp up the tension (and, originally, to cover the disc load times) that, in the end, merely provides regular moments that break your concentration and sense of immersion.Once you acclimatise to these anachronisms (and it will take some time), you begin to enjoy the game's cloying atmosphere more readily. The HD remake retains the pre-rendered backgrounds of the 2002 GameCube remake, while rendering characters and items as sharp 3D objects. Thanks to some sympathetic lighting, the 3D objects bed well into the backdrops, and you're free to enjoy the original art team's talent for interior design, the heavy curtains, the portraits of well-to-do gentlemen set within ornate frames, the bannisters sinewy with varnish. The environmental design is supported by snippets of descriptive text offered each time you click on an item of interest. These range from basic unsettling descriptions such as ~There's nothing but cleaning products inside. It feels faintly unpleasant~ and ~There are bottles Serum of a sicky colour~ to the hilariously mundane such as the following, offered when you investigate a kitchen counter: ~A bunch of spices you've never seen before~. For all its historical foibles this version of the game is definitive and designed to accommodate expert players. As well as being able to trek through the game with each character across multiple difficulty levels, the achievement and trophy design encourages speed runs, playthroughs in which you limit yourself to the hunting knife, or make it to the conclusion without saving once (a challenge no modern game would ever dare ask of its player). For the Resident Evil wunderkind, the chance to prove and share their expertise in these showboating ways will be welcome. But what about those who are merely curious to make a pilgrimage to one of the video game medium's historic locales? Is the pain worth the considerable effort?The temptation is to claim that contemporary players have grown soft by way of pandering developers, who today lead us unwaveringly through their games. Rarely do we become stuck on an obtuse puzzle in 2015. Rarely do we become lost. The question is whether Resident Evil is hard by design or hard by omission.The truth is more complicated, perhaps. Many of the game's seemingly anachronistic designs were clearly deliberate, intended to add to the sense of foreboding mystery and tension. The save system, which turns your ability to save the game into a resource (the typewriter ribbons which, once depleted, leave you unable to record your progress till you replenish your stock) is an ingenious trick (one that's proved its timeless value in last year's Alien: Isolation). So too is the design that force you to shoot while standing still, rooting your character to the spot as a way to create a panicky rhythm to each violent encounter (will the foe reach you before you are able to drop them?). But Resident Evil's puzzle design is difficult by omission: there is a lack of useful guiding clues, and a wearying back and forth between the mansion's different wings to pad out your journey. This is weak game design (even if it has a certain historical, sadistic charm), evidence of a young team of designers being forced to reckon with the novelties of 3D space and the expanse of possibility introduced by disc-based media. Nevertheless, Spencer Mansion ultimately fails as a locale because of its implausibility. It is a place that has been designed in service to the designer's puzzles, rather than vice-versa and, for this reason, feels fake and contrived, characteristics that undermine the horror rather than heighten it. As a product of a unique moment in the medium's technological evolution, Resident Evil HD is a fascinating place to revisit. But for many contemporary visitors it will be an unpleasant stay, not because the game's inhabitants are unusually hostile, or because its idiosyncrasies are unfashionable, but because its formative designs have simply been bettered."}