{"ref": "https://www.eurogamer.net/elegy-for-a-dead-world-review", "date": "19 Dec 2014", "game_name": "Elegy for a Dead World", "text": "Writers oscillate between the state of inspiration and distraction. Inspiration comes unannounced and often at inconvenient times, carried on a song, in a face, with a moment of fear or of passion. It's brought by the weather or found atop a mountain, in death, a betrayal and a hundred million other moments of sudden or lingering experience. Distraction, meanwhile, taps at the window incessantly, crashing through the door to fill the gaps between inspiration with its greedy bulk and Jezebel eyes. Programmes designed to aid writing on a computer target one of these two states. They might aim to eliminate distraction by, for example, preventing access to the internet on your computer or clearing the word processor of its cluttering buttons. Or, like Elegy for a Dead World, they aim to trigger inspiration. In this Kickstartered game's case, the hopeful trigger is a series of alien scenes, loosely inspired by the Romantic poets Shelley, Keats and Byron and the scenery of Kubrick and Scott's science fiction films. You're deposited in one of three worlds, asked to explore and, every now and again, prompted to write a little about what you've seen or thought.The three worlds are varied but similar in their eerie, forsaken state. Each was once home to a civilisation, now deceased and departed, evidenced by the debris and detritus they left: straw hovels, smooth towers, statues and gravestones. Despite the futuristic aesthetic, your role is truly that of the Romantic: you're encouraged to write specifically about the scenery, to imagine what lives were spent and lost here amongst the sweltering dunes of Shelley's world, or the cold tundra of Byron's. As you move through the scenery (you play as an astronaut, able simply to walk, hover using boosters, enter and exit buildings and write) you are prompted to write snippets of text at specific points. In the introductory 'level' it's a case of filling in the blanks, gently nudging the prose and story in different directions as you imagine a history for the place. There are a dozen or so snippets to fill in and, when you reach the end of the scene the prose is brought together into a story of sorts. This resulting work can be titled and then uploaded and shared with other players. For a game with an aesthetic of pure solitude, Elegy For a Dead World is curiously connected. The files generated by each story are tiny and, as such, it's easy to download other players' pieces and recommend them to others. An esoteric and largely anonymous social network underpins the experience then: prose is shot back and forth between players as their stories are shared through time and virtual space.You are not limited to sci-fi history building, mercifully. The game encourages different kinds of writing exercises (the framework of which is set before each embarkation) asking you to, for example, imagine you're writing a teenage girl's diary on the bus while travelling home for school, or even simply using the game as a way to learn correct grammar and sentence construction (again, by filling in the blanks). There is also a freeform writing mode, whereby you are able to write each snippet from scratch, and position the prose or poetry wherever you want within the scene.You are, of course, somewhat limited by the three available scenes and their heavy style. While it's possible to write a short story about, for example, the death of a beloved pet, or a salarymen who was passed over for promotion, doing so invites an obvious disconnect between the words and the accompanying scene. Likewise, there is no obvious drama to write for. You are instead engaged in writing lyrical graffiti: you scrawl your words onto the landscape; there's no change or movement in terms of the pictures that your words support, or comment upon. Elegy For A Dead World's power comes from its focus, but the science fiction aesthetic is also curiously limiting. The game would have worked just as well with a range of diverse scenes across different genres (the corridors of a high school, the concrete carapace of an abandoned city, a rundown theme park or diseased village) and a greater diversity of scenes would have surely supported a greater diversity of writing. But perhaps this ambition would have moved Elegy for a Dead World too far into the territory of writing software, rather than a somewhat esoteric canvas for a certain type of writing. As it is, the game's simple yet effective function at least allows for follow-up games that take would-be writers to different kinds of places in their imagination.The ambition of all writing is always to bring a sense and order to life's chaos and this game makes that clear, as you work to explain the things with which you are presented. But all writers are also, perhaps, in search of an accomplice, someone with whom their words and thoughts connect and, in the connection provides a sense of communion. Writers and their readers share a common purpose: a reassurance that they are not alone. Elegy for a Dead World makes good on its title: it offers us dead worlds, filled with the debris of imagined and vanished civilizations. Through the game's scenes you walk alone, under the dread emptiness of outer space, all that harrowing solitude. And yet, as you write and send that writing out into the ether in search of a reader, you may well find contact and connection. If others read your work, your observations, your story, your sense and if they find truth or solace in your words, here is a framework designed to let you know, in turn, that you are not alone. In this sense, it is truly a game about humans' desire to write."}