{"ref": "https://www.eurogamer.net/geometry-wars-3-dimensions-review", "date": "2 Dec 2014", "game_name": "Geometry Wars 3: Dimensions", "text": "An early indicator that there might be slight conceptual problems with Geometry Wars 3: Dimensions is that you start to notice how clever everything is. Not necessarily the new additions, of which there are plenty, but the old stuff, like the way the collectable Geoms powering your multiplier encourage you to lurk dangerously close to your prey. The old stuff standing out is worrying enough in itself, but the deeper issue is that you're noticing it at all. With Bizarre Creations' Geometry Wars games there's traditionally never enough time to notice anything, let alone how brilliantly the systems slot together to entrap you. New developer Lucid's take on the series isn't slower - it's just a little less vital.Euclid pointed out the major snag 2000 years ago, in fact, when he defined a line (I had to look this quote up) as ~breadthless length~. You can't really improve on that, just as you can't really improve on the template that Bizarre Creations laid down, taking the wonderfully jittery twin-stick shooting of Robotron and rendering it smooth and cool and gleamingly abstract. This being video games, Bizarre itself came back for a second swing, and it's interesting to see how the developers handled that. Retro Evolved 2 kept the no-mess high-score mentality in place, but it twisted the central mechanics of moving and blasting into a variety of clever new modes.With a campaign to fill, Lucid's opted for gimmicks rather than modes, and a lot of the time this actually works better than you might expect. The main offering here is an adventure suite built of dozens of unlockable stages. Some of them come with bespoke arenas, warping the flat plains of the classic games into 3D peanuts and pitcher's mounds and cough drops. Many of them have their own conceits, too. Alongside levels that borrow existing ideas like King and Pacifism, there are stages where nasty little Zambonis rumble around incrementally painting the landscape, and stages that get narrower and narrower as you play.The shift to 3D arenas looks striking, but it isn't particularly tricky to get your head around: Super Stardust has done some of this stuff before, and the original Geo Wars always offered a playing field that was bigger than the screen anyway, getting you used to the idea of limited sight-lines. Regardless of this, when the game's more gimmicky ideas work, Lucid often has something special on its hands. My favourite level is probably Infected, in which geometrical shapes bubble and multiply across a confined Petri dish arena leaving you fighting for space. Elsewhere, there's a glorious blend of Pacifism, Frogger and Every Extend, which has you dodging streams of fast-moving enemies and touching off mines laid by a weird little amoeba. (Lucid's generally happy to leave Bizarre's existing cast of flockers and baiters in place, focusing its energy on landscapes that evolve over time or are riddled with shifting obstacles. What new enemies there are tend to slide neatly into the ecology, however.)The further you go, the better Lucid gets at playing with the bits and pieces as its disposal, in fact. Deflector is a very late-game level that makes the best of a new foe that bounces back and forth off the walls by sticking dozens of them into a small space with lots of spinning pinball flippers. Super Rock Crust, meanwhile, offers a genuinely clever use of a 3D environment, using a simple sphere studded with deadly cubes to turn a wave-based time-challenge into a panicky game of hide-and-seek. None of this really feels like classic Geo Wars design - Lucid's far too eager to step away from chaos and orchestrate its enemy waves into set-pieces, tilting a game of reactions towards a game of memory - but it allows the action to ramp up alarmingly quickly, and the addition of temporary power-ups that are unlocked by shooting special static arrangements of mines provides an ideal balance of risk and reward.Moving outwards, however, the annoyances start to set in. A lot of contemporary games feel like they're built by committee. Dimensions often feels like it's been built by two and that they didn't talk enough. The first bunch may have had a pretty good time clipping new 3D levels together with more controlled wave design and interesting rule twists, but the other lot seems to have been running through an arbitrary checklist of things a modern video games should definitely have, regardless of how well they suit the Geo Wars spirit.  Feel the weight of corporate generosity thoughtlessly applied: Dimensions has pleasant throwaway additions like multiplayer and bosses - the latter of which actually make for nice changes of pace as the campaign heats up -  but it also has load-outs, levelling, and a campaign unlock system that slowly starts to make itself felt in irritating ways.For my money, load-outs are probably the worst addition. As you progress through the game, you collect a range of drones and one-shot supers that you can mix and match before you head back into the fray. The idea's to give you something tactical to experiment with, and some of the supers in particular are pretty clever reinventions of the smart bomb. Drones are a carryover from Galaxies, however: a game that had to make up for the fact that it was a twin-stick shooter made for hardware that didn't have twin sticks. They're little allies that buzz around your craft doing something useful, ramming enemies, perhaps, or sniping distant targets. The first problem is that drones consistently make the game less interesting. As soon as you have the ramming drone, you don't have to worry about close-up threats quite as much as you did before. As soon as you have the collection drone, you can pretty much forget the need to scramble for Geoms - a brilliant piece of design that encourages you to get into so much glorious trouble. Beyond that, load-outs royally screw up the leaderboard chase that lies at the heart of the entire enterprise. You're no longer comparing like with like when you look down the hi-score table for each level, so the whole thing seems less appealing. What drone did that guy use? How much - and I can't believe I'm typing this about an arcade game - did he level that super up before letting it rip?  The genius of an arena shooter like this is that each game is totally different because each game is ultimately exactly the same. The player's brain is the only thing that should be levelling, and Geometry Wars needs the uneven playing field of load-outs about as much as it needs BioWare-style romances.Dimensions offers both local and online multiplayer.Local players get a mini-campaign to work through. It supports up to four people, but can get a little bit juddery if you're playing on PC. Online is team-based and features two game modes, one of which sees you competing to take down bosses and dealing with limited ammo, while the other is a score-chasing affair with spawning towers. It's nicely handled and fairly generous throughout, but it feels like a bit of a distraction.The campaign structure's another problem, one which sees you unlocking each boss by scrabbling around for a certain number of the stars you earn for completing previous levels. File this one under unintended consequences, I think: after I've three-starred a level, I simply have less of a desire to go back and keep at it until I've wiped everyone else off the leaderboard. I've already had artificial closure; I'm ready to move on. More importantly, about half-way through the game and grinding to unlock one of the game's better bosses - this one looked like a Swarovski cauliflower, and that's always money in the bank - I realised I had ceased to play the game itself and had started to play the progression system. It stings to see Geo Wars succumbing to the anonymizing triple-A bloat that the first games were such a refreshing break from, and, ironically, it chips away at the game's lasting appeal.There are other annoyances: the frame-rate problems that can crop up occasionally on PC, muddy sound design that removes useful audio cues, the switch to a more angular poly-based artstyle for backdrops which simply isn't quite as fun to look at as the billowing distortion ripples of the old days. Equally, the inclusion of Retro Evolved 2's modes, while generous and extremely welcome, is also a sharp reminder that although it's fun to race over a space peanut or around a lampshade, the best levels are generally still the big rectangular arenas with little trickery getting in the way of the blasting. For a game I've complained about a lot, I was pretty engaged with it at three in the morning yesterday, of course, shoot-'em-up headache setting in and an annulus of empty teacups starting to form. The problem, ultimately, is a philosophical one. I'm not sure if Lucid really gets the mentality behind this series, and that makes for a perfectly serviceable shooter when the lineage requires something more."}