{"ref": "https://www.eurogamer.net/assassins-creed-unity-review", "date": "11 Nov 2014", "game_name": "Assassin's Creed Unity", "text": "It's not hard to identify the best thing about Assassin's Creed Unity: Revolutionary Paris is one of the most beautifully assembled settings in this long-running, well-travelled and temporally uninhibited series. One person you meet says he yearns for a time when Paris isn't so mired in filth, but these are not the concerns of protagonist Arno Dorian, who was born into nobility and literally climbs out of the gutter at every opportunity, scaling beatific monuments from Notre Dame and the Palais de Justice to Montmartre and the Sorbonne. When he stares down from peaks and spires, hundreds of people riot in the streets as Ubisoft Montreal taps into the extra power of PlayStation 4 and Xbox One. The old cliché was ~living, breathing cities~. Here we have a starving, writhing one, nevertheless resplendent.Returning to Unity after completing the story, the map is absolutely blanketed in icons - there must be a thousand, covering side missions, treasure chests and other attractions - but the developers clearly understood that the city underneath was special. They have put more effort than usual into the ascent of landmarks like Notre Dame, forcing you to pause and contemplate the architecture to make progress, rather than just sprinting impossibly over each facade. And some of the best side missions in the game, the Nostradamus enigmas, focus on the city and its history. You're given a riddle like this: ~Palace once divided, united by the fourth Henry. Stone Couples salute their doomed King.~ Then you have to go to wherever you think it's talking about. If you want the special armour set hidden behind these riddles, you will need to do more than just follow a waypoint marker.Paris is terrific, then, but the fact the city itself is the game's best element also tells another story: Unity may be set against the backdrop of Revolution, but this is hardly a reinvention of Assassin's Creed itself, even though the early signs are encouraging. When you first take to the rooftops, Arno seems to move over buildings more freely thanks to new animations and a ~free-run down~ button that makes it easier to descend from great heights in speed and safety, while the rooftops of Paris seem more receptive to your gymnastics than other environments the series has visited. Combat has also been refreshed, doing away with counter-kills in favour of more actual swordplay, while the set-piece assassinations now encourage you to explore the environment looking for weaknesses.But as is often the case, once the pace quickens, the game struggles to keep up with you. Climbing building exteriors is faster and slicker than ever - even sheer walls are no match for Arno's scrabbling - but once you start moving horizontally, hurrying anywhere in the company of low walls and doorways is hazardous. Free-running in Assassin's Creed tries to judge where you want to go and help articulate the necessary actions, but it feels more like an overzealous autocorrect as Unity's dense environments work against it. I lost track of the number of times I found myself shouting ~Stop climbing on things!~ or ~Just go in the bloody door!~ Combat, too, flatters to deceive. It's true that instant kills are gone, but parrying incoming attacks and responding with a flurry isn't that different and the overall feeling is the same: stodgy and oppressive.The extra depth in assassination missions has more potential, allowing you to size up your victim and execute a specific plan. This works nicely to begin with as you weave your way through the crowds in a cathedral and identify an opportunity to be alone with your target while he lets his guard down. But signature kills like this turn out to be few and far between in the missions that follow, and for the most part the sluggish, obstructive controls and ageing stealth and combat frustrate your plans. Most of my kills were still bust-ups with a bunch of enemies followed by legging it.Outside of assassinations, too often the game falls back on the tedious and over-familiar - like tailing people through the streets without breaking line of sight - while the majority of your mission time is still spent staring at the minimap rather than what's in front of you, despite changes to the Eagle Vision view designed to discourage this. Needless to say, these scenarios also emphasise the frustrations of getting around, avoiding detection or fighting your way out of a corner. All of this is true of the new co-op missions for 2-4 players as well - having extra players around is automatically a bit more fun, but your best efforts at coordination are often derailed by the ailing game mechanics.One of the headline additions to this year's Assassin's Creed is the ability to invite friends into your city and take on special multiplayer assignments together - or just run around climbing things, getting into fights and looting chests.Mission design here is no more imaginative than the main game - you tail people, take out enemies before they can kill your allies and retrieve documents and treasure from well-guarded chests - but having another player or players along for the ride definitely adds something, allowing you to coordinate your attacks and use shared skills to scout environments together. Cooldowns are reduced when you are in close proximity to one another and downed enemies can be revived, allowing you to avoid having to reset to the start of a mission, while alert states are not shared, so if someone messes up in one section of the map it won't automatically notify the enemy you're sneaking up on.It all works well, then, although my co-op partners and I did experience a few application crashes while trying to join each other's worlds. But as with the rest of the game, the best moments are often drowned out by a procession of frustrations with traversal, combat and stealth.Assassin's Creed has always had these problems and I've forgiven them in the past when it felt like the rest of the game made up for them; last year's Black Flag got a pass because you spent so much of your time out at sea, where everything was fresh and exciting. But having returned to dry land, I hoped the series would embrace the new technology - new engine, new consoles - to deal with its long-crumbling foundations. It hasn't. What's more, it's hard to ignore the fact that other open-world games have been updated. Metal Gear Solid 5: Ground Zeroes, for example, pared everything back and let its systems do the talking. In contrast, Unity is now so cluttered that it has four different internal currencies and so many overlays that tooltips often obscure one another.It really does need stripping back. Instead, the developers have piled on more systems. One of Unity's additions is a greater emphasis on character customisation, but individual weapon and armour pieces lack personality and the only stat that feels tangible is your overall character level, so really it's just more staring at screens - unavoidable, too, because if you don't spend time here then you will fall behind the difficulty curve. (The addition of micro-transactions to help speed up these processes, by the way, is crass and unmerited.) The more traditional upgrades that you unlock by completing story missions - like the phantom blade, a sort of dart gun - have far more influence on how you play.Oddly, one area where the game does show restraint is in storytelling, which is assured but rarely inspiring. Having seen his father murdered at Versailles in childhood, Arno is raised by a senior Templar, falling in love with his daughter Elise as he grows up. But when his adoptive father is murdered in circumstances he might have prevented, he discovers he was born an Assassin and drives Elise away, setting him on a road to redemption.Along the way he encounters the Marquis de Sade and a young Napoleon Bonaparte, charismatic rogues who act out of devilish self-interest, but despite a couple of good cut-scenes with these two, the writers mostly focus on your humourless allies and adversaries instead - apparently having decided that the most exciting thing about the French Revolution was not the guillotines, debauchery and ~Let them eat cake~, but the internal politics of the Assassin order.The writing is solid and predictable (would you believe the Templars are orchestrating the Revolution?!), but we're still waiting for another Assassin's Creed game where famous figures are transformed into Blofeld and Jaws and Leonardo da Vinci runs Q Branch - which is a shame, because this series is much better when it goes for James Bond rather than historical epic. A serious Assassin's Creed game that had something to say might also be interesting, but this is not that game either. Everything is tied up neatly by the end, but it's instantly forgettable.Away from the story and its procession of similar missions, Unity has more character. The Nostradamus riddles make an excellent tour guide, while murder mystery side missions also change the pace, sending you into crime scenes where you need to pick out clues, interview suspects and then accuse the right person. And the developers also have some fun with the game's meta-story - the idea that you are playing through Arno's memories using a Templar machine in the present day - resulting in server anomalies that briefly force you into Paris in different eras. This solves the problem of how to let you climb famous monuments that were built in other periods, and it also means you get some nice collect-'em-up platform levels with shared leaderboards.Assassin's Creed Unity should keep you going for many hours, too, looting chests, buying up property to increase income, maxing out progress bars and unlocking upgrades. It never hits the same loot-and-reward rhythm as Assassin's Creed 2 - predictably, the Café Theatre hub you develop is no Monteriggioni - but if you're simply looking for a nice setting to escape into and grind out some knickknacks every evening after the kids are in bed, you will get a lot of value out of Unity.As the seventh major instalment in the series, though, not to mention the first designed for new console hardware, Assassin's Creed Unity feels like a missed opportunity. Going back to basics at this point may have resulted in a less substantial game than recent years have led us to expect, but it might have delivered a more satisfying one. As it is, mild improvements in traversal and combat are quickly overwhelmed by the creaking systems onto which they have been grafted. Revolutionary Paris is one of the most beautifully realised environments in a series that has had its fair share of them, but the game you play doesn't really do it justice."}