{"ref": "https://www.eurogamer.net/wildstar-review", "date": "28 Oct 2014", "game_name": "Wildstar", "text": "With Blizzard halting work on Titan and CCP putting a stake through eight years of World of Darkness development, the number of blockbuster MMORPGs visible on the horizon has slumped to an all-time low. Even the likes of just-released Destiny, which shares as much DNA with World of Warcraft as it does Halo, has been eager to avoid the toxicity of being associated with gaming's unwieldiest acronym. For a breed of multiplayer game that broke so explosively across our CRTs back in 1997 and seemed so utterly dominant just a few years ago, this feels like the end times.How we got to this ignominious level cap for the genre-without-end is a discussion for another time, but if a lingering MMORPG apocalypse is indeed upon us, WildStar is well placed to offer a rousing send off. In direct contrast to Elder Scrolls Online's rather earnest and dour fugue, Carbine's WOW-baiting debut offers up an anthology of greatest hit MMO features, with just enough new material of its own to suggest that perhaps the persistent world party may have some life left in it after all.The focus of WildStar's storyline is the planet Nexus, recently discovered by the game's good guys, the Exiles, who, as their name suggests, are in need of a new home. Meanwhile the big bad Dominion would rather have Nexus and its resources for themselves. Thus the game opens as the persistent battle between the two sides rages on, with the player, after having chosen their allegiance, taking on the role of saviour and/or vanquisher. It's the usual stuff, basically, where you have to pretend everyone else is playing a different scenario to you, which of course they're not.As much as the storyline is fanciful and derivative, credit must go to the developer for the fact that it's well presented and quickly retreats back into the margins. Unlike Bethesda's late MMO entry, which insists you pay attention to every turgid scrap of text, WildStar won't take offence if you skip through it's cursory cut-scenes or ignore its refreshingly brief quest boxes, even if it means missing out on some genuinely amusing quips inserted to tease out the odd snort.While it knows there are players who like to soak themselves in every detail of lore, Carbine clearly understands that the majority of MMO players would rather ascend the levels and acquire new gear, not necessarily quickly, but in good time and with a diverse collection of challenges on the way to - and hopefully beyond - the arbitrary level cap. On that pledge WildStar delivers, not least in terms of quests, the vast majority of which follow in fine MMO tradition in that they require you to seek out golden exclamation marks, click on highlighted scenery items or kill a proportion of a respawning population. What differentiates WildStar's to-do list from that of other games is that kill quotas are percentage based, so the bigger and badder the variety of target, the quicker you get your reward. The symptomatic level grind is present and correct, of course, kicking in at around level 30, but in WildStar its side effects are greatly reduced by you not being more than a couple of minutes away from an injection of XP. Granted, you won't find much that you haven't done before in an MMO quest, aside from perhaps the odd quicktime event, but here at least the missions are breezy and segue into various challenges, making for a progression that doesn't feel like it's dragging its heels too much.Carbine has similarly played it cleverly, as well as safe, in terms of player classes, with each of the six on offer rooted to an established fantasy equivalent. With their ranged weapons and robot pets, Engineers are essentially the same as WOW's Hunters, while spellcasting Espers and pistol-wielding Spellslingers effectively take their DNA from mages and rogues respectively. Class familiarity doesn't mean the levelling process is entirely a case of deja vu, as each can be reconfigured to fulfil a hybrid or dual role. All are effective at dealing damage as a matter of course, with the Engineer, Warrior and Stalker predisposed to tanking and the Medic, Esper and Spellslinger able to effect the necessary heals when required. Essentially this means you can concentrate on raw damage during your solo questing and take on your favoured support role during group PvE or PvP without having to worry about dividing precious XP expenditure.In an effort to further differentiate characters, Carbine has implemented what it calls Paths, essentially a substrata of questing that requires a little more player cooperation than the occasional group takedown mission, and offers a distinct set of missions depending on which of the four Paths you select. Explorers are required to seek out the obscure nooks and crannies in the landscape, while Scientists must find and analyse lore items. The Settler Path is perhaps the most popular, since they can erect structures around certain nodes that bestow buffs on any passer by that cares to activate them. The delightful thing about Paths is that players are encouraged to work together to complete certain tasks, in a similar manner to how small groups will assemble to take down elite mobs before dispersing again. Paths are by no means essential, but as a means to encourage player interaction it's a fine system.~For the most part WildStar's innovations are subtle ones, implemented not to revolutionise but to refresh and to bring the traditional and rather stale online RPG more in line with modern sensibilities.~For the most part WildStar's innovations are subtle ones, implemented not to revolutionise but to refresh and to bring the traditional and rather stale online RPG more in line with modern sensibilities. Nowhere is this more evident that with the game's movement and combat system, with tab targeting replaced by more intuitive ~telegraphs~, effectively a combat overlay of targeting cones and area of effect circles that suggest where best to effect a perfect hit, receive buffs, or avoid the ill effects of enemy attention. While it's easy to assume such prompting is little more than a dev hack gimmick, or worse, a cheat for MMO simpletons, it isn't long before floor watching becomes a necessary and compelling part of the interchange of combat. Rote knowledge of various tells becomes partly unnecessary, as you begin to see less the arcs of light and flailing limbs above ground and more and more the shapes projected across it. Alas, this means that combat becomes less about duelling heroes and battling monsters and edges towards parody, but in WildStar's gently self-mocking unreality the system fits in perfectly, heightening situational awareness and allowing for battles - even against the most sedate NPC mobs - with far greater urgency and energy than we've tended to see before.WildStar's combat prompting absolutely comes into its own when groups of players are battling together or against one another, whether in team deathmatch arenas or battlegrounds (or post level 50 40v40 Warplots), or the more structured PvE of dungeons and raids. While WildStar's take on battlegrounds offers nothing fundamentally new above and beyond the standard objectives of point capture and capture-the-thingamybobs, they are if nothing else frenetic. PvE is a little more rounded however, with so-called Adventures, similar to The Old Republic's Flashpoints, acting as branching scenarios for five-players, and two varieties of raid content: Dungeons (which are five-player raids) and Raids (which are essentially scaled-up Dungeons for 20 or 40 players). Unfortunately, until the recent implementation of megaservers, it was difficult to amass enough experience to pass judgement on much of the PvE content, partly because WildStar has so many distractions, from the game's tacked-on and annoyingly necessary housing feature, to the extensive and enjoyably diverse crafting sub-game. Mostly, though, it's because finding group slots was relatively tricky. Starting our WildStar adventure on the old Contagion server our game was so continuously devoid of players that even after a three-hour wait no group activity could be found. Things were much better on the comparatively popular Ascendancy server, but still the wait for a brawl was rarely less than ten minutes and often as much as 30. Obviously there was no shortage of things to be getting on with while stuck in a queue, but if there was an issue with the matchmaking system, as had been reported, things have thankfully improved significantly in the last few days, with waiting times down to a fraction of what they were and players expressing a great deal of satisfaction. With a new WOW expansion just a few weeks away, WildStar at last seems prepared to weather the inevitable storm. ~Carbine's game is so overflowing with stuff to do that it's certainly justified in asking for a subscription - even if less people seem prepared to sign up to one.~It's telling that some have likened WildStar to Burning Crusade era WOW, in the sense that it took a good couple of years for World of Warcraft to feel like a cohesive whole and offered the kind of solid and diverse content we've come to expect - probably unrealistically - of every MMO launched since. Given how many there have been, from Warhammer Online to Star Wars: The Old Republic, that have either failed to offer the quantity or quality of content at launch that WOW took a full expansion to nail down, it's all the more impressive that Carbine has from day one done just that - delivered not just a solid and feature-rich game, but one that even has plenty for the power-levellers to be getting on with.For those burnt out on WOW's content, WildStar is easy to endorse. Immediately familiar to anyone who's visited Azeroth and with enough new twists on the tried-and-tested theme park formula, Carbine's game is so overflowing with stuff to do that it's certainly justified in asking for a subscription - even if less people seem prepared to sign up to one. It's more difficult to recommend WildStar to those who've tired of the MMORPG treadmill and its incessant need to put characters through the same old process of grinding quests and raids to reach a level cap and acquire the best gear. As much as WildStar seems to effortlessly hit all the right notes, essentially the song remains the same."}