{"ref": "https://www.eurogamer.net/lords-of-the-fallen-review", "date": "28 Oct 2014", "game_name": "Lords of the Fallen", "text": "Before starting Lords of the Fallen, I pondered setting myself the challenge of reviewing it without mentioning Dark Souls once. How naïve I was. This isn't just a game in the style of Dark Souls, it's a game that feels specifically designed to remind you of Dark Souls. You can't talk about Lords of the Fallen without mentioning Dark Souls, because Dark Souls is why Lords of the Fallen exists. It's practically a cover version, bar one important difference: it's not as intimidating.There are those who will recoil at such a suggestion, of course, and with good reason. The infamous - and rather exaggerated - difficulty of From Software's award-hoovering classic isn't just an affectation but the absolute core of its gameplay. That's why so many are eager to try to break themselves on its rocks. Doing so is a badge of honour that says, ~I persevered, I improved myself, I didn't give up.~ Doing the same thing, but easier, is surely an affront to everything Dark Souls represents.Equally, there are plenty who will no doubt quite like the idea, having been attracted by the promise of Dark Souls' brutal action and ominous world-building, but put off by its reputation. If that's you, then you'll find much to like about Lords of the Fallen.There's very little faffing around creating your character, as you have to play as Harkyn, a bald and bearded growl of a man, whose past misdeeds are literally written on his face in the shape of tattooed runes. He's also the only one who can stop an evil fallen god from awakening and taking over the world with his demonic commanders and... Yeah, story is not this game's strong suit.What influence you can bring to bear on Harkyn takes the form of choosing what sort of magic you want him to wield. Since the game doesn't care what sort of weaponry or armour you equip, it's here you get to pick a specialist class. Warrior magic is for the imagination-deficient who simply want to bludgeon and chop enemies using brute force, with spells that buff attacks and unleash area-of-effect strikes. Rogue magic is dedicated to stealth and misdirection, while Cleric spells favour protection and improved healing.Beyond that, it's up to you how to play. If you've chosen Warrior but find you prefer to use light armour and dual-wield daggers, that's fine. The only limitation is the weight of your gear. You can cram your inventory with everything you find, since only the things you equip add to your burden. The heavier you are, the more limited you are in movement. Just like Dark Souls.Pretty much everything else is just like Dark Souls as well. Combat rewards caution and timing, with combos that use less stamina the more precise you are. Blocking, parrying and picking the right moment to chip a few more chunks off the enemy health bar are the tactics du jour. Steam in, swinging like a madman, and you'll be cut down in short order.It's here that Lords of the Fallen deviates from its inspiration most obviously. You don't drop your items upon death, but you do leave behind a ghost containing all your accumulated XP. You can only cash this in at checkpoints, where it can be banked either into physical attributes or your spell skill tree, but doing so resets a multiplier which grants you more experience for every kill you clock up without checkpointing.For hardcore players, this opens up lots of potential to challenge yourself to press ahead a little further, weighing risk against reward in search of that next big levelling boost. For those who prefer an easier life and don't care about multipliers, it opens up a lot of exploits, particularly in the early going, as respawned enemies can be farmed and the XP banked over and over. The ceiling for each XP level is fairly low, so even the sloppiest player will be able to beef up their stats to something more respectable, provided they don't mind a little repetition.Any XP left behind when you die can still be reclaimed, however, provided you can quickly get back to the place you perished. The dropped XP decays over time, but also acts as a small healing cloud. It's not a dramatic effect - you'd need to stand still in its vicinity for several minutes to refill your health completely - but in the tougher boss battles, having the location of your last failure act as a potential saviour next time around is rather inspired.That inspiration doesn't stretch very far, however. Too often, Lords of the Fallen resorts to offering a less punishing riff on a game design that was tough for a reason. Enemy hits do far less damage than in Dark Souls, so while you still can't windmill your way to victory, there's a lot more leeway for blunders and mistakes. There are more cannon fodder styled enemies that will go down with a couple of basic combos, so the feeling that every battle could be your last is absent. Even small details, such as the game pausing while you tinker with your inventory, make a big difference. Forgot to equip the right gear for a boss fight? No problem. He'll wait while you get yourself ready.Perhaps most damaging to the challenge is the introduction, early in the game, of a magical gauntlet. Worn on your left arm instead of a shield, it immediately allows you to launch damaging projectiles, bouncing grenade-like bombs and a close-quarters blast. If anything illustrates Lord of the Fallen's eagerness to not make you work too hard, it's this. Pour a few upgrade points into the relevant ability slot, and you have a ranged weapon that can take down most mid-to-low-level foes before they even get in striking distance.It's the sort of powerful tool you'd expect to earn much later, yet it's handed over without obligation in the opening hours of the game. I wouldn't go so far as to call it game-breaking, but it tips the balance so hard in favour of the player that most players will find themselves leaning on it a lot, at the expense of the sort of nuanced combat skills that Dark Souls insisted you learn the hard way.Technically, Lords of the Fallen feels like a game designed to look good in screenshots. There are lots of sumptuous lighting effects and detail-rich environments. Beneath the surface, though, it's scruffier than it looks. Texture and object pop-in is common, and there are a lot of weird physics glitches and other noticeable bugs. Just watch Harkyn as he judders up a stairway, his feet vanishing into the stone. The camera is particularly problematic, lurching awkwardly no matter what sensitivity you choose and struggling to offer a workable view of the action in tight confines.That can lead to unfair hits, as it's hard to prowl cautiously through a dungeon when the game won't let you see what's going on. More than once I was struck by enemies whose weapons passed through solid walls. Projectile attacks sometimes do no damage for no reason, while at others they'll hit a shield yet still knock a chunk off the enemy carrying it. I was able to defeat one boss because one of his various behaviour patterns bugged out, leaving him standing motionless, waiting to be hacked to bits. There's a 5GB patch planned for release day, and we can only hope it's this sort of thing that will be fixed.The nuts and bolts of the hand-to-hand combat are fairly sturdy, but could do with tightening. It's not disastrous, but there's a slight sloppiness to the feedback and collision detection that is all too noticeable in a genre where precision and pace are all-important. Enemy AI is often shocking, with enemies that will literally not react to an explosion at their feet or their companion being killed right next to them. As often as you proceed through skill, you'll also get away with stuff by taking advantage of the game's less polished aspects.Where Lords of the Fallen does impress is in its generosity of content. There are no multiplayer modes, no online features that let others bleed into your game, but the world does reward exploration and poking around, even if a lot of the areas are seemingly linear. There are loot chests aplenty, as well as multiple routes that can be opened up when retracing your steps. The post-completion content also makes a New Game + a promising proposition, with not only fresh loot but also new storylines and enemy encounters.It just desperately needs more personality to bring these elements to life. The loot is uninspiring, and everything from NPCs to monsters to the locations themselves feel as though they fell out of a box marked Generic Fantasy, while there's none of the cloying, terrifying spooky atmosphere that From Software so effortlessly evoked. As soon as you hit ~Quit to Main Menu~ you'll probably struggle to even remember the name of the realm you're supposed to be saving.I kind of hate having to so continually compare one game to another, but Lords of the Fallen offers little alternative. As tribute acts go, it's a passable riff on a much better game, and with no more new downloadable content for Dark Souls 2 coming up and Bloodborne still a few months distant, it's hard to deny its appeal as a temporary replacement for the winter months. For all its rough edges, if an easier, less obtuse variation on From Software's combat RPG is all you crave, then it will certainly reward you with a lot of game for your money.I just wish it wasn't so happy to sit in another game's shadow, and made more of the few fresh mechanisms that might distinguish it and move the genre forwards. Instead, it hews so closely to a proven template that it's basically a pretty good action-adventure by default. Yet as the game clock ticked towards 20 hours and beyond, I could never quite shake the feeling that I'd still rather be failing in Dark Souls than succeeding in Lords of the Fallen."}