{"ref": "https://www.eurogamer.net/f1-2014-review", "date": "15 Oct 2014", "game_name": "F1 2014", "text": "There's a great review of Midway's half-arsed Olympic Hockey Nagano '98 from the very early days of IGN, a scathing 0.0 score delivered with a pithy, one-sentence summary: ~We'll post a new review when Midway releases a new game.~It's always tempting to go the same route when presented with the latest iteration in an ongoing sports franchise, and it's a perennial problem for many series where innovation must be seen to be done to justify another annual instalment. FIFA's endless tinkering has been known to spoil an otherwise excellent formula - as seems to be the case this year - while poor Codemasters doesn't quite have the means to do even that. F1 2014 isn't just last year's game prettied up with a selection of season-specific skins, it's actually significantly less than last year's offering, with the classic cars that bolstered F1 2013 dropped entirely. It's also only available on last-gen consoles and PC.What you're getting here, then, is a selection of new car models, a couple of new tracks - the Red Bull Ring that returned to the calendar this season, a short track that takes in the glorious inclines of the Austrian countryside, as well as the Sochi Autodrom whose superb off-camber turn 3 couldn't make up for a thunderously dull debut for the Russian Grand Prix this weekend past - and... there's very little else. When an entirely inconsequential one-lap tutorial is being touted on the back of the box as a standout new feature, you know it's slim pickings. To outright condemn F1 2014 would be to do a disservice to the work Codemasters has done since picking up the licence in 2008. After a run of anonymous games from Sony and then nothing for years, the studio helped put a little passion back into it all. Over time, Codemasters' F1 games have blossomed into well-rounded, perfectly playable official accompaniments to that grandest of motorsports, and F1 2014 benefits from all that's gone before. F1 2014 can be a good driving game, and in the right conditions it's often a fantastic one. Played through a decent force feedback wheel on a PC with all the settings dialled up, it transcends mere competence to become truly compelling. All the tracks - a sizeable 19 in the increasingly bloated official calendar - all the sessions and all of the action are present, and as a straight reflection of one of the most dramatic seasons in years, F1 2014 is more than capable of doing the job. The more technically complex cars the regulations overhaul introduced this year are simulated, complete with the V6 power units whose whisper whine belies their ferocious delivery of energy. The sound might be less piercing, but the spectacle the new Formula 1 has presented this season has rarely been bettered - witness Valtteri Bottas wrestle the Williams FW36 around the tarmac on any given Saturday afternoon qualifying session, an exercise in thick-armed, quick-witted car control worthy of the great Ronnie Peterson. It's a constant debate between driver and car, the tail-end snapping out of place before it's rudely slapped back into line. F1's new turbo era is the measure of the more widely celebrated 80s turbo era before it, and even if Codemasters has cut the latter for F1 2014, it's done well to simulate the former. Aggressive torque comes across in cars that are all too keen to kick back before being addressed with a quick flick of opposite lock, and delivering a hot-lap in F1 2014 is an engaging negotiation with the handling model. Whether it's realistic or not is something few of us are equipped to answer, but what's important is that F1 2014 makes you feel like an F1 driver, and for anyone who's after some casual heroics emulating the world's finest, you can't ask for much more. All of which, sadly and quite bafflingly, is only true when playing on a wheel. One of F1 2014's additions is tweaked pad control tailored for more accessibility, but while that's great for newcomers to the series, the sport or the genre, for everyone else the result is a compromise that cripples the handling model.Played on a pad, F1 2014 is a different game entirely, and wholly for the worse. There's a leaden feeling that's been introduced for this year's model, the cars stuck fast to the tarmac and wallowing around without the water-boatman-like agility that's been the foundation of previous Codemasters F1 games. Even playing with traction, braking and steering assists all switched off, it always feels like the suffocating cushion of driving aids is present.It's enough to break the game. One of the harder scenarios offered in the returning Proving Grounds mode has you starting near the tail-end of the grid at a sodden Suzuka, setting out on slick tyres and hoping to capitalise on a drying track where all your competitors have opted for the safety of treads. It's a daunting task that requires delicate throttle control and insect-quick reactions - except on a pad, where it's not. You can stamp on the throttle out of a drenched Casio Triangle and barely get the slick-shod rears to spin before they're entirely muted, negating any feel for the track and any challenge. Why has Codemasters compromised the experience for returning players for the sake of accessibility? It's an odd one, lending some strength to the feeling that F1 2014 may have once been intended as a cut-price, no-frills companion piece to the real new-generation take on the sport that's now scheduled for the first half of next year. Much of F1 2014 suggests this wasn't meant to stand alone, from its lacklustre feature list to menus that are ported over, screen for screen, from last year's entry.F1 2014's a strange game, then, and one I can't even accuse of being just a casual reskin. It's a quantifiable step back for the series, saved only by the fact that what's there remains a satisfactory companion piece to this year's season if you're fortunate enough to have a decent steering wheel. There is at least one other new layer of authenticity for this year's game, though; charging full whack for what amounts to a slight downgrade is the kind of one-sided deal that would do even Bernie proud."}