{"ref": "https://www.eurogamer.net/lichdom-battlemage-review", "date": "30 Sep 2014", "game_name": "Lichdom: Battlemage", "text": "Imagine if JK Rowling wrote her next novel on the side of a speeding lorry. Not while it was speeding, impressive as that would be, but imagine if, in some weird avant-garde experiment, she decided to pen Harry Potter and the Midlife Crisis on a plain white truck trailer and then drove it around the country for people to read as it passed. How long would you follow it, craning your neck out of the car window and squinting at the permanently markered words, before you decided it was no longer worth the trouble?This bizarre thought bounced around my brain for at least half my time playing Lichdom: Battlemage - the same half wherein the game ceased to be capable of holding my attention. This is because Battlemage, developed by Xaviant Games, is a single, smartly crafted system deserving of a much better game to facilitate it. Although I appreciated the effort that has gone into realising the idea, there came a point where I grew exhausted from chasing after the bloody thing.Battlemage (let's dispense with the silly ~Lichdom~ part, shall we?) is essentially a first-person shooter with spells. There are no swords, no bows, and none of the sneaking that you usually see in a fantasy game. Battlemage focuses purely on magic and mayhem. You assume the role of an initiate mage whose name and gender are yours to choose. Oddly, the game doesn't inform you gender is optional until after you've chosen your name, which led to me playing as a female mage called Marley.The core gimmick in Battlemage is the ability for the player to craft their own spells via a system that is effective, if somewhat arcane in its implementation. Your basic abilities are divided between an attack spell, a defensive ~nova~ shield that issues a powerful counter-spell if timed correctly, an area-of-effect spell cast on the ground, and a short-range teleport for dodging enemy attacks. From this point, a spell can be defined by its sigil, such as fire, water or ice. Then you add a shape, so a targeted fire spell could take the form of a missile or a ray, while an AOE incantation might be defined as a trap or a pool. Lastly, the spell is augmented either for damage output, a controlling effect that obstructs or manipulates enemies, or a mastery effect that seems to lie somewhere between destruction and control.It's a fun system to tinker with, especially once you've unlocked sufficient sigils to really zoom in on how your character approaches combat. For example, I created a ~corruption~ ray I would use to blanket-infect opponents with parasites, which upon their demise would unleash a swarm of insects that then attacked the other infected enemies, causing a chain reaction. Later, I crafted a ~force pool~ spell which pushed nearby enemies away from it, causing damage in the process. This proved particularly useful for casting on narrow ledges. Even the more routine fantasy spells you can create - your standard fireballs, freeze rays and lightning bolts - are lent a real weight and purpose by the CryEngine tech. In a tactile sense, Battlemage a very satisfying game.That said, the system is hindered by a bunch of arbitrary limitations. Worst of these is that you can only level up three sigils at one time, and if you decide to move your levelling ~focus~ from one sigil to another, you lose all the progress made on the now-unfocused Sigil. In a game that is fundamentally about experimentation, punishing the player for doing just that makes about as much sense as giving a camel driving lessons.Problems aside, there's a fair amount depth to this system; you can upgrade spell components by combining them with two additional components or break a redundant spell down into its component parts. Unfortunately, exploring it in any greater depth would be a waste of words, because the surrounding game simply isn't very enjoyable at all.Battlemage sets its spell-slinging action in a series of linear levels ranging from crumbling catacombs to frosty forests to arid deserts. There's some impressive environmental artistry on show. One particularly memorable sight is a gigantic frozen maelstrom, the icy walls of which are dotted with the wrecked hulls of battling warships caught in the moment of the flash-freeze.The trouble is, it's little more than wallpaper. The actual level design consists of cramped linear corridors that funnel the player to the objective like a theme park ride. All the interesting areas are beyond your reach. There's a point halfway through the game where the story takes you through an enormous battlefield lined with army tents and siege engines, but it's all blocked off by a giant green force-field. I found myself pressing my nose against those spectral walls like a Victorian guttersnipe at a sweetshop window, yearning to venture past that barrier and sample the delights within.And these are long corridors. You're looking at around 20 hours of game here, which would be fine if those hours were consistently engaging. But Battlemage lays out its action in a horribly formatted way. You'll fight a wave of enemies, activate a ~memory~ cut-scene that dishes out a little plot exposition, have a chat with your ~Pathfinder~ companion - a laughable concept in such a linear game - who divulges a little more exposition alongside a snarky comment or two. Then you fight another wave of enemies. Repeat this 20 times before fighting an end-of-level boss, then do the exact same thing again in a new environment.This assembly-line structure, combined with the uninspired and tediously distended level design, destroys any sense of surprise or wonder you might get from either the environments or the story. Not that the story is particularly great - another example of a developer spending goodness knows how much money on designing pretty skyboxes before handing scriptwriting duties to the man who replenishes the coffee dispenser. In this instance, Mike from CafVendor might just have a literary career ahead of him provided he takes a writing course or two, having turned in a fairly inoffensive effort that does a few clever things with the concept of the ~Chosen One~. But too much of the action happens off-screen, with the Pathfinder and the memory rifts relating most of the information to you second-hand.I would stop there, but sadly, Battlemage makes a bunch of smaller yet no less grating mistakes: errors that were inducted into the FPS Hall of Shame years ago. These are so numerous that it would take another thousand words to criticise them in detail, so instead I'm just going list the worst of them and give you a link to the ~incorrect answer~ buzzer from the game show Family Fortunes, which you may play each time you read one.  Got your buzzer ready? OK, here we go.I think Xaviant Games may be going home before the Big Money.Facetiousness aside, these issues only add to the disappointment; the real problem is the bloated and repetitive structure. A cynic might infer that this is to justify that hefty £40 price-tag. Either way, Battlemage could be half as long and twice as good if Xaviant had spent their budget creating interesting scenarios. It's a bit depressing, because I like the spellcrafting; I like the combat system; I like the fantasy setting, which reminds me of Dark Messiah: Might and Magic, one of my favourite games. Xaviant is clearly a talented crew, and it's disheartening to see that talent corralled in such an uninspired way.I find myself thinking back to a Gabe Newell quote from the book Half Life 2: Raising the Bar, regarding the game's large portions of missing content. ~It doesn't matter what we cut, so long as we cut it and it gives us the time to focus on other things.~ I feel like this outlook is more pertinent than ever; there are too many games being released these days for them to waste players' time in the way Battlemage does. Editing in game design is as important as it is in writing or filmmaking. Get to the point. Respect both the time and financial investment of your audience. Above all else, don't send me chasing after the goddamn lorry."}