{"ref": "https://www.eurogamer.net/fantasy-life-review", "date": "24 Sep 2014", "game_name": "Fantasy Life", "text": "The brand of heroism expressed by a pointy sword has been well served by video games, but what of the noble lumberjack? How about the fearless carpenter? Or the gallant tailor? For that matter, where are the video game seamstresses? Shouldn't they too have the chance of a vainglorious death, the opportunity to issue a hoarse plea for revenge even as the knitting needle tinkles to the floor? Many are the roles needed to feed, clothe and equip an army of warriors, yet too often we are forced to play as a paladin, when perhaps the real hero is the angler who caught that guy his delicious kipper breakfast.Fantasy Life aims to accommodate all these ambitions and more. The brightly coloured pastoral town of Reveria is familiar and indistinguishable from a nation of Japanese RPG villages, but the lives you can build here are more diverse than in other fantasy games. Here you are free to become a different sort of saviour: a superman amongst miners, a champion amongst chefs, a fisherman king. You are, of course, also allowed to play as a paladin, a mercenary, an archer or a mage and, in truth, you'll need to spend at least a little time in one of these roles in order to learn how to hack and spell your way through the monster horde outside the village gates. Nevertheless, variety is the spice of Fantasy Life, and the chance to try out a range of callings is welcome.Similar to Animal Crossing, you begin the game as a young boy or girl who arrives at an unfamiliar town, where you take up residence with a local landlord and begin the business of settling in with the locals. The game has a day and night cycle and you are responsible for how you use your time between dusk and dawn. You can even pull an all-nighter at the stove or lathe, should you so desire.However, your days are busier and more filled than in Nintendo's gentle-paced simulation series. The town is filled with non-player characters desperate to issue you with petty errands, and you can have up to 30 of these running concurrently. The talkative butterfly you fall in with during the game's opening scenes also has an ongoing clutch of things he wants you to do, and that's before you even begin to pursue the ongoing demands of your chosen profession. Throughout the game's script, ~life~ is used as a euphemism for ~job~, but the busywork involved is less easily covered up.The game's 12 jobs can be switched between at the guild office in the centre of town. Each role has its own leader, community and even district. Once you opt to follow a certain career path you must meet with the guild's leader, learn the interactive ropes and begin to carry out a litany of quests, each of which improves your abilities and rank within the guild.Inevitably, the quality of the 'work' itself in each role varies. As a warrior type you'll be questing out into the surrounding regions, hunting wolves, gorillas, weaponised caterpillars and other assorted monsters. As an angler or woodcutter you must visit appropriate locations to gather resources (at least you can chop trees down more quickly if you find their weak point). Most of the indoor jobs take the form of quickly tedious microgames. As you improve in each role your range of abilities increases and, in most cases, things that you learn in one role can be carried over to another, much like in Final Fantasy 5's much-echoed job system.After a few hours the game's pleasing ecosystem is made clear. You are able to chop down a tree and gather the wood as a lumberjack. Then you may take the wood to a workshop and, in your role as a carpenter, turn it into a piece of weaponry. Finally, the sword can be used on the battlefield as a mercenary. This interplay of interactions will be familiar to players of some MMOs, especially Final Fantasy 14, which employs a similar system. In Fantasy Life, however, the job system is the primary attraction rather than a supportive system within an overarching quest. There is a broader storyline to follow here, but it sits in the background, slow-moving and ultimately inconsequential. When there's no narrative engine to drive you through the virtual toil, the game begins to seem futile and wearying.Development of such a broad and ambitious vision has clearly been a struggle. Fantasy Life was originally intended to be a Nintendo DS title but, due to protracted development, moved to the 3DS. It has, however, benefitted from a superlative team. T's been created by Level 5, the studio behind the Professor Layton series and top-tier Japanese RPGs such as the most recent Dragon Quests and Ni no Kuni (a collaboration with revered filmmakers Studio Ghibli). Fine artist Yoshitaka Amano contributed as did his fellow Final Fantasy alumnus, composer Nobuo Uematsu. If that weren't enough juice in the talent pool, Level 5 also partnered with Brownie Brown, a diminutive Japanese studio formed by former members of the Secret of Mana action-RPG team.Its pedigree, in other words, is exemplary, and that's born out in the slick presentation, elegant pacing and a witty script. The game is filled with tiny jewels of design brilliance. Your character can level up almost every facet, including their stamina when running through the world or creeping past enemies. There are the myriad supporting systems, such as the ability to keep pets, to decorate your home or to hire a horse in order to travel. There's a wonderful sense of ceremony every time you level up a role. The game is rich, filled with the kind of idiosyncratic detail that only comes from a well-funded and amply talented team. Alas, perhaps, the team was given too much to work with. There is an abundance of features: you can quest with others in multiplayer, send letters, take screenshots and even drag larger monsters that you capture back to town for a bounty reward. But the result is less than the sum of its parts. Fantasy Life fails to capture either the lazy, pleasing routine of village life seen in Animal Crossing or the sense of urgency from the strongest Japanese RPGs. In its eagerness to offer variety, Fantasy Life somewhere lost its focus."}