{"ref": "https://www.eurogamer.net/planetary-annihilation-review", "date": "16 Sep 2014", "game_name": "Planetary Annihilation", "text": "Planetary Annihilation is a real-time strategy game founded on a dream, and funded on an image. The dream was a noble one: the robotic conflict of Total Annihilation on an interplanetary scale. The image? A moon, rigged with the enormous engines of player one, rocketing straight towards a temperate world hosting the impenetrable base of an unsuspecting player two.This month Uber Entertainment declared Planetary Annihilation complete and is selling the finished game with an even more arresting image: a screenshot of the ~Annihilaser~ which arrived in the last patch, allowing players to turn any of their metal planets into a Death Star and pop celestial bodies like balloons.For posterity's sake, then: is this the biggest, silliest RTS ever?Sadly not. Just as Supreme Commander imagined endgame units towering over crowds of smaller robots, Sins of a Solar Empire bore a proud, operatic texture or R.U.S.E. chased after emotional peaks, Planetary Annihilation only makes headway in yet another kind of scale. Yes, you can annihilate a planet by building a gun into a moon - orbital craft joining ground, sea and air units as a fourth category - but you're also doing it in the cutest widdle solar system. Scout units will circumnavigate even the largest planets in just a minute or two, and your interstellar transports will rarely take longer than a few minutes to travel between them.Better, then, to focus on the game proper, which seduces almost immediately.In the style of Total Annihilation, players all start with a mighty-yet-curmudgeonly Commander robot, and win if they eliminate (all) the enemy Commander(s). Picture it: with a few clicks and a shimmering spray of particles your Commander whips up a metal extractor and a power plant, increasing your steady influx of resources. A vehicle factory comes next, as well as some defensive towers. Barely two minutes into the game you'll be producing an unending stream of tanks, your opportunity to expand further limited only by how fast you can click and think.Your mouth forms an ~o~ as you notice that the Fabricator robots you can produce at your factories can produce more advanced things than your Commander can, including Advanced Factories. Now you're building artillery emplacements, radar, your huge advanced vehicle factory producing even bigger tanks, and what's this? Oh my goodness! The Advanced Vehicle Factory can produce an Advanced Fabricator! You can't build it fast enough. Click click click, you summon your Commanders and Fabricator vehicles to speed up its construction by spraying their metal particles directly onto the unit.Finished, the dinky little thing rolls onto the planet. Looks like it can build... a Nuclear Silo?! You set it building, only for the little thing to immediately drain your inadequate power and metal reserves. It takes you just a few seconds to assign orders to your fabricators to build more than 30 metal extractors spanning the entire globe.You see, Planetary Annihilation offers less of a tech tree that players are doggedly climbing up and more of a set of laterally-sprawling monkey bars. You want to fill the skies with planes? Sure. Feel like harvesting the resources of the nearby gas giant, letting you spew out the most advanced robots without a second thought? You got it. Every construction hints at what you might build next and all of it looks lovely. Chunky, noisy little robots that lay waste to forests and structures the second they open fire.Your first few hours with Planetary Annihilation will see you thrilling at this as you and your stocky little Commander trundle slowly through one of the randomised Galactic War campaigns, picking up new tech and taking joy in the construction of thingies and the destruction of other thingies. Where Planetary Annihilation started to lose me is the instant the game began getting tougher. As you'd imagine, I started wanting to learn the correct answer to what factory to build first, and which of the four unit types to build from any given factory, and in what combination. I wasn't expecting StarCraft-like levels of balance, but I wanted to learn the point of all these toys. In what situations should you choose robot factories over vehicles? The seas, when they appeared, always seemed peculiarly small. Why the sprawling naval tech tree? What good are flamethrower tanks? When's it worth building base defences when the enemy can approach from anywhere?These are questions with one ugly answer. There are two games tucked away in Planetary Annihilation. The colourful one comprising its opening hour, full of variety and promise, and what it actually is: players racing to draw the quickest, ugliest lines through all of its content.Utilising the game's secret third resource of clicks-per-minute, you want to get your economy up and running as fast as possible (pros recommend using mod assistance to smooth out the game's interface), first producing fabricators and then sending them roaming across the planet to metal extractors as fast as possible. Meanwhile, you want to construct factory after factory, spewing out tanks, and with any mental faculties you have left you'll want to be dispatching tanks around the world to crush any and all metal extractors and fabricators you find. Naval units are almost useless, while planes can be lethal. Advanced tech can be safely ignored until you're involved in the business of harassing your opponent's own factory construction. Altogether it's a tense but ultimately exhausting exercise in micromanagement, and compares unfavourably with other modern RTS games in terms of breadth and depth.Things are most awkward of all in Planetary Annihilation's own personal new frontier: the additional dimension of interstellar combat. Spacecraft have by far the least variety of any unit type, and ordering them around the solar system is the most taxing and least enjoyable aspect of the game. There's no large-scale transport unit, either, so in any single-player campaign games without advanced space tech (with which you could build a teleporter from orbit), launching a planetary invasion means loading a crowd of units into an equally sized fleet of single-unit transport craft. A logistical operation with all the appeal of counting sand.All of which is an underwhelming challenge to try and master and it's unpleasant to be on the receiving end of it, with tiny little groups of units ceaselessly raiding your handiwork. After being burned once when the AI took out my main power plant, I got into the habit of having fabricators building an unending string of power plants on multiple planets, just so my teleporters and factories would stay online. The entire game is like this. Strategy takes a backseat to speed, efficiency and swarming your opponents.None of which is inherently terrible, and a lot of people will look past this for the chance to simply experience an epic 5v5 game, or a similarly mad 2v2v2v2v2v2v2. But it's still a style of play that massively limits Planetary Annihilation's appeal even before you get into the comparatively light single-player component and the occasional bug. I had matches where the AI stopped after building a couple of structures, as well as one amazing game where my chosen spawn point dropped my proud commander in an inescapable canyon.Don't get me wrong. I do still think that featuring a Death Star in an RTS is a fantastic achievement. I just wish they'd also included something worth fighting for."}