{"ref": "https://www.eurogamer.net/road-not-taken-review", "date": "7 Aug 2014", "game_name": "Reviews", "text": "~Every winter we lose a few,~ says the mayor, matter-of-factly. Bereavement is the cost of living in a remote village where once a year a winter storm sweeps the children from their beds and deposits them somewhere in the vastness of the bordering forest. Your job, as the newly hired ranger, is to lower this annual death toll, to make the ~few~ fewer still. On the morning after each year's storm you crunch into the forest's shifting clearings. There you search behind rocks, trees and wolves for the lost children whom you must deliver safely back to their pacing mothers. Your contract lasts for 15 years. You must rescue at least half of the children after each storm in order to progress to the next year. But, as the mayor advises, if you choose to leave the forest before you've found every last child, try not to look the parents in the eye on your way back home.It's an emotive premise, and one that injects Road Not Taken's brilliant yet convoluted mechanics with urgency and soul. Fittingly for a game that's about combining different things to create novelties, developer Spry Fox has combined the match-three genre with a rogue-like to create a game that is both idiosyncratic and unfamiliar and the story helps to ground its curiosities with a clear goal. The forest is divided into a series of linked, randomly generated areas that house animals, objects and the absent children. You are able to move freely around the gridded environments; each time you move any other creatures in the vicinity take their move in kind. Otherwise, your interactions are limited to lifting, carrying and throwing. Most objects and creatures can be lifted. Many of the forest's clearings have doorways that lead off the new areas, which open only when you match a set number of specified objects. You might need to arrange three hedges so they're touching in order to move West, or shepherd three deer into a huddle in order to move South. You can move while holding an object or creature but doing so will forfeit one unit of energy. Lose all of your energy and you'll die out there in the forest. Rather than heft the objects around, then, it's better to save your energy by lifting and throwing them into place. Like rearranging the furniture in a cramped room you begin moving and swapping. The ultimate aim is always hurl a child at a waiting parent, but there are many spatial micro-puzzles that must be cleared first. This is a puzzle game about angles - the kicker being that the procedural generation ensures no two rooms are ever the same. Every solution is yours alone to discover.Complexity is added by way of an arcane crafting mechanic. Group certain objects together on the map and they'll combine to create new things. Combine four red forest spirits, for example, and you'll craft an axe. Hurl the axe at a tree and it'll change to a log. Combine two logs and you'll make a fire. Throw a raccoon onto the fire and the resulting meaty stew will renew your energy. There are two hundred different objects and creatures to discover in the game, many of which can be combined in different ways. Every time you find a new item or combination it's added to a craft book (which can be accessed with a single button press) but the information is difficult to both browse and parse. As players of Spry Fox's previous game, Triple Town might expect, Road Not Taken is a highly engineered game. As well as the procedural rooms, the designers add in 'set' puzzle rooms occasionally (which are the same each playthrough) as well as boss stages, where your character's energy can be wiped out in a few ill-considered moves. There's also a meta-game back at the village, where you are able to chat to the residents and offer them gifts of rice, berries, rabbits and coins (depending on their preference) to enamour them towards you. As these characters become your friends they offer you useful items (charms that will, for example, increase the amount of energy that's restored when you eat honey) or whisper database-filling information into your ear. But they can also become jealous of your relationship with other village residents, and will require further gifts to renew the friendship.The game's difficulty scales quickly. By the fifth year the rooms are cramped with myriad items and creatures. If you lose all of your energy (which doubles as your health bar) you must restart the game from the beginning as a new ranger - although, mercifully, it is possible to 'save' your game during latter stages by offering some of your accrued items at a shrine. It is also possible to snooker oneself in the game's levels, by accidentally blocking entrances or key items that need to be coupled in order to unlock important doors. While you can always teleport back to the mayor at the forest's entrance (and, in the worst-case scenario, abandon every child entirely - something you can only do once, a decision which the mayor then refers to as the ~bad~ year) there's inelegance to the design, even if it's of your own making.Back at the village you're given a house in which to store the items you find. In its basement there's also a room where you can choose to 'ban' certain objects or creatures from the forest, thereby removing certain types of puzzle from the game. It's impressively flexible but despite the capacity for tinkering, the game maintains a mysterious, arcane feel. You're never fully in control and the foibles of the procedural generation offers regular reminders of this fact. Road Not Taken is impressive, but is it satisfying? Too often the game feels overwhelming, wearying and frustrating. Shunting items back and forth has a feel of busywork and the solutions, when they come, can feel like somewhat hollow victories. (As they mayor says one time, after you've lost a few children, ~We'll make some more.~) These reservations aside, Road Not Taken is fresh, interesting, beautifully presented and demonstrates an intricacy of design that will obsess a certain type of player. It's an acquired taste, though, despite its popular ingredients."}