{"ref": "https://www.eurogamer.net/the-walking-dead-amid-the-ruins-review", "date": "24 Jul 2014", "game_name": "The Walking Dead: Season Two", "text": "Note: as ever with episodic games, this review may contain spoilers for previous episodes of Season Two of The Walking Dead. So proceed with caution!You don't need to be a Professor of Metaphorology to realise that the titular ruins in this penultimate episode of The Walking Dead: Season Two aren't really the remnants of the Civil War fort where the survivors find themselves hiding out. Last time saw them captured and escaping from Carver's unhappy little community/prison camp, and none escaped without scars. Now, all they want is to take a minute to regroup and reassess, despite knowing full well that they're never going to be so lucky. For starters, Rebecca's baby is on the way and an army of walkers is only a little down the road.This feels like a breather episode, though this being The Walking Dead, that doesn't mean a lack of drama - death is still just one QTE away for Clem and friends and the group is visibly cracking under the pressure of staying alive. Still, it feels like a strange lead-in to the final episode. Last season, episode four ended with Clementine abducted, Lee bitten and past choices coming home to roost as the survivors decided whether or not they were going to back Lee's suicidal rescue play. This time, things are much less personal and there's a lingering sense that the writers aren't quite sure where they're going.In particular, taking a break shines a spotlight on one of this season's biggest problems - its struggle to be about anything. Switching Clementine into the lead role initially changed the flavour of the series in an interesting way, but the episodes quickly gave up on exploring the Walking Dead universe from a position of weakness in favour of just making her hyper-competent: a zombie killer capable of going toe-to-toe with anyone unless the plot demands otherwise, and the lynchpin of the group to the point that even she's started lampshading it. She's still a great character, but one with many missed opportunities, and her new group of survivors are all over the place. They're held together by the spectre of Carver, the fantastic Michael Madsen-voiced baddie who dominated the earlier episodes even when he wasn't on screen.Now that he's as gone as gone gets, there's an almost audible murmur of ~So, what now?~ - both in front of and behind the virtual cameras. The former, fine; the latter, not so much. Rather than simply tying off loose ends from Carver's camp, this episode actively cauterises them, as if Telltale realised that racing through the potential of the camp in a single brief episode had been a really bad call. That, after all, was where all the drama was focused this season: a place of both temporary safety and omnipresent danger, the threat of which has been hanging over the series ever since the 400 Days bridging episode. To finally get there, barely look round and instantly escape in the name of the series' need for forward momentum felt like a mistake then (if not an inability to book much time with Michael Madsen) and now feels doubly so. Without that focus, there's just more of the same doomed survivalism, to the point that the cliffhanger - as well as ignoring a key decision in my playthrough - has to pull a new threat out of nowhere to set up the finale.It doesn't help that no cliché is left untouched as Rebecca goes into labour. It's all very stock, predictable stuff; the cast find almost everything they need in an otherwise ransacked museum and there's a convenient appearance from another survivor who just happens to be carrying a big bag of painkillers and medicine.The strongest sections are, as ever, Clem's reactions to the grown-ups around her, in particular a chance for her to adopt loner survivor Jane as an honorary big sister when they go off and have an adventure together away from the angst at camp. The two play really well together, and this interlude sets up one of the funniest moments of the episode, when yet another survivor decides not to heed the counsel of Queen Clem - now officially the world's most dangerous half-pint this side of a molotov cocktail.Mostly, though, this episode is just going through the motions. Is there a zombie waiting for a jump-scare behind that locked grille that everyone wants Clementine to crawl through without checking? Is there a binary moral decision where the 'right' call is as obvious as the fact that the plot isn't ultimately going to care? Is there a point where two characters are in mortal peril and only Clem can make the call? Of course there is. As we've said before, The Walking Dead is painfully in need of new tricks and surprises. We've seen all of this so many times and had so many characters not so much killed as culled once their usefulness to the story runs out that what was once shocking now has no real power left.Where the episode succeeds is, of course, where The Walking Dead always does: in its excellent pacing, character writing and moments of incredible sadness and doomed highs. The air almost buzzes with tension and Clem regularly has to handle her friends' emotional knife-edges: Kenny is playing Achilles in his tent, openly wishing Carver had killed him and gotten it over with, Sarah is traumatised to the point of disconnecting from reality and Jane is fighting every urge to clear out before she has to watch painful history repeat itself. These are powerful sequences, superbly written and handled, even when you know that the path is never as branched as it feels like it is or, arguably, needs to be.Among the Ruins is The Walking Dead doing what The Walking Dead does well, but it's spinning its wheels when it should be racing towards the finale. As far as Clem's story goes, it's hard to fight the feeling that what began as an exciting opportunity for the writers has now become something of a millstone when it comes to plotting. Can the final episode recapture the power and drive of her brutal first episode, as well as plot its way to a send-off as beautifully appropriate as Lee's at the end of the first season? We'll find out in a couple of months, when The Walking Dead: Season Two concludes in ~No Going Back~."}