{"ref": "https://www.eurogamer.net/fifa-22-review-morally-bankrupt-monetisation-lets-the-side-down-once-again", "date": "27 Sep 2021", "game_name": "FIFA 22", "text": "I'd say I sound like a broken record but at this point I may as well chuck out the record player. FIFA 22 is a game with plenty of solid improvements, but it is - once again! - let down by morally bankrupt monetisation.I'm going to start with the good news because I like to kick things off with a positive. FIFA 22's gameplay is a crowd pleaser. It's slightly slower, more considered, with less emphasis on ridiculous skills and more emphasis on passing. It is a reaction to FIFA 21's high-scoring fun, which by the end of that game's life had become something of a joke within the hardcore FIFA community. FIFA 22, then, plays harder.That is to say, it's harder to score and harder to win for a raft of reasons. The goalkeepers are much improved. In one-on-one situations they're all prime Buffons, with an annoying habit of getting a hand to shots from inside the box that would almost always go in in last year's game. There are some new animations for the keepers and you'll see them quite often. They'll reach across with their strong arm to save shots now, and pat strong shots to the ground before gobbling up the ball. Defenders with low pace are more viable because they have a habit of blocking shots and passes in the final third. They feel stronger, too.The players are at the heart of this new, weightier feel, which is certainly an improvement over last year's hyper-ball, but sometimes it feels like they react too slowly to your commands. There's a new Explosive Sprint (R2 / RT) mechanic but I find it barely makes a difference. Players seemingly take an age to pass or shoot after you've pressed the button. Playing FIFA 22 can sometimes feel like getting 11 tiny oil tankers to run after a pretend football.New animations come into play here. There are some lovely additional touches players make when controlling the ball, bringing a high pass down, for example, before spraying it out wide. Lofted passes are more effective this year, and the ball physics for these passes looks more realistic. Through balls - either in the air or on the ground - are an early favourite of mine, particularly for playing in a forward from the wider parts of the pitch. Driving into the box and simply shooting isn't as effective. It's early days, but so far I've found there's joy to be had from working your way towards the box from the wing for a potential cutback goal. That or a finesse from just outside the area.You know what playing FIFA 22 is like? It's like watching Gareth Southgate's England. There's a single-minded grind to it. Two defensive midfielders who battle to control possession and race to regain the ball when they don't have it; skillful, pacey wingers who look to get as close to the box whenever they can; slow but dominant defenders who are good on the ball; fullbacks who create as many chances as they prevent.There is little joy to be had playing FIFA 22, but I think that is by design. What you get instead is a bucketload of stress with the occasional dollop of satisfaction that comes from crafting a well-worked goal. And then Kalvin Phillips passes to Declan Rice, who passes back to Harry Maguire, who drills it out to Luke Shaw, who lays it off to Raheem Sterling, who goes past a player before passing it back out to Shaw, who then crosses the ball for, hopefully, a Harry Kane or Sterling tap-in. Maybe Jesse Lingard comes on as a sub to curl one in from 20 yards during the closing stages. Nothing here for the YouTube compilation videos, the '20 goals we'll never see again' algorithm chasers, the '10 times Ronaldinho shocked the world' advert sinks. Just good results, a wry smile and arms folded as relief washes over you. Then anxiety kicks in over the online match to come.Hardcore FIFA fans will enjoy these changes, I think, because they force you to work for your goals in new and interesting ways. My feeling on it ebbs and flows with each win and loss. In the weeds of FIFA Ultimate Team - FIFA's controversial and most popular mode - online ranked play is a brutal space. EA has lumped everyone in Division 10 - the bottom division - from the start of this year's Division Rivals journey, and so casual or even middling FIFA players like myself are being shot to pieces by the beasts who really should be facing others of their own skill level. Without the safety blanket of a placement match system, it's carnage out there.I can see the bigger picture through my online inadequacies. FIFA 22 plays a better, more realistic game of football than its predecessor, and the developers at EA Sports should feel pretty good about that. But - and this is a big but - we've been here before. FIFA games tend to start off feeling slower because of the power reset that comes with Ultimate Team's increasingly annoying annualised release schedule. Players tend to enjoy this time because everyone's in the same boat (well, not everyone - but we'll get on to that), working their way to obtaining better players in better squads, working out what works and what doesn't work. Perhaps in a month the meta will be dominated by a particular method of scoring. The finesse shot from just outside the box, I'd bet - unless EA Sports feels the need to nerf it with an early patch.And for all EA's efforts to slow things down, a player's pace, power and balance are paramount - as they have been for years. It's why, in Ultimate Team's auction house, Chelsea's much-maligned speedster Timo Werner costs twice as much as Spurs and England star Harry Kane, who in the real world is one of the best strikers in the world. This is not a new conundrum for EA Sports. How do you make the world's best regista, Jorginho, who this summer won the Champions League and the Euros despite having all the speed of a turtle inching its way up a sandy beach, effective in a football video game in which Manchester United's Anthony Martial plays like prime Brazilian Ronaldo? All these years later, EA still hasn't cracked it.Moving on from the gameplay itself, there are many other areas of improvement across FIFA 22, and they're not just limited to Ultimate Team. Career Mode has some smart additions worth highlighting, including the ability to create your own club. I'm not one for Career Mode, but I know for many FIFA fans it's the only reason to buy the game. From what I've seen the reception to the changes has been positive.It's a similar deal for Pro Clubs mode, which has a new drop-in feature that should make it more accessible (Pro Clubs is an online mode in FIFA that lets you create a virtual player and play your position on the pitch with teammates in 11v11 matches). It lets you create and play as a woman virtual pro for the first time, too. Again, Pro Clubs isn't one for me, but it's a big deal for a lot of people, so it's good to see EA making further improvements.Volta mode remains an oddity. I don't know anyone personally who plays this FIFA Street-style mode, but EA is sticking with it and has made further improvements. New this year is the Volta Arcade, a weekend-only playlist of special four-player party games, including Dodgeball, Foot Tennis, Team Keepaway and Disco Lava. It looks like off the wall fun!There are loads of quality of life improvements, too. There are now detailed half-time and post-match stats, so if you want to act like a football hipster who's obsessed with the Bundesliga and fuss over your players' expected goals (xG) stat, or analyse a heat map of your players' movement, you can (you support Borussia Dortmund, don't you?). The user interface is still a little unresponsive, but it's more intuitive this year and it's quicker to get to where you want to be, particularly in Ultimate Team. And I'm actually fussing over my stadium customisation this year. Yes, I know. I can't believe who I've become, either.So far, so good, right? If only that was that. But, as we all know, FIFA 22 is not just that.Ultimate Team is changed for FIFA 22, and in many ways for the better, but it cannot unshackle itself from its rotten foundation. It feels to me like the developers are doing all they can to make Ultimate Team a fairer, less grubby and exploitative experience, but are only able to shave the edges off the fundamental problem - that the EA machine must rumble on, and so loot boxes are here to stay - despite what the world and, increasingly, politicians, think.Let's start with those shaved edges. Clearly, EA has tried to make Ultimate Team a more generous and user friendly experience - and for the most part the studio has succeeded in that goal. The aforementioned Division Rivals mode now leans on the seasons model popularised by the battle royale, which means you make a little bit of progress even when you lose (and I lose a lot!). There are checkpoints for matchmaking, so if you do manage to get promoted out of Division 10 into Division 9 (good luck!), you won't get relegated within the season.FUT Champions, FIFA's most hardcore competitive mode, is now split into the play-offs and finals, with access granted by earning enough qualification points in Division Rivals first. You can start your Champions run via the play-offs whenever you're ready during the six-week FUT season. The finals take place over the same duration as the old Weekend League, with a limited entry system and fewer matches to pack in.And there's co-op public matchmaking via a new online friendlies mode that lets you drop-in and pair up with others to play with pre-made squads, which is a really nice, care-free and fun way to play FUT.Despite all these welcome changes, EA has stubbornly refused to go down the premium battle pass route, sticking with pay-to-win loot boxes. It's a really disappointing decision, but I suppose not an unexpected one. Until governments decide loot boxes are gambling, EA will continue to use them in their family-friendly football game. Seemingly, it doesn't matter how many experts express concern about FIFA's business model and its impact on children - until EA's hand is quite literally forced to push the button that changes how Ultimate Team works, its fundamentals will continue to work as they have done for years.EA will of course point to the addition of preview packs this year after trialing them towards the end of FIFA 21's life. But these preview packs do not help much at all. At launch, preview packs let you see what's inside one gold pack and one silver pack before buying. If you then buy a previewed pack, you can preview another pack. But if you decide not to buy a previewed pack, you have to wait 24 hours before you can preview another pack. Thanks, EA.EA will also point to the increased number of ways you can earn packs and FUT Coins (the in-game virtual currency) through gameplay alone, whether it be through completing objectives or collecting rewards from playing Squad Battles, Division Rivals or the Draft. Again, it's shaving the edges off the problem. It's nice to have this stuff as you get it, but at the end of the day those loot boxes are still there, stinking up the place.Will EA continue to exploit FOMO with limited-time promotions? Of course it will. It's already doing it in FIFA 22, with the first team of the week cards ~available in packs now for a limited time!~ Will EA continue to release coveted icon cards that are nigh-on impossible to obtain through legitimate means? Of course it will. The spice must flow.I do wonder whether FIFA 22 could be the last game in the series to work like this. In the UK, the government is looking into loot boxes to see if the law should be applied to them. In December 2019, the Department for Digital, Culture, Media and Sport launched a review of loot boxes alongside a wider review of the Gambling Act 2005, and in June 2020 announced a public call for evidence. The government commissioned Abertay University to assess this evidence, and the hope is a report will be issued by the end of this year. If so, the government may act at some point in 2022.While EA maintains Ultimate Team's loot boxes do not constitute gambling, in a recent regulatory financial document the company acknowledged a change in the law could significantly impact its business. EA knows it could be in real trouble if the UK takes a hard line on loot boxes. And if it does, EA will only have itself to blame. No-one likes loot boxes, and in 2021 they feel archaic in video games. When even Call of Duty has ditched them and you haven't, you know you're on the wrong side of history. EA is desperately clinging on to its cashcow and with each annual release of FIFA it looks increasingly ridiculous doing so. One day it's going to fall off - and it could be a hard landing.And so we come to the question I've pondered for so long about FIFA: how to judge a game that has a lot that's decent but also this other bit that's morally reprehensible? I play a lot of FIFA, and with good reason. I enjoy it, in a grumpy sort of way. Reporting on all the good, bad and ugly FIFA has to offer has been a fascinating part of my job over the last decade. If you're only in it for Career Mode, for example, FIFA 22 is a good shout. If you only play Volta (there must be someone!) then there's nothing particularly offensive about the game. But context is king. Ultimate Team cannot be ignored.So, here's to another FIFA 22, much like the last one, and the one before that, and the one before that - a game that would be so much better for the soul were it not dragged down by the clawing hand of capitalism. Much like real football, I suppose."}