{"ref": "https://www.eurogamer.net/dirt-5-review-enjoyably-old-school-arcade-racing", "date": "3 Nov 2020", "game_name": "DIRT 5", "text": "Dirt has been many things in its lifetime, but here's a first: a mainline entry developed outside of Codemasters' Southam campus as its Cheshire studio takes point, giving us the series' trademark raucous off-roading through an all-new filter. The results are fascinating, if not always entirely convincing. With the Dirt Rally series picking up the more serious and sim-minded point-to-point action, Dirt 5 is a pure arcade racer, packed full of spectacle and a smattering of smart ideas, and while some parts ring a little hollow, others can still leave one hell of an impression. It's a multidisciplinary racer, and a patchwork of different influences, but by far the biggest is Dirt 2 - that loudest, most raucous of Dirt games, with its music festival framework that the original Dirt 2 team would go on to develop further with the Forza Horizon series. In Dirt 5, that festival vibe pervades - you're given a customisable lanyard and access to a lattice of various events split over five chapters, all underscored by a light story headed up by Nolan North and Troy Baker. Don't run away just yet, though. If it sounds a little off then it most definitely is, and if you were concerned that Dirt 5's initial announcement led with this bizarre little inclusion, I totally get it. So I'm pleased to say it's almost entirely inconsequential, confined to some light babbling in the background hosted by Donut Media's James Pumphrey and Nolan Sykes, with North and Baker making what amounts to cameos in a series of podcasts (there's a further cameo from W Series champion Jamie Chadwick, who does a sterling job of pretending to phone in from a festival in Nevada). It all builds to a showdown that can't help but feel a mite anti-climactic, though I'm more than okay with that.Importantly it never gets in the way of the action, and Dirt 5 has that by the muddy bucketload. There are 90s rally cars to rag around the outrageous countryside of Guilin, GT off-roaders to thread through the favelas of Rio, rallycross cars to trek up the mountain passes of Greece or massive rock bouncers to overcome tricky Path Finder stages that wind through rubble and ruin. Those latter events, new for Dirt 5, are a fascinating oddity, playing out like an Overpass-lite as you pick your way through the terrain. They're the only real place you'll find yourself racing solo, in traditional rally style - more often than not, Dirt 5 is about elbows-out pack racing, that pack kept tightly bound together by AI that feels like it's been lifted from Onrush with a lot of that aggression toned down. Which means this Dirt, while familiar, feels very different to previous mainline entries. There's no co-driver, no rewind feature and not much by way of traditional point-to-point events - instead what you get is a punchy brand of short races that feel like they've been forged in the colourful cauldrons of the 90s arcade. It works well too, and there's an infectious energy to Dirt 5 that makes it a pleasure to spend time with - it's upbeat, vibrant and almost obnoxiously colourful, serving up a proper assault on the senses in time-honoured arcade racing style. It looks lush, basically, and in the frequent spectacle of Dirt 5 you see a little of Codemasters Cheshire's DNA shining through. You might know the developer under its previous guise of Codemasters Evo, or going even further back as simple Evolution Studios, and you can see so much of its history bubbling up throughout Dirt 5. There's that scrappiness to the racing familiar from MotorStorm (underserved by a fairly limp damage system here, I'm sad to say), and a technical prowess and affinity for atmospherics that's familiar from DriveClub. Dirt 5 can regularly be a real looker. That's most explicit when events whisk through dynamic time and weather, letting you see the sun set over an ice-coated Norwegian village, or later allowing you to race under the northern lights. The track design plays beautifully into all that, giving you lofty views of a town you'll soon race through, or simply winding their way up into a gloriously detailed night sky. Even on the  Xbox One X and PS4 Pro on which this was reviewed (impressions of the next-gen versions are embargoed until a little later this week), Dirt 5 frequently impresses, running at a reasonably steady 60fps. Like the studio's Onrush before it, this is a racer that fizzes with ideas. Playgrounds mode is new to the series, introducing what amounts to Trackmania-esque level creator and sharing tool that's surprisingly effective - I've already run through someone's convincing recreation of a classic X Games set-up, and I'm excited to see what else the community can cook up. In an associated feature, it's a pleasure to see Gymkhana return from Dirt 3, which essentially serves up a small, obstacle-filled playground to run tricks and rack up a high score, Tony Hawks style. Elsewhere you'll find a variant of Dirt 3's Outbreak in the all-new Vampire mode that sees one player look to infect others by contact - a party game that's part of a multiplayer suite that also includes splitscreen. There's an awful lot to like in Dirt 5, and I like it an awful lot, yet I can't quite bring myself to love it. One consistent point across the myriad modes on offer is handling that's flat and uninspired - to get any real sense of fun out of these things you need to grab them by the scruff of the neck, and the only real way to break traction is by pulling hard on the handbrake. It's distinctly hollow, even if it does have its moments - put a Group B Peugeot in an Ice Breaker event and it's certain to invoke a smile, but it's only in those extremes that Dirt 5's handling ever really proves engaging. It's a small shame but a big deal for a driving game, undermining much of the great work that's been delivered here - Dirt 5's vehicles feel like they've been wrapped in cotton wool rather than being snarling, living beasts that need serious taming, which can make much of the action a bit of a snooze. Is it enough to derail the entire thing? Not really, and after the identity crisis that plagued mainline Dirt it's heartening to see it back with a sense of purpose, and a little of that old swagger too. There's still some tinkering to be done, though, if it wants to return to the series' peaks."}