{"ref": "https://www.eurogamer.net/the-wolf-among-us-cry-wolf-review", "date": "11 Jul 2014", "game_name": "The Wolf Among Us", "text": "And so Bigby Wolf's first gaming adventure comes to a close. It's been an uneven journey, to say the least, with some episodes feeling particularly light while others have crammed plot twists and action scenes in so tightly you can barely breathe. The writing, as you'd expect in a Telltale game, has been sharp and memorable, but the gameplay has wobbled as the developer struggled to adapt this prequel to an existing story (the Fables graphic novel it's based on) into the same framework that served The Walking Dead's standalone side-story so well.Of course, this is the point where I wave my hands in an ominous way and warn of potential spoilers ahead. I won't be revealing any blunt story details, but as always, just by talking around the way the story unfolds, you may learn more than you wanted to.Surprisingly, that warning isn't quite as dire this time around, despite this being the final chapter in the tale. There really aren't that many twists left to reveal at this stage, as the action picks up with Bigby entering the lair of Fabletown gangster The Crooked Man. Events unfold pretty much as you'd expect - assuming you've ever seen a hardboiled crime thriller or two-fisted action movie before.Yes, action. This episode is much heavier on the Quick Time Event action scenes than any previous entry. A hefty chunk of the episode is just Bigby on his own, fighting and chasing rather than interacting. Since these stilted, shallow, button-mashing and thumbstick-aiming moments, chopped up by dozens of little loading pauses, have been the weakest parts of The Wolf Among Us, their dominance here can't help but make this climax feel clumsy, right in the cathartic moments when it needed to be graceful and slick.In narrative terms, the conclusion is much more solid, if somewhat predictable. You'll be confronting the characters you expected to confront and fighting the ones that have been established as likely boss-fight candidates over the previous four episodes. My enjoyment of the Crooked Man character was always slightly tainted by the fact that the route to his door wasn't something I'd worked out or even earned. He was simply dropped into the story at the end of chapter 3, and there was clearly no way that I wasn't going to find him in the end.The identity of the killer, a mystery which drove the earlier episodes, is tossed into the mix so casually it almost feels like a deliberate gag. You get the option of picking who you think did it, but equally you can opt to just be told. You'll probably guess correctly, but the fact that you would be guessing - since you've accumulated no clues or evidence - can't help but undermine the detective aspect of the series.If the finale hits some obvious beats, it also makes overdue use of the decisions you've been making. The underlying theme of the whole season has been the balance between justice and revenge and the struggle to apply the law fairly. In many ways, The Wolf Among Us trades in the same queasy ethical quandaries as Papers, Please: the knowledge that being fair in the wider sense often means doing things that feel unfair at an individual level.That theme finally flourishes in the final act, as you're forced to justify Bigby's actions over the series and convince the Fabletown community that the sometimes brutal protection the wolf offers is morally different to that peddled by The Crooked Man. It's a nuanced debate, and you'll find yourself regretting things you did earlier as you realise how those actions can be perceived. What felt like a cool, badass thing to do in the moment now looks like thuggish lawlessness.It's a very welcome development and one that almost ties the series together, even if it comes so late. The Walking Dead's urgent life-or-death milieu meant that actions and consequences came much closer together. Here, you've been banking decisions - good or bad - for the big finale. That's a completely valid approach, of course, but it's one that has left the season feeling lopsided.It's not that there's no pleasure in seeing the tale unfold - as a tale in its own right, The Wolf Among Us is very enjoyable. It's just that things fall into place with such clockwork precision that it's hard to feel ownership of Bigby's adventure, and that sense of ownership is critical in any game that presents the illusion of choice. Replaying the whole series again and making different choices shows that, yes, there are points that will tip the story toward slightly different outcomes, but also many more that only serve up scenes in a rearranged order, offer an alternative cut-scene or skip some sequences and go straight to others. The story always snaps back to its core path.Once you've tried a few different choices, you start to see how many scenes and conversations have been carefully - even ingeniously - crafted to be as narratively neutral as possible. The needs of the story constantly trump the agency of the player. That's not exactly a criticism, more an acceptance that all games of this nature must fall prey to the machinations that The Stanley Parable so cheekily exposed. All paths are predetermined, which is why it's so important for the characters and story to sell the interaction - to sell the fantasy that you're having a real and purposeful impact on this world.I only felt like that during the very final chapter of this very final episode of The Wolf Among Us, and frankly I'm still wrestling with how I feel about the series as a whole. I played Cry Wolf through to the end, then played the whole series through again, then started writing a review but had to stop because the tone felt too negative for an experience I had otherwise really enjoyed. There's something here that just didn't click for me, though. I can't shake the sense that while the core narrative of The Wolf Among Us is good, even occasionally great, it wasn't a story that was particularly well suited to a game.It's been fun, but I've not been on the edge of my seat like I was during The Walking Dead. The cliffhangers for each episode haven't left me emotionally torn, unsure if I even want to see what happens next. It feels unfair to compare The Wolf Among Us to The Walking Dead, but at same time, what else is there to use as a benchmark? Lee and Clementine's story was a revelation: a gut-churning series of horrible, impossible ~what would you do?~ moments that turned morals and emotions into gameplay mechanics. It thoroughly earned its Game of the Year accolades. This? Well, it's not that.What it is is a well written, enjoyable adventure that nevertheless feels slightly underwhelming once the credits roll. That can partly be explained by the long shadow cast by The Walking Dead, but it's also because, across its five episodes, The Wolf Among Us never really adapts the singular gameplay hooks of its predecessor to suit a very different kind of story with an entirely different style of lead character.As Telltale lines up more and more licensed episodic adventures to come - and is no doubt mulling a second season for Bigby and friends - it would be a shame if what was once a unique and thrilling approach to adventure games became a production line."}