{"ref": "https://www.eurogamer.net/transformers-rise-of-the-dark-spark-review", "date": "30 Jun 2014", "game_name": "Transformers: Rise of the Dark Spark", "text": "It's hardly one of the great mysteries of our age, but I'll never understand why Call of Duty is often explicitly called out for its bombastic Michael Bay tendencies, yet the official games of Michael Bay's Transformers movies are so tame in comparison, despite coming from the same publisher.Here's the latest in that series, and it's one that attempts to reconcile Activision's previous non-movie Transformers games - the well received War for Cybertron and Fall of Cybertron - with Bay's clattering movie franchise. The result is muddled and largely flavourless.The plot centres around the Dark Spark of that hilariously bad title. A sort of evil counterpart to the Allspark, the series' recurring MacGuffin, the Dark Spark actually doesn't rise at all. It just sits there and waits to be captured by the various robot factions racing to claim its power to control time.The opening levels see the movie versions of Optimus Prime and the Autobots tracking the Dark Spark down on Earth, but failing to stop it falling into the hands of the mercenary Lockdown. The bulk of the game is then an elongated flashback to Cybertron, switching between Autobot and Decepticon storylines as the old foes (in their video game forms) try to claim this powerful yet vague prize.They do this, of course, by shooting at each other. A lot. And, as a third-person shooter, Rise of the Dark Spark is categorically OK. Not bad. Decent. You won't pump your fist in excitement once during its campaign, but nor will you be troubled by any glaring technical or design cock-ups. The worst thing you can say about it is that it's so unapologetically devoid of ambition that hours of play slip by in a fugue state of bearable distraction.It's a game in which you'll blast your way down a few corridors to reach a mission marker, where you'll have to pull three levers or destroy four conduits to proceed. Then you'll repeat that process again and again and again. Sometimes you'll have to protect another character while they do something apparently important, or cover them from afar using a sniper rifle. There's a bit with a turret. There's always a bit with a turret. You've done everything in this game dozens of times before - and new developer Edge of Reality, inheriting the reins from High Moon Studios, isn't about to risk getting fancy with such a hand-me-down recipe.The gunplay is fine, if a little undercooked. Damage dished out and received feels a little weightless, but it's nothing you won't learn to accept. The game at least has an impressive arsenal of weapons, ranging from the expected machine gun, shotgun and rocket launcher equivalents to more exotic heavy firearms which spit out gobs of corrosive goo or electrified bolas. Upgrading these weapons involves Gear Boxes, the game's only truly interesting idea. These blind loot drops are earned by levelling up or by completing the game's many bonus challenges. Some challenges are level-specific, such as defeating a certain boss in a certain way; others are ongoing and can be earned over and over, such as defeating 100 enemies of a certain type or getting 75 kills with a specific weapon. Gear Boxes are ranked from bronze through to gold, with extra-special Prime level ones awarded for particularly notable milestones.You then open the Gear Box from the pause menu and see what you've got. As well as new weapons (duplicates of which become upgrade points), there are character unlocks for the game's online mode as well as Tech and Hacks. Tech are single use power-ups, giving you battlefield advantages or XP boosts. Hacks are gameplay modifiers which work the other way, making the game more difficult in various ways, but granting XP multipliers for your trouble.It's a fun system and more appealing than simple, linear unlocks. It's just let down by the tepid pulse of the game surrounding it. This is a game where pretty much any combination of weapons will get the job done and where enemies never require any deeper tactics than to simply point at them and shoot. For all its potential, you'll only ever dip into that engaging arsenal to keep yourself interested by trying new toys, not because the game demands you think about your choices.As such, Rise of the Dark Spark hits a modest peak somewhere around the halfway point of its 14-mission story. It's at this point that you'll have a decent spread of weapons and the levels almost become interesting, with a few open arenas where you can pretend to be using strategies rather than just mowing enemies down. Sadly, having built itself up to this minor plateau, at which point it resembles an adequate follow up to Fall of Cybertron, Rise of the Dark Spark then flatlines for the final few stages and reveals itself to be just another a grotty movie tie-in.It's here that you get to play as Grimlock, the T-Rex Dinobot that fans have been waiting for - and it's terrible. The game struggles to accommodate a character of this size, and what illusion of tactical depth the action had crumbles completely as you stomp around, breathe fire and unleash clumsy melee attacks that don't seem to connect with anything but make things fall apart anyway. The penultimate stage takes place on a cheap, fake-looking city map that I swear was lifted wholesale from 2009's Revenge of the Fallen game. Visually, Rise of the Dark Spark is a weird mish-mash of conflicting styles, and for all that it claims to unite the existing games with the movies, it offers no tangible reason for the crossover. Cybertron environments are drab browns and greys, looking for all the world like default 3D engine textures, and the handful of Earth locations hardly impress. The Transformers look like they did in the previous game while on Cybertron but, for no apparent reason, look like their baffling, jagged movie versions on Earth. You can unlock a couple of the original Generation 1 character models as well, just for the sake of fan-service.Perhaps the biggest missed opportunity in a game that already aims low is the way that the signature feature of Transformers - that they transform - is almost completely sidelined. You can, of course, turn into both wheeled and flying machines, but there's almost never any reason to do so. Some stages require you to fly to get to the next marker. Another starts with a long tunnel system which forces you to drive only because walking that distance would be teeth-grindingly boring. Tellingly, apart from a few familiar bosses, your enemies will rarely transform either. It's less ~Robots in Disguise~ and more ~Robots That Shoot Each Other But Can Also Turn Into Vehicles If You Want~.Away from the campaign, the solitary online mode - a wave-based survival game called Escalation - offers slightly more room to make full use of your weapons and abilities. The same unlocks and loadouts apply across single-player and this four-player co-op mode, but it's not enough to raise the overall pulse of the package. A limited selection of maps, all with broadly similar layouts, conspire to make it feel small and repetitive. The absence of a competitive multiplayer mode in a series that is famously built around two iconic warring factions is both strange and disappointing.But then, low-level disappointment hangs over Rise of the Dark Spark in a constant fog. It is, at best, a functional shooter that asks little of the player and offers the bare minimum in return. Though it pains me to say it, if there's to be another Transformers game to coincide with the inevitable fifth movie, a little of Michael Bay's bullish mayhem would go a long way in livening up this increasingly dull formula."}