{"ref": "https://www.eurogamer.net/valiant-hearts-the-great-war-review", "date": "24 Jun 2014", "game_name": "Valiant Hearts: The Great War", "text": "Before war photographers came war artists - dashing, romantic figures like Constantin Guys (his full name, irresistibly, seems to have been Ernest-Adolphe-Hyacinthe-Constantin Guys) who captured the murderous chaos of conflict in Crimea with a few deft swipes of the pen, and who brought the hidden realities of a distant war home to western audiences in a manner that people could at least hope to understand emotionally as well as intellectually.There is something of Guys and that mission to Valiant Hearts: The Great War, as well as something of the noble European tradition of taking comic-book art sufficiently seriously to rescue it from the people in tights and capes. Ubisoft Montpellier's puzzle-adventure tells the story of a handful of characters drawn into the muddy slaughter of the First World War by relying on the help of hand-drawn 2D sketches brought to shuddering, juddering life with the same UbiArt framework that powers the Rayman and Child of Light games. It's a visual delight, and the quick, occasionally hesitant lines of the pen-and-ink drawings work with the stocky, stoical cast to provide an emotional force that survives the bizarre tonal shifts of the narrative and some fairly undistinguished challenges.Valiant Hearts is not a great piece of design, then, but it is still a strange, memorable and often powerful game nonetheless - and one, I'm tempted to say, that only a publisher as dashing and romantic as Ubisoft would ever try to put together.Telling a simple story of friendship surviving the cruel responsibilities of conflict, play switches between three men and one woman (oh, and a dog), caught up in a war that has completely mangled their lives. Emile's an elderly French farmer, conscripted despite his age but eager to do his best. Karl, meanwhile, is a German neighbour who finds himself deported from France and enlisted by the enemy as soon as fighting breaks out. Elsewhere, Freddie is an American, far from home, seeking revenge on a German baron, and Anna is a student turned nurse, trying to rescue her father, a kidnapped scientist whose research is now being put to use in sinister ways. As the last two points suggest, a game that generally seems eager to tell a story from a modest soldier's-eye viewpoint sporadically suffers strange moments of action-cinema hysteria. One minute you're crawling through the mud of the trenches as your friends fall around you, the next you're avoiding the attacks of a sci-fi mega-tank in an on-rails driving section synchronised to Night on Bald Mountain - or defeating a boss riding a heavily armoured zeppelin by puffing him about with blasts and parps from a shattered pipe organ in Reims cathedral. There are a lot of grinding shifts in scope and plausibility to get your head around, and that's a bit of a letdown, really, as Valiant Hearts is consistently at its best when it's working on an intimate scale - when it's sending you down into gas-choked tunnels to rescue the trapped and the wounded, or framing an escape from a POW camp as a series of life-improving favours performed for other prisoners.The human warmth of that hand-drawn art works wonders in settling you after the most jarring transitions and in easing you from the dreamy bucolic pastels of rural France to the washed-out sepias and heavy inking of trenches and bombed cities. Foregrounds are full of arresting details, such as a clenched hand protruding from a pile of corpses, while backgrounds outline hulking war machinery rising into the sky above the smoke and debris. In the thick of it, machine-gun nests spray bright yellow fire over the pitted grey landscape of battle and comic-book techniques are made to pay their way throughout. Fetch-quests are explained wordlessly with images in speech bubbles and picture-in-picture panels cue you in to advancing enemy aircraft as you race between sandbags.In its eagerness to capture the whole sweep of the war, however - or at least to contain all of the war's traditional clichés - something has to give. With Valiant Hearts, it's the puzzling. None of it's bad, but most of it is pretty uninspiring. It's prescriptive and pedestrian and reliant on a handful of basic mechanics, some of which, with their installations of pulley systems and switching levers in the unlikeliest of locations, quietly undermine the world-building which has otherwise been so carefully handled.Expect breadth instead of depth, with challenges ranging from shell-dodging headlong action scenes and rudimentary stealth sequences at the better end of the spectrum (whether you're sneaking through enemy territory hiding behind flocks of sheep or working from one patch of cover to the next, timing your movements between machine-gun nest reloads, it's hard not to get swept up in it), to puzzles involving gear-fitting and block-pushing at the other. Valiant Hearts captures the war above and below ground, but whether you're in a collapsing farmhouse or a rickety tunnel beneath the Somme, you'll still find yourself faced with locked doors, broken machinery and pipework that needs to be rerouted.Puzzles revolving around throwing items around - breaking a tree bough with a well-aimed rock, say, or smashing a window to let out chlorine gas -  bring a little dynamism to the game, but otherwise you're often left in by-the-book adventure territory, working out the best order in which to turn cranks or testing various means of getting past yet another door that's been blocked by one of your superiors. These moments are where that dog often comes to the fore, shunted between hot-spots to distract guards, operate a hard-to-reach switch or dive through a tunnel and navigate a separate plane to the player's. I was initially worried that Ubisoft Montpellier felt it needed animals to provide emotional blackmail in a story that's already so heavy with human suffering. I shouldn't have fretted. Despite some evocative low-key animation and the ability to administer the occasional belly rub, this pooch is basically a power-up.A proper connection between mechanics and theme would have elevated things, but for the majority of the campaign Valiant Hearts' puzzles are merely pleasant busywork. At worst, the tasks the player is presented with feel like a contractual obligation - hoops a strange piece of storytelling has to leap through to position itself recognisably as a game and to pace out its narrative. There is sometimes a little more going on, though. Anna has her fair share of sneaking around and messing with pulleys, but she also engages in a basic rhythm-action game as she saws bones and patches up the sick. This abstraction seems to get to heart of Valiant Hearts: war is hell, and Ubisoft is more than aware that game design - that art - is rarely up to engaging with hell head on. Take a quick tour of the game's unlockable historical notes and you'll see why, of course. 70,000 were killed each month in the battle of Verdun, for example - and that battle would last 10 months. Few games, regardless of how artfully they're constructed, could make sense of that figure to an audience. Few books and documentaries have, either, and the same is pretty much true for all the wars and all the battles since. Constantin Guys was forever bound to fail, but in failing he still helped create modernism. And while Valiant Hearts struggles to make sense of itself as a game, in its odd, playful innocence and in its focus on four friends (and a dog) it at least offers a fleeting human perspective on a new kind of war that turned out to be far, far worse in its mechanised violence than anybody was quite expecting."}