{"ref": "https://www.eurogamer.net/pokemon-sword-and-shield-the-crown-tundra-review-thats-more-like-it", "date": "2 Nov 2020", "game_name": "Pokémon Sword and Shield", "text": "It's fair to say I didn't love the base versions of Pokémon Sword and Shield. They suffer on a few fronts, from a world that still seems empty and oddly shallow, a lack of the series' essential, trademark dungeons, or any sense of surprise or mystery. There are clear gaps in world and story alike, and having now lived with Dynamax Raids, the generation's staple feature and Sword and Shield's endgame crux, I can safely say they're an absolute drag. With a bit of distance, it's clear this generation needed more time.The Crown Tundra isn't a total panacea - really, it can't be - but it is an improvement, and in places quite a dramatic one. Taken in isolation, it makes for probably the best Pokémon experience in a couple of years. Put together with the rest of Sword and Shield, including the other expansion, Isle of Armor, it's also illustrative of how great they could have been. Like The Isle of Armor, The Crown Tundra expansion has you arrive, misty-eyed by train, at a new slice of the world, with some typically eccentric characters awaiting and a typically quirky, new species-driven main story to work through at your own discretion. Again, it takes place in a Wild Area-esque open world, meaning a free camera and free sense of exploration, and again the design of that open world takes some considerable steps of improvement upon the last. It's brilliant, really. Despite its openness, The Crown Tundra feels like the closest thing to classic Pokémon at its best. It feels like a world with mystery, where exploration leads to genuine discovery, where, crucially, you don't know exactly what something does the moment you lay eyes on it. Deep into one area you'll find a cooking pot, very much out of place by a tree. In another, a singular tombstone with a curious inscription. The land itself has genuine variety, ranging from sunny rivers and flowers to graveyards, caves, and half-frozen ocean. There are little nooks and side routes and curious dead ends. There are places where it's almost possible to almost get lost. And there are hills - actual hills! - that give a genuine sense of topography, reality and life to the land. It makes The Crown Tundra the first place in Gen 8 where it's truly possible to explore.A number of older Pokémon return, of course, with many some of the rarest in the series. The Regis are back, with some extremely lightweight puzzles to guard them - a shame compared to the infamous challenge of the originals, but still progress - while certain sub-legendaries are catchable in the wild for the first time. It hints, again, at what a proper, living Pokémon world might be like, Dragonite strolling the mountainsides, Moltres roaming the skies, Magikarp leaping from a lake.And again, in this sense, the Wild Area, the Isle of Armor and The Crown Tundra now look like clear, progressive, if excessively cautious steps towards a fully open world Pokémon game. The Crown Tundra is the only one that really works, beyond the initial novelty, but the future it hints at is genuinely exciting. Imagine it with trainers, imagine it with more quests, imagine it structured like the Pokémon metroidvanias of the Game Boy and DS, different paths opening up in old and previously cleared areas, as you catch certain Pokémon or beat certain gyms.Tantalising future potential aside, The Crown Tundra's other big achievement is a mode that reworks something Sword and Shield got wrong in the past. Dynamax Adventures - which on the surface do have that same air of thrifty kitbash to them that you can spot in so much of modern Game Freak's work - are actually quite ingenious. They're ingenious because, one, they bin the shields that Dynamax opponents usually have, which - and I'm not overstating this - are one of the worst things Pokémon games have introduced in my memory. Dynamax shields, if you'll indulge me on a brief detour here, require brute force to break, which means for almost the entirety of the game's interminable max raid battles, almost everything about Pokémon's traditional battle mechanics is moot. Status effects, held items, weather, abilities, stat changes and more are either blocked or have their impact severely diminished. All that matters is damage, like it did when you first started playing, aged seven. Even type matchups, the most basic, rock-paper-scissors mechanic at the heart of Pokémon itself, make little difference.In The Crown Tundra's Dynamax adventures, though: no shields! And on top of that, a hugely clever system of rental Pokémon, items, stick-or-twist decisions and counter-play. There's more than a whiff of Shigeki Morimoto about the whole thing - the man who designed Pokémon's core battle systems, and who I can personally attest to being a veritable genius at using them. The list of available rental Pokémon is extremely well curated, as are their movesets, their abilities, those of your opponents and the available items you might get along the way. Balanced to perfection, with just the perfect dash of chance, it results in the precise opposite of standard Dynamax raids, forcing you to use every bit of knowledge you have about how the game works. It's the Holy Grail of combat designers: making the unviable viable, without spoiling the fun.Because of this, suddenly all the systemic depth of Pokémon - and I mean systemic in the technical sense, systemic like Dishonored, like Divinity, like System Shock - comes to the fore. I have infinite anecdotes of weird quirks where you think you're about to win it, only for one ally's seemingly innocuous ability to block another's would-be finishing move, catching the damage like a lighting rod - whoops! Or where an off-meta, single-use item you chose saves you right at the death; when you beat a resplendent, imperious Zygarde with a mangled Gloom and a team made up of wonky AI. There are still caveats - such is the complexity of Pokémon that you can praise a single system forever and then spend another lifetime picking that same thing apart. For one, on the multiplayer front Game Freak is still years behind the mark. There's no way of communicating with allies before, during or after battles, which means for all the encouragement of teaming up and playing off one another, you can't coordinate a thing (I've just as many anecdotes of plans going awry because of this - two human players infinitely setting conflicting types of terrain for one another, for example). Even a simple 'intention' system, like pings or indicators, would go a long way. And raids, even the Dynamax adventure ones without the shields, still take forever. An adventure with human teammates takes upwards of 25 minutes on average, with too many decisions to be made and inexplicably long time limits for them to be made in, while one with AI takes about 10, meaning it's faster to fail and retry with AI than it is to just do it once with people, defeating much of the object. And it's too awkward, without a Discord server, some duct tape, a cheeky datamine, and a general sense of 'make it work', to easily hunt high-value raids and play together with larger communities or groups of friends.But, for the first time this generation, those quibbles are outweighed by what The Crown Tundra gets right. It's a promise of how brilliant an open world Pokémon game could be in the future, yes - if it married the novelty of its openness with the traditionally puzzling, mysterious nature Pokémon worlds gone by. But it's also a reminder, in the Dynamax adventures especially, of just how good this game already is - an excuse to fall back in love."}