{"ref": "https://www.eurogamer.net/grid-autosport-review", "date": "24 Jun 2014", "game_name": "Grid Autosport", "text": "Who knew a camera angle could cause so much consternation? When Grid 2 was first unveiled, the noise wasn't about Codemasters' bold decision to do away with driving assists, its introduction of point-to-point road races or its globe-trotting storyline; the focus, instead, was placed fierily on the lack of an in-car cockpit view.That single omission tells you much of what you need to know about Grid 2, a game that never quite added as much as it took away, and one that left the long-standing Codemasters fans who had been waiting some five years for a sequel to the 2008 original feeling alienated. The cockpit camera is back for Grid Autosport, a quick-fire follow-up Grid 2, and its return tells you pretty much everything you need to know about where this new instalment is coming from.When Grid Autosport was first revealed earlier this year it was somewhat cruelly dubbed Grid 2: We're Sorry Edition, and while I regret the snark there's perhaps no better way to describe the game's philosophy this time out. It's a comprehensive riposte to many of the slights felt by Codemasters' community and a return to the roots of what most agree is the studio's strongest suit. Grid Autosport places a hard and very much welcome emphasis on the racing.The generous selection of tracks - there are around 100 routes winding through some 22 locations, taking in everything from the autumnal sweep of Quebec's Mont Tremblant to the rollercoaster challenge of Bathurst's Mount Panorama - and of cars, where everything from a Lancia Delta Integrale to an A1 GP Lola is fair game, suggests a racing experience as comprehensive in scope as anything since the days of the latter TOCA Racer Driver games. Grid Autosport certainly doesn't skimp when it comes to delivering traditional motorsport thrills. Crowded fields of tin-tops hustle each other around Brands Hatch's slim ribbon of tarmac; Formula 3 cars hunt each other down around the dusty blind approaches of Jarama; and under an apocalyptic setting sun, GT cars pound around Malaysia's Sepang circuit in an endurance event. They're all tied together by a handling model that's a significant improvement on Grid 2's awkward dynamics and that's more in tune with the requirements of track racing. Metronomically nailing braking points, turn-in points and apexes is once again a concern, and even if this isn't a sim - nor has it any pretensions of being one, refreshingly - it certainly provides a satisfying analogue of what it's like to hurl a racing car around a racing track. Front-wheel-drive touring cars come complete with understeer that can be throttled away, while downforce plants single-seaters to the tarmac. It's only when the cars are pushed beyond their limits and the invisible assists set in that Grid Autosport smothers the player a little too much.Like last year's Grid 2, a series of mods and upgrades lends persistence to the multiplayer, as does the wear and tear gathered by your own garage of cars. It's a comprehensive suite, tied together by Codemasters' own RaceNet and the welcome inclusion of split-screen multiplayer. But for all the bells and whistles it offers, it's likely that Grid Autosport's chaotic destruction derby will be where most of the online action takes place.When it comes to the racing, though, there's no holding back. Despite the excess of driving games in recent years, too few have taken the time to capture the actual business of bumper-to-bumper competition. Grid Autosport champions the cause. This is a game where competition is felt throughout the pack, where a tenth place is just as hotly contested as a podium, and where there's a sense of bustling life throughout, the AI drivers defending their lines aggressively but with courtesy. This element of competition is explored comprehensively throughout Grid Autosport's various disciplines. Open-wheel races demand some decorum, and are the most traditional of the bunch, while tin-top events now come in pairs, with the second race flipping the results of the first for a lively reverse grid. Tuner cars are explored in time trials and drifts, street cars stretch and scrape themselves through dense city circuits and, in endurance events, you have a single degrading set of tyres at your disposal to see you through to the race's end. So there's plenty to do within Grid Autosport, and plenty of it is geared towards the petrolheads who've been left behind by the change in direction at Codemasters in recent years. But while this is a return to what Codemasters does best, it still feels compromised - and as a sequel to the original Grid, it fails to deliver on a number of fronts. Remember the Le Mans endurance race that served as the climax to every season in the original, the sun setting and rising over a condensed 12-minute run-through of the French classic? Grid Autosport has nothing to compare, and too much of it feels like last year's game hastily repurposed. Absent, too, is the way the original Grid injected your career with a sense of purpose by allowing you to marshal an entire team, hiring a team-mate, recruiting sponsors and designing your own livery. Grid Autosport's long, drawn-out career is a thin mirror in which you're a gun for hire, slowly unlocking new teams with locked-in objectives and locked-in teammates who can be lightly ordered around. Without a compelling thread to pull you through, the racing - as accomplished as it is - soon becomes tiresome.The cockpit camera, as welcome an inclusion as it is, ultimately gives the game away. The two available angles are functional, blurring out the player's hands and the dashboard's non-working dials in a solution inspired by the work of modders on Grid 2. Like so much in Grid Autosport, it's clearly a compromise, a quick fix to tide Codemasters over until its next big thing arrives. Grid Autosport is a fine racing game, though it's never a thoroughbred one. It's the muscle car that was Grid 2 stripped out and retooled for the track, but too often you can see the solder-work at the seams. In 2008, Race Driver: Grid was a partial reinvention of the racing genre, equipped with a handful of fresh ideas. Six years on, Grid Autosport - while a definite return to form for Codemasters - is simply a rediscovery of it."}