{"ref": "https://www.eurogamer.net/panzer-tactics-hd-review", "date": "16 Jun 2014", "game_name": "Panzer Tactics HD", "text": "20 years ago, in a time before Windows had a Start Menu and when USB connectors were still a twinkle in some hardware designer's eye, PC gamers were introduced to a strategy title that would soon be regarded as one of the finest in its field and which would only grow in stature with the passage of time. Oft imitated, rarely equalled, its quality was further emphasised by the often sub-par attempts by others to copy its mechanics and its concepts, even ape its presentation outright.If it weren't for the name splashed across the top of this page, you might think I was referring to the original X-COM, a game that inspired several remakes and reinterpretations of varying quality before Firaxis finally released a de-hyphenated and critically acclaimed remake in 2012. Several development teams had tried to capture the magic of the original, but the more they tried, the more impressive they made MicroProse's work look.Instead, I'm talking about Panzer General, widely considered to be the classic wargame of tanks, tactics and tessellated hexes. After its warm reception, creators SSI spent several years producing a lengthy series of sequels and spin-offs that ranged from the logical (Allied General, Panzer General 2) to the unusual (the sci-fi Star General, or the dragon-commanding Fantasy General). Then came the games that were clearly profoundly inspired by it, such as Slitherine's Panzer Corps, as well as attempts to modernise the ageing original,  including Open Panzer, PG Forever and LGeneral. Panzer Tactics DS, released in 2007, was an example of the former, clearly taking much from Panzer General but presenting it to a new audience: Nintendo DS owners.So Panzer Tactics HD is actually a remake of a reinterpretation. It's a PC and iPad version of a DS game inspired by a DOS game. From the first days of the Clinton era. It is, I'm afraid, also a little stuck in the past and it does, I concede, only make Panzer General look even classier in its venerable old age.It has that same 20-year-old premise: all military units have a strength between one and 10 and each of them is particularly effective on a certain sort of terrain or against another type of unit. Infantry are comfortable in the cover of towns or forests, while tanks are dangerous in open ground. Fighter squadrons slice through bombers as if they were airborne dairy, but those bombers devastate the static artillery pieces that are giving your infantry hell. And so on. It's a very well devised and well defined series of relationships, so everyone knows where they stand. (Or where they fall.)It also has many of the same additional considerations, such as limits on ammunition and fuel for each unit, as well as the opportunity for units pulled away from the front lines to reinforce themselves back to full strength. Line of sight is particularly important and recon units that can peek many hexes ahead are vital tools that help you plan your avenues of advance.And there's a lot of advancing to do. Panzer Tactics HD has you following similar campaigns to many of Panzer General's peers, Blitzkrieging your way across Europe with Nazi party-poopers determined to invade everything in sight, pushing your way into Berlin to paint the town red with the Soviets, or chasing the Axis forces out of their conquests with the rest of the Allied forces. The campaigns are mostly offensive efforts and you're always facing a time limit as you move to capture or hold key objectives. Here, war is all about grasping at things.For a while this is quite good fun, as perfecting your Blitzkrieg involves carefully co-ordinating all the different forces at your command. You make sure you've weakened anti-aircraft defences before your bombers soften up enemy troops, then send your own forward while seeing if there's some way to sneak around the flanks. The best generals are the most efficient, only resting and resupplying units when they can afford to put them aside, and they behave with militaristic midwifery, always urging their troops to push, push, push onward toward the next objective. Nevertheless, over-extension means death, and it's important to maintain a cohesive, coherent front.There are a few extra tactical tricks at your disposal. Paratroopers can be dropped straight into the fray while many units can be loaded into trucks or planes to rapidly shift them from one part of the map to another, making them fast but very vulnerable. Officers can be recruited to provide stat bonuses and warships, when available, are worth their weight in steel, providing powerful and punishing offshore bombardments.Administering such punishment is all well and good, but it can start to feel like bullying, because Panzer Tactics HD isn't always the brightest opponent and, even on the later and increasingly challenging campaigns, it isn't as aggressive as it should be. It doesn't chase down units it could finish off and, partly because it's so often the defender, it doesn't show much initiative in sallying forth. In one scenario, halfway through the German campaign, I had to capture and hold a town against British counterattacks. None ever came and my opponent simply sipped on his tea in the town nearby until my tanks came through the front door.That scenario, incidentally, concluded with me wiping out every enemy unit on the map but still having to click the ~next turn~ button until the victory conditions were satisfied - the sort of strange and minor inconvenience that sometimes crops up. Panzer Tactics HD has a slightly fiddly interface that makes things like checking up on your forces or deploying units at the start of battle less convenient that it should be. It would benefit from a menu tweak here, a little redesign there. Sometimes it does feel like a dated, pre-Windows affair.The scenarios get harder as the game gradually increases the number and effectiveness of the opponents you face, as was the case in some of SSI's old General games. The game doesn't get smarter, only meaner as it gives you fewer units, tougher objectives, or limited avenues of approach. The veterancy of your own increasingly precious troops, which grows with time, becomes much more important, as does your ability to cycle units in and out of combat quickly and to spread the damage you deal as effectively as possible. At times, Panzer Tactics HD becomes almost a puzzle, demanding you consider how much damage each unit might inflict if you moved it just here to fire at this, making space for another unit to slide in there to fire at those guys.It's a challenge, for sure, but it can become an increasingly frustrating one at times and also a bit of a slog as you realise your job isn't to be a general who outwits their enemies with clever plays, but one who  outlasts them with bloody-minded stubbornness.Musicians out there will be familiar with the concept of the standard: a genre piece that you return to again and again because it's a crowd-pleaser. They're requested, performed and reinterpreted many times as the years go by, so you learn your standards, you recognise them and you enjoy seeing how other musicians interpret them. There's nothing wrong with belting out a well-loved standard and it's always possible to put a new spin on an old tune.Panzer Tactics HD is a decent reinterpretation of a game that was devised two decades ago, but it doesn't add much to it. While it's a fine tribute to Panzer General's mechanics, it actually ends up feeling a little dumber and more obtuse than the venerable vintage it pays respect to. It sings its tune well and it will entertain fans of the original but, unlike the generals whose battles it represents, it fails to either innovate or inspire."}