{"ref": "https://www.eurogamer.net/maia-early-access-review", "date": "23 May 2014", "game_name": "Reviews", "text": "Maia is probably going to be brilliant. This extra-terrestrial colony simulator merges Dungeon Keeper-style base management with AI systems so granular you could sweeten your tea with them, and is infused with darkly comic writing that encapsulates the creeping insanity of a close-knit community isolated on the absolute fringes of human existence. You can clearly see where it's headed, and you can predict its trajectory for getting there. But it isn't there yet. At the moment Maia is going through something of an adolescent phase. It's got enormous potential, but it's infuriating to spend any time in its company.Maia's colony simulation works thus: starting with a basic subterranean layout, you order a cute little robot to excavate holes in the surrounding earth. Into those spaces you place prefab rooms of varying types, which you then populate with blueprints for objects. Many of these are specific to the area they are placed in, whether they're in a workshop or a research laboratory, within the confines of your colony or outside in Maia's harsh and unpredictable environment. All of them share one characteristic though: they must be constructed by the colonists themselves.The objective is to nudge the colonists into making the colony self-sustaining, and also capable of performing scientific research that will lead to technological breakthroughs that will aid you in the long run. This secondary part of the game is not really present in the current build, although the most recent update, bringing Maia to version 0.42, adds buildable weather stations and seismic monitors which will eventually feed back into your research projects. It also adds toilets, which as far as I know don't feed back into your research projects.For the moment, your main concern is keeping the colonists alive. This isn't easy because the colonists have a substantial list of requirements for not dying. Atmosphere generators are required to pump out breathable air, but these run on electricity, which means building wind turbines, solar panels or a nuclear reactor, all of which come with their own problems. Solar arrays only work during the daytime, while wind turbines are fairly fragile. As for nuclear reactors, the clues are in the words ~nuclear~ and ~reactor~. Meanwhile, food is grown either in the hydroponics lab or the animal containment shelter - the latter of which produces a number of chickens that can only be described as explosive. Water must be condensed in solar stills, while beds, couches and lights are all required to prevent your colonists from collapsing through fatigue or going quietly insane in the dark.Although you can direct your colonists in terms of what to build and where, all these processes must be put together by the colonist AI, and this is where Maia starts to get both interesting and problematic in its current form. The combination of Maia's detailed and experimental AI systems, and the fact the game is still very much in development, means things frequently don't work the way they should, and in some cases don't work at all. As a player it can often be difficult to diagnose what the problem is or even if there's a problem in the first place.Here's an example. In one game I'd got electricity working in the colony through a large wind farm, but the colonists were refusing to build anything else, instead spending all of their time wandering outside in their atmosphere suits.  At first I thought the game had bugged out, but I eventually realised that Maia's powerful winds meant the turbines were constantly breaking down, and the colonists were stuck in an endless cycle of repairing them. I ordered them to dismantle all but one of the turbines, and this gave the colony enough electricity to function on a basic level, while freeing up most of the colonists to do other jobs.In this instance, the problem was my stupid idea to build a thousand wind turbines, but other times the issue is due to AI quirks and it can be difficult to spot the difference without careful investigation. This is especially the case when it comes to prioritising and delegating tasks. The colonists seem to prefer being outside to indoors, and they also struggle to assign tasks to specific individuals. The result of this is that the moment you request an outdoor object be constructed, they all rush out of the airlock in a big space-conga before one colonist is selected to do the job and the others eventually turn back.Somewhere between your colonists' brains and your own are bugs that occasionally explode everything. At the moment, there frequently comes a point in a game at which your colonists outright give up building stuff. They love building doors. Ask a colonist to build a door and you'd think you'd handed her a cake and a party hat. Workbenches, research stations, and most outdoor objects are also reliably constructed. Anything else is a gamble, with objects like work-lights, medical equipment and reactors often being completely ignored.The fact that I often found myself at loggerheads with the AI colonists rather than in harmony with them also highlights other problems. I don't think Maia explains its systems explicitly enough. It's very difficult to interpret the moods of your colonists, and also to keep track of what they're doing and why they are doing it. Mouse over  a colonist and you'll be told all about the wave functions of their brain, but not whether they're hungry, sick, angry, sad, happy or any of the other dwarves.Considering the setting and the fiction, this kind of information would be constantly monitored and the information immediately available, so it makes sense to communicate it to the player in a more straightforward manner. Otherwise, all too often you're left scratching your head. In one instance I happened upon a colonist who had apparently dropped dead while heading to the storage room, and I still have no idea what happened. I suspect she was killed during an earthquake, but without directly witnessing her demise there is no way for me to be sure.Disclaimer: Eurogamer contributor Paul Dean also works on Maia as a contributor. We chose a reviewer with no personal ties to Dean.Combined, these issues overshadow a lot of the good stuff in Maia, like how the art and sound beautifully capture that retro sci-fi feel, and the sometimes witty, sometimes insidious procedural messages you receive from the colonists during the course of the game. There are also a couple of interesting extra features in the latest build, such as a whole new way to die courtesy of the game's first alien creature, which is best described as a cross between a honey badger and a city bus and is certainly as lethal as both put together. Fortunately, you can also call in additional colonists to be brutally mauled through the construction of a microwave communications tower, which lets you request reinforcements provided your base is fit to accommodate them.These features are welcome, but they don't make it feel like an enjoyable game. The AI systems are still too raw and inconsistent, the base construction still too limited, and the feedback loops you'll get through researching new technologies haven't been implemented. It doesn't even have a reliable save system yet - quicksaving and quickloading cause intermittent crashes and confusion within the AI.Maia is probably going to be brilliant. Yet unless you want to be an active part of the development process, it isn't ready to be played right now. It needs another six months or so to tighten the AI screws and to receive sufficient content and depth that you still feel compelled to play once you've built all the rooms. I am confident that Maia will eventually produce thriving and colourful space colonies, and look forward to returning then to salute them, but currently it represents more of a subsistence lifestyle.Eurogamer's alpha and beta reviews are reviews of games that are still in development but are already being offered for sale or funded by micro-transactions. They offer a preliminary verdict but have no score attached. For more information, read our editor's blog."}