{"ref": "https://www.eurogamer.net/tropico-5-review", "date": "22 May 2014", "game_name": "Tropico 5", "text": "The Tropico series has long endeavoured to inject a dose of humour, a splash of colour and a foot-tapping calypso beat into a genre that can sometimes appear stuffy and staid. As such, this fifth instalment's cheeky sideswipes at egomaniacal dictators still raise a smile and its familiar sun-drenched Caribbean setting remains enticing to those looking to juggle city-building and politicking.Responding to criticism that Tropico 4 was too similar to its predecessor, Haemimont Games and Kalypso Media have broadened the Tropico formula through the introduction of a long-overdue multiplayer mode and by tying certain milestones and challenges to advancement through four distinct eras. But while a number of the associated additions enhance the feeling of progression, others require a degree of trial and error that, combined with some of the series' inherent limitations, may frustrate even the most laidback of crackpot despots.At its heart, Tropico 5 stays true to its roots, as you take an idyllic island hideaway and - through canny trades, shady deals and progressive modernisation - turn it into a major player on the world stage. A fittingly offbeat story that takes in conspiracy, betrayal, nuclear escalation and flux capacitors starts with the planting of a few humble banana trees and the rearing of some cattle. This cultivation of raw materials is key to everything that takes place in Tropico 5, as base resources are exported to improve cash flow and curry favour with the powers that be and, later, used in the creation of more complex and valuable trade goods.As before, farming and mining resources provides early employment for your growing population, but little of what you produce is kept for yourself or helps facilitate new buildings or open up new options on the limited tech tree. Instead, the produce and materials are primarily used to make the graphs go up and hit the next milestone in the current mission criteria, which vary by era.Eras are Tropico's way of introducing a degree of measured progress and formal pacing that was missing from previous games. Each era has its own challenges and rewards that add mini-arcs within the broader campaign, as well as providing more structure to its sandbox mode. Initially, this means balancing the demands of the Crown with the internal push to declare independence. As your decreed mandate to rule ticks down from several years to a matter of months, the king's emissary will pop up to offer chances to increase it or earn much-needed injections of cash through commissioned export deals or by encouraging you to build certain buildings.At the same time, you must work to meet the demands of the revolutionaries by becoming self-sustaining, and so begins a balancing act that sees you running the gauntlet of insulting the king one month and placating him the next; should your mandate to rule expire before you've garnered enough support from the revolutionaries, you'll be forced to start over. Such double-dealing has a knock-on effect in your own dictatorship, too, as citizens respond based on their inherent beliefs, occasionally downing tools or even rebelling in protest against your actions. Assigning new dynasty members to rule from El Presidente's esteemed lineage can offer pertinent bonuses in times of need, but long-term management remains key.  In later eras, the royalists and revolutionaries of the colonial era are replaced by the communists and capitalists, and the environmentalists and industrialists. You can play the benevolent dictator and try to keep all of them happy by adopting policies, issuing edicts and building things that appeal to each faction, or you can seek to win over the majority who will keep you in power and thus risk breeding civil unrest in a growing minority movement.It sounds fraught with tension, but it's actually all too easy to allow it to fade into the background as you slavishly respond to the intermittent ping that heralds a new primary objective and are subsequently led by the nose from one goal to another. Similarly, the manner in which the campaign flits between islands can undermine your longer-term plans for the sake of forcing variety on you. However, fail to appease powers both foreign and domestic in the short term and you'll eventually find that an invading force or Tropican uprising comes to teach you the error of your ways. And you don't want that to happen, partly because no dictator wants to be shown to be unpopular, but mostly because combat is the game's weakest element.Despite improvements at a higher strategic level, there are still too many instances where individual units rush off to confront several groups of rebels, pirates or invading troops without a thought for their own safety or a moment's pause to allow allied units to catch them and provide backup. It's evident Haemimont doesn't want to stymie the Tropico series with full-on RTS combat, but it would be nice if you could meaningfully act to prevent impending mass slaughter, or if they showed a little less in the way of fanatical zeal and a little more in the way of self-preservation.Fortunately, combat rarely lasts too long and once it's over and individual citizens have revealed themselves to be rebel troublemakers you can find more subtle and interesting ways of dealing with them, such as having them discredited or assassinated. While it's taking place, though, the AI contrives to reveal the brutalities of armed conflict in unintentionally terrifying ways.On the subject of AI, builders still have a maddeningly haphazard approach to going about their business, usually revealed when you order several building projects to begin in quick succession. It's sometimes necessary to pay cash to quick-build projects because there isn't enough detail on why workers are refusing to do their job. This is likely to be the most frustrating part of Tropico 5 for newcomers, because while the tutorial covers the basic aspects well enough, it only scratches the surface; there are some interesting systems at play that require you to either have prior knowledge of their workings or be willing to search out answers on a wiki or forum.On a more positive note, the associated increase in options and the manner in which era-specific challenges, bonuses and buildings are revealed does make sandbox mode more viable as a long-term gameplay choice. Multiplayer, too, works well for its first appearance in the series and there's the option for up to four players to partake in all-out versus, team versus or harmonious co-op.The partial fog of war - in which you can see the features of the whole map but can't build on it without first sending troops out to explore - means you can rush out early to nab vital resources, which can lead to basic trade agreements and the exchange of materials, cash and workers. This can take on additional tactical significance if you're playing in peaceful mode and are therefore unable to send your feckless troops to lay siege to your opponents.Tropico 5 features a number of improvements to its long-standing formula and there's a lot here to like. The humour and in-fighting of your aides provides a lighter tone missing from other management sims, and there's a degree of satisfaction to be found progressing through the distinct eras. It also looks more vibrant than any previous entry. It works well for now, then, but Tropico 5 is clearly more concerned with introducing new concepts atop the old than it is with overhauling its base mechanics. Looking ahead to the future, this long-running series would benefit from having the fires of revolution lit beneath it."}