{"ref": "https://www.eurogamer.net/simcity-review", "date": "22 May 2014", "game_name": "SimCity (2013)", "text": "From the air, Jefferson is glorious. It's a carefully sculpted city, the lines of which I scored into the landscape many hours ago and from which a relief has sprung more spectacular than anything I could have imagined. Downtown stands tall, great sentinels of concrete and steel that stare out over the huddled, homely neighbourhoods towards the edge of town. One by one, their lights wink out and, with the setting of the sun, workers become residents, making their way to redbrick apartments, two story townhouses, or the static homes sat amongst the trees at the city limits. A park fills with children, the air with their laughter, and those skyscrapers become sundials as afternoon shadows creep from block to block. But look a little closer and you find much that is wrong.On the ground, Jefferson is a mess. Crowds protest outside City Hall, complaining first about crime and later about a lack of clean water. The main road out of Jefferson haemorrhages traffic. The downtown clinic can't find the space to treat the sick. At first glance, it might appear that Jefferson has its struggles, but these issues require a little more investigation. We have to look deeper into the problems that plague its public.There is almost no crime to complain about. The police precincts are packed with patrol cars, supplemented by advanced dispatch services and community outreach. While the clinic is oversubscribed, the hospital nearby has fifty beds free and almost never treats anyone. According to a utilities advisor, Jefferson has a substantial surplus of water and the option to import more from its neighbour, yet hundreds of buildings that are connected to the main report dry taps. The water table never refreshes because there is almost never any rain.A trip about town reveals roads overlapped by jagged ground textures and sometimes even buildings. A house sits in the middle of one street while another is buried under a strange pile of earth. A car is half-parked in a hill. One wing of the grade school is a strange and misshapen pile of grey rubble. That school, incidentally, is closed, because since the opening of Jefferson's university there's been no need to keep any of the antecedent educational establishments. Nobody needs to go to school in the city that doesn't make sense.15 hours previously, I was sometimes having a great time with SimCity, Maxis' troubled revival of its famous city-building series. It was morning in America and I was starting to build the consumerist dream. Before you notice the many graphical errors, and often in spite of them, the presentation is spectacular; the game's Glassbox engine impresses with its incredible variety and attention to detail. The music sings to you. The elegant, well designed interface throws open its arms and takes you in a gentle embrace from which you might only emerge after many hours, bleary-eyed and blinking in confusion at the clock on your wall. SimCity is easy to play, it's gripping, it's thick with possibility and its flaws are not the sort of thing you're likely to notice during this heady honeymoon.I say I was sometimes having a great time because fighting my way past the draconian always-online requirement was like trying to gain access to an isolationist state - with me stood there waving my papers at a blank-faced border guard who alternately beamed in approval or refused to acknowledge me. Access to the main menu was no guarantee of play, with a plethora of errors claiming servers were full, offline, or not responding. Sometimes I was welcomed with another chance to play the plodding tutorial, other times I was teased with the possibility that my cities had been lost forever. During play, a tab would repeatedly pop down telling me that a connection to some server somewhere was lost. As far as I could tell, this made no difference to my playing experience at any point. At first, I was still rapt; later, I was peeling back the veneer to frown at the cracks.Thanks to poor performance of the game servers since launch, much has been made of SimCity's always-online requirement, labelled by some as an implementation of DRM (digital rights management, in other words an anti-piracy measure). Developer Maxis says it's a vital for additional computation and, outside of the sandbox mode, for region management. As far as I can tell, it brings nothing new to the game except for the opportunity for me to ~roll back~ one of my cities which had ~not been processing properly~ - though at the time of writing this button appeared to do nothing and I was locked out of that city. Otherwise, the possibilities presented by multiplayer interactions - such as resource trades, utility shares and leaderboards - are asynchronous and they certainly don't require constant player interaction.SimCity designs everything around roads. These are the arteries of your towns, the velcro to which your buildings hook and the infrastructure through which water and power is provided. Now, almost nothing exists separate to your roads and so they are the first things you place, the last that you tear up and their creation is aided by a host of drawing tools: make them curved; make them straight; make them freeform; make them snap to a grid.You widen these arteries as they become congested with the bulk of an unhealthy city or, when things become too busy, you construct emergency bypasses or tear them out altogether and replace them with wider avenues. They determine the reach of your services and the density of the buildings that grow next to them. A bigger road means larger flats, taller skyscrapers, fatter factories. As it should be, layout is paramount to city planning.Meanwhile, almost every other type of building exists as some sort of needle on a much larger tech tree. Rudimentary services are available straight away, from water towers to rubbish dumps, but better facilities must be unlocked by certain criteria such as research projects performed at the university or extensions bolted on to City Hall. Each of these is tied together intelligently and it makes playing SimCity more than just an exercise in free-form building. Instead, it's a constant march towards the next objective, with a host of challenges granted by your residents tossed in to boot. These can be as simple as treating a set number of patients at a clinic or cleaning up a particular amount of garbage within a time limit, but they can also ease you toward a building or an upgrade your city craves.At first, your time is swallowed because there is always something new to do next. But when you decide to spread out and use the game's new region view to create another city next door, a whole different set of challenges arises. You inherit all the problems and perks of your neighbour, with local criminals dropping by or commuters leaving your new creation to find better jobs in the old one. Shaping a new town can be a profoundly different experience and it's wonderfully satisfying to think you're getting things right - perhaps by an act as simple as the placement of a new park, greeted as it is by an explosion of emoticons from every rooftop in the neighbourhood.While all this is very compelling to a new player, even the freshest mayor will see that Maxis has made a few rather strange decisions. There's no undo function, no chance to reload a saved game, and so mislaying any structure proves a punishing and permanent mistake - particularly if you later need to add a building extension that you can't make space for. There's also no way to reshape terrain and much of it is profoundly flat. It's auto-levelled when buildings or roads are laid down, but it's a little too bizarre to watch it reform itself exactly as it was when you delete these things.The fixed terrain and the sprawl of the modular buildings (a university campus can be huge) both serve to reinforce how much smaller the playing area is in comparison to previous SimCity games. Much has been made of this, but really there's little to be said. Yes, it's smaller, and you'll come up against its limits quicker than you'd like. You'll build tinier towns.The rage players have expressed over the always-online requirement, important as it is, fogs the far more serious fact that many of the systems that underlie the game are brokenRegardless, changes such as smaller playing areas, the removal of terrain modification, even the always-online requirement are all deliberate decisions and quite distinct from SimCity's real problem: the disconnected mechanics creaking away below the surface.It was when I tried to set up intercity trades that I spotted my first bugs. I asked one city to send money to another, but that money never arrived, it simply vanished from my game. I'm supposed to be able to share services too, importing and exporting power, or making things like police vehicles or garbage trucks available to the region. The garbage trucks come but the water I pay for never does. Sometimes the trading options and overlays simply aren't displayed and the usually helpful interface refuses to co-operate.The rage players have expressed over the always-online requirement, important as it is, fogs the far more serious fact that many of the systems that underlie the game are broken and it exhibits a host of bizarre behaviours. Weird things happen out on the streets of SimCity, all day and every day. As a blaze takes hold in a downtown restaurant I watch as a fire truck is dispatched. It begins driving off in the wrong direction before performing a few loops up and down the same street, circling as if warming itself up. Nearby, buses bought to alleviate traffic congestion can also be spotted driving up and down the same strip of road over and over again. Their 40 passengers have never been known to disembark and I wonder if all on board have long since perished, leaving the ghostly carriage to haunt the streets forever. In one of my towns, the main road is forever clogged behind a parked car that refuses to move and which is thus blocking all the city's critical services.I can handle the graphical bugs - those overlapping buildings, the misshaped roads, the fire fighters who have chosen to stand on the station roof and spend their time endlessly vibrating. What I can't handle is the knowledge that things aren't working properly, that whatever success I've made is a sham, the result of misshapen game mechanics producing outcomes that are frequently contradictory or even nonsense. The population numbers make no sense and sometimes fall or rocket for no apparent reason; I'm not really sure where it is my money comes from; I never need to touch my tax rate.There was a time, perhaps eight or nine hours in, when I wondered why SimCity was so easy. Nobody ever complained about the air pollution, while using my depot to sell my recycling netted me endless profits. I kept playing because, back then, I kept having fun, I kept trying new things and I kept convincing myself that I was a good Mayor. Now I know that it was never really down to me - because in the city of Jefferson, as in all the cities in the game, only madness rules."}