{"ref": "https://www.eurogamer.net/ghostrunner-review-an-exhilarating-display-of-acrobatic-first-person-platforming", "date": "29 Oct 2020", "game_name": "Ghostrunner", "text": "Ghostrunner is a game about the joy of movement, and I love how it never loses sight of that. You're a cyborg ninja and your weapons are speed and agility; everything you do, and everything the game throws at you, revolves around it. There are many enemies and boss encounters and special abilities, but they all centre on the fundamental idea of momentum.It's a relief. I worried Ghostrunner would do a Mirror's Edge and get bogged down in combat, but it doesn't. Polish developer One More Level understood why the Ghostrunner demo worked earlier this year, and stuck with it. Do one thing and do it well. Ghostrunner is a game about acrobatic routines, about devising them and performing them. It's what everything boils down to. You're an incredibly agile character who can wall-run, slide around, swing around, dash around and even slow time. But you're also an incredibly fragile character who will die in one blow from anything. The challenge of Ghostrunner, therefore, is a kind of elegance: not getting hit while simultaneously getting close enough to hit and slice apart others. Repetition is key. Ghostrunner is a game of trial and error. Think of it like Trials or Hotline Miami. There's an instant restart mechanic you will use a lot. Die and press R (on PC), and you'll be back to the beginning of your current checkpoint, usually only a few seconds away. It's fundamental to the loop of the game. You can't hope to overcome a new area without dying a few times while you hone your plan. Try one way, die, then try another: that's how it goes. You'll come to accept it and, therefore, the sting of dying goes away.But not entirely. Ghostrunner is a hard game. It's a game of dexterity and one you could probably look very impressive playing if a friend were to watch. But it takes practice. Playing it reminded me of learning a musical instrument, checkpointed areas like passages of music, the micro-moments of them like bars. One bar might be sliding down a ramp and then leaping up into the air, slowing time, strafing around a stalled projectile, then landing and slicing one enemy in half. Another might be going from there into a wall-run over to another platform and kill. Bar three might be swinging on the energy leash over to somewhere else and slowing-time to perform another kill. And so on.But each of these bars needs learning individually before they can be put together in sequence. And there are all kinds of things that can go wrong. Sometimes you don't stick to a wall to run along it the way you did before; sometimes you don't latch onto a handrail to slide along it in the way you did before; sometimes an enemy shoots at a different time; sometimes you simply miss your mark because you're getting weary. And it all adds up.I'm not joking when I say one boss encounter took me 246 tries - deaths - to clear, which sounds ridiculous. I wouldn't play a game if someone told me it was like that. But please don't let it put you off, because, yes, it was frustrating and I stamped my feet a bit, but it wasn't that bad, and it's sort of how it goes. A few levels took me around 30 attempts, a few levels around 80, and a few around 140, but it builds up so incrementally you rarely really notice.And I hate to say it, but the difficulty brings with it a sense of achievement. There's a moment in Ghostrunner, when slicing your last enemy in an area, that the game slows briefly as if to acknowledge your success, and it feels great. It feels great because you know how difficult it can be. Special abilities help alleviate the challenge a bit. They're like occasionally usable cheats. There are four, and you unlock them slowly over the course of the game. Essentially, they all find a different way to kill a bunch of enemies at the same time. Blink, for instance, allows you to slow time and mark nearby enemies that you can then simultaneously dash through and kill. Tempest, on the other hand, produces a huge gust of wind that sends enemies flying like ragdolls, and it can return projectile fire too. I don't want to spoil the others.A recharge timer means you can't use them all the time, and because they all share the same recharge timer, using one resets them all. Therefore, it's more a case of picking an ability than juggling them all. Upgrades play into this. There's lots of possibility but again, you can't have it all at once. You can, for instance, have Blink affect enemies in a much larger area, or make Tempest recharge instantaneously after catching multiple enemies in a blast. You can even make sword swipes return bullet fire.But upgrades are limited by space. It's a bit like Tetris. Upgrades manifest as Tetromino-like shapes you equip by slotting them into a grid. But the grid space is small, though it grows over the course of the game. A choice has to be made. Thankfully, you can change your mind freely and swap upgrades any time, meaning you can tailor builds for encounters you're facing.The only upgrade I would recommend having most of the time is one which marks collectibles on the mini-map, because there are some very cool sword skins to find. 'Cool' is a good word to describe Ghostrunner, actually. It overcomes the occasional kinks and frustrations because, moment-to-moment, it feels so good to play. It actually reminds me of the Wesley Snipes film Blade, bizarrely, and how funky music always pipes up as he dominates another fight scene. It's a bit like that here, funky music starting up in your ear as you approach an enemy-laden problem, pumping just enough to raise your heartbeat. Then your enemies shout something like ~Oh shit - it's him!~, and then there's a blur of acrobatics, and then everyone's dead and you land, wipe your sword and move on. Picture a Wesley Snipes grin and you've got what I mean.What really helps the feeling is the game's performance. I'm not going to pretend to be Digital Foundry because that would be embarrassing for everyone, but suffice to say Ghostrunner ran surprisingly smoothly on my mid-range PC. Look at the screenshots, and all the lovely dirty metal and glowing neon and graffiti. I never thought that would run well on my PC, but somehow it does. (Incidentally, I apologise for the choppy performance in the video. It's not representative of the experience I had but was all I was capable of recording.)It's optimisation like this that speaks to how impressive Ghostrunner is as a production overall. I wondered how it would sustain itself over several hours but it does - over a dozen, if you're asking. It trickles in new enemies, sprinkles in a few boss encounters (bear with them - they're mostly agility puzzles), and gives you a few new toys to play with along the way (some of the temporary power-ups are wonderful). And all the while it tells you a story of revenge and revolution in your ears, which I haven't mentioned before because it's only ever a backdrop to the game. But it's nice enough to listen to and it never slows you down, and it helps ground the game in a time and place. You get a sense of a wider cyberpunk world out there, beyond the massive tower you're climbing.All that's left for me now is to go back and replay the individual levels, collecting the things I missed, and beating my time to completion and amount of deaths along the way. And I'll do it, not because I'm fussy about that kind of thing, but because, simply, Ghostrunner is a joy to play."}