{"ref": "https://www.eurogamer.net/kirby-triple-deluxe-review-1", "date": "28 Apr 2014", "game_name": "Kirby: Triple Deluxe", "text": "The same caveat applies to just about every mainline Kirby game, but it's worth repeating for those who've never had the pleasure of his company: if you're looking for a challenge, you've come to the wrong place. Triple Deluxe has its moments, but the kind of player who believes that the greatest rewards come from conquering the steepest hurdles probably won't be tickled pink. If, however, you don't happen to mind easy games as long as they've got enough going on elsewhere to compensate, then read on.Happily, there is plenty going on in Kirby: Triple Deluxe, and it starts with the use of 3D. Recently, of course, Nintendo's been trying to downplay the importance of what was first pitched as the 3DS console's main point of interest, but HAL was evidently having too much fun with the possibilities of autostereoscopy to listen. So tough luck if you own a 2DS, or you're one of the 12% who can't see 3D properly: Triple Deluxe is a demonstrably better game when you push that slider all the way up. You'll have seen most of these visual tricks before, but you can sense the enthusiasm of HAL's artists and level designers in the way they're employed. This isn't the first 3DS game to squash enemies - or its protagonist, for that matter - against the screen, like a toddler pulling silly faces against a glass window. It isn't the first 3DS game to have objects rattling from background to foreground, to make it appear they're coming out at the viewer. There's nothing especially exciting about Kirby grabbing warp stars to move between layers, and enemies similarly shifting between planes, though the effect is very nicely done. But the total absence of subtlety or restraint is strangely infectious. It's doing one or more of these things all the time.The upshot is that, while Triple Deluxe's art style isn't as distinctive as, say, Epic Yarn, its levels are more visually interesting. It helps that it's as bright and colourful a game as you're ever likely to see, and while the enemy design isn't particularly inventive - bosses aside - their animations are smooth and full of character. The fluidity is really quite something: it runs at a consistent 60 frames per second, even with the 3D on. Kirby games are rarely rough around the edges, but this is positively slick - polished to the sheen you'd normally associate with the best first-party games.It's surprisingly varied, too. Take World 4, for example. The first stage is set in some overgrown ruins, while the next has some side-scrolling underwater sections, before taking you down waterfalls, grabbing warp stars at the bottom to zip between cascades at the front and back. Then there's a haunted house with a mirrored background revealing ghosts and spiked hazards you can't see on Kirby's level, as well as fake floors that hide deadly pitfalls. Then it's onto a temple with fire-breathing cobra statues (who'll swivel to face Kirby wherever he is) and sandy conveyors. There are lava levels and ice levels, yes, but one will have you ingesting giant, rubbery eels to unclog pipes while the other sees high winds briefly turn one stage into an auto-runner. It's still a platformer where you can float over most gaps and its environmental puzzles rarely requires you to think too hard, but the desire to see what visual flourishes or gags HAL has in store compels you to keep playing. Kirby only has a few new copy abilities, but they're all great: as Beetle Kirby you can impale enemies on your horn before smashing them into the ground, while Bell Kirby sees you ring out chimes of increasing power. Circus Kirby is even better, turning you into a juggler, a clown and a balloon sculptor.Then there's the Hypernova power, gained by eating a special fruit; this essentially turns the level into an all-you-can-ingest buffet, and it's used to predictably destructive effect. Blocks, rocks, trees and enemies all disappear down Kirby's vacuum-powered cakehole, while other objects are sucked up to be spat out at a later time. A couple of stages continue that great Nintendo tradition of using turnips as unlikely weapons, while one brilliant moment has a Waddle Dee clinging on so desperately to a piece of scenery to save himself from being swallowed that he uproots an exit door.It's funny and it's charming, then, and there are enough secrets tucked away in each stage that replaying them never feels like a chore. Secret exits squirrel away some genuinely decent puzzles, some of which feature - believe it or not - fun use of gyro controls. Collect all the Sun Stones within each world and you'll unlock an extra level that nudges the difficulty up a notch (albeit from very easy to quite easy), while the optional collectables are great: keychains with sprite art from previous Kirby games that sway on the menu screen when you tilt the 3DS. Rare is the Kirby game that offers a campaign and nothing more, and Triple Deluxe is no different. Dedede's Drum Dash is the weakest aside: a basic and really quite dull rhythm-action platformer that sees Kirby's arch-rival collecting coins to some old Kirby tunes. Smash Bros clone Kirby Fighters is more limited than its inspiration, but similarly fast and chaotic, with a seven-stage single-player mode and a multiplayer mode that allows four Kirbys to duke it out across a handful of environments. HAL has included a download play option for this, though it's naturally more restrictive than if all players have their own copy. There are more unlockables to come after completing the story mode, too; though finishing the game won't take too long, I'm not all that surprised that my activity log says I've been playing for over 25 hours. For my money, Kirby's traditional platformers aren't where he's at his best. As one of gaming's most flexible heroes, he shines brightest whenever he's pressed into new forms: I'd class the likes of Power Paintbrush and Mass Attack among his career highlights. And yet as contemporary updates of classic formulas go, Triple Deluxe knocks spots off the insipid, sluggish Yoshi's New Island - it's more generous, more inventive, more alive. Having already brought out most of its big guns on 3DS, Nintendo will no doubt be hoping its second-tier titles up their game this year. Where Arzest failed, HAL has triumphed: Kirby might be a little late to the party, but he's arrived laden with treats."}