{"ref": "https://www.eurogamer.net/broken-sword-5-the-serpents-curse-review", "date": "28 Apr 2014", "game_name": "Broken Sword: The Serpent's Curse", "text": "A lot of coffee is drunk in Broken Sword 5. Certainly in the game's first half, which formed a rather crude Episode 1 when it was first released at the end of last year, many scenes revolve around a lovingly drawn Parisian café, where heroes George Stobbart and Nico Collard meet up and sip tiny cups of black java while discussing their latest case.It's cosy and intimate, a tone that applies to the whole game. This is yet another retro series revived thanks to crowdfunding from fans, and Broken Sword 5 has taken that investment as permission to abandon the awkward earlier attempts to evolve the title in more commercial action-adventure directions. The Serpent's Curse is a retro game through and through, unfurling its point-and-click pleasures at a relaxed pace, and filling its corners with in-jokes that only the faithful will appreciate.As is traditional for the series, the plot kicks off with very little time wasted. A mysterious painting has been stolen from a Paris gallery and the gallery owner has been shot and killed in the process. George Stobbart is on the scene as an investigator for the insurance company, while his companion Nico is still working as a journalist and smells a scoop that could finally land her the front page.Reaction to the opening half of the game was somewhat muted when Episode 1 was released, and with good reason. As enjoyable and familiar as the first few hours of the game are, they're not exactly action-packed and involve a lot of back and forth between a small number of locations, where you have lots of conversations with the same small group of characters. The plot inches forwards, becoming much more interesting once you jet over to London and a Russian oligarch enters the fray, but it does feel a little small and predictable.The puzzles take a while to warm up as well. Broken Sword 5 is the sort of adventure that likes to seal you into a limited area and refuse to let you leave until you've done what you need to do. Often that means finding a way into - or out of - a locked room, but there are more surreal requirements along the way as well. You'll find yourself playing dress-up to comfort a boozy widow and rigging a device to make a police officer need a wee.Given that your options are always limited by circumstance, progress isn't particularly taxing in the early going. Characters drop fairly obvious clues in their dialogue, and the inventory items you have to hand are hardly abstract in their purpose. The occasional puzzle is rendered more difficult than it needs to be thanks to obscure scenery items - there's a girder you need to grab in one early puzzle that is right at the top of the screen and easily missed, for instance - but solutions are always logical, if not predictable.In the unlikely event that you do get completely stuck, there's a hint system which goes from vague suggestions to simply telling you what to do the more you click. Strangely, there's no limit on how often you can use this feature, and nor are you penalised in any way for taking advantage of its explicit instruction. It's entirely possible to be led through the entire game in this manner, although you can switch the hint system off if its very existence offends you.The Serpent's Curse may not be edge-of-the-seat material for its first half, but it's never less than charming and engaging thanks to a genuinely witty script that makes it feel like these characters had never been away. It looks delightful as well, with some truly gorgeous hand-painted backgrounds that are brought to life with simple but effective parallax scrolling. The character models have a cel-shaded look to help them blend in with the art style, a technique that seems to have rubbed some fans the wrong way but I found it fairly seamless. The animations are particularly impressive, with characters moving and interacting in natural, tangible ways.It's in the second half - the just-released Episode 2 of this ad-hoc split - that the game really comes into its own. The well-trodden streets of Paris are left behind and the series' globe-trotting nature is finally acknowledged. There's a definite shift in terms of tone as well, as the wry mystery solving of the first section gives way to religious intrigue and ancient conspiracy. It's a pity Dan Brown's turgid prose has ruined this style of storytelling for so many people, as in the right hands - as here - it leads to some genuinely ripping yarns.The challenge also ramps up in the latter stages, with more emphasis on actual puzzles - code-breaking, riddle-solving and the like - rather than just inventory-based  problems to solve. For point-and-click aficionados who feel the genre has lost its bite, there are moments here that will have you reaching for pen and paper to work things out (and resisting the urge to use that hint system).It's as much a victory lap for those who kept the faith as it is a fresh start for a beloved sagaSome frustrations remain, however. Point-and-click is a curious genre, born of an input system that was once a necessity and is now a nostalgic affectation, and there are moments where you remember that it's not without its inconveniences. Even when in mortal peril, characters amble from place to place with no particular urgency, and with no double-click option to speed transitions from one screen to another, certain sequences, especially ones where trial and error is a factor, will test the patience of even the hardiest adventure game fan. The same goes for some long-winded conversations where there's literally nothing to do except click on every topic until the game deigns to let you continue.You could also argue that in playing so hard to existing fans, The Serpent's Curse risks alienating newcomers. Certainly, the parade of returning faces - corpulent art critic Laine, hapless Sergeant Moue, Lady Piermont, Duane and Pearl Henderson and even that bloody goat - starts to feel a little excessive. It's also noticeable that in its rush to a big finish, the plot leaves a lot of the elements and characters that dominated the first half dangling and unresolved - not least the murderer whose actions set the whole story in motion, and whose involvement is rather haphazardly brushed aside in favour of a cutesy ending.The Broken Sword series has wobbled in the past when trying to appeal to the mainstream, particularly in its dalliances with consoles, so it's hard to begrudge this return to its PC roots a little indulgence. It's as much a victory lap for those who kept the faith as it is a fresh start for a beloved saga.It's not without its problems, and it's unfortunate that those who supported it first had the lesser experience thanks to the inorganic switch to a half-baked episodic format. But it's also doubtful that anyone who loves this series will come away too disappointed by the end result. Like meeting up with an old friend for coffee, it's a pleasure to be savoured."}