{"ref": "https://www.eurogamer.net/pikmin-3-deluxe-review-buried-treasure-given-a-buff-new-shine", "date": "28 Oct 2020", "game_name": "Pikmin 3 Deluxe", "text": "Between its dusty plant pots and dew-laden leaves, Nintendo's cute take on the strategy genre has always been more than the sum of its parts. Whether those pieces were the spaceship components you rushed to recover in Pikmin 1 or the household items you found littering the landscapes of Pikmin 2, your route to those hidden treasures was always about more than simply hoovering the map of its goodies. Pikmin's charm lies in the gradual growth of your dinky armies, the act of plucking new creatures from the ground to replace their fallen forebears, the battles where you must attempt to protect them from harm.  And so it is in Pikmin 3 Deluxe, Nintendo's latest Wii U game to get the Switch re-release treatment, this time courtesy of Japanese support studio Eighting. For your money this time around you get a relatively straightforward port of the original game, now with its extra challenge mission DLC included from the off, plus a suite of all-new extra levels set before and after Pikmin 3's story that give a little more time to the series' original protagonist Olimar, revealing what he was up to while Pikmin 3's main story took place elsewhere (and a little bit of what happened after that...) I generally enjoyed the original Pikmin 3 - though I mostly remember simply being happy Nintendo was continuing the series after such a long wait for another instalment (a similarly long wait to the one fans are experiencing now for Pikmin 4). So, as far as Pikmin 3 Deluxe's main campaign is concerned, many of the same positives and negatives remain present. Both of the game's debut Pikmin species - the pebble-like Rock Pikmin and the mosquito-like Flying Pikmin - are brilliant additions, though the fact they supplant rather than complement Pikmin 2's Purple and White species in the main campaign is a bit of a shame. The addition of a third playable character to let you keep three different plates spinning at once adds a real leap in mental complexity to the proceedings, though in reality it's rare this really adds much of a tangible advantage. And while Pikmin's overworld areas have never looked prettier or been more intricately put together, the removal of Pikmin 2's challenging cave mechanic feels like a step backwards, while the lack of a few fan-favourite creatures (no Bulbmin! no Bulblax!) leaves its enemy roster feeling slightly incomplete.Pikmin 3 replaces the series' veteran heroes with three newbie adventurers, presumably to give new players an easier entry point into the series, and initially scatters them across Pikmin's familiar-looking planet surface. The trio had been headed there to gather food for their own planet, and quickly you'll help them team up again to begin stashing pieces of fruit they find scattered around the environment. The series' original Red Pikmin, strong fighters impervious to fire, and yellow Pikmin, which can conduct electricity and be thrown up high, are found early on. You'll also quickly meet the beefy Rock Pikmin which can be used to smash crystal-like obstacles and glass barriers, and can withstand being stomped on by some enemies. It takes a while for Winged Pikmin to make their debut - they always felt a bit like a Pikmin cheat code, able to hover over water and quickly carry items through the air and on more direct routes. The game's roster rounds itself out with Blue Pikmin, whose late introduction serves as a reason to revisit earlier areas and scoop up any remaining fruit lying submerged underwater. In some ways, Pikmin 3 felt a conscious step back to the simpler experience Pikmin 1 offered - one with fewer gadgets and abilities, no upgrades to your heroes, and a singular time-limited quest which could be speedrun multiple times. (Pikmin 2, meanwhile, saw Olimar and Louie able to continue stripmining its areas at leisure after the credits rolled.) But where Pikmin 1 had a strict time limit which could result in a full game over if you dawdled, Pikmin 3 remains more lenient - you have as much time as the fruit you collect, and you'll quickly build up a healthy buffer. This Deluxe re-release builds on this with a couple of (entirely optional) useful aids - a tips system which will highlight the game's scattered resources needed to build bridges, and even directional arrows along the ground guiding you to the game's next major objective. The Wii U's GamePad touchscreen map lives on here via a pause screen - an improvement, to be honest - while you can use the Joy-Con's gyro controls to quickly point and aim when throwing Pikmin or corralling them using your whistle. It doesn't work quite as well as the series' superlative Wii Remote controls in earlier instalments, but it's an improvement from where Pikmin 3 was at previously. Now's a good time as any to mention a couple of other nice additions - Pikmin 2's brilliantly-written Piklopedia has been added to detail all of Pikmin 3's creatures (worth a read just to see how Louie would eat them all), and there's now a set of achievement-like badges to grind for.The game's fun but forgettable competitive mode Bingo Battle returns untouched, while the brilliant one or two player co-operative mission mode now includes its dozen additional Wii U DLC areas, which offer some of the same variety as Pikmin 2's caves. It's here you're also able to meet Pikmin 2's chonky Purple and poisonous White Pikmin varieties in more abstract, floating levels themed around construction sites, sandy beaches, or helter-skelter-ing around the branches of a household Christmas tree. After wrapping up the game's story I've spent almost as much time again going through each of these levels multiple times to improve on my speedruns, levelling up my medals for each. Finally, there are Pikmin 3's all-new Olimar and Louie levels, set before and after the game's main campaign. A couple of weeks ago I was able to play the first set of these and found them enjoyable but rather lightweight. Well, I'm delighted to now be able to say those found in the second set, which you'll unlock after the game's campaign concludes, are meatier and more numerous, though Nintendo does not want me to say anything more about the story they tell. While they're still set in Pikmin 3's original areas and a bit of a kitbash, they offer the closest thing to a Pikmin 4 you're going to play this year. And that's the real hope with this re-release - that this return of the Wii U campaign with extra bells and whistles is the launch pad for an all-new Pikmin in the relatively close future. Just like its own small treasures, Pikmin 3 is well worth dusting off, as we wait for the series to properly end its garden leave."}