{"ref": "https://www.eurogamer.net/scourgebringer-review-another-roguelite-thats-well-worth-your-love", "date": "23 Oct 2020", "game_name": "ScourgeBringer", "text": "Hitting an enemy in ScourgeBringer is like ringing a bell. There's something hollow going on, something metallic, something that resounds. And by hitting them I mean smashing them, which is the stun move and the knockback move and very different to the main attack in both the time it takes to play out and the time that's imposed before you can do it again.Actually bells aren't quite right - or rather the bell move is a bit of a special case. Action-heavy Roguelites - Hades, Dead Cells - these games are feelings, really, textures at a push: they are about the particular flavour of connection being offered. Hades is that polished marble slide that ends in a headbutt. ScourgeBringer, bells aside, lives in its own hideously toothy mouth. This is a game about chewing: you chew through enemies but you also chew through the space they exist in. You chew through the pixel-pure air itself! If I play too long I worry my teeth will be grit and rubble by the end of it. But still I play on. Maybe all the bells I ring will eventually summon a dentist.ScourgeBringer is wonderfully horrible and beautiful sci-fi. You are a white-haired force of nature billowing around a series of perfectly poky 2D chambers. The chambers fill with waves of attackers, which you chew through in order to unlock the various exits. The chambers themselves connect up to form realms, each capped with mini-bosses and then a mega boss known as a Judge. Beyond that, more realms, with their own twists. Ice? Tofu walls? A surprisingly brilliant reference to the classic cartoon Duck Amuck? Fail, and it's back to the start.But stop. Pause. This game lives in the chambers themselves. You pick a door and move. You take a breath. Whatever happens next is going to be knackering. Within small spaces, and driven by a chugging soundtrack, action plays out in a kinetic whirl. Main attack, the smash, the dash attack, every aggressive action has a bit of movement to it. You can launch enemies into the air, or leap into the air and keep aloft by the power of your slashing moves, or the power of a double-jump, or by a wall-spring. This is why the game seems so chuggy and chewy, you are kept aloft, kept moving, by your aggression, by the grinding down of baddies. Oh ho: lay on enough damage and you charge your ranged weapon: screen-shaking orange bolts of hot lead at the very least. All the way up to a grenade launcher.This sounds like a handful, and it is literally that: play on the Switch and the urge is to just grip the triggers and face buttons and squeeze at them as you unleash random havoc in a confined space. But do that and you will take damage, and the hit-pause that accompanies damage has the record-skip of shame to it. You are not meant to take damage! Health is a resource here, you have to work out how much you can afford to spend as you explore the procedural rooms looking for the mini-bosses that pave the way to the next judge. You might get lucky with a health drop, and you may be able to spend the blood from your enemies on health or something more violent from a shop. You may even find a shrine that offers a range of bingo-ball perks, one of which could allow you your health back, but isn't that a waste too? Too spend the fortunes of a shrine on a health boost instead of something more interesting.So you look after your health, and ScourgeBringer stops being something wholly chaotic and takes a clever form. Target prioritisation is the name of this game. Find out what the enemies do and then work out which ones you have to take out first. Big guys who fire bullets? That's going to be a problem. Maybe you can stun them before they fire. Maybe you can knock them into the walls and then take on the roving turrets, before the bats who nose-dive for you, the worms with teeth, the weird snail-shell thing.All of that is from the first realm. Beyond that you get all kinds of horrors. One late game beast looks just like a flu virus, a beach ball covered with factory chimneys. I particularly love the metallic diamonds from the second realm that resist bullets. I love the laser thing, that at least gives you a warning before it singes your eyebrows off. I love the throbbing goop bombs. I love the mini-boss who looks like somebody dropped a Crunchie bar on a marble floor, poor soul.Because this is a Roguelite, outside of the action, in between failures, you get to spend Judge Blood on an upgrade tree. I will be honest: it's slow going at first, which makes the early hours with ScourgeBringer an extremely steep challenge. But soon you are unlocking new moves, extra health, starting bonuses and all sorts of stranger things. The smash attack levels to become something I wish I could take with me to the supermarket.This upgrade tree is an actual tree, incidentally, and as you purchase upgrades you find little bells tethered to its branches. This is the other side of ScourgeBringer: it is clearly in love with its weird world, and I in turn love it for this. Bells on trees! A snoozing elder who might awake to give you little bits of information. Strange characters who pop up every now and then in moth-wing cloaks, eager to help. Computer terminals that tell a story in fragments, alien artefacts you can't read at the start, but...? An entire secondary... I have said too much.Throw in truly thoughtful accessibility options and you have a compact game that is rich in delights. Its delights are mainly horrors, but isn't that the way with Roguelites? Anyhoo: get in and get ready to ring those bells."}