{"ref": "https://www.eurogamer.net/betrayer-review", "date": "4 Apr 2014", "game_name": "Betrayer", "text": "You begin Betrayer washed up on the shore of the New World, a country rendered in stark monochrome. A linear path leads you inland, acting as a tutorial along the way, but it's once you reach the abandoned Fort Henry that you really begin to grasp what awaits you.Or rather, you don't. Betrayer is the sort of game that delights in keeping you on the edge, never entirely sure what's happened to rid the land of human life or what you're supposed to do about it. It's a game with no missions, no quest markers, no breadcrumb trails. There are inventory screens that document every clue and every note that you find - but these only illuminate where you've been, not where you're going.Blackpowder Games, largely made up of former Monolith developers, has dipped into some obvious influences for this stark and striking horror adventure. The Elder Scrolls is one, with an open map through which you navigate by icons on the compass. You'll also sense strong echoes of Far Cry 3. Corrupted, animalistic Conquistadors patrol the wilderness, and since your only defences are crude bows, old-fashioned muskets and a throwing tomahawk, you'll spend a lot of time skulking through long grass, masking your movements in time with gusts of wind and thinning their numbers as stealthily as possible.Should you fall in battle - and you will, since these Conquistadors hit hard and are relentless once they have your scent - you'll respawn back at the fort, leaving all the valuables you found at the site of your death. If you die again before reclaiming them, whatever you found or earned is gone forever. Add Dark Souls to that list of influences.But Betrayer is also an adventure game, of sorts, and one that is driven by mystery and puzzles. Not the crude block-sliding, lever-pulling puzzles that games so often fall back on, but deeper, more abstract problems. One of the first occurs when you replace the bell at Fort Henry and ring it. The world turns black, and suddenly you can see and speak to spirits, while skeletal phantoms replace the Conquistadors as your primary antagonists. A little bit of Silent Hill? Sure. Why not?While the influences are obvious - and often illustrious - Blackpowder has done a fine job of refining them down to their essences and combining them in ways that feel fresh. Betrayer makes its home in the gaps between genres - never fully an RPG or a point-and-click adventure or a first-person action game, but always leaning on elements of all.With almost no hand-holding, you're forced to venture out into this desolate and genuinely unnerving black-and-white landscape, piecing together not only the story but your role in it. You'll be asked to find the wife of a ghost, but when you do there's no happy reunion and no neat resolution. You'll find clues relating to plagues, shipwrecks and desperate settlers, but the game aggressively resists the lure of expected plotlines. Just as the haunting visuals keep your senses off-balance, leaving you relying as much on sound as sight to find your way around, so the fragments of story serve more to unsettle you than to reassure you with a  three-act structure.In terms of tone and mood it reminds me, more than anything, of the hallucinatory and terrifying climax of Nicholas Winding Refn's 2009 metaphysical viking movie, Valhalla Rising. It's a game that presents exploration as cloying terror and colonisation as a creeping cancer. It's scary, not in the cheap sense, but at a more primal level. You're compelled to explore this land - area by area - but it never feels comfortable or empowering.While Betrayer succeeds in atmosphere, it fares less well in pure gameplay terms. The lack of direction is thrilling, but becomes problematic when the game only marks specific locations on the map. You can't leave waypoints or any other markers, so when you do find somewhere of interest - such as the malevolent totems which play a crucial role - keeping track of where they are is more of a hassle than it needs to be. It's not that the game should clutter itself with distracting screen furniture to help you find things, but once you have found them, it's not beyond the boundaries of the fiction that you'd have a way to find your way back again.Combat is, sadly, where the game is weakest. The enemies are fairly crude creations, wandering back and forth in fixed, meaningless patterns, and their AI doesn't stretch much further than simply charging at you once roused. Once you've got their attention, they'll follow you across the whole map, displaying only the most rudimentary of tactics - at a distance, they'll use ranged attacks, and up close they'll batter you senseless. The result is that all enemy encounters tend to play out in the same limited ways.Even after hours of play, it's possible to still be unsure what Betrayer is about or what it means. The whole game is a questionYou end up relying on stealth, but even this is a little woolly. Sometimes you'll be spotted and attacked by an enemy you never even saw, other times you're able to creep right up to them despite apparently being in their peripheral vision. You're never entirely clear how well hidden you are, or how noisy or quiet you're being, and the enemies' binary ~ignore/kill~ responses mean there's not really any room to get it wrong. When you're offered the chance to buy a Crude Charm of Grace that makes you ~4% harder to hear and see~, it's impossible to know what that actually means in tangible terms.Betrayer is rougher around the edges than its stylish exterior may suggest, but it's never less than fascinating. Even when it leaves you blundering around in the undergrowth, trying to work out if you've seen this particular collection of rocks, grass and trees before, there's something here that demands a little more patience, a hook that's strong enough to sink in even through less than perfect core systems. I think it's because, even after hours of play, it's possible to still be unsure what Betrayer is about or what it means. The whole game is a question, intriguingly posed and offering no easy answers.Such ambiguity is only possible in an indie game, and anyone who played the early access alpha will have seen that Blackpowder has already evolved its ideas drastically to get to this proper release. I doubt the improvements will end there, and with more refinement Betrayer can only become more interesting. It's a sinister journey, but one well worth taking."}