{"ref": "https://www.eurogamer.net/infamous-second-son-review", "date": "20 Mar 2014", "game_name": "inFamous: Second Son", "text": "Announcing the third inFamous game at the unveiling of PlayStation 4 last year, director Nate Fox got political. He mentioned that he'd been tear-gassed in 1999's anti-globalisation riot, the Battle of Seattle (an event he's been invoking in interviews for a while). He attacked the police. He touched on the troubling extent of government surveillance that was dominating headlines at the time. ~Our security comes at a high price: our freedom,~ he declared, before linking current affairs back to inFamous lore - an unruly superhero universe where the emergence of super-powered humans in present-day USA causes chaos and unrest. ~Which of us would have the courage to fight to get our freedoms back?~ he asked.So is inFamous: Second Son a rebellious, politicised action game for the Occupy generation? As you might have predicted, not really. Banksy's subversive street art is a token inspiration - our new hero is Delsin Rowe, a delinquent youth with a gift for stencil art, which you can apply with a rattle and spray from the controller - but like its predecessors, Second Son is pure comic-book at heart. Granted, the tone has shifted from the conspiracy, catastrophe and convoluted timelines of DC Vertigo to classic X-Men, where superheroes are given a derogatory classification (~mutants~ then, ~bio-terrorists~ now) and hunted by the authorities, serving as avatars of disaffected youth and the persecuted underclass. But the stakes are strictly personal, the counter-culture clothing just borrowed threads. Nirvana's grunge classic Heart-Shaped Box plays as the credits roll, but it's a cover version.Still, this is a more authentic and lively game than its two predecessors. The developers at Sucker Punch Productions haven't quite seemed at ease with the tonal jump from their Sly Cooper cartoon capers to the teen-rated angst of inFamous in the past; they struggled to pin down a personality for the star Cole MacGrath or an atmosphere for Empire City and New Marais, the games' impersonations of New York and New Orleans. Second Son is a fresh start on home turf - Sucker Punch's home town of Seattle, proudly going by its real name. The studio is tangibly more comfortable, the new lead is more personable, the tone isn't too heavy or forced.Seven years on from the events of inFamous 2, Delsin Rowe is a free-running, free-climbing, graffiti-spraying slacker kid from a Washington State Native American tribe. He discovers he's a ~Counduit~ - a superhuman mutant - when he helps another escape from the oppressive Department of Unified Protection, inheriting his powers in the process. After a headmistressy DUP despot called Augustine takes her revenge on his friends, Rowe heads for DUP-controlled Seattle with his older brother Reggie, a cop, looking for answers and relief for his people - meaning both his tribe and the Conduits he increasingly identifies with.This sets up a compact and likeable open-world adventure, relatively free of the excessive padding that blights these games. The main storyline is brisk and the side missions are a manageable distraction as Rowe hunts a couple of other Conduits and their power sets, loosens the DUP's hold on the city district by district, squabbles with his brother and seeks an ultimate confrontation with Augustine. The plot is a flimsy sequence of inconsequential MacGuffins and, towards the end, feels rushed, as though it's been heavily edited - but its simplicity and brevity are refreshing in the context of this bloated genre.Delsin's a bit of a brat - and his heritage a clumsy stab at legitimacy - but he's given charisma and warmth by emerging VO superstar Troy Baker (BioShock Infinte's Booker and The Last of Us' Joel). It really helps for him to have a foil in the form of Reggie (Travis Willingham), too. Their disagreements and banter follow a predictable course, but the filial relationship makes for an underplayed and ultimately quite touching human foundation for the action.Reggie leaves a stronger impression than the other Conduits, a convict, a punky ex-junkie and a bullied gamer. Their purpose is less dramatic and more structural: furnishing Delsin with new powers and presenting you with the choice to ~corrupt~ or ~redeem~ them according to the inFamous series' trademark good and evil paths. Depending on which of these you follow, you'll get some different cut-scenes, missions and side missions, and your skills and combat style will take on a different flavour, so fans might find it worth a replay to see how the other half live. But the dichotomy never seems to penetrate to the core of the story or Delsin's character, which remain quite breezy throughout.The things that seem to have fired Sucker Punch's imagination instead are the location and the new host hardware. The art direction in particular has really stepped up. Although plenty of artistic licence has been employed, Seattle's atmosphere and architecture have been lovingly and accurately condensed by the local team; anyone familiar with the town can have fun spotting Emerald City institutions and businesses as well as famous landmarks.PS4 powers this city with ease, the busy skyline stretching all the way to the Puget Sound without compromises in draw distance or frame rate, even as you clamber and swoop from rooftop to rooftop at breakneck pace. If there's one thing the former platform game specialist Sucker Punch excels at, it's the joy of just getting around, and inFamous' brand of superpowered parkour has never been sweeter than in Second Son. You can race up walls in a neon streak or sprout flickering pixel-wings to zoom through the air; at such moments the game has some of the intoxicating glee of Realtime Worlds' classic Crackdown.The PS4 has enabled Sucker Punch's artists to really go to town on the VFX, too. Cole MacGrath's electricity powers have gone to the grave with him (continuity-wise, the game follows inFamous 2's ~good~ ending) and we now get a much more imaginative and striking suite: smoke, neon, video and concrete. These are visually original and quite spectacular in pitched battles. The brittle shards and swirls of concrete commanded by superpowered DUP agents have a particularly unique and tactile flavour, but I also loved the hot pink highlights of neon and the ashy crackle of the smoke powers.Sadly, once you start exploring the powers, you'll find that flavour is about all they change. Once unlocked, you can switch between the power suites and expand them in a skill tree, but they offer only mild variations in combat or movement style, with most of the skills being analogous. It's also unavoidably wise to concentrate your skill points in one power - probably smoke, since you get it first and are forced to use it in a couple of late missions. (Yep, Second Son has that dismayingly common habit of giving you a box full of fun toys and occasionally restricting how and when you use them.) The combat is chaotic and a little scrappy, but it gives you plenty of room for manoeuvre, and the powers have been generously balanced so it only becomes a chore when you're whisked away for one of the turgid boss battles.Second Son is easy to enjoy, but it's reluctant to deviate from a stale streetmap of game cityOverall, it's good clean fun - so it's a shame that Second Son suffers from a consistent failure of imagination in how it's put together. There's not been much of an attempt to shake up the mission scenarios or structure of the game, leaving you with a very rote open-world adventure. Follow the waypoint marker, chase the suspect, investigate the scene, wipe out the jackboots; hunt the collectables and tick the boxes. You've been here many times before. The collectables and side missions all contribute to reclaiming districts from the DUP, which organises them into chunks and structures the reward usefully, and they've been judiciously pruned - but this is good admin rather than great game design. As pretty and playable as it is, in no sense is inFamous: Second Son a post-Grand Theft Auto 5 open-world game. It's just a tidier, shorter and shinier one. It's easy to enjoy and has a winning personality, but it's reluctant to deviate from a stale streetmap of game city. It's no rebel, then. In fact, it's a conformist."}