{"ref": "https://www.eurogamer.net/heroes-of-dragon-age-review", "date": "3 Mar 2014", "game_name": "Heroes of Dragon Age", "text": "So here we go again. EA has taken another popular hardcore fantasy game and turned it into a free-to-play mobile title. Last time this happened, we got Dungeon Keeper. Now it's Dragon Age. It can only end in tears, right?Well, hold your high horses. While it would be a massive exaggeration to say that Heroes of Dragon gets freemium right, it certainly doesn't get it as gruesomely wrong as Dungeon Keeper. In fact, it suggests that EA might finally be getting its head around the idea that a game can use in-app purchases without mooching off the player until they bleed. It's small progress, but progress all the same.Heroes of Dragon Age is an attempt to retell the history of Thedas via a sort of digital table-top game. Much like a collectable card game, you blind-buy characters and use them to assemble a team of five. It's just that instead of cards, you're buying 3D figurines drawn from Dragon Age lore. From common types, such as generic soldiers and bandits, through to ~epic~ unique characters like Aveline Vallen and the Qunari Arishok, each has their own traits to consider.Characters with high initiative move quickly and will be the first to strike. Slower characters will attack later, but deal more damage. You can also tweak their stats based on where you place them in your squad. Every character has a faction, shown by the coloured tile they stand on, and matching these in rows and columns grants boosts. Characters on the back row also gain a higher chance of dealing double damage, while those on the front get bonus health. The fifth character slot is to the side, and is reserved for giant creatures: bears, spiders, the stag-like halla or even the towering tree monsters known as Sylvan.Also allowing you to massage your chances of victory are runes, which are single-use, time-limited power-ups. These may buff your attack power, help you to earn XP or gold faster or direct your warriors to focus their attacks on the enemy's quickest, weakest or most powerful fighters.Finally, you can level up your characters through XP earned in combat, but there are additional ways to build them up. You can combine identical characters into one, pooling their XP and raising their level cap in the process. You can also absorb up to five unwanted characters of any kind into a preferred favourite, cashing in the XP of redundant characters for the chance of increasing the odds of delivering double-damage critical hits as well as beefing up the stats of someone useful.That's a lot of systems churning away, and it suggests a game of depth and strategy. That's only true up to a point, sadly. In combat, your team lines up on the left, enemies on the right, and they simply slug it out until one team is eliminated, their turns and actions dictated by their stats and positions. In other words, once battle begins, there's nothing you can do except sit back and hope you win.Even winning isn't much of a surprise, given that the game's balancing is all over the place. Go up against a team with even marginally superior stats and you'll be demolished. Go up against a team of lower skill than yourself and you're the one doing the demolishing. Battles between evenly matched sides are harder to call, but only because the outcome feels maddeningly random. You can replay the same battle over and over until, for no obvious reason, you win rather than lose.It's here that Heroes of Dragon Age really betrays its heritage. BioWare's willingness to make role-playing more accessible in Dragon Age 2 dismayed some fans, but even at its most casual it was never as hands-off as this. You can almost always tell whether you'll win a fight before it begins, which means progress soon becomes a question of hunting around for easy XP rather than a carefully calibrated ladder of skill and tactics.And that's a crying shame, since the freemium model being used here actually isn't too bad. There are energy and stamina bars that deplete - one is used for AI ~quests~ that advance the thin storyline, the other for battles against other players - but with separate reserves for solo and online play, that means you can get 12 matches in before you need to recharge, a process that happens relatively quickly. It's still irritating to be told when you need to stop playing, but the wait is never so onerous that you'll feel the need to pay.Instead, your premium currency of blue gems is used mostly for unlocking higher-tier characters - actual, permanent, in-game content - so it doesn't feel like you're being constantly gouged. Certainly, there are areas here where EA could have stuck in a 24-hour countdown - the character combining and absorbing, for one - but has, to its credit, resisted the urge to constantly tug at your purse strings.The game is also surprisingly generous. Gold is doled out in decent amounts after each victory, and it's easy enough to amass the 1500 needed to buy a mid-tier character of rare or greater value. Even the blue gems aren't too hard to come by. You can replay previously beaten story quests over and over until you ~master~ them, earning sizable gem payouts, while a series of ongoing goal challenges - ~combine X sets of units~ and so on - hand out gold (lots of it) and gems (a few at a time). Add in regular daily PVP events with handsome rewards, and the occasional free character download, and you've got a game that gives as often as it takes.~It's a pity the escalation is so clumsily handled, like a rude waiter asking if you want a starter with a sneer that suggests he resents you eating all the breadsticks~It's just the lack of a chewy strategic core and the wobbly balancing that trip it up. There are players out there at level 40+ already, with squads of immensely powerful warriors, and you know they didn't get there through skill - and nor does skill play a part in keeping them at the top. Once you have a team like that, victory is assured in almost every encounter. As too often happens in free-to-play gaming, the wallet or the grind are easy substitutes for meaningful progress. Heroes of Dragon Age isn't the worst offender, but nor is it free from sin.There comes a point, roughly around the sixth questline for me, where even the basic AI battles become frustratingly hard to pass. With no real way of dictating battlefield tactics - attack that guy, not that one! - it becomes hard to stay engaged. That's the point where the game essentially forces your hand: spend a tenner on enough gems to build a serious team, or get grinding. In a way, it's fair enough that you have to make that decision eventually. If you're enjoying the game at that point, why not throw some money at it to stay competitive?It's just a pity the escalation is so clumsily handled, like a rude waiter asking if you want a starter with a sneer that suggests he resents you eating all the breadsticks. You only have to look at Blizzard's Hearthstone to see how a more astute understanding of what players want and need (often two different things) can make for a more satisfying, yet no less commercial, free-to-play experience.A little more faith in the player's ability to cope with deeper strategy and Heroes of Dragon Age would be a genuinely good game. Conversely, it would only take a few more turns of the micro-transaction screw for it to be intolerable. Strange as it sounds, this somewhat awkward middle ground actually represents huge progress for EA's freemium ambitions."}