{"ref": "https://www.eurogamer.net/rambo-the-video-game-review", "date": "21 Feb 2014", "game_name": "Rambo", "text": "Shallow, dumb and relentlessly violent, you could make a pretty strong case for Rambo: The Video Game being a near perfect adaptation of its source material. That source material being the three Sylvester Stallone movies released between 1982 and 1988, in which sociopathic war veteran John Rambo shoots the crap out of a small Washington town, most of Vietnam and a good chunk of Afghanistan.Things get under way with a flashback tutorial level in 'Nam before getting stuck into the events of First Blood, then Rambo, then Rambo III. The fourth film from 2008, confusingly also called Rambo, doesn't get a look in, presumably thanks to licensing issues. Glued to the paper-thin movie plots by the fact that Stallone declined to return in digital form, forcing developer Teyon to use dialogue from the films, the result makes for a bad game on pretty much any metric you care to choose, but a strangely appropriate Rambo game all the same.There are three basic forms of gameplay on offer here. The main one is the sort of on-rails shooter that rarely gets a home release these days. Essentially a remake of Taito's Operation Wolf, it swoops you along its first-person corridors, pausing at set-piece-ready areas so you can unload hundreds of bullets into the twitching bodies of enemy soldiers who obligingly pop out from behind logs, rocks, crates and barrels.~Aah!~ cry the pedants. ~But in First Blood, Rambo doesn't shoot anybody, and only one guy dies and that's because he falls out of a helicopter like a big stupid idiot.~ And, yes, pedants, you are correct. Enter another of the game's play styles: our old friend the quick time event. Much of the First Blood section is made up of these, as you stutter your way through non-lethal hand-to-hand action scenes from the film by prodding buttons at the right time. These are QTEs of the worst kind as well - crude, basic, a little bit fiddly and leading to instant death whenever you fail.You'll suffer these scenes while escaping from the town jail, and while escaping the cops in the forest, but for the later bits when you do get to wield a gun, the game manages to have it both ways. You're supposed to disarm the cops by shooting their guns out of their hands, or shooting them in the legs, but the penalty for blowing their heads off is a minor score subtraction and tiny, tutting ~cop killer~ caption. Who cares? You did, after all, warn them not to push it.The third form of gameplay is a very basic form of stealth, which combines both the on-rails shooting (albeit with Rambo's iconic compound bow) and neck-stabby QTEs. As with everything in the game, though, it's all so rigidly scripted that you never really feel like you're being stealthy. You just pressed the right button at the correct time, or shot the guy in the face with an arrow while he stood there, waiting for you to do it.The game only breaks out of this utterly linear ride on a few occasions. Sometimes you'll have an enemy who is a little more alert than the others, denoted by the Metal Gear Solid exclamation mark over his head, and you'll have to take him out quickly, or else he spots you and shoots you dead instantly. This is especially strange when moments later you can be soaking up bullets during a shoot out, but Rambo's toughness must come second to the demands of unambitious game design.And this really is a game with almost no ambition. Even the title, with that gloriously old-fashioned ~The Video Game~ suffix, seems to set the bar low. It's the movies, but (sort of ) playable, it says. Yes, you'll shoot a ton of guys. Just, please, don't ask for more than that.What deeper systems the game does have are all borrowed from elsewhere. There's a Time Crisis-style cover system, a Sniper Elite killcam and the Gears of War active reload gets dusted off for good measure, offering double ammo for good timing. Rambo also builds up a ~wrath~ meter with every kill. Once triggered, time slows down, ammo never runs dry, enemies are highlighted in orange and everyone you kill restores a big chunk of your health. All solid enough ideas, but none that Rambo can claim as his own.There's a very basic XP system in place as well, unlocking skill points and perks when you hit certain score totals. It's revealing that the very first perk you unlock (you can eventually equip three at a time) allows you to basically skip the QTEs entirely by ensuring you always pass them, regardless of what you press.You can also gain the option to choose which weapons to take into a level, but only by completing Colonel Trautman's challenges. These are stage-specific tasks, such as getting a certain amount of headshots, and while hardly the most gripping meta-game around, they deserve some credit for adding longevity and replayability to what is an otherwise very short and very flat experience.Despite aiming so low, the game still manages to miss the target - if only just. Aiming is skittish, and the AI is literally non-existent. Visually, it looks like the sort of game that would have been very impressive in 1995, with bloated sausage-like character models, weird faces and awkward animation. Rambo himself looks more like the bastard lovechild of Brian May and Dot Cotton, with a freakishly rigid frizzy mullet forming a hairy halo around a droopy, gaunt face. His biceps look like gammon joints stuffed into a pair of tights.~It's a cheap, silly game - and that's why, when it works, which it occasionally does, it's somehow more fun than if the whole thing were a polished, slick AAA blockbuster~It's a cheap, silly game - and that's why, when it works, which it occasionally does, it's somehow more fun than if the whole thing were a polished, slick AAA blockbuster. Those moments aren't common, and they tend to cluster around the end of the game when you've earned enough power-ups to actually make you feel like Rambo - but launching exploding arrows onto a village full of Vietcong, going crazy with an M60 in a Soviet fort, these are the points where the clunky gears click into place and, for all its many, many failings, Rambo: The Video Game feels like a video game worthy of Rambo.That may be faint praise, but then this is a character whose exploits have formed the basis of a huge portion of gaming history already. Only Aliens has had a bigger impact on action game design, so to truly justify itself the game would have to somehow out-class and out-bombast the likes of Far Cry 3 (still, unofficially, the best Rambo game around) and Call of Duty, and the helicopter bits from Battlefield and... well, suffice to say that a game so obviously low-budget was never likely to stand out on production values. It feels like the knives have been out for Rambo: The Video Game ever since it was announced, with its unheard-of publisher and obscure development team. It's an underdog, which feels appropriate.It would have been nice to report that the underdog turns out to be a unstoppable champion, but that was never realistically on the cards. So instead we get this: a cheesy, silly, mindless romp in which hordes of identical bad guys get turned to sticky red paste under the furious gaze of your twitching gun barrel. It's certainly not a good game, but it is a game with zero irony. It's not being corny and schlocky on purpose, which means that for all its faults Rambo honestly taps into the spirit of 1980s action cinema more deeply than you might expect - not in spite of its rough edges, but because of them."}