{"ref": "https://www.eurogamer.net/strider-review", "date": "18 Feb 2014", "game_name": "Strider (2014)", "text": "Strider Hiryu sprints deeply, at forty-five degrees, arm raised to mouth as if shielding his lips while leaning into a mean wind. His crimson scarf billows dramatically behind. He launches into a cartwheel arc through the air before landing with a silent thud on the tail of a familiar foe, the grandson of the chain-link Chinese dragon that loop-de-looped through the air in the original Strider of the arcade. This remake may have been developed in California by Double Helix, but it bears a strong family likeness: Strider's silhouette is unmistakably that first conceived by Tatsumi Wada in 1989, and the lithe ninja's gait and armory remain intact. You even benefit from the generous double jump he learned in the second game.But this time these skills are not freely given: they must instead be won. The gnarly designs of the first two games, pushed into unforgiving shapes by the economics of the arcade (where every death meant another paycheque for publisher Capcom) are gone. Today's descendant takes a new, unexpected and yet also comfortable form: that of the Metroidvania, a vast city broken into a thousand rooms and hallways, which can investigated as your character's growing set of abilities opens up the previously inaccessible world around him.In one room, you learn how to momentarily dart through time and space, teleporting a few feet ahead, an ability that allows you to pass into some hitherto locked areas. Another boss fight rewards you with kunai: throwing knives which can be used to spike enemies or flick otherwise unreachable door switches. In this way the game world unfurls and you tread deeper within.Hiryu's sprinter's poise reflects the game's broader stance. The emphasis here is on speed: you rush through rooms in order to uncover the map inch by inch; you climb the walls and ceilings (the original Strider was inspired by the time the game designer Kouichi Yotsui was stranded on Capcom's roof and forced to climb down the side of the building to reach a fire escape) and slice through enemies with a plasma blade. To this end, most of the soldiers you encounter pose no threat and dissipate with a single slice. They are merely bumps in the road of progression, designed to momentarily slow you down in your relentless charge toward the next boss or the next secret area. Each room is also filled with health-restoring capsules and canisters; if a foe does manage to strike your body, you're able to undo the wound in an instantTo underline the point, Strider's only scoring metric is 'time taken to completion', and this total, measured in hours, minutes and seconds, is what's recorded on the leaderboards as a gauntlet for your online friends to compete against. One achievement urges players to complete the game in less than four hours, a feat only the most focused will manage by neglecting to backtrack in search of bonus upgrades and items. Unlike many Metroidvania-style games, the dystopian Kazakh City - run by the game's antagonist Grandmaster Meio - is broken into discrete maps rather than having a single, unified one. Corridors link the component areas or, alternatively, bus-stop-style stations where a spectral hawk or panther picks you up and carries you to your next destination. There's no indication on the map as to which area leads to which so, unless you make a careful mental note of the meta-layout, it's easy to become lost in the end-game when you're trying to hoover up any remaining secret items. These items are crucial to success, particularly in the game's final act when you scale a gigantic tower in order to face off against Meio - a place where the enemies are vastly stronger and, for the first time, pose a significant threat. Hiryu begins the game as a powerful force. But as you defeat bosses and gain new abilities he becomes a more flexible tool. By the game's latter stages you have such a wide variety of dashes and attacks that the potential for player expression delights. Cutting a swathe through lines of grunts before cartwheeling into the air and air-dashing vertically to latch onto the ceiling remains exhilarating even after the hundredth time.The boss battles, however, are of varied quality. At their best, they demonstrate shades of Treasure's output, with complicated AI attack patterns in which the enemy streaks across the screen one moment before creating bullet mazes for the strider to leap through the next. But elsewhere they require little more than a frenzy of button-mashing, and you race to empty their health bar before they do the same to yours. The switch from 2D to 3D assets has enabled Double Helix to create a much larger game than previous entries, but at the expense of true variety. The city looks samey throughout its various areas; no amount of colour and shade quite manages to distinguish one from the next. The team has clearly studied the Metroidvania greats, however. Twice the designers reference the inverted castle of Konami's masterpiece Castlevania: Symphony of the Night, and there are some delightful puzzles nestled in the city's cellars. ~Strider ingeniously takes the style and feel of its ancestors and uses this to decorate an entirely different type of game for a contemporary audience~There are also two 'challenge' modes away from the main storyline. Beacon Run is a point-to-point race against the clock where you must time your leaps over the heads of foes rather than engage. Survival Mode offers five stages in which you face off against waves of enemies with varying numbers of abilities equipped. Each of these 15 bonus stages must first be unlocked by finding their respective hidden item in the main game. Every Metroidvania game is a piece of ingenious clockwork, a series of compartments that must be unlocked by first acquiring the keys. There is a natural sense of awe felt as you pick its locks - an admiration of the designer who so cleverly arranged its errant cogs for you to find and replace. Strider is no different, a game that ingeniously takes the style and feel of its ancestors and uses this to decorate an entirely different type of game for a contemporary audience.Had this game been released a decade or two ago, it might have been seen as a classic of its type, alongside Super Metroid and Symphony of the Night. But today, at the tail end of a wave of Metroidvania-style games, Strider fails to stand out. It's a competent, workable game that draws inspiration from the right places, but which is rarely anything more than a cover version of the greats."}