{"ref": "https://www.eurogamer.net/assassins-creed-4-black-flag-freedom-cry-review", "date": "14 Feb 2014", "game_name": "Reviews", "text": "Remember those ~very special~ episodes of a TV series where everything becomes serious for a show? Freedom Cry feels a little like one of those - a familiar franchise tackling a particularly difficult topic. That's not to say the approach is jarring - the change befits Freedom Cry's slavery storyline - it's just surprising to find such a markedly different tone in the coda of Black Flag's swashbuckling adventure. But while Freedom Cry differs from the main game's story and themes, it remains technically reliant on the Assassin's Creed 4 mothership for everything else, and this is where its gameplay flaws remain. Freedom Cry begins several years after Assassin's Creed 4's finale and stars Adéwalé, the old first mate of Black Flag's hero Edward Kenway. (Kenway himself is back in London fathering a grumpy Templar son). Adé is now a fully-fledged Assassin with his own ship and mission, but events soon lead him into murkier waters - combating the slave trade of which he was once a victim. While the main game spent the majority of its time on the shiny new ocean, Freedom Cry offers most of its missions on land - where the series already feels most familiar. At least there's a fresh town to explore, Port-au-Prince, and a new base of operations where many of your missions begin. It's here, amongst the wooden shacks and narrow muddy streets, that you'll spend much of your time. It's also here that the game best manages to present the omnipresent horror of slavery: in the auction pens of humans being bartered for gold, around the local stocks where the screaming runaways are whipped, and in the murderous gaze of the jailers. On the lookout for escapees, these enemies will chase and shoot you on sight due to the colour of your skin.Freedom Cry certainly doesn't shy away from showing the horrors of its subject matter. One later sequence has Adé attempting to save as many souls as possible from a burning, sinking slave ship. However hard you try, it is impossible to save them all. His subsequent escape as the ship crumbles about him, its captives in cages still grasping to escape, is one of the most unsettling moments I've played in recent memory.But with the exception of that one stunning sequence, the missions are a medley of standard Assassin's Creed fare. You tail people from rooftops, you eavesdrop on conversations, and eventually you stab the bad guy in the neck. There are moments when the narrative rises above all this - usually in the well-written conversation scenes between Adé and his contact, Bastienne - but all too frequently your objective seems to be serving the list of existing mission types that Ubisoft has on its roster. Time spent at sea is again a highlight, and it is worth pointing out how Ubisoft has further streamlined all of its existing Assassin's Creed 4 systems for a quicker gameplay experience. Your ship (and Adéwalé himself) still have upgrades to collect, but many are unlocked automatically by helping out slaves dotted around the map. In Port-au-Prince you'll see map icons for small groups of slaves needing saving, but in the wider Caribbean you can save larger numbers at a time by raiding the map's plantation locations.Plantations are repurposed versions of the main game's warehouses: areas that must be infiltrated by stealth to avoid alarms, and their guards deftly picked off. There's more pressure to get things right here, though, as failure to remain hidden will see the slaves you are rescuing killed to stop them from being saved.There's a fair chunk of the main Assassin's Creed 4 map to explore on the open ocean too, although the other secondary locations are largely repurposed areas or desolate sandbanks hosting a single chest. 'Congratulations for sailing all the way over here, have a slightly better machete.' It would be hard to criticise the expansion too much for this - Freedom Cry's focus is very much on its narrative and main missions - but it's a shame that the map isn't a little fuller when you want a break from these.For a story about breaking the chains of your fellow men, this add-on's gameplay mechanics remain resolutely locked up to the Assassin's Creed framework. Its strong, self-contained narrative is Freedom Cry's greatest asset, but the tale struggles under the weight of its over-familiar gameplay. Whatever comes next for Assassin's Creed - this is the first and last Black Flag campaign DLC - it's clear this is where Ubisoft needs to turn its attention next.Still need to finish off a few fights in the vanilla version of the game? We've pulled together strategies for beating the very profitable Legendary ships of Assassin's Creed 4."}