{"ref": "https://www.eurogamer.net/call-of-duty-ghosts-onslaught-review", "date": "29 Jan 2014", "game_name": "Call of Duty: Ghosts", "text": "The moment thousands of haters have waited for is finally here. Call of Duty is wobbling. Reviews of Ghosts were more wearily critical than usual, and with sales noticeably down on those of its predecessor, it seems gamers too may be growing tired of the annual ~corridors and carnage~ formula. It's still the top dog, but the rest of the pack is nipping a little closer at its heels.Onslaught, the game's first add-on pack, captures this precarious moment perfectly. Once upon a time, just a few short years ago, a map pack was just that: four maps, packed together. In Onslaught, it's notable that the quartet of maps - three new, one classic - are no longer treated as the main attraction. They're the burger and fries in the Happy Meal. The toys that make the sale come in the form of an episodic addition to the Extinction sci-fi co-op mode and a slasher movie Easter egg.Those maps, then. Of the four, the best is Containment. Set in a ruined Mexican town, it has an unexploded radioactive warhead smack bang in the middle. The area around the warhead sends your mini-map offline, adding a little tactical wrinkle to play. Savvy players can lurk in the hot zone, essentially invisible to enemy tech, but at the risk of being picked off by similarly hidden opponents.What makes Containment my instant favourite, however, is that this prominent gimmick is just the cherry on top. It's a fantastic map in its own right, with a wide and barren riverbed flanking a tangle of streets and buildings, all offering multiple points of attack and defence. From vulnerable exposed spaces to cramped claustrophobic interiors, one of the things Call of Duty has always excelled at is slipperiness: map design with almost no dead ends. Wherever you turn, there's always at least two paths you can take, prompting split-second decisions and granting an effortless flow to matches.Containment typifies that style of multiplayer design, and uses the more interactive aspects of Ghosts to add layers on top. You can breach sealed doors to open up new routes, while other little tricks reveal themselves over time. There's a dumpster that can be pushed under a broken ladder, allowing access to a rooftop which was previously only accessible from a staircase on the other side. There's also a special Field Order that drops a mortar strike on the warhead. This devastates the area, but also destroys the nuke - the interference disappears. It's not the most dynamic feature in gaming history, of course, but it allows for a little more thought beyond the next headshot.Next best in the map roster is Bayview, which takes place in a San Francisco-styled wharf area. There are open-plan piazzas, kiosks, a seafood restaurant and an aquarium to scurry about in, with a covered pedestrian walkway curving up and around one corner. The main feature of note is a trolley bus which automatically trundles in a semi-circular fashion around the outer edge of the map. Open on one side, protected on the other, it's a fly trap for the action as it offers both a tactical advantage for shrewd players (an automated turret placed on the trolley can wreak havoc) but also a fatal lure for less intelligent players who seem to think that just by standing on a moving platform they'll somehow perform better, unaware they're essentially fish in a barrel for ruthless snipers.That feature aside, however, Bayview illustrates the core problem with Onslaught: it's a good map, but it feels familiar. Not that it specifically echoes any particular previous map, but just the feel of it, the use of space. The Infinity Ward polish is there - you can see the thought that has gone into every structure, every corner - but in gameplay terms there's a sense that Call of Duty is bumping up against a glass ceiling of its own making.Familiarity comes as standard with Ignition, a remake of the Modern Warfare 2 map, Scrapyard. The action has now been transplanted to the launch site of the Odin rocket from the single-player storyline, but the layout remains the same. It's a fine map, of course, and its Onslaught incarnation comes with a variety of themed additions. There's a test rocket that can be fired via a console, sending a jet of flame blasting out backwards. An even bigger rocket test can be earned via a Field Order, which vents the huge rocket on the launchpad, roasting anyone lurking in the tunnels under the map. Finally, there's a 60 second countdown which randomly initiates, launching a rocket in the distance which then explodes and crashes onto the map, crushing unlucky players under debris. I'm not a huge fan of the idea of reusing old maps, and I never quite understood the love for Scrapyard, but this is a fun remix all the same. Finally, there's Fog. This is the backwoods horror-themed map, which rather famously allows you to wield an axe as Halloween's Michael Myers. I have some basic horror nerd problems with this scenario - Myers is known for his butcher knife and stalks suburban Haddonfield, and this map feels more like a job for Jason Voorhees - but it's a neat example of how Infinity Ward is paying attention to its fanbase.Michael Myers has long been an unofficial game mode played by setting the weapon set to knives only and tagging one player as the killer, and this is a well-meaning attempt to make it official. It doesn't really work though, not least because Myers can only be triggered at random. It's really just a reskin of the Maniac Field Order, and while the attention to detail is fun - John Carpenter's Halloween theme is played for all players while Myers is active, and the perk can only occur once per match - I can't help feeling that fans would have more fun if the same content was more flexible and better able to be worked into custom game modes.It doesn't help that Fog is a fairly weak map underneath all the atmospherics, with a standard tangle of outdoor routes, some bland interiors livened up only by the pentagrams-and-taxidermy aesthetic, and a standard tunnel layout underneath the main house.The main draw in Onslaught is Nightfall, the first part of an ongoing expansion for the co-op Extinction mode. There's a storyline, of sorts, but don't expect to be kept on the edge of your seat by it. It deals with government and military involvement in the original Extinction stage that shipped with the game, and anyone who ever saw an episode of The X-Files will be well ahead of the curve.In theory, it means leading an assault on a military base in search of answers. In practice, it means doing pretty much the same thing you did first time around: grab a drill, attach it to alien hives, fend off waves of enemies while it does its job. Rinse and repeat. There are a few new wrinkles to the formula, namely a gargantuan boss known as The Breeder and a new enemy type that cloaks itself while jumping. There's also a new weapon type - the Venom X - which uses the same acidic poison gobbed out by the Scorpion enemies.The map itself is good one, and a lot more interesting than the original map. There are more elevated areas, more interesting secrets to find and a better flow and escalation of the action. It's still the best part of the Ghosts package, and with the addition of giant alien bosses feels more of a piece with the underrated Resistance 3 than anything to do with COD.So Onslaught is a snapshot of a series, if not in crisis, then certainly in transition. This is DLC that sticks to what has worked in the past while taking tentative steps towards a different formula in which Call of Duty is many games under one banner. Action movie, slasher horror, sci-fi conspiracy - they're all in here, and often competing with each other. Much like Ghosts itself, there's lots that's good, a few things that are great, and a lot that feels worn out and ripe for change.It's a lucky-dip DLC then, more so even than the Black Ops 2 downloads, and while that means more variety - within the narrow confines of what COD allows - it also means a lack of focus. Whatever happens, it's going to be interesting to see what the Ghosts experience looks like by the end of 2014."}