{"ref": "https://www.eurogamer.net/hearthstone-heroes-of-warcraft-beta-review", "date": "23 Jan 2014", "game_name": "Hearthstone: Heroes of Warcraft", "text": "Eurogamer's alpha and beta reviews are reviews of games that are still in development but are already being offered for sale or funded by micro-transactions. They offer a preliminary verdict but have no score attached. For more information, read our editor's blog.Pick a card, any card, and I can probably tell you what it does. Backstab? One of the rogue's finest - zero mana cost, does two damage to an undamaged minion, useful if you can buff spell damage beforehand. Knife Juggler? Love that card! 3/2, which is great value for two mana, and he tosses a knife at a random enemy every time you play a minion. Always in my deck. Ragnaros? By the time you see it, you're dead already.Two months ago, I couldn't have told you why a collectable card game was different to a trading card game, but today all I think about is Hearthstone. I wake up earlier so I can play it before work, I take lunch at my desk so I can play an extra match, I watch people play it on Twitch while I'm idling on my sofa. Blizzard's collectable card game (you can't trade the cards, see) has only just made it out of closed beta, but I'm already an addict.I'm not the only one. There are brilliant podcasts like The Angry Chicken and massive fan sites like Hearthhead with custom deck-builders and bulging wikis, while pre-release tournaments have been overflowing with entrants and beta key giveaways have brought gaming sites to their knees. Some of this is the Blizzard effect, but even Blizzard has been caught out by Hearthstone's popularity, diverting extra resources to the game's ongoing development after it stole the show at BlizzCon 2013.The fruits of that extra labour will be felt in the months to come, but the game's initial success is down to a simple, brilliant set of fundamentals put together by a skeleton team. In CCGs, the goal is to reduce the health of the opposing player's hero to nought by playing cards that represent various spells, attacks and creatures. It sounds simple, but Hearthstone's great trick is that it actually is simple. Games like Magic: The Gathering may be excellent, but long matches and unfamiliar contexts present a barrier that is slightly too high for mass entry. With its coffee-break pace and Warcraft fantasy aesthetic, Hearthstone is fast and accessible.At the start of each match, you and your opponent get four cards from your individual decks of 30, with the rest doled out turn by turn in a random order. Some cards represent creatures - called minions in Hearthstone - which are laid down to rest before becoming available to attack with in the next turn. Other cards deal direct damage, restore health or enhance spells and minions. Each turn you make a few moves and try to second-guess your opponent, dealing damage to his hero when you can and working to protect yours in between.Like all the best Blizzard games, a lot of Hearthstone's charm is in the way it looks, sounds and feels as you move through it. There's endless music to hum and individual cards have little catchphrases that you'll have to stop yourself repeating. The board itself is bookended by a rotating cast of dioramas that you can poke and prod to elicit different reactions. And the whole game is styled as a friendly pastime played out in a Warcraft tavern, where friends and enemies from across the Horde and Alliance divide go head to head for fun, slapping down cards that resound with magical energy as they strike the board.This may be a beta version of Blizzard's first free-to-play game, thrown together by barely more than a dozen people, but the production values are as high as the fantasy, and the sense of humour is as impish as anything else in the Warcraft canon.The thing that gives the game its breakneck pace is its attitude to resources. Hearthstone cards each cost a certain number of mana crystals to use, but resource-gathering is automatic - you start off with one mana crystal and then gain one more for every turn after that until you have a maximum of 10. It's a simple idea that dictates the pace of each match, as early sparring and simple exchanges give way to more elaborate gambits and crushing ripostes later on.Your first few hours will probably be spent unlocking each of the nine character classes by playing against the AI. The game is already fun at this stage as you start to puzzle out the basic rules of engagement and get your head around concepts like charge (any card with charge can attack as soon as it is laid down), taunt (minions with taunt have to be attacked first) and battlecry (special abilities that are activated as soon a card is played). As you tour the classes, you also get to see their hero powers - class-specific abilities that you can use once per turn.It won't be long, though, before you're encouraged to venture online, and once you make that jump the game only becomes more exciting. Every match brings new highs and lows, new cards to admire and unlock as you level up your character class, and new ideas about how to play the game. You'll probably start by focusing on board superiority, trying to outgun your opponent with strength of numbers, but before long you'll be thinking in combos, laying down specific cards to amplify the effects of others.Then you'll start building your own custom decks. Each class has their own set of starter cards that push them in particular strategic directions, and teasing out the best ways to combine those with the larger pool of neutral cards that can be used by any class is a deep and satisfying time sink. Fill a rogue's deck with magic-enhancing cards like Kobold Geomancer and Azure Drake, for instance, and her class-specific spell cards suddenly do much greater damage at critical junctures.I never imagined I'd have the patience or skill for deck-building when I began playing but, like everything else in Hearthstone, the process is fast and entertaining from the start. Part of this is the ~Suggest a card~ feature, which nudges you in sensible directions. Part of this is the rush of excitement when you realise how a new card could work with others. A lot of it is that each match lasts 10-15 minutes, so you can quickly see what works and doesn't. There is an art to deck-building, but you can enjoy it whether you're finger painting or working in oils.The game is great at finding opponents of similar skill levels, whether you're playing ranked matches (tougher bouts where you gain stars and rank up as you progress) or casual (useful for testing out untried decks or just playing for fun). You can also battle anyone on your friends list, which provides experience points, although you can only earn gold against strangers.Gold. The elephant in the room is Hearthstone's business model: it's free-to-play, supported by micro-transactions. But at this stage it seems to be one of the good guys. You unlock a steady stream of new cards to round out your starter decks and neutral card collections just for playing against the AI, friends and strangers, none of which costs any money. You can also sacrifice duplicate cards or cards you don't want by grinding them into dust, which can then be spent on specific cards in crafting mode, although anything decent is pretty expensive.Gold comes in when you want to buy expert packs - five random cards, one of which will be rare or better - and these either cost 100 gold, or you can put in real money to buy packs in different quantities, such as seven packs for £6.99. Gold is doled out in various ways. You get 10 gold for winning three online matches and you get bigger bonuses for completing quests (win two matches as priest or rogue, etc) that grow more elaborate as you level up. Everyone's mileage will vary, but by the time I felt like I wanted to put in real money to stand a better chance of obtaining legendary cards and other rarities, I'd spent more time in Hearthstone than most games I buy at full price. Its financial demands haven't felt unreasonable to me.There's also a mode called Arena, which is slightly different to everything else in Hearthstone. The first go is free, after which it costs 150 gold or £1.49 to enter, and you can't use your own decks. Instead you construct a deck from a sequence of suggested classes and cards. You then take it into battle. Three defeats and you're out of the Arena, but if you can build up a winning run then you earn a clutch of rewards, including an expert pack. If you're good enough, you're also likely to win enough gold to go back into the Arena immediately without paying real money (although this wasn't always the case).Having spent dozens of hours playing Hearthstone during the closed beta, there are a few things I'd like to say about proper Hearthstone etiquette for anyone starting out.1. It's always nice to say hello. Communication in Hearthstone is limited to six emotes that you can choose between by right-clicking on your hero. Start with Greetings. (And don't bother spamming Threaten, because the other player will just right-click on you and squelch your emotes, leaving you to whistle obscenities into the wind.)2. If you've been smart enough to manoeuvre yourself into a winning position, don't show off by putting down all your remaining minions, stomping on your opponents' or heaping on buffs and spells. Just get on with it. The other player is respectfully letting you finish the job rather than choosing to concede, so return the favour. It's nice to say Well Played, too.3. Don't concede unless the other player is being a dick. Not only is this a nicer way to play, but there's always the possibility they will miscalculate something and fail to finish you off...Since you can't predict what you'll be offered in Arena, you have to decide carefully or risk ending up with an unbalanced deck. On the plus side, if you learn to make enough good decisions then you may end up with a killer one, boasting quantities and combinations of cards that are impossible elsewhere in the game. I spend most of my time drifting between experimental decks in Casual and trying to level up with trusted decks in Ranked, but Arena is always a refreshing change of pace.Of course, Arena rewards and even the ranking system are things Blizzard may choose to tweak further as the Hearthstone beta evolves, and given the rapid expansion of the development team these modes are also likely to be joined by others. We've already heard about Adventures, smaller add-ons that will infuse the game with new cards and allow players to play co-operatively against tougher AI adversaries, and there will be full-blown expansions as well, similar to World of Warcraft.However, Blizzard has been careful so far only to tweak things where it feels most necessary. That's good, because CCGs like Hearthstone might be easily disrupted by regular card changes that have seismic repercussions for strategies across the game. In the closed beta, Blizzard has changed the values of plenty of cards, but it has generally waited to see whether players would discover tactics to get around popular gambits before taking any action, and only shut down things that make the game less fun to play - like mage freeze decks that make it impossible for the other player to do anything.Everyone playing still has a pet hate - prior to the most recent patch, the loudest complaints were probably for Pyroblast-obsessed mages - but the truth is that the balance is already extremely good, and keeping up with trendy play styles - what CCG veterans call 'the meta' - and howling about cheap tactics and overpowered cards is all part of the fun. We don't have these arguments about games we don't love. And as more cards and modes are introduced, the game is only going to become more interesting and lovable.Like World of Warcraft was all those years ago, then, Hearthstone feels like a game in a hurry. A simple game with fantastic depth and a shifting balance that always keeps you guessing, the players who first embraced it are still working their way through the initial possibilities, while the developers race to stay ahead of them and make sure the game remains a wonderful and exciting place for the new players who join in their wake.So far, they seem to be doing a great job, and even if they were hit by a bus tomorrow, the Hearthstone that enters open beta would still be a game I would encourage everyone to tear through. If they keep it up, though, there's a very real possibility that Hearthstone could do for collectable card games what World of Warcraft did for MMOs.Eurogamer's alpha and beta reviews are reviews of games that are still in development but are already being offered for sale or funded by micro-transactions. They offer a preliminary verdict but have no score attached. For more information, read our editor's blog."}