{"ref": "https://www.eurogamer.net/holovista-review-a-dark-and-dazzling-critique-of-social-media", "date": "16 Oct 2020", "game_name": "Reviews", "text": "As a super nerdy writer, the thing that I seek out most in games these days is quality writing, regardless of my own abilities. Some of the most interesting work in recent years has come from iOS games, particularly as they try to imitate the casual flow of instant messaging. One notable favourite of mine is Guildlings, a cutesy-looking adventure game that animates conversations brilliantly.HoloVista takes this approachable nature to a whole new level. You play as Carmen, with your iOS device acting as the protagonist's personal phone, communicating with friends and family through messages and social media. Carmen's an aspiring architect who's finally grabbed a rung on the career ladder at a prestigious but secretive design firm.The vapourwave aesthetic of this world is incredible, from bright neon to deep pastel colours. However, almost nothing is in motion in the game except for you and your words. The action is propelled by what you capture around you using your phone's camera, whether it's your apartment bedroom or in the fancy foyer waiting for your job interview. These images are then shared and discussed, either passively or in depth, with your friends and dear sister Inez.Here is where HoloVista really shines, showing a reflection of the performative nature of public social media posts and our constant need to maintain an ~image~. It doesn't help that Inez is an ~inspirational~ yoga aficionado, or that your friend and fellow architect Jazz is out shaking things up in the industry, both gaining hundreds of more likes per post than you.The story plays with this as you join your new firm, where you've been asked to take pictures and notes of a mysterious mansion for your first assignment. Things keep getting stranger as you progress and make connections with the objects placed in every room. Everything is beautiful, intentional and meticulously crafted.This role you perform is an indictment of how image-conscious businesses today seek to exploit any form of authentic personas we display for their own gain, which is made very clear early on during your assignment. In fact, the story's flow mimics real life very well. Each new environment, or ~scene~, is explored, captured digitally and then shared for all. In HoloVista, this performative behaviour is not just about the vacuous world of social media, but of capitalism itself: we have to look pretty, buy pretty things, surround ourselves with them and either stay positive or just shut the fuck up.It might sound like nothing new to a lot of us, but there's greater depth aside from the incredible style from Aconite. The world of HoloVista takes place in the near future, so we're able to witness a believable form of how much more technology will have changed us. But because it's a story about how people haven't fully meshed with technology itself, it focuses on how we've yet to deal with the consequences of the current technology around us, particularly our social interactions. It's both fascinating and alarmingly prescient."}