{"ref": "https://www.eurogamer.net/nes-remix-review", "date": "17 Jan 2014", "game_name": "NES Remix", "text": "More than any other video game publisher, Nintendo understands the power and value of its own heritage. Amongst its rivals, rumours of careless curation abound: Sega has reportedly lost the source code to its much-lauded Sega Saturn RPG Panzer Dragoon Saga, while OutRun Online Arcade has slipped from Xbox Live's servers, never to return.Nintendo's vaults, by contrast, are carefully maintained and, it has to be said, regularly plundered. As such, the audience for repackaged, digitally enhanced versions of its early titles diminishes by the year. Most people looking to relive the formative video games of their childhood will have done so by now, perhaps many times over. Meanwhile, new recruits to the cause probably see few reasons to return to rudimentary games on whose foundations so many of Nintendo's current titles riff and build. Once you've touched the farthest reaches of the Super Mario Galaxy, backed by an orchestra, is there really any reason to return to the greys and pips of Super Mario Land?NES Remix is a canny use of Nintendo's earliest assets, then. Despite appearances, it's not a game that particularly trades on nostalgia. Most of the potential audience won't have played the original NES games that it draws upon for its vignettes and trials, all of which appeared prior to 1990. Even if they had, none of these games are playable in their entirety. The most you get is a single Super Mario Bros. stage here or an Excitebike race there - and even these are usually mirrored, subverted or altered in some irreverent way. Everything has been pulled apart, poked and prodded into new shapes. There's something of the brevity and impudence of WarioWare here - one stage even has you race against the clock to simply pick up Link's master sword in The Legend of Zelda, a challenge that appeared in this exact form in the first WarioWare - although the structure and delivery is a little more pedestrian.Each of the game's multitudinous stages is grouped according to the game from which it originates. You must complete the first in the set to unlock then second and so on. Each stage is graded against the clock: one star if you scrape through before the timer empties, up to a trio of 'rainbow' stars if you manage to complete the challenge in an unusually short amount of time. Stars are collated and, when you've collected enough, unlock new NES games and 'stamps', 8-bit sprites which can be used to illustrate the messages you leave for other players to read.The challenges are initially straightforward, teaching you the basics of the NES game in question: burst an enemy's balloon in Balloon Fight, stomp on a Goomba's head in Super Mario Bros., scale a platform in Ice Climber. As they progress, the difficulty of the challenge increases: complete a lap of Excitebike without a crash, jump over ten barrels in Donkey Kong, score a hole-in-one in Golf. In this way the designers lead you on a carefully plotted journey towards mastery of the original game, where players in the 1980s would have been required to find their own way, or look for tips and strategies in the back pages of magazines.The disjointed repackaging of these NES games in the contemporary Angry Birds style (ideally suited for those with a short attention span) is enjoyable enough, particularly for the first few hours of play where the incentive to replay each challenge until you've won the maximum number of stars remains keen. But the most interesting aspect of the game is found in the Remix levels, which create new and unusual challenges by subverting the original games' mechanics or even squishing together assets from disparate titles. In one stage you must complete World 1.1 from Super Mario Bros. in a mirror version. Another challenge replaces Jumpman with Link in Donkey Kong, so that you're unable to leap barrels and must instead cringe on ladders until a pathway to the top of the scaffolding opens up. A Donkey Kong Jr. Stage throws the level into total darkness apart from a single spotlight on the character, while another turns Super Mario Bros. into a delightful auto-runner in which your goal is to collect a set number of coins. Other stages merely complicate the presentation: the camera zooms outwards while the image repeats across the screen, the action growing more distant as the clock runs down.Freed from the original games' rule-sets, the design team is able to twist and play with novel and contemporary ideas. Having taught newcomers the classics and broken them down into their component interactions and verbs, it then breaks the rules. The formula is proven and understandably delights.But in time, fatigue also creeps in. Unlike WarioWare, with its magnanimous variety and humour, NES Remix relies more on the element of surprise than visual absurdity. Its palette of base materials is also far narrower and, as a result, its challenges soon blur into one another. By the time you reach its greatest challenges, the drive to perfect your technique for the highest reward will, for all but the most tenacious and dedicated player, have been greatly diminished.Despite the range of games on offer (everything from motocross to pinball) there is an inevitable sense of repetition, perhaps because the original games themselves were, behind the artwork, less distinct than they first appeared. As with many reconstituted products, NES Remix is immediately delicious, but inspires an obsession that it can't sustain for long."}