{"ref": "https://www.eurogamer.net/assetto-corsa-beta-review", "date": "16 Jan 2014", "game_name": "Assetto Corsa", "text": "You can't usually tell much about a developer from where they set out their stall, though it's certainly tempting to try. Polyphony's old offices used to overlook Tokyo's Route 246, a stretch of public road the Sony-owned developer would go on to immortalise in its Gran Turismo games, while Turn 10 operates within the watchful gaze of Microsoft's campus in Redmond, Washington. The location of Assetto Corsa developer Kunos, though, feels like a much more pointed statement of intent: within earshot of the sinewy Autodromo Vallelunga Piero Taruffi some 20 miles south of Rome, it's a place that's drenched in an endearingly Italian brand of octane.So it's hardly surprising when a lot of that bleeds into its work. Assetto Corsa's a very Latin breed of racing game, where flamboyance is met with a certain style - two traits that are in short supply when it comes to PC driving sims. It's not exactly hard to find a decent driving game on the PC right now, but the problem is they're all very serious. There's the slightly stuffy façade of iRacing, beyond which lies competitive racing above and beyond anything else in the genre. It takes dedication to extract that side of it, though, its MMO-like subscription met by an MMO-like demand for hours upon hours of rigid practice.ISI's rFactor 2 is no more accessible, although its rewards come elsewhere: the developer's focus on making a professional grade simulator fit for purpose at factories and race teams across the globe leaves little room for players looking for simple weekend kicks, although it's a perfect foundation upon which the dedicated community has patchily crafted a broad church of motorsport disciplines.There's a gap, then, for a slightly less fussy and much more welcoming driving simulator on a platform that's missed out on the approachable thrills of Forza Motorsport and Gran Turismo. Kunos, who were previously behind netKar Pro, has been smart to identify that space, and with Assetto Corsa it's begun to fill it with a conviction and creativity that belies the relatively small size of its team. Assetto Corsa does more than stand toe-to-toe with the likes of Forza and Gran Turismo - even in its unfinished state, in some areas it leads the way.Released on Steam Early Access late last year, Assetto Corsa's a superficially slim offering for the £29.99 outlay. There are approximately 20 cars and 11 tracks featured right now, and very little to do with them beyond simply drive.  Currently there are no fully populated AI races and no multiplayer options - though they're both high on Kunos' priority list for updates that have, since release, rolled out regularly enough. So you're left with just hot-lapping, arcade-style time attacks where you race against a ticking clock, or drag races and drift trials. The enforced purity works, though - since its release, I've spent just as much time with Assetto Corsa as I have with any other driving game out there, and I've had twice as much fun. All you can do is drive in Assetto Corsa right now, but thankfully that driving is exemplary. It's debatable whether Assetto Corsa's handling model is the equal of Gran Turismo, Forza or iRacing - the pursuit of simulation in games can often be misleading, and more often than not it's a simple matter of personal taste - but it's obvious where the strengths of Kunos' system lie. Send a stock BMW E30 M3 into one of Mugello's arching curves with a little too much self-conviction and the fade and subsequent sharp descent of adhesion is deliciously fed back through the handling, little chirrups in the audio and warbles through the steering wheel communicating where the cliff edge of grip you're trying to dance across lies. Tyre modelling is Assetto Corsa's strong suit, and it's one it explores and exploits well. Different compounds are available to different cars, and there's a more thoughtful mix than the standard selection of sticky soft boots or glassy hard ones. The 90s BMW comes as with stock 90s street tyres that are suitably slippery, and pushing them above and beyond their limitations is where some of the real fun lies. More contemporary street tyres offer up more grip, while if you just want to feel the chassis and suspension flex, you can bring them all to sharp attention by strapping on a pair of semi-slicks.It's enormous fun to experiment with, and it's perfectly possible to lose half a dozen hours or more with a single car around a single track. Every driver will likely find their own poison (and there's a wonderful write-up on Ravsim about exploring the joys of the E30 M3 around the twisting Magione circuit that's well worth a read), and I've found my own in taking the ferocious Ferrari F40 around the sweeps of Mugello. One of Maranello's most primitive and enthralling creations, the F40's an intimidating ride - you'll learn to live in fear of its twin turbo kicking in, and on anything other than semi-slicks, it's near undriveable. But that's where the real fun lies: when it slips out of your control and starts dancing to its own beat, the tail-end waltzing away to a ditty of V8 barks as you try to bring it back in line with the throttle. Assetto Corsa's simulation helps it all along the way - clutch control is well implemented, and with an H-shift it's a joy to kick too many revs to the rear wheels to get a slide going. Even in its unfinished state, there's a variety that matches the likes of Gran TurismoIf that all sounds terrifying, then frankly it is, but Assetto Corsa's still less intimidating than its PC peers. There are assists that blunt the difficulty, as well as the feel, but even without them it's possible to engage in heroics without too much dedication. The Lotus 49, Colin Chapman's softly-sprung F1 delight that introduced the Cosworth DFV to the world, is more approachable here than it's ever been before in the digital world, and there are none of the nasty surprises in its simulation that iRacing and Grand Prix Legends smuggled in to their own replicas. A couple of laps in and you'll likely be able to hold onto powerslides and engage in the kind of busywork behind the wheel that made legends of Clark and Hill.It's all part of one of the more wonderful things about Assetto Corsa - even in its unfinished state, with no real racing and a diminished track-list that's understandably Italian-centric, there's a variety that matches the likes of Gran Turismo and Forza. There's the godly P4/P5 Competizione for high-end GT action, the Formula Abarth for a taste of downforce, and a spread of sportscars for more everyday thrills. The 20-odd cars that Kunos has currently curated have a breadth that suggests the numbers game Polyphony and Turn 10 are drawn into is a little hollow.Assetto Corsa soundly trumps its more established competition elsewhere, too. Its front-end is, somewhat surprisingly for a driving simulator, slick and fluid. The best thing that can be said for any menu is that it feels invisible, though if you want to dig deeper then it's clear that Kunos' system of filters and tabs has been exquisitely thought through in order to not obstruct you from the business of driving. There are options implemented here that are still shocking in their absence from other big-hitting driving games: cars are available in stock mode, where the traction control and ABS settings mirror that of their real-life counterparts rather than you having to resort to fuzzy guesswork to get a genuine simulation of any given vehicle.The road ahead for Assetto Corsa remains long, but from its already excellent starting place it can only get better. Damage, AI and multiplayer should be along shortly, accompanied by a steady drip of new cars and tracks - the LaFerrari and McLaren P1 are on their way, as is the Nurburgring in a paid-for expansion due towards the end of the year. Already, though Assetto Corsa is worth getting in on - not just for what it promises in the future, but for what it delivers today."}