{"ref": "https://www.eurogamer.net/descent-journeys-into-the-dark-review", "date": "2 Jan 2014", "game_name": "Reviews", "text": "Price: £50 / Players: 2-5 / Time: 120 minutesThere's a feeling I get about once a month. It arrives stealthily, as if I were coming down with something, and it's this: I'd love to play a proper campaign of Dungeons & Dragons.Can you imagine?! You and your friends, celebrating each slain villain with a clink of beer bottles. Screaming in tandem at a die result. But most importantly, playing a game of shared authorship where every character and adventure is alive, and can surprise everyone. Or if you'd prefer, just imagine a BioWare RPG so flexible that you can have sex with anything.But these days, it's just not a practical fantasy. Who has the time to learn the craft of the dungeon master, that most esoteric of gaming's roles, part game designer and part custodial calculator? Who has friends who can commit to showing up on a regular basis?So let's look at Descent: Journeys Into the Dark, a board game that's best summed up as Dungeons & Dragons lite. Which is to say, Dungeons & Dragons, but actually playable.Descent substitutes imagination for a wealth of glossy components, with full, satisfying sagas available right out of the box. It ignores D&D's literal rulebooks for a straightforward tactics game. And perhaps most wisely, it condenses campaigns into 40-hour treks. In doing this, it leaves intact the most immediately appealing aspects of D&D - you're still sat at a table with your friends, howling at dice, amassing items and powers, and watching a plastic miniature the size of a thumbnail develop a personality.It's a timely, tempting offer, and this actually ignores Descent's most exciting trait, which is that it brings the Dungeon Master player in from the cold. Never mind entertaining the adventurers, like a worrisome host serving orcs instead of tea. Never mind delivering timely treasure or funny NPCs. Descent's ~Overlord~ has a simpler remit: crush these would-be heroes like grapes. Finally, justice prevails, and not only does the Overlord get to level up, he gets to try and win. Working with the monsters on the table, limited reinforcements and a devilish Overlord deck (the cards of which might afflict a monster with dribbling rage or spring a trap), the Overlord always has their own objective in every one of Descent's unique encounters.As to the game proper, it started strongly in 2005's first edition, and was evolved thoroughly for the existing second edition. Essentially, it's all about speed. Characters bolt around a grid-based map, working to synergise their skills and command line of sight in a way that will be familiar to anyone who played XCOM. Rather than offering wars of attrition, though - a ceremony which is reserved for your campaign's finale - Descent is about time.Perhaps the Overlord's winged dragon minions are trying to grab swords from the armoury and escape into the night. Maybe the heroes are trying to escape through a mountain pass that's slowly caving in. Coupled with a fabulously evocative ~fatigue~ mechanic, where heroes can spend one of these precious tokens to run just a little further, or pull off an exhausting special move, Descent often becomes implausibly dramatic. All of a hero's fatigue can be recovered if they spend just half their turn catching their breath, but there's just never the time, making Descent's pace seem scarier than any of its monsters.All of which makes Descent a modern adaptation of the most stodgy, nostalgic tabletop game of all time. What makes it joyous, though, as opposed to simply being smart, are the little things. About 496 of them, to be precise. Components are publisher Fantasy Flight's wheelhouse, and this is among the finest boxes they've ever produced.It's not just that the miniatures are full of anima, the cards glossy, the dice pleasing. It's the variety of the thing. Playing a full campaign of Second Edition will absolutely leave you feeling that you got your money's worth, but you'll only have seen half of the heroes, half of the hero classes, and a little over half of the adventures. And if you want to take your Descent game to the next level, and treat it as an indulgence? Oh, my goodness.There are already three expansions out For Descent Second Edition, each of which adds more of... well, everything, filling it with more monsters, dice and cards, expanding the wilderness of the game. Just in the base set, Descent offers something new with every adventure. With the expansions, though, it becomes a thing of absurd luxury, where every fork your game takes will conceal as much content as it reveals.As with most of Fantasy Flight's in-house designs, this degree of ambition causes problems. Chief among these is that Descent's variety, its asymmetry and the way it actively helps winning teams can cause it to feel unbalanced whenever one side wins a few games in a row, as there's never a chance to go back and correct your mistakes. And if it doesn't always feel robust, it certainly won't if any particularly competitive players get their hands on it. Where D&D had adventurers prodding every cobblestone in the dungeon with a 10-foot pole, Descent has Overlords that park Hellhounds sideways in corridors or combining the fastest class with the fastest hero with the party's best equipment to make a medieval cruise missile.But if you play Descent with people who want nothing more than to enjoy it? If the heroes do a little role-playing in their tactics, and if the Overlord knows when to go easy on the heroes so as not to ruin the evening? If you play nicely with your toys, Descent will surprise you, thrill you, reward you, and most importantly, let you experience 40 hours of intense gaming come down to a single roll of the dice. And for all that gaming has evolved D&D since it first came out, there's nothing better than that.Quintin is the editor of Shut Up & Sit Down, a board game review site. Visit it for more coverage of this strange cardboard realm."}