{"ref": "https://www.eurogamer.net/rocksmith-2014-edition-review", "date": "13 Dec 2013", "game_name": "Rocksmith 2014", "text": "More often than not, video games attempt to approximate real-world activities that would otherwise be too perilous, expensive, physically demanding or scarce for us to enjoy. As we push light around the television screen with our thumbs, we catch something of what it might be like to fly a fighter plane a few feet above the ocean, to tilt a Ferrari around the Nürburgring's lingering corners, to miss a penalty for England, to shoot Hitler in the balls or, in the case of Shenmue, to work a fork lift shift down at the local docks. We know that the video game versions of these activities are only a faint echo of the real thing, but the thrills are sufficiently representative to compel our attention. Konami's Drummania and, more recently, Harmonix's Rock Band stand apart. For the video game drummer there is no abstraction from the instrument to the game: the game is playing the drums. Skills learned in one domain transfer without friction to the next. Ubisoft's Rocksmith series is a serious and laudable effort to do for bassists and guitarists what Rock Band 3 did for drummers.There is no Fisher Price-esque plastic peripheral here to help you pretend to be a rock star in front of your television; rather, you connect your own instrument to the system via a USB lead and begin to learn the authentic guitar parts to a slew of well-known songs. Ubisoft says that the game offers ~the fastest way to learn guitar~ and, while that claim is impossible to test, what's clear is that with the right mix of talent, dexterity and dedication, Rocksmith 2014 will make a musician of you. Skills learned here will translate onto the stage or recording studio.While there's no need for an amplifier (the game expertly models numerous amps and effects pedals to recreate the specific guitar tones featured on six decades' worth of tracks) you will, however, probably need to adjust your console's set-up. A foldout poster included with the game lists the optimal hardware set-up. Unfortunately for many, the now-standard HDMI cable for video and audio offers the worst option. It introduces the greatest amount of lag between striking a note on the guitar and the output being played on screen and through your speakers. Ideally you will need to split the audio signal through a separate amplifier, but a component lead works adequately, reducing lag to a workable level.Ensuring minimal lag is of paramount importance. Rocksmith 2014 presents more than 50 tracks, everything from Bob Dylan to Slayer. As you start learning a new song, you're tasked with playing a meagre handful of notes from the song. Hit these correctly and, while you're still playing, the game will introduce more notes, adapting the complexity to your skill level. If there's too much lag, then the game will likely interpret you as having missed these notes, and it will be impossible to progress in your learning past a certain point. To be absolutely clear: only buy the game if you are willing to adjust your TV/ audio set-up from an HDMI connection. No matter what your skill level as a guitar player, there is an additional learning curve to be mastered in reading the game's idiosyncratic notation. Notes travel down a stave in the Guitar Hero style, but with six different coloured strings and a camera that whizzes up and down the on-screen depiction of a guitar neck, it can take a while before sight-reading becomes instantaneous. Once mastered, however, the notation reveals several benefits over standard guitar tablature: sustained notes are drawn with lines as long as the note must be held; vibrato is expressed with a wobbly mark while bends are shown as physical curves. The game comes with a bevy of instructional videos go teach you everything from how to attach a strap to the guitar through to advanced techniques such as pinched notes and tapping. Many of these lessons are interactive and will repeat until you have mastered them. Even so, in the more challenging songs with fast runs, very few players will be able to sight-read their way through. Rocksmith 2014's 'Riff Repeater' tool - vastly overhauled from the debut game - is a masterstroke here. It slows down a challenging section of a song and removes some of the notes, building up in speed and complexity as you successfully master each run. Everything is automated so there's very little wading through menus to be done here. The game simply identifies the sections with which you're struggling and leads you through them step by step.This automation is one of the game's most powerful assets, and is what distinguishes it from most guitar tutor software. Select a new song to learn and the game will pick out three challenges that will aid your learning, adding a game-like tinge to progression. Comic relief is provided by a slew of retro arcade-style mini-games in which you must, for example, play certain chords in order to shoot down alien spaceships, or escape a pursuing police car by playing Phrygian scales. Each mini-game in the Guitarcade has its own high score table and online leaderboard. Once learned, the songs themselves can also be approached as if they were Guitar Hero levels, with scores for accurate playing and multipliers for successful combos.It's unusual to find such a niche interest release lavished with so much care and attentionThe generous and useful feature list doesn't end here. A magical 'Session Mode' allows you to select a particular style of drummer, bassist and keyboard player, set a key and a musical style and play over the top of the virtual band's backing. The band (who seem to be at their most comfortable with the 12-bar blues) will even follow your lead in terms of their energy and volume, and this area of the game offers a wonderful playpen for those who want to experience an approximation what it's like to play with other pub-rock level musicians. Finally, the full range of Marshall and Orange amplifiers, speakers and an assorted range of effects pedals can be used to create your own guitar sounds which can, in turn, be used elsewhere in the game (or to try out different options without the fuss of visiting a local guitar shop). The modelled tones aren't as crisp and authentic as the real thing of course, but it's an admirable approximation nonetheless.Rocksmith 2014 is a towering achievement on console, sitting somewhere between instructional software and rhythm action game. The kinks of the initial release have been stomped out for this sequel and the improvement of Riff Repeater and inclusion of  Session Mode prove invaluable. It's unusual to find such a niche interest release lavished with so much care and attention. PC players may be better served by more serious software such as Guitar Pro, but even there, those looking for a softer, more approachable tutor will find tremendous value in the game. Rocksmith 2014 joins that small club of video games that imbue their player with a truly transferable physical skill."}