{"ref": "https://www.eurogamer.net/tv-review-how-videogames-changed-the-world", "date": "10 Dec 2013", "game_name": "Reviews", "text": "Woo! We're on the telly! That was the general mood among gamers on Saturday night when Channel 4 broadcast Charlie Brooker's feature-length documentary on the importance of video games. This mood probably had a little more resonance for the likes of our own Ellie Gibson, who really was on the telly as one of the many expert and celebrity talking heads, but gaming is so rarely given coverage on TV, and so rarely is it covered well, that it was hard not to feel like we were all along for the ride.In terms of format, the show stays true to the proven Channel 4 countdown template (not to be confused with the Countdown template) which seems a little obvious, but actually works in the film's favour when you consider that the ultimate goal was not just to entertain existing gamers, but to introduce non-gamers to the key texts in our beloved medium. In that context, the mixture of chronological history lesson and Top 25 list actually dovetails rather neatly.As an ancient retro gamer who can remember far too many of the games included from the first time around, I found the documentary at its strongest in the early stages as it chronicles the birth of the arcade, video and computer game industry. The games chosen - Pong, Space Invaders and Pac-Man - are all indisputable classics, but the advances from year to year were so vast in those early days that the case for each is easy to make. From Pong's primal simplicity, a game anyone can look at and intuitively understand, to the stark dread of Space Invaders' metronomic descent and the rudimentary AI of Pac-Man's ghostly pursuers, it makes for a delightful potted history of a familiar but always enjoyable story.This structural strength continues for most of the film, which uses key games from the past to illuminate the present before hopping back in time for the next entry. The cult curiosity of Parappa the Rapper leads to a brief diversion into the subsequent evolution of music games, while the subtle guilt-inducing arc of Shadow of the Colossus allows for a tangent discussing this year's Papers, Please - two games united by a common feeling rather than any gameplay elements.Not only is it a pleasure to see relatively obscure titles like Parappa and Colossus given the spotlight, but it also illustrates the shrewd writing behind the show. The countdown list format rarely allows for much in the way of truly enlightened commentary, but the script - co-written by Brooker with games journos Cara Ellison, Matt Lees and Jon Blyth - keeps finding these organic little wormholes to wriggle through, making fresh connections and finding interesting parallels.The games are well chosen, too. Sega's execrable Night Trap is in there not for its quality but for the shift it marked, both in gaming's use of cinematic techniques and the controversy it evoked. The debate over violence in games is acknowledged without allowing it to dominate, and gaming's rotten history of sexism is also laid bare. Not in a sexy way, obviously. It is as thorough an exploration of a medium as you could reasonably expect in 90 minutes.The array of interview subjects and commentators is also excellent, with the occasional creator on hand to talk about their work but also a fine selection of journalists and celebrities. What's notable is that nobody seems to be there just for the sake of their profile. Even the most famous faces - Jonathan Ross, Peter Serafinowicz, Dara O'Briain - are all taking part because they clearly love games and have something to add. Not all the inclusions make sense though; maybe one day we'll learn exactly why Children's Laureate Malorie Blackman appears only once, to tell us that World of Warcraft players piss in bottles.As for the list itself, there's not much point nitpicking over the inclusions - especially as they are almost all perfectly chosen. It's only towards the end that some entries begin to feel perfunctory, or the limitations of the format start to show. Call of Duty: Modern Warfare feels like a reluctant inclusion, there for its ubiquity rather than any real merit. There is a glimmer of commentary, from Eurogamer contributor Quintin Smith, on the way levels such as Death From Above present realistic depictions of atrocity as entertainment, but you'd need an entire documentary to really dig into that topic.It's also interesting to note that The Last of Us earns a place in the list for representing the ~HBO drama boxset~ mentality of today's classier blockbusters, but is only represented by emotional cut-scenes rather than the many hours of gameplay in which the player mutilates and mangles hundreds of enemies. Personally, I would have swapped it out for Telltale's The Walking Dead, as not only does it follow the episodic model of TV, but it also effortlessly outclasses TV's own attempt to adapt the same source material. As ever with these lists, it's hard not to play a little armchair editing of your own.But what of that hyperbolic title? Does the documentary really show that video games have changed the world, let alone how? Well, yes and no. It certainly makes a good case for gaming as a vibrant entertainment medium that deserves wider recognition, even if our cultural gatekeepers are unlikely to see the artistry in smacking each other around in Street Fighter 2, but it's sometimes unclear just who the film is really aimed at. Certainly, the Jon Snows of this world are unlikely to have been convinced by the argument that allowing people to inhabit the role of cartoon characters in fantasy worlds is an indicator of cultural worth.There's an element of salesmanship to the show, a sense that it's making an editorial case for games rather than simply exploring them for a neutral audience. That comes across most obviously in Brooker himself, who made his name with savage, merciless and hilarious takedowns of TV tropes. His scabrous wit isn't fully unleashed here, and when he does let fly with a few barbs, they're generally aimed at targets around gaming rather than gaming itself. It's as if he knows that gaming needs a little gentle shepherding into the mainstream TV spotlight and doesn't want to hobble his own intentions by directing his familiar sarcasm at the subject.How Videogames Changed the World ends up having to provide the answer to every question regarding games coverage on TV, simply because nobody else has bothered to tryThere's also sure to be debate around the final entry on the show's countdown list: Twitter. This, Brooker argues, is the way in which video games have truly changed the world: by introducing gameplay mechanisms into our real lives via social networks. It's certainly a valid thesis, if a little thin, but the leap required to tag it on  to the end of an otherwise focused list is too large. This isn't to get bogged down in the whole ~what is a game?~ debate, but even the show's contributors all agree that Twitter is only like a game, with points swapped for followers and retweets. It feels more than a little like pandering to the non-gamers out there: here's that thing you know, and it's like a game, really!But that in itself only highlights the bigger problem here: trying to fit every aspect of a multi-faceted medium into an hour and a half of light-hearted factual telly. That Brooker and his team pull it off at all, and make it fun and informative in the process, is nothing short of amazing.But much as Lara Croft was for years the lightning rod around which all discussion of women in games revolved, purely by virtue of being the only notable example, so How Videogames Changed the World ends up having to provide the answer to every question regarding games coverage on TV, simply because nobody else has bothered to try.So while the show is a success in almost every immediate respect, to truly have achieved its mission it needs to have opened doors - even by a crack. Why aren't we seeing games like The Stanley Parable being discussed on arts and culture shows, where they belong? Why will those shows seek out the latest obscure filmmakers, novelists and songwriters, yet remain blind to valid works that are created in computers and controlled with the mouse? And why are game reviews in broadsheet newspapers still stuffed away in the technology section rather than filed under entertainment alongside their natural peers?Those are the questions that need to be answered. Charlie Brooker has laid the groundwork, but let's hope he's started something bigger, and not just provided another one-off curiosity that fails to shatter the niche.Charlie Brooker's How Videogames Changed the World is available to stream on 4oD for the rest of this month."}