{"ref": "https://www.eurogamer.net/the-legend-of-zelda-a-link-between-worlds-review-2", "date": "29 Nov 2013", "game_name": "The Legend Of Zelda: A Link Between Worlds", "text": "Back in the early 90s, I swear it took me at least a month of focused effort to work my way through The Legend of Zelda: A Link to the Past. And what a month I had. A month of navigating Hyrule and its dark twin, of pulling swords from stones, of collecting bottles - nabbing the last one from that guy sleeping under the bridge - and of sticking it to hideous fiends in a pyrotechnic tennis match. The Triforce was eventually united and ancient evil was sealed away, but at what cost? I'd missed four whole weeks of Clarissa explaining it all.By contrast, I blasted through A Link Between Worlds in two or three days. This isn't that surprising really: it's a shorter, swifter game for starters, but I've also come to understand the way Zelda works over the years. I've learnt the lessons of Link to the Past. As has A Link Between Worlds. In fact, it's learnt them pretty thoroughly.Even by the standards of a series as backwards-looking as Zelda, this latest trip to Hyrule is astonishingly eager to walk in the footsteps of former games. A Link Between Worlds looks like it was put together in haste, and so beneath its rather sheeny, squishy 3D art, it borrows not just the Hyrule map from A Link to the Past, but the structure tied to that map. The overlapping worlds conceit returns - with you moving from one dimension to the next to solve traversal puzzles, like a sewing needle dipping in and out of cloth - as do a handful of famous moments and more than a few classic bosses.The dungeon line-up features the same names for the most part, even if the interiors of these places have been extensively redesigned around the existing themes, and many of the best Link to the Past items will soon be waiting for you in the tantalising slots of the equip menu. Sure, Zelda's always drawn some of its magical power from a strong sense of deja vu, but at times A Link Between Worlds comes very close to feeling like a vague reimagining of the SNES classic rather than a sequel in its own right.If there's a real victim of this, it's the overworld stuff. Granted, it's still enormously entertaining to move between Hyrule and its shadow - this time called Lorule - as you take on a villain who wants to trap seven sages inside paintings and raise Ganon from his dark slumber once more. The thrills of genuine discovery, however, are replaced with the quieter pleasures of rediscovery.On top of that, despite the fact that a return to the top-down view makes for a Zelda with peerless controls, the whole process of trading dimensions isn't as intricate as it used to be. Lorule feels a lot smaller than its Link to the Past equivalent, and less riddled with mysteries. Actually, you'll find it fairly simplistic in terms of puzzle implementation even if you never played the original adventure. In 2013, a Zelda game is a lot more streamlined than the wonderful and sometimes inscrutable treats offered in the last century. (It's a lot uglier, too, which is just bewildering, really: the 3D approach taken here is surprisingly naff, with murky, lumpy textures and only a few moments - ice looks pretty good - of even faint prettiness.)On the plus side, though, those redesigned dungeons offer a prolonged sequence of absolute delights. Cripes, they're good. If this really is Zelda produced at something of a clip - Zelda designed on the back of a napkin - at least it's actually taken something positive from the whole process. It's Zelda delivered with a breeziness and lightness of touch that's been missing from recent instalments - perhaps because they had so many new wrinkles of their own to introduce. It's Zelda without any kind of slog, too, and where each dungeon - while hinging on themes and individual moments that will be familiar to Link to the Past vets - is shaped by a lithe economy as it captures a handful of brilliant ideas perfectly and then moves you on to something else. These refitted dungeons mint quite a lot of their gold from the game's one really big new idea. Link can now turn himself into a portrait when the need arises, shifting from 3D to 2D space as he flattens himself to a wall and inches past otherwise impassable obstacles. This is how he can slip between Hyrule and Lorule: by posting himself, Flat Stanley-style, through a series of stained-glass letter boxes. The whole thing also adds an ingenious twist to puzzles and combat as you pop gantries away from their moorings to open new paths, cross gaps, stealth your way around guards, and even duck away from an enemy's attack at the very last second. Then there's the game's smaller new idea, too, as A Link Between Worlds overhauls the way the series parcels out its gadgets. Rather than collecting a key item deep inside each dungeon, you can now rent - or eventually buy - almost all of them from a central shop before venturing into the world. Most of them are available from about an hour into the campaign, too. Don't fret: this isn't here to bog you down in virtual micro-transactions. The rupees come thick and fast and the prices are generally pretty low. Rather, renting's in place to allow you to approach the game's central dungeons in almost any order. Each will give you a fairly clear prompt as to the kit you'll need to complete it, but you genuinely can slice your own path through the game for the most part, even switching between different hurdles, if you want, on the rare occasions when you get stuck.This means that the chests you find inside dungeons have lost a little of their thrill - they often contain only rupees or the monster parts that tie into a new potion-crafting system - and there's just something a little deflating about a hero waddling into battle after what amounts to a trip to Cash Converters. Where it really counts, though, it feels like a pretty smart idea. It acknowledges that the hookshot and the boomerang are no longer sources of massive, earth-shattering surprise to players, they're simply Link's tools and - in the absence of a whole bunch of entirely new items, which would be lovely - the surprise comes from the inventive way you're going to get to use them.More importantly, when it comes to that invention, the new approach lets the developers build tricks around an item from the very minute you step through a dungeon's doors. It makes for coherency and a potent kind of creativity. Take the sand rod, for example, which allows Link to conjure columns of earth from the ground. Over the space of a few minutes, this has been used for crossing gaps, walling in foes, lofting turrets out of range (or into position), pulling burrowing enemies from the earth, and uncovering buried treasure - and that's before you throw in Link's new ability to turn 2D. It's by no means alone. The hookshot gets its own moment in a glorious reinvention of a truly legendary Zelda temple, the fire rod brings a crystalline world of frosty platforming to vivid life, and even the humble lantern gets its time in the limelight, via a temple of shadows and visual tricks where every step is a potential pitfall.~It's often been said that A Link to the Past is a game set inside a puzzle. That means A Link Between Worlds is buried at least two layers deep, as it's a game set within A Link to the Past~Beyond all that, the new item system adds a welcome element of threat to one of the easiest Zeldas in recent memory, since rented items go back to the shop each time you die. This in turn ties into another new focus: fast travel from anywhere on the map to a series of specific waypoints. And fast travel, to be honest, is more of a mixed blessing. Your taxi is a wonderfully grumbly witch and her broomstick, which is all typically charming, but while hopping about cuts down on backtracking - particularly when you're going to and fro from that item shop -  it may also be a key reason why the overworlds themselves don't make as much of an impact as they normally do. You don't really have to spend that long in them as the adventure progresses. Sure, the time you do spend there is wonderful, of course, filled with memorable side stories and oddball characters, but this is ultimately a flying visit - a flying return visit - rather than a prolonged holiday in Hyrule.It's often been said that A Link to the Past is a game set inside a puzzle. That means A Link Between Worlds is buried at least two layers deep, as it's a game set within A Link to the Past. But that's both the pleasure and the pain of Zelda, isn't it? A tale endlessly retold, wrongs endlessly righted, a map endlessly tweaked and embellished and folded back on itself. If, heaven forbid, this was the last Zelda ever, I couldn't think of a more fitting tribute to the series' strange ritualistic preoccupations than this cheerful, slight, and ultimately rather strange game. It won't be, of course - and that's more than fine, too."}