{"ref": "https://www.eurogamer.net/crimson-dragon-review", "date": "21 Nov 2013", "game_name": "Crimson Dragon", "text": "You couldn't tell from its unappealing looks, but Crimson Dragon's heritage is sublime. The work of producer Yukio Futatsugi, its roots stretch back to 1995's Panzer Dragoon, itself a continuation of a form birthed by Sega with 1982's Buck Rogers: Planet of Zoom and, more famously, the brilliant Space Harrier.It's a form that has evolved in some odd, fascinating ways since Futatsugi's Saturn original: in developer Team Andromeda's hands, it became a majestic, soaring role-playing game with Panzer Dragoon Saga, while elsewhere at Sega it was transmuted into the strange and beautiful Rez by Tetsuya Mizuguchi and his team at United Games Artists. Most recently, Mizuguchi would return to the form again in 2011's Child of Eden, a heavenly successor to Rez that introduced Kinect motion control. When Futatsugi first announced his new project with developer Grounding at the Tokyo Game Show in 2011 - it was known as Project Draco back then, part of a small collection of Japanese-developed games for the then fledgling Kinect - it was easy to get excited. Here was a game that would take the unobtrusive motion control of Child of Eden and meld it together with some of the deeper RPG elements of Panzer Dragoon Saga. The prospects for the spiritual return of one of the Sega fan's most cherished series looked good. There are times when the fusion works. Manabu Kusunoki, artist on the first trio of Panzer Dragoon games, returns for Crimson Dragon, reunited with original composer Saori Kobayashi, and their partnership again conjures up visions of Hayao Miyazaki's Nausicaa as scored by Joe Hisaishi. It's a fantasy world that's at once surreal, cruel and regal - colossal termite hills burst out of lakes patrolled by soaring dragons, while forests see luminescent fruit blossom under impossibly tall trees. Beneath Crimson Dragon's fantasy there's even a tug of sadness - you're part of a colonising force of humans who have chanced upon an alien world, and who then go about capturing and controlling its dragon inhabitants. It's a cruel perch you explore the world from, then, but for all the power of the vision - and of the Xbox One - it's never sold as well as in any of its predecessors. Crimson Dragon is an ugly game. Like Quantum Theory and Shadows of the Damned before it, it's another Japanese title that struggles with the Unreal Engine, and even the added grunt of Microsoft's new console does little to elevate it above that gruesome pair. Textures are smeared while the frame-rate lurches. This is an on-rails shooter in which the rails judder and creak like a jittery old ghost train. Since publishing this review, Futatsugi's announced the balancing of the credit and XP system would be addressed for launch in a day one patch. It's a step in the right direction, but as it's the lack of fidelity in control and muddy visuals that hold Crimson Dragon back from being a worthy successor to its inspirations we've decided to leave the review unaltered.It doesn't help that the controls judder and creak in unison. There's not much precision in targeting the reticule - it feels as if that got lost somewhere in the game's transition away from Kinect to a traditional controller - and it's not helped by dual stick control that's sloppily implemented. The right stick swoops your weapon sights across the screen, while the left moves your dragon clumsily in the foreground, his inelegant body crashing constantly into obstacles and the walls of projectiles enemies throw your way. It's a far cry from the smooth spray and fire of Rez, Child of Eden or Panzer Dragoon Orta - and it's all a little too reminiscent of the shaky Saturn originals. Crimson Dragon does, though, sidestep the criticism of many an on-rails shooter by offering depth. Indeed, beneath the fireworks lies an absolute mess of systems. Levels are limited in number, but they're designed to be ground through for more credits and more XP that can, in turn, be spent on upgrading weapons, skills and wingmen. Some of this works well and offers a surprisingly intricate RPG lattice. Wingmen can be recruited, and in the heat of battle you can command them to protect your rear or fight out front. Having them by your side also unlocks access to a limited-use smart bomb attack, the perfect weapon for clearing screens on the many occasions when the skies of Crimson Dragon become too thick with enemies and their firepower.A thin and troubled tribute to the original Panzer Dragoons, slim on the ambition and art that made its predecessors what they wereDragons can be nurtured, Pokemon-style, being fed items to help them grow, or having new weapons placed into their one available slot. The weapons are variations on genre staples - there are screen-sweeping lasers, little flurries of rocket fire or lock-and-release missiles - and they're fun to tinker with. They can even change attributes between elements, suggesting a depth that Crimson Dragon's gameplay doesn't quite deserve.The intricacies are lost in the bluntness of battle. There is, as ever, a pleasure in returning to a level in order to chase down an S rank, and Crimson Dragon's smart to present its missions in small, digestible chunks, neatly paced with soothing interludes before the crescendos of chaos arrive. When they do, though, it's too easy to be overwhelmed or, even worse, frustrated by the lack of fidelity in the control. There's the option to grind, of course, and come back to levels with more firepower at your fingertips. And if you don't want to grind, you're covered by micro-transactions, with Crimson Dragon's economy another facet of Microsoft's bold redefinition of free-to-play gaming. Grounding's been wise to tone down the implementation, though, and they're at least perfectly possible to ignore in the pursuit of progress. Crimson Dragon's got other, bigger problems, though, and like the wave of games it was announced alongside - Diabolical Pitch, Steel Battalion, Haunt and Rise of Nightmares - it's a disappointment, even if it's one that was postponed to the new generation of consoles. It's a thin and troubled tribute to the original Panzer Dragoons, slim on the ambition, vision and art that made its predecessors what they were - and some way short of the invention and execution in the games they inspired."}