{"ref": "https://www.eurogamer.net/eldritch-review", "date": "18 Nov 2013", "game_name": "Eldritch", "text": "What's the true mark of a good Roguelike? Permadeath? Procedural generation? Dangerous loot? I'd argue that it's something else, something that emerges from all these elements. In a good Roguelike, things can go wrong for you very, very quickly. Catastrophe takes flight and grows huge teeth. Misfortune develops a fearsome work ethic.Misfortune definitely punches a clock in Eldritch. Sure, it's not actually that difficult to complete this dark-hearted dungeon dive with the current balancing, but you can rest assured that when any given run starts to fall apart, calamity will be swift and comprehensive. Take the other day: I'm tooling through a horrible palace of sandstone, feeling pretty good about things. Up ahead I spy a lizard. The lizard spies me. He starts to run. I start to shoot. In fact, I'm spamming the trigger like an idiot. All five bullets wasted - I was eating a muffin at the time -  and I accidentally chuck my gun at him too. Then I accidentally chuck the other item in my two-slot weapon inventory. It's dynamite - bouncing off a wall and right into my lap. This was obviously not what I had planned.But that's Eldritch for you - a sweetly toxic blend of Lovecraft, Minecraft, Spelunky and BioShock. Those are some strong influences right there - those are some bold, rich flavours. Thankfully, Eldritch is able to draw them all in and emerge distinct and characterful in its own right. It avoids the typical pitfalls of video game maths.Still, that maths isn't bad is it? From Lovecraft, Eldritch gets its milieu - an unspeakable shadow world of fishmen, snaggle-tentacled Cthulians and general cosmic wretchedness. From Minecraft it takes a suite of procedural 3D dungeons made from nice chunky blocks, all of which can be destroyed if you have the right weaponry with you. From Spelunky, from all Roguelikes, it draws a form of permadeath - quite a mild one - along with a focus on making sure its disparate systems stitch themselves together tightly. Finally the 'Shock series - which designer David Pittman worked on - offers the old one-two: weapons in one hand, magic in the other. Two triggers, eight tentacles, and many thousands of ghastly reasons to meet a miserable demise.And yet Eldritch isn't miserable. From a gorgeous hub library, you set forth into nasty worlds conjured from the pages of strange books. These worlds are always slightly different each time you visit them, but they have their inherent flavours, their unchanging quirks, and there's a thrill to exploring them in 3D, dropping yourself into holes, navigating odd clumps of rock. The first world  is stony and bleak but a bit of a cakewalk, kicking off by lobbing you a friendly compass (it points the way to the exit) and then gifting you a run of easy foes and plenty of options for scavenging.After a few levels of that - time which is best spent learning how surprisingly agile you are, with lean and slide moves thrown in alongside ducking and running -  the second world's an absolute nightmare: towering wraiths that can't be killed, statues that attack when you aren't looking at them, velvet drapes that clash terribly with the tiled flooring. It's a shift to the back-foot - you're still carrying weapons here, but it's best to try and get through quietly, relying on swift movement and keen instincts - and it's an utter relief to make it to the third world. Except the third world's even worse. Kind of. It's certainly greener. Ick. And are those eyeballs?What ties these places together are a handful of mechanics that create enough problems to keep you thinking. Not that you'd realise this at first since, if anything, Eldritch initially seems a little undernourished. Weapons range from guns and knives to bombs and tripwires without ever going anywhere too exotic, while the items you can pick up to aid you in other ways are equally straightforward: stealth boots, jump boots, keys, healing packs (these come with a serious price attached). There's magic if you can find the shrines that grant it, and it too offers basic treats like teleportation, the ability to conjure bricks, and the option to turn enemies on their wretched friends. Speaking of which, even the roster of wretched fiends is fairly limited: screaming, split-headed snakes one minute, wandering Miro sculptures the next. They'll crumble under a few blows - with a few notable exceptions - but they'll kill you with a couple of chomps, too.These sparse elements are brought to life by a kind of energising scarcity, though. Your money is also your mana pool, for example, while you have but one slot for each type of gear - amulet, backpack, or shoes. If you want the amulet that allows your gun to blow holes in walls, for example, and you do want that because it's insanely useful, you'll need to ditch your compass. Which is also insanely useful. If you want teleportation, you're going to have to sacrifice a natty ability to lure foes towards you with a knock. ~Eldritch uses a blocky art style, silly sound effects and a surprisingly forgiving level of challenge to summon the kind of creeping dread that H.P. himself would be delighted with - if he was ever delighted with anything, the massive racist~And this kind of inventory cut-throatedness works beautifully within a game as fast-paced and compact as Eldritch. Every piece of good fortune is also a knotty strategic brainteaser in waiting. Each trip to the shop - and, yes, you can kill the shopkeeper - is a potential headache: This or that? If not these, then what?Keeping things moving is a kind of permadeath lite: die and you lose everything you're carrying, but you can bank any money if you find the right chests scattered throughout the caverns, and you also unlock each level for good the first time you finish it. This is useful if you want to practise specific sections, and yet Eldritch is also quick to enforce a completionist approach overall. Each time you expire, the levels may remain open, but the orbs you've collected from them are snatched away again.For all its borrowings and influences, all its sleights and feints, Eldritch's dark alchemy ultimately lies with the way it uses a blocky, cheerily primitive art style, silly sound effects and a surprisingly forgiving level of challenge to summon the kind of creeping dread that H.P. himself would be delighted with - if he was ever actually delighted with anything, the massive racist. Despite the chirpy fishmen, mumbling necromancers, and generous platters of revivifying roast beef, prolonged exposure to this strange, chunky world proves authentically oppressive. You won't be oppressed for very long, perhaps, but you'll have plenty of hard choices and brilliant misfortunes behind you by the time you make it to the end - and, after that, there's a way to make your second playthrough much less forgiving. Settle in, then. Embrace this eternal library of ancient horrors. Turn the pages and venture out to strange lands where awful creatures slither and hop. You'll be glad you did - not that gladness is a terribly appropriate emotion here."}