{"ref": "https://www.eurogamer.net/batman-arkham-origins-review", "date": "25 Oct 2013", "game_name": "Batman: Arkham Origins", "text": "As a young studio best known for porting Batman: Arkham City to Wii U, WB Montreal must have been desperate to prove that it belongs in the same conversation as series creator Rocksteady Games. To its credit, it's hard to tell that Batman: Arkham Origins isn't one of its sister studio's earlier releases. That's some achievement, but it's also a mixed blessing.To begin with, the set-up is as economical as Arkham Asylum or Arkham City. Batman is thrust into Gotham on Christmas Eve after Black Mask puts a $50 million bounty on his head and invites eight super-villains to town to compete for the spoils. As with previous Arkham games, that simple set-up then evolves as Batman races to keep up with events.Arkham Origins doesn't leave the strongest first impression though. After a CG cutscene and a short playable prologue in Blackgate Prison, Batman is dumped into a sparsely occupied Gotham that looks tiny on his Batcomputer map compared to some of the open-world playgrounds we've run around in lately. You're free to travel across it all from the start, but players used to maps dripping with icons may be surprised at its cold emptiness.This isn't a game that lacks depth, though - it's just a game with rare patience. Story missions take place away from the streets in carefully knotted set-piece levels built around single locations - like Penguin's hidden casino-cum-arms-bazaar or Gotham City Police headquarters - and as you make progress the open world gradually fills up with distractions.The initial slow burn is welcome, anyway, because it's an opportunity to luxuriate in the wonderful systems and mechanics that Arkham Origins inherits from its forebears. Batman glides through levels even when he's just walking around, those famous bat ears erect with authority, and he moves fluidly in a crouched run, too, barrel-like thighs pumping him from shadow to vent. But when you start actually gliding, it's a minor revelation, opening his wings to the wind and using the grapple to grasp the edge of a distant chimney, reeling it in and launching him over the crest to continue his flight.We had all this before, of course, but you forget how good it was. The same goes for Batman's many gadgets. You start off with quite a few - batarangs, smoke pellets and explosive gel for blowing holes in walls - and of course you have detective vision, the sonar view mode that maps Batman's surroundings so he can track enemies as they move nervously through the darkness around him. You gain other toys at intervals, including the remote batclaw for setting up tightropes between particular grapple points.Batman remains handy in a fight, too. In hand-to-hand combat, a single attack button allows him to flow between targets, ducking and diving through dense matrices of incoming blows, repelling those that threaten to land by reaching for the counter button. It's still quick to build combos, and the final blow, which the game always puts into slow motion and frames up nicely, often has a satisfying crack to it.The one thing Batman still lacks is a gun or grenade to deal with unsuspecting groups of enemies from afar - he can either wade in with his fists and gizmos or try to isolate and pick them off using stealth - but of course that's the point of the character. There is still a slight frustration though that the game often forces you into direct confrontation rather than letting you choose your own approach, especially as tougher enemies arrive with riot shields, knives and body armour to inject complexity into each fight.Still, that is what Arkham Asylum and Arkham City did, so at least it's canon. As is the way the city starts to fill up with intriguing diversions. The Riddler is back, of course, custodian of unlockable fast-travel points that can only be activated when you break into them. This often involves hopping around adjacent buildings examining the exterior of your prize, like a high-tech octopus feeling around the outside of a bottle to reach the fish inside. Enigma has left his mark in other areas of Gotham, too, and you'll be on his various trails all night.He is probably the highlight of the side missions - again, as usual - although he's far from alone in the dark night. Anarky is fed up with Gotham's corrupt rulers and plans to deal with them somewhat more explosively than Batman, so that's a thing, and there are various other threads to follow once secondary characters - friends and foes - present themselves.So it's fun crawling over Gotham. It can still feel slightly empty at times - you'll never see a pedestrian who isn't a cheesy thug or a trigger-happy SWAT team member - but among the dark rooftops, smokestacks, red brick facades and Ace Chemicals billboards there emerges plenty to do, and I am loath to scold a game for rebelling against the fad of instant gratification. Besides, some of it is there from the start should you be paying attention. There are a host of character-building challenges to complete, for example, by doing things like performing certain combinations in combat or gliding through rings dotted around the city. These tasks are just sitting there quietly listed in one of the pause menus.The one area where Arkham Origins truly distinguishes itself from Rocksteady's work, of course, is the part of the game that UK studio Splash Damage developed: multiplayer.In Arkham Origins' online mode, three of Bane's mercenaries face off against three of Joker's gang across four maps, fighting over capture points and trying to kill the opposition until they no longer have any Battlefield-style respawn tickets left and can be wiped out.As well as limited-use knockoff versions of Batman's see-through-walls detective vision, and loadouts that can be customised with unlockable weapons and abilities such as an explosive RC blimp, each team can also call on their master when they hit a certain threshold. Bane has powerful melee attacks, while Joker has a pair of pistols good for one-shot kills and spamming explosives.The biggest twist, though, is that two other players control a third team of heroes. Yes! Someone gets to play as Batman! (And Robin.) The heroes have a suite of predatory tools including grapple hooks and various batarangs and can stalk their prey from underground passages as well. They are rewarded for performing a variety of takedowns.Despite the competing objectives, matches are simple to understand and often draw to a nervous conclusion, as Bane and Joker's teams run out of respawn tickets and try to pick each other off while the heroes circle. If a player takes out a hero at this stage, their downed team-mates retake the field, while heroes who die in this endgame lose much of their score.Things can yo-yo very quickly, and while this can mean that the preceding drama feels as though it's more for show than anything, it's tense and exciting every time, and really does result in gang members waving their guns around at the shadows in terror, just as it should.It's a fair amount of fun, then, but it's also the kind of mode you will enjoy for an evening rather than a lifetime. Taken on those terms, it's a welcome inclusion.They also feed into Batman's tech tree, although this is one of the weaker areas of Arkham Origins. Batman is already well outfitted and his most useful additions - like the shock gloves, which allow him to power up electrical items and rain fizzly blows down in combat - are rewarded for making progress in the story, so I generally just invested my XP in tougher armour, which is a bit boring. Tech trees where you find yourself rooting around for the least uninspiring upgrade are always disappointing, but doubly so when you're playing as a billionaire vigilante who can afford to do and buy whatever the hell he likes.One area that perhaps could have given the tech tree something to think about is the game's most noticeable new feature: the bits where Batman reconstructs crimes. I don't mean he walks around pretending to get stabbed or shot while someone narrates events in a concerned tone. He uses detective vision within a small crime scene area to locate clues, analysing them and creating digital reconstructions of events that he can then walk around, fast-forwarding and rewinding, until he finds additional evidence. It's a neat gimmick, but really Batman does all the thinking and you just watch out for red icons. It would have been nice to see this developed further.I wouldn't call it a trend of dumbing down, but Arkham Origins also owes less to the Metroid and Castlevania schools of backtracking for secrets than its predecessors. There are a few things you will need to mark on your map and return for, but gone are the days of eyeing up question marks on the map and getting excited about going back later. This contributes to a sense that the game is less layered than Asylum or City, despite the charms it does have.That's particularly acute in the story missions, which can be spectacular but are often linear romps from fight to puzzle to a room full of vents where you can strut your stealthy stuff. It's a testament to the robustness of Rocksteady's mechanics, which are remarkably slick considering their age, that you will probably still consume it all so hungrily, but despite the high production values thrown at even the most innocuous corridor, when you exit into yet another arena or another atrium, there is also a feeling of going through the motions.Those motions also include frustrating boss fights, it should be noted. I don't know whether there's something in the water in Montreal - the local Eidos studio famously outsourced the Deus Ex boss fights, which were so bad that fixing them became a headline feature of the Director's Cut - but the balancing feels wayward here. An early battle with Deathstroke is a war of attrition, the toughest boss in the game, after which they get progressively easier.At least the characters themselves are handled deftly. This series has always played it straight and dark, preferring to use the exaggerated proportions and superhuman skills of its protagonists to add chaos and magic to the spectacle, where Christopher Nolan had to content himself with gunpowder, pencils and rampless jumps. I'm no expert on the source material, but the result feels like more of a comic book personality than a film.And that works here too. Arkham Origins isn't Batman's origin story - it's the series' - and it lives up to that billing. Batman starts off as a tough, uncompromising anti-hero, who shuns every potential ally, but he grows over the course of the game, and he's not the only character who goes through a compelling transformation before we end up where Arkham Asylum starts. A few scenes are a little overcooked, but voice actors like Troy Baker and Roger Craig Smith chew on fun lines rather than the expensive scenery and it all reaches a satisfying conclusion. WB Montreal deserves credit for that, and for delivering a game that recaptures a lot of what made Arkham Asylum and Arkham City so playable.In truth, though, what Batman: Arkham Origins really recaptures is the solid middle of an Arkham game - the combat, the traversal, the little stealth arenas, the open-world puzzles and side missions - without really offering any highs. There's no batcave-on-Arkham moment, no shark in the museum. Perhaps the developers were too focused on not breaking all those wonderful toys, or perhaps they were bound to a tight deadline, but the game feels slightly flat as a result.Then again, if Arkham Origins proves anything, it's that Batman on a normal day is still better than most games on their best."}