{"ref": "https://www.eurogamer.net/pes-2021-review-pro-evo-ends-the-current-generation-in-mid-table-mediocrity", "date": "25 Sep 2020", "game_name": "PES 2021", "text": "PES 2021 is a funny old game. Not a proper, brand new PES, but a season update, essentially the same game as last year's effort but with up to date lineups and a cheaper launch price of £25. Developer Konami had signalled as much, wisely managing fans' expectations in the same breath it promised to hit the PlayStation 5 and Xbox Series X hard with a new game engine in 2021. I certainly respect Konami's decision, and hope FIFA publisher EA takes note. But goodwill notwithstanding, PES 2021 the product is a bit like Spurs: lacking major signings and with no real hope of challenging for the title.The upshot is PES 2021 is not really worth writing home about. It's last year's game although, thankfully, not last year's game as it was when it launched. PES 2020 had serious gameplay issues when it came out, many of which I covered in our review. In the year since, many of these wrinkles have been ironed out by patches, and so PES 2021 fares much better at launch. It's hard to tell where exactly PES 2021 takes its PES 2020 gameplay cue from. I've seen some say they feel the gameplay is much improved, but I found it hard to tell much of a difference. Perhaps the players are ever so slightly more responsive than they are in PES 2020. Perhaps there are subtle tweaks to the shooting. It feels all players take a heavier first touch, so you always have to be mindful of how you receive the ball. The goalkeepers are perhaps a touch more reliable. But only the most hardcore of PES fans will notice any difference.Which means PES 2021's gameplay is pretty good! Beautiful, at times, even. It's a slower, more realistic game of virtual football than FIFA, and it looks and feels fantastic when a silky move ends in a goal. I've said this before, but it's worth saying again: PES' ball is wondrous. It steals the show, coursing through the air like a ballet dancer leaping across the stage. PES' ball feels grounded in real-world physics, travelling in hypnotic arcs inspired by cosmic orbits. I get more satisfaction from passing in PES than I do shooting.Despite this, frustrations linger on. The referee is just as maddening as he was last year. He'll blow a foul for nothing, stopping play even when you've retained possession and are through on goal, but he seems allergic to his whistle even when carnage is staring him in the face. I've smashed into players, fouling so despicably that my opponent - sometimes opponents - fly into the air, their limbs warping to form shapes Cthulhu would be proud of. And the ref jogs happily on, seemingly oblivious to the bloodbath that surrounds him. This issue is especially pronounced in the box. I don't think I ever won a penalty in PES 2020 and I haven't won one in PES 2021 so far.Players still sometimes abruptly stop for no apparent reason after you try to pass to them. This doesn't happen often, but when it does happen it's pretty annoying. Players also have the annoying habit of sometimes getting in each other's way, bumping together like children in a playground. Skipping remains a turgid affair. PES can't seem to decide whether the X button or the Options / Menu button should be used for progression. Sometimes it's both. And the menus are still awful, as they were last year, and the year before, and for as long as I can remember.The commentary is terrible. Again. I've never turned the sound off a video game quicker than when I started PES 2021. Master League has a handful of new real world managers to pick from but other than that it's exactly the same as last year, and so we must skip all those pointless cutscenes with dialogue choices once again. MyClub is essentially the same as before: a budget FIFA Ultimate Team with horrible loot boxes. And, like last year, players already have stunning teams made up of incredible players just a day into the game's life.It's a real shame PES has lost the San Siro, perhaps my favourite Italian stadium, and AC and Inter Milan alongside it to FIFA. Konami managed to nab Roma, and it's still got the exclusive on Juventus, but there's no getting around the fact PES is in dire straits when it comes to licenses. Yes, I know option files are available, but not on Xbox.And here's a special mention for PES 2021's biggest fan: my PlayStation 4. I'm not sure what PES is doing to my PS4 under the hood, but the gremlins are making a hell of a racket in there.So, as an overall package, it's hard not to think of PES 2021 as mediocre, as its predecessor was, as many of the PES games have been on the current generation of consoles. The release of PES 2021 feels like an appropriate time to assess Pro Evo's time on PlayStation 4 and Xbox One, and I'm afraid to say I think the franchise has had a rather forgettable seven years. Despite flashes of brilliance (PES 2017 is a highlight), Konami hasn't quite managed to create a world class football video game on the FOX engine. It's a real shame.Perhaps it's more interesting to think about PES 2021 in terms of what it could mean, rather than what it is. Does this season update offer a glimpse into the future of annual sports games? For years fans have complained about having to pay full price for a brand new football game each season when all you really get is a roster update, the odd new licence and a handful of gameplay tweaks that are never as meaningful as the marketers make them out to be. Could PES 2021 represent a new way of doing things? Could Konami sell a full price PES 2022 - what will be a brand new game on new consoles - then for the rest of the generation sell season updates to existing players at a reduced price? Alongside the removal of loot boxes and the addition of a battle royale-style battle pass, this is my ideal situation.One can only hope! For now, I'm not sure PES 2021 is worth forking out for if you can option file PES 2020. But if you don't have PES 2020, PES 2021 is a decent shout at a decent price. Onward to the next generation!"}