{"ref": "https://www.eurogamer.net/tactical-intervention-review", "date": "30 Sep 2013", "game_name": "Tactical Intervention", "text": "Press X to roll out of the way of explosions! Press F to wave at hostages! Press forward to drive a car, and F to pick up the briefcase! And, I guess, if you get the time, left mouse button to shoot some people. The actual multiplayer shooting of this multiplayer shooter is swampy in sensation, and takes a back seat to pointless, game-muddying additions. Players can use dogs to attack or 'sniff' the enemy - presumably incapacitating them with icky pooch nose goo - or pick up propane canisters and lay them strategically around the level, only to curse your planning as an opponent sprints past and kicks the the impromptu bomb back into your face. Weapons lack Battlefield's bite or Counter-Strike's imagined authenticity. It's this latter game that Tactical Intervention invites closest comparison to, and not just because it looks like a game from 2003.Tactical Intervention is born from the mind of Counter-Strike creator Minh Le - the result of the self-named Gooseman attempting to make a game that goes further and deeper than the simple CS could at the time. His new game borrows its predecessor's terrorist-on-counter-terrorist bloodbaths, but the things CS got so right - precision, tactics, consistency - are lost.Weapons feel wildly different from match to match. Assault rifles can be terrifyingly accurate over distance, even during whole-clip sprays. At other times, you'll struggle to hit the skybox aiming upwards. Movement, too, is unpredictable. I'd get stuck on corners as I tried to skirt around them showing the least of my body to enemies lying in wait, or skip over curbs I'd thought would require a crouch-hop. Ping is the biggest problem. Tactical Intervention has servers in Europe, Russia and the US, but they're almost always near-deserted. You're stuck joining populated servers if you want a game, no matter how far from home they might be. Even then, the few players I've spotted playing on their home turf are struggling against oddly huge latencies: I never once saw a player dip below 100ms for extended periods of time, with most stuck around 150ms for the duration of the matches.This makes player models jerky, difficult to anticipate, and often downright strange. During one team deathmatch on the game's Dynasty map, my terrorist team-mates spawned with counter-terrorist player models sat on their shoulders. They stayed there throughout the match, carried around the stage like armour-clad toddlers on their dads' backs. Besides being unnerving, it also made spotting and shooting real enemies a nightmare.Especially when enemies come from all angles. There's none of Counter-Strike's clever map design on show here, and invisible walls are everywhere across the six playable stages. The Flash Metro map is particularly bad for this, some areas of smashable glass looking exactly the same as impassable walls fringed by forcefields. Battle lines are messy and difficult to articulate in play. Team coordination is difficult without an easy means of communication - I heard only one mic-ed up player during my hours with the game, and he was singing a Russian song - so both sides resort to milling around wherever the mood strikes them. It plays closer to Call of Duty than Counter-Strike: get the drop on an unsuspecting player and you get the free kill. This is more true in team deathmatch - one of the game's two modes. The other is 'mission,' and by providing both sides with a job to do, it manages to keep battle lines a little more coherent. Not that coherency makes for tactical battles: the opposite. Mission maps often task one team with staying inside the boundaries of a marked zone, targets for the attacking team to wipe out with a frontal assault.Shopping Mall and Construction Site both park terrorists in a small room with wantaway hostages, leaving counter-terrorists outside, trying to get in. Hostages wander in and out of firing lines, forcing you to ~wave~ them back into cover by pressing F. When the shooting starts, this process feels like herding giant cats - except cats would surely know to avoid the loud exploding noises going off just behind their ears. No such luck for hostages, who'll saunter into firing lanes just for fun. There are no tactics for terrorists here beyond hoping that your hiding place is sturdy enough and you've guessed the door your enemy's coming through.Most baffling of all is Highway, a mission that gives both teams a car and asks them to fight over the safety of an AI-controlled VIP. Highway is always stupid. The VIP waddles like a poorly-stomached duck, the terrorists are followed by a suicidally low-flying helicopter, and the car physics were programmed by someone I can only assume had the concept of ~cars~ described to them one morning while they were very sleepy. It's an oasis of madness in a desert of grind and frustration, but the concept of getting ~better~ at a mode so unpredictable and graceless is inconceivable. Highway's so bananas that it almost makes Tactical Intervention memorable, but its chief appeal is its payout in confused laughter, not its nuance or depth. Yet this game has a complex inventory and progression system, and rewards consistent playtime and success with both increased ranking and in-game currency. This pretend money can be used to buy new weapons and cosmetic items, including new guns, outfits, and those deployable dogs.Real money can be used, too. Tactical Intervention is a free-to-play game, and is supported by comparatively cheap, but still egregious micro-transactions. Guns cost around 5000 to 7000 game points. You'll earn that in a day of solid playtime, but the weapon you purchase will only hang around for seven days. If you want access forever, you'll need to pay a more monstrous 20,000 or more game points, necessitating days of grinding before you get a new toy. Of course, you could skip the grind - for a fee. An AK is yours for £7.48 - and why not pair it with a 45% decrease in your team deathmatch respawn time? £1.29, but you'll only be able to use it for 7 days. Gloves are the money-grubbiest of optional purchases: six pairs, mostly indistinguishable to all but the keenest-eyed hand fanatics, for more than a quid a pop. There are no direct weapon power perks, but buffs such as reduced respawn time or an increase in killstreak rewards make paying players unequivocally better than vanilla free-to-players. It's a bonus that Tactical Intervention doesn't feel truly pay-to-win, but a large chunk of that comes from how chaotic and confused the game is at a base level: unlike Counter-Strike, it's not balanced well enough to know when someone has bought a minor advantage. What balance there is in Tactical Intervention is precarious at best. Mechanics have been piled on mechanics - ideas the game's creator always envisaged adding to his first game before Counter-Strike was firmly thrust into the hands of its community. This is the second time Tactical Intervention has launched, having had its servers shut down once by previous publishers OGPlanet. Without Counter-Strike's solid foundations of tactical movement and consistent shooting, and with a vestigial pay-to-win economy, Tactical Intervention feels in danger of toppling over again."}