{"ref": "https://www.eurogamer.net/coolsons-artisanal-chocolate-alphabet-review", "date": "23 Sep 2013", "game_name": "Coolson's Artisanal Chocolate Alphabet", "text": "As veteran games journalist Steve Hill put it recently, ~There are two types of Candy Crush player; people who are addicted to Candy Crush, and people who haven't played Candy Crush yet.~I have played a lot of Candy Crush. So much that I am plagued by Trainspotting-style visions of myself diving headfirst into an overflowing toilet, clawing wildly through the putrid excrement in search of a rainbow sprinkle. Hooray, then, for methadone, in the form of Coolson's Artisanal Chocolate Factory. It's an iPad game about rearranging sweets into neat combinations. But where Candy Crush is garish and lurid, Coolson's is soothing, pale and beige. There are no Lemonade Lakes, Minty Meadows or characters who look suspicially like Dr Robotnik after lipo. The visuals are hand-drawn. The soundtrack features a banjo. The narrative centres around the pressures facing English Literature graduates to take on menial work. Basically, it's Candy Crush for hipsters. But have no fear, non-hipsters. It's possible to enjoy this game even if you don't own a fixed-gear bike or haven't worn a snowflake jumper since 1983. Look past the word ~Artisanal~ in the title, and the way the official trailer describes it as ~a game about whimsy~, and you'll find a charming, challenging and highly entertaining game. It works like this: each chocolate the factory produces bears a letter of the alphabet. These must be pulled off a conveyor belt and placed into boxes that are laid out like crossword puzzles. The object of the game is to order the chocolates so they spell out words. If the conveyor belt gets too clogged up with unboxed sweets, they start falling in the garbage chute. Lose three chocolates and it's game over. The idea is simple, but the combination of smart box layouts and random letter generation makes for a game that is complex and taxing. The action often gets frantic, thanks to the pressure of the conveyor belt. The game uses a pretty extensive word list, and it's possible to cheat by shoving chocolates in any old hole in the hope of stumbling on an obscure but acceptable word. This system works a little too well, and comes into effect even when you're not trying to employ it. As a result, it sometimes feels like success has more to do with luck than skill. But Coolson's has more than 60 levels, and the difficulty curve is steep, so it takes more than luck to conquer them all. The two-player battle mode can be played on a single iPad or online. Each player is given the same selection of letters and box layouts. The first person to fill their boxes wins the round. If one player lets three chocolates fall in the bin, it's an automatic victory for their opponent. The multiplayer game is brilliant fun. Allowing each player to see their adversary's gameboard (even when playing online) is a master stroke. When the round begins, it enables opponents to nick each other's words. Later on, it allows players to see how far behind or ahead they are, and thus fuels rage or boosts smugness. As fun as they are, turn-based word games like Letterpress and Words With Friends can't match the kind of frenzied immediacy that is on offer here. At its core, Coolson's is an arcade game with a literary twist.  Yes, it's hipper and quirkier than a Ferris Bueller cosplayer riding a unicycle down Shoreditch High Street. But there's an option to turn down the whimsy in the settings menu, along with the music and sound effects. The game's sense of humour keeps it just the right side of twee. It is a game that has been made with care, commitment and love, and that shows.  But never mind all that hippy bollocks, is it as addictive as Candy Crush? No. But nor will it take over your life, ruin your Facebook relationships and cost you eight hundred pounds over a period of years. Coolson's Artisanal Chocolate Alphabet is a beautifully crafted, fun to play game. It's perfect for anyone who enjoys wordplay, has fastidious organisational tendencies or was disappointed to discover that high-paying jobs in publishing do not magically apparate after three years spent reading one Thomas Hardy novel and watching Loose Women. And it can be yours for £2.49, with not an option to purchase a Lollipop Hammer in sight. Buy it."}