{"ref": "https://www.eurogamer.net/card-hunter-review", "date": "12 Sep 2013", "game_name": "Card Hunter", "text": "Come, traveller, lean in and let me tell you how I defeated the lizardmen guardians of the Temple of Scales.The air was clammy that evening. Humid, heavy with the jungle heat, and we'd fought the lizardmen to within an inch of our lives. Our priest's magic was exhausted, our warrior's armour worn down and I, for reasons too complex to explain just now, had completely forgotten how to walk. The lizardmen bore down on us, their forked tongues flicking.Then, just as all seemed lost, I loosed a spell that hurled our foes into the air, tossing them across the battlefield to land wherever fate chose. The lizardmen flew far, giving us time to catch our breath. Fate chose for us, that day, though it's not always been such a kindly mistress...Card Hunter is a marriage of nostalgia and novelty, the sort of cardboard dungeon crawler you'd expect to see spread across your dining table rather than your PC desktop. This free-to-play browser game gives you three heroes whose only talent is bashing monsters into submission, and it lets you customise them in a way that would be difficult to manage in person, but which is handled effortlessly by a computer. Each of these heroes exists as a deck of cards.Each card is an action of some sort, whether that's movement, a spell, a melee attack or something more exotic. Some of these cards are determined by a hero's race or class, but most are determined by the weapons in their grips and the equipment in their packs. Giving a warrior a sword gives him half a dozen cards for slashing and stabbing. Replace that sword with an axe and all those cards are swapped out for cuts and cleaves.Armour, staves, amulets - all these slip more cards into a hero's deck. Then, when you take these heroes on their next adventure, they'll each draw a hand of these cards every round, giving them a selection of abilities based on their kit, like a small and very random snapshot of all their gear: the chance to stab, the chance to parry, the chance to run.They'll face off against baddies who draw from their own decks of singular specialities and, after each round of combat, anyone who still has more than two cards in their hand discards down before drawing new cards and carrying on. At the end of each fight, there's always loot to be scavenged, which brings with it the possibility of new equipment and so new cards. As heroes level up they also unlock extra equipment slots, which means more space for more gear and even more cards, while monsters get nastier, quests get harder and local shops start to stock ever more esoteric items.Rummaging through loot is like falling into a ball pit of high-fantasy tat. You're drowning in the stuffIt's clever, it's compulsive and it's all very clearly presented, with most information never more than a mouse-over or right-click away. The interface makes it easy to compare equipment, showing you which cards you gain and lose as you swap one shield for another, and rummaging through loot is like falling into a ball pit of high-fantasy tat. You're drowning in the stuff.But I've peered into your head and I know what you're thinking. You're thinking, ~If I draw cards at random from my deck, even if I built that deck, I don't have much control over what I'll get.~ And you're right. This can be a problem in all card games, depending on how those games play. It can be a problem in Card Hunter, too.There's an old gambler's adage that says success in poker comes from knowing when to fold - from knowing when you can't win and not playing any more. After all, when you let chance deal you a hand, not every hand is a good one. The thing is, when Card Hunter deals a hero a bad hand, and it will deal many bad hands, you can't not play. You still have to do the best you can with those cards, because you'll be throwing all but two away when the round is gone. That hand could be five melee attacks and no movement cards, with nobody within striking distance, or it could be only movement cards and a card that buffs others you've already exhausted. It's very much on your head to improvise and, to a degree, improvising does work. To a degree.Card Hunter is not like Magic: The Gathering or Android: Netrunner, where you will discard some cards and retain others that you build upon and around. Instead, it's far more ephemeral, with you using most cards at that moment or not at all - and, after they join your discard pile, you'll not see them again until you've cycled your entire deck.Paradoxically, this becomes a more prominent problem as you level up. Every new equipment slot, filled or not, still adds extra cards to a hero's deck, adding complications you may not want, increasing your cycle time, and increasing the chance of unhelpful, irrelevant draws. You start to feel like a squirrel burying nuts, wondering if you'll ever find them again. Card Hunter loves giving you lots of things to play with, but it's not so great at letting you actually get to them. You soon grow jealous of a simple cockroach drawing from a tiny, efficient deck a third of the size of yours that allows them to either move or attack you, over and over.Critically, Card Hunter doesn't have enough cards for actually manipulating other cards. It doesn't let you shuffle, redraw or pull more than one or two extra from the ever-growing mountain of possibilities that is each hero. Your card management only happens between games, and what Card Hunter wants you to do is tweak your heroes over and over, experimenting with equipment combinations that mitigate whatever deficiencies you felt in your last fight, trying to build the best decks. It requires an acceptance that, when battle is joined, it's still controlled chaos at best - as much about winging it as strategy. It's not always fair.Card Hunter emphasises the ~free~ in free-to-play. You can get a lot of game for nothing at allYet that's not really so bad. Frustrating as the fights can sometimes be, they're also quick. New quests come thick and fast, the loot overflows, the monsters become diversity incarnate - and, importantly, Card Hunter emphasises the ~free~ in free-to-play. You can get a lot of game for nothing at all.Still, opening your wallet is advantageous. As well as adding a few new quests, it unlocks extra loot drops and also allows you to buy chests of random gear (something that's rather like doing fantasy scratchcards, and not necessarily useful). It also lets you buy in-game gold in greater sums than you'd ever earn it, since selling loot never nets you much. And you need to sell loot to buy loot, otherwise you're reliant on random loot, which isn't always the best loot. Again, fate is fickle and real money is your shortcut to the sharpest swords.This isn't essential for the single-player campaign but, unfortunately, it can tip the scales in multiplayer, currently the least developed part of the game. A deck-building game cries out for the chance to trounce other players, but at present Card Hunter doesn't have many maps and they're all focused around area control. You win by sitting your heroes on squares to score points. This has many players building decks entirely based around movement and powers that slow or push other players, de-emphasising melee and turning many confrontations into a sort of fantasy musical chairs.Card Hunter is a little creased, but I can't say I mind. It has a lot of potential and I'm interested to see how it grows, because it's a game that's all about trying new things: new tricks, new combinations, new possibilities. If you don't enjoy testing your luck or repeatedly rebuilding your heroes, then it's going to drive you absolutely nuts, but otherwise it's an almost entirely free game with a lot to give. That's a good deal."}