{"ref": "https://www.eurogamer.net/castle-of-illusion-starring-mickey-mouse-review", "date": "3 Sep 2013", "game_name": "Castle of Illusion", "text": "It's been nearly a year since the release of 3DS title Epic Mickey: The Power of Illusion, a game so forgettable I almost forgot I reviewed it. (But then, my memory isn't very good, hence the error in that article about the double-jumping. My once vivid recollections of the precise mechanics of mediocre early 90s platform games have been blurred by the passing of time and the horror of childbirth. Sorry, everyone.) Epic Mickey: POI was billed as the ~spiritual successor~ to classic Mega Drive platformer Castle of Illusion. This is like tying a ribbon round a dog turd and claiming it's a tribute to a Fabergé egg. The good news, however, is that new PSN, XBLA and PC effort Castle of Illusion Starring Mickey Mouse is the actual successor. It's got double-jumping and everything. The game follows the adventures of the only popular entertainer of pensionable age not to have been arrested on child sex offences as he embarks on a quest to rescue his girlfriend, Minnie, from evil witch Mizrabel. He must explore seven worlds and defeat seven bosses to collect seven rainbow gems, then smash Mizrabel's face off with a Boomshot grenade launcher while shouting ~Lock and load!~ and calling her a bitch.Not really, of course. This is a faithful remake of a game from a time when games were, for the most part, jolly, silly affairs. There are no frag grenades to lob at enemies, just shiny red apples. Instead of browns and greys, the levels are rendered in bright greens, blues and golds. The most fearsome boss weapon to be faced is a really big hammer. Fans of the original will recognise plenty of stuff in here. The worlds are the same thematically, and sometimes structurally - at the end of the toy box level, for example, Mickey has to run back down the mountain of blocks and boats he's scaled, just like old times. The enemies are all based on the original designs, so once again you'll be amazed at how infuriated it's possible to be by an animated letter 'A'. The big difference is that the Mega Drive version's side-scrolling graphics have been replaced by a mix of 2D and 3D visuals. This is a tricky balance to get right, but here it has been handled with care and subtlety. It feels natural when the perspective changes so Mickey can race away from a rolling boulder or navigate his way around moving cogs. Restrained attention to detail is also evident in the game's presentation. The narrator's rumbling commentary adds a storybook feel to the action, but is never intrusive. He has a couple of great lines (~As Mickey swung past the giant duck, he remembered Donald's advice on adventures: 'Don't have 'em.'~) Special mention also goes to the music by former Rare composer Grant Kirkhope. Moody strings, bold brass and twinkling top notes combine to create a rich, charming soundtrack that tips its hat to classic 16-bit music while remaining distinctly Disney. Most modern-day platformers are namby-pamby affairs, packed with checkpoints and extra lives and ledges that don't start to disintegrate before you've finished jumping towards them. The new Castle of Illusion says balls to all thatBest of all, this game is ****ing nails. Most modern-day platformers are namby-pamby affairs, packed with checkpoints and extra lives and ledges that don't start to disintegrate before you've finished jumping towards them. The new Castle of Illusion says balls to all that. It requires levels of timing, rhythm, precision and determination that would test a Soviet gymnast. It's frustrating, therefore, that before embarking on his quest, Mickey saw fit to grease the soles of his shoes with butter. For the most part he's a pleasure to control, running and jumping with smooth, fluid movements, but the inertia is just a touch overdone. This results in moments of frustration as Mickey plummets into the void because you pushed the analogue stick a tenth of a millimetre too far to the right. But that's platforming, innit? Or at least it was 23 years ago. Which is about the last time it was acceptable for a grown-up to say ~innit~. Anyway, this brings us to the main problem with this remake: it's so faithful to the original that it feels dated. There are no new ideas here. Even those who never played the Mega Drive version will feel like they've seen it all before. All the same, Castle of Illusion Starring Mickey Mouse is an enjoyable, polished, satisfying game. It may only be a few hours long, but it's worth a tenner. It's perfect for those afternoons when all you want to do is close the curtains and collect rainbow gems while listening to some nice music. Just don't expect to remember the experience in 23 years. Or indeed next Tuesday."}