{"ref": "https://www.eurogamer.net/one-finger-death-punch-review", "date": "28 Aug 2013", "game_name": "Reviews", "text": "In real life, you mustn't let a fight escalate, or so the veteran scrappers and brawlers advise through toothless gums and with black-eyed wisdom. Instead you hit them with everything you've got, right from the off: maximum violence, instantly. That way you have a chance to end things before they get out of hand, to remove your astounded opponent from the equation without risking much pain or, hopefully, any damage. But on-screen violence plays by a different set of rules. Here fights must build and grow, moving back and forth through moments of distance, intimacy and rebuttal like a love scene, before reaching the final knockout climax. There's a reason that kung fu movies usually employ choreographers: screen violence is its own sort of dance. And beneath, or perhaps inside, every dance, there's a rhythm.This is something that fighting game players are acutely aware of. While fighting games and music games appear to be opposed (the former primarily concerned with conflict, the latter with resolution) there's a rhythm action component at the core of every Street Fighter. Opponents must read one another's moves and, on finding an opening, tap out a rhythmic sequence of buttons to execute a balletic combo. Trip the rhythm and the combo (maybe even the entire fight) is lost. One Finger Death Punch, a recent release for Microsoft's jilted Xbox Indie Games platform by Silver Dollar Games, offers perhaps the clearest presentation of the link between ryhthm and combat yet seen in a video game. Your warrior, a stick man silhouetted in front of a familiar-looking kung fu movie backdrop, stands in the centre of the screen while waves of attackers approach from either his left or his right side. When an enemy combatant strides within range, a snappy tap of the corresponding button (X for left side, B for right) sends your fighter streaking forwards to land a sharp strike. The order in which opponents reach you establishes the fight's rhythm. They slide towards you like notes approaching along a musical stave, and the resulting tapping tempo has the feel of a Guitar Hero performance - albeit one with lingering close-ups of cracking ribs and hurtling eyeballs.Played out on a vast map, filled with nodes to represent each stage, One Finger Death Punch's complexity quickly scales. Initially, most opponents disappear in the impact of a single strike, but soon enough you face waves of stronger enemies that require combo hits, dodging backwards and forwards around your position, thereby changing the buttons you must tap to dispatch of them. Even stronger enemies temporarily slow the game to a crawl as you speedily enter a long string of inputs - and later you must bat away incoming projectiles as well as attackers.What could so easily have become a disposable, short-lived distraction grows into a deep and complex series of tests of nerve, timing and dexteritySoon enough, each mission - few of which last more than 60 seconds - is a riot of colour and action, the game's designers employing Capcom's age-old visual tricks such as hit pauses and zooms to mesmerising effect. The animation throughout is exemplary, despite the fact that each combatant is little more than a line drawing.What could so easily have become a disposable, short-lived distraction grows into a deep and complex series of tests of nerve, timing and dexterity as Silver Dollar Games twists its central premise into unusual and creative new shapes. In some stages you must simply bat away a series of incoming throwing knives; in another, it's you doing the throwing. In one scene you fight with a glowing lightsaber atop a mountain, while later 'retro film rounds' desaturate the screen into a vintage sepia mush, removing the colour cues to aid you in your split second decision-making.There are also 21 skills to collect. These are won by completing special battles and up to three can be equipped at any given point. Their effects vary from temporarily extending your attack distance to equipping you with new weapons or adding shields to absorb the damage incurred whenever you leave yourself open to counterattack. Selectable skills may be de facto standard for modern brawlers, but One Finger Death Punch introduces one quiet yet fascinating novelty by increasing the game's global speed every time you successfully complete a battle. Lose a fight and the game's speed drops (but never below 100%), but continue to rack up the wins and your reactions will soon be grimly tested. It's truly dynamic difficulty, the game adapting to your proficiency in a novel, exciting way.You're scored on each stage based on the number of misses incurred - a platinum ranking for a full combo down through the medal grades. Miss 10 or more strikes and you'll complete the level, but without a medal ranking. While it's perhaps unfair to berate a 69p Xbox Indie title for not having fully integrated online leaderboards, the game is so well-rounded elsewhere that you yearn for the additional fizz of external competition. Nevertheless, as it stands, One Finger Death Punch is an enormously generous and exhilarating combat game - one whose capacity for expression and mastery is far broader than its simplistic appearance suggests."}