{"ref": "https://www.eurogamer.net/trigger-happy-2-0-review", "date": "15 Aug 2013", "game_name": "Reviews", "text": "'Trigger Happy' has always felt like a strange umbrella title for Steven Poole's games writing; he never seems to waste a bullet. Witness: his latest book kicks off by listing some of the cultural inroads games have made in the last decade or so. Slavoj Žižek has a Black Ops poster on his wall, Will Self and John Lanchester have written articles about games, and the V&A even included a few in a recent exhibition on British design. Specifics aside, it's an opener a dozen writers might have chosen, but only Poole would conclude this victory lap by kicking a little gravel into the stands. ~And a surprising proportion of American teenage males say they want to be snipers when they grow up,~ he writes. ~A dream that was surely nurtured by stealthy console-based ultraviolence.~That juxtaposition gets to the heart of Poole's work, I think. He's not valuable because he's a broadsheet type who loves games and is willing to serve as a booster for them in the golden savannahs where the Amises and the Updikes graze. He's valuable because he takes games seriously - and because he sees no reason not to. Across the 114 pages of Trigger Happy 2.0, you get to witness games examined with a disciplined eye and an occasionally wild mind; you'll often find them held to account, too. The subtitle for the book is 'The art and politics of videogames.' It delivers on both fronts, and is particularly good in the areas where the two blur into one another.Back in 2000, the original Trigger Happy was an examination of video game aesthetics - close reading at a time when most books on the form contained pull-out maps and strategies for taking down Sephiroth. 2.0, however, is a collection of Poole's Edge columns; what it lacks in sustained investigation, it makes up for with range. Poole's the ideal writer for this kind of approach. He's deft in setting things out and quick to get to the heart of a serious subject, and he sees the potential kernel of an idea everywhere. A trip to the opticians might inspire a piece on games' laziness when tackling different perspectives (what would a second person singular game look like?), girls chatting about princess pirates in the supermarket leads to a rumination on animism.The book's divided into sections covering ideas like  time, reality, and humanity. Poole's got his work cut out with that list alone, but there are also boundary-crossing themes that run throughout. The most immediately visible of these is games' angry inferiority complex: the cultural chip on the designer's - and perhaps the player's - shoulder. He has a term for this - medium anxiety - and he approaches from all angles. There's an elegant unstitching of the whole when will a game finally make Steven Spielberg cry? business, and he even manages to bring something new to the where's our Citizen Kane? industry (~What is the Tetris of cinema?~). At his best when there are vivid details to pick over, though, he strikes a real high note in an essay called Tactical Action. One of the book's handful of standouts, it examines the way that games, TV and cinema increasingly dance around each other. Bad TV becomes an ignorant parody of the most mindless of the perceived excesses of games, while a game, in turn, might punish players for their ~impatience with its own narrative failings~ - and ruin the empty joys of watching Jack Bauer knock people about with questions regarding his battle smarts.It's startling enough to discover that the trail from Donkey Kong to Nietzsche turns out to be fairly short, but it's even more surprising that it's an illuminating journey, tooTactical Action spins from 24 to Arma II and then off to Inglourious Basterds. That turns out to be a rather tame itinerary. Most pieces here are full of stuff. It's startling enough to discover, in an essay titled Eternal Recurrence (now that's great SEO) that the trail from Donkey Kong to Nietzsche turns out to be fairly short, but it's even more surprising that it's an illuminating journey, too, casting the spectre of the perfect playthrough in a strangely elegiac light. Another piece starts by listing the myriad changes made to Chess over the centuries, and then finds time to offer the best analysis of the problems with Advance Wars sequels ever laid down: ~One of the touches of deadpan comedy I loved about AW was the moment where you were introduced to a huge new type of tank that could more or less obliterate anything in its path - only to learn that it was called, with beautiful understatement, a Medium Tank. In Advance Wars 2, however, we have the Imperial Walker-style Neotank, which outguns its predecessor, and so the Medium Tank is now just - well, medium.~This paragraph has stuck in my mind for years, popping up to annoy me with its wit and easy insight whenever I've had to write about the series myself. It's good to see it again in this collection, even if it's painful to witness Poole nailing a complex problem with such throwaway precision, scoring a basket while checking his emails.Throughout Trigger Happy 2.0, Poole demonstrates the imagination to see things in an unusual way and the confidence to know that he's right, and that slam-dunk accuracy is his secret weapon. He's happy to wryly present the case that Advance Wars is like an ~anfractuous, hyper-dense~ William Empson poem. He knows that the perfect adjective for Metal Gear Solid is batty.You expect this precision from the author of a book on the political use of language, just as it's not surprising to find that introductory essay with its Žižek reference - followed, a few paragraphs later, by an invocation of the classic figure of modernity, the flaneur. The delight, though, is that with Poole, these ideas don't fall on the page in a heavy, self-satisfied way. In 2000, the original Trigger Happy was an attempt to place video games in a wider cultural context because it seemed like the natural, useful thing to do. 13 years on, Poole's still making it feel just as natural. He feels no shame about  games, only curiosity. I love the way games rub against other forms, other traditions, in his mind. This isn't because I adore spotting puns about Ogden Nash, but because when a writer couples Poole's knowledge with his restraint, everything ends up a bit richer for it. I don't want every games reviewer to start kicking off appraisals of Narco Terror, say, with a lengthy quote from Dispatches, but a quick, well-handled dip into Roberto Bolaño's work allows Poole the means to construct a case that Half-Minute Hero is 'savage' satire. This feels correct, and it's also a wonderfully energising business to follow Poole as he reaches his conclusions.Over the whole course of the book the erudition is light and unforced, in fact. When Poole talks about Theodor Adorno, you sense he probably doesn't have to double-check quotes, but elsewhere you might also suspect that he doesn't mind prefixing a mention of Heraclitus with ~The Greek philosopher~ (so that we might not confuse him with Heraclitus the baker, perhaps), because his work is appearing in the pages of a magazine. He's as interested in the real world as he is in the literary, too. A discussion of sandbox games is as likely to glide towards gated communities as it is Baudelaire, and it will always end with something relevant, something worth thinking about.Speaking of the real world, it's surprising how many of the best pieces here share a common emotion: anger. Apocalypse Now offers an unblinking examination of the London riots, while the spectacle of Osama bin Laden redesigned as a boss battle in National Security-Ideology is as hilarious and disturbing in its fury as anything in Catch-22. There's always a sober connection being made, whether it's arguing that contemporary government agendas are often ~uncritically internalized~ in games, or drawing attention to the tangle designers inevitably get into when they try to present an anti-war message while aestheticizing violence. The book reaches boiling point, though, not on the virtual battlefield but in the rescue remedies aisle of the local self-help supermarket, with an astonishingly efficient takedown of Jane McGonigal's grimly unexamined best-seller Reality is Broken. ~'Reality,' she writes, 'is too easy.' That's why we need to fill it with the 'voluntary obstacles' of games, to make things more interesting. Nothing could be a more fatuously perfect example of blinkered privilege, the digital utopianism of the materially comfortable.~This is no messy hatchet job. McGonigal's book is 416 pages long; Poole only needs two sentences to sink it.Even when the tone grows dark, though, Trigger Happy 2.0 remains a very heartening read, not least because Poole's never given up on games. Across these essays you'll see him playing, if not always enjoying, a magnificent selection of the naff and the middling, from Resistance 3 to London 2012: The Official Video Game. These are not the games typically referenced by a writer who has long since moved up into the culture section of a broadsheet, but this book reminds you that Poole is not a typical writer. If you write about games this is a humbling, even shaming, collection, then. If you read about games, it's focused literary joy."}