{"ref": "https://www.eurogamer.net/superfrog-hd-review", "date": "1 Aug 2013", "game_name": "Superfrog HD", "text": "The announcement that Team 17's Superfrog was getting an HD re-release made me both very happy and strangely worried. I was very happy because I have enormously fond memories of the 1993 Amiga original, but I was strangely worried for, well, pretty much the same reason. Those fond memories would now be put to the test. I hadn't touched the game in 20 years and realised that, while I liked it, I couldn't really remember actually playing it.Turns out that both my reactions were justified. This freshly spruced up version of the game is both delightful and slightly disappointing, its simple, fuss-free charms tarnished by the fact that it's not quite as good a platform game as my addled memory told me.Gameplay is much as you'd expect, as Superfrog - a cursed prince on the trail of the witch who kidnapped his beloved princess - jumps on the heads of small animals and collects trails of tinkling coins and juicy fruit. Being a frog, of course, his leaps are generous enough that double-jumping isn't required, but you can collect a power-up that allows Superfrog to glide on his cape, allowing even greater range and control. Also available via collectible power-up is Spud, Superfrog's green, globular sidekick who can be thrown at enemies for a risk-free kill.What distinguishes Superfrog from the crowd is how generous it is. This is a game where the screen is absolutely spattered with pick-ups and every level contains as many as 15 secret areas to be found. These are generally lurking behind hidden passageways that chug open when you brush against the wall. Often, one secret area leads to another, and another, and another, creating entirely new routes around the stage for the more experimental player.This exploration is matched in the level design, which tends to sprawl in multiple directions rather than pursuing the relentless horizontal dash favoured by most of Superfrog's 1990s peers. With a few more powers and more structure, it could almost be Metroidvania in style. As it is, it feels like a slower, more exploratory Sonic title.Or it would if there was just a little more polish and precision in the control. Our hero can be too slippery to handle around instant death obstacles and the hitbox surrounding him is annoyingly fuzzy when every pixel counts. A couple of distracting design quirks serve to make this even more problematic.Take, for example, the potion that turns Superfrog intangible and able to run through enemies and hazards without taking damage. Very useful - except it doesn't apply to spikes which, for no apparent reason, remain fatal regardless of how ghostly you are. Similarly, some enemies can be defeated by hopping on their heads, but others inflict damage for doing the same. Trial and error is the only way to gauge the relative threat of each new foe you encounter.These are not fatal flaws, but in a genre where the laser precision of Miyamoto's designs still sets the benchmark, they're sadly enough to demote Superfrog to the B-list. The game is at its best when it plays to its strengths, offering enjoyable miniature mazes crammed with secrets and collectibles. It falls down most when it tries to go head to head with the console giants that defined the genre.That it still manages to be charming and fun is down to several counter-balancing factors. For one, Superfrog himself is an appealing hero, not exactly overburdened with personality but offering a distinctly British visual style. He looks like he could have stepped off the pages of The Dandy or from a Cosgrove Hall TV cartoon. Certainly, he looks like he'd comfortably fit in with the surreal menagerie that populated cult hits like Danger Mouse.Secondly, the game falls over itself to justify its revival, offering 24 brand new levels with the 24 original xlevels as bonus extras. These are unlocked via a fruit machine mini-game at the end of each stage - the same mechanic that was previously used to access checkpoints. On top of that you can add a series of special time trial stages which abandon multi-directional exploration in favour of more direct left-to-right speed runs, with time-extending power-ups galore. Finally, as the cherry on top, there's a decent level editor.Is Superfrog HD a cautionary tale about the perils of nostalgia? Not quite. My warm, fuzzy memories were certainly better than the modern reality, but nor were they so far of the mark that I feel crushed after reuniting with the amphibious hero. Not so much super, then, but Pretty Good Frog is a decent enough result after 20 years in the wilderness."}