{"ref": "https://www.eurogamer.net/rymdkapsel-review", "date": "1 Aug 2013", "game_name": "Rymdkapsel", "text": "Grapefrukt's Rymdkapsel, a real-time strategy game about building a space station, goes out of its way not to go out of its way. There is no story; no explanation for the hostile red ships that swarm your matrix of corridors and rooms in periodic waves of escalating threat, nor for the monoliths in all four corners of the play area that you're asked to research. Even the name, which means ~space capsule~ in Swedish, is left unexplained. Developer Martin Jonasson wanted to create a strategy game that was neither fiddly nor stressful, and his solution was elegant minimalism.The set-up is cut to a single unit type - a little rectangular minion - and just over a handful of rooms to build. There are three resource types to gently consider - building blocks, particles and food - but you don't handle very much directly. Instead you prioritise activities by dragging and dropping between task types like ~construction~ and ~research~ on the lower edge of the screen, after which the minions in your station hop to it as though you've just issued a command. And they have one speed, whether they're carrying particles to build a new reactor or scurrying to a weapons room to repel hostile forces with tiny laser guns.Having stripped the strategy down to almost nothing, Jonasson builds it back up by other means, most notably by forcing you to lay things out in a sequence of Tetris shapes, predicted by a little queue of outlines in the top-left of the screen. Whether your next room is a kitchen or a garden, it's going to be a 2x2 square, and the one after that will be a T, and the one after that will be an L, and so on. As enemy waves start to arrive more thickly and frequently, the challenge comes from finding a clean and simple way to design your space station so your minions have enough time to get things done between mopping up threats, and don't get caught in the open.You must resist the urge to keep things too tight, however, because you also need to push outward to research those distant monoliths - something that confers small but important benefits, like faster minions, as well as fulfilling the main game objective. With each game of Rymdkapsel, you get better at balancing this quest for distant knowledge against the need for harmonious space station design and convenient security. I quickly realised I could get by without multiple kitchens, for instance, whereas my first instinct was just to fill my station up with waves of every type of room. Right now, I'm trying to find the right balance between weapon rooms and crew quarters so that defence is tight and reinforcements come through quicker.One side effect of all this economical design is that Rymdkapsel is not the biggest game in the world - individual sessions last upwards of an hour, and you've pretty much seen it all after two or three of those - but it will be a shame if concerns about value drive people away from it. As an alternative to the hectic micro-management of the average strategy game, it's a great success, but Rymdkapsel isn't just a minimalist game, it's also a game about minimalism, where a few simple elements combine beautifully and your true goal is to reduce them further to increase their impact. In essence, you have to play it less and less, and it will feel better every time. It's all about going out of your way not to go out of your way."}