{"ref": "https://www.eurogamer.net/tiny-thief-review", "date": "29 Jul 2013", "game_name": "Tiny Thief", "text": "Whenever thievery is the focus of a game, it's natural to assume that the result will fall into the stealth genre. Tiny Thief, developed by Barcelona indie studio 5 Ants and published under the Rovio Stars umbrella, does have a little bit of stealth, but it's more point-and-click adventure than full-time sneak-'em-up.We can be even more precise than that, in fact. Tiny Thief belongs to a very specific subset of the adventure genre, best illustrated by Amanita Design's Samorost browser games. Let's call them click-and-see adventures. Rather than basing progress around the accumulation and unlikely combination of inventory items, these games simply present the player with charming little interactive dioramas where prodding stuff to see what happens is the basis for success.That doesn't mean that there's no skill or thought involved. As Tiny Thief's tiny thief, you have six quests to work through, each made up of several distinct scenes. In each one, there's a specific object you have to pilfer in order to open the exit. The item in question is generally connected to some overbearing authority figure or similar bully - Tiny Thief is more Robin Hood than hoodie thug.For example, there's a corrupt sheriff swiping money from kids. You have to work out how to get him out of the picture in order to steal his piggy bank. The solution involves the use of sweets, a barrel, an axe and a giant lollipop, but the process is more one of gentle, logical deduction.Getting spotted means instant game over, and there are a more than a few moments where quick reactions are needed to duck into a barrel or hay bale. Thankfully, such moments never feel random, there's always a hiding place where you need one and the game never resets you back to the start, meaning you're never forced to repeat solutions you've already found. Being seen feels like failure, but is never too punishing.This means that trial and error is usually all you need to proceed, but that doesn't prevent it from being enormously fun. The world is brought to life with a characterful papercraft feel - a look that's a little overplayed, but very appropriate to the game - and there are lots of optional objectives to discover.It's here where the game's depth really lies. Beating the levels is relatively simple. Finding all the hidden treasures lurking behind their own sequences of interactions is much harder. Every scene is full of detail, some of which is useful, some just for fun. Poking around to see what happens is a huge part of the game's considerable appeal. Oh, you'll ace the first few worlds without much problem, but before long you'll find yourself determined not to leave a scene that still has goodies to find, even though you could swear you've exhausted every conceivable place to tap.There's even a little bit of Where's Wally in the mix, as every scene features your pet ferret, hidden somewhere, peeking out occasionally. You'll need to find him as well if you want all three stars.If you do get stuck, there's a hint book, which will offer up a complete walkthrough for any scene. This can only be used once every four hours, however, which is just enough of an inconvenience to ensure it's only ever a last resort. To 5 Ants' credit, the hint mechanism isn't monetised, even though it seems designed as such. The developer could easily have inserted some in-app purchases to keep the hints flowing, but the fact it has resisted speaks highly of its devotion to the craft of game design rather than the commerce.Tiny Thief isn't particularly difficult, but its bite-sized challenges are a perfect fit for a quick session on the move and provide just enough mental exercise to blow the cobwebs away on the journey to work. Part adventure game, part hidden object puzzler, with just a dash of stealth, it combines many influences yet feels like nothing else on the App Store. If this is the sort of title Rovio plans to highlight as a publisher, it's off to a great start."}