{"ref": "https://www.eurogamer.net/attack-of-the-friday-monsters-review", "date": "25 Jul 2013", "game_name": "Attack of the Friday Monsters", "text": "Kaz Ayabe's name doesn't quite carry the same weight as Keiji Inafune, Goichi Suda or Yasumi Matsuno outside of Japan. But like his compatriots in Level 5's Guild series, the sequence of short 3DS games to which Ayabe's Attack of the Friday Monsters belongs, he's a strong, singular voice, and one that's responsible for one of the most delightful offshoots in Japanese gaming over the last decade. Boku no Natsuyasumi, or My Summer Vacation, has earned Ayabe and his studio Millenium Kitchen a reputation in Japan for peculiarly gentle adventures, though sadly none of the series has ever been translated for the west since its inception in 2000. More's the pity: charting the holiday adventures of Boku, a 10-year old with a free spirit and a month's worth of free time to indulge it, they're disarmingly delicate recreations of Ayabe's own lost summers. Attack of the Friday Monsters isn't an explicit part of Millenium Kitchen's other series, but it carries on many of its traits. You're Sohta, a 10-year old transfer student who finds himself wandering the streets of Fuji no hana, a small suburb in Tokyo's Setagaya district, over the course of a summer afternoon in 1971. So much of the joy in Attack of the Friday Monsters comes in the playful innocence of exploring such a well-realised place. This is pastoral Tokyo, and far from the bright lights and searing neon of more traditional depictions. A docile, dusty high street webs out into several quiet alleys, while the outskirts are little hedged warrens with undiscovered corners, all painted with the soft, warm whimsy of Studio Ghibli at its best. It's perfectly evocative of the impossibly long summer days of youth, filling you with nostalgia for a childhood that likely was never yours. There's a tender menace underlying Sohta's adventures, though, first felt in the bickering between your father, a dry cleaner struggling to set up business, and a mother who feels her partner's underachieving. It's there as well in the strangers Sohta meets and slowly becomes acquainted with, opening up a series of overlapping quests that can be tackled at will. And it's there in the Friday Monsters themselves, an embodiment of the Kaiju genre that also informs Ayabe's game. Most famously depicted in films such as Godzilla, Gamera, Mothra and Rodan, in Sotha's world these mythical beasts live somewhere between his imagination and the smoke stacks that billow from the factories on the horizon, and Attack of the Friday Monsters enjoys playing with where that line exactly lies. As a charismatic facsimile of a childhood lost in thrall to conspiracy and discovery, Attack of the Friday Monsters works well, and is fittingly slight. Sohta's story can be played through in the course of an afternoon, the mystery unraveled after two to three hours. It's a brave game that doesn't outstay its welcome, and as the upbeat but strangely melancholy theme song plays over the credits (~Both my Mom and Dad love me/I don't really know why what should I do?~ sings Sohta) there's only a slight pang of regret that it's all over so soon. As a game, Attack of the Friday Monsters is slight, too. The backbone of Sohta's adventure involves simply talking to friends and strangers to move the plot along, and it's lightly padded with a card battling mini-game that's trivial enough to hardly be there at all. Pocked around Fuji no Hana are glowing glims; collect enough and you'll unlock a new battling card, and with a full deck you can battle Sohta's friends in an undisguised variant of rock-paper-scissors. One key plot moment aside, it's entirely optional, and while insignificant it fits perfectly into Attack of the Friday Monsters' world. Lose and you become your opponent's slave, but win and they become yours, allowing you to chant a small, playful and customisable incantation that sees them flopping on the floor at your command. It's odd and slightly throwaway, much like Attack of the Friday Monsters itself, yet it also captures the inquisitive naivety of childhood, and of a world where young imaginations blossom to fill the long hours of hot summer afternoons. And if you've any interest in seeing how effectively a game can transport you to a different time and place, you probably should dedicate an afternoon of your own to Ayabe's curious, magical delight."}