{"ref": "https://www.eurogamer.net/sprinkle-islands-review", "date": "24 Jul 2013", "game_name": "Sprinkle Islands", "text": "As a species, we're drawn to water. It keeps us alive, but that doesn't explain our fascination with its tactile properties. Show us a pool of water and we want to dive in, splash around or at least have a little paddle. More than that, we're captivated by the way water moves. Children are still endlessly amused by the way an empty squeezy bottle can be transformed into an impromptu water pistol, and even the most stoic of adults can't resist a playful squirt with the hosepipe while tending to the shrubbery.It's this aspect of water that drives Sprinkle Islands, an effortlessly charming physics puzzler from the inappropriately modest Mediocre Games.Depicted in whimsical pastel hues, Sprinkle Islands gives you control of a rickety go-kart style fire engine. You roll through the scenery until a nearby fire forces you to stop. Put out the fire and you can continue on your way. You do this with your hose, which can be raised and lowered with intuitive swipes on the left side of the screen, while a button on the right starts the water flowing.Initially, your job is simple. Aim at the fire, douse it with water, job done. Complications quickly arise as the path to the flames is blocked, and you must start using the environment to guide your gushes to their target. Before you know it, you're knocking over barriers, sealing and opening passageways by moving blocks, and operating the obligatory seesaws that must, by law, appear in every physics-based puzzle game.There's not much that's fresh in the puzzle design, but the liquid theme subtly changes the way these tropes play out. It certainly helps that the water simulation is second to none: every drip, squirt and full-force blast feels just right, the water sloshing, splashing and soaking things just how you'd expect.Sometimes, however, the physics simulation is almost too good. Water is an inherently chaotic substance, and no two squirts are the same. This causes problems in later stages when you're fighting the clock and your own limited water reserves to move objects around. More than once, you'll find that a solution you dismissed after it failed to work is, in fact, the correct thing to do. All it takes is a slight and imperceptible change in the angle, the force or the timing and what seemed impossible suddenly works perfectly.That's a testament to how beautifully Sprinkle Islands captures the childlike joy of splashing around, but it does tend to leave the puzzling element feeling progressively soggier as the levels progress. Often it's easy to see what needs to be done, but frustrating to get the water doing what it needs to do in order to move on.That's the only damp patch in an otherwise delightful game, and an optional level-skip feature means that even the most irritating sliding block won't be an impassable dam to progress. It feels so refreshing just to play in Sprinkle Islands' happy, splashy world that you'd almost swear the current heatwave was some kind of viral marketing push."}