{"ref": "https://www.eurogamer.net/crabitron-review", "date": "23 Jul 2013", "game_name": "Crabitron", "text": "Giant crabs: didn't that meme die in 2006? Fortunately, the battles Crabitron is based on actually took place just off the shoulder of Ganymede rather than in ancient Japan. And it turns out that space is just the place for an oversized crustacean to get his grub on, full of galactic taxi cabs, nebula ambulances and delicious interstellar burgers. Of course, there's always the threat of meteor showers and police star cruisers to worry about, but hey, you have a big old pair of claws to swat such irritants away while you chow down.Crabitron himself is more of a wobbly, fleshy mass with claws than a scuttling decapod, his arms elastically stretching out from his body. Just about everything that flies past is fair game for gobbling, although getting hold of your food is an art in itself thanks to a control scheme that has a little of Surgeon Simulator's comic awkwardness about it. It's the making of Crabitron. You start the game by grabbing both claws between your thumb and index finger, or your index and middle finger if you prefer, on each hand. The latter makes manoeuvring the claws a little easier because they're both flush to the screen, but when it comes to grabbing stuff it's more natural to squeeze your thumb and forefinger together. In truth, it doesn't matter all that much which option you choose, because the result will be chaotic. In the early stages you'll only have a few vehicles to deal with, so you can happily grip their bumpers and pop them into Crabitron's ever-gaping cakehole. You don't need to be particularly precise about it, either, as he'll happily suck things in when they're close enough. Meanwhile, a damage total steadily climbs, while a multiplier ticks upwards the longer you go without being hit. Assuming, that is, you don't leave too long a pause between smashing and eating.It isn't long until the screen gets busy and your double-digit swipes and squeezes grow ever more frantic. Some vehicles teleport out of your grasp, while larger enemies elude the grip of even the most widely spread fingers. Projectiles rain down in brief mini-game interludes, from a barrage of meteors to a hail of missiles. There are bosses, too, and even a timed game of intergalactic Breakout.It's incredibly shallow, but irresistibly entertaining. It's also a brilliant co-op game, or at least a very funny one. With one player manning the left claw and the other taking the right, why not pick up a vehicle each and smash them together like the die-cast cars of your youth? I played it this way with my son, and it turns out that 'accidentally' grabbing Crabitron's eye and stretching it as far as it will go is just about the funniest thing a seven-year-old has ever seen. Better still, you can watch a replay of your most recent run and giggle away at the madness once more.It has the de rigueur iOS mission structure - complete x number of objectives to increase your crab rank - and power-ups to spend your in-game coins on, but the joy of Crabitron is in just grabbing a claw or two and making a big old mess. Some would question whether that makes it a game or merely an amusement, a toy. I'd prefer not to bother with unnecessary definitions, though, and simply label it for what it is: bloody good fun."}