{"ref": "https://www.eurogamer.net/leisure-suit-larry-reloaded-review", "date": "19 Jul 2013", "game_name": "Reviews", "text": "Hello everyone! Let's start with a list, because that's all the internet is comprised of these days. Time was you couldn't move for nobs and tits, now it's all Top Ten Cats Wearing Tiny Hats. (~About 4,010,000 results.~)Here are ten things the world doesn't need any more of: Of course, not everyone will agree with this list. Perhaps you're a big Rory McGrath fan, or a racist. Maybe you like being told to ~Pump it up~, ~Shut it down~ and ~Go out and smash it~ by will.i.am. Or perhaps you're one of the 14,081 people who contributed to the Kickstarter campaign for Leisure Suit Larry Reloaded. That's 14,801 people who think that what the world really needs is a remake of a 26-year-old point-and-click adventure about shagging.Just like the original, this game is set in the unamusingly named gambling town of Lost Wages. And just like the original, it is packed with references to bad breath and blow-up dolls. If you think that sounds hilarious, wait till you see the lampshade shaped like a penis!!!Playing the game involves trawling round a small number of tedious locations, collecting random objects for obscure purposes. A wry narrator comments on everything, endlessly, which is actually quite useful for the many instances where Larry is performing an action no one has bothered to animate. Solving puzzles involves clicking on everything in sight and revisiting the same places many times over, until new items arbitrarily appear. If you think that sounds dull, wait till you've spent an hour grinding away on the blackjack machine!!! Larry needs cash to pay taxi fares, buy drinks and so on, and the only way to earn it is by gambling. Unless you plan to spend the rest of your life doing this, it's best to save after every win and reload after every loss. To make the process more bearable, I suggest turning the sound down and putting something more interesting on in the background. I got through an entire Archers omnibus.  All this heart-stopping action is punctuated by text-based conversations with the game's female characters. Just like old times, the defence is that the joke is on Larry; he's constantly exposed as a buffoon, and therefore it's OK that all the women are sexist stereotypes with nothing intelligent or interesting to say, and either prostitutes or people offering sex in exchange for material goods. Which is a bit like punching someone in the face, then explaining that it's OK because your fly's undone.For further evidence of the game's attitude to women, try playing the ~Angry Broads~ arcade machine in the convenience store, which features pigs in dresses waving feminist placards. Except you can't, because the narrator informs us the machine is ~stuck in demo mode~, i.e. no one bothered to make the mini-game. Probably too busy laughing at their own joke. But really, it's hard to get offended by any of this. Protesting that a Leisure Suit Larry game is sexist is like complaining that a portrait drawn by a six-year-old is unflattering. Besides, better save that ire up for the racism. Guess what everyone? The black character in this game is a pimp! Meanwhile, the Asian character runs the convenience store! He sells condoms in a variety of sizes, including ~Banana~ and ~African banana~! Jesus ****ing Christ. What's next? A puzzle that must be solved by using a blackface disguise to enter a rap studio? Oh wait, that was Leisure Suit Larry 5. Of course, there will be people out there who don't give a toss about the racism and sexism. Perhaps even 14,081 people. But it's hard to imagine that all of them wanted nothing more from this remake than better graphics. There are no original ideas here, no new twists and not even any decent jokes. A better title would be Leisure Suit Larry Rehashed. Everything about this game feels outdated, from the gameplay to the attitudes to the idea that anyone still uses breath spray. Backtracking and blackjack grinding might have been acceptable in the 80s, but things have moved on. There's a fine line between ~retro remake~ and ~reheated old tat~, and you've probably crossed it if the most cutting edge thing in your game is an Angry Birds parody. The world did not need this Leisure Suit Larry game, and it does not need any more. With that in mind, here's a new idea: Kickstopper campaigns. We all club together to pay the likes of Rory McGrath, will.i.am and Nigel Farage to stop inflicting their nonsense on us. Let's start with Replay Games, the creators of Leisure Suit Larry Reloaded. All I need is 14,080 backers. Who's in?"}