{"ref": "https://www.eurogamer.net/ride-to-hell-retribution-review", "date": "12 Jul 2013", "game_name": "Ride to Hell", "text": "I'm not quite sure how a fatter, good-eyed Snake Plissken got in this 60s biker gif slideshow, but his name is Jake and he's turned up and it is really difficult to get him to ride a motorbike. And this is a game about a man whose job, in this video game, is to ride a motorbike.Discreet sections of Ride to Hell, a linear, supposedly story-led game, require that you must race a motorbike along a flickering road like a smartphone racing app where the road scrolls and you merely slide left and right to avoid obstacles. There's no weight or physics to it. On-bike fights are laborious button-tapping affairs. Miss a jump or an objective too many times and - this is my favourite part - your control is promptly removed, and the game has you wait while your bike very slowly veers off the side of the road, gently bumps into a fence, and then a few seconds later you explode to death. Imagine if you ran a red light in real life and then your bicycle suddenly, slowly drove itself into a hedge on your behalf. ~There,~ it says, looking down at you smugly. ~That'll teach you.~ And then you explode.It actually physically hurts doing the racing sections in this game on the PC. All the grunt work is done by your left hand, where in the dullest bike race sections of all time you lean on A and D to steer, space to accelerate and shift to 'powerslide' under obstacles. Your left hand is braced in a claw position I like to call the 'Bruce Campbell', in that you will quickly wish your hand had just been sliced off instead of experiencing the strain injury that is currently coursing through it.When on-bike combat happens (you will know because a bike pulls up exactly beside you), your ability to steer the bike is removed, and the game begs of you to unimaginatively tap R and E until a bar fills up and you hit the guy. This makes your already rigor-mortised left hand shrivel up into something resembling my grandmother's dried flower arrangements. At the same time your right hand is resting on the mouse, eating a sandwich. There is nothing to indicate that your ability to steer the bike has been removed for the amount of time it takes you to punch a man to death in the most mundane way possible. Nor that your bike steering has been reinstated. As a result you have just smashed into one of quite a lot of lorry accidents, of which there are very many in this game. By the twentieth lorry, I was fairly sure that I should be stopping my bike to see if it was the same lorry driver and to check if he was drunk, or perhaps I could give him medical assistance before telling him to honestly STOP MAKING MY HAND VERY ANGRY.Then in one mission I was inexplicably magicked into a lorry to drive it, sliding unsatisfyingly across the road as cops comically try to make out as if they can explode impressively on the jaggy furniture of some wooden-textured barriers. I became the lorry. I don't know why. I don't even care any more. I am hacking at this video game wall with a tiny hammer, trying to get out. This game is my Shawshank. I am Andy Dufresne.Away from the hand mangle I am caught in a million loading screens and a million dull cut-scenes. I am waiting, always waiting, until I am on my keyboard, lifeless, the fallout from the, 'Oh no my brother was killed by a gang member,' scenario at the beginning impossible to understand. Our hero's brother was offed right in front of him: he could have just dropkicked the killers over a fence right then and I'd be out of this nightmare, but instead we are treated to arduous, lifeless cut-scenes that don't flow while he tries to find the culprits.Dialogue conveys very little to the player about what they are doing next and, importantly, why. The voiceover lines are carved up by periods of cringing, nails-on-blackboard silence, as though you're witnessing school kids constantly forget a line on stage at their new play about Pissed Off Midwestern Dudebros and Extremely Sex-Starved Ladies. The escape key pauses the cut-scenes, and then you must press spacebar to skip it. Those two little actions build up over time until you want to eat your own face.When the game has loaded, you have to press 'enter' every time. Every time the game is on a loading screen. And there are a lot of them.It waits for you to press enter, even though I have forgotten and am staring into the lifeless eyes of a big-titted blonde lady. Well, not into them - past them. The game's tyrannical imperative that you must see this next cut-scene and therefore WE ARE WAITING FOR YOU TO PRESS ENTER is hellish. Can't you just kick me into the game instantly? Please let me play a game today. But can you not put me back on the one where my fingers are mangled together like a sea anemone's tendrils.Melee fights themselves are so repetitive that I look away from the screen now while tapping left-click. Sometimes the other buttons are unresponsive. There is a special 'Advanced Brawling Technique' that you can trigger by pressing E in a fight, but it puts you into a boring quick-time event, so I never trigger it. It's as though you're Sam Beckett from Quantum Leap constantly dropped in scenes where you don't know you belong - a city scene, a warehouse shootout, a roadside hut, a ranch - but you are always an outmuscled man in a fight who pretends he can't hear you when you are yelling, ~SPACEBAR! I AM PRESSING SPACEBAR JUST BLOCK THE PUNCH BLOCK IT BLOCK.~Sometimes Jake gets confused about whether he is wielding a pistol or a wrench, flapping about like me when I am drying my nail polish. Sometimes after cut-scenes between melee fights, our sluggish 20-20-visioned Snake Plissken will just have his arm stuck facing behind him, not moving, in some sort of animation glitch protest. It took me 20 seconds pressing every button to get him out of it the first time it happened. This is starting to feel like a bug report instead of a review. Sound effects don't trigger a lot of the time: no sound for running, for pickups, sometimes the music cuts out leaving you with only gunshot noise for company in a fight where it takes what seems like two dozen body shots to kill one man with a hockey mask on. When I was fighting a man named 'Colt', text appeared written in Arial 10pt and attached to my backside while I ran into a huge firefight. As I was shot to death, it read, ~All enemies in this area are dead.~ My hips are lying.In the same mission, the level design was so ambiguous about where I should go next that I pressed myself up against every unopenable door, of which there are at least a tantalising 10 in each level, for a chance to press E to open, only to realise that warehouse walls sometimes slide open automatically when you go near them. So then I started grinding myself against perimeter walls like a cat in heat in case they magically opened to send me to the next part of the level. I spend my time confused. Button prompts for the PC version are ambiguous symbols: it sometimes takes a long time to figure out to which key the symbols are referring to. Mission objectives are attached to 'symbol of lock with A in it', which I still haven't figured out which button that is, and I think I have pressed all the buttons, even A and Caps Lock. Nothing in the menu system lists the full set of controls. This is probably because the port is not very good, or perhaps it is because they assume my PC has no buttons, but I also made the mistake of actually reading what was in the menu system tutorial. I found a screen on 'Saving Girls'. ~Self proclaimed Tough Guys,~ it says, ~often besiege girls~ (like they are castles or something). ~A saved girl will show her appreciation to Jake. Following this Jake's health and ammo are fully replenished, which may prove useful in upcoming encounters.~ By ~appreciation~ I found that the game means ~will have tacky fully-clothed sex with Jake~.  It turns out that women are completely, totally, transparently, a resource in this game, which is weird when you are an actual woman and you are used to yourself being a person who plays video games and not someone who waits around to wank gruff Hell's Angels off so they can get better Brawling Techniques.Perhaps this is what I am doing wrong in life: instead of fantasising about being a cool biker girl with my own health bars I should probably put on a jumpsuit open at a push-up bra, cover myself in motor oil, and drape myself on the front of a truck so I can replenish jerkily animated passers-by with a little bit of a dry hump. As Rock, Paper, Shotgun's Adam Smith said, women are the new 'chicken in a dustbin'.I was expecting this game to be a charming jaunt through Route 66 America, but then I remembered that not everything can be Full Throttle, and Maureen ~Mo~ Corley presumably has better things to do than function as a dong-bandage. It seems that we haven't really moved on from the 'tap to hit guy on bike' functionality either.Perhaps this game is better on a console, as it seems that the symbol system was primarily intended for a console audience, but I very much doubt it. The poor PC port is just confirmation that this is all-round neglected. It may have had something to offer, at least in its scope, but somewhere down the asphalt, Jake the no-patch Snake Plissken unceremoniously veered very slowly left until he hit a fence and exploded.The most imaginative thing that happened to me in my time playing this game is that a noiseless combine harvester came towards me and I had to run away from it.I am going outside now. I am going outside. Look, it's raining. This game is my Shawshank. I am leaving the house now. I am leaving the house."}