{"ref": "https://www.eurogamer.net/deadpool-review", "date": "25 Jun 2013", "game_name": "Deadpool", "text": "One of the problems in adapting The Punisher, Marvel's gun-toting vigilante, to the movies was that, once removed from the colourful spandex morality of the comic book page, the character lost his mojo. In a world populated by Spider-Man, Captain America and Mister Fantastic, a guy who just shot criminals to pieces couldn't help but stand out. Transfer him to the big screen, where scowling vengeful vigilantes are ten a penny, and all of sudden he's utterly generic.Another of Marvel's characters, the crazed mercenary gobshite Deadpool, faces a similar problem crossing over into video games. We're not short of glib, wise-cracking anti-heroes to control with our joypads, so he needs to bring something else to the table. In High Moon Studios' scatological action game, he does. Mostly.That something extra is Deadpool's post-modern insanity, which manifests in a near-constant inner dialogue between his three personalities, numerous fourth-wall-shattering asides directed at the player and an enjoyable willingness to play around with the structure of video games themselves.The game opens with Deadpool hanging out in his grotty apartment. You get an achievement for standing up, which Deadpool reacts to - which then triggers another achievement because why not? You're free to poke around, finding silly jokes and weird references. Deadpool (voiced by Nolan North) phones Nolan North to make fun of him. He cracks gags about Ryan Reynolds, who played Deadpool (badly) in the Wolverine movie. It's a veritable avalanche of self-referential nonsense, and it's a lot of fun.The game that follows, sadly, can't sustain that pace. It is, for the most part, a melee action game with a broad sprinkling of third-person shooter. There's a fast attack mapped to X, a strong attack mapped to Y, and mashing them in various sequences makes Deadpool whirl his swords (and later sai and hammers) with deadly intent. There are counters and combos, gory stealth kills and radial special moves that can be earned through persistent slaughter - but you've seen all this before, and done better to boot.Gunplay is on the triggers, and can be mixed in with combos should you wish. Unfortunately, like too much of the game, you don't really need to. This is a loose and sloppy game, an approach that feels like a natural fit for the free-wheeling main character but can't help leeching the enjoyment from the gameplay as the hours tick by. Button mashing gets the job done nine times out of ten, while shooting feels skittish with guns that lack impact and a fussy lock-on system that is only useful for a handful of foes. Accuracy takes a back seat to a strategy of spray and pray. You'll spin and slash and blast your way through room after room of familiar enemy types, then do it all again, and then do it all again.It's all a little too rough around the edges to convince. Things dip into clumsy 3D platforming far too frequently, scenery snags are common and invisible walls abound. While Deadpool can teleport, you can't use that to travel through walls, gates or even simple objects. That sofa? It's an impassable barrier. Confusing matters even more, late in the game you unlock a longer-range teleport, but that only appears when the game wants you to use it, leading to some awkward navigation as you try to work out how much freedom of movement the game is offering at any given moment.The story is flimsy, but since Deadpool himself couldn't care less about sticking to the script, he tacitly gives the player permission to not pay attention to the details of Mister Sinister's quest for something something clones something. There are occasional cameos from other X-Men characters, but mostly only so Deadpool can mock them. And, for the most part, the humour stays just the right side of politically incorrect. There's one bit with an impaled female enemy that feels a little icky, but mostly the game strikes a balance between indulging Deadpool's adolescent horndog tendencies and reminding us that he's a delusional jerk.It's a game that spends an awful lot of time mocking lazy game design while shamelessly indulging itIt is, after all, Deadpool himself who keeps the otherwise weary gameplay ticking over. Not so much his in-game quips, which quickly grow repetitive, but there are enough swerves into the absurd to keep things from sinking under the weight of the tired core gameplay. Deadpool goes over budget, so the game turns into a top-down Zelda-esque dungeon crawler for a few screens, or a side-scrolling platform game. You'll find yourself involved in sinister carnival games while wearing a pirate hat, fly around in a giant robot shoe and slap an unconscious Wolverine in the face many, many times.At these moments, the game feels brisk, lively and impossible to dislike. But these are sporadic raisins in the thick gluey porridge that is the rest of the game, and while they crop up often enough to make the journey to the next stage bearable, they never really do anything to address the predictable and decidedly average hack-and-slash that makes up the vast bulk of the game. Indeed, if anything, these moments of devilish whimsy draw attention to how clichéd most of the experience is. It's a game that spends an awful lot of time mocking lazy game design while shamelessly indulging it. Irreverent humour can only carry the game so far, and it inevitably runs out of steam long before the end. Upgrades purchased with your ~DP~ tokens don't change your tactics enough, while the game's idea of challenge is to simply throw more enemies at you and make them into damage sponges. The final level is a wearying gauntlet of over-powered foes, while the very last boss fight is a farce - the sort of joyless grind that forces you to run in circles around an enclosed space, waiting for ammo to respawn while you slowly chip away at enemy health bars.Even with this crudely skewed difficulty curve, it's not hard to romp through the game's six stages without too much trouble, and once it's done there's not much else to do, beyond replaying it all again to max out those upgrade trees or dipping into a selection of one-note challenge stages based on locations you've already grown tired of.Fans of the character will be pleased with how well his off-the-wall mannerisms have been realised in game form, and there's enough inspired wackiness to make your first play-through worthwhile, but the same lack of nuance and depth that makes Deadpool such enjoyable company also means that his game is a joke not worth hearing twice."}