{"ref": "https://www.eurogamer.net/game-and-wario-review", "date": "21 Jun 2013", "game_name": "Game & Wario", "text": "Game & Wario creates an odd first impression, but it all starts to make more sense when you take its star out of the picture. If rumours are correct, Wario was surgically spliced into this arrangement of GamePad exercises later on in the development process than you might have expected; even if he was there from the start, the graft hasn't quite worked.Nintendo and Intelligent Systems are offering 16 mini-games rather than hundreds of loopy micro-games this time around, and while they're often inventive, they're frequently complex and even a little cumbersome. The challenges that Wario has historically chucked your way could generally be summarised with a single word and then figured out on the fly. Chop! Sneeze! Dodge! It's not uncommon to fire up one of Game & Wario's activities, however, and find a couple of pages of introductory text to work through. Here's how to hold the GamePad. Here's when to switch your attention between big and little screens.More elaborate games can require more elaborate rules, of course, but for an anti-hero who's always thrived on finding instant fun in new hardware, it's still a bit worrying. With the Wii U, has Wario met his match?Sometimes, it works beautifully. Each challenge you complete in Game & Wario gives you a token, and the tokens can be spent in a capsule vending machine that looks like a chicken. Squeeze the GamePad's shoulder buttons and then release: out pops a plastic egg for you to open with a tap of your finger.And inside? Cripes, inside you could find anything. Scanning through my collection, alongside hint cards, character profiles and a handful of simple standalone micro-games, I've got a voice robotiser, steel wool for blowing onto a man's face where it sits in place of a beard, spinning tops, a chicken beak and a weird sketchpad for writing hitchhiking destinations for panda truckers. The designers have approached the Wii U with quiet craft rather than the gaudy, throwaway flights of fancy you might be expectingThere are 240 of these doodads, apparently, and together they genuinely capture the series' unpredictable sense of humour - something the rest of the game struggles with. Game & Wario is a slow burn. The designers have approached the Wii U with quiet craft rather than the gaudy, throwaway flights of fancy you might be expecting, and your first few hours here could be rather muted as a result. The multiplayer suite is the least inspired. Four of the 16 games on offer are designed for up to five players (although you'll need nothing more than a single GamePad). One of these, Artist, is essentially Pictionary: lovely stuff but hardly a creative victory for the team at Nintendo. Another is a beat-matching competitive spin on the likes of Guitar Hero. Titled Disco, it offers a pedantic kind of fun for two players hunched at either end of the pad, alternating between laying down devious patterns their opponent will struggle to tap their way through, and tapping their way through the devious patterns that come back their way.  Islands sees you flinging little dice-like critters onto a series of targets, hoping to land them on the high-scoring areas. Aiming with the controller held lengthways is surprisingly precise, and the pass-the-pad nature of things makes for pleasantly sociable play, but the game is slow-paced and filled with annoying randomising elements. I suspect it's ultimately a game about chummy chaos, which is fine - but it dresses itself up as a game about skill.The fourth multiplayer option is the most entertaining: a stealth challenge called Fruit, in which agents have to try to spot a thief as they mingle with a crowd of NPCs, stealing a selection of apples, melons and pineapples as they go. The thief uses the GamePad and the agents scan the wider picture on the television. It's a wonderful idea, gaining a lot from the magnificently gormless character art and bustling environments; it feels like a slightly gentler, pared-back version of the glorious Hidden in Plain Sight on Xbox Indie Games, or a toytown spin on SpyParty.The multiplayer offerings might not be the Nintendo Land beater you were hoping for, then. Happily, a lot of the single-player stuff sees Wario's custodians growing slightly more comfortable in their surroundings. A handful of the 12 solo games are genuinely great.Camera's probably the best, offering a tense yet playful addition to the hidden-object genre that, crucially, could only be possible with a second screen. You're a member of the paparazzi, dispatched by your editor to get snaps of various characters lurking around town. The GamePad is your camera, and it offers a limited view of the action when held up to the full scene depicted on the television. It's a design filled with wit as you root around through back alleys, theatre stages and train tracks, even hunting down ghosts at one point. Oddball collectibles provide a little replayability, while the time limit and the need to get decent close-ups of your quarries sounds the necessary note of precision.Pirates, meanwhile, takes that same relationship between telly and GamePad and weaponises it. Your controller becomes a shield in this colourful rhythm-action challenge, and you move it around to block incoming arrows before shaking them off in time with the beat. The landscape evolves as you play, and each level culminates with a dance-off. It's not the most exacting of music games, but it captures some of the same primary-colour energy of Space Channel 5. Sold.After that, Taxi really piles on the pressure. This is ostensibly single-player territory, but, as with Camera, it works best with a co-op partner helping out as a spotter. You use the GamePad screen to steer a taxi around a series of complex 3D environments in the first person, shooting down UFOs, picking up passengers and ultimately blowing a mothership to pieces. Once again, the television shows the entire sweep of the landscape from a fixed viewpoint, and high-score success comes from switching your focus between the micro and the macro at regular intervals. It's a juggling of perspectives which hints at the strange kind of treats the Wii U can offer, and it feels like a rough sketch of something really excellent.If this trio sees Wario gathering imaginative fun around the GamePad with the most harmony, some of the other games prove that a little Nintendo polish doesn't go amiss even when dealing with fairly standard ideas. Arrow takes the lengthways aiming mechanic from Islands but uses it to much better effect, for example. The GamePad becomes a bow as you whittle down waves of creeps and the odd boss who march endlessly towards you over the telly.  The option to stab away at enemies with a finger once they get close enough to move onto the touch-screen itself adds a nice cathartic brutality to a surprisingly exhausting game. Games range from the oddly compelling through to the worryingly familiar - and a few too many fall towards the wrong end of that spectrumSimilarly brisk, Kung Fu is a platformer tackled from an unusual perspective - you view the action from above on the GamePad and use tilt to steer yourself between spars of rock, collecting time bonuses in the form of dumplings. Kung Fu has a delicate ink-and-paper art style to it and wonderfully spongy physics, while the endless mode you unlock once you complete an initial series of countdown challenges might be Game & Wario's best bid at lasting appeal.Elsewhere, lesser games range from the oddly compelling through to the worryingly familiar - and a few too many fall towards the wrong end of that spectrum. One called Design sees you creating robots by trying to draw lines, circles and triangles of certain sizes. It's more fun than it sounds, which is good because it sounds like no fun at all. Patchwork isn't bad, either: a series of felt-placing jigsaw puzzles that's rather too bloodless for a Wario title, but works wonderfully with young kids as they see a collection of pixelart trees, ninja stars and lips coming together out of seemingly random noise. Bird offers a straightforward re-serving of series stalwart Pyoro, and feels like a concession to tradition rather than entertainment, while Ski and Ashley provide tilt-controlled spins on slalom and side-scrolling flying games respectively. Both benefit from wonderfully judged controls and gentle quirk. They're otherwise timid and predictable, though.Bowling at least brings the drama of the unexpected botch. Its main problem isn't that it's yet another bowling game, but that it's constantly interrupting its own flow as you switch attention between the GamePad, where balls are flung and aftertouch tilting is applied, to the telly, where the collisions happen. Inevitably, there are neat ideas here - the pins take the form of Wario characters, each with their own weight and centre of gravity - but the whole thing struggles to build a rhythm.The strangest activity on offer is probably Gamer, however. It's definitely had a lot of thought put into it, but that also means it gets at the underlying problems of the entire collection in the most direct manner. It's 9-Volt territory: he's always been Wario's retro guy, and here it's the original WarioWare itself that gets the nostalgic treatment. The GamePad becomes a GBA, in essence, and your job is to play a handful of familiar five-second challenges on its screen while keeping a weather eye on your surroundings - displayed on the television - for signs that your mum, who's terrifyingly rendered as a supernatural fiend, is going to burst into the room and tell you to get to sleep. You're fighting two battles at once, and a rapidly-draining wakefulness meter tempts you into taking additional risks by feigning unconsciousness at the last possible moment before you're caught.If you ever wondered what a Nintendo game might look like if Borges or Baudrillard were in charge, Gamer is probably your answerGamer feels like a grumbling reminder of how far Game & Wario has led the series from the doodled immediacy of its roots. More worryingly, it also suggests that the GamePad itself is ultimately an additional layer of abstraction. While the Wii broke down the video game control barrier for so many players, pulling them right into the baseball match or onto the golf course, the Wii U may actually do the opposite, erecting an extra boundary between you and the fun. It's used here to create an experience that's all about playing at playing WarioWare. If you ever wondered what a Nintendo game might look like if Borges or Baudrillard were in charge - I for one spend an hour each Thursday pondering this - Gamer is probably your answer. As with too much of the wider collection, Gamer echoes with the distant sound of a barrel being scraped. As a whole, Wario's latest outing is charming but fairly hollow. On the one hand, the presentation is lovely, from the Saturday morning cartoons of the cut-scenes to the weird underground comics realism of the title cards. (Equally, the GamePad behaves itself admirably, adapting to a variety of uses responsively and with almost no need for extra calibration.) On the other, there's little here that's the better of anything to be found in Nintendo Land, and - even more troublingly - there's even less that hints at a vast world of untapped potential beyond the Wii U's first, and far more lavish, collection of instructive mini-games. There's fun to be had, but this isn't the reliable source of brilliant design that it should be. If you expected breezy old Wario to make sense of the Wii U in some fundamental manner, you're going to be disappointed by a game that occasionally seems quietly defeated by its host platform. You'll hope for an epiphany, but in Game & Wario's least inspired moments, what you'll get can feel uncomfortably close to an inquest."}