{"ref": "https://www.eurogamer.net/gunpoint-review", "date": "6 Jun 2013", "game_name": "Gunpoint", "text": "Puzzle games tend to be prescriptive by nature. There's a solution, carefully put in place by the designer, and your job is to work it out. It's less ~how do I want to solve this?~ and more ~how am I supposed to solve this?~ Gunpoint is different. It is a puzzle game at heart, but it's refreshingly relaxed about how you tackle its navigational challenges.You play as Richard Conway, freelance spy. He's hired by various clients to break into secure buildings and steal their secrets. If that concept immediately makes you jump up and down and say, ~Ooh! Ooh! Just like Sega's Bonanza Bros!~ then congratulations, you've got a head start in understanding the gameplay. You view Conway in dinky side-on pixel art, and must work out the best way to get him from his starting point at the left of the level, through the building in question to his prize, and then safely to the subway station on the right hand side of the stage.Blocking your path are ruthless security guards who will shoot you dead on sight and a bewildering array of locked doors, motion sensors, alarms and other gizmos. Making life easier is Conway's unusual athleticism. He can tumble from any height without dying - as evidenced when we first meet him, catapulting from his window - and he also has special ~Bullfrog~ trousers that allow him to make enormous charged leaps. He can climb up sheer walls and hang from ceilings. Imagine if Humphrey Bogart played Spider-Man and you'll be on the right track.The heart of Gunpoint is something called Crosslink, however. This ability, available in the in-game store once you've mastered the basics of getting around, allows you to view all the electronic devices in each level. You can then start to rewire the building to your advantage. The simplest example is connecting a light switch to a door rather than a light. Flicking the switch then opens and closes the door. Thrillingly, there's no limit on what can be connected together. A large part of Gunpoint's considerable charm comes not from the elation of beating a level, but from the tinkering and experimenting that gets you there.Complications arise with the introduction of additional circuits. Marked in glowing neon colours in your Crosslink view, you can only connect items that are part of the same circuit, and accessing those circuits often means finding a junction point and ~wirejacking~ it. It's here that the puzzling ramps up, as you work out how to use the items available to gain access to the junction points that will open up the rest of the level.You can spend Conway's ill-gotten gains on adding new abilities with brilliant names like Prankspasm (which lets you wire plug sockets to items to electrocute guards) and Hushcracker (which muffles breaking glass as you fling yourself through windows). Longshot lets you wire enemy guns to the grid, so that when they try to shoot you, they switch the lights on instead. Or you can do it the other way around, allowing you to shoot their guns by flicking a switch. You can upgrade Conway's jump, too, so he really can leap tall buildings in a single bound.It's here that the game really lets you muck around, finding your own preferred way of playing - and as Conway's toolbox grows, so too do your options for navigating the game's missions. While there are obviously more efficient solutions to every stage, the skillset open to you means that there's never one single definitive way to progress, and the game wisely never wags its finger too hard should you fluke it through in a flurry of broken glass and gunshots.If you mess it up, Gunpoint is graceful in the way it treats failure. You're given a selection of autosave checkpoints to reload, allowing you to rewind anywhere between 1 and 10 seconds to try something different. In the unlikely event that you get really stuck, you have the option of skipping the mission, but you can only do this twice in a game.It's all held together with a delightfully simple art style that is rich in detail and beautifully animated, and a jazzy soundtrack that suits the cheeky film noir tone. There's real life in these chintzy sprites, echoed in a story that is just sarcastic enough to amuse. The intricacies of the dense plot tend to get lost towards the end - the double and triple crosses lose some of their coherence when told entirely through text message conversations - but there's a wit to the dialogue that makes it work.If Gunpoint has a weakness, it's that it's over too soon. Not that the game is too short, exactly, but it lasts only a few hours and is not especially difficult. After you've found the measure of the game's systems, solutions present themselves without too much effort, and once you factor in the escalating abilities at your command the final stages are less of a test than you might hope. A powerful but basic level editor grants some longevity and it's fun to revisit early stages and blitz them with everything unlocked, but the game runs dry just as you're ready to really get stuck in.~Always leave them wanting more,~ goes the old showbiz adage, and Gunpoint certainly does that. It's to the game's credit that you'll burn through its many charms in an afternoon and immediately wish you'd savoured it more. Springing around its miniature fortresses like a flea in a trenchcoat is a tactile pleasure in itself, and the rewiring concept is both simple in action and powerful in execution. Just mucking around in these little sandboxes is a blast - and in that sense, it's the best sort of game, where play is its own reward. More snack than feast, it would be nice if there was slightly more of it to enjoy, but Gunpoint comes highly recommended all the same."}