{"ref": "https://www.eurogamer.net/street-fighter-2-the-movie-review", "date": "27 May 2013", "game_name": "Reviews", "text": "Street Fighter 2: The Animated Movie, as it was originally known, concludes with an advertisement. Following the closing credits, we're told of a forthcoming live action movie based on the same game. ~JEAN CLAUDE VAN DAMME~ it exclaims in monolithic all caps, before revealing, with almost childlike boastfulness: ~NOW FILMING IN HOLLYWOOD~. Capcom's bragging notice, usefully included in this remastered re-release of the 1994 film, provides valuable context. Here is a game-maker riding a crest of popularity, now promoter to a clutch of video game characters who have broken out of, not only their home country, but also their medium. Street Fighter's going to Hollywood. Imagine.Time - the only critic whose judgement ultimately matters - has since proven Capcom's enthusiasm to have been largely misplaced. Van Damme's Street Fighter: The Movie was a critical and commercial failure and, by the end of the 1990s, audiences had largely tired of fighting games in general and Street Fighter in particular (the series would subsequently lie dormant for almost a decade). Nevertheless, Street Fighter 2: The Movie offers a snapshot of a company enjoying the formidable self-belief of the young up-and-comer. There's a skittish energy to this anime, the first feature length movie based on Ryu, Ken and the rest of Street Fighter's world warriors. It's a film infused with the passion of a creative team that believes in its subject matter and is eager to show off its cast.  Directed by Gisaburō Sugii, one-time animation director on Osamu Tezuka's seminal Astro Boy in the 1960s, the film's light plotline barely provides a cogent link between the fight scenes that fill the bulk of its near two-hour running time. M. Bison, the crimson-suited leader of the world's largest crime syndicate Shadowlaw, is tracking martial artists to capture and brainwash before sending them out to assassinate key political figures. Bison sends androids around the world to seek out suitable fighters and these cyborgs score prospective recruits on a curious and diverse set of criteria such as 'strength', 'objectivity', 'metabolism' and 'recoverability'. The scores are aggregated into a total figure to show the competence of a warrior. The highest score yet given to a fighter is 2000 points. Then one of Bison's minions, Muay Thai champion Sagat, encounters Ryu, a Japanese martial artist with an aggregate of 3620.Bison's cyborg monitors are unable to find Ryu and so opt to reach him via the Japanese fighter's childhood sparring partner, Ken Masters. The pair enjoy a tender rivalry, which Bison tries to exploit by capturing and brainwashing Masters before sending him to battle Ryu atop a Thai mountaintop during the final showdown. Alongside this plainly thunderous plotline, we see Interpol agent Chun Li working with military man Captain Guile to investigate Shadowlaw. No sub-plots add variety to the storyline, principally because there is simply no room for them. Capcom's primary aim with the film is to showcase each of the fighters from its arcade game in their natural context.So we meet E Honda, the Japanese ex-pat Sumo wrestler who fights the mystic Dhalsim in the streets of India. We see Ryu do battle with Bruce Lee lookalike Fei Long in the dark belly of some fight pit. We watch as Brazilian monster Blanka sparks and fizzes with electrical discharge while trying to evade Russian wrestler Zangief's spinning pile-drives. In each scene, the character's in-game poise and persona have been recreated on screen, from Ryu's hunched bobbing through Cammy's neck-breaking twist of the thighs to Ken's Californian yuppie lifestyle, all red Porsches and leggy blondes. The aim is always to underscore the game's stereotypes until the audience submits to the marketing spell being cast and the film's purpose shifts from fan-maker to fan-service.This Blu-ray re-release - the first time the film has been made available in true HD - incudes the uncut Japanese version. Now Western audiences can view the uncensored fight scene between Chun Li and Balrog in her hotel room, the former dressed in a lusty nightie that falls open at every opportunity. The scene has the aroma of light pornography, but while Chun Li sustains some life-threatening injuries she manages to defeat her opponent before Guile breaks through her hotel room door to stage a rescue. This victory ensures she maintains her status as a strong, independent fighter - even if she loses some of her dignity in the process.Street Fighter 2: The Animated Movie is arguably the best looking of Capcom's films, its artists juxtaposing colour in arresting ways, infusing each scene with its own tone and character. The backgrounds are, in a cost-cutting measure, often static, but the fight scene direction is exemplary and, if nothing else, it reveals just how recognisable the characters' signature moves had become just three years after the game's original release.Nearly 20 years on, this remains the film's primary charm. There are simply too many fighters to get through for any meaningful character development. A resulting thinness is inevitable and, apart from a smattering of backstory (we learn, for example, how Ryu got his red hachimaki) the film is as light on detail as the video game. It becomes, then, merely a celebration of the series' visual appeal and of the kinetic thrill of unarmed combat. It's as shallow as it is stylish - and yet, in its precise focus, it's nobly effective at inspiring the viewer to want to play the video game upon which it's based. The movie concludes with an advertisement then, but it also begins with one.Street Fighter 2: The Movie is released on Blu-ray by Manga Entertainment and is available now."}