{"ref": "https://www.eurogamer.net/call-of-juarez-gunslinger-review", "date": "21 May 2013", "game_name": "Call of Juarez: Gunslinger", "text": "Following Call of Juarez's ill-advised ride into a modern day setting in 2011's The Cartel - a game that was, at best, culturally insensitive, with its facetious take on the contemporary drug wars in Mexico - we're back to the stirrups and sunsets of the series' spaghetti western beginnings. Techland's series has in the past offered one of the better Call of Duty clones, but in the context of download gaming, where the emphasis is on leanness of ideas and execution, there's a fizzy pungency that was hitherto lacking. Nevertheless, the debt owed to Infinity Ward's Modern Warfare titles remains vast. The games share an almost exact feel. Muscle memory learned in one translates to the other button for button - even if the set dressing is entirely different. Tanks are recast as station wagons, grenades are regressed to hurled sticks of dynamite, while more resourceful enemies wield heavy barn doors instead of the modern Juggernaut's polymer riot shield. Gone are the crimson smears around the screen's edges that indicate when your character is wounded, replaced by gunshot holes that temporarily rupture the glass, obscuring your view. But in the basic exchange between player input and on-screen output, Gunslinger fits the hand like a well-worn cowboy glove.Higher tiers of ideas and systems upset the routine of this increasingly dusty first-person shooter template. As you keel enemy shooters off these sand-bruised rooftops, you earn experience points that unlock skills that can be spent on upgrading your weapons and abilities. Augments are split into three groupings, which broadly correlate to your three firearms: pistol, shotgun and rifle. The wide array of skills on offer allows you to alter the game's tempo and character in discernible ways as, for example, you learn how to dual wield shotguns, reload your guns while sprinting, steady your aim, slow time when aiming down the iron-sights, or how to shoot thrown bundles of dynamite, exploding them mid-air. Your chosen allocation of points demands changes to your tactics, meaning one playthrough can differ significantly from another.You earn greater amounts of experience points for headshots, for shooting enemies while they are running away, or by discovering the so-called 'nugget' collectibles that litter these desert towns. In this way, the designers add meaning to the deadly actions you perform in game, tightening the sense of accomplishment with each successful encounter. Kills also fill a 'concentration' gauge, which can be used to momentarily slow time, useful during firefights in which you're outnumbered. While 'concentrating', you're even able to pick out incoming enemy bullets, strafing out of their trajectory. Meanwhile, 'sense of death' gives you a 50/50 chance of survival when your character is riddled with bullets and ready to expire. As the final bullet streaks in, time automatically slows to a crawl and you choose to lean left or right to dodge its path, earning a chance of survival against the odds. These additions are far from revolutionary, but their combined effect is to save Gunslinger from banality.You play as Silas Greaves, a wizened gunman with a clutch of tales to tell around the bar. This is, in fact, the game's narrative premise, as Greaves recounts his tales of derring-do to an impressionable listener, the game's chapters charting each of his most impressive brushes with fame and fortune. To this end, Gunslinger borrows Bastion's voiceover trick whereby the protagonist commentates on the player's actions, as if the on-screen action is his own recollection of events. The scriptwriters even go so far as to rewind the clock at set points, as if Greaves is fixing a misremembering. It's a wonderful trick, but has less impact here than that we first felt in Bastion, not least because the dialogue possesses less of that game's wit and individuality. The sheer amount of writing needed to fill the air necessitates some painfully drab lines (~that really was one hell of a sawmill~). Nonetheless, the near-constant chatter adds a welcome urgency to the storytelling, even if the tale is rarely worth the effort.Away from the storyline, Techland offers two distractions for high-score-minded players. The first, dubbed 'arcade' mode, presents a clutch of scored special missions. These challenges rate you on the speed of completion, but you can boost your score by linking kills into combos, a multiplier escalating your points total as you work to eliminate the time and space between your destructive acts.A final mode extracts five Mexican standoff scenes from the campaign, asking you to dispatch each opponent as quickly and accurately as possible. In these, you must use the left analogue stick to keep your shooting hand hovering above the holster and the right analogue stick to maintain focus on the target. Reach for your gun before your opponent and, if your aim is true, you'll be labelled 'dishonourable'. Waiting until your foe draws will give you an honourable kill, but requires quicker reactions. It's a well-implemented system, stronger than its counterpart in Red Dead Redemption, that reflects the tension and concentration required in such a life-or-death situation.Gunslinger is an amalgam of borrowed ideas and - in its reimagining of dime store Western fiction - stories. It's a welcome return to the series' original source material, both in its systems and narrative. And as a stripped-down Modern Warfare lite, it sacrifices set-pieces for thicker layers of interaction, even offering a full Bulletstorm-style commitment to score attack. But despite its successes and mild inventions, Gunslinger can't quite manage to struggle free of the general sense of ennui surrounding the corridor shooter in 2013."}