{"ref": "https://www.eurogamer.net/donkey-kong-country-returns-3d-review", "date": "17 May 2013", "game_name": "Donkey Kong Country Returns 3D", "text": "One of the more striking differences between Mario and Donkey Kong is that the gorilla still carries the swagger of an ex-villain with him. He barges, charges and pummels his way through his levels, he's a friend to the hit-pause and the shoulder slam, and his Yoshi stand-in - for the few glorious moments that you generally get to enjoy him - is a grubby little rhino who looks like he might have spent some serious time in the big house. Donkey Kong games feel heavier than Mario games - slower when turning, deadlier when they've picked up momentum. The art's a touch less charming, but to make up for that you get a world of taut drum skins ripe for pounding, hobbling crabs ripe for pounding and, well, anything else that could conceivably be made ripe for pounding, really.I assume the 3DS is taking a bit of a pounding itself with this latest version of 2010's Wii platformer, but new developers Monster Games have handled what's essentially an expanded port with intelligence. Textures aren't quite what they used to be, but the frame-rate never falters, and while neither the weirdly sleepy circle pad or the d-pad offers a truly ideal means of chucking Nintendo's angry gorilla around, they both allow for just enough precision to keep you happy. Besides, to balance that out you get to enjoy the fact that the original game's irritating shake controls have been replaced with face buttons when it comes to the likes of rolling about or smacking downed bosses into oblivion.As for the 3D, that's both blessing and curse with a game like this. Donkey Kong Country Returns was always going to lend itself to the depth treatment on a purely aesthetic level, with its endless barrel-hopping between chunky 2D planes and the pleasure its art team takes in sending foliage scudding past in the foreground or allowing volcanoes to erupt in the far distance. The implementation is typically assured, and it definitely adds a thrill to the game's early levels. It's still stereoscopic 3D, though - and that means you have to keep yourself within a viewing sweet spot while rattling through some worryingly hectic gauntlets. Donkey Kong may ultimately be a little too fast-paced, a little too exacting, to allow you to keep the slider turned up for absolutely everything it chucks at you.And it still chucks a surprising amount at you. Retro's Wii game wasn't just varied and exciting, it could be truly nasty at times, and it's lost none of its wonderful bite here. The original campaign's just as cruel as it always was, then, but you now also have the option to experience its treats via a second mode that gives you extra hearts from the off. There are even a few new one-shot items to buy that grant you nice things like stronger carts, or that save you from the odd plummet into space. It's a smart way of approaching difficulty.Even then, it's quite a challenge to stay alive. Retro's not quite as good at hiding its reliance on the Big Book of Platform Game Ideas as the team at EAD Tokyo, but while its levels easily conform to type, the types are all elegantly handled. There's the bit where you're chased by stuff, the bit where everything's falling down, the bit where platforms rise and fall in lava and the bit where you have to navigate fire-breathing dinosaurs. The game's actually at its most entertaining when it's on rails - give Retro a mine cart and they make it sing, possibly because none of the gorilla's standard offensive moves are quite as satisfying as their animations would suggest.Monster, meanwhile, has added eight all-new levels to slot into the original game's Golden Temple finale. Themed around the lands you've travelled through up to this point, they wisely opt to avoid piling on 3D tricks in favour of ratcheting up the overall challenge even further. There's some brilliant stuff back here, in fact, with my favourite entry blending spike walls, timer switches and disappearing platforms to ludicrously evil effect. Even if it wasn't designed by Retro, it matches the quality of Retro's work - it's just a shame you have to wait to the very end of the adventure to access it.Local co-op returns as well, although as it requires two copies of the game, your chances of seeing it in the wild are probably up there with your chances of seeing a real gorilla wearing a tie and navigating a pulley-system puzzle. The game's precise nature ultimately encourages a solo approach anyway, if you ask me. Donkey Kong Country Returns is a game about falling off things, goring yourself on things, squashing yourself under things and occasionally being eaten by things. So it was in 2010, and so it is now. There are worse ways to spend a weekend."}