{"ref": "https://www.eurogamer.net/eclipse-new-dawn-for-the-galaxy-review", "date": "7 May 2013", "game_name": "Reviews", "text": "Price: £60 Players: 2-6 Time: 120 minutesPitch darkness. Deathly cold. A remorseless place, full of savage, alien life forms. I am, of course, talking about Finland.One of the strong aspects of the board game industry compared its video game counterpart is its reluctance to let powerful releases slip into anonymity. When 4X space warfare game Eclipse stumbled out of the frozen depths of Finland in 2011, it was rapidly snatched up by publishers who fumbled it into the hands of board gamers the world over.This was 2012's biggest release, and it couldn't have happened to a nicer game. Eclipse's masterstroke was in taking a genre with a portentous appeal - claiming star systems, climbing hand over hand up a grandiose tech tree, engaging in HOT LASER DEATH - and compressing it down into just two hours using the same dark Scandinavian genius that brought us flatpacked Ikea furniture.In Eclipse's hands, the 4X genre sees you and your friends warring over planets like hobos brawling over lustrous pennies. Technological advances are no less grave than you'll be used to, but can be claimed easily, as if snatching at sweets. That said, Eclipse was wise enough to leave the HOT LASER DEATH well alone, with you and your friends shredding one another's agonisingly expensive fleets with heavy handfuls of dice.Come to think of it, ~nice~ probably isn't the word for Eclipse.In any case, its relevance has yet to fade, with a huge expansion (Rise of the Ancients) releasing late last year, and just last week it crabwalked back into the spotlight with the release of an iPad port. I'll cover that a bit later.For now, though, let's start with the physical game. Should you buy this £60, 2.7kg box?The answer comes down to whether you have a few friends willing to sit down to a 20-minute rules explanation. If that's not a deal-breaker, progress with your debit card on standby.A game of Eclipse starts with everybody in a shady corner of an unexplored galaxy, though the game immediately begins needling you out into the wild. Most 4X games start with players steadily building their economic machine, developing stardust extractors, asteroid-gobblers, etc. With Eclipse, there's only one way of growing your income of science, minerals and cash, and it's claiming planets. There's also only one quantity of these planets, which is ~Nowhere near enough, what the hell is this, oh JESUS.~The plasma missiles will come later. What glues you to Eclipse from the very first turn is the pedestrian threat of interstellar poverty. Every tech advance you grab is a victory, and every wonderful star system you reveal is a thrill. At which point - and this is one of the weirder sentences I've typed doing my job - Eclipse begins to reveal it's improbably sexy bookkeeping.Your player sheet is covered in three rows of little, wooden colonist cubes. When you dispatch the right-most colonist to a science planet, your new science income is waiting for you beneath that colonist. Not only do you get a similarly tactile thrill to opening an advent calender, not ONLY does this do away with any counting up your income, but you can see what territory players control and their income with two quick glances at the board and their sheet. Very, very graceful, but more importantly it frees up your mind to worry about the fun stuff. Let's start with the hot laser death.At this point you'll probably have come into contact with NPC ships that show up in the juicier systems and squat, threateningly, in the best system of all - the one in the dead centre of the galaxy. To flatten them, you'll need decent ships. A good thing, then, that designing them is great fun.On your player sheet are small, medium and large ships, representing the three sizes of miniature you can deploy to the board. Printed on these sheet ships are tiny grids showing their loadouts, a little square showing their 3 Power nuclear reactor, and another little square showing their 1-dice laser cannon, requiring 1 Power - and so on.Buying tech advances simply gives you access to new tiles to replace these with, at which point Eclipse realises this would be a lot more fun without the rules. Not only can you buy all the tech out of sequence, but any tile can go on top of anything else.Want to splurge on absurd super-shields? Great! Problem is, they require more power than your paltry reactor can put out. But wait... look there. You realise that you can just place a second nuclear reactor tile on your biggest ship, where the armour tile was, and then replace the existing shield with your new one. Yes! At which point you look at what your friends have built, desperate to claim edges of their own. One player is wielding flotillas of tiny missile barges. Another found a monumentally deadly alien targeting computer, but is still sweating over his designs, trying to figure out where best to use it.I could go on. The amount of different technologies to experiment with, star systems to discover, and different racial powers gives Eclipse incredible depth and replayability. But let's move on to the most important thing about Eclipse. The other players.Here's where Eclipse transcends being a great game to become a great board game. With every one of your actions having such expense, such weight, the question (finally) of whose fleets to assault, whose planets to bomb, and who to ally with really is the game.For all of Eclipse's stony artwork and calculated design, it's more garrulous than any 4X videogame you'll ever encounter.Picture the scene: finally, you've found your economic foothold. Factories have schematics for your precious destroyers, the ones protected by eleventeen yards of armour. Obelisk technology is yours, allowing you to increase the victory point value of every one of your systems....And you've just noticed that the player to your left is quietly shuttling fleets onto your border. What do you tell him? How do you convince him that together, you could rule the galaxy?And if that doesn't sound like fun, imagine being the other player.And if that doesn't sound like fun, first off you should see a doctor, but second, imagine going on to enter that fragile alliance, knowing that should one of you attack the other, they're given the horrible Traitor token that's worth negative victory points at the end of the game. ...Until someone else backstabs their ally, at which point the Traitor card changes hands, so now your metagame is in coaxing your friends to attack one another.Actual space opera, together with the confident perfection of most small strategy games, but that's also different every time you play, that you can fit into an easy-going evening. All of a sudden, 2.7kg doesn't seem so heavy after all, no?Which brings us to the iPad app, Eclipse: New Dawn for the Galaxy, ported by Big Daddy's Creations. On the one hand, it's breathtakingly competent compared to many board game ports, featuring a proprietary interface and artwork, online multiplayer, pass'n'play, and even such riches as three difficulty levels of AI and a tutorial.It's also very much a port. Unlike Big Daddy's last project, Neuroshima Hex!, which really did manage to eclipse the physical game, much of what makes Eclipse magical is lost in translation, from the three-dimensional representation of territory control and income to deciding star battles with self-indulgent handfuls of dice. In their place is a cluttered interface, and battles that transpire without the satisfaction of personal involvement.In other words, it's functional, but imperfect. It's also £4.99 as opposed to £59.99. A good deal by any sensible standard.But we're in the realm of pushing tiny plastic spaceships around. We left ~sensible~ behind long ago. The fact is, the iPad version of Eclipse is a compromise. And we're talking about a grand game, here. A game which feels like an absolute gift from the designer. Not just a game, but an arena where you and your friends will be tested utterly, where you'll be forced to debate your way out of corners, manage whole armadas, to wield your economy like a cudgel. Faced with a challenge like that, I ask you: who wants to settle for second best?Quintin is the editor of Shut Up & Sit Down, a board game review site. Visit it for more coverage of this strange cardboard realm."}