{"ref": "https://www.eurogamer.net/pocket-stables-review", "date": "23 Apr 2013", "game_name": "Pocket Stables", "text": "Trawling the Google Play store from an Android phone can be a deflating experience. As shop fronts go, it's poorly designed, ineptly curated, and the vast majority of its game apps are late-arriving ports of iOS hits. Android might be one of the biggest potential markets for games, but Apple's App Store is where the really good stuff is found. Piracy is so rife that I can't blame developers for not bothering - but that doesn't make the situation any less disappointing.So Kairosoft's Android presence is a welcome anomaly. Here is a publisher that regularly releases its games first on Google Play before porting them to Apple devices - if it even bothers with the latter at all. There are a number of Kairosoft games you can't get on the App Store at present, and Pocket Stables is one of the latest to roll off an efficient production line that churns out addictive little time sinks every month or so. In this instance, however, we Android users have no excuse to lord it over our Jobs-worshipping counterparts. Pocket Stables is Kairosoft's worst game to date - and given the developer's remarkable consistency, that's interesting in itself.At first, it seems like any other game from Android's most prolific studio. You have a settlement - in this case, a ranch - which you're asked to expand and make more welcoming and attractive to visitors, in turn raising its profile and allowing you to improve it still further. Familiar stuff, then, and this is the kind of gameplay loop that's worked wonders for Kairosoft so far.To encourage visitors, you're asked to train horses to win races; the more you win, the more money you have to spruce up your stables. There are various facilities you can use to increase the stats of your chosen steeds, and you can hire jockeys to automatically set them on a given training regime. You can spend a bit extra on specialist exercises for an instant boost to dexterity or stamina, for example, but the speed stat is the only one you really need to keep an eye on.That's because you rarely need to adjust your race tactics to finish in the top three. In my first 15 races, I won 12 and placed twice, and the only time I finished outside the top three was a longer race that I'd accidentally entered a fatigued horse into. Even then, it was practically a photo finish for third. As long as you have a decent jockey with a good Drive stat, you can hit the front early and remain ahead for the rest of the race. Sure, it might be more fun to snatch victory with a storming late sprint but it's a much less efficient strategy than a fast start. Kairosoft games aren't renowned for being difficult - they're much too keen to encourage you by celebrating every tiny victory - but at times, Pocket Stables is laughably easy.Because you're winning from the outset, there's little sense of progress when it comes to racing, and there's not enough narrative context to make later events more meaningful than earlier ones - beyond a larger pot for winning, at any rate. Once you've discovered the auto-win strategy, it's like watching a series of near-identical equine processions, with the only difference being the colour of the track and the margin of victory. At one stage I entered a race without bothering to train my horse in the interim, and he cantered home about six lengths ahead of the second-placed nag.It's not as if you can form a particularly meaningful attachment to your horses, either: once they hit the ripe old age of three, you're going to have to think about replacing them with a younger model. You can breed them, of course, and any key attributes will be passed down to the young colt, making it even easier to win. In other words, all you have to show for your efforts is a larger and prettier set of stables, while your horses become little more than a commodity. Combine that with the ruinously low difficulty level and Pocket Stables feels hollow and cynical. Kairosoft's traditionally cutesy trappings aren't enough to save this one from the knacker's yard."}