{"ref": "https://www.eurogamer.net/assassins-creed-3-the-tyranny-of-king-washington-part-3-review", "date": "23 Apr 2013", "game_name": "Reviews", "text": "The Redemption is Ubisoft's finale to The Tyranny of King Washington, a three-part downloadable expansion to Assassin's Creed 3, set in an alternate-history timeline. The mini-series opened in a darker and bloodier version of the game's Frontier area but began to lose steam when the action headed back to Boston. Thankfully, the story picks up pace in this final chapter, although the eventual explanation for its parallel universe setting leaves something to be desired.As the episode opens, Ratonhnhaké:ton is on his way to New York, back aboard the Aquila and finally ready for some more ship battles. It's a Michael Bay-sized introduction to the episode and a welcome reminder of how fun the game's naval sections are. With Assassin's Creed 4: Black Flag on the horizon, future protagonist Edward Kenway even gets a name-check.Wasting no time, Ratonhnhaké:ton lands and downs another bottle of his Native American secret sauce, this time enhancing him with the strength of a bear. It's probably the least exciting of the three animal mechanics: you can now perform a ground pound, clearing any enemies in a nearby radius. The move's introduction comes in an artful dream sequence, however, which sees you clambering over a monstrous bear to pull spears from its pelt as it roams.New York's map is radically altered - Washington is building a great big pyramid right in the middle - although it's the sheer number of enemies that is most noteworthy change. You can barely flit across a rooftop without someone spotting you, and the inevitable chase/kill/hide loop kicks in. The sheer relentlessness of your foes makes traversing the city a chore. You can fast-travel to key missions, of course, but you may still want to wander off the beaten path to complete the usual round of side-quests. This is where things get infuriating. The bear power helps a little to clear enemies, but the notch of health it takes to do so and the seemingly never-ending clusters of guards that swarm you mean the power's effects are more often a hindrance than a help. At one point, the game bugged out on me, removing all enemies from the map until I accessed the next mission. It was then that I finally got a chance to explore the world properly - and to be honest, it was a welcome respite.The Redemption's main missions are, thankfully, more sound. There's a fun cart-bound section where you must balance atop a fruit-laden wagon while protecting its wares, and there's another chance to spark a city into revolt. Then, finally, you enter Washington's pyramid, a location reminiscent of the old tombs in earlier Assassin's Creed games. It leads to a final boss fight that's an evolution of those found in the episodes so far.The conclusion that follows wraps up The Tyranny of King Washington in a rather brief fashion, and it will feel briefer still if you haven't collected the memory glyphs scattered throughout the past three episodes. For a story founded on wackiness - and as part of a series that deals with pre-human gods and apocalyptic solar flares - the explanation of Tyranny's origins feels a little underwhelming. And, perhaps mindful of those who might skip these add-ons, Ubisoft does not pack in any revelations that concern the series' wider narrative. It seems a long time ago that Ubisoft first spoke of this DLC season, but something I was told back then aptly sums the mini-series up. The Tyranny of King Washington is very much for fans. If you dip into Assassin's infrequently you will likely question the worth of this self-contained side-story. But for those keen to experience every nook and cranny of the Creedverse, Tyranny offers an enjoyable and different experience - if not an essential one."}