{"ref": "https://www.eurogamer.net/afrika-review", "date": "18 Apr 2013", "game_name": "Afrika", "text": "Dear contempt456, Bad news, I'm afraid. No, you cannot run over a lion in Afrika. Nor can you break its legs off. Nor can you tie an elephant's trunk in a knot, cut off a giraffe's head or inflate a hippo till it goes pop. You can't even make a monkey wear an embarrassing hat.So Afrika is probably not the game for you. In fact, Sony has decided it's not the game for anyone outside of Japan - at least not enough people to make a release commercially viable. If you want a copy, you'll have to import one. And unless you can understand Japanese, you'll spend the first hour or so turning to websites like GameFaqs as you try to work out what's going on. This isn't too tricky, as there's not an awful lot going on. You explore pretty African landscapes and take pictures of animals. That's about it. Tedious? You may well think so, if breaking the legs off lions is your idea of a good time. But give it a go and, like me, you could find playing Afrika to be a relaxing, rewarding and enjoyable experience. Even though at no point do you so much as get to give a zebra a Chinese burn. You play as a wildlife photographer based in an unspecified African country, almost as if the game designers consider all the countries of Africa to be basically the same anyway, in the same way some non-Europeans think Spain is the same as Ireland. There are two characters to choose from - a small American lady and a tall French man. Why the French man is wearing a beanie hat in the middle of Africa is anyone's guess. Perhaps he's just incredibly lifestyle, in which case he should be at home with his Wii and white furniture. It might have been nice to have the option to play as, you know, an African. There is a non-playable African character in the game, though. He gets to drive the jeep. Whichever character you don't pick will be waiting to welcome you at base camp. Here you can store and select camera equipment, look at the map and rest overnight. You can also chat to the American lady / French man between missions. If you don't understand what you're chatting about because you can't read Japanese, you can have a nice time making up what they might be saying in your head. (~Hello. See any lions today?~ ~No, just boring old gazelles again. Has Hollyoaks started yet?~)Most importantly, base camp is where you'll find your laptop. This is used for storing your photos, updating the electronic field guide with new animals you've spotted, buying new items and saving the game. It's also where you receive emails from clients with briefs on what they want you to photograph next (helpfully for non-Japanese speakers, the emails have relevant images attached)."}