{"ref": "https://www.eurogamer.net/call-of-duty-black-ops-2-uprising-review", "date": "17 Apr 2013", "game_name": "Call of Duty: Black Ops 2", "text": "It seems like only last week that I was praising Halo 4's Castle map pack for its old-fashioned focus on good, solid maps with nary an overarching theme or eye-catching gimmick to tie them together. That's because it was last week, and already here's Black Ops 2 to illustrate the point with its latest exuberant blast of downloadable content.Call of Duty has always been the big, boisterous puppy of the shooter scene, and that's never been more evident than in this goofy quartet of new multiplayer maps and bonus Zombies campaign.Studio is a good example of where this map pack is coming from. A remake of the Firing Range map from the original Black Ops, it's a tense cluster of enclosed spaces with long, vulnerable lines of sight separating them. In the centre, a raised tower offers an ideal vantage point for snipers, though its obviousness makes it an immediate target and the threat of a melee kill from a ladder-climbing enemy means it's only tactically valuable for bold players.What makes Studio notable is the setting. Where Firing Range was set in a perfectly appropriate military training facility, Studio - as the name suggests - takes place on a Hollywood backlot. This means that the map is a bewildering collision of themes, with a medieval castle, sci-fi space base and western saloon all thrown together. None of it is real, of course, and the thin wood of these fake façades is easily pierced by bullets, leading to an arena where the line between safety and cover is terrifyingly blurred.These fixtures are also used to keep players off-guard, giving the map a giddy, funhouse feel. There's a miniature city set that makes you feel like a giant. A space station set has an optical illusion painted on the wall to make it look like a long corridor rather than a small room. Also, as in Firing Range, there are moving targets sliding back and forth, but these are now in windows and doorways, deliberately placed to trick nervous players into letting off a few rounds at a dummy. Canny players, of course, can even hide behind these decoys and use them to mask their very real lethal intentions. Elsewhere there are offices with posters for such fictional movies as Beast from Below and Space Monsters from the Moon, cluttered storage rooms, a crashed UFO and a giant alien death machine.Encore has a similarly entertainment-based theme. Set at an open-air rock concert on the banks of the Thames, it's a large semi-circular map consisting of sweeping seating areas facing down towards the open space in front of the stage. There's also a large backstage area from which you can gain access to the stage itself. A well organised team can use this position to dominate the map, but doing so requires flawless coordination as the nature of the location is perfect for flanking manoeuvres. You can also make like a roadie and venture into the cramped corridors that lead under the stage. There are even toilets and more open, courtyard-style locations facing the river, while at the top of the arena, behind the audience seating, is a control room. The rock concert setting is a gimmick, certainly, but it's one that lends itself to a unique and challenging combat scenario.The gimmicks continue with Magma, set in a Japanese town in the aftermath of an earthquake and/or volcano. This is an odd map, full of dead ends and awkward corners, where movement is impeded and often requires climbing or jumping down to make your way around. In that sense, it's the least COD-like of all the maps, feeling closer to something you'd find in Battlefield, though on a much smaller scale. Certainly, the frictionless sweeps through the map that give Call of Duty its distinct flavour are hard to recreate here.That's not to say there aren't interesting features to be found. There's a ruined karaoke bar interior, plus several other shops and buildings, some offering an upper floor - rare moments of verticality in a very low-level map. There's a subway car that has sunk into the ground, creating a V-shaped passage way where it's easy to bump into an enemy by surprise.Perhaps the strongest feature is also one of the simplest: there's a sunken pit where the Hardpoint can spawn, and it's also used as Capture point B in Domination. Holding this spot turns you into fish in a barrel, its tight confines and vulnerable position making it a distinctive and troubling challenge.Plus, of course, there's magma. This threat doesn't spread, but it does restrict and shape the paths you can take and - yes - you will die if you blunder into it. It's a novelty, but one that feels inorganic, more of a distraction than a feature that weaves itself naturally into your matches.The last of the four maps, Vertigo, does a better job of tying its environmental hazards into the match. Set at the top of a luxurious Mumbai skyscraper, it's easily the most traditional and typical of the Uprising selection. Indeed, it's incredibly similar to Overwatch from Modern Warfare 3, both in setting and the way the action flows between wide outdoor areas at one side to cramped interiors on the other. If Vertigo has a point of difference, it's that there are several points where quick-witted players can break windows and jump down from one path to another, risking a fatal plunge in the process.Meanwhile, Treyarch continues to tinker and tweak the Zombies template, though it still falls frustratingly short of the compelling experience it should be. This time, you're playing as four convicts whose plot to escape Alcatraz goes awry when the undead show up. The characters are voiced by gangster movie veterans Michael Madsen, Ray Liotta, Joe Pantoliano and Chazz Palminteri, the sort of meaningless extravagance that only Activision could get away with. These certainly aren't characters worth getting to know, but there's a perverse appeal in hearing experienced actors clumsily explaining nonsensical gameplay concepts.Key among these concepts is the afterlife, a new feature introduced to Zombies for this DLC. When you die, you get one chance to come back as a sort of electrical levitating spirit. Invulnerable in this state, you can float around and quickly blast the undead - or restore power to inert machines - before having to return to your body. It's a gloriously dumb idea, but one that impacts the gameplay in significant ways. These bursts of supernatural power can really help to clear an area, but you won't earn any points for the zombies killed in this way. Since those are the points you'll need to open new areas and buy more weapons, there's a fraught tension between the need to survive and the need to progress.The goal is to escape from Alcatraz island via a jerry-rigged plane on the roof. Getting there means close co-operation and no small amount of trial and error as you work out where the parts you need are hidden and how to reach them most efficiently. As before, there are custom items and amazing weapons that can be crafted, but only by the most skilled and experienced players. There's also a demon portal that feeds on defeated zombies for no apparent reason. Those who feed the beast will earn a very cool melee weapon.It's the closest Zombies mode has come to really succeeding in its various incarnations since that first simple farmhouse survival map unlocked at the end of World at War, but it's still blighted by vague goals and unclear mechanics. There's something refreshingly brutal in the way Zombies offers only the loosest environmental signposts as to what needs doing, or how to do it, but for a co-op game it's often impenetrably obtuse. All it takes is to be teamed with people who have no idea what to do and the whole enterprise is a bust. That leaves the mode as a robust treat for the minority who ~get it~ but a rather clumsy stew of good ideas haphazardly implemented for everyone else.Indeed, ~clumsy stew~ is a good description for Uprising in general. The multiplayer maps are decent but a little too interested in goofy novelty over core mechanics, and Zombies mode continues its slow and awkward evolution towards something interesting. Everything contained in this package has its moments, but in the long term I suspect players will gravitate back towards the maps that play to COD's inherent strengths, rather than its reputation for high-concept bombast."}