{"ref": "https://www.eurogamer.net/the-silent-age-review", "date": "8 Apr 2013", "game_name": "The Silent Age", "text": "Stylish and simple, there's much to recommend in this free episodic point-and-click game from Danish indie studio House on Fire. An elegantly constructed time-hopping adventure, its only weakness is a fondness for puzzles that are just a little too easy.You start the game as Joe, a hapless janitor working in a shady government installation in 1972. After performing a few mundane tasks, you're sent to clean up the basement laboratory where things take a darker turn. There's blood all over the floor and a dying man hiding in a locked room. With his last breath, the man insists he's from the future and implores you to find his younger self and prevent him from travelling through time in the first place. Apparently the fate of mankind itself is at stake. With that, he hands you a tiny handheld device and dies.It's a neat premise, leaving the player with a clear long-term goal but little idea of what it actually means. We're never allowed to run ahead of Joe as the story unfolds at its own tightly controlled pace, with only occasional bursts of exposition and several subtle clues dropped in your path as you concentrate on more immediate problems: escaping from buildings, opening locked doors, finding where our mystery man lives and repairing a broken down ambulance to reach him.The handheld time travel device is at the heart of every puzzle. Charged by solar power - your first task is to find a way to get it into the sunlight so it will work at all - one press immediately transports you between 1972 and a desolate and eerily uninhabited 2012.The game wisely contains its challenges in short, self-contained chapters, but the ability to hop between two time zones essentially doubles the number of locations open to you. Sometimes the way past an obstacle is as simple as jaunting forwards or backwards to a time when the obstacle wasn't even there, but often you're required to do more exploring and item-hunting. The things you need are never hard to spot, however, and solutions are sensible and realistic. There are no bizarre object combinations or unlikely uses here. If you find a tire iron, you'll be using it to fix a tire. You're always aware of what you need to be doing, so with limited locations and a handful of usable items to hand it's never particularly difficult to progress.While The Silent Age may not stretch your mental prowess, it's never less than engaging thanks to some great writing. Joe's character shines through, a man so used to life dumping on him from a great height that he never questions why his every turn is blocked by yet another problem to be solved. There are even some welcome comedic flourishes, such as Joe's admiration for the durability of polyester when a pair of ~great pants~ hanging on a washing line in 1972 are still intact in 2012, even when everything around them has rotted to rags.The game also looks lovely, with a bold visual style in which Joe's red boiler suit contrasts beautifully with the sterile 1970s and the washed-out future. Locations are rich in detail without being overwhelming, and the creepy moments are well handled.The Silent Age won't take long to complete, and when you do you're presented with an advert for the second - and final - instalment in Joe's tale. You can donate to help make that a reality, although House on Fire's website says that the next episode will be a paid app rather than free. Having completed this charmingly designed taster, you won't begrudge them the income."}