{"ref": "https://www.eurogamer.net/luigis-mansion-2-review", "date": "22 Mar 2013", "game_name": "Luigi's Mansion 2", "text": "Luigi has always been the human face of the Super Mario Bros. - and let's face it, they could do with one.  Irrepressible, indomitable, upbeat to a frankly rather irritating fault, Mario - who meets every situation with a WOO-HOO! - is a global icon for a reason, but that reason is not that he's easy to identify with. He started out as an everyman turned superhero, but he's since become an abstraction, a squawking bundle of heroic momentum hiding behind a moustache. He's loveable, but not exactly likeable.Luigi usually serves as his comic foil and Nintendo hasn't spared the whip, imbuing him with all the failings his brother lacks. 2001's Luigi's Mansion - a very rare starring role for the green beanpole - memorably spoofed his cowardice, gullibility and greed in a comic adventure that had him winning a spook-infested pile in a contest he'd never entered. Luigi wandered its cobwebbed halls, knock-kneed, hastily hoovering up shiny loot as well as ghosts and calling weakly for his missing brother at the tap of a button.It was a charming and original game and it's fondly remembered - though at the time, following the epoch-making Super Mario masterpieces of the '90s, this compact caper seemed like little more than a sketch. Almost 12 years later, Luigi gets a second shot at a leading role in this sequel for 3DS, and this time there'll be no half measures. This is his moment. Luigi's Mansion 2 (known as Luigi's Mansion: Dark Moon in North America) is a wonderful fulfilment of that game's promise - and it also makes Luigi into a bonafide star.Among this game's virtues is some of the finest animation you've ever seen in a video game. The care lavished on Luigi himself is astonishing. Every movement will make you smile, from his pot-bellied scamper when you hold down the run button to his tiptoed ghost-hunting stance, or the elaborate Stan Laurel set-ups for each scripted pratfall. The sound is magnificent too: Charles Martinet, long-time voice of both the Bros., outdoes himself with a classic comic performance. He offers dozens of variations on wordless, nervous, nasal ineptitude and hums tremulously along with the catchy Scooby-Doo tunes.This Luigi has a warmth and humanity you didn't realise were missing from the dazzling, surreal Super Mario games. His world is more grounded, too - once you get past the typically lame frame for the action. King Boo has fragmented the Dark Moon that shines over Evershade Valley, sending the ghosts mad, and Luigi is unwillingly summoned by the pint-sized crackpot Professor E. Gadd to strap on his trusty Poltergust vacuum and fix it. Things get a little more interesting by the end, but this inconsequential set-up is hardly Hanna-Barbera, never mind Pixar. (Also, I preferred it when the mansion really was Luigi's.)Never mind the big picture, though, because this game is about the fine detail. Luigi has not one but five haunted spots to explore in this sizeable adventure, and each has been put together with impressive craft. After the familiar beginning of Gloomy Manor, Luigi explores haunted towers overgrown with plants straight out of the Little Shop of Horrors, then a crumbling clock factory filled with rusting contraptions... The settings get more inventive, but they're all wonderfully wonky and decrepit, busy with detail, and stuffed with puzzles, secrets and gimmicks. Luigi's Mansion 2 comes with an improbable multiplayer mode in the Four Swords vein. Four Luigis work together through the randomised floors of the titular Thrill Tower, either hunting ghosts in Hunter mode, searching for an exit against the clock in Rush, or chasing those damned Polterpups. You can choose to run through five, 10 or 25 floors, and the mode's available to play locally, online and (in cut-down form) via Download Play. It's a fun scramble with a few nice touches, but with the best will in the world it hasn't discovered any interesting multiplayer dynamics hiding in the core of Luigi's Mansion.The sheer density of the set design is what sustains the game. Each location is divided up into half a dozen levels, capped with a memorable and theatrical boss fight. You might be hunting a ghost who's made off with some MacGuffin, chasing the exuberant hound Polterpup or simply cleaning house after a spider infestation. Each level mixes new rooms with some you've seen before - but whilst this could easily seem like thrift in another game, here exercising your knowledge of every trap door, false wall and hidden compartment is part of the pleasure. Only the repeated Polterpup levels feel like padding.You're constantly rewarded for poking around. As well as the cunning set-piece puzzles that move you through the game or expose the ghosts, there are fountains of coins, gold bars and fluttering banknotes hidden everywhere, not to mention one-of-a-kind gems and the especially elusive Boos (visiting from Mario's variation on the ghost house theme). Amazingly, no two hiding spots are exactly the same, and there's invariably some kind of trick or gag or riddle to uncovering every one of them. This game will niggle you with secrets long after completion.You're doing all of this with Luigi's torch and the Poltergust, which can sweep dust, suck posters off the wall, spin fans, tug on drapes and tendrils, and generally interact with almost anything in unexpected ways. His torch, meanwhile, can activate electric gizmos with a flash and comes with a Dark Light attachment which exposes hidden objects and anomalies.These are combat tools, too. The various varieties of ghost must be stunned with a strobe from the torch - sometimes after exposing them with the Dark Light Device - and then reeled in with the Poltergust (in what is still a brilliantly opportunistic bit of pop-culture theft that's never been bettered by any licensed Ghostbusters game). These tugs-of-war between Luigi and the ghosts are frantic, elastic and tactile - perfect cartoon action, in other words - and the ghostbusting as a whole has that judicious layer of control complexity that Nintendo likes to apply, just to keep you on your fingertips. The 3DS' lack of a second analogue stick (the game doesn't support the Circle Pad Pro add-on) means it's tough to move and aim at the same time - an unwelcome bit of stickiness in an otherwise superbly finished game.Luigi's Mansion 2 was made by Vancouver's Next Level Games, which has collaborated with Nintendo before on Punch-Out!! for Wii and the Mario Strikers games. A rather plain front-end aside, you'd never guess it wasn't the product of Nintendo's famed internal EAD teams: it's mischievous and winning and impeccably designed, easily a highlight of the 3DS line-up.The cherry on top is the presentation, which is stunning by any standards, never mind for a handheld game. The exquisite animation, striking lighting and evocative set design always have their best side to a camera that never puts a foot wrong - and every angle is positioned to make the best of the 3D effect, which turns the meticulously detailed interiors into a living doll's house in your hands. It's gorgeous, as close to a playable cartoon as anything since Zelda: The Wind Waker. That's a big name to drop, but if Luigi's return doesn't quite put him in that class, it puts him in the running among Nintendo's finest. Here's hoping it doesn't go to his lovely, stupid, fallible head."}