{"ref": "https://www.eurogamer.net/starcraft-2-heart-of-the-swarm-review", "date": "19 Mar 2013", "game_name": "StarCraft II: Heart Of The Swarm", "text": "StarCraft 2: Heart of the Swarm may be classed as an expansion, but it's also a couple of games in one. Like Wings of Liberty, the foundation it builds upon, it's a real-time strategy game that has dared to pull its single-player and multiplayer components apart, balancing units differently for each mode and locking out dazzling solo toys when they'd unbalance competitive games.That's why we've chosen to examine each element separately - and with separate reviewers. First, Christian Donlan turns his attention to Heart of the Swarm's campaign, which shifts the storyline's focus from the Terran forces to a wronged Sarah Kerrigan, the former Queen of Blades, as she starts to rebuild the various wriggling broods of the Zerg. Then our multiplayer man Rich Stanton looks at the refinement and rebalancing of a genuine gaming phenomenon. Part galactic soap opera and part chess match, part game and part sport, StarCraft 2 sounds like a potentially unwieldy beast. As our single score attests, however, there's a unifying principle at work: an attempt to broaden the reach of strategy gaming without sacrificing its deeper pleasures.The hallmark of a Blizzard game isn't the art, the schoolyard pulpiness of the subject matter or even the depths of tinkering each project endures before it's finally presented to the public. It's the fact that this developer, above almost all others, knows when to give you so much power that you start to feel bad for the people you're up against.This is a sensation you'll revel in at carefully spaced moments slung throughout Heart of the Swarm's single-player campaign. An unknown unit turns up, an old ally learns a fresh trick, a new button suddenly appears on the UI. It flashes at you as your foes cower. It might as well be labelled: Oh, go on then.Enemy Within is a case in point. A mission situated towards the end of the 20-level campaign, it's set on a Protoss ship and blessed with a simple objective: infest. You start off as a single larva, avoiding patrols as you gather the essence you need in order to evolve. Minutes later you're a towering brood mother directing quivering hordes of Zerglings to ravage whatever remains of the crew. It's a study in escalation that challenges Katamari Damacy, but it's also a dazzling clash of textures and shapes as the hard edges of the Protoss are overwhelmed by the wriggling mass at your command.The Zerg are a great fit for Blizzard, and Heart of the Swarm sees them playing to the developer's strengths in excess. Wings of Liberty's campaign took pains to cast you as the scrappy underdog: a cadre of deep-space smokey joes, ekeing out a good time around the Wurlitzer while they rocketed from one guerrilla battle to the next. With ex-Ghost Sarah Kerrigan at the helm, you're still told your forces are under threat, but it can be hard to believe that when you see the Zerg on the battlefield, erupting from their eggs and racing across the landscape in a thick-pile rush of dripping mandibles.After the Terrans, there's a genuine bodyshock to it, actually: you're out of the toybox and into the flower bed where nasty things burrow and squirm. New forces are mutated out of larvae let loose from tumorous hatcheries rather than deposited in neat ranks outside of barracks, and your units are organic horrors like Aberrations, melee heavies whose spindly torsos pulse with throbbing purple boils. Rocking up with a bunch of Aberrations is the ultimate insult to your foe: you're administering a smackdown via a bunch of grapes with legs.Taking your army's trembling biomass as a thematic cue, Blizzard spins a yarn about hyper-speed evolution as Kerrigan drifts between humanity and the Zerg in order to wreak vengeance for various wrongs. Cheesy as her internal conflict is, she's a more engaging lead than Jim Raynor, and the campaign has a welcome momentum as she travels the universe in a sort of disco gallbladder gathering scattered broods. She's getting the band back together! While Blizzard's narrative work is never far from self-parody, it retains a peculiar kind of integrity, a homespun charm that survives even the most lavishly produced cut-scenes.Evolution cuts to the heart of what's new on the ground, too. Between battles, you'll get to upgrade units, picking from a trio of neat soft-choice perks one minute and more elaborate hard-lock evolutions the next. Do you want roaches that slow enemies with acid or roaches that split downed foes into two mini-roaches? Do you want Ultralisks that release poison gas, or Ultralisks that return from the dead? It's freedom within constraints - the constraints, of course, being that Blizzard's exhaustively tested all of your freedoms in advance.You'll also evolve Kerrigan, a hero unit who dots around the battlefield providing the necessary focus for a race that might otherwise tend towards sheer strength in numbers. Her upgrade tree's filled with colourful treats that will put you in mind of Diablo. It's still a game about base-construction and managing an economy, and missions can definitely still turn on one poor tactical decision, but Kerrigan brings an unpredictable immediacy to the fight that allows strategy DNA to mingle with that of the action RPG in empowering ways.Beyond the 27 levels of the campaign - although, granted, seven of those are shorter, tangier evolution missions for specific units - and the near-endless race up the multiplayer ladders, StarCraft 2 players will find the Arcade: a hub for mods made by the community.There's a lot of it, and its sheer range can be dazzling. In amongst single-player set-pieces and riffs on MOBAs, you'll find StarCraft's units pressed into service during action RPGs and even the odd puzzle game.Blizzard clearly sees Arcade as a long-term project, but the developer's done much to allow for ease of discovery: games can be searched for by genre, and you can provide a rating for the stuff you've played, in order to allow the better efforts to rise to the top. Riddled with playful oddities, Blizzard's experiment in user-generated content makes a welcome addition to the package, then, even if it sits rather awkwardly within the broader context. (CD)With no need to introduce the strict nuances of multiplayer, the campaign explodes into a babbling froth of gimmickry, and it counters your wild strengths with equally elaborate opposition. Maps feel snug and can seem rather narrowly channeled at times, but they always channel you past things you'd want to see, whether it's that ice world where flash-freezes descend with alarming regularity, or a jungle where a sleeping monster can be roused with a snack. One standout mission sees you sending a coiled Slinkee of gloop across a long, thin map as you activate the universe's most hideous turrets: cold strategy meets the fleshy reaches of your own power.That's a striking combination, and it creates the most tidal RTS I've ever played. By the final missions it feels like you're directing an ocean across a series of knotty plains. You'll need to put in careful thought to get to this point, of course, but once you're there, you're given a chance to revel in mindless power for a few minutes: to wield the swarm you've taken pains to amass.How does that feel? On my final push towards the enemy's base in one mission deep in the third act, I set a waypointer for the climactic slaughter and then parked the camera a little way back, above a bridge that formed a natural bottleneck. For a minute or two, I just sat and watched my forces march past as screams and explosions started to swell in the distance. Balance and challenge lay far behind me by this juncture. This was revenge territory. Revenge on the peerless multiplayer, perhaps, that has to keep the crazier impulses of the developers in check. Revenge on other RTS campaigns that too often give you thrillingly deadly toys, but struggle to provide meaningful opportunities for using the best of them. At the start of most multiplayer games in StarCraft 2: Heart of the Swarm, both players will type ~gl hf~. Good luck, have fun. It's something you'll see observed from Bronze league to the highest ranks of competitive play, a nod at the start of hostilities and a little reminder of just how seriously people take this special game. Wishing your opponent good luck is simple courtesy; reminding them it's supposed to be about fun? Only in video games and, perhaps even then, only in StarCraft.StarCraft 2 is a game that lives and breathes the competitive spirit, a constant striving among its many categories of player towards some sort of mastery - whether that's riding high in Grandmaster or trying to get out of Silver league. It can be all-consuming. Heart of the Swarm's multiplayer is not merely the product of its own lengthy beta, which showed Blizzard at its tweaking best, but several years of Wings of Liberty being stress-tested by the finest players on the planet.The multiplayer now offers several ways for new players to ease in, including practice matches against increasingly competent AI and, beyond this, the opportunity to play other humans in unranked games. But let's not beat around the bush here, StarCraft 2 is about ranked games, and specifically the laddering system that divides players into leagues based on ability.StarCraft 2's star feature often goes unremarked: its matchmaking. It is simply peerless. The stated aim is that all players should have a win-loss ratio of 1:1, so winning 50 per cent of the time. After my first 50 games of Heart of the Swarm I'd won 25 - and, more than this, it had corrected and re-corrected my league rank several times. A frankly embarrassing set of qualifying matches (thanks Protoss) saw me placed in Bronze initially. A swift change to Terran and within two days I was back in Platinum, before an ill-advised Zerg dalliance saw a demotion to Gold.The point is that Heart of the Swarm was able to effectively gauge my skill across the league system and make adjustments while serving up opponents at the same level and keeping that win ratio consistent. It has an uncanny knack of bringing you together with players that seem beatable, but just as often turn you over - it's incredibly rare to get a total mismatch. This quality of matchmaking is insurance for your time investment; it's almost a guarantee of a good game.On the battlefield, Heart of the Swarm excels. The new units need to be thought about in terms of their armies, rather than as individual action figures, and each one enriches the interplay between StarCraft's three races in little and big ways.I'm a Terran man, so let me tell you about the Widow Mine. At the start of the beta this was a suicide unit, but now it burrows and unleashes one powerful splash-dealing shot to any enemy within a small radius, then goes on a long cooldown of 40 seconds. At its most basic, this is excellent static defence. But if you're playing a 'bio' style, which means lots of faster and individually weaker infantry units, one or two widow mines can be a devastating support line for small battalions in the early game; tempt an engagement, then pull back to the mines and boom. When playing 'mech', widow mines are tremendously good for protecting siege tanks and booby-trapping corridors, giving an essentially slow-moving army a way of heading off flank attacks. And that's not to mention their terrifying ability to burrow in enemy worker lines and rack up the kills: the gift that keeps on giving.The Zerg feel fabulous in Heart of the Swarm, unsurprisingly, with their new units unlocking horribly effective tactics. The Viper, a flying spellcaster, can 'blind' enemy units temporarily to let your forces rush in close, while Swarm Hosts let you siege enemy positions with endlessly spawning, high-damage locusts. The Viper in particular feels like a mainstay, if only so you can 'yoink' Colossi out of Protoss deathballs - but what's just as impressive is the rejuvenation of Hydralisks, the flagship Zerg unit. Something of a bit-player in Wings of Liberty, Hydras now feel seriously beefed up and much more capable of being an army's mainstay.In some ways, the race that feels most changed is Protoss, because there's much more Stargate-based play coming from their new units - the so-called 'Skytoss' style. The Oracle, an innocuous-looking floating deathball, is perhaps the most lethal solo harassment unit in the game, with an energy-based ability capable of destroying worker lines in seconds. When it gets to the late game, Skytoss gets particularly ominous. The Tempest, their new capital ship, is a giant craft shaped like twin sickles that has a larger range than anything else in the game (farther than it can even see) and specialises in laying siege to exposed positions - as well as absolutely destroying top-tier opposition air units like Battlecruisers and Brood Lords.Heart of the Swarm doesn't reinvent Wings of Liberty, but builds on and hugely improves it - to the extent that one of the best multiplayer games of its era feels like a dry runHeart of the Swarm gives every race more offensive options than ever, and this focus on aggression leads to much more exciting games - both to play and to watch. Some changes sound like an absolute snorefest, yet have the most profound impact; for example, Medivacs have a new boost ability that speeds them up for a few seconds. This gives the Medivac such dynamic potential for zooming into the enemy base, escaping fast, or hot-dropping, that it almost feels like a new unit. And then you see a pro player like Bomber, during last Saturday's MLG match, locking three of his own seeker missiles on to a Medivac and then boosting it over a massed Zerg army at the moment of impact. Now that's my type of preventative medicine.Underneath lies the numbers game, the ever-growing efficiency of your base construction and army-building, and that feels much as it ever did. Which is to say that Heart of the Swarm doesn't reinvent Wings of Liberty, but builds on and hugely improves it - to the extent that one of the best multiplayer games of its era now feels like a dry run.If there's a single competitive bone in your body, you really need to play Heart of the Swarm. If you're only interested in the tactical tasting menu of the campaign - you still need to play it. Good luck, have fun."}