{"ref": "https://www.eurogamer.net/battlefield-3-end-game-review", "date": "11 Mar 2013", "game_name": "Reviews", "text": "There's a pleasing finality to calling a DLC pack ~End Game~. It's been well over a year since Battlefield 3 was released, and we can now look back over five expansion packs and truly appreciate how that core game has evolved and expanded. It's a view as impressive as anything conjured up by the Frostbite 2 engine over the last 16 months.End Game is an appropriate swansong, showcasing DICE's open warfare at its best. As always there are four new maps, but the connection between them is less obvious than in previous packs. Rather than being linked by the implied narrative of an earthquake, as in Aftermath, or by nostalgia, as in Back to Karkand, this quartet follows a broad seasonal theme.Kiasar Railroad is the spring offering, an undulating plot of land with - as the name suggests - a railway line cutting through it. A road slices through in the other direction creating a simple but effective crossroad layout. There's a lot of gentle verticality in the terrain here, with a forest and mountain feel sloping down towards a coastal area. Capture points for Conquest take advantage of the various features dotted around, such as a waterside canoe centre, a gas station and a cargo area. Each offers plentiful cover with small building interiors for soldiers in need of a more sturdy hiding place.Nebandan Flats is the summer map, a low and flat Iranian desert location sitting under a blazing sun. It's a wide open dustbowl of a map, with capture points clustered in the centre around small groups of buildings. A farm, a residential area, loading sheds and another gas station are all within easy jogging distance of each other, while a larger warehouse layout promises tighter combat scenarios with its slightly elevated capture point. It's an interesting and challenging design, with the scarce cover favouring those who take to the skies to pick off the other team, while the closely packed chokepoints mean that life on the ground doesn't become a tedious chore.For your autumnal enjoyment, Operation Riverside offers a tangle of rural pathways leading down to a chaotic jumble of buildings. The river offers a natural boundary, while access to the map's centre is via a couple of bridges which herd the vehicle action into interesting spaces. It's a cover-heavy map with lots of walls, rocks and other structures that can suddenly open out into exposed spaces.Over 16 months DICE has now put out five downloadable expansions. Some have been great, others have been less so. Take a tour back through our reviews for any you missed.Finally, there's the wintry Sabalan Pipeline, which takes place in and around a snow-covered oil refinery. Each capture point is within a sizeable built-up area with lots of cover, but getting to them means darting between trees or taking advantage of a medium-sized central hill. There's a small group of sheds there, offering tactical views of three of the main gameplay chokepoints.What quickly becomes clear is that these are very definitely Battlefield maps. None of them rely on obvious memorable gimmicks, or feel like they've been deliberately designed to accommodate a particular style of play. They're natural and organic, the advantages and disadvantages of each shifting from moment to moment depending on your class type, preferred loadout or the vehicle you've seized. All require you to consider the battle at hand, adapting to each specific situation, rather than relying on techniques and tricks written into the landscape.There are two new game modes to play on these maps - or rather there are two old game modes revived and polished to suit the Battlefield 3 experience. Capture the Flag, a mainstay of the FPS genre, hasn't been seen in a core Battlefield game since Battlefield 2: Modern Combat back in 2005. It plays out much as you'd expect, though the flag placements sometimes don't take full advantage of the enticing spaces offered by the maps. It's the vehicles that liven up this old warhorse of a mode, as the simple fact that the flag-carrier can escape in a tank or even a helicopter can't help change the familiar tempo.Air Superiority, meanwhile, was last attempted in the downloadable Battlefield 1943 from 2010. There, the mode was nerfed somewhat by clumsy spawning that left players stranded on aircraft carriers away from the action. Here, it's been fixed. It's an aerial dogfight mode where you always spawn in a jet and can't even eject. The capture points are blimps and taking them is a fast process. It's a playground for those who have mastered the game's fighter controls, and an excellent way to practice for those who never get the chance to fly in normal play. Neither mode is revolutionary, but each has its own strengths making them welcome additions to the playlists.There are also new vehicles. The HMMWV ASRAD and its Russian counterpart, the GAZ 3937 Vodnik AA, are nimble anti-aircraft trucks with a foldout turret that can switch between heat-seeking missiles and dumb fire rockets. They're not the most robust vehicles in the game, making them an easy mark for the apex predator tanks and choppers, but the punch they pack evens the score.Dirt bikes are the headline addition, and all the maps have been created with features that encourage you to try them out. Hurtling off ramps on a bike, its engine buzzing like an angry wasp, is an undeniable thrill and they certainly make getting around these large maps an absolute pleasure. Just don't look too closely at the physics of them, because they're not terribly convincing as they clatter across the rocks and rubble. What they lack in grace, they make up for in fun.Fun is also a convenient way of summing up End Game, and the Battlefield 3 experience as a whole. It's a little word, and one that's often misused as a platitude, yet it's why I keep coming back to Battlefield. For all its stabs at authenticity, there's a knockabout playfulness to this game that taps right back into those childhood games of 'war' where you'd just run around an empty field, filling it with imaginary mayhem. This is still the only FPS where you can look up in the sky to see your fellow players duelling in fighter jets, while in the distance trees are felled by tanks. It's still the best FPS game for generating those unique, ~Holy s***, did you see that?~ moments that catch you by surprise.Battlefield is about the players, and giving them spaces that inspire such moments. End Game celebrates that, and in doing so celebrates everything that makes Battlefield distinctive from its rivals. Looking back, the limp single-player game and half-baked co-op missions that so lazily chased COD's tail have all but receded from memory. Despite wobbles along the way, Battlefield 3 has grown into the game it was always meant to be and, with four of its best maps ever, ends on an exhilarating high."}