{"ref": "https://www.eurogamer.net/impire-review", "date": "8 Mar 2013", "game_name": "Impire", "text": "Let's just get this out of the way: Impire does not hold a candle to Dungeon Keeper, neither in its design nor its execution. Like ripping off a sticking plaster, it's best to break the news quickly. It might sting a little, but it's best to tear away that hope so that we can start the healing process proper. With that out of the way, let's establish what Impire is rather than what it isn't.Impire tells the story of Baal, a demon summoned from the depths of hell by an inept magician named Oscar Van Fairweather. Together, Baal and Van Fairweather plot to exert dominion over the land of Ardania. They must also return Baal to his former, formidable, flame-wreathed self after the summoning process inadvertently shrinks him to a diminutive imp with a comical wiseguy accent. These nefarious goals are achieved through a mix of dungeon-building, real-time strategy and a sprinkling of role-playing game elements. Don't get your hopes up, though - it sounds a lot more promising than it is. The storyline is, by turns, cutesy-evil and outright depraved. Objectives range from the hostile takeover of a booze business to the hijack of medical supplies that are on their way to an orphanage. Much of the story is delivered via long-winded exposition that quickly becomes tiresome; animation loops are frequently repeated while crass jokes, poorly conceived puns and modern-day memes spew forth from the characters' unmoving lips.Enduring Impire's smug, knowing script is a joy compared to suffering its myriad technical issues. Some of the bugs I encountered were so big and ugly that they must surely have crawled out of hell alongside Baal to vie for the role of lead protagonist. Prior to some extensive patching, the slew of technical issues that I encountered meant that the first 20-odd hours of my play-through were plagued by game freezes, crashes-to-desktop and a nasty save file corruption bug. Cyanide Studios' ongoing post-release work appears to have coerced its creation into something that's starting to resemble a fully functioning game, and indeed the final six hours of my play-through passed without incident. But even assuming that Impire will be stable from here on out, its problems go beyond its technical shortcomings.Every level in Impire starts with the gradual expansion of a dungeon; using a handful of building materials you create rooms to birth creatures and then feed and train them. Rooms can only be connected to one another by pre-existing doorways, while tunnels have to be dug a certain distance from their walls. Creativity in this area is further stifled by the pre-set shape and size of the rooms themselves, making dungeon creation feel like the wearying assembly of flat-packed furniture. It's all too easy to hamper your own expansion as you attempt to work around the pre-set dungeon layout, which leaves you fighting against what should be an enjoyable aspect of the game. Furthermore, you're granted a meagre amount of materials at the outset of every level with which to outfit your dungeon. This ushers in another of Impire's key features: raids. Once you have summoned a handful of the basic, low-level creatures you can formulate them into a squad and send them out into the largely featureless overworld map on a resource-gathering raid. Standard raid sites yield either materials, food or gold with which to expand your dungeon and create or upgrade your army. Visiting heroes will regularly drop by your dungeon and can also be tapped for materials. It sounds flexible, but it isn't. The problem with this system is that every level takes on the same routine. You'll repeat the same actions in the same order time and time again. Even as the game progresses and you gain access to an expanded number of creatures, rooms, traps and spells, repetition is your constant companion. Cyanide seems intent on preventing you from fully exploring your options by artificially limiting your access to them. The Dungeon Index contains all of these potentially exciting unlockables, which are immediately rendered less exciting by the requirement to unlock them anew during the course of every level.To unlock items in the Dungeon Index you earn points for completing standard tasks like collecting a certain amount of mushrooms, building a certain number of rooms and levelling up your troops. Again, repetition quickly teaches you in what order to do things to maximise your time and soon you're in a race to complete the same tasks in the same order to unlock the same combination of rooms, units and spells and finish the level. There simply aren't enough points available to encourage experimentation, so you'll quickly learn which items in the Dungeon Index are not worth the admission price. Later on, a scant few objectives and side quests ask that you break from the monotonous cycle to build certain rooms that you have long since dismissed as useless. It's rare that victory conditions have anything to do with your actual dungeon set-up. However, side quests do grant XP that's used to level up Baal, and that acts as the only lasting indication of meaningful progression. For the most part, you are left to your own devices to build the same dungeon over and over before creating several squads of creatures to unleash on the wider world. Combat strategies are built around the straightforward philosophy that Might is Right. You organise your creatures into a maximum of five squads of four, simultaneously gaining the ability to move them around en masse while losing the option to order them about individually. Then you slog to earn the dozen points necessary to unlock the same upgrade components that you unlocked on the last level and the level before that. Finally, you outfit your creatures with the best armour and weapons that you can and then throw all available squads at the enemy and hope for the best. Sadly, the mess of bodies involved in combat makes it near impossible to see how well the different creature types are performing or which are close to death.When you're not throwing your units at the enemy, you'll be babysitting them. None of the creatures you create have any default behaviour and so, if not ordered to do something specific, they will stand rooted to the spot looking gormless. You'll have to order them to train, to eat and to raid. If you're lucky, they will move to proactively engage nearby enemies, but only if you haven't issued a prior order telling them to head to a particular location. If a squad is already heading somewhere they may run right by the enemy before the underlying code kicks in telling them they should stop and fight.Multiplayer mixes things up a bit by adding a timed element to proceedings. In both the King of the Hill and Capture the Flag modes, up to four players are granted five minutes of dungeon creation time before a communal point-scoring area is unlocked. The eight variations of map type apply only to that shared area, which means that your actual dungeon looks exactly the same no matter what map you play - and this familiarity breeds yet more contempt. Multiplayer is currently in open beta and if more options, modes and maps are added then it could have the potential to be frantic fun. However, multiplayer modes require players to populate the servers and those players require a rewarding single-player campaign to entice them to the game in the first place.Sadly, Impire cannot offer that enticement. It's a dungeon builder in which you have limited control over how you build things and a real-time strategy game in which the prevailing tactic is sheer force of numbers. It has a handful of good ideas buried under a raft of ill-considered design choices, while its intricacies could be rewarding if its laborious mechanics didn't render them more trouble than they are worth. It's repetitive, disposable and artificially inflated. Most of all it's frustrating: frustrating because of the poor execution of a promising concept and because it's nowhere near the game that it could have been."}