{"ref": "https://www.eurogamer.net/real-racing-3-review", "date": "28 Feb 2013", "game_name": "Real Racing 3", "text": "You can probably tell by the size of the yachts in Monaco's harbour, the opulence of the motorhomes that form a worldwide series' travelling circus or the amount of inbreeding evident around the paddock of Silverstone on a Grand Prix weekend that motor racing is a rich man's game. You can't just turn up to the races with a pair of fresh boots and a big heart: a single season in Formula Ford, one of the most junior of categories on the national scene, costs in excess of £120,000.So kudos to Firemonkeys, the new outfit forged by EA from esteemed Australian mobile studios Firemint and Iron Monkey, for being the first developer to fully realise the crippling costs of motorsport in interactive form. Here's a game that's not shy about handing you repair bills at the end of a race and one that doesn't blush over an in-game car that costs almost £60 in real-world money. In fairness to Real Racing 3, there's a lot more to its authenticity, and it's not all quite so grating. An extension of Firemint's deservedly popular racing series, this continues the good work of its predecessors on track, and it strives yet further to back up the 'Real' part of its racing. Licensed cars are now given licensed circuits to bound around, and it's a move that does much to help the series attain its dream of being a real sim on a mobile device. It's a circuit list that shows the developer has some taste, with the grand old dames of motorsport taking pride of place. Spa Francorchamps is just as intoxicating here as it's ever been, while Silverstone's newer layout and the interminable road course at Indianapolis are just as insipid, although their pedigree excuses their presence. The wonderful little kidney bean that is Brands Hatch's Indy circuit - a track close to my heart as well as my house - makes a welcome return to the genre, as does Firemonkey's own local Bathurst, its rollercoaster back leg as exhilarating as it was in Shift 2 Unleashed. Real Racing 3's track list is probably as good as any since Slightly Mad's game, actually, and here it's backed up by a handling model that's slightly more gracious. There's only so much subtlety that can be extracted from digital acceleration and braking combined with tilt steering restrained enough to guarantee you never send your iPad flying, but there's still enough here to draw you in. It's necessarily on the forgiving side, and there's a binary element to the oversteer that means it's either on or off, rather than being doled out with too much grace. But it's enough to ensure that the potential for goosebumps granted by great corners such as Paddock Hill Bend, Pouhon and The Dipper is never squandered. At a time when the gaming world is finally comfortable with the idea of a triple-A mobile game, Real Racing 3 should have been a triumphant affirmation of a point made convincingly enough by the first game in the series. Instead, it's been strangled by the tentacles of gaming's next unconquerable: free-to-play. If games like Dota and Tribes are the warm, welcoming faces of free-to-play, then Real Racing 3 is the grotesque polar opposite, the snarling grinch that's the embodiment of every sceptic's worst nightmare. It's cynical, it's nasty and it's hard-wired into the very fabric of the game, making it totally unavoidable. There's an in-game economy comprised of credits and the harder-to-come-by gold, which would be fair enough if the economy wasn't so horrendously lopsided in EA's favour. Every part of Real Racing's make-up away from the track is a transaction where you're on the rough end of the deal. There's a good game somewhere within Real Racing 3 - and there are plenty of free-to-play games that prove this model can work while respecting the player. Firemonkeys and EA have got that balance horribly, horribly wrongCome the end of the race you're handed with a repair bill that must be seen to if you want your car back at optimal performance. So you drive as clean a race as possible, right? Fat chance - Real Racing 3 boasts grids full of mindless Maldonados who think nothing of running you into walls or parking inexplicably on apexes. In any other game a 20-car field would be something to celebrate - here it feels like another way to skim your wallet, each driver acting like they're on a commission for those costly repairs. You're not even safe if you've driven a clean race, as each and every car is susceptible to everyday wear and tear that must be seen to in a service station. And it's here that the game's time-limitation mechanic is most rigorously enforced. If you need an oil change, or are after a new set of boots for your car, expect to be kept waiting for 30 minutes - unless, of course, you want to part with some in-game gold or a little of your own cash.And you're not even safe if you've paid for your car and ploughed money into the game. Car packs are available for £13.99, allowing you access to a handful of cars and a selection of associated races, but they're still subject to the grim mechanics found elsewhere. I've spent a handful of hours grinding in Real Racing 3 and poured £20 of cash into its bleak economy, and all I'm left with is four cars in a repair shop and just enough spare change for a Ford Focus and a couple of minor upgrades. There's a good game somewhere within Real Racing 3 - and there are plenty of free-to-play games that prove this model can work successfully while respecting the player. Firemonkeys, and perhaps more pertinently EA, have got that balance horribly, horribly wrong, to an extent where the business model becomes the game - with gut-wrenching results.Let's finish with a little maths. You notice the car you've just bought in a £13.99 pack is suspiciously slow in races, so you want to acquire the first of three engine upgrades that costs 44,000 credits. If you get 3500 credits for winning a race after getting tail-ended just once by another car, get handed a 2855 credit repair bill for the damage and then have to pay another 500 credits to get the oil changed - a job that takes 20 minutes to do, unless you want to hand over a little more cash - what's the final number?"}