{"ref": "https://www.eurogamer.net/halo-4-spartan-ops-season-1-review", "date": "27 Feb 2013", "game_name": "Halo 4", "text": "343 got so much right when making Halo 4. Its campaign was muscular, restoring some of the intergalactic spectacle that had been lost in Bungie's more terrestrial final pair of games, while its multiplayer was smart enough to revise the well-worn template and even wiser to leave large parts of it well alone. What made Halo 4 something of a series highlight, though, was how this newborn collective of veteran developers had rekindled Halo's spark.Not everything's been perfect, though. While Halo 4's Spartan Ops mode has hardly been a failure, it's certainly seen an otherwise safe pair of hands fumble what was once an exciting prospect. The first season of this episodic co-op campaign, split into halves of noticeably differing quality, has suffered from a friction between story and gameplay that's burnt through so much of its potential.Set after the events of Halo 4's campaign, Spartan Ops follows the UNSC ship Infinity as it returns to the forerunner planet Requiem. The story is set up in the most spectacular - and presumably horrendously expensive - fashion, with exquisite CGI cut-scenes bookending the five playable chapters that make up each of the 10 episodes.But once you've stopped marvelling at how much it must have cost to get on the screen, it's clear that this is a story told almost entirely in stereotypes. There's space harridan Sarah Palmer who's tasked with barking out the orders, countered by the softer touch of handler Jared Miller. Both are upstaged by the nonentity that is Roland, a new AI whose one redeeming quality is his resemblance to Britain's favourite fictional racist Biggles. But things pick up once Catherine Halsey, the architect of both Cortana and the Spartan programme, arrives, and it's her story - including the first season's killer twist - that's the real heart of Spartan Ops. Which is actually something of a lie, actually, as the real heart of Spartan Ops is formed by the sizable chunks of play that sit in between these two-to-three-minute cut-scenes. And it's here that everything begins to unravel a little. There's a divide between the tight direction and choreographed theatrics of the cut-scenes and the always frantic, often messy combat of the chapters - and despite 343's best efforts in the second half of the season, it's a divide that's never really bridged.The chasm between the action on Infinity and that on the surface of Requiem is eventually narrowed by small in-engine cut-scenes introduced in the latter half of the series, as well as by the slow intertwining of Spartan Ops' narrative threads. But the real issue lies elsewhere. Sitting between the open-ended chaos of multiplayer and a campaign mode that already supports co-op, Spartan Ops has been left looking for a middle ground that it has never really managed to find.It doesn't help that so many of the environments used for the first half of the season - and used and used and used, in the case of maps like Cauldron - are appropriated from elsewhere in Halo 4's package. There's an uncomfortable amount of repetition in Spartan Ops, as well as an uncomfortable amount of appropriation, and too often you can feel the strain of a five-hour campaign being stretched over 15 hours of playtime.Keeping on top of the steady churn of Spartan Ops episodes has too quickly become a chore rather than a pleasureThat strain's felt elsewhere, too, with active playlists being limited to current episodes (although in the wake of Spartan Ops' climax, there's now a playlist that takes in highlights of the first season). Keeping on top of the steady churn of Spartan Ops episodes has too quickly become a chore rather than a pleasure, and the thin spread of active players is as much of a crime as the thin spread of content.But this is Halo, and the sandbox formula that 343 has taken on and polished up so well ensures that Spartan Ops still has the capacity for fireworks. There are highlights - even if they're largely borrowed from elsewhere - that are the measure of anything in the series: trundling up one of Requiem's majestic inclines as you spearhead a Scorpion assault in Apex, crunching through the dark of Warrens in a Mantis or just tearing through Covenant in one of the countless onslaughts Spartan Ops throws at you. And then, toward the latter half of the season, there are some moments that Spartan Ops can call its own. Invasion, the seventh episode of the series that sees the Infinity being boarded, takes inspiration in equal parts from Combat Evolved's Pillar of Autumn and Halo 2's Cairo Station and manages to create a flurry of action that's strong, distinctive and in 343's own voice. It's a voice that, come the climactic moments in the final two episodes, is finally beginning to find itself - but after so many hours of wasted potential it's too late. There's an argument that it's churlish to complain when Spartan Ops is, Xbox Live Gold subscription aside, a free bolt-on. But as with everything, there's a cost. There's the heavy time investment, for sure, but long-standing Halo players will argue that the true price has been the removal of Firefight, the tightly honed score-attack co-op that starred in Bungie's ODST and Reach. Stacked up against that, Spartan Ops is a weak, bloated alternative; Firefight's compelling numbers game has been swapped out for a misplaced duty to a narrative that never quite slots into place."}