{"ref": "https://www.eurogamer.net/year-walk-review", "date": "21 Feb 2013", "game_name": "year walk", "text": "Several years ago, I saw an exhibition by a local artist who made coffins for the birds he found washed up on the beach near his home: weird little curved boxes, tidy and cleanly built, yet strangely organic with it. The whole effect hinged, I guess, on a kind of clash of exteriors and interiors. You know: the smooth, painted surfaces contrasted with the knowledge of what lay rotting inside. There are no artists and no beaches and no coffins in Year Walk, but there is death and there is nature and there are grim spaces for your imagination to trickle into and fester. For me, there was also that familiar tension, too: the clean lines and tidy shapes of the textured, storybook design used to support the darker organic mass of the story that it's been employed to tell.I won't be spoiling that story, since, a few puzzles aside, most of the considerable strengths of the latest iOS game from Simogo - creators of Beat Sneak Bandit - lie with its narrative and the manner in which it all comes together in your mind. Suffice to say it's a horror game, despite its prettiness: a horror inquest, really. Lost amid Year Walk's frigid brooks and silver-skinned trees, you'll find an earthy tale of rituals, destiny and, inevitably, murder. These ice fields leak blood. Year Walk takes place in a wintry forest, long after night has fallen. It's a first-person game, but one unlike any other first-person game I've ever encountered. It's emphatically two-dimensional for all but a few stand-out moments and you control the action by swiping sideways to move along a series of delicately rendered planes, each showing a precise little sliver of woodland. You can then flick the screen up or down to move between planes when the situation presents itself, heading deeper into the darkness or wriggling back out again when it all grows too oppressive.Up, down, left, right: this gives you more than enough freedom to explore a game world that is, in essence, a maze, each vista distinguished by a particular feature. One might have a broken carriage wheel tucked into the snow, while another may showcase an axe buried in a tree stump. The sensation is one of recent absence, of interruption, of dark voyeurism - and the idiosyncratic controls genuinely enrich the experience.It's fairly easy to navigate, but you'll always feel lost, due to your limited perspective, or the almost hyper-textual nature of the plane-jumping traversal. You spend so much of your time moving forward in most first-person games, a title that flips you to the side a little turns out to be a surprisingly perplexing proposition. Quietly, stealthily, Simogo seeks to wrongfoot you: over the soundtrack you can hear your boots crunch on the snow, seemingly rooting you deep inside this papercraft frostscape. And yet, at the same time, the way you swipe back and forth through different layers of the environment seems like a determined attempt to pull you back out of the experience again: to enforce a ruminatory distance every time your viewpoint changes with the swish of magic lantern slides being swapped or the focus-shift of an opticians' test lenses sliding in and out of play. The puzzles, meanwhile, are frequently willing to set aside internal narrative logic in favour of encouraging you to make the kind of abstract links that people who play a lot of video games will make easily. What if I use this sequence in that situation? What if I think about the device in my hands and how it affects the world on its screen? What if I assume everything is connected? After your first play-through, you're actually drawn away from the main app itself towards a Year Walk Companion app, its icon a clean inversion of the original game's. Only here will you be able to explore the story's deeper mysteries. Only here will you find true resolution - even if this very last part of the undertaking comes via some fairly creaky literary tricks.Tricks are what you're in for throughout, of course, and most of them work beautifully. Employing the jump-cutting logic of nightmares as well as their peculiar dampening effects, Simogo's created an adventure-puzzler hybrid that feels a little like Fez by way of the Blair Witch Project or House of Leaves. It's a poised, playful game, offering the controlled baiting of a really good ghost story while still allowing your imagination sufficient space to roam and fret and obsess.Elegant and artful, Year Walk is an unmissable piece of work - and one that is surprisingly hard to disentangle yourself from once it's done. You can close the app and put down the phone, but the forest may spread beyond its glassy confines, its spindly, silver-skinned trees taking root in your own home, your own dreams."}