{"ref": "https://www.eurogamer.net/serious-sam-double-d-xxl-review", "date": "18 Feb 2013", "game_name": "Serious Sam: Double D XXL", "text": "The timing is, if not unfortunate, then perhaps lacking in tact. The issue of guns and their place in society is high on the political and cultural agenda. As Americans grapple with the philosophical and practical questions of whether assault weapons should be permitted in their society, sober reflection and careful deliberation is needed.Into this context swaggers Serious Sam - never a man to bring a knife to a gun debate - wearing a wife-beater and a maniacal grin and brandishing a home-made stack of projectile weapons, mounted precariously atop one another. The shotgun connects to the assault rifle connects to the chainsaw and so on upwards in a kind of unwieldy contraption that even the most wild-eyed contingent of the NRA might shy away from endorsing.Still, for all the unsubtlety, there is a chance Serious Sam Double D XXL could steer the conversation in a new direction. You see, the gun stack in this downloadable side-scrolling shooter can be loaded with a different sort of live ammunition: bees. Turns out guns don't kill people - high-velocity projectile insects do.Gun-stacking is Serious Sam Double D XXL's finest trick, an amusing gimmick that allows you to rearrange your bank of collected weapons into almost any configuration provided you have the requisite number of connectors. A schematic-arranging option screen displays your armoury so far and, by dragging and dropping different guns onto one another, you begin to build your personal Heath Robinson firearm. There's a joyful flexibility to the system as you create a stack of chainsaws or alternate between flamethrowers and shotguns and so on - and, with 30-odd guns to add to the pool of resources, the number of gun-stack permutations is extensive. The temptation, as with all video games, is to curve your creativity toward the extreme, crafting a tower with six of your most over-powered weapons. But this is rarely the best strategy. Each weapon guzzles its own type of ammunition and so there's a danger you'll exhaust your supplies in moments if you fire everything simultaneously, leaving you in a face-off with a 30-foot armoured dinosaur with nothing but a series of impotent clicks to shoo it away. Rapid switching between pre-set gun configurations allows smart players to take a more strategic approach to resource management, and often less is more.All of this was true of the game's predecessor on PC, Serious Sam Double D. In this Xbox Live Arcade upgrade there are many more guns to collect and configure and a raft of new add-ons for each which add new abilities to your character or new characteristics to your gun. Downed enemies drop currency that can be spent at the ubiquitous shopkeeper's store. His stock is plentiful, and in addition to doling out ammunition refills, his upgrades change the game and its feel in critical ways. This is a bombastic, flippant, amusingly grotesque gameBuy the Air Buffer and install it in your machine pistol and you'll greatly lessen the effect of gravity, for example, causing Sam to float from platform to platform, while a shotgun enhancement will cause enemies to run towards you in treacly slow motion. A grenade launcher modification will cause the weapon to fire hungry beetles that crawl over enemies and chew them to death. The upgrades are amusing and inventive - and by applying these to individual weapons rather than the character, developer Mommy's Best Games gives you further responsibility to create the optimum offensive set-up for any given situation. Of course, creating a magnificent and deadly weapon is only worth it if you have an interesting, satisfying place in which to explore and enjoy its effects. This is where the developer displays less flair. Serious Sam Double D XXL's 21 levels appear as a post-nuclear-holocaust Mushroom Kingdom filled with mutant Mario monsters: fire-belching kittens, vuvuzela-blowing stacks of pancakes with cutlery legs (known as Vuvuzelators) and one-legged suicide bombers.These Pythonesque absurdities spawn in huge numbers and, in general, attempt to overwhelm the player through force of numbers rather than any individual power or menace. Enemy bodies can be used to create stacks of corpses, useful for reaching high platforms - and in later levels flying enemies will even provide moving platforms that can be used to climb about the scene.The level design is scattershot and somewhat amateurish. There may be multiple routes through some levels but not much thought has gone into their arrangement (or, at least, there's little clear incentive to choose on route over another). While secret passageways and hidden chambers yield useful treasures, in general it's best to rush through each level as quickly as possible in order to climb the high score table.Three levels take the form of auto-runners, Sam racing over ramshackle ramps towards the exit. In every case the main incentive for exploring off the main track is to discover tokens that unlock new challenge levels (hard-hitting mini-stages with defined goals that are playable outside of the main campaign) and head-to-head multiplayer arenas.By exaggerating the extremities of play, Serious Sam Double D XXL is true to the series' heritage. This is a bombastic, flippant, amusingly grotesque game that compensates for a lack of wit with hyperactive energy and overstatement. It's rough-edged, but in the gun-stacking system, Mommy's Best Games has hit on something with the capacity to amuse and delight. Perhaps it's through sheer force rather than precision, but Serious Sam Double D XXL hits its target."}