{"ref": "https://www.eurogamer.net/spaceteam-review", "date": "15 Feb 2013", "game_name": "Spaceteam", "text": "At the beginning of a game of Spaceteam, the avatars of two to four friends are 'beamed up' onto a spaceship. Around five minutes later, this happens:~Activate the M-Spoon.~~Turn on the meta-loop. Can't see M-Spoon.~~ACTIVATE M-SPOON!~~I DON'T HAVE IT!~~ACTIVATE THE FRACKING M-SPOON!~At this point the ship is destroyed, the game is over, and someone realises they've just been shouting about an M-Spoon - and had it on their screen the whole time. You know who you are.Spaceteam is great, and a big part of this is that it's free; asking family or friends to buy a game so you can play it with them for 10 minutes would feel a little overbearing. For free you get the vanilla, feature-complete version, and a well-priced shop lets you buy extras like more dashboard components and ships. This is not a free-to-play game that tries to gouge you but the exact opposite: a free game that makes you want to reward the developer.Each player's screen shows a small strip at the top with the team's ship hurtling through space. Below this is a control panel. On this are all sorts of gadgets and gizmos with brilliantly daft names. There might be a dial labelled Quantum Ramshackle next to a Four-Stroke Plucker, with a simple button marked 'Panicking' underneath (~STOP PANICKING!~). Every player's dashboard has different bits on it, and then the instructions start: each screen will say things that need to be done, and it's up to your little space team to co-ordinate the shouting.Nothing on these dashboards requires great dexterity. It's all simple levers, on/off switches and number sliders. Increases in level are marked by a jump to hyperspace every minute or so, which gives the group a few seconds to recuperate, and also changes everyone's dashboard layout - new names and a few more bits to take charge of. The final, dastardly touch with the dashboards is that they have a habit of falling apart at the worst moment. Panels can be ripped loose by an asteroid impact and need pulling back into place at the precise moment the Shiftsanitizer underneath needs activating.The only thing that's irritating is wormholes, which require the group to 'flip' their devices to escape. For the best experience with Spaceteam you should really be drunk, and I'm not comfortable tossing an iPhone around when sober (never mind an iPad). It's the only bit that's immersion-breaking because you can see no-one else wants to do it either - which is why wormholes frequently end the game. It's a bit annoying, but no reason to pass this up.This is multitasking under galactic pressure, making you constantly shout instructions while trying to work out if the Lustruous Prismneck someone else is bellowing about is on the dashboard. If this sounds like chaos, that's about right, and fantastic chaos it is. This is about working together and ribbing your chums after it's all fallen apart - because in Spaceteam, everyone hears you scream."}