{"ref": "https://www.eurogamer.net/pixel-people-review", "date": "12 Feb 2013", "game_name": "Pixel People", "text": "Time and skill: video games have demanded one or both of these investments from players for over three decades. The skilful player is able to move through a game on merit, mastering its systems through experience or natural ability. The time-rich player is able to progress through investment of effort, increasing their character's strengths through repetition, accruing in-game currency to purchase a faster car or sharper sword.The mainstream free-to-play model popularised by FarmVille has altered this recipe in a fundamental way. In order to make the game appeal to as broad a range of players as possible, the skill requirement is removed and replaced with money. Now, game progress is achieved through time investment (waiting for your crops to mature, buildings to erect or soldiers to train) or financial investment as you pay real money to expedite the process. Good free-to-play games find ways to inject some of the old skill into the mix, but the poor ones ask for nothing more of their players than persistence or wealth. In these cases, free-to-play presents more than a mere shift of business model; it changes the very nature of a game.Pixel People is a free-to-play game dressed to appeal to skilful game players. It assumes a bright, sharp pixel-art aesthetic and employs enticing imperatives like 'Splice', 'Explore', 'Discover' and 'Build' that imply the need for ability and the capacity for self-expression. But it's soon clear that Pixel People is an exquisitely presented game with a hollow heart, asking players for their time or money and offering little satisfaction in return.Your domain is a blank canvas of gridded space set against the buckshot stars, where you slot different buildings. These either house the growing population or provide a municipal income used to expand the town's boundaries. Ostensibly the game is about building a unique city: choosing, for example, where to build the university, the café, the TV station, the art gallery and so on as these new buildings become available. But there is no meaning or benefit to your town planning beyond an aesthetic one.Instead, your primary task is to 'collect' the 150 job types available to the titular Pixel People, the residents who move into your town one by one as the hours roll by. When new tenants appear, they are held in the Arrival Centre where they await processing. Selecting a new 'clone', as they are called, allows you to splice a new job for them. This is done by selecting one of the currently discovered vocations and logically combining it with another in order to see if a new job will be created. For example, splice the 'Artist' with the 'Salesman' and you'll create the 'Art Dealer'. Successfully splice two jobs and you'll be required to wait for a set amount of time (which you can pay to skip) until a new Pixel Person arrives in the game, decked out in the relevant uniform for their new vocation. This entrance is handled with pleasing ceremony, the new recruit arriving as a collectible figurine which must be freed from its crinkly virtual packaging with a rasping swipe of the finger. Your new Pixel Person must then be put to work in one of the appropriate buildings where they work alongside others to generate finances with which to further extend the town's reach.This core gotta-find-'em-all incentive is reminiscent of Doodle God, a game in which you must match elements to discover new materials. Where that game obscured the outcome of these matches, Pixel People offers an overt clue as to whether a splicing will result in a new job type, removing what little skill was inherent in the logical guesses needed to discover that, say, 'Cook' plus 'Homemaker' results in 'Baker'.With just three clone slots in the 'New Arrivals' centre, the rate at which you can try out new formulas is restricted, arbitrarily extending the play loop of the game. While you're waiting to receive the outcome of your splices, there's very little to do in your town. Buildings require a diligent tap every minute or so in order to re-energise them into generating currency and, occasionally, you must hold a finger to the screen in order to collect a pixel heart. Collect 11 hearts and you receive a reward: either a bunch of coins or, if you're lucky, one of the 64 collectable pets in the game. Pixel People is an addictive proposition, one that many players will happily play - but few will be especially happy while doing so. Its pay-offs are irregular and require no skill, simply perseverance in clicking through the splicing options. The town planning aspect of the game is pixel-thin and largely irrelevant. Developer LambdaMu can be applauded for the execution: with cloud saves across multiple devices, quick loading and gratifying moments of ceremony, this game has a sheen found lacking in many of its competitors. But its shallow depths, disconnected systems and idly mindless challenge splice into gaming fast food: moreish, but unsatisfying."}