{"ref": "https://www.eurogamer.net/wide-sky-review", "date": "7 Feb 2013", "game_name": "Wide Sky", "text": "Video games are nothing if not pro-hedgehog. In life, the spiny mammal has it rough. He spends the year either quaking in bushes hiding from ravenous foxes and owls, skittering across main roads between the oily weight of traffic or sleep-dead in the cosy grip of hibernation. In video games, however, the hedgehog is somehow a notorious acrobat, callous pugilist, dextrous treasure-hunter and sometime sportswear model.See how the hedgehog explodes through his foes at spine-breaking speed - his trainers a crimson blur - grasping fistfuls of gold coins in Sega's Sonic. See how the hedgehog loop-de-loops through the air with dazzling poise, latching an extendable rope to the nearest cloud to swing himself yet higher through the stratosphere in Wide Sky. Video games are routinely accused of fulfilling teenage power fantasies. But perhaps they're really here to make hedgehogs feel good about themselves?Certainly in this, Marcus Eckert's debut iOS title, the hedgehog cuts an impressive figure, splicing the air in a tight ball, swinging wide arcs around clouds on his extendable rope like a reincarnated hippy Bionic Commando. The game's witty, absurdist text is critical, describing these creatures as having ~wicked souls~ and being  ~mistrustful of government~ and ~undiscerning painters.~ However, in motion, Wide Sky is a bighearted ode to the hedgehog.But while Wide Sky is a beautiful game - its delicate motion graphics and papercraft-style graphics offering a rare sheen of professional elegance - in play there are numerous insurmountable problems. At the start of each stage you must launch the hedgehog into the air with a vicious flick of the finger before latching his extendable rope onto any nearby clouds by tapping the right hand side of the screen. Once secured, you may swing the hedgehog from side to side to gather momentum by tilting the device. Let go of the screen and you'll retract your rope and fling the critter off in the appropriate direction.Each stage is peppered with a number of dark orbs which you must destroy by flinging the hedgehog into them. On contact, the orb will splinter into various shards. The faster you smash into the target the longer you have to collect the point-giving shards before they vanish. Break all of the orbs within the level's time limit and the stage is complete.The difficulty for any physics puzzler that relies on kinetic motion and geometry is finding the right balance between flow - that state where you fling your character through the world with controlled grace and prescient precision - and challenge, where there is enough difficulty to upset and interrupt your rhythms without causing frustration. Wide Sky tips the balance too strongly towards frustration: your rope will often latch onto unintended clouds and the tilt controls have little correlation to the hedgehog's action on screen. All too often you'll unceremoniously thud to the ground, losing fistfuls of points in the crash.Eckert's game is too exasperating for a recommendation, but it's an interesting failure nonetheless. One of the best-looking and most chic indie titles of the past 18 months, it's evidence of a keen artistic talent - albeit one that needs pairing with more scrupulous game design in order to fully blossom."}