{"ref": "https://www.eurogamer.net/proteus-review", "date": "6 Feb 2013", "game_name": "Proteus", "text": "The first time I encountered Proteus was in the chill-out room of a hip indie party at last year's Game Developers Conference in San Francisco. The game, projected onto a wall, was enveloping a dozen or so lounging spectators in its warm pastel colours and tinkling dynamic soundtrack while one player wandered around a randomly generated pastoral landscape, doing nothing much.That should tell you most of what you need to know about Ed Key and David Kanaga's first-person exploration game. Proteus is very much an ambient mood piece. It offers no goal or challenge and it doesn't even have the storytelling impulse - however ambiguous - of last year's Journey or Dear Esther. It's beautiful and meditative, with just enough strangeness and sadness about it to avoid coming across like the video game equivalent of a whalesong CD from a provincial head shop.That's not to say it's without structure or point, however. The most impressive thing about Proteus is how compact, sculpted and purposeful it is under those loose-fitting hippy duds. You're free to do whatever you like, but somehow the game will always take you on the same journey to the same uplifting conclusion.You begin hovering over the sea. Move forward, and an island appears out of the haze. The island is generated by the game and different each time you play, but it always has the same features, or most of them anyway: lots of trees, rows of standing stones, jagged structures that look like ruined towers, a stone circle, and another circle of horned statues on a hilltop. There are signs of life too, with scurrying and hopping animals and a huge owl flapping lazily from tree to tree. Sometimes rain clouds roll in.At the start of the game, it's spring, with pink cherry blossom scattered among the wildflowers under the trees. After exploring the island for a while - trekking to distant landmarks, perhaps, or climbing hills, or chasing wildlife, or following the coastline - night falls and the stars come out. You follow a cluster of lights to the stone circle and time starts to accelerate; you're sucked into a vortex of white light and reappear on a blazing summer's day. You'll also see the island in autumn and winter before - after about 40 minutes to an hour, if you're not dawdling too much - the game ends.The artwork is blocky and retro, like Minecraft's, but here the effect is impressionistic. Like the impressionist painters, Key - Proteus' programmer and artist - is unlearning representational technique in an attempt to create a strong sensory impression, something like a memory. It's powerfully effective. That's thanks in no small part to a stunningly evocative colour palette (which was influenced by old art deco travel posters) and the animations which bring this blithe paradise to life.Kanaga's contribution is the shifting musical soundscape, which is affected by your surroundings and the time of day. Subtle washes of sound, indicating falling blossom or an exposed hilltop, underpin more definite motifs like the halting piano scale of a frog as it hops away or the bell-like toll of the standing stones. It's pretty and spacey and atmospheric, if a bit formless - or so you think at first. It's a while before you realise that, beneath all this apparently responsive randomness, Kanaga is moving you skilfully through a series of musical movements, from the woozy clatter and whine of midday in high summer to a mournful woodwind motif for dusk in autumn, and the hushed near-silence of a snowscape before dawn.That's a fair summary for the experience of playing Proteus itself. An initial sense of aimlessness - which isn't necessarily unpleasant, in such lovely surroundings - is overcome by curiosity as you start to investigate the mysteries of the island and move from season to season, as the game's hidden sights and systems reveal themselves, and as the repeating seasonal motif brings its point home. There's a heart-stopping surprise or two for the inquisitive player to discover, and there are several moments of understated theatre that Key seems to guide you to with an invisible hand. Not least among these is the ending, which for my money is at least as moving and graceful in its unforced simplicity as the more staged epiphanies of Journey and Dear Esther.And then it's over. Proteus is a brief experience, and for all its mysteries, has a disarmingly straightforward message about nature and mortality. Its randomness and secrets make it worth playing through a few times, and beyond that, it's easy to imagine wanting to return to it just for respite from a stressful day or a noisy city. (There's also a sweet ~save a postcard~ feature that captures screenshots - or so you think, until you click on one and are transported back to that moment in your previous game, with everything as it was.)How substantial it will be to you depends on how susceptible you are to its picturesque, vaguely pagan charm. Me? I'd take it over that whalesong CD, any day."}