{"ref": "https://www.eurogamer.net/dead-space-3-review", "date": "5 Feb 2013", "game_name": "Dead Space 3", "text": "Familiarity doesn't have to breed contempt, but it still makes for barren soil where horror is concerned. In fact, it's a cruel irony that the genre most damaged by repetition is the one that spawns the most sequels. Freddy Krueger managed to clock up nine big screen appearances, but went from shadowy menace to court jester in the process.The shambling, meatbag Necromorphs of Dead Space aren't making quips yet, but it's perhaps understandable that developer Visceral Games has started to tug the series towards action for this third entry. After all, there are only so many rusty, steam-filled corridors you can creep down, so many times a sudden lunging creature can make you jump, before the jolts lose their sting.It's not as if Dead Space has always been a pure-bred horror title in the first place. True horror requires vulnerability to generate fear, and this is a series where you play a heavily armoured man with an arsenal designed for ripping flesh and psychic powers that hold the monsters in place while he puts them to use. Look past the jump scares and gory surface details, and the Dead Space trajectory has always been one of escalation rather than emasculation.After a brief ~200 years earlier~ prologue, we rejoin Isaac Clarke living in a Blade Runner-style lunar colony. A call from Ellie Langford, one of the survivors of Dead Space 2, reveals that she and Isaac were dating but they've just now split up for vague reasons. It's an awkward narrative speed bump, but it gets the pieces in place for what follows.With the alien Markers still causing problems and zealous Marker-worshipping Unitologists taking to terrorist action, Ellie has undertaken a mission to locate the origin of these monster-making monoliths. Except, as you've probably guessed, all contact has been lost. Gruff military men Captain Robert Norton and Sergeant John Carver arrive to drag Isaac back into action, using Ellie's fate to twist his arm. Their arrival comes not a moment too soon, as armed Unitologists led by toffee-voiced demagogue Danik are also after Isaac the Marker-killer and think nothing of destroying several city blocks to finish him off.From there you get a potted rehash of the first Dead Space, as Isaac investigates an abandoned flotilla of drifting ships before finally making his way to Tau Volantis, an ice planet, just over a third of the way through the game. Even there, you alternate between blizzard-smeared exteriors and more traditional gloomy interiors as you track down the NPC that somehow became the love of your life between sequels.Dead Space 3 never fully slips into the sort of fist-bump macho posturing fans have feared, but it does have a restless desire to throw quirky action beats in your face. You'll blast at gun-toting thugs on top of a speeding train. You'll play what amounts to a Panzer Dragoon rail shooter as you steer a crashing ship through a planetary atmosphere. You'll man turrets and hurtle head-first through tumbling debris and zip around in space on jet boots, collecting satellites. You'll rappel down mountains. You'll rappel up mountains. Such moments have cropped up in both previous titles, of course, but never with such frequency.This is a breathlessly entertaining game - albeit one with a severe identity crisis. Although the movement and shooting are well honed, they are unmistakably designed for a slower and more methodical game than this one. Combat against human foes is unsatisfying, the addition of crude cover and roll movements doing little to bring it to life. Sadly, encounters with the Necromorphs have also suffered, as the need to maintain a certain gameplay velocity without an attendant increase in mobility means that you're often left feeling like Isaac is wading through soup.Dead Space 3 delights in punking the player. Monster closets abound - and an attack from the front is accompanied by a cheap shot from behind almost every time. The game also has an undue fondness for malfunctioning doors that seal you into some enclosed space as a swarm of creatures is unleashed. These are tried and true weapons in the horror arsenal, but Dead Space 3 wields them too often, blunting their impact, but not their irritation. Isaac may be able to roll out of harm's way, but despite the more action-centric universe he finds himself in he's still unable to shoot from the hip - a real problem in such manic, spawn-spamming fights.What these mass slayings do provide is resources. While Visceral hasn't tweaked the core gameplay too much, it's open season on the peripheral details. Gone are the quaint days of simple weapon upgrades left lying around, though you will find some. It's more efficient to be a DIY man, as now everything from health packs to suit upgrades can be constructed by hand at the obligatory workbenches. To do this you must constantly gather bits and pieces from the expected lockers and crates, but also from the mangled bodies of your foes, which give up their goods with a well aimed stamp of your space boots.Transducers, semiconductors, tungsten, somatic gel and scrap metal are the key currencies you'll amass. And it's here, of course, that the micro-transaction - a force apparently more terrifying than the Necromorphs - raises its greedy little head.Dead Space 3 never fully slips into the sort of fist-bump macho posturing fans have feared, but it does have a restless desire to throw quirky action beats in your face.Should you run low on any particular resource, you can top yourself up by spending real money from the workbench menu. Technically, you won't need to. I managed to complete the game without spending any extra and never felt like I'd been held back, but by the same token there were plenty of moments where I fell just short of what was needed. I scraped through, but faced with an uncertain journey to the next workbench, it's easy to see how the temptation would be hard to resist, especially when certain resources are conspicuously less common than others.And that's how micro-transactions really work. It's not about crudely forcing the player to spend extra with brick wall obstacles, but a more subtle psychological invitation, leaving the option out in the open, like a box of chocolates tantalisingly within reach. A few will resist without problem but, sooner or later, enough will find themselves reaching for one just because they're there.The impact this has on Dead Space 3 is subtle but noticeable. Resource management has always been a factor in survival horror, in the most basic sense of conserving ammo and health, but by breaking everything down into constituent parts it tips here into something more akin to a loot-drop RPG. Every crate must be smashed, every corpse stomped, every corner investigated just in case the parts you miss are the parts you need at the next bench.This is also reflected in optional missions - essentially the game's version of raid dungeons - where you follow a fixed path into an otherwise locked area, accessible by crafting a tungsten lever. Such excursions are even more combat heavy than the main storyline, utterly linear in design, and end with a crate stuffed with vital loot.The crafting system does have the benefit of freeing the player from the tyranny of a fixed weapon set. You only have two weapon slots, but complete freedom to construct and customise whatever you want to go in them: you can combine two weapons into one using the alternate fire feature, and add different tips and attachments and circuit upgrades. Want a rapid-fire shotgun with an underslung flamethrower? You can craft it. Prefer the classic plasma cutter tool, but wish it could launch bouncing or sticky electrified bolas? You can craft that too.It's a superb system - intuitive and flexible - and one of the greatest pleasures in Dead Space 3 is tinkering with what you've found and testing the result on the next Necromorph to cross your path. It's here that the game really plays to its strengths. The carnage is what sells Dead Space - certainly not the blank slate of Isaac Clarke, so awkwardly elevated to franchise hero, or any garbled back-story about alien Markers and religious cults. Once you've got a monster frozen in space as it lunges towards you and a weapon that can tear it apart limb from limb, that gameplay sweet spot is as sadistically entertaining as ever.The downside is that the system is so powerful that it's almost impossible not to come up with a lethal combination that bleeds a lot of the challenge out of the game. Cathartic as it is, the emphasis on weaponry does mean that whatever claim the series has to the ~horror~ tag recedes ever further in the rear view mirror.Also diminishing the horror is the introduction of co-op play. As well as adding more monsters and missions, co-op cleverly inserts Carver into scenes and occasionally plays with the disparity between what each player is seeing for some fun tricks. For a game in which you stomp cadavers into bloody chunks, it's surprisingly elegant storytelling.Sadly, the co-op system itself is less elegant. Joining a game means finding one that has yet to start, or waiting for the other player to reach a checkpoint. That can take a while, especially given the unskippable cut-scenes. Similarly, if a player leaves your game, you can find yourself booted back to the last checkpoint. Sometimes, one player is glued to a console to solve a puzzle while their partner fends off a crudely triggered attack; whoever is unlucky enough to draw puzzle-solving duty can't even leave the console to defend themselves. Such clunkiness abounds, but when the system works, it's not without merit. It's never remotely scary, but there's undeniable satisfaction in mowing down Necromorphs with a friend.Dead Space 3 is as fidgety and distracted as any late-generation blockbuster game looking to spread its demographic appeal as widely as possible.It's inevitable that how you feel about Dead Space 3 will depend to a great extent on how you perceive the series. If you see it as a beacon of terror in a gaming landscape increasingly obsessed with downloadable doodads, distracting social features and brawny shooting, then Dead Space 3 takes a giant leap in the wrong direction. It's as fidgety and distracted as any late-generation blockbuster game looking to spread its demographic appeal as widely as possible.Yet if you're happy to cast off your genre expectations, Dead Space 3 ticks most of the boxes you'd want from big budget entertainment. It's a generous game: around 16 hours to complete the single-player story on normal, and that's without all the optional missions or co-op sections, plus a brace of unlockable modes and goodies for repeated play-throughs. Even with the inevitable feature creep, the core stalk-and-slay mechanics are still satisfying enough to shine through. It's also lavishly produced, although the game engine is showing signs of wear and tear: loading times are long and inexpertly hidden, while the character models in the rather florid cut-scenes don't stand up to much scrutiny.Dead Space 3 is a contradiction. Gorgeous but scruffy; tightly packed yet stretched too thin; often frustrating, frequently thrilling and bursting at the seams with stuff, not all of which fits comfortably inside the boundaries the series has set for itself. It's certainly not a great game, except perhaps as a poster child for the kitchen-sink development mentality of a console generation in its twilight months. But it does manage to balance out every misstep with something worthwhile. Sadly, newcomers with no preconceptions will likely enjoy this rollercoaster more than the series' fans."}