{"ref": "https://www.eurogamer.net/might-and-magic-clash-of-heroes-review", "date": "29 Jan 2013", "game_name": "Might & Magic Clash of Heroes", "text": "~You're reviewing Clash of Heroes again?~ Tom asked me in yesterday's meeting. Why bother? It's a fair question. We've had more than our fair say on Capybara's brilliant hybrid of role-playing game, turn-based strategy and match-three puzzler already.Dan Pearson (RIP) reviewed the DS original three years ago, calling it ~a very good game indeed~ - with some understatement. Kristan Reed (RIP) went further when he reviewed the remake for Xbox Live Arcade and PSN a year later: ~With a depth and longevity that humbles most full-price releases... Clash of Heroes HD demands your immediate and undivided attention.~ Then I awarded it Game of the Week (RIP) and eight months later, after it had appeared on Steam as well, Fred Dutton (RIP) anointed it as one of our Games of 2011 (it had topped his list outright, and mine). ~The gameplay system at Clash of Heroes' core is a thing of rare, bewitching beauty - a creation so deep and so elegant that it will keep you up at night,~ Fred wrote, and he was right.So if you're a regular reader, you already know the high esteem we hold this game in, and if you're not, the above should be all you need to draw one easy conclusion. (Two, if you count the fact that reviewing Clash of Heroes is a sure sign that you won't be writing for Eurogamer much longer - I'm surely pushing my luck writing about it twice.) Clash of Heroes is a classic game and this iOS version returns it to the portable touch-screen gameplay it was originally designed for. Go forth and download.Only it's not quite that simple.What we have here is not a bespoke version for phones and tablets but a more-or-less straight port of the home console and PC game, Clash of Heroes HD. It's not done by Capybara itself but by another developer, Tag Games. It's buggy, fiddly, scruffy, poorly optimised for phones and, at 2GB, hugely overweight for its new home.A quick recap: in Clash of Heroes, two hero characters face off across a battlefield grid. They form attacks by stacking unit types in threes. This simple puzzle gameplay is transformed into unfathomably moreish brain food by a simple but exquisitely balanced net of systems: attack charge times, the linking and fusing of units to increase their power, champion units, the way a unit's strength encompasses both its defensive and attack values, and so on. It's no exaggeration to put this inventive design up there with Advance Wars as one of the most elegant distillations of strategy gaming ever conceived, and it makes popular competitors like Puzzle Quest look crude.This genius and fun battle system never fails to hold the attention, even across a lavish role-playing campaign which unlocks five factions and 10 heroes and will easily occupy you for over 30 hours. Those factions can then be used in local and online multiplayer matches - and here the iOS version does score some points. It offers a pass-to-play mode, a table-top-style face-to-face mode on iPad and asynchronous online multiplayer - altogether more suited to this turn-based game than the real-time matches of the console and PC version.At least, I assume it is, because every time I try to go online the app crashes. This might be something to do with a corrupt save file created when I was using iCloud to sync my game between an iPad and an iPhone (another great feature - if it worked). The game freezes often. There's a lack of polish evident everywhere: some of the game's beautiful artwork looks stunningly clean on a Retina screen, while other illustrations are muddy and pixellated.While the basic touch controls make sense, a few are illogical or fiddly to execute (especially deleting units, a vital tactic in the game) - a sure sign of this version's roots on consoles. And that's on iPad, where notwithstanding its rough edges, Clash of Heroes is still a joy to play. On an iPhone, it's a miniaturised test of patience. Units are so minuscule they're difficult to manipulate accurately without a stylus, and as a result costly mistakes are frequent.What makes this especially frustrating is that Clash of Heroes' battlefield has a portrait presentation - the original game design was suggested by the DS's dual-screen set-up - but since this version was originally made for televisions, it plays only in landscape, wasting half your screen. This is a terrific game design that could have sung on phones if it had been tailored for them. Instead, on a pocket-sized display, it's barely functional and all but sunk.Clash of Heroes is still a must for iPad owners. Its luxurious scope and hypnotic power justify the ~premium~ £2.99 price tag many times over. It's very cautiously recommended to iPhone owners with recent phones, gigabytes to spare and tiny fingers (or styli). It does offer the best multiplayer version of the game (although I'd still pick Clash of Heroes HD for its superior polish).But it could have been so much better. In fact, if it had been redeveloped from the ground up for its new format (as Clash of Heroes HD was for consoles) this could have been the definitive version of one of the best games of the last few years - and nothing less than an all-time mobile classic. What went wrong? Who's to blame?Not Capybara, who can hardly be resented for wanting to move on to fresh pastures. And while Ubisoft and Tag must take responsibility for the unfinished state of this port, they should also take credit for going the extra mile with the multiplayer modes and settling on a good business model (the factions are available as in-app purchases to the impatient, but can be unlocked by playing through the campaign).No, I think the fault has to lie with a marketplace where you're pushing it asking five dollars for a game that would be a bargain at 20. It's a given that Ubisoft is going to take the cheap and easy route to such a cut-throat marketplace. Hopefully the likes of Battle of the Bulge can eke out a corner of mobile gaming where games of substance can thrive. But for now, iOS has got the version of Clash of Heroes that it deserves, rather than the one that it's capable of."}