{"ref": "https://www.eurogamer.net/the-cave-review", "date": "22 Jan 2013", "game_name": "The Cave", "text": "Don't call it a comeback. Ron Gilbert may be best known for his series of brilliant point-and-click adventures for LucasArts in the late '80s and early '90s, but the presence of item-led puzzles in The Cave doesn't automatically mean a return to his roots.There are genetic traces of Maniac Mansion and Monkey Island in this spelunking adventure, which sees Gilbert reunited (sort of) with his former protégé Tim Schafer at Schafer's studio Double Fine. Vending machines serve grog instead of cola, but Gilbert is wise enough not to lean too heavily on past glories. Instead, he's taken the basics of the point-and-click genre and come up with a twist on the formula that makes it a better fit for today's gamer.Most noticeably, there's no pointing or clicking. This is as much co-operative platform game as single-player puzzler, and the structure and pace have been updated accordingly. You now have three playable characters, chosen from a rogue's gallery of seven. A scientist, a time traveller, a pair of eerie twins, a hillbilly - it's an eclectic bunch. Descending into the depths of a sentient, self-aware cave system, you'll need to make use of each character's unique skill as well as some of your own brain power to plumb the depths and emerge from the other side.Perhaps the most impressive feature of The Cave is how seamlessly it juggles this multiple-choice set up. Each character gets their own little vignette, a self-contained area that fills in some of their back story as the cave somehow incorporates a Gothic house, a castle, a nuclear silo, a carnival and more into its gloomy tunnels.There are also other areas, independent of any character choice. Encounters with a crazed gold rush miner, an obsessed big game hunter and a delusional hermit - all can crop up with their own needs to fulfil and miniature worlds to navigate.The d-pad allows you to switch quickly between your characters, as neccessity conspires to separate them and scatter them around each location. They'll automatically regroup as you leave each area, but within the confines of each challenge it's up to you to guide them to where they need to be.Sadly, this is one of several areas where The Cave struggles to distinguish itself. Jumping and scrambling around is marred by stodgy control, and although there's no way to die - characters respawn nearby whenever they fall too far or succumb to a deadly obstacle - navigating the world is never the pleasure it should be. As even a partial platform game, it lacks the sort of precision and challenge that would make each screen a worthy gauntlet, so the constant need to drag crates, clamber up ledges and plod up and down ladders feels more like a distraction than a fully integrated gameplay feature.That's doubly problematic since so much of the game involves backtracking and roaming around working out what to do next. That's always been a part of the adventure genre, but the decision to do away with inventories amplifies it here. Each character can carry only one object at a time, with the result that even when you've worked a puzzle out, actually solving it can mean a lot of traipsing back and forth gathering the bits you need.And the puzzles, sadly, are not massively taxing. The truncated nature of the cave's self-contained sections means that your options are always limited and anyone with a bit of experience at this sort of thing will cruise through most of the game without having to kick their brain into high gear. When you have a battery-less tape recorder, a dead battery and a tank full of electric eels, you don't need to be a genius to work out what you must do. When a puzzle really does stump you, it's often because the game world is behaving inconsistently. The saving grace is Gilbert's unmistakable sense of humour, which remains as sharp as ever, some 20 years on from Guybrush Threepwood's seafaring yarns. This is a very funny game, with the cave itself narrating your actions in deadpan, lugubrious style. One puzzle involves honking the nose of a former cave explorer, a clown, long since turned to bones. Once you've honked it enough, he goes from Dead Clown to Aroused Clown.The art style is also lovely, with a hand-painted look that manages to be both ominous and silly depending on the situation. The characters themselves are a visually appealing bunch, and although the playable seven are mute, the characters you encounter along the way are memorable and brilliantly voiced.Kudos, too, for a novel approach to replayability. Finishing the game once still leaves you with four more characters and four more areas to explore. Despite the sometimes lumpy structure, the game is amusing enough that you'll have no problem launching back into more play-throughs to see what else the cave has in store. Achievements, too, have a playful air, rewarding you for mucking about and trying silly things more often than patting you on the back for completion.It's just a pity that the stories being told don't really come to much. Each character has some dark and selfish secret to uncover, and there's a sly morality behind each one that calls to mind the work of Roald Dahl. Just as Veruca Salt, Augustus Gloop and Mike Teevee emerged from Wonka's factory having been judged unworthy for their sins, so the selfish explorers in The Cave find their misdeeds circle back around and catch them out. However, with mute characters and stories that unfold largely through static comic panels, unlocked via glowing glyphs, there's just no way for the punchlines to really hit home, and the pay-off feels weakened as a result.And that's The Cave in a dank and gloomy nutshell: never bad, often good, but only occasionally great. Its frustrations are fleeting but with core gameplay that struggles to be as clever and witty as the script, it never quite manages to bring together its best features in a truly satisfying way. Plunge into The Cave and you'll definitely have fun finding your way out. It's just a shame it doesn't go deeper."}