{"ref": "https://www.eurogamer.net/tokyo-crash-mobs-review", "date": "18 Jan 2013", "game_name": "Tokyo Crash Mobs", "text": "Language can be weird. Take Tokyo Crash Mobs as an example: if I told you that this 3DS eShop curio is a game about going bowling with strangers, you might think I was describing some kind of 10-pin multiplayer set-up with leaderboards and asynchronous challenges. Not quite. It's about going bowling with strangers: it's a match-three game in which you roll - or sometimes throw - brightly clothed dandies into snaking queues and jiggling conga lines of other brightly clothed dandies in order to group colours together and cancel people out. The dandies are called scenesters, incidentally, and the groups of same-hued scenesters you steadily remove are called cliques.It's Puzz Loop in essence, which isn't really surprising, since it comes from the team that created Puzz Loop. This is a design that's been fairly heavily cloned over the years - it's probably most famous now as Zuma, from PopCap - but Mitchell Corporation has decided to keep things fresh by piling on tweaks and gimmicks and by covering the whole thing with a bizarre aesthetic.Let's deal with that bit first, actually. Tokyo Crash Mobs uses digitised video of the sort made famous by Narc back in the arcades. The effect here is closer to a WarioWare micro-game, however: Crash Mob's queues and ever-inching lines are composed of roughly animated clones, decked out in cone-fatigue suits, who move jerkily across low-res concrete plazas. The whole thing is broken up, meanwhile, with cut-scenes depicting various men and women doing weird things in public places, exchanging lingering, sometimes rather alarmed looks, and occasionally falling through cheaply rendered depictions of interplanetary space.It looks a bit like that famous Gap khaki ad remade on a very low budget, and a bit like a student film exploring the many reasons that you should never abuse horse tranquilisers. It's semi-charming at first but, over time - there are a lot of those film clips, and you can even scroll through them all in a side-mode - its weirdness begins to seem a little calculated.Still, it provides another lure to get back into one of the most satisfyingly stressful puzzle games out there, and (once you turn off the 3D effect, which makes the tiny characters surprisingly hard to distinguish with any accuracy) Tokyo Crash Mobs is often varied and pleasantly tough. With objectives that flit between whittling down queues - often multiple queues - of people before they reach their targets, and levels that see you thinning crowds so as to be amongst the first through the door into glitzy shops, each new puzzle encourages you to change your approach.Along the way, you'll deal with countdown timers, playable characters who either toss their volleys through the air or roll them across the ground (which means you sometimes have to ask large sections of the crowd to jump first to let you through) queues that wriggle around, people who want to cut in, people who want to encourage cutting in, plant pots that block shots and all sorts of other distractions. There are power-ups that you can collect and then let loose at the right moment to knock scenesters around with balls of yarn, say, or perhaps stop a line dead for a few seconds with a barricade, and there are even stages where you have to aim into the screen as you take out gangs of advancing Ninjas using motion controls.At its best, it feels rhythmic and even rather tactical as you manage different queues and pick off specific targets who are trying to mess things up for you - providing a burst of speed, perhaps, or bringing in grey ninja characters who will only disappear when you match the people on either side of them. As the game gets increasingly tough, though, annoyances start to pile up. Control is handled with the stylus in an aim-and-then-release-to-fire manner, but it struggles for accuracy when queues grow complicated, while the camera often seems rather miserly in the amount of action it's willing to frame at any one time - probably because the individual characters are so small. The UI furniture occasionally gets in the way with annoying pop-ins, too; these can be turned off in a menu, but there's no fixing the system for applying power-ups, which has you dragging the item you want to use onto your own avatar and then fighting with the cursor to ensure it's properly attached itself.Still, when you nail a decent combo and send a ripple of cancelled cliques flooding its way down the queue, there's a peculiar kind of joy to be had. Challenging and sometimes a little unfair, this is a game of near-victories and frantically avoided calamities, and it borrows a certain additional tension, perhaps, from the social anxiety of the set-up. It's hard to ignore the fact that the 3DS has smarter and more inventive puzzlers - a handful of them are also on the eShop, in fact - but if you want a good old idea dressed up in garish new duds, Tokyo Crash Mobs should just about do the trick."}