{"ref": "https://www.eurogamer.net/borderlands-2-sir-hammerlocks-big-game-hunt-review", "date": "17 Jan 2013", "game_name": "Borderlands 2", "text": "Mission objective: Find creature lab.Oh, Borderlands, never relent. Keep throwing me into weird DLC offshoots where Pandora becomes home to buccaneers, professional wrestlers and armour-plated Bullymongs. Keep sending me up against monster-of-the-week bosses and the deranged lunatics that created them. Keep churning out new continents to add to this dusty, extravagantly devastated world, and keep stocking them with loot chests, Eridium drops, and, well, mission objectives like Find creature lab.None of which is to say there isn't room for a little experimentation beyond the blood-splattered confines of that lab, of course. A central element of Borderlands is the broad, scattershot riffs the whole thing offers on the lunatic excesses of American culture. Sir Hammerlock's Big Game Hunt shifts the focus somewhat, however, packing you off to a new area called Aegrus to take apart the local wildlife as noisily and destructively as possible.Aegrus is based on Africa, by the looks of things - or rather it's based on the American media's concept of Africa, which means that what you end up with is a cross between a safari park, King Kong's Skull Island and something that resembles the interior of an airport terminal's most misjudged theme restaurant. Maps are huge and craggy and distinct from anything else you'll have seen in the game, which feels great, and they're filled with groups of spear-wielding ~Savages~, which feels kind of awkward. With the neo-Victorian figure of Sir Hammerlock to serve as your way into the adventure, it's a promising set-up with which to parody colonialism's warped view of the world - but it never feels like the developers are entirely comfortable with the conceit, or particularly sure where they should be going with it.What they are entirely comfortable with, however, is creating another memorable guest star in the shape of Professor Nakayama, an evil scientist in the making who's both cripplingly aware of his own shortcomings and woefully unprepared for the task of world domination he's given himself. An enthusiastic acolyte of Handsome Jack, the dark Disney prince of Borderlands 2's central campaign, Nakayama's hit upon the idea of cloning his psychotic hero, thus taking control of Pandora.The storyline that unfolds is fairly compact compared to those of the previous two add-on episodes, but it's still stuffed with a series of decent boss battles, a truly stellar final joke, and an armory to raid that, for me at least, offered some of the best loot I've ever netted in a single session. (It's worth noting, incidentally, that although the narrative takes place after the end of Borderlands 2, you won't need to finish the game to access it. You will need to have at least a level 30 character to have fun, though.)The campaign might be ever so slightly on the short side, but more than any previous DLC, this one's about the side quests. These send you racing around the game's new areas tracking down legendary creatures to kill, collecting giant eggs and even cleaning up pools of animal urine. There are a couple of bosses who come with neat gimmicks - one's bulletproof unless you turn your back on him, for example, while another has to be finished off in under a minute - and there's also a high-level monster who will require a party to take down.It's fairly tough going throughout, in fact, with a selection of new beasties to tackle such as the scorpion-like Scaylions, while those savages often spawn with a Witch Doctor, a fierce elemental bullet-sponge who can hand out buffs and debuffs as his minions steadily level up, goliath-style, the longer they stay alive. It makes Hammerlock's very first campaign mission a bit too punishing, perhaps, as you learn to get to grips with the idea - but over time it fits neatly into the game's existing focus on target prioritisation and allows for pretty thrilling battles as things get out of control.The real appeal, though, lies in the maps. There are grand, rangy chunks of land filled with waterfalls and curving shorelines, there are abandoned factories that have been retrofitted as horrible morgues, and there are tree-houses whose grasping boughs are big enough to comfortably hold entire villages. Grifter's Reach, Hunter's Grotto, Dripwater Cavern: it helps that Borderlands' cartographers consistently find a kind of geographical poetry that other games tend to miss. Hammerlock's new vehicle, a fan boat all but plucked from the bayous of Florida, doesn't handle that differently from the sand skiffs of Captain Scarlett, but it still feels surprisingly fresh to power it around these vast, ancient spaces, taking in the sights, picking up trinkets, getting into scrapes and tracking giant beasts back to their wind-blown lairs. You'll laugh, you'll die, you'll blow the teeth out of a wandering Borok the size of a small camper van. Compared to the heights of Mr Torgue's Campaign of Carnage, with its masterful blend of Kayfabe jokes and sustained bar-fight intensity, Hammerlock can't quite match up. But it provides several great new reasons to return to Pandora, and that's enough to seal the deal."}