{"ref": "https://www.eurogamer.net/ni-no-kuni-wrath-of-the-white-witch-review", "date": "17 Jan 2013", "game_name": "Ni no Kuni: Wrath of the White Witch", "text": "A collaboration between revered film animators Studio Ghibli and the games developer Level-5, Ni no Kuni: Wrath of the White Witch is billed as a joint effort by two of the great populists of Japanese entertainment. It's a significant move from Ghibli in particular, whose leading light Hayao Miyazaki has made his mistrust of video games clear in the past, and whose delightful films - from Laputa: Castle in the Sky to Ponyo - usually have strong moral themes: environmentalism, work ethic, the strength of family and the power of imagination.Does Ni no Kuni - which translates as Second Country, or Another World - feel like a true Ghibli game? Very nearly. It has the wistful look, certainly, and a wonderfully evocative orchestral score by Ghibli regular Joe Hisaishi, and a scattering of gorgeous hand-drawn interludes by the animators. The story of an orphan boy called Oliver journeying to a fantasy world after the death of his mother follows a familiar Ghibli theme - a lonely child bravely growing up before his time - and is told with elegant sentiment.In truth, Ni no Kuni doesn't quite possess the surreal wildness, the passionate message or the delicate intimacy of Ghibli at its best. It gets close on occasion, but it also has some rather workmanlike passages and conventional tropes. You're aware that Level-5 is doing the legwork while putting on its best Ghibli impression. That's not a big problem - the studio has already practised that impression in its work on Dragon Quest and Professor Layton, and it's an accomplished understudy.As a maker of role-playing games, however, Level-5 is no longer an understudy. It's a master. Ni no Kuni is a sumptuous adventure of great sophistication and craft. It stands alongside the Nintendo DS classic Dragon Quest 9 as the studio's best work to date, and it balances tradition and invention just as skilfully.Oliver lives with his mother in Motorville: a nostalgic, pastel-coloured vision of small-town America, much like those Ghibli has drawn of rural Wales or Austria in the past. An accident in a homemade car brings him close to death, but it's his mother who's taken instead. Oliver is paralysed by grief until a toy she made him called Mr Drippy - a weird little imp with a lantern dangling from his enormous nose - comes to life and claims (in a thick Welsh accent) that he's a fairy from a parallel world. Oliver is a wizard in the making, Mr Drippy says, and the ~pure-hearted one~ destined to save this world as well as its vanished Great Sage, Alicia - who bears a striking resemblance to his mother - from the ~dark Djinn~, Shadar.It's a simple set-up given an affecting human dimension by the link between Motorville and this fantastical kingdom, several of whose denizens have ~soul mates~ back in the real world. The shopkeeper's lazy cat rules the medieval town of Ding Dong Dell; a desert sage and his daughter, ~broken-hearted~ by one of Shadar's spells, are mirrored in Motorville by a depressed, surly mechanic who forbids his daughter from ever leaving her room. Oliver's trips back to Motorville to solve these mysteries are rare and the suggestion that, in his grief, he has retreated into a world of imagination is never forced. But it's enough to ground this colourful romp and give it an unexpected poignancy. The pace is perhaps too gentle to begin with, too slow to surprise or to develop its mysteries - but in the long run, Ni No Kuni's storyline will enthral kids and touch adult players.The gameplay, however, wastes no time getting you involved. If you're expecting a simplified all-ages adventure, an impassive stream of randomised button-mashing or a rote recital of Japanese RPG traditions, forget it. Ni no Kuni does take its time introducing its many systems, but they are so richly layered, you are given so much flexibility and your progress through the game is so carefully measured that you'll still feel like you're scratching the surface after a dozen hours.On that surface it's comfortingly familiar to the point of nostalgia, with the action divided between dungeon-like ~dangerous places~, the sweetly miniaturised map of the wide world, and towns where Oliver and Mr Drippy chat to the populace, advance the story, accept side quests, shop and fiddle. Health and mana come in old-school green and blue bars - none of that new-fangled recharging nonsense - while attributes and new spells are allotted automatically as you level up.The hook is the capture and training of ~familiars~, Pokémon-style. These startlingly odd creatures - cats in waistcoats, sprites wearing lampshades, mechanical tombstones, fat bats and baby-faced eels - burst with character; they also form the wildlife of the world and most of your enemies in battle. They level up and metamorphose into higher forms, they learn more skills than they can use, they can be fed treats to develop particular attributes, they equip weapons, armour and trinkets, and their effective use is governed by no less than three affinity systems, one of which is quite mysterious. They can excel in defence, physical or magical attacks, tanking, healing, debuffing and other roles besides.Oliver can switch between three of these familiars in battle, as well as use his own spells and items. He's eventually joined by two friends - Esther, the spell-bound sage's daughter, and a scruffy, sleepy-eyed vagabond named Swaine - who can do the same. You can hold three familiars in reserve and a near-limitless number in storage. There are so many variables and opportunities for customisation here that you can lose hours to setting up a perfect, tactically balanced team of nine familiars - never mind catching 'em all.The great pleasure is that you actually get to control them in battle. Run into a creature out in the world and you're whisked to standardised battle arena where the scrap occurs in real-time. You assume direct control of one character and their familiars and assign basic tactics - ~keep us healthy~, ~provide backup~, ~don't use abilities~ - to the others. It's essentially a simplified take on Final Fantasy 12's real-time battle tactics.The pace of battle is governed by canned animations and cooldowns on your abilities, but skilful timing and positioning can help you evade, block or press an advantage, and it's important to scamper around between attacks to gather the motes of health and mana that fall to the ground. All told, the action is urgent and involving, while the distinct feel of controlling each familiar brings the charm of this bizarre bestiary to life.Ni no Kuni is not afraid to test you, either. Boss fights are abundant and the regular battles between them are far from thoughtless chaff. After establishing the basics, the game stretches its legs and offers consistent challenge, regularly stepping up the toughness of the monsters you face and offering some thorny tactical combinations. Mana is a precious resource that's expensive to refill and this is one JRPG where you'll actually need to use and restock your items, where the sight of an inn brings relief.The difficulty and levelling curves have been tuned with such care that as soon as the fights in one area become easy, you're on to the next. You'll rarely, if ever, need to grind; the game is comfortably padded with fun side-quests and challenging monster bounty hunts instead. Seldom has a console role-player been so perfectly paced, or side-stepped the onset of ennui with such sure footing.When it comes to downtime, Ni no Kuni is no less diverting but more sweet-natured. A fulsome alchemy crafting system works in concert with the bottomless fascination of developing and kitting out your familiars, while a well-balanced economy forces you to think about your shopping. And there's a cute line of side-quests that has Oliver helping out broken-hearted townspeople by magically restoring their enthusiasm, kindness or restraint; it's a well-intentioned attempt to spread the game's warm heart beyond the main storyline, if a slightly forced one.'Forced' is a word you can rarely apply to this game, though. Ni no Kuni is rich yet breezy, classic yet modern, exquisitely made and completely sure of itself. Best of all, Level-5 and Ghibli's artists have worked together to create a gorgeous adventure that feels like it belongs to both of them.It's a world where pretty fantasy archetypes clothe heartfelt domestic drama, and where outlandish cartoon creations sit at the heart of an engrossing game, infusing it with their exotic charm. Ni no Kuni wears its Studio Ghibli inheritance as lightly as Oliver does his little red magician's cloak, transporting us from one universe to another with the wave of a wand."}