{"ref": "https://www.eurogamer.net/digitalfoundry-2020-ps1digital-hdmi-output-mod-review", "date": "9 Aug 2020", "game_name": "Reviews", "text": "One of the biggest challenges facing the retro gaming enthusiast is the basic concept that console systems and games designed for CRTs are an uneasy fit for modern flatpanel technology, not least because today's screens don't even accept the video outputs of classic games machines. Various solutions are available to bridge the gap, but none quite offer the quality of directly modding original hardware to offer a fully digital HDMI solution. That's what the PS1digital from Black Dog Technology does: a separate board is mounted inside an original PlayStation, converting its internal signals to a pristine digital output - and it's terrific.If the concept sounds familiar, we've covered the work of Black Dog before, specifically with the DCHDMI - now renamed DCdigital - which does the same thing for Sega's Dreamcast. In bypassing the original analogue video and audio outputs of the host console, these mods deliver the absolute best possible image quality. From console to flatpanel, the entire pipeline is completely digital from start to finish. In the case of the PS1digital, the signal is so pure and unfiltered that our frame-rate analysis tools work as expected - a situation that's only possible with the cleanest of signals.The PlayStation is an interesting console. Alongside Sega Saturn, it was the last home console where the vast majority of the library actually ran at just 240p, with a smaller subset of titles operating at a higher resolution via interlaced 480i. Even before the arrival of the PS1digital, there are still some good options available for using original hardware on a modern screen. The Framemeister, OSCC and Retrotink all do a good job, and the simplest solution - the Rad2x cable (based on Retrotink) - delivers a very impressive 480p output. The Hyperkin PlayStation HDTV cable is best avoided. Another decent plug and play solution is simply to run your PS1 library on PlayStation 3. All consoles run all games via software emulation.The PS1digital is the purist's option, though: no emulation, no analogue to digital conversion - and a whole host of excellent onboard options. The kit mounts inside the original machine, its PCB requiring fairly expert installation onto the existing motherboard. The rarely used serial port on the rear of the machine is replaced with the new HDMI port, with an almost seamless integration thanks to the inclusion of a 3D printed backing plate. For the ultimate fan, Black Dog is looking to restore serial functionality either via a dongle or via the PS1digital's internal WiFi chip, which aims to deliver the same experience but without the needs for wires. Yes, the device does have WiFi functionality - and that's just the beginning of its functionality.Via an integrated FPGA, PS1digital offers a host of options to the user. While gaming, holding down L2, R2, start, square and X gives you access to a menu for accessing all of its features. That starts with resolution, where VGA, 480p, 960p and 1080p options are available - all of them being integer scaled for precision clarity. My recommendation is to go for 1080p, which offers a perfect scale with black borders. For a more 'full-screen' effect, 960p dispenses with the black bars top and bottom, but most displays will introduce additional scaling. Further options allow for deeper customisation - limited and full range RGB are supported, along with gamma adjustments and your choice of deinterlacing options. For the smaller range of PS1 games that run in 480i interlaced mode, you can choose between 'bob' and 'weave' options. The former acts to fully deinterlace the image with some shimmer evident as a result, while the latter basically allows the interlace weave to remain intact. Other options include the ability to emulate scanlines (and this is one of the best implementations I've seen) along with the inclusion of the hq2x scaling filter which aims to round off pixelated edges. The PS1digital is also upgradable via firmware updates - the main reason it has WiFi functionality.Needless to say, the output quality of a modded PlayStation console is second to none - it's essentially impossible to improve upon the internal digital quality the PS1digital delivers. As the video above demonstrates, the output wipes the floor with the sub-par Hyperkin HDTV product and provides extra clarity over the Rad2x cable. Interestingly, PS1digital even offers additional clarity over the PS3's HDMI output - particularly when it comes to handling 480i signals. PlayStation 3 does do a good job in running PS1 games, but remember that at its heart it is still software emulation. It's difficult to level criticisms at PS1digital because ultimately, the price premium you'll pay completely removes all analogue to digital conversion from the video output pipeline. The Rad2x cable is a simpler, cheaper solution of course, but it is still using the analogue output of the machine and while its 480p signal is very good, you're still left with the task of scaling it - a job that's usually performed in a sub-optimal way by a modern display. The PS1digital takes care of everything for you - to the point where the only criticism you can level at it comes down to the nature of the PS1 content itself. The PlayStation's lower colour depth dithering mode was used on a lot of games and while the look passed muster on a CRT, it doesn't present particularly nicely blown up in pristine digital quality to a flat panel display. Similarly, there's nothing that a video output mod can really do to address the affine texture warping issues that affected a lot of the PlayStation's library. In that sense, PS1digital is as good as you're going to get but those looking for the ultimate modern solution for original PS1 gaming also have to contend with lower quality elements of the design. The CD drive's laser was never particularly robust and could fail easily - not good for preservation. I'm certainly looking forward to the upcoming optical drive replacement units that will eliminate this weakness in the original hardware once and for all.It may sound like I'm stating the obvious at this point but the PS1digital is an excellent product - and one I strongly recommend acquiring once it becomes available. I've spent a week with the unit, revisiting a wide range of games in putting together this review and the whole process serves to highlight why a mod like this is so welcome. It all comes down to the library of games you have to play: wide-ranging, extensive, brilliant, with a massive array of incredible experiences that still hold up today across all genres. In fact, when looking back at the PS1/Saturn era - in my eyes, we never had it so good. With that in mind, it's great to be able to revisit that remarkable library - and short of acquiring a good CRT monitor for retro play, this is the best you're going to get."}