{"ref": "https://www.eurogamer.net/stealth-bastard-deluxe-review", "date": "6 Dec 2012", "game_name": "stealth bastard deluxe", "text": "Swearing creatively; difficult thing to get right. You just about get away with 'Stealth Bastard Deluxe', but as soon as the subtitle 'Tactical Espionage Arsehole' comes up we go from laugh to cringe. It's a bit try-hard, and its greatest sin is misrepresenting the game behind it - SBD is a refined and original take on the sneaking genre, not a crass parody. The most heartfelt profanities here are delivered, as they should be, by the player.\u2028\u2028SBD is first and foremost a 2D platformer from the modern indie school - precise twitch controls, instant restarts, and plenty of messy deaths. Insert obligatory Super Meat Boy comparison, except in this case there is a similarity in how SBD has come to market. This is an expanded and remade version of a freeware original from Curve Studios, the team behind Explodemon, and Stealth Bastard's big idea was speedy sneaking. All the stuff you expect in a stealth game, faster.\u2028\u2028This is an expanded and much-polished remake, but despite the instant premise it takes a good few levels to warm up, as the opening takes its time to explain the basics when the stealth mechanic is really quite simple. You're either in the gloom and not visible (the character's goggles glow green), in dull light and partially visible (amber), or in bright light and fully visible (red). Levels are made up of dark corners and big bright expanses, with all sorts of cubbyholes and grey areas in-between. They're all filled with switches, cameras, lasers, turrets and sensor beams that interlink, as well as light sources and terminals that need hacking. These ostensibly simple and easily-manipulated elements will kill you so many times it's untrue. SBD's that kind of game.\u2028\u2028You control a squat Sam Fisher lookalike, one of infinite clones being produced to undertake a sinister science facility's testing regime (ho-hum), and have to unlock and then get to each level's exit. One of SBD's best qualities is how much play it gets out of few buttons, with your main abilities jumping and flicking switches. The complexity and gadgets flow from its level design, when it's done right, and often it's done right indeed.\u2028\u2028Take something simple, like a switch that moves a block from left to right and back again. Under that block, it'll be dark. But if you hit the switch then try to run under it, you're not fast enough. The solution, then, is to hit the switch while running and keep perfect pace with the moving block. The level Shadowrunner introduces this idea, then begins chaining these little dashes together, throwing a few obstacles in the middle of the path; making it harder, bit by bit, until a final crazy zigzag you'd never have managed two minutes ago. Later, teleporters will chain together for concertina-like jumps from a standing start, whipping you across the screen in several different directions from a single leap - and woe betide if you get the angle of entry wrong. \u2028These moments of freewheeling speed and stunts are the payoff for SBD's stretches of thinking time, standing in darkness working out what connects to what and running it all mentally before a step. It's here that Stealth Bastard lives up to its name, capturing the delicious thrill of picking through a trap under the nose of your enemy. Despite the stealth simplifying things down to a trio of absolutes, the essential aspects are still there; spotting patterns in patrol routes, kinks in the environments, then dashing from cover to cover. The difference in SBD is that you work things out quicker, and the consequences are more immediate.\u2028\u2028The generous checkpointing is important, letting you experiment with each challenge rather than tiptoeing around in fear, and mitigating the fact that you usually learn things are deadly by triggering them. SBD is pretty funny with it, too, one of its neatest touches the acerbic text projected onto level surfaces from an observer, 'warning' you of imminent dangers and exulting in failure. At times the words offer false reassurance, even false hope, right before you blithely step into another laser beam. There is that little streak of the masochist in SBD, and its charm earns it a little buffer from some core issues, and renders them irritating rather than offensive. Jumping out from platforms with a low ceiling is a real pain, deliberately so, and causes more deaths than you'd imagine. I don't like how it feels. The checkpointing, though very good in general, will sometimes let you balls-up a level's solution then restart at a point too late for recovery. And for all that Stealth Bastard delivers speeded-up sneaking, it could do with being even faster now and again. At times you'll work out the chink in the pattern you've got to hit but then have to wait 10 to 20 seconds for the level's moving parts to get in the right position, all the while wishing you had a fast-forward button.More than anything else, though, the clone character you control in Stealth Bastard doesn't quite have that instant joy in the hands that a Meat Boy conjures. This is not a criticism of the controls or their precision so much as the difference between excellence and flawless. Perhaps it even has something to do with the fact that, when the levels are the star, the player character can sometimes feel a little sidelined, a small cog in a big machine. This is a side effect of Stealth Bastard's design as much as a flaw, an ambiguous one.\u2028On that note, SBD comes with a level editor and automatically updates a list of community maps that can be played instantly. This is a game that works beautifully with a level editor and integrates it well, so it was a pleasant surprise to be drawn into this side of SBD for hours. It's made up of elements that suit fiddling about, simple things that impact in multiple ways; a system as capable of creating sprints as marathons. A big part of the fun of community levels is the daft ones, and Stealth Bastard has its share, but the nature of its toolkit means there is some serious work on show already.\u2028\u2028At its best SBD's blend of twitch-platforming and stealth puzzles produces little rat-runs with a nigh-on perfect balance of action and tension. Such quality isn't quite sustained across the whole, but this is still within touching distance of greatness, and certainly much classier than Tactical Espionage Arsehole suggests. Not quite a perfect run, then, but definitely mission accomplished."}