{"ref": "https://www.eurogamer.net/app-of-the-day-king-of-dragon-pass", "date": "5 Dec 2012", "game_name": "King of Dragon Pass", "text": "The idea of being a king is endlessly fascinating. What would you do? Who would you kill? And, most importantly, who can you trust? Worn down every day by myriad disputes, planning for the enemy at the gates, constantly paranoid about inside jobs. ~What infinite heart's ease,~ moans Shakespeare's Henry V, ~Must kings neglect, that private men enjoy?~King of Dragon Pass is an old and quite remarkable text-based game about the long and tortuous route to the titular crown. At its beginnings you take control of a small clan that settle into an unremarkable position in Dragon Pass, choosing their beliefs and lore in a brief history. From here everything is your decision, meaning that, apart from some helpful advice from a clan ring of seven, everything that goes wrong is down to you. First released in 1999 on PC, this reworked version somewhat streamlines the original's interface as well as making the detailed art look immeasurably superior. King of Dragon Pass plays out through static interface screens that cover everything from trading caravans to building temples, and its plentiful incidents are communicated entirely through pictures and text. If you have thoughts of Zork or similar old-school text adventures, put them aside. What distinguishes the game is its non-linearity, huge range of situations to deal with, and the way these combine into quite incredible consequences. Basically it's like reading a choose-your-own-adventure book, with a strategy sim between the lines.Every game plays out in a different way. My first attempt was ruined by unfocused warring that led to eventual starvation, because all my farmers got injured during harvest. Next game, the first problem was a love rat from a neighbouring clan that got one of my clan's women pregnant. I insisted he marry her, and things escalated into a bloody feud. Our two clans battered each other for the next three years in attritional raids, and became easy pickings for stronger neighbours - who showed no mercy.This is a thoughtful experience, one where progressing depends upon considerable foresight as well as thoroughly reading the manual. Remember those? King of Dragon Pass has a tutorial that will get you into a game with the fundamentals, but understanding its somewhat recherche inner logic is essential. As is the need to re-arrange your moral compass a little.King of Dragon Pass is set in the fantasy world of Glorantha, which is full of fantastical beasties, terribly grim endings, and slightly overbearing gods. What matters is that the game is superbly written, which given the sheer volume of text is no mean feat, and continually surprising in the nuance of how things play out. Of the many scenarios that come up very few have a straightforward solution, and even less are consequence-free. It sometimes takes many in-game years to become obvious, but this is a world that never forgets.To achieve anything in the game you must work with this in mind, building alliances for the future and steadily increasing the clan's skills. The population is mostly split between farmers and weaponthanes, functional units that have to be kept happy and healthy. The former work the land and act as B-list troops in battle, while the latter do the frontline fighting. Alongside these are a smattering of nobles and children, which are useless.The key resource is cows, and I'm not even kidding. Cows are everything. You get milk from cows, breed them, trade them, slaughter them, sacrifice them, and steal them. There's a goddess of cows, and I strongly advise building a temple to her. If you run out of cows, your clan will disband without ceremony and it's Game Over. Respect the cow.Other crucial resources include food and trading goods, but really it's about getting your system right. If enough farmers are working the right amount of land, food will be no problem. If you've got plenty of food and cows, you can trade them for goods. Setting up trading partners, using the right representatives and learning how to negotiate almost automates the process. When you have all of these resources in plenty, you can sacrifice to the gods whenever you need a blessing. Lovely, eh?It would be. Nothing ever comes smooth in Dragon Pass. Famine, war, pestilence, natural disasters, enemies within, all can strike without notice. The rhythm is insistent; browse the various screens at leisure, perform an action and time passes. Sometimes without incident, but often otherwise. It's kind of genius that in a game about long-term strategy, so much of it comes down to instinctive choices - the right thing to do at the time. When a situation needs an answer you're not at leisure to put it off or go to check a particular detail, but are locked in to making the call.The one blessing is the clan ring, seven people chosen from a pool of potential candidates who provide a snippet of advice for each scenario. They often contradict each other, and some just talk nonsense, but it's an essential context for any decision. They're also a kind of ongoing (and welcome) tutorial, reminding you of oversights and flagging up potential problems early.There are two situations where you don't have the clan ring to fall back on; battle and hero quests. The fighting screen is always accompanied by a jolly bagpipe tune, which cheers the spirit as you weigh up the potential strategies - kill as many as possible, go for plunder, take captives, burn steads, or just concentrate on surviving. Regardless of a particular choice, the odds of success can be improved with sacrifices or treasures, and then during battle there are often opportunities to direct individuals - should your best warrior try to flank the enemy general and risk being surrounded?Hero quests are completely different, and in some ways the game's most mysterious aspect. These are recreations of the world's myths that you guide a clan member through. But even if you know all the answers they can still go wrong, which leads to an unworthy candidate returning in pieces and destroying morale. In a game that has diamond-sharp through-lines in almost every other regard, the wholly capricious nature of hero quests is enticing and frustrating. The rewards are huge, and in some cases essential, but never guaranteed.In that, they embody the larger game. You can learn a lot about King of Dragon Pass, but it will always be something of a puzzle. This is more than a decade old, and it still creates a more convincing illusion of conflict and consequence than anything I've played in the meantime. You couldn't quite say it is the future of interactive narrative, not least because that would be thirteen years too late. But it's one of the most expansive and fascinating cul-de-sacs you'll ever spend time in."}