{"ref": "https://www.eurogamer.net/baldurs-gate-enhanced-edition-review", "date": "4 Dec 2012", "game_name": "Baldur's Gate: Enhanced Edition", "text": "The good news is that nothing has gone drastically wrong. Beamdog hasn't broken Baldur's Gate and it hasn't done a clumsy job of crowbarring in the extra features it's added. The vast majority of the changes made to this classic role-player are about clarity and accessibility and are seamlessly integrated. If it were a DVD reissue, the Enhanced Edition would be closer to The Lord of the Rings: Extended Edition than Star Wars: Special Edition.But imagine the DVD skipping a few times.The bad news is that the paint hasn't dried, the nails haven't been hammered all the way in and, sooner or later, you're likely to snag yourself on something. Baldur's Gate: Enhanced Edition is more than a little rickety and has some surprising omissions.There are two things that need to be said straight away. The first is that Baldur's Gate was (and still is) a beautiful, enormous, ambitious and seminal RPG that remains without equal, the series becoming something of an evolutionary dead end. The second is that Baldur's Gate is 14 years old and even the most vigorous of buffing by Beamdog can't make it look much younger. There is no time for nostalgia (I've indulged that already); this is a review that will help you decide whether the Enhanced Edition is worth buying.Here are two more things I can say straight away. If you've never bought Baldur's Gate before and your interest is piqued by the game's reputation and this re-release, this is the edition to seriously consider buying, with a few caveats. If you already own Baldur's Gate, you probably shouldn't buy this - not unless you absolutely must serve some completist compulsion that burns deep inside of you.The most obvious changes to the Enhanced Edition are in the presentation, as the resolution has been increased considerably and with it the size of the viewing area. While the game's rendered and largely static backgrounds date it, they remain lush, even luxuriant, and a much larger viewing area brings with it a sense of scale that was lacking in the original. It's worth noting that the mouse wheel now can be used to zoom in, should you wish to treat yourself to an increasingly pixellated experience.The cut-scenes have also been beautified. They're now hand-drawn and very pleasing to the eye, certainly much less awkward than the original 3D efforts. Baldur's Gate 2 players may also recognise some of that game's improved animations and effects which have been retroactively added, such as for the Fireball spell.Other changes are practical as well as cosmetic. An improved inventory screen and character record make it a little easier to keep track of what items are translated into what attack or defence values, with the aim of helping players understand why putting an axe in someone's hand suddenly turns them into an incapable oaf. The changes have taken some inspiration from Baldur's Gate 2, allowing for a greater stacking of some items, such as arrows, and introducing gem bags and potion cases. These alterations are certainly an improvement, but are relatively subtle and not worth lighting any fireworks for.The new portrait pack, characters and voice sets are also similarly minor boons. Though I welcome the new companions much more than a few new voices I can use to tell my opponents I'm going to kill them, both are relatively tiny additions to what is a very, very big game. Still, the companions are capably written and voiced much more thoroughly than the others ever were (making them stand out beside their peers) and the variety they bring is a good thing.~This is a faithful enhancement that  hasn't diluted or modified the original game to bring it in line with modern tastes.~But none of that sounds particularly remarkable, does it? That's because the biggest addition to the Enhanced Edition actually exists outside of the main game. The Black Pits may as well be a mini-game, as it's a separate adventure that is largely a horde mode, pitting a party of six custom characters against 15 increasingly challenging waves of enemies and punctuating this violence with shopping trips for supplies. While it could've been a mindless melee separated by snack breaks, The Black Pits provides both a decent challenge and a well-written adventure in its own right - but I'm disappointed that it's an entirely separate entity.One thing I can say for the Black Pits is that it never once crashed - something the regular game managed to do pretty frequently. I was met with a crash to desktop every few hours, usually when moving between locations, but sometimes when trying to access different menus or screens. While this this was the most alarming of the game's failings, I'm afraid I have to submit a small catalogue of concerns for your consideration.Some of these are very small things. For example, I've noticed a few places where in-game text is incorrect, usually in very minor ways. I'm also not sure the new journal sorts quests as well as it could as, after completing one infamous quest involving a talking chicken, I subsequently bumped into a traveller who told me he'd spotted a loquacious bird - and, lo, the event appeared again, apparently unresolved, in my notes.Some of these are very irritating things, such as the abysmal pathfinding that leaves my party twitching in a doorway or sends one of them wandering halfway across the map. Sometimes party members simply don't respond to mouse clicks, requiring you to re-issue orders (something I can imagine being particularly annoying on an iPad touch-screen, when that version finally appears). Sometimes archers try to engage in melee combat. Sometimes the entire party is selected and can't be deselected until you restart the game. I should add that the Enhanced Edition has patched itself twice since I began playing, but these problems still surface.It's true that pathfinding was never good in the original game, but I'm sure I remember an option that would improve it by increasing the nodes that your computer would calculate. There's no such option in the Enhanced Edition and, indeed, hardly any graphical or interface options at all, something that surprises me a great deal. Multiplayer, meanwhile, promises a proper server browser via Beamdog, but presently offers only a direct connection option.Nevertheless, frustrating as these problems are, none of them derail the game. After all these years, it still stands up as gorgeous, engrossing, witty and bloody-minded RPG - and a difficult one, compared to the games it has sired. This is a faithful enhancement that  hasn't diluted or modified the original game to bring it in line with modern tastes. There are no achievements to unlock, few second chances and plenty of completely unfair challenges to stumble into. I firmly believe everybody who loves RPGs should play Baldur's Gate; that's a given. The real question is, should you buy it in this enhanced form?If you're not much of a tinkerer, then sure. If you want a horde mode, definitely. Otherwise, be aware that the original Baldur's Gate is cheaper and, with a little savvy, can be modded to up the resolution, add some of the same extras and even to include a few (unofficial) fan-made adventures. Unfortunately, this new edition doesn't appear to be compatible with those mods, so be aware that you'll be excluding them.The best way to view the Enhanced Edition is as a particular flavour of this game - one which may or may not appeal to your personal taste. I certainly can't claim that this is the definitive version of Baldur's Gate and I have to judge this game I love with that in mind. It's not better - it's just different.However, here's a postscript that serves as both a warning to new players and a reminder of the importance of keeping multiple saves. Before writing this review and in the interests of being thorough, I gave the new tutorial a quick play, hoping that it would serve as a better introduction to the esoteric and somewhat antiquated Dungeons & Dragons 2nd Edition rules that Baldur's Gate is built upon. I found it a little unsatisfactory and I don't think it properly prepares players for such eccentricities as the concept of THAC0.I also found that it overwrote both my main game autosave and quicksave without informing me, even though I swear I never touched the Enhanced Edition's new quicksave button. The convenience of that button had me relying on it for storing most of my progress and I'm estimating that this double-tap has cost me some 60 hours of play.So, yeah, that's something to bear in mind."}