{"ref": "https://www.eurogamer.net/soulcalibur-dc", "date": "4 Dec 2012", "game_name": "SoulCalibur", "text": "The fighting game formula really hasn't changed much over the last            few years. Two fighters square up in a basic arena and once            encouraged to do so, pummel the hell out of each other until a            horizontal health bar has completely changed from green to red.            Once this has happened, the corresponding combatant is KO'ed. Oh,            and it's the best of three rounds.                         The recent innovations to the somewhat stale genre have included            ~3-dimensional arenas~ (which basically means that you can walk            around a bit and knock people off the edges of the elevated ones),            ~moving in and out of the screen~ (tapping the up button no longer            produces a somewhat pathetic hop, but helps the character dodge an            attacker) and ~real attacks~ (in other words, you don't have the            option of throwing fireballs or turning into some sort of enormous            penguin to conduct an overly elaborate death move).                         Soul Calibur includes all of these plus the usual beat-em-up            hallmarks, such as ~secret characters~ (win the single player mode            and you'll either get a new character to play with or a new mission            for the Mission mode) and the ~stupidly unrealistic plot~ (an            excuse for the violence. You may remember that Street Fighter and            Mortal Kombat both did this quite well, inspiring a good Manga            adaptation and a good movie respectively).                         The game also owes a lot of its traits to specific beat-em-ups.            While I'm rounding up the usual features, lets give credit where            credit's due.                    Something you'll notice is that with the exception of the very            latter aspect, everything mentioned above is something fairly            positive. Soul Calibur amalgamates a plethora of the best aspects            of beat-em-ups over the last 10 years. It does more than just that,            too.                    While Soul Calibur makes a killing (pun intended) off of the best            things that have been done with the genre over the last few years,            it also brings a load of interesting new aspects to the table.                         The Mission Battle mode, for example. At first I had fleeting            visions of popping across the globe Street Fighter 2-style when I            looked down and saw a map. It's much better than this, though, as            although your character does progress around the map, it's more            like an RPG, your character accepting challenges wherever he finds            them and beating off all comers. It's surprisingly endearing.                         Unlike a lot of its competitors, it really does take advantage of            polygon graphics in the best possible sense. Graphically the game            is outstanding, with intricately detailed characters (the facial            expressions are unbelievable), equally detailed arenas (look out            for rats running around in Voldo's lair!) and none of the intrinsic            clipping problems console games expect to encounter. Most            importantly, when you think you've hit someone with a punch, you            will have; the collision detection is definitely the best I've            seen.                         The series' most defining feature is that it is based around            close-proximity sword-based combat. Each fighter has a weapon of            choice, usually some sort of sword, big or small, and as such the            gameplay often becomes a question of blocking and counter-attacking            at the right times. This makes for a much more strategic fight and            the battles aren't just decided by who can mash the buttons best.                    Increasingly, as you play Soul Calibur, it's the little things that            do the most to impress you. Survival mode for example. How long can            you hold out without losing? Things that you always thought were            too simple to warrant inclusion often pop up herein and lend            themselves well the formula.                         Multiplayer tournaments are common place around here now, with            Soul Calibur the game of choice (although Virtua Striker 2000.1            will doubtless give it a run for its money), as the game is very            easy to get into with the special move combinations accessible via            a menu brought up by the pause button, and even more fun when you            think you've mastered it and find out that your best friend has            turned into a veritable opponent overnight.                    Well, not quite. There are some small set-backs to the fun. While            the various arenas that you contest your might in are aesthetically            diverse, with proper 3d backgrounds (actually it's an elaborate            trick, but I bought into it and it's effective enough), in terms of            the actual battles, they have no real layout differences at all. I            would just love to have seen a battle on a hill, with the highest            point giving a direct advantage; perhaps a snow-capped mountain            peak where the players can't move as freely… there is so much            scope for change and yet I haven't seen one beat-em-up where this            sort of thing has been considered, let alone included.                         The sounds don't inspire too much passion in me either. The music            is tyrannical in places and very fitting; I like it very much; but            when you land heavy blows, the satisfying audio thuds encountered            in games like Ready 2 Rumble are strangely absent. Soul Calibur's            alternatives seem a tad wimpy.                    In spite of these little niggles, Soul Calibur really is superbly            executed and probably the best beat-em-up I've ever played,            trouncing all of its competition on the home systems without            flinching. Combining gorgeous graphics, multiple modes of play and            a very strategic outlook on an otherwise motionless genre, Soul            Calibur brings together the best of the rest and adds to the            formula.                        - Out Now"}