{"ref": "https://www.eurogamer.net/app-of-the-day-dream-of-pixels", "date": "29 Nov 2012", "game_name": "Dream of Pixels", "text": "Just when you thought the Tetris-style puzzle genre had run out of surprises, along comes Dream of Pixels to turn things on its head. That's the game in a nutshell, really. It's Tetris, but sort of upside down. Blocks still fall from top to bottom, but it is now your job to carve out the famous Tetromino forms as required from a gridded canvas. There's a skill to seeing where to remove the next shape, and as the grid creeps down any blocks left will lie untidily in the way. Removing every object from a certain row will snap these loose blocks back up, and away from the game-ending danger that waits if your curation fails and you fill the screen. Clearing rows captures orphaned blocks back into the main grid, ready for removing anew. There are bonuses for carving shapes in a particular order, and the points quickly rack up if you can make multiple rows vanish at once. It's a concept clearly inspired by Tetris, but one that innovates in a way that looks and feels brand new. Tetris' traditionally harsh, neon-coloured blocks have been replaced by a dreamy cloud aesthetic. Colours swirl like fresh daubs on a watercolour, and are given a starry, ethereal backdrop, like a distant dusty nebula seen through the Hubble telescope. Every aspect of the game has been thought through with care. Snapping stray blocks back into the main bank of cloud sends little curlicues of fog puffing out upon impact. When you can get a block-busting rhythm going and have a perfectly ordered screen from which to tap, the game flows brilliantly.Dream of Pixels' fittingly trance-like tunes adapt as the game's pace quickens and colours darken and swirl. But as your blocks threaten to slip off-screen, the screen turns to noise and whiteness - indicating that you're slowly losing control as you near the dream's end, about to enter the real world when you hit game over.Other modes include a more difficult Pro option which skips the earlier slow levels, and Nightmare which gives you a playing field full of loose blocks to rear in. There's also a Puzzle mode, where you must fit the Tetriminoes into little gridded pictures, a bit like those plastic shape games you get in Christmas crackers.There's plenty to play with then, even though the main game is so addictive you'll find yourself hammering the retry option on Classic (or Pro, when you're ready) without any care for the extras. In a crowded landscape already filled with the excellent Slydris and stalwart Drop7, Dream of Pixels is another required purchase.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments. For daily app coverage, check out our sister site Modojo."}