{"ref": "https://www.eurogamer.net/chivalry-medieval-warfare-review", "date": "28 Nov 2012", "game_name": "Chivalry: Medieval Warfare", "text": "“Are you sure your ready for war?” says the screen. Yes Im ready.  “Press C to BATTLECRY.” C. YEEEEEAAAARGGGGGGGGHHHHHHHH!!!If I call Chivalry shambolic, it's going to sound bad. But participating in a shambles with a heavy weapon is, it turns out, tremendous fun. This game's bookish title is a mere façade behind which lies naught but foul-mouthed war cries, gruesome blows and comic death. Try to imagine 'Monty Python's Knightly Deathmatch' and you're more than halfway there.Chivalry is a first-person fighting game (FFG?) built around close-range melee combat, with a smattering of archery. It never loses sight of the fact that, fancy moves or no, getting personal is a messy business. Heads, legs and arms fly by the dozen in every match, a feature made approximately ten billion times better by the fact that you can further de-limb opponents as they stare in shock at the first mortal blow. There is nothing quite like hacking someone's arm off, then executing a swift and true beheading as they stare open-mouthed at the stump.Despite such comedy gore, Chivalry's combat system is simple, flexible and precise. Swinging attacks, thrusts and overhand blows are the basic repertoire, along with a parry move that depends on timed blocks. The window for the latter is generous, but the camera also needs to be focused on the weapon; under pressure and in a ruck, it's the clutch move. The four classes are just about explained by a rudimentary tutorial, offering ample tactical variety as well as their own equipment unlock paths. Three are all about getting in the mixer and lopping off some body parts. The light Man-At-Arms is kitted out with a buckler and shortsword, depending on a dodge move that can be devastatingly effective against heavier foes. Vanguards get high-impact, high-range weapons like halberds and claymores and have a charging attack that can disembowel multiple enemies in one sweep. Then there's the Archer who, fairly obviously, stands at the back like a sissy and tries to pick off kills.Most matches of Chivalry quickly come down to a big ruck full of Men-At-Arms and Vanguards, some Archers at a distance, and then the Knights. The Knights in Chivalry are slow-moving and heavily armoured, as you might expect, but what makes them so awesome is the ability to switch easily from super-offense to tank mode. Knights default to wielding their longsword or battleaxe double-handed, but can also bring up one of two shields. So you can be right in the thick of things, cleaving heads and taking names, then back off with a tower shield raised, attracting fire and letting your allies get involved.While all of this is very commendable, what makes Chivalry's combat so much fun isn't the skilful side of things. What this game is great at is massive fights where everyone piles into a particular spot swinging, and it all comes down to where the pointy ends hit. The player cap seems to be 36 and, though 24 is more usual, it's a case of the more the merrier. This might be the point to tell you that friendly fire is most definitely a big factor in most matches. ~The up-close fighting and comedy finishes make each kill supremely satisfying.~Almost every game of Chivalry, regardless of the particular mode, begins with a noisy rush towards some undefined centre point where, you just know, the other team will have felt the same call. Remember pressing C for a battle cry? A truly Brian Blessed collection of soundbites await, and these group charges are when C gets the most action.Once the two groups clash, anything happens - as long as it involves metalwork bludgeoning, shredding or slicing flesh. Sometimes you charge in and arrive with a swing from the arm of Achilles himself, cleaving through the front two before an overhead crushes the third. Sometimes you end up stuck like a pig, then beheaded with insulting nonchalance - the screen greying out then 'toppling' sideways in a deliciously grisly touch.Chivalry is a basic game in many respects, but it does one thing brilliantly. The up-close fighting and comedy finishes make each kill supremely satisfying, and feel like a weightier pleasure than the more plentiful delights of a shooter. There are those moments when, in the midst of a greater battle, two warriors face off in a bubble. Chivalry has those - and the fact that one of you is going to lose at least a limb, rather than merely crumple under fire, does add a little spice.There are six maps in total, which sounds weedy but is plenty, and in certain of Chivalry's objective-based modes these can link together into a larger whole to be progressed through. The objective modes show a sadistic touch of humour, with objectives like civilian massacre or torching cornfields, and keep things from getting bogged down in trench warfare with ever-rolling objectives. ~This is not a pompous blockbuster, nor a long-term proposition. This is about men hitting each other with swords.~One particular mode has an inspired final stage. It begins with one team burning and pillaging the defender's outlying village, before assaulting the castle with a battering ram while under siege. Breaking through the walls is a slugfest but, if the attackers manage it, the defending team's MVP becomes their king. The king gets a few buffs and the cavernous throne room constantly respawns his allies, while the attackers respawn outside. It is a beast of a finale, and finally beheading the monarch to win must be Chivalry's sweetest cut of all.With all of these good things said, it should be clear by now that Chivalry is a particular kind of fun. The fighting system has a lot going for it, and the objective-based gametypes do an effective job of mixing up the flow, but eventually its giant mosh pits do lose a little of their novelty. This is not helped by the fact that, outside of matches, the front end and approach to online play are simply functional. A game that makes you laugh out loud, however, gets forgiven such things. This is not a pompous blockbuster, nor a long-term proposition. This is about men hitting each other with swords, and the hitting part works great. Chivalry is a simple pleasure, and a funny game indeed. Question is, are you sure your ready for war?"}