{"ref": "https://www.eurogamer.net/wonderbook-book-of-spells-review", "date": "13 Nov 2012", "game_name": "Wonderbook: Book of Spells", "text": "What is Wonderbook? It's a serious question and, even after finishing the thing, I'm not sure I know the answer. Sadly, this isn't the exciting uncertainty you feel when you encounter something thrillingly, challengingly new. It's the confusion you feel when you encounter something that's sort of interesting but also muddled and of indistinct purpose.An augmented reality experience developed by Sony's London Studio and clearly an evolution of the EyePet technology, Wonderbook centres around a large, sturdy, blue hardback book. The 12 pages are thick and decorated with geometric patterns. Point your PlayStation Eye camera downwards, lay the book on the floor and Wonderbook comes to life on the screen, with the flat blue shapes replaced by a digitally generated book out of which all manner of wonders can emerge.A PlayStation Move wand is the other bit of kit you'll need, as this is what allows you to interact with the book. It also offers a handy connection to the subject of this first in the Wonderbook series, Book of Spells, as Sony has cracked open the chequebook and splashed out on no lesser brand than Harry Potter. Produced with the approval and input of JK Rowling herself, the fantasy being sold here is that you've got an actual spell book, an obscure tome written by one Miranda Goshawk. Guided by read-along narration from a Hogwarts professor, you work through the book, learning and practising spells.With only 12 pages in the book the structure is, by necessity, a little peculiar. The Book of Spells is broken up into five main chapters, each in turn divided into two halves, each of which corresponds to one read-through of the physical book.Credit where it's due: flipping the book open for the first time evokes a genuine sense of wonder. Seeing yourself on-screen, your plastic Move controller transformed into an actual magic wand, the book filling up with words and images that all spill out into your lounge, is a delightful sight. It's simple stuff as far as AR technology goes, but in context, it's absolutely beguiling.It also serves to highlight the strengths of Sony's oft-overlooked motion control set up. There's none of the flakiness of Kinect here. With a physical wand in hand and a robust book on the floor, the camera doesn't care if you shuffle too much, eat a sandwich with your other hand or even if other people are moving around behind you. If there are problems with the technology, they're largely inconsequential: the PlayStation Eye sometimes struggles to “see” the book in anything less than bright light, it has a habit of losing the wand if it's off-screen for too long, and there are  minor issues with flow, as scenes and tasks will sometimes suffer from awkward transitions and lengthy pauses.No, Wonderbook's problem lies not with the machinery but the experience itself. For the duration of the first chapter, the novelty factor is more than enough to entertain. As the experience goes on, however, the lack of depth and some pretty blatant repetition starts to renege on the magical promise that's been made.Each section of each chapter quickly falls into the same routine. You learn how to cast a spell by calling out the incantation (hilariously, the PlayStation Eye doesn't care what you say, only that you make a noise - kids will have a lot of rude fun with this, once they work it out) and then by mastering the simple wand movement required. Then you practice, and it soon becomes clear that there are really only two magical interactions available - spells that you flick at things and spells where you point at something and hold the trigger.~'Have fun with your magic,' the game essentially says, 'but please don't do anything with it.'~This wouldn't be such an issue if the gameplay elements were more ambitious in their scenarios. The Harry Potter universe is vast and rich, yet Book of Spells seems to go out of its way to make magic seem mundane and petty. While millions of children will love learning “real” Hogwarts spells, Wonderbook rarely indulges the fantasy. Your practice tasks are often tiresomely menial in nature - levitating three lost chess pieces, stopping Nifflers from stealing coins or pruning a tree.At the end of each chapter there's a more involved test using all four spells from that section, but there's no room to think around puzzles or problems - the narrator all but tells you what to do and when. Only the timing is in your hands.It's only in the final chapter that things begin to approach the level of adventure and intrigue Harry Potter fans will expect, as you finally get to conjure your Patronus and defend a village from Dementors and werewolves. Even then, there's little sense of escalation or narrative urgency as the experience remains claustrophobic and linear. “Have fun with your magic,” the game essentially says, “but please don't do anything with it.~The closer you look, the more this limited scope eats into the inherited appeal of Potter's world. Throughout the book, you encounter scribbled notes on the page from some mysterious former owner. Potter lore has trained fans to expect some enjoyable revelation where such things are concerned, and the anticipation that we're flicking through one of Harry's old books, or at least Dumbledore's hand-me-down text, is high. But there's no such revelation. The notes are just notes.~Anywhere Wonderbook might validate, challenge or compensate the player, it fails. But since it's so hard to pin down what Wonderbook is trying to be, it's hard to work out how damaging this is.~The same is true of the extras. “You've found another collectable!” chirrups the narrator at regular junctures, but what he really means is “You've unlocked a non-interactive 3D model of a candlestick!” Quite why Sony thought kids would be enchanted by winning a database of visual assets is unclear. Nor do the house points you accrue following each test have any pay-off at the end, a terrible oversight considering how integral they are to the Harry Potter stories. Indeed, it's noticeable that a lot of things go unmentioned during the Book of Spells. None of the Harry Potter characters are mentioned by name, Hogwarts is only referenced obliquely and outside of the spells, there's actually very little to identify this as a product of Rowling's fictional world.Anywhere that Wonderbook might validate, challenge or compensate the player for their actions, it fails. But since it's so hard to pin down what Wonderbook is trying to be, it's hard to work out how damaging this lack of ambition really is.As a narrative experience, Book of Spells is charming enough, if hampered by the lack of any real structure. It's more a loose collection of verses and short tales. The best moments come as you relive stories exploring the origins of spells. Brought to life by a pop-up puppet theatre, which the player can interact with using pull-out paper tabs, it's in these all-too-brief vignettes that Wonderbook comes closest to feeling like an actual storytelling device. As a gameplay experience, it's incredibly limited, with repetitive and often clumsy mini-games that are little more than very small toyboxes in which to play with a particular spell for a short time.~It's likely that even the most enthusiastic player unwrapping this on Christmas morning will have exhausted its charms by the time the turkey hits the table.~It makes it difficult to gauge who, exactly, Wonderbook's target audience is. Harry Potter fans tend to skew older, around 8 and up, yet the slightly condescending tone of the text feels more suited to a much younger audience. For the sake of a little anecdotal evidence, my two kids, aged six and 10, each a bright and eager reader with the eldest a casual fan of the Potter books and films, both grew restless after less than one chapter and showed little interest in coming back to it later.The Book of Spells can be completed in just a few hours, earning every trophy and interacting with every glowing hotspot, so replay value relies to an unlikely degree on the dubious allure of those painfully thin mini-games. With no real reason to do it all again, it's likely that even the most enthusiastic player unwrapping this on Christmas morning will have exhausted its charms by the time the turkey hits the table. “Don't forget to come back and practice your spells!” chirrups the narrator as you close the book for the final time. It's doubtful many kids will take him up on the offer.On a surface level at least, Book of Spells has a lot going for it. Superb production values, witty writing, spirited voiceovers and stirring music all make for an inviting introduction to an idea bursting with potential. Add in some clever and mostly reliable technology and you've got something that should be far more enjoyable and inspiring than it actually is. Sadly, torn between a character license it can't fully use and an experimental format of vague structure and uncertain purpose, Wonderbook's magic spell grows weaker over time, rather than building to a fantastical crescendo."}