{"ref": "https://www.eurogamer.net/kairo-review", "date": "12 Nov 2012", "game_name": "Kairo", "text": "'Numinous' is what used to be called a ten-cent word. That means you can be smug that you know what it means, but when you then try and actually use it in a sentence, you end up feeling a weird strain of overbearing shame. 'Numinous' refers to anything that provides a strong sense of a supernatural, often religious, presence, I gather; as terms go, it does not play particularly well with other parts of the English language. It does not land lightly on the page, does it? “Joe opened the microwave and immediately felt numinous.” “How was the corporate picnic, darling?” “Oh, you know, numinous.” Well buckle up, word fans: Kairo feels like rather a numinous sort of game, and I'm afraid there's nothing much we can do about that.Transcendent soundtrack and inhuman scale aside, even if there isn't an actual god trapped somewhere within this particular machine, there are at least a handful of ghosts knocking around instead. Kairo's a first-person puzzle game set in a deserted world of ancient machines and towering architecture: you won't actually meet anyone who still has a pulse as you wander about, but you will constantly be confronted with confusing relics of the past and tantalising glimpses of a vast and comprehensive knowledge. You'll be forced to ponder how things used to work and you'll steadily tease out how you can get it all up and running once again.The focus is firmly on exploration. Kairo presents its players with a series of huge stone buildings rising out of the ether; staircases race towards giant doors, crumbling vaults hold stony thrones. Your best approach for most of the game is to simply wander about, picking a path between battlements, finials and rooftops, and then mess around with any chunks of machinery you might come across on your travels.Architecturally, the place is a strangely timeless blend of influences, providing the kind of concrete vistas that lend shape to London's South Bank one minute and opting for the pillars and man-made canyons of Karnak Temple the next. Colour is used in bold, rather oppressive, strokes, staining one room blue, the next red, yellow, or green. Combined with the massive rectangles and squares that make up the landscapes, it provides a striking sense of place. Throw in the moody, restless soundtrack by Bartosz Szturgiewicz, and Kairo becomes a game world that you'll struggle to truly emerge from, even once the last puzzle's been completed and the last collectable has been hunted down.While some of the optional stuff is frighteningly devious, the campaign's main puzzles tend to be playful rather than tricky, and that suits the game very well. With no interact button to worry about, you can complete them all by just walking around, stepping on pressure plates and bumping, Weeble-like, against switches. It's not a complete doddle, of course: you'll manipulate weird gadgets, crack primitive number codes, draw out shapes in paths of light, and hop from one oddly-shaped tile to the next as a timer ticks down.~It's the landscape, with its huge concrete cliffs ringing with your briskly echoing footfalls, that truly sticks in the mind.~It sounds like Myst, perhaps, but it's actually a bit closer to the Crystal Maze. One challenge might hinge on lateral thinking while the next turns its attention to pattern recognition or even twitch skills. All the main puzzles are supported by three tiers of hints tucked away in the pause menu, and you'll get through most of them without too many headaches. It's only if you're after the game's deeper levels of unlockables that things really start to get complicated.Progress tends to be swift with only the briefest of bottlenecks, and the stark, quietly religious architecture on offer provides a wonderfully direct incentive to keep plugging away. All the while, an - almost - wordless story is being told: a story of second chances and redemption that builds with every machine you nurse back to health, every crackle of reborn electricity that zips between poles and every jump-started turbine that lurks, rumbling, in the deep.The story's not the part of Kairo that lingers, though. It's not the puzzles either, good as many of them are. Inevitably, it's the landscape, with its huge concrete cliffs ringing with your briskly echoing footfalls, that truly sticks in the mind. Kairo is mysterious and elegant and powerfully distinct. Like Fez and Minecraft, it will work its way into your dreams if you're not careful."}