{"ref": "https://www.eurogamer.net/when-vikings-attack-review", "date": "9 Nov 2012", "game_name": "When Vikings Attack", "text": "Picnic tables can be dangerous things. Don't believe me? Try retrieving one from the middle of a busy four-lane motorway. That was probably my most memorable death in When Vikings Attack, an inventive brawler that's pretty much built around memorable deaths. Death by trumpet, by beach ball, by giant hammer, by wooden penguin - Clever Beans' debut is the absolute antithesis of a complex video game, perhaps, but it generates some rather complex obituaries all the same.You know that part of a game when the designers have introduced something simple and satisfying and then proceed to layer on all the complications? When Vikings Attack never quite gets to that part. Its simplicity is both a blessing and a curse, as you might expect. Even party games like this often come with a little more meat on the bone than you'll find here, but they're also rarely as direct or as instantly appealing.So the first thing you learn in When Vikings Attack is that you move your little herd of hooligans around as a single unit using the left thumbstick, and you can throw the clobber they pick up instantly as they race across the isometric environments with the tap of a face button. The second thing you learn is that there isn't a lot more learning to do: in a very pared-back spin on the Power Stone formula, it's your gang - and possibly your friends' gangs - against a Viking gang. You lob stuff to and fro at each other, thinning the enemy ranks and occasionally collecting wandering reinforcements (your gang size is your health, in essence). Then, when the reinforcements stop trickling in for both sides, it's down to the last man standing.Much of the fun comes from the stuff you're chucking about. These particular Vikings have decided to invade a cartoonish and quietly pretty 1970s England, see, so you'll be warding them off with red phone boxes, Massey Ferguson tractors, and something that looks suspiciously like a Hillman Avenger. Levels have you fighting your way through everything from open farmland to hospital forecourts, village fêtes, pipe factories and even ancient longboats, and while each different environment has its own twists - a postal sorting office has conveyor belts for floors, a seaside town has a tram that trundles by every few seconds - your main incentive to continue is the fresh kibble you'll get to lob. A giant disco ball! What's it like to hit someone with a giant disco ball? (What's it like outside of real life, anyway?)The problem, inevitably, is that hitting someone with a giant disco ball is not that dissimilar from hitting someone with a park bench, or a huge stuffed shark, or a grand piano, or a neon letter A plucked from an advertising hoarding. You just take out different quantities of your enemies depending on the size of the object and the angle of the fling. To give your arsenal a little more depth, Clever Beans chucks in some more powerful weaponry, such as standard bombs, bouncing bombs and a bomb loaded with Vigon, a substance that brings any enemy players it hits instantly over to your own team. Like the rest of the detritus, these spawn afresh on the map every now and then, and provide nice little pinch-points when they do.There are a few other ideas knocking around, too. In the risk/reward department, you have a dash move that can also be used to steal weaponry from your enemies or pluck it from the sky once it's been thrown, and it's countered, in turn, by the ability to set objects spinning to make them unblockable. Boss fights, meanwhile, see you mixing up your tactics as you direct fireballs through curves of metal pipes or knock armoured foes off the tops of buildings.~When Vikings Attack has the best airborne garden umbrella physics of any game I've ever played~This sort of nonsense keeps proceedings feeling fresh a little longer without distracting from a core of simple, well-realised pleasures. There's a wonderfully awkward sense of impact each time the hay bale or traffic cone you've just pitched connects with Viking flesh, for example, and a real sense of triumph when you pinch a bomb from a foe's grasp and then fling it back at them. When Vikings Attack has the best airborne garden umbrella physics of any game I've ever played, which seems kind of noteworthy, and it has the best notification pop-ups to inform me that I've unlocked the dinner lady character, too. It's a limited kind of fun, but it's also rather lean; its focus makes it a decent party game.And it definitely is a party game. While you can solo the whole thing, it gets repetitive fairly quickly on your own. This would matter a great deal if When Vikings Attack was a technically-minded beat-'em-up, perhaps, but it's not. It's a slapstick game about groups of drunken idiots that's designed to be played by groups of drunken idiots, and the moment you leap in with a few friends, the colours instantly seem brighter and the action feels more chaotic.Human enemies are sneakier than the AI, encouraging you to rely on spin attacks and keep your distance from grab-happy foes. They're clumsier, too, meaning that, with thumbstick aiming going awry now and then, you're as likely to take it on the chin from an ally as from a rival. You can play through each of the game's 15 quest mode stages with up to three other players joining you as you face down the Viking hordes, and then there are three competitive modes, too, covering death match, team death match, and an objective-based medal collection mode called Gold Rush. Buying the game allows you to lob things on both Vita and PlayStation 3, too, with cross-save support and local multiplayer for the home console.What Clever Beans is offering is a bit like a blend between Katamari and Worms, really, taking the domestic mess and the size-matters sensibilities from the former title (the bigger your gang is, the bigger the objects they can wield), and the peculiarly English humour and delight in super-violence from the latter. Bobbies, surgeons, dinner ladies; poshos, Geordies, Brummies - one of the great pleasures of this simple high-colour treat is seeing a video game spread its wings in its search for heroes. With more room for Chuckle Brothers impersonators than Nolan North when it comes to the voice work, When Vikings Attack is weird and personable and surprisingly hard to dislike. Cushty!"}