{"ref": "https://www.eurogamer.net/review-beyond-a-steel-sky-an-unhurried-adventure-thats-a-bit-too-roughly-hewn", "date": "14 Jul 2020", "game_name": "Beyond a Steel Sky", "text": "It's the insidiousness of Spankles that bothers me at first.It's a small thing at first, of course. It almost always is. Even before you breach Union City's walls, there's a kiosk giving away free cans of the stuff - actually, there's a lot of vending machines that give away the stuff. ~Wow!~, you think, dispensing a can for gratis for the first time. ~A benevolent government that gives away free refreshments? I'm in!~And then you'll spot another ad. And then another. The Spankles mascot - a nightmarish hybrid of Ronald McDonald and the terrifying clown from Poltergeist that haunted my early years - leers at you from... well, everywhere. You start pondering why there are advertisements at all given they're issuing cans for free, anyway. Later, you might realise the tagline - ~Explodes your mind!~ - is a tad sinister. You wonder why they're pushing it so hard. A health scanner will eventually recommend it, and that's when it becomes impossible to ignore the distant alarm bell chiming in the back of your head. A dystopian cityscape is nothing new, of course. You'll jog gently along, weaving between the unhurried folk with their multicoloured hairdos and futuristic fashions, camera flicked upward to take in the full majesty of this stylish metropolis and its neon lights, and there's a jarring sense of deja vu here. Ryan's Rapture. Comstock's Columbia. Cyberpunk's Nivalis. And now we're in Beyond a Steel Sky's Union City.The Council wants you to think Union City is a clean, pure place where your comfort is always at the top of its priority list, but it sometimes feels like the buildings don't stretch up as much as they glare down at you, heavy and imposing and watchful. Monopods flick all around you - the omnipresent whoosh as they pass by will buzz and irritate in your ears like digital mosquitoes - but you'll never know who's in them, or where they're going. You start to wonder if the shiny veneer of this beautiful place is precisely that; a veneer - a fake front concealing something altogether darker in the undergrowth.It doesn't seem to bother the guy we're playing as, though. This is my first venture with Robert Foster as I didn't play the predecessor, Beneath a Steel Sky, and while he's likeable enough in a superficial, forgettable kind of way, I didn't particularly warm to him, despite his noble mission to locate the missing child, Milo. It's the same for the eclectic supporting cast, too. They're all fine; nothing terrible, even if their accents occasionally are a little wobbly, but I don't feel any emotional connection to anyone I encounter, either. Like the slow, oddly animated NPCs who idle past you along the piazza - or occasionally on top of your head when the collision mechanics go hilariously wrong - they're all a touch shallow. A touch irritating. A touch over the top.You'll spend a lot of time in the company of those NPCs, though, whether you want to or not. Building upon its point-and-click foundation, Beyond a Steel Sky's story is character-driven, and your progression is typically gated by one of two things - character interactions or a hacking mini-game. For the latter, this means you'll spend much of the game darting from one character to the other to gather intel, or exploring the environment to glean clues. This can be anything from luring fowl away from truck doors to exploring an apartment to find out more about the man who lived there, and it's to the developers' credit that the tasks you take on are varied and usually, if not quite always, fall short of laborious.Foster's never in a rush, however, and his lack of urgency doesn't half sap you of yours, too. The hour I spent to-ing and fro-ing outside the city walls felt endless at the time, and while there's a good variety of dialogue options to help you tease information out of the folks nearby, the UI doesn't automatically grey out options you've already taken. This means you might inadvertently initiate a conversation you've already had - ugh - or worse, miss or delay an interaction because even though you've already spoken to say, Pixel, and figured you'd asked everything you could, there are numerous conversations that can be triggered by the same word prompt but there's no way for you to know that without trial and error.Worst still, your companions have a tendency to wander off, so initiating conversations can be a lengthy, frustrating affair that will see you trail after them, desperately waiting for the button prompt that lets you converse with them to pop up again. There are certainly worse crimes than this, I know, but given so much of your progress here depends upon character interactions, it's a shame those interactions aren't more polished.The hacking game, on the other hand, is a neat idea, and one that slides perfectly in to a narrative that requires you to exploit (or circumvent entirely) Union City's borderline obsession of automation and AI. You use it to help the city's AI do your biding - say, inverting the permissions of a door to open when your ID would typically lock you out, perhaps, or changing the route of a cleaning robot to aid in a rescue mission - and while the museum, particularly, outstayed its welcome with this mechanic, I can't deny it's not enjoyable... at least, when I finally figured out what I'm supposed to do, anyway.Thankfully, Beyond a Steel Sky has a fabulous hint mechanic that drops a new clue every thirty seconds upon your request, starting with gentle tips and evidence that, eventually, become full blow-by-blow instructions. It's a fantastic addition that should ensure you'll never prematurely end a session simply because you don't know what to do next. And, oh, it's beautiful here. Bright and bold and full of colour, Union City is a stunning backdrop to Foster's story, and while there are perhaps fewer places than you might like to explore - you'll revisit many places instead of visiting new ones - you can't help but gaze up at the art deco motifs in awe. The Cel-shading isn't as novel a style as it once was, of course, but Foster's world is well-crafted and well-realised, ably accompanied by its score and good voice casting. That said, it's not faultless. NPCs slope by slowly and vacantly. Gang-gangs - the vicious wildlife often preventing you from simple tasks - slide across the ground, never mind the sky. Though admittedly amusing, it's yet another indicator that perhaps another month or two of testing and polishing could've elevated Foster's story from okay to outstanding.Sadly, that's not the only technical issue I encountered, either. There were plenty of quirks and glitches in my press build of Beyond a Steel Sky. Dialogue often stuttered or dropped out completely, and there was one instance where despite both the waypoint and Foster himself telling me I had completed the prerequisite investigation, it still wouldn't give me the prompt to progress. Without a convenient save, I ended up losing several hours' progress - which is a lot, given the game only lasts a dozen or so hours - by loading in a significantly older manual save. That time, I was able to proceed without a problem. Which leads me to conclude that Beyond a Steel Sky is a pretty mixed bag, really. Despite lofty ambition, gorgeous visuals, and an intriguing premise, for every positive, there's a negative, too. I loved Union City but couldn't explore it as much as I wanted. I loved Foster's sassy companion but found most characters a tad shallow, lacking nuance and personality. I loved digging into The Council but found hacking into MINOS a tedious, repetitive experience that rarely innovated. That said, it's an unhurried, intriguing adventure that will likely attract new fans as well as satisfy existing ones; it's just such a shame it's marred by uneven pacing, questionable UI choices, and just one too many performance issues. And I'm still having nightmares about the Spankles clown."}