{"ref": "https://www.eurogamer.net/app-of-the-day-buddha-finger", "date": "30 Oct 2012", "game_name": "Reviews", "text": "I love Buddha Finger, and I think you will too, but honesty compels me to add that it provides a dangerous tutorial for any real-world fights. Lady Shotgun's iOS debut will leave you worryingly exposed on the mean streets of any non-virtual metropolis, and may lead to the foolish belief that even the nastiest gang of thugs can be dispatched with a few taps and swipes. Through a clever use of sound effects and very simple visual feedback, it will convince you that your hand is a lethal weapon. Chances are that your hand is not a lethal weapon, however. Chances are your hand is just a useful grabby thing attached to the end of your arm.Suitably forewarned, though, Buddha Finger is well worth checking out. It's a beat-'em-up of such lo-fi punkish intensity that it probably belongs on the B-side of an old Fierce Panda single, and while it's strikingly straightforward to get to grips with, it's also worryingly compulsive with it. The wayward plot pitches you into an endless series of street brawls, and each brawl, in turn, sees your enemies queuing up for a righteous pummelling. Righteous pummelling, it turns out, is a simple matter of tapping a series of numbered hotspots on the touchscreen in the right order. Pow! Bash! Chop! Who's next?There are a handful of complications, of course: certain moves need to be chained together with a swipe of the finger, while specific foes require a multi-tap beatdown to soften them up. Then there are spin attacks, where you move your finger in an arc, and double-punches, where you tap multiple hotspots simultaneously. Whatever happened to the double-punch, eh? It was once a staple component of every good mismatched cop buddy movie.The visuals are endearingly rough, offering cut-scenes, backdrops and enemy designs of the calibre that only a very early version of MSPaint could deliver. None of this is a criticism, of course - the leering doodles you face off against only add to the bare-bones appeal of the whole project, particularly when they're matched to gloriously basic sound effects and some lovely Casio organ music. If it's a substantial offering you're after, though, Buddha Finger's probably not the game for you. It does make a few concessions to replayability with an efficiency meter that keeps track of how nicely you dispatch your various assailants.This efficiency meter seems a touch flaky, if you ask me: my lurch through some of my worst brawling was met with a cheery 100 per cent, while I was greeted at the end of a truly breathtaking display of martial arts prowess with a limp 56 rating. Not that it matters particularly: if you're after a fighting game with finesse and complexity, keep looking. Instead, this is all about tapping away in a weird state of primitive bloodlust, sending foes flying with a couple of prods of a pinkie before wading on to the next in line. Biff! Pow! Boom! Yes please.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments. For daily app coverage, check out our sister site Modojo."}