{"ref": "https://www.eurogamer.net/super-monkey-ball-banana-splitz-review", "date": "23 Oct 2012", "game_name": "Super Monkey Ball: Banana Splitz", "text": "Some series age like wine, while others rot like milk. Super Monkey Ball sadly turned bad faster than a pint of full fat left out on a hot summer's night, curdled needlessly by motion controls and meaningless additions. The problem, perhaps, is that Super Monkey Ball has always been haunted by the perfect simplicity of the first game. It's since proven exceptionally tricky to nail the art of rolling an enslaved monkey through a series of mazes - for player and developer alike.Games like Super Monkey Ball Adventure added pointless breadth, while last year's Super Monkey Ball 3D dumbed the formula down to a babbling mess. Hell, I'm still annoyed at Super Monkey Ball 2 for having the temerity to introduce something as impure as a switch puzzle. Super Monkey Ball: Banana Splitz, awkward title aside, gets back to basics, and the result is a good game, even if it never really threatens to be a return to greatness. Sony's hardware must take its fair share of the credit; it looks absolutely splendid on Vita, the colour and vibrancy of Super Monkey Ball grounded in a playschool aesthetic that tours a world made up of rough corrugated cardboard and blue squidgy plasticine. Gyro controls are an option, but one that can easily be skipped - thankfully, for once, the level design doesn't seem to be in thrall to pointless motion controls. Instead, the Vita's analogue stick is well matched and well weighted for the kind of torturous exercises in momentum and balance that once made the series sing.The vanilla Monkey Ball mode has moments that dazzle; there are teetering walkways, downhill runs on razor-thin paths and crafty exploits designed for daring speed-runners. It's the stuff that sweet dreams are made of, and as close to the genius of the original as the series has ventured for some time.The challenge quickly escalates, too, and despite a handful of nasty difficulty spikes it's pleasantly tough. The marathon run required by the 50 advanced levels proves a beastly task that's almost enough to make you forget that those 10 years of mediocrity ever happened. The problem, though, is that they're mere echoes of the past. There's nothing that quite matches the audacity of the 0.1 string challenge, and there are signs elsewhere that even though this is a slight return to the dignity of old, it's still a fumbled appropriation.Take Monkey Target, the mini-game that was the first game's secret heart. Excitement about its return soon gives way to mild disappointment - it's now a simple run split over three awkward modes, none of which boast the kind of depth that once inspired entire weekends spent in pursuit of perfection.~More often than not, the novelty has worn out before the timer has run down. There's a slight clumsiness to everything about Super Monkey Ball on Vita.~Some of the other party games - and there are plenty of them - fare better. Monkey Bowling's handled well enough, played by flipping the Vita 90 degrees and then swiping the touch-screen. Monkey Rodeo's another neat little game, played by tapping the rear touch pad to bounce around an arena and jostle for bananas with fellow competitors.Of the new additions, the best is clearly Love Test, a kind of watered-down version of Kuri Kuri Mix that has a character assigned to each analogue stick, and you simultaneously navigating mazes while trying not to leave the other half behind. It's a cute little challenge, and it's served out across a generous set of levels. More often than not, though, the novelty has worn out before the timer has run down. There's a slight clumsiness to everything about Super Monkey Ball on Vita. Its menus are a clicking, whirling mechanical nightmare, and some of its more promising features are a little broken. An Edit Mode had me excited about the possibility of recreating Monkey Ball highlights - but instead it's only possible to take a photo which serves as the backdrop to what feels like a randomly generated level.It's probably quite fitting that anyone who wants to recreate Monkey Ball's past in this way will be left a little disappointed. Super Monkey Ball Banana Splitz sees Marvelous AQL and Sega attempting much the same trick and earning much the same result. This does enough to stop the rot, but it can never quite turn back the clock."}