{"ref": "https://www.eurogamer.net/zombie-driver-hd-review", "date": "23 Oct 2012", "game_name": "Zombie Driver HD", "text": "You may well have skipped past this game when it popped up on various digital storefronts last week. I can't say I'd blame you. That title is like a flashing beacon warning you away: a generic, search-term-driven attention-grabber that reeks of desperation and calls to mind too many slapdash App Store monstrosities and me-too Indie Game clunkers.The title actually works against Zombie Driver in this case, because it's a pretty good game. Not a great one, but a better-than-expected diversion that at least deserves a second look. It's a top-down shooter crossed with the citywide rampages of early GTA, set during yet another zombie apocalypse. Do we need more zombie games? Not really, yet Zombie Driver doubles down on the basic enjoyments you'd expect and justifies its existence through an endearing eagerness to please.Starting out in a taxi, you begin running missions for the military as the undead fill the streets. Your objectives are never very complicated - drive here and kill everything is the motif that repeats across the 31 stages. Thankfully, it's a fun motif and a robustly presented one.Originally released for PC in 2009 and now enhanced with more missions and gameplay improvements, Zombie Driver's visuals have the fine detail and granular physics you'd expect from that platform. There can be dozens of zombies on-screen at any time, explosions are plentiful and spectacular, and simply ploughing through a swarm of gutmunchers at high speed, reducing them to sticky red paste and meaty chunks, is a tangible joy.Clearing an area generally means sweeping around and around a designated circumference until no zombies remain. Occasionally there'll be a nest - a shipping container pulsing with organic horror - that must be destroyed first to prevent zombies from continually spawning. Even with that done, getting the head count down to zero can be a picky job - it's common for zombies to wander in from outside the area while you're positioning yourself on the quest marker, necessitating last-minute mopping up.Eventually you find the game's pulse and can start to clear areas with greater efficiency, even as your efforts are hampered by different zombie types. Hulking brutes will hammer your armour if you let them get close. Others will lob chunks of masonry, chipping away at your protection. Worst are the crudely named Fat Zombies - basically Boomers on loan from Left 4 Dead. These detonate when you get close, taking huge chunks off your life bar. All are easily dispatched, but en masse they can be deceptively dangerous. Just as zombies should be.Under pressure, the controls don't let you down. Movement is crisp and there's a dependable consistency to the physics. Handbrake turns and other driving tricks are easily mastered, so you never feel like the game is working against you. Splattering through a few zombies has impact, but get bogged down in a crowd and you'll need to use nitros to power on through in a spray of gore. ~It's a solid and enjoyable framework, but Polish developer Exor Studios seems unsure what to do with it, even three years after the original release.~There are more vehicles to unlock: some earned through secondary objectives such as clearing a police station to get a cop car, others awarded for performance in the other game modes outside of the story. All can be upgraded with heavier armour and greater speed, while weapons include machine guns, rockets, flamethrowers and a powerful rail gun, as well as more cathartic mission-exclusive options such as tanks and bulldozers.It's a solid and enjoyable framework, but Polish developer Exor Studios seems unsure what to do with it, even three years after the original release. The story missions are amusing enough, but it's revealing that the most fun comes on the journey back to base, when all objectives have been fulfilled and you're free to simply roam around, clocking up score multipliers while threading through back alleys and crashing through fences in search of power-ups and carnage. The game never really takes advantage of its sandbox, and that's especially true of the bonus game modes.Of these, Slaughter is the best. A survival mode by any other name, it asks that you survive the requisite waves of enemies, earning a better weapon power-up each time. It's crude, but it delivers a more consistent level of mayhem than the story and is ideal for bloodthirsty bursts of time-wasting fun. It restricts you to a stupidly small area, though, when the concept is crying out for the whole city to play around in.More disappointing is Blood Race. Given the top-down perspective and the plethora of vehicles and weapons, the decision to include a racing mode makes sense. You'd think that adding zombies to the always-popular Micro Machines-style racing sub-genre would be an unbeatable proposition, but there's one inexplicable oversight: no multiplayer.There are no multiplayer options at all, in any of the modes. Not local, not online. Not co-op or competitive. Pretty much every aspect of Zombie Driver would be improved if you could share it with a friend - but for the racing mode it's an outrageous omission, rendering what should have been the highlight of the package a frustrating bore, with AI racers that are simply no fun to take on.That gaping hole in Zombie Driver's arsenal does more damage to its appeal than any of its other stumbles. A game in which you careen around squishing thousands of zombies under your wheels can get away with duff dialogue and hilariously bad voice acting. You could even say that such things are part and parcel of the genre and a charming throwback to the movie output of Lucio Fulci. Failing to build on a promising foundation, and completely leaving out gameplay elements that would elevate the whole, are less easy to forgive.Scrappy design and presentation mean that it's hard to give Zombie Driver a more enthusiastic thumbs up - but as a particularly goofy example of the sort of guilty gaming pleasure that rarely gets a look-in amongst the autumn blockbusters, it's impossible to dislike."}