{"ref": "https://www.eurogamer.net/forza-horizon-review", "date": "22 Oct 2012", "game_name": "Forza Horizon", "text": "Forza Horizon is one of those games that tries too hard to look hip. Its characters and setting - a festival of music and motor racing - share the same sanitised vision of youth culture you see in ads for mobile networks. Its colour scheme is black with hot pink and every menu rests at a 15 degree angle. Achievements have titles like 'OMG' and '#WINNING'.Perhaps it's trying to correct the famous lack of charisma of its parent series Forza Motorsport, from Microsoft's in-house team Turn 10. Or perhaps it's trying to cover up a strain of rank commercialism, since it's plastered in sponsor logos and invitations to buy tokens for shortcuts. An offshoot made by another studio - new UK outfit Playground - Forza Horizon comes across like a marketing drive first and a game second, tainted as it is with buzzwords like ~brand extension~ and ~annual cadence~.Prepare to swallow your cynicism, however, because Forza Horizon is a quite brilliant racing game - one of the best of its generation. It's also a lesson in how to make that development model work to create something greater than the sum of its parts.Rather than a chop-shop banger, this is a custom thoroughbred: a game that shares many of the strengths of its parent and adds a few that are all its own. Playground is a talented supergroup of racing game veterans working with raw materials of the finest quality: Turn 10's graphics and physics engines, handling model, upgrade system and car catalogue. On these rock-solid foundations it's built a hugely entertaining blacktop odyssey that finally realises the potential of open-road simulation racing.Those open roads are found in a miniaturised impression of the US state of Colorado, rendered as a sort of theme park for autophiles. Colorado is known for its majestic scenery, and Horizon does it justice, creating a pocket universe where towering mountain ranges flow smoothly into rolling plains and red-rock canyons in the space of a few miles.It's as neatly and credibly condensed as the short 24-hour cycle that bathes the landscape in the rich tonal changes of late summer dawns and dusks. It's a simply gorgeous map - and anyone who's been lucky enough to take to the local roads for real will attest to how faithful it is in detail and atmosphere, if not actual geography.All this craft comes at the cost of true scale. It's a deceptively compact game-world and you will see most of its variations within a few hours, while the many dozens of race events have to make economical use of its road network. Over time you'll become intimately familiar with the snaking passes, roaring freeways, secret dirt tracks and tangled smalltown layouts, learning the corners as if it were a single, giant circuit. That's not a bad thing; while it's not built on the breathtaking real-world scale of Eden's Test Drive Unlimited games, the roads are a good deal more interesting to drive.And the driving itself is in a different league. Although crash physics are now extremely forgiving to accommodate slow-moving traffic, and there have been tweaks to the steering in particular, the handling model is recognisable as the full-fat Forza experience. It's effortlessly playable on default settings, but take the assists off and it's there in all its glory: hefty yet pliant, with a not unreasonable tendency toward drift. Even slower cars are involving to drive, and the experience on a good force-feedback wheel (I tested it with Fanatec's CSR) is sensational.~Evocative, surprising, varied, free-flowing: Forza Horizon is a lot of things that Forza Motorsport never has been.~The handling has also adapted extremely well to the new off-road driving. While Horizon is not a hardcore rally game (most cars cope unrealistically well with a dirt track), you can have a lot of fun chucking yourself sideways through corners with an armful of opposite lock in an Audi Quattro or Mitsubishi Lancer. Horizon's real revelation, though, is taking a supercar to a winding highway, threading it through traffic as you chase down another racer, and feeling the hurtling mass of metal in your hands as you never have before in a game of this type.Evocative, surprising, varied, free-flowing: Forza Horizon is a lot of things that Forza Motorsport's clinical and repetitive circuit racing never has been. Most importantly, it's a far more diverting and satisfying single-player game.The set-up has you arrive at the Horizon festival as a no-name newbie and rise through the tiers of competition - symbolised, in a neat touch, by coloured wristbands - while taking down arrogant rival characters and being flirted at by the cutie-pie organiser. It's bland fluff with some painful one-liners, but it's not given undue importance, it's slickly done and it does work quite well as a context for the racing. The festival atmosphere is consistent and well captured: you'll watch lasers strobing across the plain at night, cross the line in a barrage of confetti cannons and hear the bands and DJs on a tinny radio in the mechanic's workshop.Festival racing is a mixture of point-to-points and circuit races with a variety of restrictions that encourage you to fully explore the car catalogue. You can also take part in illicit street races through traffic, set speed trap records, challenge other racers to impromptu sprints in the open world, indulge in crowd-pleasing showcase events, and undertake skill challenges (the game awards skill points for drifting, near misses and the like). You can even take a more relaxing drive, delivering a valuable car undamaged to a beauty spot for a photo session, or exploring backwaters to find a barn containing a rusting classic for your collection.Some of these PR stunts reduce the cost of fast travel around the map. But you'll rarely want to use this feature, because simply cruising the road network behind the wheel of your latest crush is one of Horizon's greatest pleasures. You can take your pick from a thoughtfully pruned version of the Forza roster, with most of the more interesting production hardware left in and some tasty additions like the stunning Eagle Speedster.You'll be surprised by how many of Forza Motorsport's features are present and correct: the powerful paintjob creator is there, complete with player trading, and so are the performance upgrades, although you can no longer tune your ride. Forza 4's excellent Rivals system for time-trial challenges with friends is well integrated - you're offered the chance to challenge a friend's time after every single-player event.Where Horizon doesn't quite match its parent is in multiplayer. Playground's made a considerable effort, even including some fun games of tag set in open arenas (warehouses, a golf course) alongside the race lobbies. But the finesse and discipline of circuit racing will always be better suited to competition than Horizon's more seat-of-the-pants driving style, not to mention its wild crash physics.What's more disappointing is the half-baked exploration of open-world multiplayer ideas. The only multiplayer option that exploits the full map is a free roam mode featuring no traffic and some amusing but poorly communicated co-op challenges; it's not quite a case of making your own fun, but you will have to work to extract it. Next to Burnout Paradise's rolling multiplayer, or Test Drive randomly phasing other players into your game, it's a timid attempt.~Even accounting for the superb tech and support it's had from Turn 10, Playground's achievement here is immense.~You can chalk that one up to a new studio having to curtail its ambitions on its first outing. Another item on that list is the underused skill system - reminiscent of PGR's Kudos - which could have been put at the heart of the game, but instead feeds into a largely superfluous and very grindy secondary progress layer called 'popularity'. I can't imagine Microsoft will do a very brisk trade in the popularity boosters for sale on Xbox Live Marketplace.  That's about it for compromises. Even accounting for the superb tech and support it's had from Turn 10, Playground's achievement here is immense.Forza Horizon is built on the best parts of the Motorsport games but delivers a strikingly different experience to them, and in many ways a better one. It has its own personality. It exchanges infinite laps and bottomless grind for an actual structure and a sense of adventure, while mastering its roads requires less practised skill than it does courage and intuition.It's still not quite cool, but its luscious sensory rush overcomes any resistance: the sweeping scenery, the tactile handling, the throaty exhausts, the insistent thrills of the throbbing Rob da Bank soundtrack. Forza Horizon is a big, exciting game that finally brings car enthusiasts together with the realistic open roads they crave."}