{"ref": "https://www.eurogamer.net/deadly-premonition-2-review", "date": "10 Jul 2020", "game_name": "Deadly Premonition 2", "text": "Trying to talk about the original Deadly Premonition is complicated. On a fundamental level, it's a mess - a groaning slab of technical shortcomings and design deficiencies that would usually be enough to sink a game without a trace - and it's a game that's often dismissed, unfairly I think, as bit of a joke, a so-bad-it's-good experience worthy of a chuckle on YouTube and nothing more. Enough of us would argue though - unironically and with absolute earnestness - that it's also brilliant, a masterpiece of form; bold, ambitious, fiercely heartfelt, and a game that aims so, so high, and succeeds not because of, but in spite of its flaws.Partly that's due to the original's wonderful sense of place; its small-town murder mystery might have borrowed liberally from Twin Peaks, but its open-world setting - the perpetually grey, pine-scented highways and byways of Greenvale, Washington - felt both distinctive and positively alive as its sprawling cast of wonderfully realised oddball inhabitants went about their daily schedules in real-time, revealing their secrets to anyone with the curiosity to follow and observe.It was frequently ridiculous, yes, and not always intentionally so, but it was also, ultimately, genuinely affecting as its engrossingly bizarre plot wrought havoc on this shonkily implemented microcosm of  life, finding some oddly insightful truths along the way. And at the heart of it all was Agent Francis York Morgan, still one of gaming's most endearing protagonists, a relentlessly upbeat, chain-smoking FBI investigator, with a penchant for monologuing about his favourite 80s movies and a mysterious invisible friend called Zach.Deadly Premonition 2: A Blessing in Disguise is, initially at least, just as waywardly wobbly and improbably engrossing as its predecessor; never one to let a seemingly minuscule budget rein in his ambition, designer Hidetaka ~Swery~ Suehiro this time serves up both a prequel and sequel to his cult classic hit (knowledge of the first game's events is certainly helpful), and, as proceedings get underway in 2019, time has not been kind to Agent Morgan.In a long opening sequence (one of several dialogue-heavy, loosely interactive modern-day interludes), a retired Morgan, now grey haired, wild-eyed, and ravaged by cancer, locks horns with Aaliyah Davis, a Nietzsche-quoting FBI Agent who arrives at his apartment on the trail of a drug called Saint Rouge - ultimately re-igniting memories of a fateful murder investigation that occurred 14 years prior in the Louisiana town of Le Carré.Eventually, as we're whisked back to 2005 to experience the case first-hand, Morgan's former self is restored. He's as warm, witty, and insightful as ever - discussing his favourite 80s movies in Patrick Batemen-esque detail in one breath, and a grisly murder with upbeat zest the next - and his earnest optimism once again forms the unmistakable heart of it all. And it's here that Deadly Premonition 2 settles into a pattern of eccentric open-world exploration and survival horror action that should be immediately familiar to fans of the first game, even if its sun-bleached southern atmosphere is more True Detective than Twin Peaks this time around.Deadly Premonition 2's intermittent survival horror interludes - which thrust York into a gloomy otherworld to roam a linear arrangement of indistinguishable corridors, mowing down a grand total of three AI-deficient enemy types - are no less clumsy and dully simplistic than those of its predecessor, but are considerably fewer in number this time around. Instead, the bulk of your time is spent out in the open-world, performing largely mundane tasks for Le Carré's new cast of appealing oddballs - including a local sheriff who narrates his life like a movie trailer voice over and a hotelier with a very dedicated work ethic - with the occasional quiz-like investigatory segment thrown in to further the mystery.Thankfully, the painfully awkward, interminable driving sequences of the original are jettisoned in favour of something a little sprightlier here - York now roams town on his trusty skateboard, monologuing merrily (and infuriatingly repetitively) along the way - and there are presentational improvements too. Deadly Premonition 2's comic-book art style is a delightfully fitting update to its rather drab precursor, bringing a greater sense of warmth and richness to the world, and the diverse soundtrack is fantastic, both wide-ranging and mercifully whistle-free.This, though, is where we take pause; from a technical perspective, Deadly Premonition 2 is a disgrace. Indoors, its frame rate could charitably be described as inconsistent, but out in the open world, it's a migraine-inducing single-digit slideshow compounded by stutters and seconds-long hitches. My play-through also graced me with unkillable enemies, suddenly unresponsive controls, disappearing weapons, endless looping sounds, missing textures, floating environmental objects - all requiring a reload to fix - and at least two crashes to the home screen. The original Deadly Premonition might not exactly be a bastion of technical competence but for publisher Rising Star to be releasing a game in this state, a decade on, as a full-price title is shameful, even if it has now made allusions to some non-specific improvements it might conceivably make at a later date.There'll be many, of course, who are willing to accept technical shortcomings as part and parcel of the Deadly Premonition experience, and A Blessing in Disguise is at least playable in a strictly literal sense, even if doing so is never particularly pleasant, given its overwhelming focus on open-world pursuits. And for a while at least, Deadly Premonition 2 is a real joy, riding on a wave of appealingly unpredictable Swery silliness, married to a central mystery with a real sense of drive. Unfortunately though, while the first game's strengths ultimately overshadowed its weaknesses, it's increasingly difficult to tolerate Deadly Premonition 2's failings the more it reveals itself to be a far less ambitious, and considerably less interesting sequel.For all its diversions and deviations, the bulk of Deadly Premonition 2's runtime consists of painfully circuitous open-world fetch quests, casting you out across a lifeless, largely forgettable map for lengthy bouts of headache-inducing mundanity that even York's relentlessly upbeat observations can't save. Act two, in particular, is a real nadir, offering an interminable procession of time-gated busywork that does nothing to drive the plot forward.Its biggest failing, though, is a muddled story that's poorly told; while its predecessor deftly kept multiple plates aloft as its murder-mystery unfolded, making the town and its citizens feel central to proceedings, sometimes devastatingly so, neither Le Carré or its inhabitants make much of an impact at all. Most characters are peripheral to the scattershot plot, all but vanishing after the first act, and although there's rudimentary time-based movement for Le Carré's denizens, it's nominal at best, and there's no sense, this time, that any have lives off-screen.It doesn't help either that the characters the game does invest in only serve to highlight its well-meaning, but ultimately rather problematic world view. For all York's spirited rejection of bigotry, Deadly Premonition 2's reliance on outdated tropes around transgenderism and learning disabilities can give the otherwise cheerfully freewheeling adventure a rather bitter undercurrent.That's not to say it's an experience without merit; as underserved as most characters are, Patricia, York's temporary teenage sidekick, is a surprisingly likeable addition to the cast, and while the flashback offers a largely limp slog, only sporadically enlivened by dizzying plot beats, the present-day section is a whole other matter. These lengthy interrogation sequences, heavy on dialogue and light on interaction, are wonderfully atmospheric intermissions, positively crackling with tension as Agent Davis serves as Morgan's fiercely intelligent foil.Ultimately, though, nothing is likely to disuade fans of the original Deadly Premonition eager for a second outing; technical shortcomings, wobbly game design, and questionable plot developments have been the accepted price of entry for over a decade now, but while the first game succeeded in spite of those flaws - serving up a meticulously implemented, and surprisingly emotional, murder-mystery that pulsed through its world and its citizens, seemingly in real-time - Deadly Premonition 2 often feels rote, lifeless, and rather hollow by comparison.The inimitable Agent Morgan is undoubtedly Deadly Premonition 2's saving grace, and, truthfully, I'd happily endure its frequent tedium all over again just to spend more time together; it's just a shame that his long-awaited return couldn't be marked by a more inspiring adventure."}