{"ref": "https://www.eurogamer.net/torchlight-2-review", "date": "24 Sep 2012", "game_name": "Torchlight 2", "text": "About an hour into Torchlight 2 I'd already hit Level 8, and that was a pretty nice state of affairs. What was even better was that I'd been invited to visit Plunder Cove by a ghostly ferryman type in order to smack around some undead sailors who had done him a wrong'un.I won't tell you exactly what I found in Plunder Cove, even though I'm absolutely dying to. It's one of my favourite moments of this gaming year, and you deserve to discover it for yourself. What I will say, though, is that the name of the place had me won over even before I'd seen the misty underground lagoon itself with its giant crabs and its shimmering wraiths. Plunder Cove: you bet I want to go there. Actually, why do games ever send you anywhere else?Torchlight 2 is fairly riddled with improvements - new classes, new skills, six-player online co-op, a much larger game world, pets that can come back from the shops carrying groceries - but the thing I really love about it is the atmosphere it conjures up. Runic's sequel has the rich, oily colours and wispy smoke trails of a battered pulp paperback cover, and its dungeons are filled with tentacles, coal-driven robots and skeletons who have-at-you with the very sword that once skewered them to a wall.Dressed up in the world's chunkiest, friendliest art style, it's the kind of antic, swashbuckling romp that can get away with having an NPC named Professor Stoker, and although most of its quests are pure smash-and-grab affairs - and quite rightly so - they're always presented in elaborate Lovecraftian terms. Who doesn't want to travel through the Witherways to Riftkeep? Who doesn't want to defeat the Manticore in the Stygian Aerie - particularly when it's as a favour to the Sphinx at the Forsaken Gate? It doesn't really matter that the Manticore's just another big guy who's waiting to explode into coins and weapons. What matters is that you get a little bit excited at the very mention of his name.~Runic's sequel has the rich, oily colours and wispy smoke trails of a battered pulp paperback cover, and its dungeons are filled with tentacles, coal-driven robots and skeletons who have-at-you with the very sword that once skewered them to a wall.~That's not to play down the refinements. While the basics haven't changed much since the original Torchlight - you still tool through randomised dungeons, click-killing masses of shambling enemies with your axes and bows or blasting them to pieces with the spectacular skills you earn by levelling - things are expanded and improved almost everywhere you look. The single town of the first game has been replaced with a handful of small but characterful hubs scattered across a large and varied overworld, while the lone campaign dungeon with its stacked floors diving ever deeper has been swapped out in favour of dozens of caves, grottos, tombs and palaces filled with secret rooms and unspeakable bosses.These places are still randomly generated, but the randomisation feels a bit more organic now with its sprawls and its dead-ends while the tile sets really take you on a journey. From the golden dunes of the Ossean Wastes to the rain-lashed forests and graveyards of Rivenskull Gorge, the world is far more exotic and lively. Why wouldn't it be? There are handfuls of side-quests threaded in alongside the lengthy main narrative, after all, and once you complete the campaign you'll have access to the Mapworks, whose scattered charts provide even more randomised fun. The hacking and slashing never has to end, really. There's even an achievement for hitting level 100.The storyline sends you chasing after yet another ember-infected loon who wants to do something bad deep underground, but the game's main thrust - as is the case with any good dungeon-crawler - lies with the character classes. There are four to choose from this time around, each with their own charge bars to build up by handing out damage (you can then cash this stuff in for brief bursts of class-specific perks, such as the ability to use your magic attacks without consuming mana). Each also has three skill trees to plot a super-powered course through. ~The hacking and slashing never has to end... There's even an achievement for hitting level 100.~The Berserker's a barbarian who can be specced out to focus on massive melee moves, frosty and electrical attacks, or the ability to summon - and channel - wolves, while the Embermage is all about elemental magic, dividing its strength between fire, ice, and lightning. The Outlander's comfortable with guns and casting, and comes across as a blizzard of projectile skills and curses, topping off with the ability to summon a Shadowling Brute.I spent most of my time as an Engineer, though: a seismically-inclined monster-puncher who doubles as a kind of pet class for Roombas. By the end of the game, I was deep, deep underground, racing across gantries, trailed by a chummy clutter of summoned robots: skittering Gatling turrets, a bronze-plated health guy, mechanical spiders who explode on impact.The skills may not have the astonishing sweetshop variety of Diablo 3's, but they're tethered to unlock at specific levels in a relatively similar manner, and you're free to swap them in and out of your ten-slot hotbar as you wish. What you can't do, though, is respec yourself on the fly: at most, you'll be able to pay to remove your last three skill points, but otherwise your decisions stick. There's something pleasantly stoical about this traditional approach to role-playing. It means that if you want to see a different side of the class you're using, you'll have to start a new game and make different decisions. It also means that those decisions really count.What of the loot? This was the very element that withered under Diablo 3's skill-based onslaught, but it's alive and well in Torchlight 2. Armour is stylish and riddled with enchantments, while weapons remain your go-to attacks for much of the game. Between the cannons and the fist spikes, the bows and the swords, the two-handed and the one-handed, there are plenty of reasons to return to your inventory every few minutes for another rummage through its thrift-store depths. Sockets, sets, rares, uniques: it all looks great, and it allows you to vary your approach, the skills you depend on and the pace of each battle as much as you want. ~Torchlight's combat has an enviable handle on cartoony impact, and it channels the thwack of a sword right through the mouse and all the way up your arm.~Even if you stick to a few firm favourites for hours on end, you'll find the hacking and slashing action benefits from hundreds of tiny little improvements, from a slightly faster movement speed to a new fumble option that replaces straight-up misses in a more satisfying manner. Fights grow increasingly hectic as you race into the second and third acts, and the bosses range from huge swamp-dwelling dinosaurs to smog-spewing war machines that fire rockets out of their chest cavities with weirdly sensual little wriggles.Enemy attacks are wonderfully varied, and the odd dungeon even has a mechanical twist to mix things up, such as a section where you have to stay within a roving spotlight as the world builds itself around you and the critters close in. It's a nice moment, but the game doesn't need it: Torchlight's combat has an enviable handle on cartoony impact, and it channels the thwack of a sword right through the mouse and all the way up your arm.A range of difficulty levels are available from the start, with the option to turn on permadeath. Casual's a gentle walk in the park, while Veteran is a gentle walk in the park just down the road from my house, where the cops have to take shifts at the gates and even the seagulls carry automatic weapons. It's a challenge to solo, but it's designed for Torchlight 2's headline improvement: online co-op with up to six people.The weird thing is, online co-op feels such a natural fit that it's initially surprisingly hard to see it as a new feature. That's the ultimate compliment, I guess: after 10 minutes of cutting a swathe through the landscape with friends, you'll feel that it's always been this way, even though the first game was a resolutely lonely affair.~If the first Torchlight capitalised on the continued absence of Diablo 3, the second feels like a genuine alternative to it.~It's an essential addition, and while the bare-bones lobby system that's employed means you'll often need to arrange things in advance with people before jumping into a match, you can lock games to friends only and waypoint yourself to other players once you're in. The classes work surprisingly well in concert, too. All told, co-op is as much fun as you could hope for, and the only slight annoyance I have - beyond an absence of player-versus-player combat - is that loading up your campaign as an internet game seems to knock you back to the nearest town.Torchlight 2 has improved almost everything, then, and that's without giving in to certain infamous modern temptations. There's no always-online requirement and no real-money auction house; that means the game is fully playable without an internet connection and that modding is actively encouraged. Throw in the strength of the loot system, those selectable difficulty levels unlocked from the off and the fact that your character decisions really stick, and you've got clear blue water between this and Diablo 3. The relationship between the two games is fascinating, actually: since the Torchlight series is made by some of the key figures behind Diablo and Diablo 2, the arrival of Torchlight 2 feels a bit like that moment in the second Back to the Future film when there are suddenly two different versions of 1985. I'll leave you to decide which game's the one where Marty has a freshly-waxed truck and a camping trip with Elisabeth Shue lined up, and which game's the one where Crispin Glover's been murdered and the Clock Tower's become a casino. I love both of this year's big dungeon crawlers, though, and they don't overlap as much as you might expect.That's the key, really: if the first Torchlight capitalised on the continued absence of Diablo 3, the second feels like a genuine alternative to it. It's a colourful, heartfelt and well-judged spin on one of the most reliably engrossing genres knocking around. Pick a class, choose a pet and set a course for Plunder Cove."}