{"ref": "https://www.eurogamer.net/fifa-13-review", "date": "20 Sep 2012", "game_name": "FIFA 13", "text": "If you had told me at the start of the year that I would spend more time in 2012 playing a football game not made by EA Canada than I did in the grip of its imperious FIFA series, then I guess I would have told you there was more chance of Robin Van Persie signing for Manchester United. But hey, strange things do happen.Weirdly though, this unexpected interloper wasn't PES 2013, although Konami's latest is a fantastic football game. It was New Star Soccer. By breaking football down into short bursts of its most exciting and rewarding elements, like long-range shots and Hollywood passes, and tying that into a shallow but addictive management sim, New Star Soccer completely took over my free time. Through my long hours playing it, I often thought that Konami and EA Sports could learn a thing or two from its success and that of games like it.Well, it looks like EA has done. The new Skill Games mode in FIFA 13 is exactly the sort of bite-size football challenge that makes smartphone treasures like Flick Kick Football so compulsive - except that it's built on one of the best football gameplay engines around, with all the pomp and connectivity you'd expect from a modern sports game.My current favourite Skill Game is the Advanced Shooting Skill Challenge, where you get two and a half minutes to score as many goals as possible in a revolving range of scenarios. There are always two burly defenders chasing you down and a goalkeeper to beat, but sometimes you're racing onto a through ball to chip the goalie, sometimes the ball is fired into you in the box for a bicycle kick, sometimes you're on the halfway line with the keeper retreating into his area, sometimes you're about to receive a header 12 yards out, and so on and so forth, and you can react however you want.The scenarios come thick and fast, with barely a second to catch your breath, and big points are awarded for successful strikes, while beating players and drawing impressive saves hands down smaller rewards. At the end you set a high score. Then you hit Restart and do it again. And again and again until well past midnight. There are plenty of Skill Games to master - some more elegant than others - and they're also randomly selected to act as a diversion while you're waiting for proper matches to load.When those matches do load, it's clear that FIFA 13 hasn't lost its way when you're playing full-fat football either. The basics of last year's overhaul are intact - Tactical Defending still forces you to think about containment and positioning rather than direct pressing, while the Impact Engine means you have to worry about the physical side of the game as well as speed and passing accuracy. The Impact Engine has been tidied up slightly - not so much to completely eliminate the physical comedy, but enough that it isn't a constant companion - although Tactical Defending seems much the same. Can we try it with the ability to control the distance between defender and attacker next time, chaps?Even the headline changes for FIFA 13 are more evolutionary than anything. The most noticeable is First Touch Control - which we've nicknamed ~Dave~ in the office, as in ~I would have put you through there but Dave screwed me over~, because of its tendency to make fluid attacking moves less predictable. Dave uses individual players' finely tuned stats and their situation when they receive the ball - under pressure, facing away from it, sprinting near the touchline, etc - to determine how well they initially control it. This can disrupt the tempo of your play, but with practice it really just makes you pay more attention to what the ball is doing rather than assume you'll have instant control and look up for a quarterback pass to an advanced attacker.The other major tweaks are the addition of more fine control over dribbling and better supporting play off the ball from your team-mates. The former is pretty satisfying, allowing you to apply almost FIFA Street levels of close control when you're facing up to a well-disciplined defence, while the latter is a definite improvement over last year, when a lot of attacks would peter out as you made it to the edge of the opposing penalty area and realised nobody had bothered to come with you. It certainly feels like you convert a lot more rebounds now - although that may also be because the goalkeepers spill the ball more realistically - and that your team is more organised and thoughtful going forward.Now that you have more close control along with last year's Precision Dribbling, it should be a lot easier to slow the game down, but the immediacy and responsiveness of FIFA - certainly compared to PES, which feels a lot more precarious - means that in practice only games against the AI have a slower tempo. Most of the games I've played with other humans have been like a succession of cup ties, full of quick throw-ins and free-kicks that eliminate pauses in play, quick counters and - if one side's winning - a frantic last few minutes of deep defending and balls being pumped long. A lot of this stuff can be managed by asserting yourself more with strategy, tactics, substitutions and formations - but the majority of players don't bother, so FIFA 13 can still seem quite harem-scarem.It's still loads of fun, though, and that seems to be what FIFA is most comfortable being. Tactical Defending in FIFA 12 was a brave move, forcing a huge audience to relearn something quite fundamental, but the philosophical division between PES and FIFA has heightened considerably this year. PES is like a succession of Tuesday night away games in the biting cold, generally dour but thoughtful and more about the build-up than the goals. FIFA is like a succession of FA Cup Finals and Super Sundays, full of glamour and intensity and remembered because of the commentator's guttural howl of ecstasy rather than the midfielder's poise. Perhaps it's best summed up by the shooting: in PES, it's very hard to get a shot away and it often looks a bit floaty even when it goes in, but in FIFA you can rain them in and every shot on target feels like it's been through Sky Sports' edit suite and cleaned up to look beautiful.FIFA 13 is also the most broadly appealing game EA Canada has ever produced in other ways. It's absolutely rammed with different ways into it, and it takes unprecedented advantage of its intimacy with the people who run the big leagues and own all the broadcast rights.Certainly from an English perspective, the sense of engagement with the Premier League this year is amazing - the game is updated weekly with the latest team and player stats based on form and results, and it's possible to play replicas of real-life fixtures with the correct line-ups and weather conditions. You even have Sky Sports pundit Alan McInally phoning in updates on other live games to main commentators Martin Tyler and Alan Smith. The results in these are fictional, but it all adds to the colour.There's also Game of the Week, allowing you to relive a tasty game from the past weekend (in the review code, it's QPR vs. Chelsea, although of course nobody mentions why it was an emotionally charged encounter). Then there's the Career mode, which has been filled out with extra supporting detail - things like scribbling signatures on transfer offers, press conference and player feedback, and classified results being read out after a round of matches - and there's seasonal play in Pro Clubs mode. Then there's EA Sports Football Club, which throws up occasional challenges - like Man City being one down against Chelsea with a penalty and 10 minutes remaining back in March, using squads dated to the original game.And, of course, there's Ultimate Team, now the game's main mode for many FIFA players, which has had a lot of attention. You can challenge the Team of the Week for rewards every seven days, there are online and single-player versions of season play, and the way fitness works has been updated so that consumables are more valuable. There are also new Manager Tasks - a checklist of micro-challenges that add up to big rewards when you complete them all. Many of the interfaces throughout Ultimate Team and elsewhere have been redesigned to be more user-friendly, too, although they still have a slight sluggishness to them, and there are much better in-line tutorials using Martin Tyler's narration and on-screen overlays to illustrate new features.Tying this all together is the new Catalogue part of EA Sports Football Club. The idea is that as you earn XP by taking part in different activities and as your overall player level increases you can dip into the Catalogue and use your earnings to unlock things like new boots, classic team kits and elaborate goal celebrations, along with stats boots for your Pro player or special perks for Ultimate Team.Browsing the Catalogue and thinking about XP, coins, FIFA points and so on does occasionally make you wonder why FIFA 13 needs so many different in-game currencies, which probably seems like a strange thing to say about a football game. But it isn't really. Football is relentlessly commercial nowadays, and so is FIFA 13. Indeed, it's one of the things that makes it so engaging, because it's not just a brilliant simulation of football, it's also a brilliant simulation of what football has become: addicted to superficiality, with Sky Sports as its dealer of choice.If that sounds like tainted praise, then I suppose it is, and if this development is something you object to then you can always choose PES 2013 instead this year, because after a few years of rebuilding it now offers a credible alternative. If you do go with FIFA 13, however, then you will find more ways to play it, all of them detailed and engaging, than ever before, and you will probably still be playing it when we're back here again in a year's time for the next instalment."}