{"ref": "https://www.eurogamer.net/app-of-the-day-the-room", "date": "19 Sep 2012", "game_name": "Reviews", "text": "I'm not sure whether it's just a peculiarity of my social circle, but on the off-chance that other people will react the way many of my friends have upon being told I'm playing a new game called ~The Room~, I feel compelled to begin by noting that it has nothing whatsoever to do with Tommy Wiseau's extraordinary indie film of the same name. Lisa will not be tearing you apart. This is probably a good thing. (And if you have no idea what I'm on about, that probably is too.)This Room, by Guildford-based indie startup Fireproof Studios, is something else entirely. It's an especially fine example of the escape the room sub-genre of adventure games, played out in a single location where you rotate and fiddle with the exterior of an ornate wooden box, using the various gizmos, puzzles, notes and contraptions your probing uncovers to dig further into the mysteries and other boxes within.The game begins with you staring at a large metal safe and rotating and panning around it by swiping the screen. You discover an open envelope on top of it and use your finger to drag a piece of paper out of it. Inside the box are the answers you seek, it says, along with something unique and powerful.The letter also contains a small brass key, which you tap to load into your inventory. You find a domed circular box nearby with a lid that rotates, aligning a keyhole where you can insert and turn the key, before lifting the lid. Inside is an eyepiece, along with a riddle.As you scour the outside of the safe for more clues, you find the answer to the riddle and push against the panel bearing its inscription, revealing another hidden key. It turns out you can rotate the end of the key, which can then be inserted into an oddly shaped keyhole hidden behind a sliding panel elsewhere on the safe, which gives you access to another concealed chamber.All of this happens in the tutorial, and then on and on it goes, taking you deeper into the safe and its contents. These little interactions - a double-tap here, a slide or swipe or rotation or dragging motion with the finger - are as natural as though you were running your fingers over the locks, grooves, drawers and panelling yourself. As you progress through the chapters and the boxes grow more complex, you find yourself working at light refraction puzzles, broken clock mechanisms and intricate star charts, all full of puzzles within puzzles, all drilling down further into the contents of the safe, the box, and whatever objects it reveals to you.As you make your way further inside, you start to find new messages from the box's former owner, who talks in cryptic terms about the nature of the discovery that led him to seal away the unique and powerful artifact that you're seeking. Just as his writings suggest he was drawn inexorably to it even as he grew more fearful of its nature, so you find yourself drawn further into the mystery he left behind by your compulsion to slide back one more panel, unlock one more mechanism, and just to see what's inside the box.There may be superficial parallels between your objective in The Room and the work going on elsewhere in Guildford on Peter Molyneux's Curiosity: What's Inside The Box, but whereas 22 Cans' app is an experiment in group behaviour, The Room is an adventure for one person - or a couple hunched over the same iPad, as I found once my fiancee joined me for the tutorial and never left my side. The ambient soundtrack, beautiful and peaceful visuals and eerie sense of the supernatural combine with the intimacy of the controls to draw you in and drown out the world around you.It will take you a couple of hours, perhaps, to make it to the end of The Room, and if you get stuck in one place for too long then there's a hint system that gently points you in the right direction. But I strongly advise you to resist hurrying and savour every sliding panel and twist of a dial. The Room is the cave of mysteries from everyone's childhood; a perfect encapsulation of the fear and pleasure of discovery. If the words ~secret compartment~ make your fingers tingle, beat your way to the App Store and put them to use.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments. For daily app coverage, check out our sister site Modojo."}