{"ref": "https://www.eurogamer.net/f1-2012-review", "date": "17 Sep 2012", "game_name": "F1 2012", "text": "F1 hasn't been short of some sparkling campaigns since it slowly awoke from its Schumacher slumber, but 2012's has been truly special. Seven winners in as many races and a radical shuffling of the order has lent an air of unpredictability that's been absent in recent years; it's as wild as anything the sport's offered up since Prost, Lauda and Rosberg duked it out in 1982. And who knows - 30 years on and maybe the championship could still be won by an unconventional Finn whose sole win comes at the tail-end of the season. A vintage year for the sport, then, and one that's worthy of a standout tie-in game. F1 2012's foundations are certainly strong enough to help it in its cause: when Codemasters took over the license it delivered, in 2010, one of the finest F1 games for generations. Last year's game was no worse, though it was only marginally better, a handful of extra multiplayer and some small aesthetic tweaks resulting in what felt like a minor update.  Judging from the front-end alone, F1 2012 is a radical departure. Gone is the virtual paddock of the past two HD F1 games, on loan from Dirt and Grid, and in its place is something far more pleasing. A virtual showroom that highlights the cars in all their gleaming glory, the menus are now more Forza than Formula One, though it certainly works. There's a premium feel to F1 2012, one that's befitting of a sport that breakfasts on champagne and caviar. Where F1 2012 takes you first is a departure too, as you're placed directly into one of the young driver tests that have become a part of the sport in recent years. It's a tutorial by another name, albeit an endearingly authentic one - stick around for a few hot laps once you've been told where the stop and go pedals are and what exactly some of those buttons on the wheel do, and you'll be up against the likes of Sam Bird, Alexander Rossi and other real-life F1 hopefuls. As a way of catering for the casuals, it's smart and well integrated.Some of F1 2012's best additions are smaller ones and, in one particular case, cruelly shoved to the side. Anthony Davidson, a driver whose mediocre F1 track record betrays the intelligent, methodical driving style that's held him in good stead as a test driver and in sports cars as well as Sky's analyst, provides animated and insightful guides to each of the 20 tracks. It's the perfect solution to the projected racing line that's become ubiquitous in the racing genre, a feature that I feel is anathema to the simple pleasure of discovering a track on your own. Which makes it a shame that it's all too easy to pass by, quietly tucked away in the front-end and absent when you'd arguably need it most - when sitting daunted trackside at the outset of a practice session.New modes help reinforce the impression that, this year, Codemasters is courting the more casual player. Career Challenge boils down the necessarily long Career mode into a series of short 10-race seasons that handily accelerate your progression up the grid: name a rival driver and you can take their seat if successful in beating them over the course of three races. It's cute, if a little throwaway, much like the accompanying Champions mode that can be seen off in a couple of hours. Here you're pitted against the six titleholders that take to 2012's grid in a succession of challenges. Hold off Lewis on a sodden Interlagos while sporting the wrong set of boots, for example, or hunt down Vettel at Hockenheim while attempting to set the fastest lap of the race. It all culminates in a face-off against all the existing champions at the Circuit of the Americas.A quick word about that Texan track, seeing as it's another of F1 2012's additions. The 3.4 miles that will host this year's US Grand Prix from a particularly odd string of tarmac. With its mirror of Istanbul's turn 8 and straight lifts of Silverstone's Beckett's complex and the stadium section of the Hockenheimring, it does much to replicate the magic and character of existing tracks without, right now, having much of a character of its own - a kind of greatest hits collection being pounded out by a band of unimaginative but well-meaning billionaires. When America offers up so many iconic circuits steeped in history or crafted from the contours of some of the country's most picturesque terrain, it's a shame that F1's pitched its tent here - though the blame lies at Bernie Ecclestone's feet rather than Codemasters' (as it does when it comes to the omission of Istanbul's wonderful circuit). But Codemasters can be blamed for displaying a lack of ambition elsewhere with F1 2012, a problem that'll be felt most strongly by those returning to the series. The core career remains largely untouched - there's an attempt to create some added context with fuller race reports in between events, though it falls flat - and it's still a detached trawl through a number of seasons as you work your way up the grid. It remains a horribly engaging trawl, mind, and one that over the course of a couple of seasons can still provide 20-30 hours of solid entertainment. The on-track action is perhaps at its most refined in F1 2012, though it veers towards being over-familiar. Codemasters continues its well-advised move away from the murky visuals that defined its games a few years back (brilliantly illustrated in this comparison video) and a markedly improved lighting model pours across what can be a very handsome game. There's a distinct character to each of the stop-off points of the world tour - no mean feat given some of the droning autodromes that ubiquitous track architect Hermann Tilke has handed Codemasters - and it's a delight to slow down the action to watch the cars bounding convincingly across the kerbs. There's a premium feel to F1 2012, one that's befitting of a sport that breakfasts on champagne and caviar.Part of that authenticity comes from an improved suspension system that underpins the new handling model, though if anything F1 2012's cars are now defined by their downforce. After last year's tail-happy beasts, there's a modest return to the skittishness of F1 2010's field, and by and large it works. Turning in to a medium or fast bend demands complete faith in the carbon tea trays that keep a modern F1 car glued to the floor. Drive with conviction and it's a rewarding experience, with a certain amount of exhilarating feedback coming when leaving heavily on aerodynamic grip. Now that the cars have been calmed they can be ragged around with a little more consistency - a skill that's the bedrock of any half-decent driver's talent set, and one that allows for an added emphasis on strategy as it's easier to maintain a pace over a set of laps. But for all the pleasure it provides, it's never quite enough to shift F1 2012 away from the sense that this is another minor update, and one that's guilty of making some of the main mistakes of its predecessors while even exaggerating others. The penalty system's been improved for F1 2012 - overtake a driver by cutting a corner and, in theory, you'll be given time to grant the position back, while there's now even the optional inclusion of the pit-line exit rule - but it's as erratic as ever in implementation, while a couple of graphical glitches marred a season's worth of play. Bizarrely - and most painfully for someone who spends much of his life wanting to be Kimi Raikkonen - the ability to take an existing driver through an entire season has now been excised completely. It's another small step forward for the series, but that's not quite enough to dispel the suspicion that Codemasters' F1 team doesn't have the resources to create iterations compelling or different enough to justify the annual churn. F1 2012 is a good game, but it's some way off from being the classic it could be."}