{"ref": "https://www.eurogamer.net/app-of-the-day-final-fantasy-dimensions", "date": "13 Sep 2012", "game_name": "Final Fantasy Dimensions", "text": "Irrespective of your opinion on Square Enix's more recent Final Fantasy efforts, it's impossible to deny the astonishing and far-reaching influence the franchise has had on RPGs in general. The early NES-based outings defined the boundaries of the genre, while the seminal 16-bit instalments of the '90s and the global smash hit that was Final Fantasy VII would propel the brand into the stratosphere. Born out of Hironobu Sakaguchi's anxiety to score a significant hit before jacking in game development altogether, Final Fantasy is arguably the only Japanese RPG to ever gain truly worldwide acceptance.Bearing this in mind, the prospect of playing an entry in this esteemed lineage which not only celebrates past classics but also provides an entirely new story should fill each and every fan with near-uncontrollable excitement, yet Square Enix's announcement of Final Fantasy: Dimensions has been met with an uncharacteristically muted reception. The most obvious reason for this curious reaction is the game's quite monstrous price tag, which makes previous Square Enix iOS releases look like chump change in comparison.Although the game costs nothing to download, you only get to play the prologue for free. After this initial section is complete - it totals about an hour - you're plunged headfirst into in-app purchasing territory. Final Fantasy Dimensions is divided into four chunks, the first of which costs a modest £1.99 and covers around five hours of gameplay. So far, so good. However, the remaining three instalments are weightier and consequently demand more cash: £6.99 a pop, to be precise. Battling your way through the game in sections is advisable, but it's possible to make a small saving by grabbing the entire opus for £19.99 - a purchase that only the most dedicated fan is going to be able to make without their sphincter tightening up like a snare drum.What this eye-watering price gets you is a localised version of the Japan mobile phone title Final Fantasy Legends: Hikari to Yami no Senshi. A collaboration between Matrix Software (who handled the Nintendo DS ports of the third and fourth Final Fantasy titles) and Square Enix, it was originally released in episodes from 2010 through to 2011, and followed in the footsteps of fellow mobile title Final Fantasy IV: The After Years. This iOS incarnation is a beautified version of that game (an Android version is also in the offing), with enhanced visuals and upgraded audio. And, although it's scarcely believable, we westerners are actually getting this new adventure for a drastically reduced retail price - in Japan, it cost around twice as much for all of the different chapters.It may be hard to consign that sky-high download price to the back of your mind, but when judged apart from its monetary value, Final Fantasy: Dimensions is a real joy. It cherry picks all the best elements from the early 2D entries in the series, offering the lush, pixel-heavy designs of Final Fantasy IV and combining them with the stunningly customisable Job system that made its debut in Final Fantasy III. The storyline, while unlikely to land any awards for originality, is grand enough, focusing on two bands of heroes divided by a cataclysmic event which tears their world into two distinct planes of existence: light and dark. Control is batted between these two groups throughout the game, allowing the narrative to expand in different directions.While the hostility being directed towards Final Fantasy: Dimensions' price point is somewhat understandable - after all, there are old-school iOS RPGs which cost less than a quid - it remains a noteworthy entry nonetheless. There's well over 40 hours of quality RPG action on the table here, as well as an experience which compares very favourably indeed with the glory days of the SNES period. As the saying goes, you get what you pay for.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments. For daily app coverage, check out our sister site Modojo."}