{"ref": "https://www.eurogamer.net/app-of-the-day-super-hexagon", "date": "11 Sep 2012", "game_name": "super hexagon", "text": "Terry Cavanagh's a bastard. A lovable, super-talented and quite brilliant man, but a bastard nevertheless. Best known for VVVVVV, the 2010 platformer that latterly made it to Nintendo's 3DS, he's become associated with games with bite, games that present a stark challenge where it's all about beating the game or being plain beaten. Play something like VVVVVV and it's dominate or be dominated. Cavanagh's games are more than just hard, though. They're also incredibly smart, something that's easy to lose sight of when caught up in the warming wash of a pitch-perfect retro aesthetic. Beneath the brightly coloured pixels and the insistent chip-tune music lies a finely tuned design sensibility. In Super Hexagon, the iOS outing that arrived late last week, it's distilled down to an intoxicating essence, a short, sharp swig of action that's as thrilling as it can be trying. You control a small triangle, orbiting a rotating hexagon that's bombarded with waves of lines. Trying to describe it any further is like trying to give a synopsis of a Norman McLaren film, but here goes: what follows is a kaleidoscopic maze of death, played out in harmony to an upbeat and infectious soundtrack from Chipzel. This article contained embedded media which can no longer be displayed.For the first few attempts, you'll be grateful to see beyond the five-second point. Lives are tossed away like confetti, and it takes practice and patience to move forward to the next level, a new one coming as ample reward for staying alive for ten whole seconds. I've also heard that it's possible to stay alive for longer than 30 seconds, but that's a feat that, for now, remains beyond my reach. I'll keep trying, though, as there's something horrendously compelling about getting caught in Super Hexagon's flashing, pounding death-loop, and all the elements that can have ten second bursts of play piling on top of each other until whole hours have passed are in place: the instant restart, the soothing announcer, the crisp digital control and a score system that's so brilliantly pure. Seconds equal leaderboard success in Super Hexagon, pure and simple. Yes it's hard (something made light of in the three different difficulty levels available in Super Hexagon: there's hard, harder and hardest), but it's never frustrating, and unlike many other iOS games this never feels like a time waster. Time spent with Super Hexagon is invariably challenging and rewarding in equal measure, and more importantly every second is made to count. A potential future classic, then, and as far as pure action goes this is as good as it gets. Terry Cavanagh's a bastard, but he's also a bit of a genius. App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments. For daily app coverage, check out our sister site Modojo."}