{"ref": "https://www.eurogamer.net/out-there-somewhere-review", "date": "5 Sep 2012", "game_name": "Out There Somewhere", "text": "Go on, do it. It won't hurt, I promise. Everybody else is doing it. Squeeze the trigger. Shoot yourself!That's the premise of Out There Somewhere. That's the hook, the gimmick, the central mechanic. Plenty of games give you guns. Out There Somewhere gives you a gun that turns you into the bullet. A teleport gun. Focus, take aim, fire!Unbridgeable gap? Shoot yourself across it. Narrow cavern? Shoot yourself through it. Deadly enemy? Shoot yourself behind it. Life's so much easier with a teleport gun. I don't suppose they offer them on the NHS, do they?Gun aside, Out There Somewhere already had me hooked. You're a hot-shot space pilot who's crashlanded on an alien world, and you've found yourself inside a retro-tinged platformer in which each room works as a single puzzle. Forget Mario or Sonic, this is much more like Jet Set Willy or Exile: the tile-sets feel distinctly C64 or BBC Micro-flavoured, the atmosphere is one of, well, surprisingly cute gloom, and each screen even has its own menacing little caption. Mirror mirror on the wall. The Deathtrap. Crumbling Sector. Basement.Each of these screens comes with a simple objective: get from the doorway you came in through to the doorway you want to leave by, and that generally means avoiding lava, dodging wandering monsters, and navigating all kinds of other environmental hurdles with that teleport gun of yours.It should be a game about nothing else but logic, perhaps, and its best puzzles are certainly fiercely logical on their simplest level. Teleportation retains your momentum, however, adding a twitch challenge to proceedings as you shoot, then start a jump, then finish the jump from your new position. That little number offers you access, say, to ledges that you probably wouldn't have been able to reach by aim alone, and it means you have to be quick with your fingers as well as your brain.That teleport jump's just a starter technique, by the way. Pretty soon you're up against a range of pesky laser beams - red blocks your shot, blue stops your shot but still triggers a teleport, green sends your shot moving upwards - all of which force you to think about teleportation differently. Then there are a selection of special blocks - collapsers, reflectors, chunks of ice that let teleport bullets through but nothing else - and, eventually, a new gun that allows you to, you know, just blast away at enemies like you do in normal games.Out There Somewhere isn't a normal game, though: it's a platformer with a devious twist and a truly shocking difficulty curve. It's a platformer with a very late level, for example, that contains absolutely no platforms at all - just empty space and a doorway right near the ceiling. With this weird, atmospheric brainteasing oddity, the Brazilian micro-team Studio MiniBoss has put itself firmly on the indie game map. This is challenging stuff, but it's wonderfully creative with it, and I'm not sure I can recommend it enough."}