{"ref": "https://www.eurogamer.net/rigonauts-review", "date": "3 Sep 2012", "game_name": "Rigonauts: Broadside", "text": "Do you remember Bridge Builder? I've been in love with games about building crazy contraptions ever since I played Bridge Builder. Hours, I would spend, happily piecing together a 2D bridge out of a small number of parts and then letting a train run across it. If the train crossed successfully, I proceeded to a new level. If it plummeted to its doom, I did not. The tension came from, well, actual tension; from watching as the bridge flexed under the weight of the train and hoping the stress on its joints wasn't about to make it all go a bit Cassandra Crossing. I have no idea if Bridge Builder was the first such game, but it was the first one I found, and it left a long-lasting impression.So long-lasting, in fact, that when I stumbled upon Rigonauts while browsing Steam I ended up buying it about eight seconds after looking at a screenshot. It's a variation on a theme, but it's rich with potential: using a limited number of parts, you create a 2D vehicle - on wheels, but built around the hull of a pirate ship, because why not - covered in defensive struts and spokes of stone, wood and bone. You then cover it in weapons and send it into battle against an AI-controlled monstrosity that will generally tower over you, protected by its own elemental armour and extensive arsenal of cannons, machineguns and lasers.This article contained embedded media which can no longer be displayed.You have no active control. You just watch and wait as a nest of bullet and cannonball trails forms in the sky between your hulking, ridiculous vehicles, and sit there hoping that the regular impact of mortars or laser fire on your baby is sufficiently offset by your informed selection of building material - at least for as long as it takes your offensive weapons to unpick the enemy. You can observe the enemy vehicle before you set each level in motion, so you can make fairly informed decisions about strengths and weaknesses and what to build with, and you can also attach targeting instructions to the enemy craft beforehand - an ordered to-do list for your weapons, in effect - but that's it. Otherwise, it's all tension.Well, in theory it's all tension, but in practice it's not tension at all; it's a mixture of keen observation and slapstick hilarity. The first dozen or so levels are spent learning the ins and outs, but after that your enemies grow in size and ridiculousness, and it's rare not to encounter a giant rolling skull made out of wood or to be flanked from behind by an alligator-shaped battering ram made of bones. As the ground beneath your wheels goes from flat plains to lumpy hills and bouncy bridges, basic physics asserts itself as well, and your carefully constructed wall of stone defences may suddenly topple headfirst and expose its tender underbelly to a mass of cannon fire.Far from a hindrance, this is one of the most entertaining parts of the game. If every enemy were just a giant combination-lock waiting to be picked, with flame units targeting wood and cannon balls raining on bone until it's broken to pieces, it would be an interesting exercise for a little while but then you'd lose interest. I would, anyway. But the fact that you can trundle merrily into battle and end up besting your enemy by accidentally doing a forward-roll into its axles, before inadvertently cleaving off its ranks of front-facing laser-gunners as you rock back and forth like a beached sea turtle, is what gives the game a personality.As I've been reviewing it, I've been calling people over to my monitor so they can witness my latest battle plan in action and revel in my ludicrous success or comical failure. People have made suggestions about how to better my designs - it's a great game for casual collaboration - and you do end up going back and trying levels again to see if you can use fewer parts or come up with more outlandish strategies to get three-star scores. Both things are always a good sign.All the same, there are a few things that count against Rigonauts, and they may prove too much for you to bear. The first is the fact that this isn't really a PC game - it's very clearly been designed for touch controls on an iPad or Android tablet (the website suggests those versions are incoming), and while it's perfectly playable with mouse controls, it doesn't feel like a proper PC game. There's no proper full-screen mode, you can't customise any of the settings, you can't save off vehicle designs, the level-select interface is terrible, and the whole vehicle-building interface (which seemed a little buggy to me, too) is clunkier than anyone would like. The whole game is about building vehicles, so this is an area developer Engient should have made sure they nailed.The second big thing, which already seems to be putting a lot of people off judging by the dearth of posts on the game's Steam forum (and the fact that two out of four are about this issue), is that at £6.99 it isn't really priced well for either its PC or future handheld market.It offers a goodly number of levels, but it feels too much like - and clearly wants to be - a 99-cent App Store game. I don't really like talking about the cost of games in reviews, because it's often assumed to have a striking impact on scoring (or not enough of one), and readers are smart enough to know if what I'm describing sounds like it matches the price tag. But in this age of free weekends, flash sales and alpha distribution models, flexible pricing is getting harder to ignore. Rigonauts makes it harder than most.Then again, if you do have a spare seven quid in your virtual wallet, and you can look past some interface shortcomings, this is a fine game in a wonderful niche genre. It doesn't have the best execution and it probably costs too much, but there ought to be room in everyone's life for at least one slapstick physics puzzler, and if you're in the right mood then perhaps Rigonauts can be your Bridge Builder."}