{"ref": "https://www.eurogamer.net/app-of-the-day-human-defense", "date": "30 Aug 2012", "game_name": "Human Defense", "text": "Being a morbid and even a maudlin sort, I'm right up for games set deep within the human body. I want to race nano-bots through bustling arteries, grapple-jump across sparking synapses, and score complex multipliers deep inside the medulla oblongata. The body has great brand awareness, really: surely somebody wants to make the most of that?Long story short: Human Defense, is a tower defence offering that sees you protecting vital organs from the onslaught of viral menace by laying down turrets, controlling the flow of vital nutrients, and keeping all manner of horrible creeps away from the likes of your lungs, heart, and muscle tissue.It's a grim kind of notion, perhaps, but it's delivered with bright colours and some chunky, rather slippery visuals. Behind the nice initial conceit lurks a surprisingly smart tactical experience, too, and one that brings a handful of semi-original wrinkles to the tower defence genre.For starters, if you fail to kill all the creeps on their first pass, they'll circle back around and have another go at you, building up their immunity as they go. Eventually they'll start to get stronger, and they'll also take a more direct root to the organ you're meant to be protecting. On top of that, the nutrients you use to build your towers are also needed to keep the body's energy levels up, so you'll need to manage their flow when they slip through each level in between enemy waves. You'll need to switch gates back and forth, basically, channelling them to build turrets one minute and keep the home fires burning the next, and since nutrients don't recirculate through the body, you'll want to get the timings right, too. I struggled to handle this a lot of the time, frankly. My standard move is to divert all my precious resources right off the bottom of the map while simultaneously clearing a direct path to my vital parts for any nearby viruses to use. Not ideal.If I were an actual doctor, here's the part where I'd probably suck air in through my teeth and tell you that there are a few complications. I'd also probably charge you 100 notes for a full consultation, even though we were only having an informal chat, and then I'd think about buying another Porsche. Sorry, carried away there: the problem is that Human Defense has a few annoying little elements that could hold it back from true greatness.The first is that its limited selection of turrets can be rather hard to differentiate at first, as can its massed ranks of pathogens, particularly if you're playing on the smaller screen of an iPhone, and that means that the game's at its most confusing when it's busy introducing all of its neat ideas. The second is that each level start screen wants to gouge you for IAPs that will make things a bit easier. This is a challenging game, and that's generally a good thing. When you're constantly being bombarded with requests for money, though, it's hard not to suspect that the difficulty has been artificially inflated at times.It matters very little in the long run, though: in all of the important ways this is a clever, focused, and wonderfully tense twist on a very busy genre. Channel your inner Tuck Pendleton (Google it) and get stuck in.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments. For daily app coverage, check out our sister site Modojo."}