{"ref": "https://www.eurogamer.net/new-super-mario-bros-2-review", "date": "13 Aug 2012", "game_name": "New Super Mario Bros. 2", "text": "It's common practice among game publishers to churn out yearly entries in a popular series, employing one of their most talented studios to buff its critical reputation to a shine every two years and then recruiting a B team to fill in the gaps by copying from a game design cheat-sheet. Infinity Ward and Treyarch. Criterion and Black Box. Ubisoft Montreal and Ubisoft Montreal.The shocking thing isn't that Nintendo's Super Mario series - once the byword for creativity, a sacred cow of game design that could reliably be expected to change everything, every time - has become one of those factory-made annual franchises. It's that the developers working under Shigeru Miyamoto at the company's Kyoto headquarters - the team that made this latest outing on 3DS -  is now the reserve squad.In the late 2000s, Mario moved house. It was a different outfit, led by Yoshiaki Koizumi and Koichi Hayashida and based in Tokyo, that created the cosmically dizzying Super Mario Galaxy games for Wii. By the end of the sequel, they were exploring the farthest reaches of the platform game in a ceaseless parade of surreal spatial ideas. In last year's Super Mario 3D Land, they achieved a perfect synthesis of the taut traditions of the 2D 'Bros.' games with the freewheeling invention of the Super Mario 64 line, and created the best portable Mario game ever. Mario never looked back.Except he'd left a copy of himself behind in Kyoto, and looking back is all this Mario does. He hops and bops through retreads and remixes of his 2D heyday to a recognisable, jaunty tune, occasionally flashing a gimmick to earn the disingenuous prefix of the game's title - but it's Tokyo's Mario that's really new. Like its predecessors on DS and Wii, and surely like the Wii U version that will appear in a few months' time, New Super Mario Bros. 2 is an old dog doing old tricks.What tricks, though. New Super Mario Bros. 2 still adheres to the flawless standards of craftsmanship you expect from a mainline Nintendo release, from the supple inertia of those second-nature controls to the musical pops and tinkles of the audio feedback. And while it is formulaic, the formula it's drawing from is complex and rich; over the years, it's been embellished with dozens upon dozens of elements and variables that play off each other in unexpected and delightful ways.So much so that you don't need to be a master designer to construct brilliant levels with it. (Indeed, this game had its genesis in a ~Mario Cram School~ during which the great Takashi Tezuka taught employees from across Nintendo's software divisions how to build a 2D Mario level.) New Super Mario Bros. 2's short levels are dense with tempting challenges, secret surprises and hidden exits, and, though they often quote previous games, they seldom repeat themselves.You'll likely race through to the end of the game in short order - it's charitably described as compact, and noticeably easier than New Super Mario Bros. Wii, too. But you'll legitimately spend a great deal longer ferreting out all the star coins and unlocking secret levels and a handful of secret worlds, and probably enjoying yourself more while you're at it. You may never find out what it is that unlocks the mysterious rainbow courses (I had to look it up, even after finding one), or what happens if you collect a million coins.As indicated by that large lifetime coin total on the map screen, coin-collection is this game's defining gimmick. Super Mario's iconic treasure has never been so central to the game or in such plentiful supply, gushing out of pipes and filling screens with fields of tinkling, twinkling cash to collect.It's a gold rush to make Team GB blush, taken further by a few excellent new power-ups: a golden flower lets Mario unleash Midas missiles that blow enemies and scenery up in showers of coins; golden rings multiply enemies' coin value and cause Koopa shells to leave trails of coins; and Mario can wear a golden coin block on his head, sprouting a stream of money that flows more quickly the faster you run and higher you jump. The latter's particularly well judged, as it counters the slow and painstaking play that all this money-grabbing can encourage by putting the emphasis back on that good old Mario momentum.Not for nothing is this game known as Super Mario Coingasm around the Eurogamer office. But what's it all in aid of? It seems to be an attempt to revive the idea of Super Mario as a pure score-attack game, and it's only partially successful.Engaging in the coin-collection mechanics is fun in itself, but offers indistinct rewards. The game tracks your best coin total for each level, but doesn't compare these online or through StreetPass with friends' totals the way 3D Land does with completion times. (Competitive Super Mario play has revolved around speed-runs rather than high scores for years now, and the score readout in the games seems rather vestigial - even more so in this game, with its new metric for success.)Perhaps this puzzling decision was to ensure the proper emphasis is placed on Coin Rush mode. This is a tough, terse challenge that gives you one life to complete three random levels, collecting as many coins as you can. Your coin score can then be posted as a challenge, which shares it with friends and strangers via StreetPass (though not online, sadly). It's a great mode, balancing skill against knowledge of the levels, with randomisation adding just the right amount of luck. But it's a shame coin-collection couldn't have been made more meaningful in the main game.This isn't normally a problem for Super Mario games, which have tended to introduce game mechanics for their own sake, rather than as part of some superstructure of player engagement. In the Mushroom Kingdom, fun is its own reward system - and hoovering up coins, spurred on by the wit of the level design and a giddy head-rush of Pavlovian gratification, is certainly fun.But the problem is that it's not one of a dozen such new ideas in New Super Mario Bros. 2. It stands alone, exposed, and as such starts to look like a gaudy distraction from the sad truth: with this series, Nintendo is overworking one of the all-time great game designs to the extent that it's starting to wear thin. This is a high-quality game by anyone's standards, but that doesn't change the fact that I spent a good deal of my time playing it feeling blasphemously bored.Fortunately, the true Mario tradition is in safe hands in Tokyo, no doubt to return and restore our faith in some mind-bending new adventure next year. But perhaps New Super Mario Bros. should be allowed to grow old a bit more gracefully than this."}