{"ref": "https://www.eurogamer.net/fighting-fantasy-blood-of-the-zombies-review", "date": "9 Aug 2012", "game_name": "Reviews", "text": "Fighting Fantasy: Blood of the Zombies by Ian Livingstone; Icon Books, paperbackI sat at my desk, picked up my d6 and rolled a new character. Then I wrote down my starting stamina on the Adventure Sheet in the back of the book. 21. Not bad, really, but look at that: blue ink. I'd used a biro. Rookie mistake.When filling out an Adventure Sheet, you always use a pencil. I remember saying those very words to my younger sister several decades ago, possibly slamming a desk ineffectually as I spoke (we'd been watching a lot of Dallas). Sometimes, you use a separate piece of paper, actually, so that you don't spoil the book itself for posterity. Sometimes, you ask a parent to photocopy the sheets and then you're really off to the races.Anyway, my excuse for the whole biro business is that it's been quite a long time since I've done this sort of thing. It's been seven years since the last Fighting Fantasy novel, apparently, and at least - cripes - 22 since I used to play them with any regularity. If you don't know what I'm talking about, Fighting Fantasy is a series of gamebooks where YOU are the hero, making choices at the end of each paragraph, battling deadly creatures and moving back and forth through the text as you head off on your adventure. 22 years ago, my friends and I used to gather in WHSmiths after school where the green spines lurked, their names beckoning us towards blood-soaked - and moderately priced - adventure. Deathtrap Dungeon, City of Thieves, Howl of the Werewolf! We were pulled in by the promise of dice to roll and castles to loot, stats to calculate, and unspeakable things to hit with imaginary clubs.The whole set-up's aged pretty well, if you ask me. To mark the series' 30th anniversary - and to prove there's more to the man than running the UK games industry and talking about tax breaks - original author Ian Livingstone has written an all-new Fighting Fantasy novel called Blood of the Zombies. And I've spent the last few days playing it - glued to the adventure, using the virtual dice at the bottom of the pages when my own have rolled down the back of the sofa or been eaten by the cat (she's fine now) and, you know, spoiling the adventure sheets with sodding biro. I've walked miles of creepy hallways, I've peeked into a wide selection of dusty crates, and I've killed an awful lot of zombies. Hundreds.Yep: zombies. Their presence is only fitting, really. While the basics may remain the same, a couple of things mark this out as a Fighting Fantasy for a new generation. It's filled with the omnipresent green bodies of the rambling undead, for starters, and it's been gently streamlined with no Luck or Skill to worry about from the off. It's set in the real world, too, and in the modern age, which was rarely the scenario of choice back in the day. Don't worry, though: you still spend most of your time trapped inside a warrenous medieval castle.The set-up's lovely: brisk, light-handed and quietly melancholic. You're a mythology student at Bolingbroke College and you've spent a summer holiday travelling in Europe trying to find evidence of legendary beasts. For weeks on end, though, you haven't found zip: the monsters are all gone, and perhaps they were never really there in the first place. For a few pages, you wonder if the series hasn't grown up with its audience a little too much: is this going to be an adventure culled entirely from adult concerns? Turn to 189 to buy indemnity insurance; turn to 54 to ask the doctor about a CAT scan.Never fear. By the time the game's really moving along, you're chained up in the basement of Goraya Castle, being fed disgusting soup by a man named Otto. His master is Gingrich Yurr and he's a psychopath set on raising an undead army to take over the world. NOW TURN OVER.After that, it's action and exploration from start to finish, and I was in 11-year-old nerd heaven. Each paragraph ends in a pithy choice; the text itself is full of violence, suffering and the acquisition of handy things like torches, string, and small bronze keys with numbers on them; and the zombies lurk around every corner, itching to do you in.The fights are pretty much as you remember them, but the stage management is a little different. Zombies move in packs here, and they almost always have just a single stamina point each. That means you roll your dice, add on - or deduct - the impact of your weapon, and see how many you've taken out in one go. All the survivors then hit you for one point of stamina each in return, and the whole thing starts over again. Two zombies, five zombies - by the end of the game, you'll be fighting groups of 20. Fighting 20 zombies with 1 stamina each is no different, of course, from fighting a single werewolf with 20 stamina, but it feels more exciting and chaotic when you imagine it, and it means that the kills start to rack up really quickly. You're encouraged to keep a running tally as you go, and on my first - deeply unsuccessful - play-through I still managed to take out over 100 of the horrible things before expiring somewhere in the basement. On my second attempt I found the shotgun (1d6+5) and the chainsaw (2d6+3), and I got even more of them. I won't even tell you about the Browning.As a novel, this is a strange beast, of course. Paragraphs can last uninterrupted for a page or two (suggesting that, at the very least, Livingstone is keeping the spirit of Woolf alive), characters get their exposition out of the way quickly and then tend to keel over seconds later, and most of the plot sees you walking through corridors, picking a direction at each turning and then scavenging for loot whenever you find a box or a crate.As a game, though, it's surprisingly swift and exciting, with the hectic, minute-to-minute battling and health management beats of Left 4 Dead, and a real sense of the old-school RPG as you keep neat lists of the things you've collected and maybe draw a map as you go. It's not an easy game if you're going to successfully stop Gingrich Yurr from triggering the apocalypse, but it's filled with clever elements: keys, pas scodes and phone numbers that unlock specific paragraphs, cameos that include Charlie Higson and Tom Watson (he was dead when I found him, honest), references to Lara Croft and The Warlock of Firetop Mountain, and eleventh-hour jokes about valley girls and Pokémon. The text is smart and quietly witty, the choices still make you weigh up your options (and cheat, of course) and the wonderful art, by Kevin Crossley and Greg Staples, hits just the right notes, invoking the lurid horror of old video nasty covers.One thing really has changed, though, and I'm not sure I like it at all. To buy Blood of the Zombies, I ventured back to WHSmiths, which now sells pick-and-mix and stamps as well as cigarettes and Lego sets. What it doesn't sell - at least in Brighton - is Blood of the Zombies. Neither did Waterstones, despite an entire floor of kids' novels, most of which hinge on what it's like to get with a vampire or go to boarding school with wizards. I had to get it from Amazon.The green spines of Fighting Fantasy might belong to another era, perhaps - which is a shame when the books themselves can still be this much fun to play. Who knows, though. Maybe the shops had already sold out. Maybe it's just the high street dying off. Maybe Blood of the Zombies will be a massive hit when the iOS and Android app version is launched at the end of this month.Maybe I should just re-roll a character and go kill some more monsters."}