{"ref": "https://www.eurogamer.net/apb-reloaded-review", "date": "7 Aug 2012", "game_name": "APB Reloaded", "text": "A deserted storage facility on the cheap side of town. The sun beams down high above it, rendering everything in the colours of affordable breakfast cereal. Welcome to San Paro, the city of 2010's MMO shooter APB and, today, free-to-play MMO shooter APB Reloaded.All is silent.Suddenly, a rally car covered in Monster energy drink logos comes flying off the nearby overpass. It crashes into the courtyard of the storage facility, brakes, and a man steps out with the ease of somebody who's just completed a parallel park. He's wearing bright green trousers, a blue shirt and a red cap - colourblind couture. This man is a District Commander of the San Paro police force.Another car arrives, this one curling into the area via a handbrake turn that sideswipes the facility's gates, keeps going, and promptly pancakes the District Commander between both cars. My character steps out. He is a squat, bald Mexican called Jorge who wears ill-fitting jeans and no shoes. He leans fatly over a submachine gun and has two grenades in his pockets.We are San Paro's finest, and we are here to do Police Work.So APB (short for all-points bulletin) is back. For the last two years, a handful of scrappy survivors from original developer Realtime Worlds have continued to attempt to realise the game's potential, culminating in the launch of APB Reloaded late last year: an ~improved~ cops'n'robbers MMO with a modern, free-to-play business model.Which is actually the reason for my overblown intro up there. Now APB's gone free, there's nothing stopping you from having a quick explore just to experience how surreal it is. Cops with no regard for civilian safety, criminals with a work ethic, everybody using cars as disposable battering rams and stepladders. Which is to say nothing of the madness of APB's embedded community: criminals in their underwear firing assault rifles at cops in day-glo pyjamas - with everyone hearing grotty squirts of inexpertly assembled techo tracks whenever they're killed, because players can create their own theme songs.Back in the storage facility, my District Commander friend leaps heroically from between our two cars to walk over to a door, which he takes four photographs of. Our police work for the afternoon completed, we get back in our cars and peel out, and I skim-read the briefing for the next step of the mission that just appeared in the upper right corner of my screen. Pertinent bits are highlighted. Something something gangs something bad something raid something.I will complete this raid, and I will do it for the people of San Paro. It is my duty and destiny. I'm distracted from my reading by a pedestrian screaming and bouncing over the hood of my roadster. An awful tragedy! Why, when I catch the criminals that made me do this, I'll make them pay. I'm distracted from my daydream as I crush a fire hydrant, whereupon I decide to drive on the road instead.Arriving at the raid location, I step out of the car and promptly die in a hail of unexpected gunfire. A disgusting, musically illiterate cover of the Simpsons theme comes parping out of my headphones, the theme of the player who killed me. As I respawn and begin jogging back to the raid, I consider quitting the mission. On the one hand, I took an oath to protect and serve. On the other, that theme is like somebody farting in your ear, and I know I'm going to get killed again, because that guy was good.The concept behind APB is almost certainly genius. You pick your faction, either Enforcers or Criminals, and spawn in one of two medium-sized city districts with a few dozen other players. The game then auto-generates a mission for you, banding you together with other cops and robbers in a fast and loose fashion.Either the cops or robbers will take the lead (investigate this and confiscate this, or rig this and steal this), and the other team has to stop them. That's almost the whole game. There are also whimsical ideas about criminals being able to commit crimes of their own choosing (stealing cars, say) and cops being able to ~witness~ them (using the Alt key), but this is as unfulfilled a feature as cops technically being allowed perform nonlethal arrests. In practice, it's missions and guns. Neither of which are very good.I never played APB when it was originally released, so I'm taking it on faith when Reloaded's developers say they've improved the ~meatiness~ of the guns, the car handling, the progression structure and more besides. I definitely unlocked clothes and guns at a fair clip, and had a decent time commandeering even the most whiskey-wrinkled pick-up trucks.But as Rob Fahey pointed out in his original Eurogamer review, the problems with the combat run deeper than this. Because the game gives you no options for evasive moves or taking cover, and the grenades are quite limp and there's no melee combat, combat mostly comes down to who gets the first shot. It's all about positioning. Which is to say, more often than not, camping. So defending an objective is fun, but assaulting one is often Takeshi's Castle with bullets. You pick an angle, charge forward and promptly fall over, to the amusement of all.APB's matchmaking makes this imbalance even more riotous. Your team could consist of Russian APB fanatics whose gold-plated rifles speak of disturbing dedication, or police who never show up at the crime scenes at all. Which, if The Wire is to be believed, is accurate, but not necessarily fun.Reasons to play APB Reloaded other than its oddly coherent strangeness (when I saw the idle characters stood on every single lamp post in the Pleasure District, I just grinned) come down to character development. A wealth of guns, mods, cars and clothes all unlock steadily as you play, and for those with the patience to fumble through APB's clunky menus and APB Reloaded's jury-rigged and confusing re-implementations, you'll find a greater depth of customisation than in any other online shooter. Which is exactly why the player-base is so strange. Given the opportunity to make their characters look like anything, people make a mess.This is as good a point as any to confess to a strange form of journalistic bias. I was actually reviewing Reloaded off a retail boxed copy, which includes a £15 ~permanent~ Magnum (guns are usually rented for the month), my absurd £6 roadster, 30 days of Premium time, worth £7, and a weapon of my choice. So while I can confirm that APB Reloaded isn't entirely pay-to-win - because I paid and proceeded to get taken apart for hour after hour like a jigsaw puzzle - I also had the privilege of a slight edge in firepower over any noobs. Which was fun for me, but probably wouldn't be for you if you got stuck in today.But my premium benefits were more curious still. I didn't see any ads, which apparently appear in your briefing box after every mission, my unlocks were sped up by 90% and my in-game cash earnings boosted by 125%. So while my free-to-play safari saw me eating burgers in an air-conditioned Land Rover, you should take it as a bad sign that I had almost no fun. For a game that can be broken down into missions and shooting (sadly, that mission structure means car chases are impossibly rare), the missions are repetitive and the shooting is weak.In improving the game, I suspect all GamersFirst have managed to do is keep pace with people's improving expectations. If they'd made their tweaks in six months, this might have been a plausible piece of work. But it's been more than two years since APB's original release, and that's a long time in video games.But as I say, I had almost no fun. Fun did occur, especially during my first three hours coasting through the game's content. I saw all the missions for the first time and the city's better bits, including a series of incomplete highways covered in ramps. I browsed the surprising and extensive music collection and let team-mates ride along in my car, playing a starring role in my barefoot Mexican's movie, which I imagined would be called 2 Fat 2 Furious.For a short while, the game managed to make me forget that APB was always a cruel joke. Originally pitched as GTA plus multiplayer, it emerged two long years after GTA4 had arrived - with not just multiplayer, but ingenious, robust multiplayer. Now, two years later still, APB Reloaded is working with GTA5 on the horizon. It's absurd.But as I said above, the absurdity is the best reason to give APB Reloaded a shot. This isn't a great game, it's not even a good game, but it is the closest thing we've got to a cops-and-robbers MMO - which is, I suspect, one of the all-time great video game concepts. One day, somebody's going to do it right, and they're going to become very rich indeed."}