{"ref": "https://www.eurogamer.net/orcs-must-die-2-review", "date": "27 Jul 2012", "game_name": "Orcs Must Die! 2", "text": "Even in an industry besotted with annual updates, indie studio Robot Entertainment has turned this sequel around with unusual haste. Orcs Must Die! only came out last October, and here's the PC-exclusive follow-up already. As you might expect with such a rapid turnaround, there are times when this feels more like Orcs Must Die 1.5.That's not necessarily a bad thing, since the first game came within a hair's breadth of greatness and really only needed a few tweaks to elevate it to something very special. Those tweaks have mostly been made, and although some of the frustrations remain, there's little doubt this is a more streamlined and rewarding riff on the same idea.To begin with, however, expect serious déjà vu. The music is the same. Most of the irritating quips are the same. The core enemy types are the same, as are the traps that will form the basis of your arsenal against the invading hordes of orcs. As before, preventing this grisly mob from reaching the magical rift is your first and only goal. Lacing the corridors and courtyards that lead there with an array of cruel snares, and picking off the survivors with ranged and melee weapons, is how you get the job done.What was fun in 2011 remains fun today, of course. Orcs Must Die is a game with an innate understanding of feedback and reward, and even after 20 levels of orc-mincing action, the sheer joy of watching an unwitting rabble walk right into a gauntlet of arrows, spikes and trapdoors, pulverising them in seconds, does not fade. From the cartoonishly gory slaughter to the glib humour, it's very much the heir apparent to Bullfrog's classic Dungeon Keeper.The new stuff, then. This is a sequel that embellishes the old rather than sweeping it away, so once you get through the familiar early stages you'll start to encounter fresh enemy types as well as earning new traps. Creatures like Earth Elementals force a subtle change in strategy, as these mossy hulks break down into ever-smaller versions of themselves, giving them a longevity that can cause real problems if they get close to the rift. Bile Bats, meanwhile, require you to keep one eye on the skies, and many a level can be lost by the unwary player who fails to notice the swarm of these nasty little critters sailing past overhead.The game at least does a good job of letting you know when a distinct threat enters the arena. You'll get vocal warnings about sappers - vicious little goblin suicide bombers - and fliers, while the larger trolls and ogres announce themselves with booming footsteps and blood-curdling war cries.The new traps are less noticeable, unlocking further into the game at a point where you'll already have upgraded the reliable standbys of arrow wall and floor spikes into a pretty much unbeatable obstacle. Freezing orcs, shunting them off bridges and impaling them on yet more spikes may be fun from a visual standpoint, but this is still a game where you can get through most of the levels with judicious use of the most basic tools.~From the cartoonishly gory slaughter to the glib humour, it's very much the heir apparent to Bullfrog's classic Dungeon Keeper.~The spellbook section of the game has received the biggest and most beneficial overhaul, adding sections for stat-buffing trinkets and cosmetic ~vanity~ costumes while also enhancing the upgrade system into something more robust. Traps now have multiple tiers of improvements, ranging from simple stacking boosts to damage or reset time, to unique abilities such as bleeding damage. Certain items also gain special unlocks, such as the ability to place arrow walls in the ceiling, all the better to create the perfect killing box. The skulls required for these upgrades are more frequently dished out, not only for completing levels but as random loot drops in the field. You can also dip into the Endless survival mode for a skull boost, as those matches can really rack up the rewards.Features that felt perfunctory in the first game have now been fleshed out, and progression through the 15 levels (compared to the original's more generous 20-plus) has a more compelling momentum as a result. There's more room to customise your traps and weapons to suit your play-style, though this tug towards experimentation is sometimes at odds with the game's rollercoaster difficulty.This was a problem with the first game as well, and it's a shame to see it recur in a sequel that improves in so many areas. One level may be strangely easy, the next brutally difficult. The game's real-time approach to strategy, offering only a few seconds to regroup and place new traps between most rounds, means that there's little incentive to try new things. When you've got 10 seconds before the next wave of monsters comes thundering towards you from multiple directions, the temptation is to stick with what works. The easy ~Apprentice~ mode is a walkover, but the normal ~War Mage~ mode quickly becomes an overwhelming slog where you'll cry out for help.Which brings us, belatedly, to co-op play. This is really the key feature of Orcs Must Die 2, the thing that was most clearly absent from the first game, and presumably the real reason this has appeared as a full sequel rather than an update.With two players, many of the game's more curious wrinkles are smoothed out. With someone else to watch your flank, there's more room to try different things without fear of being overwhelmed. Indeed, many of the later maps seem expressly designed for two players, with two clearly delineated entry points and identical waves entering through each. Get a friend to tackle one while you concentrate on the other and the game finds a more agreeable flow.Try tackling these stages solo on anything above Apprentice difficulty and you tend to get creamed. By the time you've finished off the Fire Troll from one direction, the one approaching from the other side is on top of you with full health. In these later moments, it feels a lot like a two-player game that can be played solo, rather than a game that has an optional co-op mode.Such plate-spinning frustrations are part and parcel of the tower defence playbook, however, and the panicked thrill of being outnumbered is a huge part of why the genre endures. It's in the myriad ways you can decimate your attackers that the game's appeal lies, and the improvements made here have only made that pleasure more intense. While Orcs Must Die 2 still has balancing issues, they're more than outweighed by the sheer pleasure of the minute-by-minute gameplay, where calculated carnage is its own reward."}