{"ref": "https://www.eurogamer.net/wreckateer-review", "date": "23 Jul 2012", "game_name": "Wreckateer", "text": "We're not supposed to like Wreckateer. It's not for us, assaulting the sidelined Xbox 360 hardcore gamer from three directions. One: it's a Kinect game, the motion-control kryptonite that saps the will to live from any joypad-loving gamer. Two: it's unoriginal, a blatant Angry Birds rip-off. Three: it's casual, a knock-'em-down game surely designed to keep kids giggling rather than offer any real challenge.That's the script according to the internet commentariat, anyway. In reality... well, let's take each accusation in turn.Yes, it's a Kinect game. Thankfully, it's a good Kinect game. The controls are well thought out and, more to the point, responsive and accurate. Those are two words we don't often get to use where Kinect is concerned, so Chicago developer Iron Galaxy Studios is already ahead of the pack on technical merit.The set-up is simple. You're a new member of a Wreckateer crew in a generic medieval fantasy land. Taking control of a ballista, you must demolish a series of castles and structures that have become infested with goblins. Step forward and clasp your hands to grab the loaded projectile, step back to pull it taut and determine the strength then throw your hands apart to let fly. Stepping left and right rotates your aim, while moving your arms up and down changes the angle.Those are the basics, but there's more. You can add aftertouch by wafting your hands ~through~ the ball, and for some tricky shots later in the game this is a skill you'll really have to hone. With practice, it's possible to pull off some serious curveballs. Each shot type also has a special ability, activated by raising both hands at the same time.Bomb Shots detonate, as you'd expect. Speed Shots scream off in a straight line. Split Shots separate into four smaller projectiles, which will stay between your hands as they fly. By squeezing, rotating or stretching the line, you can cause a lot of mayhem. Lift Shots, meanwhile, can be activated three times, gaining a small height boost each time. Best of all is the Flying Shot, which deploys wings and a little motor and can then be flown around the level, discovering new scoring paths.It's simple, intuitive and - my goodness - it actually works. It never gets confused between movements and, much like the excellent golf section of Kinect Sports Season 2, you can actually see the game reacting to the smallest adjustments before you fire. Placing a shot right where you want it to go isn't a problem.Space, however, is. This is a game that requires a lot of lateral movement, so unless you've got a large lounge, you may struggle to hit anything to either side of the play area.That's a problem external to the game though, and given how horrendous a bad Kinect game can be, Wreckateer sadly stands out from the herd just by working as it should. The technology disappears and you simply interact. Any failures are down to your skill or strategy, not shonky recognition. Just how motion control should be. Accusation two, then. It's unoriginal. There's no real defence for this, since the game barely bothers to mask its debt to Rovio's touchscreen titan - nor to the likes of Crush the Castle or the recent Catapult King. For better or worse, this is now a burgeoning sub-genre and Wreckateer isn't about to rock the bandwagon. The fact that the goblins you're trying to evict are short, fat and green with piggy faces is perhaps the most blatant act of 'homage' on display.Everything you'd expect is here, and Wreckateer's biggest weakness is that it never really tries to shake up the formula. You smash, you destroy and you keep doing that. The levels get trickier, but with that comes a narrowing of horizons. In the early stages, it's easy enough to grab a bronze medal, so you're free to experiment. Once you pass the halfway mark in the campaign, progress comes from hitting precise combinations of icons and power-ups with the right shots. It's easy to hit a brick wall, struggling to hit minimum score targets in the hundreds of thousands, because you can't get one specific shot.Once that brick wall looms, the game grinds to a halt. A crude, offline, turn-based two-player competitive mode is as close as it comes to offering any other ways to play. But for those who can tolerate the repetition and difficulty spikes later on, there's more going on underneath the knockabout silliness. Which brings us to our third accusation: it's casual.Of course it is. This is a big, bright game where you knock stuff down. A child can play it and have a laugh. Your mum could play it. Getting past the early stages is simply a matter of hitting as much stuff as hard as you can, and there's no denying that it's fun.The scoring system itself is rather clever as well. Unlike Angry Birds, the aim here isn't to kill every goblin (though every three goblins killed earns you a Mulligan - the chance to retake the previous shot). The aim is to earn enough points to move on to the next stage. The more damage you do, the higher your score multiplier goes. However, the really high scores tend to involve hitting tricky icons and perhaps not doing much damage to the castle itself.There's genuine strategic tension between the need to get that multiplier up at the start of each level and using the right shot type to maximise your score. The game acknowledges this and shows a breakdown of your score against the AI's best, shot by shot, so you can see where you're missing points.Almost immediately, however, extra depths reveal themselves. There are multiple floating icons to hit, offering points or adding speed or explosive impact to whatever projectile passes through them. Once they hit, even more bonuses burst forth like a fruit machine jackpot. Bounce a shot of the ground? Bonus! Hit a goblin in the face? Bonus! Get lucky and earn a few more points long after everything else has stopped falling? Yep, there's a bonus for that too. Every impact is a cacophony of thrilling sensory feedback, only slightly marred by a lumpen physics model that means large chunks of masonry vanish into thin air.With its cathartic pinball clatter of destruction, jubilant explosions and bonuses galore, Wreckateer actually reminded me most of Burnout's classic Crash Mode, and that's not a comparison I make lightly.There's a rich, deep, accessible and fun score-attack game lurking not far beneath Wreckateer's rubble, but it never fully reveals itself. There's certainly more here than you'd expect given its opportunistic appearance, but there are also pacing and balancing issues that only come into focus towards the end of the repetitive campaign. Wreckateer is a lot better than you probably think it is, but it still falls short of the bullseye."}