{"ref": "https://www.eurogamer.net/wipeout-hd-fury-vita-review", "date": "21 Jul 2012", "game_name": "WipEout HD: Fury", "text": "Studio Liverpool's had a history of generosity, whether that's in how it managed to hand over 1080p 60fps racing at a cut-down price with the original WipEout HD or how it followed up that incredible game with a full-blown sequel in little over six months. The developer's spell on the Vita is displaying a similar spirit, although admittedly the foundations aren't quite as strong this time round. WipEout 2048 was always going to be a technical showcase for Sony's new handheld at the time of its birth, and the prequel of sorts to the long-running futuristic series certainly ticked that box well enough, hurling no small amount of colourful chaos onto that glorious OLED screen. Lost in the noise, though, was some of the purity of purpose that had always marked out WipEout as a racer of class and distinction, the newfound focus on combat making for a game that some - myself included - felt fell some way short of the excellence for which WipEout is renowned. The near-future aesthetic was a welcome rethink, but some of the resultant tracks were left feeling cluttered and cumbersome, while an eager fistful of on-track visual effects only added to the confusion. Technically it showed what the Vita was capable of, but the heady heights that WipEout's racing is capable of weren't quite prevalent enough. So for anyone left pining for a more traditional WipEout fix on the Vita, this is a perfect solution, with each and every event from the PlayStation 3's HD and Fury moving across to the handheld. The port is as immaculate as you could hope for, and it's faithful enough to make the Vita version of WipEout arguably the most comprehensive installment of the series to date. There's some handheld heritage in both HD and Fury, of course, with the bulk of the tracks as well as a fair few of the game modes coming from WipEout's two PSP outings, Pure and Pulse. It's no real surprise, then, that they're fit for the purpose of a handheld, and likewise the honeycomb campaign breaks down the content into perfectly portable chunks. Since WipEout 2048's release there have been a number of patches that have addressed some of the initial concerns, the most significant of which has taken to the loading times. Once painfully protracted, the wait from menu screen to the track is now far more manageable, and the HD and Fury tracks in particular load up satisfyingly swiftly. The most recent patch, 2.51, also broke the online when it was introduced, but thankfully this issue has since been tackled. It still falls a way short of 60 fps on Vita, but otherwise this is a remarkably faithful facsimile of the PS3 remakes, the small amount of fidelity that's been lost forgiven on the smaller screen. With their taste for cleaner architecture and smoother lines the HD/Fury tracks often look better than their 2048 counterparts, and with the on-track vapour trails that obscured the original's action it's a much cleaner looking game, too. The result is that it's quite often a much more entertaining game to play as well, the familiarity of the tracks and events included here being outweighed by the confidence with which they've been handled as well as the enduring brilliance of the originals. There are a couple of small annoyances: progress through the weighty campaigns of both HD and Fury earns you a handful of trophies but doesn't contribute to the XP system that runs through the rest of 2048, and it's a shame that the generosity doesn't extend to the soundtrack which still leans on 2048's original playlist. But they're the smallest of gripes in the face of what's a comprehensive pack, and one that's quite handsomely priced too: the HD and Fury content's available at £6.49 a piece of £9.99 for the pair, and it's completely free for owners of the PS3 originals. This is a brilliant update that retroactively switches WipEout 2048 from being a competent handheld series entry to being one of the Vita's very best games."}