{"ref": "https://www.eurogamer.net/app-of-the-day-heroes-call", "date": "20 Jun 2012", "game_name": "Heroes Call", "text": "I'm not against freemium games by any means - I'm actually just about to recommend you play one of them - but I do think there's something weird about the concept. It's weird that developers, who historically have spent most of their time thinking about how to engage players, have had to start pondering the best ways to frustrate them as well. How to make audiences pay? That's the central design issue at the heart of too many freemium games, and as central design issues go, it's a hard one to love. How to annoy players just enough that they'll hand over some cash, but not too much that they'll give up on the whole thing? It's the hunt for the world's crappiest Goldilocks region.Heroes Call's solution isn't particularly original, but I've certainly come across worse. For the most part, you'll simply be paying to cut down on the waiting times. Finish a quest in this likeably basic dungeon-crawler, and you'll be told you can't have a new one for, what, ten, twenty, thirty minutes? Don't worry, though, you can pay a few gems to get that quest right now, just as you can pay in gems to revive your character mid-way through a dungeon instead of heading back to the start of the level when you've been killed. You can pay in scrolls to speed up the time it takes to identify a new object, too, and while you can find both gems and scrolls in the game world itself, you'll never collect quite enough that way. Why not head to the in-app shop and just buy a bundle of them, eh?Annoying, but not terminally so. Those quests - and those identifications - will all be coming your way eventually, regardless of whether you pump any money in, and while you're waiting, you're free to replay previous missions and harvest any gold you find if that's your thing. Maybe it should be your thing, actually, since, as Diablo clones go, Heroes Call isn't too bad.You know that dry, brittle explosion you want when you smack a skeleton? Heroes Call has that nailed - just as it has nailed simple objectives, hideous, whinnying spiders, the clitter-clatter of falling loot, and a shield bash move that stuns close-up foes so you can nip past them and take out the ranged guys. There are a couple of character classes to choose from here, plenty of new items to collect, equip, and eventually sell, and the game's fairly nice and roomy, too, even if the somewhat anonymous art style doesn't do it any favours. The skills you unlock aren't bad, either.So, yes, if you are going to wait for a game to load the next level, there are worse games to wait for than Heroes Call. You could wish the developers would just charge you up-front, perhaps, but this is 2012, and things often aren't that simple anymore. Games have become more generous, but also far more devious. A mixed blessing at best, but it's no reason to let this little hack and slash pass you by.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}