{"ref": "https://www.eurogamer.net/app-of-the-day-uplink", "date": "19 Jun 2012", "game_name": "Uplink", "text": "Uplink's over a decade old, which in PC terms puts it somewhere in the Jurassic era, but it could have been made today. Now ported to iPad, this game is so spare in its elements and visually economic - pure, even - it will still seem new in another ten years.Uplink is a world of hacking straight out of Hollywood mythology and layered with PC jargon. The game is a series of interfaces: a map screen to 'bounce' connections across the world, emails, a job list, and access pages for other computer systems. Added to this are the programs you choose to run, pop-up icons you're constantly switching between. The tools and their uses are of the lock-and-key variety, so everything's about using the right ones at the right time to maximise every second on a job. Changing tools is handled by a pop-up menu that translates beautifully to iPad, and despite the initially bewildering nomenclature you're soon using it on autopilot. This is all the dexterity required for Uplink. The real challenge is in not losing concentration for a second. When you connect to another computer system and try, for example, to crack the admin password, that system will start a trace. You can get better at delaying these with upgraded kit, but they always happen eventually. If your trace tracker is running, a little beeping sound will get faster and faster while an estimate (that word is important) of the time remaining shows. If you are caught on any kind of high-profile hack, you are disowned by the Uplink organisation and your equipment is seized. No returning to earlier saves, no comeback, you're out - start again.And you will get caught. Traces are ever-present and for serious business you've got to ride time's edge, getting into systems and hitting the right parts in seconds, disconnecting just as the beeps are almost connecting. Uplink is a game where you learn how to be careful the hard way, through trying a hack absent-mindedly and forgetting to put the tracker on. Before you know what's happened, Mr Mega Agent is history.That can be hard to take. What saves things is how your increasing knowledge feeds right into the new game. Restarting is always annoying, but with experience you fly through the early stages while earning money hand-over-fist. Uplink is empowering and uncompromising in equal measure, giving up everything for those who know its secrets and waiting for the moment of complacency to strike them back down.The atmosphere glows out of ever-blue screens scrolling through lives, numbers and computer systems, a miniature world where the occasional intrusion of humanity is jarring. To get past voice identification systems, you phone up the business's administrator, silently recording his confused 'Hello? Hello?' while planning the next move. Early on you delete files on company servers in tit-for-tat corporate battles. But soon you're dealing with entire systems, framing people for murder, and more fraud than Bernie Madoff could handle. It's so easy to forget to put the trace tracker on. Do not ever forget to do that. You will.A hack will end with 'connection terminated by remote host.' In a few in-game hours your screen will go black, and a message from Uplink will cut you off, and tell you to be more careful next time. It is almost insulting in its callousness, and a gauntlet impossible to refuse. At face value, Uplink may seem simple. But with just a little imagination, it casts an incredible spell.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}