{"ref": "https://www.eurogamer.net/indie-game-the-movie-review", "date": "12 Jun 2012", "game_name": "Reviews", "text": "This review of Indie Game: The Movie was written after a screening at the Game Developers Conference earlier this year. We present it again today to mark the digital release of the film on Steam, iTunes and direct download today. For full details, see 'How to See It' below.It's not surprising that independent documentary film-makers James Swirsky and Lisanne Pajot - who raised the funds to make their film via Kickstarter - should find sympathetic subjects in a bunch of talented indie game creators. Nor is it surprising that Indie Game: The Movie should get a standing ovation after an oversubscribed screening at the Game Developers Conference in San Francisco. It's the definition of a home crowd, and this tale of triumph over adversity is just what directors and audience alike wanted to hear.It's a soft-hearted, uncritical group hug of a film that romanticises the artist's struggle and delivers a fantasy-fulfilling Hollywood ending. But that's not the only reason they stood and whooped in the aisles at the Moscone Center on Monday night; it's also a heartfelt piece of work that does much to demystify and humanise games and the game development process.This article contained embedded media which can no longer be displayed.Indie Game: The Movie follows Edmund McMillen and Tommy Refenes as they complete and launch Super Meat Boy in late 2010, and Phil Fish as he prepares to give the first public demonstration of his long-delayed indie darling Fez at last year's PAX East show. It also features Jonathan Blow ruminating on the breakout success of Braid like some elder statesman of sticking it to the man.Swirksy and Pajot originally planned a broader examination of indie game-making, but in Super Meat Boy and Fez, they found stories that were too good to pass up. McMillen and Refenes enter an horrific two-month crunch to get Super Meat Boy into an Xbox Live Arcade promotion, only for Microsoft to fail to promote the game on the Xbox dashboard on launch day, as promised. Meanwhile, an ex-business partner of Fish's refuses to sign a contract and end a legal dispute, leaving Fez's future - already hanging by a thread - in doubt.Drama! But the directors are a little too in thrall to these phantom threats which, despite some merciless milking, fizzle out in the end - and they miss the opportunity to show the all-too-real consequences when everything goes wrong. Indie gaming is littered with equally passionate individuals who lose their shirts, but their stories aren't told. Swirsky and Pajot have only picked sure things to star in their fairytale.What stars, though. And if the film-makers are too close to their subjects, at least that results in some fantastic material. McMillen, Refenes and Fish are frank about their fears and inspirations, and the depression and borderline mania that go with undertaking such huge creative projects in virtual isolation and with scant financial support. They're great characters, too. The spiky, awkward coder Refenes swings from crippling self-doubt to flashes of punk-rock defiance. Artist and designer McMillen looks outlandish but has his feet on the ground, talking with poignant lucidity about his childhood, inspirations and early games, and also offering a brilliantly practical five-minute primer on level design and game mechanics.Fish, meanwhile, is heartbreakingly invested in a game he can't finish for his own perfectionism. ~It's me, my ego. My identity is at risk. It's my perception of myself,~ he says of Fez. In the film's most startling moment, he's asked what he will do if he doesn't finish the game. ~I will kill myself,~ he replies, meaning it. ~That's my incentive to finish it.~ The flash of black humour relieves the tension, but it's an alarming vision of a man in desperate times.Indie Game: The Movie will be made available today as a direct download or stream from the film's website for $9.99. You can also pre-order DVD and Blu-Ray editions which will be released in a few weeks. The film is also releasing later today on Steam for £6.99/$9.99. If you really can't wait, it's already available on iTunes, including a slightly more expensive HD version and rental options. A bizarre postscript: cable network HBO and movie producer Scott Rudin (True Grit, The Social Network) have optioned Indie Game: The Movie as the basis for a half-hour drama series.Blow is underused, though, and the film never really gets under his skin. His reserved character and lack of a storyline (Braid is long since in the can, The Witness only in its early days) leaves him as a detached, gnomic figure in the background of the film. Blow's waters run deep and he has some fascinating things to say, but they're often glossed over quickly before we get back to the next gratifying story beat. At one point he says that he found many of Braid's most glowing reviews to be the most depressing, because they'd failed to engage with the game's ideas; cut to McMillen triumphantly reading out Super Meat Boy's scores (including some familiar-looking big blue numbers) over swelling music.Still, it's far more compelling than a film about men sitting at computers has any right to be, and more stylish, too. Swirsky and Pajot use some contrived visual devices to make things look interesting, like Fish submerging himself in a pool while he talks about depression, or a recurring and meaningless image of a Super Nintendo controller hanging from telegraph wires. But the presentation of game footage is fantastic - beautiful, instructive, sensitive to the material but also to the needs of a film audience, it does the games themselves proud in a way few film or TV productions ever have.And the indie scene? Despite Swirsky and Pajot's obvious love of the cool aesthetics and hipster attitude of indie games, much of Indie Game: The Movie could apply to any game development. The real virtue of sticking with these solitary developers is that their struggles are on a human scale, and a broader audience can understand how a game is made - this guy draws the pictures, this guy writes the program - much easier than they could the strange workings of a 100-man blockbuster team. But these guys' obsession and artistry can be found everywhere in the games industry.It's a soft soap and in some ways a missed opportunity, but Indie Game: The Movie has one great achievement to its name: it's conclusive proof, for all the world to see, that video games are made by human beings."}