{"ref": "https://www.eurogamer.net/app-of-the-day-a-little-turbulence", "date": "11 Jun 2012", "game_name": "A Little Turbulence", "text": "What's the best five minutes in all of cinema, eh? The envelope delivery at the end of Back to the Future II? The bit in Raiders where William Hootkins grabs his pipe and says, ~Top. Men.~? No, it's the scene in Midnight Run where Charles Grodin pretends to freak out on a jumbo jet so that Robert De Niro can't fly him back to LA. ~These things go dowwwwn!~ says Grodin, doing lovely little windmills with his elbows. ~They're too big. They can't go up.~Well Charles, they certainly do go down, and after playing A Little Turbulence, I know why they do. They go down because a small cloud became a big cloud by eating other small clouds, and then the big cloud triggered Rage mode, and vacuumed all of the jumbos up into a huge, angry vortex.That's A Little Turbulence for you in a nutshell, really: it's a side-scrolling, 8-bit charmer with a jaunty chip tune soundtrack, and it's all about getting bigger and then destroying things. I like it a lot, but I'm never going to fire it up on a plane. It wouldn't be right.If you've played any of the Katamari games, you'll be right at home. Steer your little cloud around - you can put your finger anywhere on the screen, so it won't mess too much with your view - and try to swallow up all the other clouds that come your way. As you do so, you'll be building up your mass meter, but watch out, okay? If you go too long without eating something new, your mass meter will start to go down, and it will also disappear a little more with every large object that hits you. Ouch.Large objects are ringed with red, but as you get bigger yourself, they gradually lose that crimson border and become something you can safely absorb. They're birds at first, flying in smart V formations, but soon you'll be encountering gliders, 747s, satellites, blimps, and even UFOs. Ever eaten a UFO before? Me neither.When you reach a certain mass, Rage mode kicks in. (It does this whenever I reach a certain mass in real life, too.) Suddenly the cloud's gone and you're controlling a vast hurricane that stains the sky pink and draws everything into its ragged centre. Rage mode's quite fun, but it doesn't last very long. Then you're back to eating clouds again. Little clouds, then birds, then you're on your way once more.Despite all the destruction, A Little Turbulence is a rather calming sort of game: your finger skates over the surface like Woodstock doing figure eights on a frozen bird bath, and beneath your endless sequence of birds, planes and other, more exotic aircraft, you can see neatly arranged suburbs and acres of sleepy farm land. It reminds me of the things George Clooney sees in Up in the Air when he looks out of the window and realises what a hollow shell of a man he's become, and ponders why Michael Bluth has grown such an awful beard and turned into a bit of a dick. Peaceful stuff! (Sorry for all the pop culture references, today.)The peace never lasts long, though: here comes another cloud, here comes Rage mode, and now all hell is breaking loose once more. Give in. Enjoy it. But the next time you cross the Atlantic, maybe try and put the whole thing out of your mind.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}