{"ref": "https://www.eurogamer.net/app-of-the-day-forbidden-island", "date": "10 Jun 2012", "game_name": "Forbidden Island", "text": "Forbidden Island is a co-operative game for up to four players, based around a treasure-filled island which is constantly sinking. The team's job is to bag all four of these treasures and then make it to Fool's Landing, a helipad, to escape. There shall be no-one left behind, either. Everyone wins, or everyone loses.The way it works is simple, but the construction is ingenious, which is why it's not so great when you have to do everything manually. The island is a grid of squares, each of which is a location - and each time you play, although the shape of the island remains the same, the locations are randomised, which includes the treasure troves and Fool's Landing. On each player's turn they can make three moves. Moving up, down, left or right one square is a move, as is sandbagging a sinking portion of the island, as is swapping a treasure card with another player, as is bagging a treasure. After each player's move they draw two cards - there are four types of colour-coded treasure card, plus bonus sandbags and helicopters. The sandbags can be used to shore up squares from anywhere, the helicopter to move instantly from place to place, but you need four identical treasure cards to acquire that treasure.  Each player can hold a maximum of five cards - which is why swapping matters.The twist is in what happens after this. After every single player moves, the island sinks a little more, which is done by flipping over two cards from a deck that contains each location on the island. Each place that comes up goes underwater. Any player next to it can use one of their moves to shore it up, but if its card comes up again before that point, it sinks without trace. There are two possible spots to get each treasure and if they both sink before you've got it, game over. If Fool's Landing ever sinks, you lose. It's about spreading your resources, making sure the team aren't too close together, not too far apart, and generally keeping the island afloat while collecting enough treasure cards to get what you came for. But this tug-of-war can never go on for too long before the bad thing happens. Water Rises. The cards the players get after each turn come from a deck containing this, the worst card in the world. When this appears, it is accompanied by the kind of threatening hum that usually introduces a monster in Hammer horror movies. I guarantee at least one person on your team will do a swear and, if they know what they're doing, everyone will. And Water Rises will happen again and again. When Water Rises, three locations instead of two sink after each player's turn. When Water Rises again, four, and so on. It's a fight you can't win, and brings home just how precious each one of every player's three moves are. And when parts of the island start sinking permanently, their card is removed from the location deck. So as more cards are being pulled each turn, there are less and less possibilities in there - Fool's Landing becomes such a priority that one player is often reduced to the sandbag gopher, just standing next to it in case.It's a game where things start calm, and then go wrong rapidly. You rarely win, even, but despite the element of randomness it never feels like the game's fault. Perhaps it was because your team didn't react quickly enough to a crucial tile, or were simply in the wrong place when the worst thing possible happened. It can be heartbreaking at times, like when you have two buddies and all the treasures on Fool's Landing - and one of the team is left, marooned, on a square surrounded by water, no way home. It's brutal and unforgiving, but that's why it's ~Forbidden~. Maybe that's why, when you do finally pull it off, flying into the sunset with a round of high-fives, victory tastes so sweet.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}