{"ref": "https://www.eurogamer.net/app-of-the-day-doptrix", "date": "5 Jun 2012", "game_name": "Doptrix", "text": "Doptrix is Tetris inverted. It's a brain-blendingly ingenious puzzler in which you can't rotate the pieces, but you can rotate the board. Spin it clockwise or anti-clockwise, flip it head over heels or side-to-side: re-position the playing area as much as you want, in fact, and then fire your tetromino onto it. Done. The basic rules keep in step with Alexei Pajitnov's world-beating masterpiece - construct unbroken lines in order to clear them - but everything else about Doptrix is weird and disorientating. Familiarity has never felt so unfamiliar.It's a bit like learning a new language, in fact: there are unifying structures that you can cling to when you spot them, but they're buried beneath a wealth of new ideas, and they only peek out every now and then. That's at first, anyway. I think Doptrix takes half an hour or so to truly bed itself into your brain. You can tell it's a brilliant idea within seconds, but only after a little time has passed are you actually having any fun.In order to work, Doptrix divides its screens into two different areas: the top area is the game grid, and this is the part you can spin around and flip with a couple of swipes of a finger. Beneath that, you have a kind of launching pad - a board that shows you your current piece and the ghosted outline of the next one that's coming down the pipe - that allows you to flick each block to move it up into play.In Classic mode, you're given the standard Tetris shapes, and while you can't rotate them, you can move left and right a little to reposition them as required. In Alternative mode, the pieces tend to be simpler in terms of geometry, but they're now locked firmly in place. Puzzle mode rounds out the package, and it gives you a game grid that's already fairly cluttered, before tasking you with clearing it. It feels a bit like the classic Tetris B-type game, and a bit like those Chess scenarios you get in the back of the newspaper. Whatever the touchstones, it's astonishingly satisfying when you complete a challenge.Regardless of which mode you're in, game grids always start with a few anchor pieces in place, because otherwise there would be nothing for your first tetrominoes to latch onto. You lose points every time you fling a fresh piece into empty space, incidentally, and since Doptrix's tutorial is probably the game's weakest aspect, it shouldn't surprise you too much if you conclude your very first game with red, as the Black Widow once said, in your ledger. Don't give up! Doptrix is worth sticking with. Despite the ho-hum art, the different colour schemes that often sound a little like the names of downmarket prostitutes, and the general awkwardness with which the entire game presents itself, this has the makings of a modern classic. Like Drop7, it will take a lot of getting used to, but the rewards? The rewards will last for months, and possibly even years.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}