{"ref": "https://www.eurogamer.net/app-of-the-day-baseball-superstars-2012", "date": "3 Jun 2012", "game_name": "Baseball Superstars 2012", "text": "You don't have to understand baseball to love baseball, if you ask me. As sports go, it's pure romance. From the rust-coloured brick dust of the infield to the holler of the guy throwing hot dogs around in the stands, it's stylish, cinematic, and pleasantly old-fashioned in a weird sort of way. Does lawn bowls put you in mind of rugged ol' Kevin Costner making quips? No it doesn't. Baseball does. Lawn bowls is rubbish. Baseball rules. Coincidence?Oh yeah, and the whole thing's perfect for video games, too, thanks to its blend of simple, repeatable actions down on the diamond and all that stat-crunching back in the seats. Baseball feels a bit like an ARPG, at times, like sport's very own Diablo. Baseball Superstars is a series that has always understood that.Gamevil's curve ball best-sellers have been a feature of smartphone gaming for a few years now, and, if you've been put off by the air of complexity that hangs over the franchise, the 2012 instalment is a pretty good place to get stuck in. The latest update has the best art yet - sharp anime lines and gleaming colours - and it's just about got the freemium balance to a point where casuals can get a sense of what's going on, and hardcore players can - actually, no. It's probably very dangerous if you're a hardcore player and you're vulnerable to the call of the in-app purchases. Stay away.At heart, Superstars is about either batting or pitching, both of which are boiled down to pacy, sensibly arranged mini-games offering everything from tilt and gesture controls - tilt for batting, gesture for pitching - to virtual button set-ups. Step back a little, and you can bundle these games into entire seasons. Step back further, and you can leave the stadium entirely and explore a small hot-spotted town, levelling up your stats as you go.There are challenges to take on and NPCs to chat to, and it can all get a bit dizzying if you leap straight into that stuff. Mainly, though, it all seems to tie into two common themes: raising your various attributes to make you a bit better with ball or bat, or providing you with money so you can buy things. Even if you get truly lost within the complications, you'll always be able to find your way back to the action again. It's back at the stadium!It's grindy, of course, and if you're going to take the game's progression stuff seriously, you're probably going to have to fork over cash now and then to keep your energy up as you fumble through various training menus. I will never, ever do this. Also, if we're really picking nits (not a real thing?), the game's inherent statistical richness is often muddled by confusing interfaces and poor text translation. If you don't mind being a little bewildered for a half hour or so, however, you'll get through the worst of it fine, and then the game's rhythms start to emerge and the whole thing begins to make sense.I'm by no means a Baseball Superstars expert myself, in fact. I'm constantly discovering new modes and new gameplay elements, and there's still plenty about the design that I find cheap, needlessly confusing and wilfully obscure. I'm hooked, though: drawn in by the dry thwack of the bat and the golden glow of the scoreboard. Why not join me, in this endlessly romantic purgatory?App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}