{"ref": "https://www.eurogamer.net/app-of-the-day-oh-cube", "date": "31 May 2012", "game_name": "Oh! Cube", "text": "The trouble with describing logic puzzles is that it's impossible to make them sound as gripping as they often feel when you're playing them. In Oh! Cube's case, I thought I had a nifty get-out clause: I was going to link you to Eurogamer's review of Picross 3D, and say ~it's basically this, but on your iPhone~. Only Picross 3D was never reviewed within these pages, perhaps for the reason mentioned above. On, then, with the tedium!The most common misunderstanding about Picross 3D is that it's Picross in 3D. Not so; it's Picross in reverse, really. Instead of using logic to gradually fill in squares in a grid, thus revealing a simple pixel image, you're removing cubes from a block, thus revealing a simple voxel object. In other words, it's not about what you leave in, but what you remove instead. On the DS you'd chisel the cubes out with the stylus, but here you're using your finger. It's less satisfying, sure, but it's surprisingly difficult to tap out the wrong cube. That's partially because you have to give each one quite a sharp tap to remove it, which allows you to spin around your work-in-progress sculpture with your fingers without fear of cutting out a chunk in error.Some of the cubes contain numbers, which are your clues to the number of blocks you need to keep in that particular row or column. If you see a 6 on one face, that means six consecutive cubes facing in the same direction need to be kept intact; if the 6 is within a heart, then those cubes are separated. You might, therefore, need to keep four adjacent cubes, tap out a gap, and ensure there are two together on the other side.It helps to colour in the blocks you need to keep so you can cross-reference these clues to solve the puzzle; tapping the icon in the bottom corner switches from chisel to paintbrush, though marking them isn't enough. You'll need to remove the unwanted blocks to finish the level.I've probably made it sound awfully dull, but I'm sure a few seasoned Picross 3D players will tell you that's not true. The objects you create here - as in that game - are hilariously basic, and those few seconds between tapping out the final block and finding out the answer as the object is coloured in and the text reveals its identity are a frenzy of quick-fire guesswork. It's a shotgun! No, an axe! A golf club? That's never a golf club! Some (but weirdly not all) of them are animated, and then they're placed in a variety of themed rooms viewed from an isometric perspective. All of which is almost exactly like Nintendo's effort. Oh! Cube does seem like a pretty brazen bit of copying, but then Picross is such a universal idea I'm not sure it really counts as theft. Besides, while it's not as good as Nintendo's game - the stylus is more immediate and precise for this kind of thing - it's a lot cheaper, and with well over 100 puzzles for the price of a Wispa Gold it represents excellent value for money.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}