{"ref": "https://www.eurogamer.net/datura-review", "date": "10 May 2012", "game_name": "Datura", "text": "You remember the launch of Kinect, of course. That half-a-billion-dollars marketing orgy during which America got formation pretend-gaming in Times Square, we got Leona Lewis wailing beside an ice rink and everyone bought one just to shut Microsoft up.Remember the Move launch? Me neither. Like a strange form of anti-marketing, the PS3 motion controller arrived on the high street with all the fanfare of an underwater brass band.  This was disheartening because Sony's device always struck me as having the greater gaming potential, certainly beyond what was on offer in the box-ticking, mini-game-heavy launch line-up. Subsequently, we've seen Move support added to big first-party titles like Killzone 3, Heavy Rain and LittleBigPlanet 2; but what about games designed for Move?This now seems to be changing, albeit slowly. Sorcery, as Dan discovered last week, is finally here, a proper, post-Potter, boy wizard's own adventure designed to celebrate Move's inherent wand-ness. And now Datura, a conceptually fascinating first-person adventure game on PlayStation Store.You begin on life support in the back of an ambulance. Complete the first few actions and you are transported - by way of a snippet of Dante - into a mysterious wood, which serves as the hub from which you move incomprehensibly through time and space into different playable sequences.The purpose of each sequence is to present you with a choice. Depending on what you choose, the wood itself changes in character to reflect your actions, darkening or lightening, a-flutter with butterflies or plagued by flies. The game supports standard controller play on a Dual Shock, but really: don't bother with that. A single Move controller is used first and foremost to look and navigate around. It also acts as your hand - in this case, a freakishly dismembered Addams Family one that floats in front of you, an even odder sight when your perfectly formed left arm pops into view from time to time.Structurally, it's straightforward in the extreme. Within each area of the wood is a number of perfunctory puzzles to solve, most of which serve as gateways to separate sequences, which employ motion control in various standalone ways.The puzzles, such as they are, can be tackled in any order you like. I'm being as vague as possible here, because the enjoyment I eked out of this short experience was all in the first play-through, when I was compelled forwards out of sheer curiosity to discover what might happen next and what on Earth was going on. The surreal sense of dislocation and atmosphere of uncertainty are Datura's main strengths. The best way to experience it, if you have the kit, is with Move and 3D. Here, the game offers a glimpse of virtual reality gaming, the greater sense of visual awareness (although watch out for the frame-rate hit) coupling harmoniously with Move's ability to reach 'into' the screen and manipulate objects. That's the idea, anyway.There are moments when motion control is deployed rather well, intensifying the drama where Dual Shock clumsily destroys it. But there are far too many instances when it just doesn't work properly, and I was fighting against it rather than working with it. But Datura's most egregious flaw is its inability to leave the player alone to freely explore, robbing the experience of any real sense of adventure in a flurry of distracting on-screen prompts.It's hard to know whether this is due to a lack of faith in the design or a lack of faith in the technology. A bit of both, I expect. Either way, the end result is a prompt whenever you are close to an object you are supposed to interact with. Press the button and only then do you move into position to do anything with it. Datura's short length - it took me just under a couple of hours the first time through - is fine for a PSN title designed to be experienced in one sitting. The different choices offer the promise of replay value, but with little left to surprise on a second run and with the same hand-holding system to navigate, it's a 45-minute slog to the end: a brief sequence that changes to reflect the actions of your play-through without offering explanation for what it all means. Is any of it real? A game named after a flower with hallucinogenic properties invites you to draw your own conclusions.The choices themselves are a curious mix. At its best, Datura puts you under sudden, intense pressure to act in haste and repent at leisure. But it's not always immediately apparent what the options are or how to take them, leaving you to shuffle from side to side in search of a prompt. If the execution fails to live up to the promise, it's hard not to admire the ambition to at least create something different. And it's another praiseworthy example of Sony Santa Monica taking a punt on an oddball indie project. On reflection, the individual sections are in fact just mini-game tech demos for motion control. But for once thought has gone into presenting them in an eccentric, experimental way to surprise the player. I've played it through three times in three ways: Move with 3D, Move and Dual Shock. The latter option, as I've said, is a pointless addition that feels like an interminably drawn-out QTE with dreadful Sixaxis implementation. It's better with Move because it was made for it. It's not, though, reason enough to buy one. But if you do have Sony's under-supported device stuffed in a drawer, Datura is a flawed experiment that's worth a look if only because it reaches towards - and occasionally touches - something that feels genuinely fresh."}