{"ref": "https://www.eurogamer.net/battleship-review", "date": "2 May 2012", "game_name": "Battleship", "text": "At first glance, Activision's Battleship feels like a high-concept satirical joke aimed at the video game industry. It's not only a movie tie-in, but a game based on a movie based on a board game based on a pen and paper game. More than that, the original game, which is world famous for its guesswork and mild strategy, has been transformed into a first-person shooter. A first-person shooter that plays out like a low-rent Halo, and lazily indulges every genre cliché you can think of.So it comes to pass that you are an anonymous explosives expert, trapped on a Hawaiian archipelago when aliens invade Earth. It's your job to tromp from waypoint to waypoint, shooting these aliens and occasionally holding down the X button to activate things, deactivate things or place C4 charges to blow things up. In gameplay terms, it's about as thin and rudimentary as an FPS can get while still retaining the right to be called a game.Control is a tad sluggish, aiming is a little skittish, but neither are ever bad enough to become a persistent problem. They peck at you instead, reminding you of the game's obvious rushed development and cost-cutting production. This cheapness of intent is apparent throughout.Visually, Battleship looks like a late PS2 title, with a tiny scattering of environmental details shuffled and reused constantly. Character models are passable but so generic that they blend into the game's lifeless palette anyway. Anything that might recreate the idiotic bombast of the movie is undercut by weak lighting and physics, rendering even the biggest explosion as weightless and ineffectual as a bath fart.Your weapon set is minimal with the basic assault rifle/shotgun/pistol trinity given bland flavour with a handful of alien weapons. A minigun type thing. A sniper rifle. You know the drill. Up to four feeble grenades can be carried, collected from our old friend The Brown Crate. These crates also double as ammo, getting the most practical use per visual asset possible.Enemies, too, fall into predictable types - the grunt, the brute, the sniper - while maps are linear to a fault, and take you through a combination of sun-kissed beaches, rocky countryside and occasional grey corridors. The only incentive to sniff around the edges is to find hidden Battleship pegs, which perform no gameplay function whatsoever but do earn you an Achievement should you find them all. It's the dictionary definition of mindless busywork, a meta-game with no substance or purpose.This is also, inevitably, a pathetically tiny game. Its seven stages will take an averagely skilled player the best part of an afternoon to finish off, after which there's absolutely nothing else to do except browse through some drab character files (this in a game with no characters) or watch a promotional video for the US Navy.Most astonishingly, there's no multiplayer. Yes, this is a game based, however tangentially, on one of the most popular two-player tabletop games of all time, in a video game genre that increasingly lives or dies on its multiplayer component, and there's nothing. Just a solo campaign that feels more like an obligation than a challenge and can be trudged through in a few hours.So what of the actual battleships? Well, even though the game never once attempts to replicate the turn-based guessing game that we all associate with Battleship, it does incorporate them into play, and it's here that the game almost comes close to redeeming itself with the inclusion of what could almost be - whisper it - an original idea.See, your character is given a remote command gadget and, for reasons that are never fully explained, is trusted to issue orders to a variety of real-life US battleships out in the waters surrounding the islands. A tap on the left bumper pauses the FPS action so you can switch to this command map and move the battleships around. Click on a battleship, click the square on the map where you want it to go. Return to the game and, if you're in the right place, you can look out to sea and watch your command take effect.Each level has key strategic points on the command map, and guiding a battleship to these locations unlocks artillery support options, with missile strikes and shells that can be called in to clear out the way ahead. Of course, allow an alien ship to control these squares and they can drop bombardments on you.The gameplay works the other way as well; while gunning down the endless alien drones in your path you'll collect ~wild cards~. These are power-ups that can be applied to your battleships, granting them better armour, increased attack strength, longer range and so on. One allows you to take control of a battleship's guns for twenty seconds, spamming rounds into the nearest enemy vessel in a crude turret-style shooting gallery. There are also wild cards for repairing damage and for reviving any ships that have sunk.Not that they'll sink very often, unless you play on the highest difficulty or make spectacularly stupid decisions. The strategy of the naval side of the game is minimal at best, and so long as you keep applying wild cards and keep the ships on the key squares, they pretty much look after themselves.There are moments, however fleeting, where the crossover concept begins to work and you can see what Double Helix Games, the studio behind the much-maligned Silent Hill: Homecoming as well as such limp movie spin-offs as Green Lantern and GI Joe, was trying to do.It doesn't really work, as the game never finds the right way to balance the two modes of play, but this brief flicker of ambition offers just enough ballast to prevent this otherwise tiresomely unremarkable game from sinking completely. Battleship is better than the movie that ~inspired~ it, but in this case that really isn't saying much."}