{"ref": "https://www.eurogamer.net/app-of-the-day-gunman-clive", "date": "28 Apr 2012", "game_name": "Gunman Clive", "text": "If video games had existed in the Old West, I like to think they would have looked like Gunman Clive. A sepia-toned 2D Western done up as a platform shooter, its scratchy, hand-drawn aesthetic resembles early 20th century animation. Its basic move/jump/shoot controls would have ensured young bucks gallivanting about town could easily manoeuvre their gunslinger alter-egos, while its often fiendish difficulty would have eaten up plenty of hard-earned coins. Lucky for us, Gunman Clive is priced more generously than the change-eating parlour games of the time. Heck, it doesn't even have micro-transactions. No daylight robbery.Rather than focusing on the grit of the era, Gunman Clive provides a cleaned-up view of the West with a shooter that resembles Contra by way of Roy Rogers. In true shooting gallery fashion, bandits pop out from behind crates, windows and trapdoors in the ground. Clive is a smooth cat, his face forever shrouded in the shadow of his cowboy hat's brim. The monochromatic art makes his gun belts appear like an optical illusion, oscillating between holsters and a Nathan Drake-esque half-tuck. It's pretty slick, either way, and there's an almost Han Solo-like grace to the way Clive kneels and shoots a foe peering out a trapdoor moments before they fire back.Beyond simply looking iconic, Gunman Clive is exceptionally designed. Stages are short, sweet and varied. One minute you'll be zipping through a mine cart, the next hopping over bandit-filled train cars, then precariously balancing over a rolling boulder. There's also more futuristic fare like riding a rocket or navigating high-tech bases with gravity beams. It's nothing you haven't seen before, but it tosses clichés around with such reckless abandon that you can't help but enjoy the ride.Special mention should be given for the bosses, which are challenging but never unfair. These gargantuan steampunk monstrosities require close observation and sharp focus. Play smart, defensively, pay attention to their tells and they'll be bested. But get cocky and they'll make you regret it.Gunman Clive is more deliberately-paced than other games of its ilk like Metal Slug and Mega Man, which is just as well since the virtual d-pad and buttons will never be a substitute for the real thing. It makes up for these shortcomings in other ways, such as short stages that are perfectly designed to be tackled in brief sessions on the go. Shooting is seldom required in tandem with platforming, lest your finger hit the screen slightly off target.While Gunman Clive exhibits some control issues inherent in a platform shooter on a system without buttons, it succeeds admirably overall due to its tight, diverse level design, glorious bosses and unique appearance. By drawing on inspirations as diverse as old-timey cartoons, 80s arcade games, and generous contemporary design, Gunman Clive is not only a lot of fun, but makes me pine for an era that never was.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}