{"ref": "https://www.eurogamer.net/wargame-european-escalation-review", "date": "24 Apr 2012", "game_name": "Wargame: European Escalation", "text": "Wargame: European Escalation prioritises information over all else on its battlefield. Knowing where your enemy is, and what company they're keeping, is tantamount to victory - provided you know how to act on that information. A tank without a recon unit nearby is all but blind, their poor optics barely making out a squadron of T-72s in an empty field let alone the Marden Tank Destroyers hiding in the tree line a kilometre away. But with a recon helicopter flying overhead relaying enemy positions they become deadly cannons, blasting expensive tanks into burnt-out husks.Wargame's from Eugen Systems, the makers of Act of War and RUSE, and it takes the latter's macro approach to the RTS. You're set in the hypothetical world of the Cold War gone hot, and provided with a battle-map whose size is daunting at first. Fields, towns and giant, turgid rivers all break up the landscape, offering a mix of cover, insurmountable terrain and a sense of terrifying agoraphobia. This scale and variety of terrain is important, because it means that the flow of information becomes ever more essential. Each map is divided into zones, usually centered around towns and notable bits of geography such as hills or islands. Control of these is what dictates the pace of the battle, as each one is assigned a point value that increases the rate at which you gain deployment points. And that's the only resource you have to manage, and the only way you can call in new troops to reinforce those being battered at the front lines. But controlling these zones isn't just about having troops in them; each one requires a command unit to set up within its borders. These are painfully expensive, and by and large extremely vulnerable; they're often just one tank shell or wayward missile away from being a tactical disaster. So you hide them well, and you do a lot of praying. Which, again, ties back to the necessity for knowledge. If you don't create a visibility screen around your front line, making sure you know exactly where your enemy is coming from, you become incredibly vulnerable to flanking maneuvers and sneak attacks. Delta Squads can fly in on Chinooks the long way around, hot dropping into forests and creeping up on your vulnerable UAZ Jeep. And so a solid position turns into a useless patch of ground in an instant. Games are won on points scored. Every unit costs a certain number of points, and gives that certain number of points to the enemy score when they're destroyed. So while MBT-70s might be the most wonderfully dangerous tanks in the game at 75 deployment points each they're a double-edged blade, bumping up your opponents score if you don't keep them protected. It makes for a game of deceptive complexity, and also one that's very, very good. On the surface it seems unapproachable, despite its heavily themed interface and war room aesthetic. The actual game screen doesn't look so far off some desperately difficult and obtuse war game like Combat Mission, and while it's not simple by any means, it's surprisingly accessible once you're over that initial hurdle. Tanks are good at taking out vehicles, and infantry in the open. Infantry is good in cover. Helicopters wipe out anything that isn't anti-air. Anti-air cuts down helicopters. And artillery goes boom. It all makes sense, in the greater sense, with just the specifics being something you have to learn. There are, however, a lot of specifics, with over 300 units in the game spread over NATO and PACT forces. And while a good number of them are variations on a single unit, there's still an overwhelming amount of choice at your disposal. The saving grace comes in the form of how you use those 300 units. As you play the game, in both the campaign and the multiplayer, you unlock Command Points. These are then used to unlock new units, to use in your 'Deck' of 25. Limited to 25 units (not including variants), and five in each category of Logistics, Recon, Support, Infantry, Tanks, Vehicles and Helicopters, you are forced to hone down your build into something that matches how you want to play Wargame: EE. While you may think that means whether you want to focus on artillery or helicopters, light or heavy tanks, there's also the points values and amount that you can deploy. Deciding between the zerg of the T-55 and raw power or the T-80 is just as much a choice as what to specialise in. It's a game that I'm enjoying more each time I play a round of it, because I can feel the synapses in my brain making new bridges as I learn some new tactic, or the proper application of STRELA anti-air squads. Early on though, it felt as obtuse as I was worried it was going to be, and it's only through a considerable amount of trial and error that I'm finding it properly rewarding. I never found it unenjoyable, and although the single player campaign does a nice job of easing you into the game, a good deal of how it works is left for you to discover on your own. The campaign itself is an interesting beast, throwing you at ever escalating conflicts that follow the narrative of Wargame: EE's hypothetical war. There are 22 missions in total, spread across the game's different nations into sequential sets. After the first five, played from the side of West Germany, it offers you the choice of Russia or USA before converging back into the climax. It's tough, and offers an experience unique from the multiplayer with scripted objectives and timed scenarios. For now, Wargame: EE has enough to boast about. It's got an incredible level of detail in the micro, with firing computer failures and tracks stuck in the mud, rises elegantly into its massive scale where you only see in terms of flanks surging forward, or lines faltering or holding under pressure. And that's not a figurative rise, as the game allows you to zoom right down to the level of the feet on the ground. You can watch tanks flatten the wheat in the fields as artillery shells rain down before you pull back out to the heavens, where you can hear the bustle of the war room in the background while you peek through the clouds. It's a scope and scale that can be daunting, but it allows for an unparalleled level of player agency within an RTS."}