{"ref": "https://www.eurogamer.net/app-of-the-day-furmins", "date": "22 Apr 2012", "game_name": "Furmins", "text": "From a studio as stylish as Helsinki's Housemarque, Furmins might come as a bit of a shock. This devious little puzzler brings none of Outland's chic or Super Stardust's sheen to the touch-powered land of iPhone gaming. No, this is the world of the Furmins; little fluffy balls with eyes, presumably the bastard offspring of Furbys and Gremlins, and about as appealing as a kick in the ribs.Thankfully, you won't actually be spending much time with them, and you certainly won't be interacting with them. They're a means to an end, Lemmings by another name, and they only exist for you to show off your own aptitude at constructing creaky Rube Goldberg contraptions using a combination of trampolines, chunks of stone and whatever other fancy stuff happens to be lying around the game's 75-plus levels. Moving these bits and bobs around is as simple as dragging them with your finger and placing them where you want them (which is a bit easier on an iPad but still perfectly feasible on the iPhone's smaller screen).Once your masterwork is in place, hit 'play' and watch as the Furmins drop out of their hatch and tumble their way downwards, then pray that your construction is robust enough to get them to their goal - another hatch that's guarded by a really odd-looking bird. (Seriously, it's like the cool guys at Housemarque were on holiday and their mums snuck in and designed the characters.)The 'undeniable cuddliness' (Housemarque's words, not mine) of the Furmins belies the real beauty of this game, though. This is one of the smartest puzzlers on the App Store, striking a fantastic balance between trial-and-error and careful forethought. It normally takes a few 'plays' to wrap your head around how the Furmins are going to fall and exactly where that trampoline is going to achieve its maximum bounce-to-Furmin ratio, but it's really satisfying when it all falls into place.Housemarque adds new elements to the mix at regular intervals. Sonic-style bounce pads make an early appearance and demand a well-timed tap of the screen to activate. Conveyor belts can be reversed with another tap. Later on, melting ice blocks are thrown in, some of which you can use to halt the Furmin flow, others you'll be hoping have turned into puddles by the time the fluffers get there. The final masterstroke is the sort of smart and simple idea that a less experienced developer might have overlooked. You can reset your Furmins at any time, but the on-screen furniture stays just where you left it, so you can make small adjustments without the fear of forgetting where all that other stuff's supposed to go. Without this, the whole game would have been a nightmare. With it, it's a devilish delight. It also makes three-starring every level an even mightier challenge, as you build convoluted mazes in an effort to guide your Furmins into the sweets (they like sweets, apparently) placed tantalisingly out of the way of the obvious path home.So, yes, Furmins might not be cool and you might not be decorating your desk with a weird-bird-thing plush toy, but Housemarque more than makes up for it where it counts - brains. This is an iOS puzzler that deserves to be massive for all the right reasons, and another tick in the win column for one of Finland's finest.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}