{"ref": "https://www.eurogamer.net/app-of-the-day-containment-the-zombie-puzzler", "date": "21 Apr 2012", "game_name": "Containment: The Zombie Puzzler", "text": "~When there's no more room in hell, the dead shall walk the earth.~ So they say. When there's no more room in shooters, they'll migrate to puzzle games too, apparently.Containment: The Zombie Puzzler from Bootsnake Games reimagines a zombie outbreak as a puzzle. Four types of colour-coded survivors share real estate on a zombie-infested grid - chainsaw-wielding nurses in pink scrubs, green-clad marines, cops in blue, and street punks adorning themselves in orange hoodies. In order to eradicate a zombie, or cluster of zombies, they must be surrounded on all sides by the same type of unit. Entrap a three-by-three grid of the undead within a barrier of punks, for example, and you can watch them whip out their dual-wielded pistols and dispense undead justice in the most synchronised display of gang warfare since West Side Story.Obviously there's an increasing degree of time pressure. Left to their own devices, zombies will take a bite out of their neighbours, instantly converting them, and if you take too long you won't have enough forces to quarantine the threat. Containment may not be a scary game, but it does instill a sense of urgency befitting its subject matter. Things then get trickier as new zombie types are introduced. Zombie wizards erect magical barriers that are only vulnerable to their corresponding colour, while plump, glowing undead explode upon dying, infecting those around them.Thankfully, units can be swapped from anywhere on the board. Using different types of civilians grants various power-ups. Taking out a slew of foes with nurses rewards you with hazmat suits that grant protection to their wearers and turns them into wildcards able to match with any colour (one gripe; the hazmat suits are grey, which at a glance makes them blend in with the similarly coloured zombies), while using a bunch of soldiers allows access to grenades, and punks provide Molotov cocktails.Sometimes there are interactive elements in the scenery, too. Garbage bins acts as treasure chests, usually providing goodies but sometimes housing a zombie that will wander into the playing field. Environmental hazards like gas tanks and toppling neon signs can be sabotaged, allowing them to take out an array of the dead along with anyone unlucky enough to be standing nearby. As with real-life zombie invasions, sometimes you have to make sacrifices for the greater good.Containment is mechanically polished and cleverly designed, which ought to be enough, but Bootsnake went the extra mile and framed the whole campaign around clear narrative. Each encounter takes place in a specific locale with text harmoniously blended into the background during tracking shots between battles. Most of these lines basically amount to, ~We thought we'd be safe there, but we were wrong,~ but it adds a cohesive flavour to what could otherwise feel clinical.Containment is smart, fast, quirky, and more distinctive than it has any right to be. Zombies and puzzle games already make up a wider berth than most in the market, but Containment distills the best elements from each to make something entirely original. Maybe we can make just a little more room for these decomposing doofuses after all.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}