{"ref": "https://www.eurogamer.net/floating-cloud-god-saves-the-pilgrims-review", "date": "19 Apr 2012", "game_name": "Floating Cloud God Saves the Pilgrims", "text": "Floating Cloud God Saves the Pilgrims is a new PlayStation Mini from Dakko Dakko, the developer behind previous Mini highlight, The 2D Adventures of Rotating Octopus Character. Minis is a queer category on PlayStation: launched with much fanfare by Sony, now compatible with three consoles, but yet to find a firm identity among the multitude of download portals out there. If it had more games like Floating Cloud God, that wouldn't be a problem.The Mini concept isn't about small games - it's supposed to be a banner for simple and original ideas executed with a bit of class. Floating Cloud God is exactly that, a 2D shooter built around the eponymous deity (controlled by the player) and his quest to protect eight pilgrims as they trek through each stage. Your own shots just knock their hats off, but getting hit by anything else will kill a pilgrim and send their spirit floating off with a sad little wail. This is bad not only because the pilgrims are a de facto health bar (losing them all ends the game) but powering up Cloud God depends on harvesting their love - juicy little hearts that pop up whenever you kill an enemy and increase in size as you blast more. These hearts are an elegant and devilish tool. Chaining enemy kills pumps them up and up, but they'll disappear relatively quickly if things go quiet. The game becomes about positioning Cloud God far enough away to blast through groups without sacrificing the pilgrims' safety, cultivating bigger and bigger hearts with ever-longer chains, then gobbling them all up at once and unleashing god's own fiery wrath on a bewildered mid-boss. Sometimes you'll get hit and lose them all. Sometimes you'll try to string things too far and they'll vanish. And sometimes a dirty enemy picks off a pilgrim while you're doing other things. They're good at that. The Cloud God's powers and the heart system mesh so well that any enemy can be destroyed in a blink - so they've got to be deceptive, sneaky, and sometimes numerous. Paper lanterns send out an arcing flame on death, red-eyed foxes hide in the scenery, imps swoop to carry off unlucky pilgrims and bobbing doll heads send out swarms of kisses. Hands start clawing up from the ground, crows dive-bomb your crew, and demons with phallic noses launch them as languorous, looping rockets. As this suggests, one of the reasons Floating Cloud God is such a pleasure to play is its visual inventiveness, which has room enough for everything from Wario tributes to what looks like a crying poo. This big lump of a thing, which is introduced in a level called The Saddest Enemy, explodes into gobbets of mini-poo that are very useful for building up a heart multiplier. Perhaps they're babies? That would explain the sadness. Floating Cloud God has bags more where that came from, and despite the Minis tag has plenty of room to breathe (there are seven worlds with 27 stages, including boss fights). And it keeps on surprising. The controls are simplicity itself: left stick to move, one button to shoot and one to bomb. But you soon realise the subtlety of how shooting affects movement and vice-versa, which fairly soon you're depending on against every enemy pattern. The pilgrims, too, are loosely tied to Cloud God during some sections, and learning how to manage their momentum is another little learning curve.The final touch is a minor detail that ties up everything. The pilgrims' hats can be improved. There's no in-game benefit to this, beyond looking much more awesome, and it's done by completing stages without losing a single pilgrim. Obviously, if you start this process on the first level and never lose a pilgrim, the hats just keep getting better. Seems like such a small thing, doesn't it? Soon nothing but a perfect run will do. The restart option is accessible, knowing, and tempting. Every time a pilgrim fell, it was too much to take - I didn't see their tiny spirit float off to heaven so much as all my future headwear ambitions. And to be fair, by that point I had four dudes with top hats, two with octopus heads and two with space hero helmets. You can't be replacing any of them with Norman and his brown cap just because some demon gets a lucky shot in. That's the best thing about Floating Cloud God Saves the Pilgrims. You do want to save them, and not just because they represent 'health'. The hats are a big part of it, but just as much is the sense of pride in being a badass god - harvesting power at the right moment to smash through oncoming waves, battling desperate rear-guard actions against hails of deadly kisses and throwing yourself in bodily as a last resort (which sometimes works!). The little yelp as a pilgrim goes down is a sharp reprimand, a blow to the daydreams of an all-conquering deity.When I finished Floating Cloud God Saves the Pilgrims, thanks to liberal use of the restart button, not a man had been left behind. It's a question of self-respect. Not many games can make you feel like that."}