{"ref": "https://www.eurogamer.net/app-of-the-day-dragon-fantasy", "date": "17 Apr 2012", "game_name": "Dragon Fantasy", "text": "It's the job of every decent RPG to tell the kind of story that ad men can later to refer to as an epic narrative. There has to be kidnapping, ancient evil, a curse, a legend and an unlikely hero. Maybe mysterious earthquakes are threatening the kingdom. Maybe the sky's turned black as pitch and meteors fall throughout the day and night. Maybe the dead have started to rise from their graves. These epic narratives aren't that hard to do, actually.Dragon Fantasy features a typically stirring tale, of course, but this simple, retro RPG from Muteki Corporation represents a lot more than that. It is a stirring tale, in fact: a tale of two friends, the best part of two decades, and a dream of which neither could quite let go. It's a lovely game alright, but it's also a truly great story.Let's deal with the game first. Dragon Fantasy is a top-down RPG with wonderful 8-bit graphics. The soundtrack chugs and pings in a distinctly Master System manner, the overworld scrolls smoothly as you head from forest to plain, desert to scrabbly township, and there are plenty of cave entrances beckoning you to explore, and shops waiting to load you up with gear.Battles are turn-based, with chunky animated sprites depicting skeletons, lizards, and all manner of other shambling horrors, and there are hours and hours of quests for you to level your way through, collecting loot, fighting evil, and generally trying to save the day. The last update even added a neat little riff on Minecraft. This is definitely an RPG worth taking for a spin.But what about its history? Its history, it turns out, stretches back 16 years and 14 revisions, starting with two teenagers who met in an IRC channel while talking about emulation. You can find the full story over on the company's blog - it's a great read - but the long and the short of it is this: back then, they really wanted to make an old-school RPG together, so they just decided to try, despite the fact that neither of them really had a programming background and that one of them lived in California while the other was in Montana.The two teenagers were Adam Rippon and Bryan Sawler, and the RPG would be a constant companion through the next decade and a half of their lives. The game was originally intended to be a DOS title, then a Windows title, then a GameBoy Colour and finally even a GameCube project. Each time it stumbled, each time it appeared to be dead for good.Fast forward to a few years ago, and both Adam and Bryan are now working at Muteki. The company's made games like Super Jetpack Dragon and The Battle of Pirate Bay, and the two developers are looking for a way to test the studio's new cross-platform UI system. Adam creates a few 8-bit tile maps to see how they look, and they both suddenly remember their long-lost project. We were going to make an RPG!This time, though, everything's ready to come together. Both Adam and Bryan have had real experience in the games industry, and they have the time and resources to scope a project properly and bring it to an audience. A hero rises, a prophecy is fulfilled.The rest, of course, is a story you can discover for yourself - and all for the price of a £1.99 iTunes download. Get on it.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}