{"ref": "https://www.eurogamer.net/tribes-ascend-review", "date": "16 Apr 2012", "game_name": "Tribes: Ascend", "text": "The best games never die. Fire a nailgun at a crowd and you'll hit someone who still swears Quake is the finest first-person shooter ever made. Counter-Strike is regarded by many of its adherents as the only serious competitive shooter to this day. And does anyone want to predict when the final shot will be fired in Team Fortress 2? The FPS genre is where Tribes Ascend fits, but preconceptions about that term should be forgotten. This is in some respects an unusual game: a top-tier competitive FPS launching under a free-to-play payment model with one key (structural) feature still not fully implemented. It eschews single-player completely, and in truth only one of its four game modes really matters. And Tribes Ascend is, by more than 300kmhh, the most exciting first-person shooter I've played in years.The Tribes series dates back to 1999's Starsiege Tribes, which introduced the interlocking mechanics of jetpacks and skiing. Tribes Ascend realises them magnificently. Skiing is the ability to glide without friction over the landscape, meaning that when engaged, you accelerate going downhill and maintain speed over flat surfaces. The jetpack is for the inclines, the idea being that you can essentially keep accelerating as long as you only ski downhill or on flats.Skiing is its own game, one where the fundamentals are easy to grasp but new techniques and tricks pop up constantly. Cresting a hill and landing snugly on the downside is one thing, but the contours of the game's maps are much more complex than that. Little speedbumps litter almost every concourse, while the long freeways are a haven for zooming speedsters but a death-zone if you're trying to pick up pace.Learning how to land from a fall, when to jam the jetpack button as hard as you can, and when to just sit back and let gravity do the work is an endless learning curve. You can eke out the tiny boosts, throttling on and off to skip across a studded landscape, gathering a little more juice from each lump. Or you can trek up to the top of the very highest hill you can see, take a brief peek at the scene through your binoculars and dive down, gaining maximum velocity before soaring to incredible heights on a full energy reserve.What a rush. Tribes Ascend is not like other first-person shooters. It's much, much faster. What requires such speed? Capture the Flag as you've never seen it, a game of intergalactic rugby with fortified bases, high-speed steals and endless ways to play. Ascend's major change to the Tribes formula is that it's class-based, and these nine classes are built for this particular game mode, each with its own style and role to play.The Pathfinder is the fastest, all about zooming through the enemy defences and out with their flag. As a Doombringer, the flag defence class, why not whack up a forcefield that does more damage the faster an enemy travels through it? Problem solved. Tribes Ascend is not like other first-person shooters. It's much, much faster.Each team's flag sits at their base, which is surrounded at intervals by auto-turrets and a radar sensor that highlights incoming players. These defensive structures can be supplemented with kit from other classes, like the Technician's turrets, to construct a truly formidable barrier for any wannabe flag-cappers.Except an Infiltrator has sneaked into the base while cloaked and thrown a few explosives on the generator, blowing it up and bringing every single defensive structure (player-created or fixed) offline. As the Technicians head down to clear him out and repair the generator, a Pathfinder swoops through at a perfect angle and off with the flag, the Doombringer's chaingun still whirring up as he becomes a speck. That's what Tribes Ascend is all about - perfect moves involving the whole team working together. This team play is the glue binding all the great things you can do personally to the greater cause. As soon as you pick a class, you're committing to not only a certain role in the game but often a specific part of the field - in the knowledge that, if you don't do your job well, it'll make things that bit harder for someone else on your side. And naturally, you're committing to a preferred method of killing folk. Though some weapons can be used by multiple classes, all have unique tools of their own. Shooting is different from the majority of FPS titles, based almost entirely around projectile weapons - that is, each shot has to factor in distance and velocity before you pull the trigger.The Light Spinfusor fires electric-blue plates that explode on impact, a precision tool that's tricky to learn the exact kinks of but incredibly satisfying to score a direct shot with. The Fusion Mortar's like a hand-mounted suppression system, slow to reach its target but letting you smash down on the enemy's defences from a safe distance and pick up countless juicy kills in the bargain - distraction duties, in other words. The Technician, a bit of a wimpy class initially, can be tooled up with the Thumper DX, a grenade launcher that turns him into a defensive powerhouse. It's while aiming these weapons that you realise how horizontal most games are. Tribes Ascend uses every axis, with aerial combat the norm rather than the exception, and players on the ground either moving very fast or sitting ducks. But while the combat is hectic up-close, it's a much more considered game at a distance. A good trigger-finger is a handy asset to have, but far more important is a combination of anticipation and experience - reading the scene before you, parsing the opposition's movements and reacting before the first shot is fired. Tribes Ascend is free-to-play, making itself an easy target for entitled punters, but developer Hi-Rez Studios - which made shooter MMO Global Agenda - has handled the money side of things as well as it could have. All unlocks can be bought with XP earned in-game or the pay currency of gold, while weapon and kit upgrades are XP-only. Certain things have been made very pricey for XP, like that Thumper DX for the Technician, but can be had easily with gold. That's the nature of the beast. Three classes are unlocked for free, and the rest can be earned with achievable XP totals. Certain weapons are easy to get with XP, some will take you a while. The balance feels a tiny bit on the stingy side when it comes to some of the secondary weapons, but overall it's possible to get everything for free (barring costumes), even if this is a much better experience if you've paid. It's a free chance to sample one of the best games of the year.   There are yet things to be improved with Tribes Ascend. The biggest omission is in-game voice chat. Ranked matches, too, are still awaiting kick-off, though that's just impatience talking. Team Deathmatch mode is nice enough, livened up with round arenas that lead to processions of players chasing each other, but it's simply irrelevant next to the magnificence of CTF. A mode that pits smaller teams against each other five-on-five is fun for a knockabout with mates but isn't really what this is about. Capture and Hold is a Domination game type which, by its nature, removes much of the speed and is that much less thrilling.None of this matters, or detracts from Tribes Ascend. It is a game designed to create a specific kind of fast-paced CTF match, and it does so with aplomb.Perhaps the defining thing about Tribes Ascend is that winning matters. In recent years most shooters have seemed in thrall to the depth and intricacy of their levelling systems: endless treadmills designed to make every player feel like a special snowflake while unlocking the same gear. Tribes Ascend has levelling and unlocks, but the game itself is what matters - winning the match you are playing at this very second. I don't even look at my kill/death ratio. The overall result says whether you played well or poorly, just like the XP you receive. It's closer to a team sport than a video game shooter. I don't even think it's accurate to call Tribes Ascend a shooter, inevitable as that is; imagine if Rugby was called Rucks.Hi-Rez has taken the fundamentals of Tribes and polished them until they shine, but this is no mere rehash. The class designs change Capture the Flag utterly, transforming it into a masterpiece of high-speed tactical manoeuvring that has a niche for every kind of play-style.Tribes Ascend only really does one thing, but does it pretty much perfectly. The best games never die, remember? And sometimes, they evolve."}