{"ref": "https://www.eurogamer.net/app-of-the-day-crush-the-castle", "date": "10 Apr 2012", "game_name": "Crush the Castle", "text": "I can't stand Angry Birds. It's not that I mind the stultifying ubiquity of the brand, or even the artless hubris of Rovio in its desperation to become the new Disney based on a single - albeit extraordinary - success. On the contrary, I think it's brilliant that any game can be downloaded over half a billion times within two years, first appearing on a platform that didn't even exist when the current set of home consoles launched. It's a brave new world out there and if a scowling red bird with a Gallagher monobrow is its poster child, so be it.No, the reason I loathe Angry Birds is simply that it's all so blisteringly unfair and cynically arbitrary. Any flicker of relief experienced when a stage is completed can never compensate for the emotional trauma sustained in the process. Angry Birds isn't fun, it's self-harm. Which is never something that could be said about the joyfully satisfying, charmingly unassuming, effortlessly generous Crush the Castle. Armor Games' Flash original is a virtual blueprint for Angry Birds, the only effective difference being the means of attack: a double-tap trebuchet instead of the slide-and-release catapult. Not that the developers of Crush the Castle have any claim to originality, expanding as they did (apparently with the original creators' blessing) upon the ideas in an even earlier Flash title, Castle Clout.Crush the Castle is a simple physics-based game of destruction. Its continents are populated by medieval kings and queens, who dwell in castles seemingly constructed by the original cowboy builders. Your job is to kill everyone within and without these architectural travesties, flinging projectiles at them until all that remains are rubble and corpses. That's really it. The fun comes from the increasingly elaborate castle designs (there's also a decent level editor) and intensifying resilience of building materials, plus an ever-growing arsenal of weaponry that begins with a simple stone and eventually expands to include a potion that tears a hole in the fabric of space-time, creating a mesmerising vortex of devastation. In your face, Mighty Eagle. Someone could perhaps look at the game and describe its graphics as ~laughably poor~, ~amateurish~, or even ~pitifully inept~. Such a person would, you understand, be dead inside. In fact, its defiantly archaic visuals and rousing Bontempi-orchestra soundtrack are infinitely more charming than Angry Birds' garish, hectoring sheen. With its bucolic scenes, whispering background of birdsong, and almost apologetic dying yelps, Crush the Castle is mass murder at its most polite. Designed to be savoured in and of itself rather than rendered artificially challenging to support a business model, this is a far gentler, easier game than Angry Birds, and the more satisfying experience as a consequence.The primal thrill of destruction never dims and the moreish joy is in smashing and murdering in as few goes as possible. Plus, as I discovered the other day, an entire new continent's worth of levels has been added to the game for free, including new projectile the Murder of Crows, which unleashes a flock of screeching killers that will literally devour humans with Hitchcockian savagery. Now that's how you do angry birds.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}