{"ref": "https://www.eurogamer.net/rhythm-thief-the-emperors-treasure-review", "date": "5 Apr 2012", "game_name": "Rhythm Thief & the Emperor’s Treasure", "text": "Air on the G String, eh? To bring Bach down to my level, it's Morgan Freeman walking through the LA Library in Seven. It's Jamie Foxx seeking a little baroque refuge from the rest of the ungrateful world in Collateral. And now, it's Marie, trying out for an orchestra gig in Rhythm Thief and the Emperor's Treasure. Air on the G String's a truly great piece of music regardless of what you associate it with, of course, but the thought that a lot of kids are going to get their introduction to it by means Sega's exquisite and wonderfully quirky rhythm-action game is still a lovely thing to consider.And Air on the G String is only one of The Emperor's Treasure's many fine elements. Sega's latest will teach you the French for ~woof~ - it's ~woeuf~, apparently, although that may be wishful thinking on the developers' part - and it will give you a decent working knowledge of downtown Paris, albeit one that largely focuses on the major landmarks. More importantly, however, it will make you stupidly happy for almost the entire length of its campaign. This isn't a long game by any means, but I've been playing it on and off over the course of the last week or so, and every time I go to pick the 3DS up I find myself smiling a smile that I normally only reserve for pudding or the arrival of cheques.At the heart of the game is Raphael. By day, he's a slightly Harry Potterish student, by the looks of it, who lives in an apartment in Paris with his dog Fondue and a mysterious basement filled with - well, you'll find all of that out for yourself at some point. By night, however, he transforms into Phantom R, a sharp-suited superhero cat burglar with a thing for musical crimes.Phantom R's a weird sort of character on paper - when you describe his main attributes, it's a little too easy to make him sound like a gymnastic Michael Buble with a penchant for hopping around on rooftops with a Cezanne under his arm, but it's a testament to The Emperor's Treasure's easy, sweet-natured style, that you buy into him completely, just as you buy Raphael's ongoing search for his missing art forger father, and the surprisingly busy plot that unfolds from that single point.It's a bit like a Dan Brown novel at times, but with a dreamy orphan violinist sidekick named Marie along for the ride, and an interlude in which you get in a swordfight with Napoleon, who's sensed the time is right for a comeback. I won't spoil any of the major surprises, but I will say that it's a cracker, albeit an oddball cracker.While Phantom R burgles his way around Paris' hot spots, picking off targets like the Louvre and the Opera and running up against spectral knights and the local police chief's kid, who has a real thing for bludgeoning people with footballs, the game itself plays out like a version of Professor Layton in which the logic puzzles have been removed and then replaced with little rhythm-action mini-games - perhaps by a cat burglar version of Micheal Buble.It's not a bad trade if you ask me. As you wander the streets of this gloriously reimagined city - watercolour pools of gold around streetlamps, the Sacre Coeur frozen in the orange light of an evening, the Seine rippling beneath a glowing Eiffel Tower - tapping the screen occasionally, Layton-style, to search for coins (you spend them on emergency power-ups) and other collectable doodads, you'll find yourself tasked with a variety of different challenges - none of which, thankfully, involve patterns of matchsticks or those sodding water jugs.The simplest of your tasks work the way the mechanics of a very simple adventure game might, as you record various sounds to get past various obstacles. A cowardly gendarme is blocking your path, for instance, but audio of a bulldog's growl could scare him off into the night. Beyond that, there are also little pattern-matching sections as you bust open ancient locks and deactivate security terminals, and then you get to the main events: a range of over 40 action sequences in which Phantom R - and occasionally other members of the quirky cast - work their way through extravagant set-pieces by matching beats.The games repeat their central ideas quite a bit, but for the most part they're a lovely selection of toe-tappers and punchy little hum-alongs and - unlike Layton's brainteasers - they don't stand out like weird non-sequiturs or interrupt the flow of the story. They are harmonious in every sense. Breaking into a police station, for example, you might have to strike coloured sections of the touch-screen to strike the same poses as nearby statues, thereby avoiding a patrolling security guard's flashlight, or you might have to leap from one rooftop to the next, stabbing away at A and B to jump and slide as you make your escape.Face buttons, shoulder triggers, and even touch-screen swipes are brought in as the game spins from one escapade to the next. The best challenges - like Marie's audition, which sees you conjuring a Bach classic from a simple sawing motion, or a brilliant gun fight-cum-punch-up towards the end of the adventure - have you playing with your ears as much as your eyes as you root out the intricate rhythms you're matching. Sega's designers can leave you feeling distinctly musical at times, while only a few of the challenges stand out as stinkers, and they all involve the gyroscope controls.The Emperor's Treasure's a pretty easy-going game - its 3D map always tells you where you're headed next, while you can spend coins on power-ups to get you through the trickier rhythm events - but if you want to see absolutely everything the plot has to offer, be warned that you're going to have scour the streets of Paris for every trinket and get an A grade on every challenge.This is a challenge in itself, as it turns out, because the grading system can be a little flighty, taking you from a top mark down to a pass at the last second on occasion. It isn't too much of a bind, though, since, even when the game's ever so slightly frustrating, it's still a simple pleasure to look at, from the wonderfully gentle 3D effects layered on the environments to the simple, economical anime cut-scenes and the lovely characters. It's even better to listen to, actually, with an eclectic musical taste that means you never quite know what you'll be playing along with next.Add to that local wireless and download multiplayer and some simple StreetPass integration that sees you filling Paris with fans, and it becomes a game you'll find yourself coming back to even after you've checked off each box and found every last trinket. Stylish, personable and effortlessly idiosyncratic, The Emperor's Treasure doesn't just have rhythm: it also has soul."}