{"ref": "https://www.eurogamer.net/app-of-the-day-madcoaster", "date": "5 Apr 2012", "game_name": "Madcoaster", "text": "From Duck Hunt to Angry Birds, gaming has a rather fractious relationship with our feathered friends, but rarely has a title been quite so committed to the act of avicide as Madcoaster.Sure, there are other animals to kill as the eponymous ride hurtles unstoppably onwards - you'll hit bears, hogs, and some unknown turquoise critter that I can never quite identify, such is the game's frantic pace - but 80 per cent of the animals you encounter have beaks and wings and an insect-rich diet. Worse still, point rewards and side objectives actively encourage you to take them out. For the most part you can blame it on sheer bird-brained stupidity - hey, they shouldn't be flying so close to a runaway rollercoaster, right? - but then you happen across a magnet pickup which drags them into your path like an avian tractor beam. Occasionally the game will delight in informing you that ~you got a rare bird~, actively congratulating you for contributing to the extinction of a species. The RSPB would have a field day.Gratuitous bird murder aside, Madcoaster is an amiable and entertaining mix of Canabalt and Jetpack Joyride. Tapping the screen propels the coaster into an arcing leap over gaps in the track, and you can switch between higher and lower rails by a brisk downward swipe. That's all the controls you need to worry about, and there's no complex tangle of extrinsic motivators to concern yourself with either - merely three side objectives (examples: kill three birds, kill five birds, kill all of the birds) that, once completed, increase your score multiplier.Thankfully, it gets the basics right. It moves fluidly, has responsive controls and looks quite pretty. The environments might be nothing new - desert, lava, spooky and cloudy zones are hardly the height of visual invention - but they're attractively drawn and use parallax scrolling, which is great, because it allows me to use the term 'parallax scrolling' in a review like the critics I used to worship as a young Amiga fanboy. Best of all, it has an absolute ton of coins to collect. If you are an iOS developer and you put coins in your game and those coins make a satisfying sound when collected, your game will likely remain on my iPod Touch forever more. There's something impossibly satisfying about pulling off the perfect parabolic leap and nabbing every single golden disc that hangs over Madcoaster's yawning chasms. If you're good, you can do this perhaps ten times per minute of play. A game this winningly dumb doesn't need much more than that, really.It isn't perfect. Sometimes it's impossible to see where the track begins and ends at the bottom of the screen, and occasionally the game will sneakily hide the holes behind clouds and buildings, which is a bit of a dick move. As a general rule, the coins will guide your route, but that's not always the case, and those unfair deaths sting a bit, particularly when you're nearing a high score and you plunge off the bottom through no fault of your own.Such instances are rare, though, and not nearly enough to spoil a worryingly compulsive reflex test. It's a twitch game best avoided by twitchers, then; another fine example of the kind of productivity-killing fluff that the App Store does so well.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}