{"ref": "https://www.eurogamer.net/devil-may-cry-hd-collection-review", "date": "3 Apr 2012", "game_name": "Devil May Cry HD Collection", "text": "Everyone would like to be more graceful. Move with a preternatural sense of the environment, marrying Bourne's cat-like reflexes to Bond's easy drinking manner. Devil May Cry wasn't the first stylish game ever made, but it's the pioneer for a type of fighting game that's still in rude health today. Constructed entirely around making cocky lead man Dante look amazing while he annihilates everything with extreme grace, Devil May Cry HD should offer one hell of a show.It certainly does, but often despite itself. Like most Capcom oldies given the HD treatment, Devil May Cry HD is a job done the simplest and quickest way - that is, the original assets are displayed in higher resolution and in widescreen, but minimal work is done on the assets themselves. What this means is that some of the larger environmental features have reworked textures, but smaller details like carpets and wall textures are very often left as they were, looking basic in a stark 1080p. Most strikingly of all, the menus and some FMV cut-scenes have been left out of the HD club entirely, displaying in 4:3 blur-o-vision.Despite all of this, DMC HD is still a gorgeous game. The originals were spectacular showcases for the grisly imaginations of Capcom's designers, devilishly vaudevillian worlds crammed with ginormous contraptions and breathtaking views. So, although DMC HD's visual upgrade is straightforward, it's working with awesome material, and developer Pipeworks has done a great job on the fundamentals. In-game DMC HD is crisp, colourful, and has no screen-tear or frame drops ruining the view. It's easy to nitpick, and we wish Capcom had given Pipeworks a bit more time and money, but these games look better than they ever have before by a big margin.  And looking good is what Dante's all about. The original Devil May Cry introduced a fluidity and grace to third-person combat that had never been seen before and has rarely been seen again since. Even after dancing with Bayonetta, Dante's first incarnation holds up - all business, but everything done with flash. Every movement has swagger and style, whether it's little sword flourishes mid-combo or a mid-knockdown handstand recovery. The remapping of the controls to the control pad (we reviewed the Xbox 360 version) is perfect here, and in contrast to subsequent Devil May Cry games the combo system's also more straightforward. Though Dante's capable of long, flowing sequences, getting your combo rating from 'Dull' to 'Stylish' is about constantly attacking and never getting hit, rather than long strings of different techniques.But even though DMC's combat is evergreen, the game around it has aged less gracefully. It feels rigid, the semi-fixed camera (think old-style Resident Evil but with the odd panning shot) sometimes leaving Dante or attackers obscured, although most of the time it avoids outright frustration. There's certainly recompense in the world and the directorial eye behind the shots, however - a series of punk gothic environments laced with wit and elaborate architecture. 3D games with fixed cameras flowered at the turn of the century and the march of technology has largely sidelined them, but this remains one of the finest examples, warts and all, from one of the medium's finest directors.After completing Devil May Cry, creator and director Hideki Kamiya was unceremoniously sidelined himself - along with developer Team Little Devils. Instead, Capcom gave Devil May Cry 2 to a new internal team, and they ended up with one of the most disappointing sequels in recent memory. Devil May Cry 2 is definitely the makeweight in this package, but for an interesting reason. It tried to do a God of War, basically - but two years before God of War was even released. The genius of Sony Santa Monica was in putting spectacle front and centre while making the combat easy to pick up and instantly gratifying. Devil May Cry 2 is a movement in this direction, but without the same firmness of purpose - it ends up a questionable stew of old and new, which never quite blends. Though Dante's moves look as slick as before, the major change to combat comes with the enemies, a visually uninspired bunch (goatlings?!) that have undergone a group lobotomy. They're afraid of Dante, warily circling him and occasionally prodding, which means a very easy fighting game. Where careless mashing in the original would swiftly reward you with a scythe through the stomach, here it demolishes whole groups, a new dodge button reserved almost entirely for projectiles and boss fights. Everything's a little bigger, and especially the environments - yawning great rooms and stretches of open air that are clearly meant to awe, and do sometimes, but are just as often dull backgrounds to a long walk. The puzzles that broke up the first game are abandoned, Dante's weapon-set is less varied, and the bosses are perhaps the biggest disappointment of all - total pushovers. The greatest satisfaction in a fighting game comes from finally beating a dude that's filleted you the previous five times, from defeating something dangerous.But it's easy to exaggerate how bad Devil May Cry 2 is. This is no unholy abomination, merely the mediocre entry in an otherwise consistently great series. It still looks kind of cool, but doesn't feel like it. To follow this, Devil May Cry 3 went more or less full reboot. An origin story based around a younger Dante (sound familiar?) and his jerk brother Vergil, Devil May Cry 3 brings back the challenge and pairs it with a bespoke system built around selectable fighting styles and weapon-changing. The version in the HD collection is the Special Edition, meaning a survival mode, a more considerate continue system (which you will be thankful for), and the option to play as Vergil from the start.Devil May Cry 3 rediscovers that love for OTT coolness that sees you exulting in ridiculous combos, backflipping out of danger, taunting at every opportunity and eventually shifting time itself to pick the perfect moments. It's a sinuous pleasure to control Dante, and each of his styles has a major influence on how you fight - Trickster grants additional ways to dodge, Royal Guard introduces timed counters, Swordmaster provides extra melee attacks and Gunslinger adds a bevvy of amazing-looking firearms techniques as well as charge shots. Each style also levels with usage, so Trickster eventually has you teleporting into enemy faces and Royal Guard can one-shot bosses.Just over halfway through Devil May Cry 3 a fifth style is introduced, Quicksilver, which lets you temporarily freeze enemies in time while Dante moves at normal speed. The possibilities with this are endless (as long as you have enough meter), but the simple fact you come out of them floor-surfing on one enemy while juggling his mate with bullets says everything. It's an outlandish ability with a gorgeous visual filter that changes combat entirely - but only if you want it to do so. There are even more styles, but enough of that.The weapons also get their mojo back in Devil May Cry 3 - triple-nunchuks, smashing gauntlets, fire-and-ice twinblades, and neon scythes that transform into electric guitars. Oh my. These are levelled for new techniques and can also be cycled through mid-combo, which allows fluid switching between Dante's movesets and a way to keep relentless pressure on enemies, but more than anything else is a joy to learn. These systems are built to make improvisation easy, and make even common brawls thrilling, while high points - like the final battle with Vergil - are simply unmissable.  Devil May Cry 3 is the pinnacle of the series so far, a game so good Capcom couldn't top it. It took DMC's creator Hideki Kamiya and Team Little Angels to make Bayonetta, which directly lifts quite a few tricks. If this HD version of Devil May Cry 3 was available solo it would be essential. But it isn't.Some of DMC HD's content is far from classic, and there are undeniably rough edges. But as a package it offers two fighting games of exceptional quality, with Devil May Cry slick and stylish enough to overshadow its creaky camera, and Devil May Cry 3 still one of the genre's highpoints. It's not quite as classy a treatment as the games deserve, you'd have to say. But in terms of Ninja Theory's imminent reboot, it's a hell of an appetiser."}