{"ref": "https://www.eurogamer.net/app-of-the-day-magnetic-billiards-blueprint", "date": "31 Mar 2012", "game_name": "Magnetic Billiards: Blueprint", "text": "I've been playing this Pickford Brothers' BAFTA-nominated puzzler on and off for months now - not that you'd be able to tell by looking at my scores - but it wasn't until very recently that I realised what it reminded me of. In both its reappropriation of a classic pub game and its light-hearted, parochial charm, it's the game equivalent of '80s TV gameshow Bullseye.Like host Jim Bowen, it makes a big fuss of even the most mundane accomplishments (indeed it's a lesson to all iOS developers in how it presents Game Center rewards) and the regular praise for 'cool' and 'mega' shots, not to mention the cries of ~marvellous~, could just as easily be replaced by a ~smashing~ or a ~super~.But I digress: the reason Magnetic Billiards: Blueprint is App of the Day when it's been out for the best part of nine months (and already reviewed by Kristan Reed) is that the Pickfords have released a wonderfully generous update, all of which is free to those who purchased the in-app Skeleton Key that unlocks everything.For starters, you get more of the beardy Pickfords themselves, who pop up to offer tips and advice. As a similarly scruffy Northerner, I find their appearance rather comforting, though your mileage may vary - the new app icon has already been described by one startled player as ~the scariest icon on the App Store~, programmer John's unkempt mane and wide-eyed stare making him resemble a surprised horse.There are 40 more tables to tackle, too, described pretty accurately as Tricky and Fiendish. They introduce Pegs, balls which lie in a fixed position, forcing you to play around them. Struts, meanwhile, connect balls together from the start, adding another layer of strategy to a game already bursting with tactical opportunity. There's an option to replay your last shot if it was a particularly good one, any record-breaking shots (for Bounce, Buzz and total shot score) are automatically saved for posterity.Seasoned Billiards players will no doubt have experienced moments where a single errant stroke late in the game can ruin a potential record-breaking score; fortunately, the Pickfords have added the ability to undo your last shot. Sneakily, they've also monetised it, though these UNDOllars are reasonably priced, and you can happily get by without them: you'll just have to start a table again if you mess up.  It's almost worth the investment for the curiously satisfying sight of coloured paper strips sweeping in to reset the balls.Two new game prototypes have been added, and both prove entertaining but fairly short-lived distractions. Squish introduces gravity after the first shot, with new balls steadily added until the table is full. Unlike the other games you won't lose a life for hitting another ball first, as long as you make a connection with a similarly coloured ball. It's messy and not altogether convincing but worth a try.Then there's I Sent My Monkey To The Moon, a strange psychedelic platformer with angled platforms and grind rails that uses similar pull-and-release controls to propel your apestronaut into space. There's the kernel of something special here, but at the moment it's just a fun little idea that probably won't drag you away from the classic tables for too long.Not that it matters when the core game is so good. This smart and unusual puzzler remains one of iOS's undiscovered gems, though this week's debut on the front page of the App Store should hopefully earn it the attention it deserves. Whether you're a lapsed player or it's passed you by until now, version 2.0 should be downloaded forthwith. Pogonophobia is your only possible excuse not to.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}