{"ref": "https://www.eurogamer.net/jacked-review-the-unauthorised-gta-story", "date": "27 Mar 2012", "game_name": "Reviews", "text": "Jacked: The unauthorised behind-the-scenes story of Grand Theft Auto, by David Kushner; Collins, paperbackThere are three killer lines in the author's note prefacing Jacked. The first, which we'll come back to: ~This book is based on more than 10 years of research.~ The second is that it is ~narrative nonfiction~, an unusual qualifier to force on the reader of a behind-the-scenes story at such an early stage. The third is that ~the current helm at Rockstar declined to participate in this book.~ The ~current helm~ is not singular. What Kushner is trying not to say is that his book is missing the key players. So Jacked is in a bit of a bind. It can't go behind the scenes at Rockstar, so instead settles on telling the Grand Theft Auto story with heroes and villains: the boundary-pushing Rockstar boys taking their medium into the mainstream while battling media hysteria and moral conservatism.There are two problems with this. One is that Rockstar did not battle on behalf of its games, as Kushner notes several times, issuing almost no statements and granting interviews only when topics like the 'Hot Coffee' controversy were off the menu. There are no flashpoints, no meetings between the book's narrative players; the closest it gets is Jack Thompson and a bunch of placard-wavers outside Rockstar's New York studio. No-one comes out to meet them. The bigger problem is that it turns this book's focus away from Grand Theft Auto and towards Jack Thompson. The conservative ex-lawyer (and now internet minister) is certainly a part of GTA's story, inasmuch as his rantings against it were given time across America's talk shows and newspapers. He represents an aspect of the American public psyche, too, which operates on moral fervour rather than rationality. But is Jack Thompson really worthy of a character arc?Well, he gets one. We hear about Jack as a young man at conservative rallies, thrilling as Charlton Heston booms out a sermon decreeing that Ice T's 'Cop Killer' should be banned. ~He lit the fuse on the culture war,~ says Jack. Word. We follow the young demagogue through law school, through his first successful prosecutions of shock jocks and early battles with Time Warner for releasing rap albums. This chapter ends with him proudly winning a 'Censor of the Year' award in 1992. Kushner clearly hopes that Jack's crazy enough to be interesting, but this is not the stuff of great antagonists.Thompson pops up throughout the book, but there are other lengthy digressions with tenuous links to Grand Theft Auto. A chapter is given over to the story of two teenage stepbrothers who decided one night to shoot at passing cars with their parent's rifle. They killed one man and seriously injured others. When arrested, one said that GTA3 may have given them the idea.Kushner names the chapter on the Tennessee shootings, rather crassly, Grand Death Auto. And that's not the only time his taste in language is questionable. There are some terrible metaphors, such as this one starring GTA forefather Dave Jones as a kid and a Galaga machine. The location is Dundee:~He wanted to touch it. Slip his coin in the vaginal slot, and pound the buttons.~I'll have a battered Mars Bar and a quick knees-up with Ms Pac-Man, please. What twaddle. Yet at least Jones is spared Jack Thompson's fate, because when Kushner begins to sense that his antihero isn't quite making the grade his prose soon turns to pastiche:~A car cut past the palms of Miami, Florida. City of vice. The drug dealers in the art deco alleyway. The players in their fancy cars. The rollerblading models, women and men in thongs. The depravity pulsed like neon outside Jack Thompson's window as he made his way home, but the nearness only served to remind him of his fight.~Such stuff is ridiculous, and the joke's on the reader.Though this incident could be a starting point for enquiring into the nature of video game violence and copycat crimes, its treatment here is relentlessly soft-focus. The story tails off with no-one able to make any sense of the whole thing, least of all Kushner. There's no attempt to analyse, and really there's no story - just a family tragedy, bulking out a book on Rockstar. Kushner's previous book, Masters of Doom, is a superb read that has one massive advantage over Jacked. Carmack, Romero and all the other key players at id Software talked to him; Masters of Doom is a story as told by its main players. Without Rockstar's ~current helm~, Kushner is forced to give people like Thompson the time of day and reassemble what he can from developers who used to work there and previously published material. Some of the time, he makes it work. The early part of the book is uncompromised, thanks to the large number of people whose involvement with the series ended after the first game. It breezes through the formative years of figures like Sam Houser and Dave Jones before a detailed look at how DMA Design's top-down Race n' Chase morphs, through accident and design, into Grand Theft Auto. This sequence is one of the book's best, as Kushner follows the game rattling between DMA in Dundee and Houser's BMG team (the publishers) in London, and its step-by-step evolution into a new breed. Mixed in with media types and anonymous DMA coders are characters like Gary Penn, Dave Jones and Sam Houser, and this ferment of voices creates unlikely heroes. One is the publicist Max Clifford, whose easy manipulation of parliament and the press is a brutally efficient PR masterclass. By the end, Jones is stunned into submission: ~Everything he said came true.~ The game's growing pains, and the backdrop of the all-conquering PlayStation, find Kushner's ~narrative nonfiction~ at its most persuasive.Soon, Sam Houser and other key players are in New York as the newly-established Rockstar Games, focusing on building a ~lifestyle brand~, and DMA is in Dundee making GTA2. The tensions lead to DMA's acquisition and Dave Jones leaving to set up Realtime Worlds, and before you know it we're on GTA3. By the time this rolls around Houser is taking an even more central role, things are getting really interesting for Rockstar - and the cracks in Jacked begin to show. The simple truth is that Kushner hasn't had the access to get new material on the making of GTA3, Vice City or San Andreas. From here on in, Jacked pulls almost all of its Rockstar-specific material from previously published sources - and a special few are ravaged mercilessly. More on this later.The exception to this, which Kushner takes full advantage of, is the 'Hot Coffee' saga. Here there's a wealth of documentary material and accounts from which to build a complete picture of an incident that encapsulated Rockstar's grand ambitions and near-fatal hubris. No reasonable person would cause a fuss over inaccessible sex scenes unlocked by an unofficial third-party patch named Hot Coffee, would they? Rockstar's bosses thought it would probably blow over, and did the worst thing possible. They claimed the content was not on the disc, and blamed hackers for inserting it. They lied. What is staggering about Hot Coffee - and Kushner is meticulous about the details - is how it balloons from an eagerly-anticipated mod (an enjoyable digression introduces the Dutch coder responsible) into a PR problem, and from there into a full-blown scandal. Sam Houser, so internally bullish about how the sex scenes were pushing boundaries, simply doesn't take it seriously until it's far too late, and ends up being grilled by the FBI. San Andreas has to be recalled and reissued while scores of lawsuits are eventually settled out of court by Take Two, costing the company at least $45 million.From here, it's all downhill for Jacked. The Hot Coffee section is great, but Kushner gives it such prominence because he doesn't have much else to say about the games - they're described, sure, and features and locations and music tracks are listed, but Jacked never threatens to explain why these games are such magical experiences. Houser says at one point that ~I don't want [San Andreas] to be remembered for Hot Coffee,~ but when there's no other side from either him or the author, that's all there is. Direct quotes in Jacked from Edge's 2008 article The Making of Grand Theft Auto 4 number in the dozens, never mind the many 'first-person' accounts of Houser that are adapted from the same piece - yet the magazine is only mentioned once in 280 pages. Here's an example of what Kushner does:~I'll be getting in a battle with some guys, I'll steal someone's car and some fist-fight's kicked off, and then suddenly he'll be chasing me through the street, and I'll get in position - like, I'm not running from you any more; I'm going to fucking have it with you now, mate.~ - Sam Houser as quoted in Edge 187, The Making of Grand Theft Auto~Sam could feel it. The weight of reality. The simulated world suspending his disbelief in ways he only dreamed of. This was it. He went to jack a car, but the driver wasn't having it and started to chase him down the street. Sam stopped dead in his tracks. 'I'm not running from you any more,' he thought. 'I'm going to fucking have it with you now, mate.'~ - Jacked, page 266So that's what narrative non-fiction is...Houser didn't say that to Kushner, in fact, though by the way it's presented in the book, you'd think he did. It's one of many quotes in this book taken from an article published in Edge magazine in April 2008, The Making of Grand Theft Auto 4. (Full disclosure: I worked on Edge when this article was published and, though I didn't write the piece, am obviously familiar with the material.) This 12-page article is one of the few occasions Sam Houser has been interviewed at length, and nearly everything in it finds a home in Jacked - almost every detail in the chapter on GTA4 in particular. (See 'The Edge of Reason', left.)Why isn't Kushner happy to admit that Sam Houser wouldn't talk to him? Only he knows; perhaps because it would expose the ~behind-the-scenes~ part of the book's title as a lie. ~This book is based on more than 10 years of research.~ This book is a potted history of Grand Theft Auto that confuses context with content, and has a smattering of new material from minor players. It has a few worthwhile chapters, but it's not even close to the ~behind-the-scenes story~ it sells, and by the end Kushner is so out of options he's simply rewriting the work of others as his own. Masters of Doom is a wonderful book, and it's scarcely believable this comes from the same author. Jacked is not the book that Grand Theft Auto deserves, but blaming Kushner only goes so far. Rockstar is a company where ~unauthorised~ and ~behind-the-scenes~ don't work together and probably never will. The company doesn't have relationships with the media so much as it has mood swings and demands - something alluded to a few times in Jacked without the hammer ever quite going down.Sam Houser bemoans GTA being remembered for Hot Coffee and Thompson and all those other lunatics. He's right, but Rockstar's silence is why books like this are written in the way they are. Grand Theft Auto, one of the greatest game series ever, surely deserves a little more than that."}