{"ref": "https://www.eurogamer.net/silent-hill-downpour-review", "date": "22 Mar 2012", "game_name": "Silent Hill: Downpour", "text": "Another sequel, another developer: this time, Silent Hill's ended up in the hands of Vatra Games, a studio based in the Czech Republic. Surprisingly, the team hasn't done that badly in capturing that distinctive air of festering Americana that the series requires, setting this strange tale of escaped convicts and dark deeds in a convincingly backwoods world built from derelict diners and menacing police cruisers. Silent Hill: Downpour looks like a Norman Rockwell painting created while the artist was feeling a bit glum about things: the town hall is barricaded shut and there are smoking potholes riddling main street. Konami's queasy franchise always put me in mind of a cockroach skittering over a drugstore soda counter. It still does.The story's not bad, either - or at least, it's enthusiastically told. Murphy Pendleton has a name that makes him sound like a kind of shoe (I appreciate that I made this point in a preview, but I haven't yet tired of it) and a face that suggests the presence of a young, smouldering Ted Danson. When the game begins, he's being moved between prisons after shivving a fatty in the shower room. Frankly, it's a mistake we've all made at times, and there are mitigating circumstances here, anyway: the incident was part of a combat tutorial.That said, there are serious questions hanging over Mr Pendleton as you head into the early stages of Downpour. Who is this guy? What did he do to get banged up? What became of his family? Did their names mean that they all sounded like shoes, too?While you're pondering all of this, the bus transporting Murphy between slammers takes a short cut through the town of Silent Hill, and pretty soon it's lying in pieces in a gloomy ditch. Murphy's problems, meanwhile, are only just starting, as the mist descends, the rain starts to fall - mist and rain? Is that meteorologically possible? - and reality begins to fragment. What follows is classic survival horror stuff: lumbering movement, fragile melee weapons like chairs, wrenches and - don't bother with them - beer bottles, puzzles about crank handles and coloured buttons, and enemies that attack from nowhere, this time en masse. Downpour kicks off in a surprisingly linear fashion. You spend a good deal of the game's first few hours working your way through some forgotten mines before the adventure's even properly shifting into gear, but once you finally reach the town itself, things open out considerably. Silent Hill pokes out of the fog, the whole map is suddenly available for exploration, your radio is crackling along nicely and there are even a series of simple, but strangely appealing, side quests for you to complete as you tackle the main objective. Set some birds free from their cages, eh? This feels like a metaphor for something or other. No, I can't quite put my finger on it.The puzzles aren't bad - although I refuse to believe anybody ever constructed a train line that only worked once the conductor had solved a colour sequence problem. But the stars of the show are the Otherworld sections, which generally hinge on chases as you are transported to that familiar chaos realm of barbed wire and rust and given the run-around by a weird glob of pure spectral malevolence. Corridors rotate, walls become ceilings and floors transform into waterslides; the Otherworld is stylish and wonderfully mechanical, like a Dark City ride made by the Thorpe Park people, and it's a bold choice to change the pace so much in a game that otherwise hinges on a steady, measured kind of progression.Elsewhere, as Gene Kelly always said, there's a lot of fun to be had with the rain. If you're caught out in it, the weird horrors of Silent Hill attack with increased force; there are more of them than normal on this outing anyway, and they'll be seriously aggressive whenever it's pissing down. This being survival horror, running is often as good an option as standing your ground. While Downpour is certainly a lot more combat-centric than previous Silent Hill offerings, with only five or six different types of foe to tackle throughout the course of the adventure, fightin' and fumin' still doesn't seem to be where the game's heart is truly at.The rakes, pistols and shotguns you're given all feel rather feeble, and there's a clear sense that the designers would much rather thread you through series of discrete levels - a town hall's records department, a monastery-cum-orphanage - while bombarding you with prison imagery, haunted postmen and a very serious man in a gas mask who wants you to see his uncommonly large hammer. At times, Downpour really feels like you're moving past a diorama section in a travelling show's ghost house. It has the same clockwork heart, the same pleasantly flimsy architecture.Over the course of the game, Vatra manages to tell what's actually a fairly intricate tale, which terminates, in true Silent Hill style, with a range of different outcomes. The final twist of the knife is rather predictable, but there are a few stand-out sequences along the way, such as puzzles that hinge on a UV lamp that can reveal secret markings and a genuinely brilliant set-piece involving a school production of Hansel and Gretel that becomes a little too convincing to be the product of student theatre alone. (Maybe the grown-ups helped.)There's a persistent problem, though, and it's a fairly fundamental one, given the genre: Silent Hill: Downpour isn't actually very scary.Why is this? Vatra's certainly trying hard enough, pushing you into spooky buildings, layering on the sudden shocks, and even naming a local landmark Bat's Lament in a last-ditch effort to dial up the heebie-jeebies. In fact, Downpour might be laying it on a bit too thick. Mines are nasty, aren't they? How would you feel about being trapped in a mine? How about a horrible old church? Scared yet? What if I hide in a closet and, like, cough a bit?In part, I suspect it's familiarity, too. You know what you're in for in a Silent Hill game by now, and if a developer takes too many risks, the fans get annoyed. The problem, there, though, lies with the fact that predictability - even when it involves barbed wire and head injuries - inevitably becomes warm and comforting, and warm and comforting things aren't that useful when you're trying to scare peoples' pants off.It doesn't help that Downpour is also gently undermined by a lingering cheapness that cuts against the game in some interesting ways. Part of the way in which really good horror works is by establishing a rock-solid sense of normality and then quietly fiddling with things on the periphery. Did that lamp just move? Did that door suddenly appear? Why is that ginger kid holding a load of creamed corn?Downpour struggles with all of this because, with its doors that close automatically a few seconds after you've entered a room, its flickering shadows as textures update, its wonky frame-rate, its screen-tearing, and its weapons that disappear from Pendleton's hands when he climbs a ladder (and pop back into existence when he reaches the top), it's already messing with its own reality by sheer accident. It has the naff sense of the uncanny that comes with cost-cutting - the dreamy disconnectedness of direct-to-video dramas and German soap operas. Vatra can't scare you because it can't actually control your experience enough in the first place. It can't make you truly believe in its world, with its recycled monsters and its simplistic button-prompt moral choices, so it can't then shake that world until your brain starts to rattle.With nothing truly thrilling in store, this is still a stoically acceptable video game. It may not shock you, but it can at least build a thick, oppressive atmosphere as the relatively clever plot keeps twisting and the grot and grime pile up and threaten to choke you. It can't handle fear - but it does a neat line in mild intrigue. Silent Hill: Downpour won't freeze you to your seat, but it will probably keep you playing to the end."}