{"ref": "https://www.eurogamer.net/app-of-the-day-incoboto", "date": "18 Mar 2012", "game_name": "Incoboto", "text": "Incoboto's iTunes blurb suggests a game made ~in the spirit of Ico and Portal~, but ~in the spirit of Pikmin and Majin and the Forsaken Kingdom~ would be more accurate (if not quite as catchy). There's something of Captain Olimar's intergalactic isolation in astronaut hero Inco - and his symbiotic relationship with Helios, the last remaining sun in the universe, echoes Game Republic's underrated puzzle-adventure Majin. Both games feature an innocent but powerful sidekick accompanying you through bleak, empty worlds, and both characters communicate in twee toddler-speak. Helios is the last of his kind because a mysterious evil corporation - is there ever any other kind? - has carelessly let the others burn out. Your job, then, is to gradually relight the galaxy, solving puzzles across a series of planetoids that are connected by sun gates. These lie dormant until you collect enough sun pieces so that Helios can power them. At first, the most interesting thing about Incoboto is its controls. You slide your finger left and right to move Inco, and either tap or swipe upwards to jump. Place another finger slightly away from the first and you can bring up a circular scanner to read descriptions of objects, or to search for hidden items. The screen sparkles to let you know their approximate whereabouts, and it's just a case of moving your fingers until the circle spins and glows brightly and the secret is revealed. You can interact with buttons and switches by tapping them when Inco is close enough, including signs from the corporation with slogans you can Tweet, and when you pick up an item, you draw a line to its destination to throw it. Though I applaud any iPad game that doesn't resort to virtual sticks and buttons, sometimes your finger will drift too close to Inco and you'll end up jumping when you meant to pick something up, or throwing when you meant to jump. This could well be down to my own doltish clumsiness, of course, but while the early puzzles are gentle enough for this to be a minor issue, I imagine even those with more dexterous digits will find the later conundrums a bit fiddly. But Incoboto is not a punishing game, and if you screw up, you're never left in a position where you can't just try again until you get it right. Executing a solution can occasionally prove as problematic as working it out in the first place, but there's no less satisfaction when it's done and you can move onto the next cluster of planets. Each new area brings new objects to interact with or fresh concepts to master, while the difficulty curve is perfectly judged. And, if you take time to read the corporation's increasingly desperate messages and the tragic text logs attached to the skeletal remains that litter each area, you'll discover a rather touching little parable. The story doesn't intrude on the puzzling, but it's there if you want it, quietly tucked away in the background. As with everything else in this sweetly unassuming adventure, it may be inessential, but it's surprisingly worthwhile.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}