{"ref": "https://www.eurogamer.net/blades-of-time-review", "date": "16 Mar 2012", "game_name": "Blades of Time", "text": "It wouldn't be hard to write Blades of Time off as a botch of a video game. Its fantasy plot is entirely forgettable, its rousing and heroic score is mixed so weirdly that it often sounds like it's filtering in from an upstairs bedroom, and its voice acting is the kind of thing people lose Equity cards over. Its character models are dead-eyed and endlessly recycled, some of its central mechanics are implemented with staggering awkwardness, and several of the game's environments feature particle effects of such bizarre over-ambition that they reduce the frame-rate to single figures just when things are starting to get exciting.There's a lot that's wrong with Blades of Time, then, but if you fight through the drab early levels, there are also a few things that are kind of right about it too. This isn't a game that you'd necessarily want to go out and buy. OK, it's probably not even a game that you'd actually choose to rent. But if you were, oh, I don't know, left it in the will of an eccentric uncle, say, it would probably be worth taking for a spin before you traded it in.With that ringing endorsement still echoing in your ears, let's get down to basics. Blades of Time is the 'spiritual successor to X-Blades' - a turn of phrase that means the developers have ditched the cel-shaded art, changed a lot of the story elements, but left you controlling a mirror-world version of Ayumi, the pants-and-bra hack-and-slash heroine whose character design barrels straight past the point where she might be sort of sexy and heads deep into that strange emotional territory where all you want to do is get her a cardigan. She must be freezing.While you're getting her a cardigan, you'll probably also find yourself thinking that it would be quite nice if she'd shut up now and then. It would be quite nice if everybody would shut up, in fact. Blades of Times' generic fantasy storyline - you're stuck somewhere that I think is called Dragonland (nice work, guys) and that's about it, really - unfolds in a ceaseless torrent of stagey, horribly stilted monologues as Ayumi ponders the existential crisis she finds herself in, or just chatters mindlessly about how dangerous she is while she waits for the next door animation to complete itself.The rest of the cast isn't much better - think Paul Hogan co-opted into a prison stage play based on Pirates of the Caribbean and you won't be too far off - but at least the cut-scenes are skippable, and I even found a handy slider in one of the menus that allowed me to turn the vocals down so that, just like the music, it too sounded like it was filtering in from an upstairs bedroom.So what does the game get right? Combat, sort of. This is one of those hack-and-slash efforts that starts off by giving you a rather weightless standard attack, but then steadily builds on that wobbly foundation over the space of the opening few levels until you've got a system that's actually quite fun to use. You get a sliding dodge move, for starters, which is always money in the bank as far as I'm concerned, and while that's bedding in, you'll begin to construct a growing stable of magic blasts and area effects.These are slowly charged up by laying on standard damage, and they then offer various levels of particle-heavy chaos as you knock enemies back in torrents of flame, say, or force huge ice crystals from the ground beneath them. None of these spells are particularly new to games, of course, but they're undeniably fun to use against the limited cast of foes, as is a contextual counter attack that allows you to pull off massive finishers if you can time a squeeze of the right bumper just so when you're facing in the correct direction.Even here there are problems, though. Certain ranged enemies require shooting, which puts you into a world of horrible aiming and feeble ballistics (although a rocket launcher you're occasionally given is much better). On top of that, the central Time Rewind mechanic is poorly explained and annoying to use. Rather than undoing your mistakes, it allows you to create active clones of yourself, PB Winterbottom-style, but it also means that you're always guessing at timings and often hoping for the best. This is fiddly in combat where certain shielded enemies require two of you to take them on at once, but it's truly excruciating in the puzzles - most of the puzzles are excruciating, actually - as you create duplicate Ayumis to weigh down switches again and again and again. And again.If the puzzles are no better than the voice acting, at least Blades of Time tries to break up its combat with a little variety when it comes to level design. The first few environments are pretty in a rudimentary sort of way but also fairly bland - they look like sets for a direct-to-video caveman film that might star Lou Diamond Phillips or Elizabeth Shue, perhaps. Later offerings show a willingness to experiment, however. There's a desert world basking under a sky filled with twinkling galaxies in which you have to stick to the shade or risk burning alive, for example. Or perhaps you fancy visiting a stage made of chunks of floating coral where you're gifted a limited ability to fly.Get that far, and you'll probably have developed a kind of Blades of Time Stockholm Syndrome, anyway. There's something charming about the way the game's lavished attention on all those door animations, say, while its bestiary is small and unexciting and endlessly repeated. There's something endearing about invulnerable enemies dropped into the action to create tense stealth bottlenecks, but whose AI is so bad they frequently end up falling off cliffs and killing themselves before they've laid a claw on you. Throw in Outbreak mode, which features a suite of simple co-op and versus online challenges, and you've got a wonky B-grade charmer of sorts.After the first few hours of Blades of Time, I feared the worst. By the time I reached the end, I could see why this scrappy series has at least a few die-hard fans. Maybe, if you've got an eccentric uncle somewhere who's feeling a little queasy these days, you'll find yourself coming to the same conclusion."}