{"ref": "https://www.eurogamer.net/app-of-the-day-mass-effect-infiltrator", "date": "13 Mar 2012", "game_name": "Mass Effect Infiltrator", "text": "For a certain section of the gaming community, touch-screen games are a confusing and alarming thing. ~No buttons! No sticks! What devilry be this?~ they cry, in Vincent Price voices. Battle lines are drawn. Everything over there can't possibly be a proper game, because proper games have complex controls you can press and feel, not just simple taps and swipes.This in turn leads to a lot of wasted time and energy as developers try to cater to this audience by making 'proper games' for touch-screen devices. They usually fail dismally, their square pegs jammed awkwardly halfway into a round hole, which in turn leads the aforementioned naysayers to nod sagely and pull 'told you so' faces.One of the few developers to crack the hardcore touch-screen nut is Australia's IronMonkey Studio. They're the ones who brought Dead Space and Mirror's Edge to iOS devices, and now they've done the same for Mass Effect.You're playing as Randall Ezno, a Cerberus operative who captures aliens and brings them in for grisly experiments. Not long into the game, he realises this isn't a very nice way to make a living, and turns on his paymasters. This involves a lot of shooting.What IronMonkey does so well is take the basics of a hardcore shooter and then boil them down to simple inputs that will work on a mobile, dressing them up with the sort of fancy pants graphics that gamers expect from a console release.Virtual sticks control Ezno and the camera as he walks around, but when the action kicks off, things tighten up. Stand next to cover and he ducks into it. Now, swiping left, right and forwards make him automatically roll to fresh cover, and it's through this mechanic that you move onward. Enemies in weapon range can be tapped to target them, making Ezno pop out and start firing. You then guide his shots with your right thumb. Biotic powers and your arsenal are assigned to pull-down menus at the top left and right corners of the screen.It's simple but surprisingly effective, and the beefy presentation gives it a muscular kick. That's provided you don't get too far ahead or let enemies flank you. As long as the action is in front of you, the system is great. If you have to start dealing with threats from all sides, it falls apart somewhat. Thankfully, each battle is a self-contained checkpoint, so replays aren't too onerous. As a polished shooting gallery built on the most basic inputs, it manages to tick both hardcore and casual boxes. No mean feat.Thanks to the simplistic nature of the action, success is measured not only by survival but by style. Chaining kills together and mixing up your weapons and abilities earns more credits than a run of duck-and-cover headshots. Credits, in turn, unlock and upgrade more features - better guns, stronger armour and the like. The lazy can buy credits using expensive in-app purchases, but the game design should be commended for making this an optional short cut rather than practical necessity.Where Infiltrator struggles most is in its vague connection to the blockbuster franchise that spawned it. The dramatic pull of the Reaper invasion, which forms the backbone of the entire Mass Effect saga, is barely felt here, and Ezno himself is joyless company. The sort of generic grizzled space merc we've seen a dozen times over, he's a poor addition to the character ranks of a series built on story. Take the same game, but let us control Garrus during his time as the vigilante Archangel, and you'd have something far more satisfying.Infiltrator's most interesting feature is the way it ties in with Mass Effect 3's Galaxy at War meta-game. Intel collected in Infiltrator can either be traded in for game credits, or uploaded to your Mass Effect 3 game, increasing your readiness rating for the final battle against the Reapers. For fans who want to keep their percentage topped up while on the move or players who have no taste for multiplayer, it's a useful and forward-thinking feature.While it wobbles occasionally as it tries to straddle both sides of the casual/hardcore divide, Infiltrator ultimately succeeds because it allows each faction to claim victory. The hardcore get to point and wave at a recognisable console experience, while the casuals can quietly point out that the only reason it works is because it largely relies on inputs no more complex than the average physics puzzler.For a spin-off from a series that's all about uniting rival factions for the greater good, that's a rather appropriate sort of success.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}