{"ref": "https://www.eurogamer.net/app-of-the-day-ziggurat", "date": "9 Mar 2012", "game_name": "Ziggurat", "text": "Good music can make you feel nostalgic for something you never actually experienced, and now the best bite-sized mobile games are doing the same. The App Store has a knack of repackaging your own pixelated memories and presenting them to you fresh, giving you half-remembered masterworks that, in many regards, manage to surpass their inspiration. Ziggurat's the latest to play that particular game, a three-minute bubblegum classis that unearths a single-minded score attack gem from 1993 that never actually existed. It's partly the work of Tim Rogers, the verbose essayist of Kotaku and actionbutton.net (and a man whose taste in lurid tracksuits has brightened up many a queue at industry trade shows). So it's surprising that when he turns his hands to development the result is cogent and wonderfully blunt.Rogers typically takes a few thousand (and typically brilliant) words to make a point, but his game can be summed up in one very short paragraph. You're a 16-bit hero, stuck to a fixed point at a mountain's peak, and with your low-slung gun you must see off the growing hordes of one-eyed robots that bounce menacingly up the slopes.But such a simple summary skips over the many, many details that make Ziggurat one of the finer simple score-attack shooters available on the App Store. It boasts a crisp evocation of the golden age of the SNES, Genesis and PC Engine, delivered with an edgy twist; huge sprites heave across its heavenly backdrop while a swift parallax scroll of cloud waves that pulse past the static mountaintop, the slowly setting sun a visual barometer of how long you've survived for. The high-tempo play is reflected by the insistent chug of a chiptune soundtrack that breaks into wailed digital solos just as your fingers begin to get busy, the pitch seeming to rise in tandem with the number of enemies on screen; then there's the deafening siren and blood-red screen that flashes when your number's finally up. And then there's the fine-tuned mechanics that really make Ziggurat sing. Your one line of defence (and it is defence rather than attack - you're quickly overwhelmed in the game's solo score-attack mode) is a gun that mixes and matches from the finest elements of gaming's arsenal. It fires off a charge shot just like dear old Samus', though the resulting glob of energy paints an arc across the skies, adding an extra layer of judgement to the resulting fireworks. Our hero's weapon swings with the satisfying weight of Master Chief's assault rifle, something told in his gently heaving shoulders.It's a gun that kick-starts some messy explosions. Binary Domain recently proved that, as much fun as it is tearing through flesh and blood, it can be an awful lot more fun tearing through the servos, plastic and metal of our electric friends. Ziggurat proves that point further, its enemies exploding in showers of metal viscera that can in turn initiate a screen-filling chain reaction.Your one-eyed opposition are a characterful bunch, too. They come in different sizes and colours, each new flavour with its own identifiable attributes (and without wanting to sound racist, those orange guys are absolute jerks). High-level play is about deciphering who on-screen is about to do what - a little like Geometry Wars or Robotron, in other words. That's the kind of company that Ziggurat keeps, and the kind that it deserves.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}