{"ref": "https://www.eurogamer.net/mass-effect-3-review", "date": "6 Mar 2012", "game_name": "Mass Effect 3", "text": "Her name is simply Soldier. She looks to be in her mid-twenties, pretty with short dark hair. She's pleading with a clerk outside the human embassy on the Citadel, the vast and ancient space station that houses the Galactic Council.Soldier married an Asari, you see, but both have been called into active service. Soldier wants to track down her wife's family, so their daughter can be sent to stay with them rather than be taken into care. Soldier's family won't take the little girl. They disowned her for marrying outside of her species. The desk clerk - another Asari - is sympathetic but held back by bureaucracy. Ever since the Reapers attacked Earth, the Citadel has been flooded with refugees. The paperwork is going to take some time.Almost without realising it, I check in on Soldier every time I'm at the Citadel. I loiter and eavesdrop to see how she's getting on, if they've managed to cut through the red tape and get her daughter to safety. Eventually, I overhear the Asari clerk happily telling Soldier that everything has been arranged. Soldier is overjoyed. So am I, in a weird sort of way. I never even interacted with Soldier, but her story felt important all the same. It's a little splash of happiness in a story painted in thick strokes of dread and hopelessness.It's the sort of incidental detail that BioWare does so well, and Mass Effect 3 is a game full of incident. The Reapers, synthetic executioners tasked with wiping advanced biological life from the galaxy, have returned in force and have sunk their enormous insectoid claws into Earth. At the same time, rogue human-supremacy organisation Cerberus is up to something, the Quarian and the Geth are having their own little war at the edge of space, the Galactic Council is mired in compromise and backstabbing and, quite frankly, everything has gone to s***.~Ultimately, it all comes back that journey, that personal adventure dating back to 2007.~In an industry increasingly obsessed with long-term franchises, annual updates and spin-offs, this is that rarest of things: a final chapter. The end times have come.This finality has freed BioWare to dig deep into its bag of tricks to craft an epic adventure, drawing from many genres, utilising multiple play styles, but always kept on course by a ruthless focus on character and story.What lifts Mass Effect 3 above its AAA peers is that this is the final reckoning for your character, the climax of your story, a pay off half a decade in the making. As the tale unfolds, it becomes clear that BioWare has played for the long term, as decisions you made in 2007 - both major and minor - are not only referenced but seamlessly woven into the ongoing drama. Rather than allowing the big choices to send the story off down wildly diverging tangents, they instead colour the context and history of your adventure. There were characters in my game that have been five years dead for other players. Seemingly minor moments from DLC adventures that others won't have seen come back to haunt me.That's not to say the game is impenetrable to newcomers. Squad member James Vega, a disappointingly generic space marine type, is also new to this whole ~saving the galaxy~ deal and it's through him (and many pages of codex entries) that the broad strokes of the Mass Effect story so far are filled in for those playing on a new profile. The game is flexible in many other ways as well, offering different variations of difficulty and gameplay emphasis depending on your preference. Whether you want a thoughtful character-driven adventure, a balls-out third-person shooter or the full role-playing epic experience, there's a setting that accommodates you. And that's before you get into the different character classes, the reputation system and the different squad combinations that can all nudge the experience in a myriad of ways. That the game doesn't pull itself to pieces by trying to move in so many directions at once is down to the solid core inherited from Mass Effect 2. In terms of evolution, this is a refinement rather than the radical reinvention that followed the ambitious but clunky first game.Combat is essentially unchanged, with few new tech or biotic abilities, or sweeping changes to your arsenal. Movement is more fluid than before, and it's clear that for the combat the Gears of War playbook has been closely studied. Sprinting, vaulting, blind-firing - all suggest a more arcade based style of play, to the extent that the combat sections of this (nominal) role-player are arguably better than many pure-bred shooters.The game's non-shooter roots do poke through occasionally, though. The cover system is a little too sticky, and sometimes runs into trouble by mapping too many context sensitive movements commands to one button. The addition of melee moves, via the new Omniblade weapon, makes face-to-face encounters more survivable, even if the camera doesn't always want to play along in close quarters.Any frustration that might arise from these wobbles is eradicated by an excellent autosaving checkpoint system that never leaves you retracing more than a minute or so of gameplay. Across over fifty hours of gameplay, I made less than ten manual saves. It's that efficient.Perhaps more important to fans, some of the missing depth from the original Mass Effect has been reintroduced, striking a pleasing middle ground between the intricate but unwieldy inventory and squad management of the first game and the bare bones options of the second. Companions can only equip certain weapon types - Liara will only use pistols and SMGs, for example - but you're free to choose which weapon, which modifications and how to spend their skill points. Depth also comes from a wide mesh of optional activities and levelling systems that offer additional ways to tweak your character stats. Intel found in the field can be used to offer permanent boosts to weapon strength, power levels, shields, health and more. Winning the trust of squad members unlocks bonus abilities, of which one can be active at any time. Yet Mass Effect is about nothing if not scale, playing the personal drama of Shepard and your crew off against threats and plots on a universal stage. Here, too, progress has been made. Gone is the tiresome planet-scanning of old, replaced with a more streamlined system that allows you to detect useful resources using a radial pulse, at the risk of attracting Reaper attention.Even the over-arching structure of the game feels more flexible and natural, as the galactic war background gives import to almost every task you undertake. Most RPGs suffer from establishing some grave threat, then encouraging you to spend hours studiously ignoring it while you undertake unrelated side quests.Here, with the galaxy in the balance, is a threat so grave that - as Tesco reminds us - every little helps. Your core mission is simply to amass as much support as possible, so whether you're helping former Cerberus scientists defect to the Alliance, tackling a Reaper head on or simply mediating a heated argument about the best way to defend the Citadel, there's some tangible benefit to be had that pushes you closer to your goal. It gives the game a propulsive forward momentum, only slightly diminished by a distracting lack of quest tracking that can leave you wandering the various star systems, looking for a specific planet to fulfil some secondary objective.~Gone is the tiresome planet-scanning of old, replaced with a more streamlined system that allows you to detect useful resources using a radial pulse, at the risk of attracting Reaper attention.~And then there's co-operative multiplayer, an idea that should have no place in a role-playing game, yet proves to be the perfect side dish. Made up of intense ten-wave survival matches played across six excellent maps, it's a ferocious offering that makes for an imposing challenge even on the lowest difficulty. Thankfully, there's not a grind in sight, as XP arrives in big generous chunks and levels rise rapidly. It's the blend of character classes and abilities that gives it longevity, tempting you to experiment with skills outside of the story.It's also where you finally get to play as races other than humans, with Krogan, Turian and Drell forces each adding their own flavour to the mix. A four-player skirmish with a maxed-out group of skilled players is a sight to behold, as biotic and tech abilities smash into brutal firepower for some spectacular showdowns. It's doubtful that there's enough meat to make it a multiplayer mainstay for the very long term, but as an optional extra in a game that already offers an embarrassment of riches, it's hard to complain.From third-person shooter to conversation-led adventure, from resource hunting minigames and role-playing skill trees to multiplayer battles, Mass Effect 3 attempts to be all games in one, and does a surprisingly good job of pulling it off. No single element truly excels, but together they create an experience that engages on multiple levels. Everything ties in to something else, creating a dizzying web of interlocking metagames that encourage you to explore every corner, undertake every mission and exhaust every conversation.The gathering of war assets and ~galactic readiness~ is what ties it all together, the ongoing challenge that sees everything from a single Asari commando unit to an entire species fleet thrown into the pot for the final showdown against the Reapers. You can even import top tier multiplayer characters, adding an extra layer of crossover appeal. Without several playthroughs, it's hard to tell what impact all this has on the ending you get, and it can become a little abstract as the hours tick by, but if nothing else it provides much needed context and meaning for the various menial tasks along your journey.And, ultimately, it all comes back that journey, that personal adventure dating back to 2007. As the game escalates to its apocalyptic ending, BioWare certainly isn't shy about banging the melancholy drum. Pretty much every character you've ever met returns at some point, and there are plenty of pauses in the action for bittersweet vignettes. There's humour too, with knowing nods to Garrus and his calibrations, Shepard's dancing, and memories of dubiously lengthy elevator rides.The dramatic peaks and troughs resonate all the more since these aren't sterile cut-scenes from a pre-determined story, but emotional beats in a tale that's been yours to tell. Entire species will be wiped out, beloved allies will fall, and anyone who has invested themselves in this saga and its richly drawn cast will get a lump in the throat at some point.Just before the final push against the Reapers on Earth, I return to the Citadel one last time. Soldier is still standing there. Her conversation has looped around and started over. Her daughter's fate hangs in the balance once again. For a moment the strings are visible, BioWare's puppeteers caught in the spotlight. By that point, however, I'm too far gone into the fiction to be pulled out by such a stumble. She'll be OK. It's the galaxy I have to worry about.As with any game that dares to be ambitious, deconstruct Mass Effect 3 into its constituent parts and of course there are flaws, but taken as a whole this is arguably the first truly modern blockbuster, a game that transcends the genre boundaries of old and takes what it needs from across the gaming spectrum in order to finish its story in the most compelling, thrilling, heartbreaking way possible. Few gaming sagas come to a definitive close, but this one signs off in breathtaking style."}