{"ref": "https://www.eurogamer.net/app-of-the-day-allied-star-police", "date": "27 Feb 2012", "game_name": "Allied Star Police", "text": "Remember the moment in Advance Wars when you get your first Medium Tank? Of course you do. Everybody remembers this moment. So there you are, working through the campaign, and for a while you're pretty pleased with your starter tanks: they're chunky and brightly coloured, and they can chew through infantry in a few rounds. Then, you're finally let loose with the bigger model. It trundles onto the battlefield and just decimates everything it sees. You feel almost guilty using it, but that doesn't stop you.The reason I mention all that is because Allied Star Police has its own Medium Tank Moment (MTM). You're getting stuck into the enemy, you're moving towards their base, but you keep getting held up along the way. That's when you notice a new icon's flashing away in your unit tray: WCSV. It's the standard tank made a little more, well, memorable. It's a gigantic metal killing machine, and it's a pleasure to unleash it.ASP is a wonderfully straightforward lane-attack strategy game, and it's absolutely filled with these instances. There aren't many units, but they're all beautifully crafted and bristling with guns, and each new one seems to be expressly designed to make the older model feel a little toothless. The enemies come at you in never-ending waves, plasma bolts and bullets sing through the air, and although you've only got a handful of special powers they're all worthy of the name, allowing you to grant your forces brief windows of immunity, say, or letting you fling bombs onto the battlefield with a single imperious prod.The really wonderful thing about the game isn't the balancing, though, or even the gleaming old-school sci-fi art design. It's the backstory.ASP was created by Owain Weinert, a 10-year-old Leukaemia patient who was put in touch with PopCap through the Make-A-Wish Foundation. Owain really wanted to make a video game, and he ended up visiting the company's Seattle offices, where he busted out PowerPoint and talked the development team through the design for his project, one slide at a time. After a little negotiating, PopCap managed to create the game in a single week, and it was released on iOS in July of last year as a free download.It's a lovely story, and the best part, I think, is that the finished product is really good fun. With its alien armies, endless explosions and chugging soundtrack, it's exactly the game you'd want to build if you were 10 years old, and it would be well worth your time even if it didn't come with such a moving history.Owain's still undergoing chemo in the US, and, as of January, has apparently been able to start spending a little more of his time back at school and out of the hospital. His game, meanwhile, continues to ride high in the App Store charts and has a five-star user rating.Not bad at all for a first-time designer.You can find out all about the Make-A-Wish Foundation on its website. If you're interested in learning a bit more about blood cancers and leukaemia, you might want to check out Anthony Nolan.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}