{"ref": "https://www.eurogamer.net/app-of-the-day-nfl-kicker", "date": "26 Feb 2012", "game_name": "NFL Kicker!", "text": "Flicking games have no real right to be interesting or compelling. They're enormously repetitive, they rarely have any hidden depths beyond minor quirks in their physics systems, and the designers often seem to assume that players will give up once they hit a fairly low threshold of skill and just move on, so higher plains of achievements are usually just that: plateaus where further success is down to maintaining concentration rather than exhibiting any actual skill.Well, some of that's true anyway. Most of it, however, is the bitter rambling of a man who has plunged more than 50 hours into Flick Kick Football by PikPok on various iPhone, iPad and Android handsets and harbours deep, deep regret.I've been on the lookout for a suitable replacement for Flick Kick Football ever since I set my current high score (1354 - yes, I know) and deleted the game from my phone much as a guilty alcoholic pours vodka down the sink in the morning, before instructing Eurogamer's systems manager to reconfigure my PC so I can't access the App Store page to redownload it. As one of my friends on Twitter put it the other day, ~I'm not allowed flicking games any more. I'm not mature enough to stop playing them.~ I heartily sympathise, although I am having another vodka.Full Fat is another studio making flicking games (if you haven't quite grasped the concept, think about how you flick a ball of paper on your desk with your index finger - they're all like that) and has put out quite a number, including Flick Golf, Zombie Flick and a pair of licensed NFL games - NFL Flick Quarterback and, of course, NFL Kicker. I'm not that fond of any of its other work (Flick Soccer is pretty good but I much prefer the physics in Flick Kick Football), but Kicker now has its studs in me.You don't need to know anything about ~American football~ to get into it - the idea is simply to hoof the ball downfield and use a combination of a good starting trajectory and frantic Curling-style rubbing to direct it at various targets. These can simply be the gap between the posts, or targets in the corner of the field, or vertical shafts of coloured light, or even the actual uprights themselves. A generic experience system allows you to level up and unlock these variations the more you play.The reason it works so well - the reason that any flicking game works well - isn't the core flicking action or even hitting the back of the net: it's those few seconds when the ball hangs in the air. It's all about watching it arc through the game's difficult-to-parse approximation of a 3D world, bending with the increasingly strong wind, and then moving closer, ever closer to your target. NFL Kicker gets this completely right. I can still taste it as I type these words.Sometimes you play the perfect session. Often you go back. Most likely, you go back so often that before long you exhaust the tactical and physical subtleties of the whole enterprise and are reduced to mechanically repeating the same predictable activity for hours on end, as your phone or tablet gets hotter in the palm of your hand, and you wonder how it really came to this. The ball hangs in the air. You miss. You hit Retry. You hit Retry. You hit Retry.Maybe send help.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}