{"ref": "https://www.eurogamer.net/app-of-the-day-orbital-hd", "date": "22 Feb 2012", "game_name": "Orbital", "text": "One of the enjoyable things about seeking out content for App of the Day is the freedom it offers - there's no review code to hustle after, and rarely any demand to satisfy the curiosity of the hype machine. Instead we can take recommendations from friends or just go browsing for ourselves, check the lie of the land, and then come home with the good news. Through a combination of price point and limited visibility, there's simply no such thing as yesterday's news on the mobile platforms - just good games.Originally released in 2009, Orbital HD is a perfect example of this philosophy, and the game's three modes offer gentle twists on what is a deceptively simple yet compelling and thoughtful proposition: a cannon rotates idly back and forth at the bottom of the screen, while a tap of the screen fires off a shot at your choice of trajectory.The charge it emits travels with a fixed degree of momentum so there's a limitless number of choices for placement - fire directly towards the top of the screen and have it glide back down a little, or launch with a ricochet off a side wall to have it nestle delicately at the top of the screen.Once each projectile reaches a state of rest, it blooms into a circle. Two events limit the size of this expansion - its proximity either to the edges of the screen or another circle that's already been played. At the point of contact, the growth stops and the number three is placed inside it. In order to destroy each circle, it must be touched three times via subsequent shots. These of course, create new circles of their own.This interplay of ricochets from circle to circle adds a level of intriguing complexity to a control scheme that often finds itself the subject of derision. It's a game of celestial snooker, one in which the slightest mistiming of your shots can send an otherwise-marvellous shot directly down through the baseline that sits above your cannon, ending your game.Likewise, an ill-considered shot on the playing area can leave your projectile at rest in the wide open where it expands to a grotesque size, destroying your carefully laid plans. This combination of complexity and cack-handedness leads to a constantly evolving strategy where it's often just as important to make a virtue of your failures, as it is your successes.The Gravity mode adds a degree of attraction to your shots and different sized circles on the playing field warp the space around them, arcing your charge towards and around them. Pure mode removes this effect, while Supernova provides a target line for your shots (albeit with a requirement to destroy each circle with five touches, rather than three).Orbital HD is an unusual game for mobile devices in that it satisfies the quick-play desire as well as that of a deeper and more considered session. Your failures will leave you gnashing your teeth, and yet they're always of your doing and a learning exercise. The reward for any frustration you may feel is a depth that belies the surface simplicity of the game and makes it a compulsory purchase.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}