{"ref": "https://www.eurogamer.net/reality-fighters-review", "date": "21 Feb 2012", "game_name": "Reality Fighters", "text": "I've been showing off PlayStation Vita to my family. Dad likes a bit of Xbox, mum is conducting another affair with Professor Layton, and my 10-year-old niece is an evolutionary miracle: half-human, half-iOS.  As such, I'm always keen to gauge their reactions to any notable breakthrough in gaming, away from the stage-managed, on-message, cut-and-paste hype of The Industry. Beaming with 'look at me' novelty, Reality Fighters seemed a good place to start. And it duly produced ~ooh~s and ~aah~s in all the right places as I swiftly transformed mother into a ballet-dancing kung fu master and had her striking wildly at her Santa coat-and-skirt-wearing son in my parents' kitchen sink. It puts a new spin on child abuse, if nothing else. Vita has been created as the jack of all portable gaming trades for developers to master - an exercise in exorcising the ghost of Dual Shock that haunted PSP, and in meeting gamers' expectations of what a cutting-edge handheld should be like in 2012.   While there's a bit of front-and-rear touch japery chucked in, Reality Fighters exists mainly as the launch day standard-bearer for augmented reality. Using both cameras and motion sensors, the game lets you turn a mug shot of anyone into a fantasy brawler and have them do battle anywhere. That might be in one of the game's 360-degree panoramic photos; a 3D arena you've created capturing photos that Vita knits together; or the live camera feed itself (i.e. wherever the back of the console is pointing).It's easy to see why the game has been heavily pushed during Sony presentations over the past six months. But the question was always whether it would amount to anything more than gimmickry.The first thing to say is that, as a fighting game, it has a lot more to it than I was expecting. At its heart, Reality Fighters is a traditional one-on-one, 2D fighting game, with two strengths of punches and kicks, grabs, quarter-circle special moves, Ultra attacks and combos. There are 15 fighting styles to choose between, each represented by a character on the fighting roster, from kung fu and muay thai to sorcery and ballet. Each character has a pair of Ultra attacks involving some genuinely amusing visual set-pieces. And if you complete the Story mode you unlock weapons for melee combat, and vehicles: items that sit in the background (everything from a burning ball of lava to a washing machine), activated by R + square when standing in front of them. Consciously breaking from the genre norm, Reality Fighters doesn't want you to form a deep, psychic bond with any particular character. In keeping with the general ADHD design philosophy, if you treat it like a regular fighter, you're doing it wrong. Customisation is all. This begins with character creation. Take a headshot (either of an actual face or a front-on photo), and it's stuck - often with uncomfortable accuracy - on a generic body. Then you literally shape the character - male of female, fat or thin, weak or strong - and dress them, with hundreds of items available for every part of the body, most of which require unlocking using points quickly accumulated in-game. There are also 20-odd melee weapons - a frying pan, a garden gnome, a fire extinguisher, etc. - to choose from, and 11 vehicles. Entrance and victory ~combat lines~, meanwhile, can be recorded via Vita's mic to play out -rather tinnily - at the appropriate moments.So far, so fancy dress. But, whichever mode you're playing in (Story, Time Attack or Survival), you're given the option between every match to customise - an explicit offer to change the nature of your fighter, their weapons and fighting style. In Reality Fighters, characters' abilities are in theory affected by what they wear. There are kick, punch and weapon bonuses to be gained, and head, chest and leg defences can be boosted, all based on the combination of kit picked from a wardrobe that would humble Lady Gaga. I say ~in theory~, because ~in practice~ much of this tinkering is rendered redundant by a spectacular lack of challenge in single-player. Put simply, for all the moves, all the styles and all the options, I was able to stroll through the Story mode on my first attempt almost exclusively using a combo of light and hard punches. It quickly became apparent that Story is little more than a sideshow novelty in which Mr Miyagi - yes, that one, licensed from the Karate Kid movies, though not the original actor - narrates between matches (later becoming a playable character himself).Compounding these troubles, it turns out you can't actually adjust the difficulty setting for it - whereas in Quick Fight there are seven options, ranging from Very Easy to Impossible. Huh?Not that, it should be noted, the level of difficulty seems to make a great deal of difference either way. While AI fighters are notably more assertive and aggressive on higher settings, even on Impossible they remain weirdly vulnerable to a simple standing light punch. It's a shame, because the character models are well animated and there's a palpable, satisfying sense of contact when you land a blow. But when there's little incentive to do that, what's the point? There's an issue with the environments, too. Panoramic landscapes - of famous places and landmarks from around the world - are a nice idea in principle. Using Vita's screen and motion sensors as a virtual viewfinder, you can move around each area in 360 degrees and place characters anywhere to fight. And sometimes, if you're lucky, they might even stay in the right place for the duration. All too often, sadly, something - whether the software or the sensor, I can't say - goes haywire and fighters shift out of position. The only way to compensate is to move Vita after them, meaning you're effectively caught in two fights simultaneously: in-game and against the Vita itself.Either way, as a means of driving players towards the AR options it's terrifically successful. There are three options here: AR with marker card, without and DIY arenas.Basically, forget everything that doesn't involve using a card, as it's the only solution that works reliably. And it does work very well. (Card-less AR is at least worth experimenting with at great heights - e.g. from a bridge or a tall building, where fighters scale accordingly, becoming virtual colossi bestriding multi-lane highways and housing estates, Rampage-style.)When a marker is deployed (you get a pack of six with Vita), at last there is something Vita can use to locate itself properly. This means both less positional freaking out and the ability to move in close to and around the fighters, which is impressive in practice. Once I started playing the game exclusively this way, I began to enjoy it for what it is. Despite some surprising efforts to make this more than a knockabout, fly-by-fight brawler, Reality Fighters is never able to lose the novelty tag. But there's little evidence that it wants to - and no harm in that.It's a casual fighter designed to encourage experimentation, silliness and smiles. It practically begs you (OK, just me) to take a photo of Lady Gaga, dress her up in half a banana, turn the console on its side to enter photo mode and rattle through various poses and filters, Instagram-style, until you get that perfect Kodak moment to share.  Although anything more than short-term enjoyment is stymied in single-player by the hopeless AI, things pick up in multiplayer. While infrastructure isn't working at the time of writing, ad hoc local multiplayer is - and it's very quick and easy to set up between two Vitas with the game. Forget about tactics: it's about pitting your silly custom character against someone else's silly custom character in a giggling orgy of button-bashing. It's not big or clever or deep, but it is fun if you take it for what it is.   This isn't Street Fighter, it's Oxford Street Fighter - and anywhere else for that matter. It's a lightweight launch experience that will be enjoyed least by serious fighting game fans and most, I suspect, by families, like mine, where everyone can get their face in the game and have a right old hoot over it for 10 minutes here and there.If you're looking for a gaming experience to keep you engaged for weeks to come, then, this reality may prove a sobering one. But if the engaging novelty of the experience appeals, there are laughs to be had if you're prepared to tolerate the technical eccentricities."}