{"ref": "https://www.eurogamer.net/jagged-alliance-back-in-action-review", "date": "17 Feb 2012", "game_name": "Jagged Alliance: Back In Action", "text": "Up until very recently, if you'd told someone who was a PC gamer in the mid-nineties that 2012 would see remakes of both X-COM and Jagged Alliance, they'd have laughed at you. Before turning misty-eyed and staring into the middle distance while alternately mournfully singing Oh Danny Boy and muttering something about time units, probably.Here we are, though. Firaxis' new version of the incomparable X-COM is due later this year, and last week saw the release of Back In Action, a remake of 1999's turn-based strategy game Jagged Alliance 2 and the first new, official game in the series since then.There have been expansion packs, there have been multiple abortive attempts to make Jagged Alliance 3, there has been an unofficial sequel (Hired Guns, The Jagged Edge) and there have been oh-so-many mods. Back in Action, though, is a re-imagining of the second game's tale of hired mercenaries liberating a fictional country from its despotic queen. You play the essentially unseen commander of these mercs: telling 'em where to go, who to shoot, what to shoot them with, what gear to buy and, when you can afford it, hiring new contract killers to join their ranks or replace those whose messy deaths have been the result of your poor planning.What Back in Action doesn't want to be, though, is an obtuse and slavish homage to an old strategy game only played by people who are now in their thirties and think all that Call Of Battlegears stuff is a bit too noisy and meat-headed. To that end, it has - somewhat controversially - junked the turn-based controls and instead become a real-time affair. The isometric-style viewpoint remains, the non-linear campaign remains and all the characters (replete with original voice acting) remain. The idea is to do it better, and to do it in a way that's arguably more appealing to new players, rather than simply to do it again.Back in Action is a scrappy affair though, both as a tribute and as its own game. Plain to look at, crude yet fussy of interface, and saddled with AI that falls somewhere between remote control vacuum cleaner and stoned cat, Jagged Alliance: Back in Action doesn't quite meet its own noble ambitions. Yet it still manages to feel meaty and thoughtful.Most of this stems from the management of your mercenaries: recruiting, controlling and upgrading a motley crew of hired guns, each with their own specialisms and weaknesses. You'll need stealth guys, you'll need explosives experts, you'll need medics, you'll need someone who can repair broken weapons and most of all you'll need men and women who are really, really good at shooting people.It's a constant juggling act of both tactics and economy. Is your money - hard to come by at first, but flowing more healthily as you seize more territory on the map of the oppressed, fictional nation of Arulco - better spent on hiring new and better mercs, or on new and better gear for your existing chaps? Or on extra guns to pass to the locals in zones you've reclaimed, to help them fend off random enemy invasions that you can't get your guys over to help with? A constant war rages across a large map, littered with money-making quests and zones that provides bonuses, and before too long you'll be making difficult decisions about whether to reclaim a lost mine, SAM site, prison or roadblock, or to forge onwards to grab something deeper into cruel queen Deidranna's territory.The over-map, while still large and encouraging non-linear play, is stripped down compared to Jagged Alliance 2. Merc training and healing has been ditched, with only travel remaining: so more or less everything now happens during missions. You could argue that this is more streamlined, or you could argue that it turns Jagged Alliance into more of a straight-up combat game - which makes this an appropriate juncture to bring up the new combat system.Now in real-time, controlling your mercs either singly or in a group, it's vaguely comparable to a far more elaborate Cannon Fodder, or more contemporaneously, Men of War. Success largely comes from outflanking your enemies, sneaking up on them, superior marksmanship or judicious use of stances (prone, crouched and so on). The old shot-by-shot orders are gone, with your mercs now shooting on sight or being instructed to take specific pops based on your calculations on which enemies (and which body parts) are the easiest marks.However, a spectre of the old system remains in the form of pause-time orders. Tap the space bar and you can plan out your individual mercs' movement and actions, then hit space again and watch it all play out in beautiful synchronised real-time. Well, that's if you planned it right. It might well play out in horrifically messy, cack-handed real-time that results in all your soldiers bleeding out while an unscratched, machine-gun-toting enemy cockily crouches behind a wheelie bin. Distinctly wobbly AI, for both your guys and their opponents, means nothing is ever certain - though the finer movement and facing control offered by pause-time does head some off the randomness off at the pass.In real-time, though, you'll far too often see one of your mercs vibrating softly as he/she tries unsuccessfully to shuffle past another character, or staring vacantly as a man runs up to them with an axe and embeds it in their spine. The enemies suffer similarly, with lemming-like behaviour often making it all too easy to lure them into your bullets. The transition from turn-based to real-time has not been a smooth one, even regardless of the fanbase's grumpiness about the concept. The new system, overall, does just about work - particularly when pause-time orders play out exactly as planned and you thus feel like a deep-thinking god of war. But battles are so often a surreal carnival of spinning men, sudden death and fish-in-a-barrel massacres that it's not the triumph it needed to be to justify the change. On top of that, the bewildering decision to have the game auto-save before every fight means only the most unbending of iron wills could resist the temptation to take a disastrous skirmish from the top, rather than accept the tactical and financial consequences of a man/woman down. Between real-time and auto-save, it's all too easy to brute-force your way through what wants to be a highly tactical game.So, Back In Action doesn't manage to be either the joyous return of a lost king or a spangly new action toy for the uninitiated. Too simplified for the former and too cheap for the latter, this isn't the explosive Jagged Alliance comeback it needed to be, or even the equal of its revered forebear.Nonetheless, it's a strategy game of uncommon substance. The painstaking management and honing of your team, the desperate push-and-pull war for territory, and the gradual incursion towards Arulco's heart of darkness offer a hearty feast for anyone who can make it past the more superficial disappointments."}