{"ref": "https://www.eurogamer.net/ufc-undisputed-3-review", "date": "15 Feb 2012", "game_name": "UFC Undisputed 3", "text": "This year's Ultimate Fighting Championship is off to an excellent start - and a controversial one. UFC 143 delivered one of the most hotly debated fights of recent times.With current UFC Welterweight Champion Georges St-Pierre still out of action with a knee injury, it was left down to former Strikeforce Champion Nick Diaz and former WEC Champion Carlos Condit to duke it out for the Interim Title. Diaz was the hot favourite to win, coming off an 11-win streak with his world-class boxing. But by playing an outside striking game and evading whenever his back was pressed against the cage, Condit secured a Unanimous Decision that prompted MMA forums across the globe to explode with polarised opinions.This was a match that, while unworthy of a Fight of the Night accolade, perfectly demonstrated the importance of knowing your opponent's strengths and weaknesses while formulating an effective strategy based on your own skills. It's also something which the UFC Undisputed game series has worked hard to replicate, with a comprehensive fighting system that maintains the MMA mantra of dictating the pace and imposing your will. And in terms of striking a balance between challenge, accessibility and fun, Undisputed 3 is Yuke's most well rounded fighter to date.One hurdle that new players have been forced to overcome in previous games is the complicated transition system that requires circular motions on the analogue stick to gain more dominant positions in the ground game. So to ease beginners into switching from full, half and open guard while being watchful for sweeps, Undisputed 3 introduces an optional Amateur Control scheme that uses directional flicks. It's less demanding than the traditional method - but as a counterbalance, it's easier for a Pro Control player to stop an Amateur transition.The stand-up striking, meanwhile, has been redesigned in a way that places more importance on jabs and quick strikes to set up more powerful haymakers and techniques when fishing for a knockout. The excellent Sway system also makes a welcome return, with the ability to punish predictable flailing with a jaw-rattling counter. And as a new layer to the mid-match mind-games, you can now perform Feints to throw the timing off obvious takedowns before planting your knee in the opponent's face. This new Intercept Attack system is particularly welcome, as it makes takedown spam far less viable.Other changes to the fighting system include ground sways that offer a 50/50 chance of avoiding ground and pound pressure; new Leg Kick TKOs that, while rare, make you more wary of unchecked calf-cutters; and a more noticeable differentiation in terms of fighter reach that makes it more difficult to close in on a human spider when you've got less range than a Tesco Value tape-measure. But out of the many subtle gameplay changes, it's the new submission system that offers the most tangible progression by letting you outmanoeuvre your opponent in an abstract mini-game.The more dynamic and fluid combat comes hand-in-hand with an improved Career mode that cuts back the unnecessary excess so you can focus on what Undisputed does best - namely, getting into the Octagon and putting your MMA knowledge into practice. This is especially true of the revised levelling system, which replaces the artificial point-hoarding from the last game with new training games that include flipping a tyre into different zones to improve your takedowns and timing your sways and counters perfectly in a focus mitts drill.Furthermore, the irritant of stat deterioration has been removed in favour of training sessions that have a positive effect on some attributes while slightly lowering others. But on the whole, the goal of battling through the WFA little leagues on your way to the top of the UFC premiership is still the primary focus - only this time, your landmark achievements are rewarded with short documentary-style clips. These include Scott Jorgensen discussing his favourite finishing move when you first level-up a technique and current Bantamweight Champion Dominick Cruz describing his first title shot when you hit the top contender spot.It's one of these videos - in this case introduced by former King of Pancrase Champion Bas Rutten - which sets up Undisputed 3's most substantial addition: the opportunity to fight in the now defunct Pride Fighting Championships. This was a Japanese MMA promoter that, at its peak, filled a stadium with over 70,000 people. But as impressive as these attendance figures are, PRIDE's real draw is how it approaches MMA safety in a slightly different way to the UFC.The most obvious difference is the use of a conventional boxing ring rather than an octagonal cage, and while fighters aren't allowed to target elbow strikes to the face, they can throw highly damaging knees, foot stomps and soccer kicks to a downed opponent's head. And with a first round that lasts 10 minutes rather than five - in addition to there being no fence to wall-walk - this makes the PRIDE ground game far more dangerous for the defender.More dangerous still are the PRIDE Grand Prix tournaments, which have the finalists competing in two matches in a single night, with any damage sustained in the first fight carrying over to the second. These have been lovingly recreated in Undisputed 3's returning Tournament mode, and they let you relieve classic MMA moments like Final Conflict Absolute 2006 when the legendary Mirko ~Cro Cop~ Filipović put down Wanderlei Silva and Josh Barnett in godlike fashion.The other game modes include series staples like Exhibition, Title Defence and Event creation, as well as an expanded Ultimate Fights mode that includes classic PRIDE matches like Heath Herring vs. Antônio Nogueira at Critical Countdown 2004, and Shogun vs. Rampage at Total Elimination 2005 - with more being made available as DLC. This time round you also have the opportunity of fighting from the loser's perspective, just in case you're more of a taker than a giver.For those seeking to create their own legacies, however, the online arena will be the place to test your striking, grappling and submission skills. Unfortunately, the bulk of Undisputed 3's online features weren't live at the time of writing, meaning we couldn't sample the community-building Fight Camps or the new Content Sharing. However, the P2P Player Matches were unlocked after inputting our Season Pass code (yes, it's one of those games).Matches are more than stable if both players have a decent connection, and with THQ promising ~new servers to significantly improve online matchmaking capabilities~, it seems that Undisputed 3 will improve upon the unstable Ranked Matches of its predecessor. How dramatic an improvement this is will become more apparent after the game's launch.But in every other respect, Undisputed 3 is a methodical fine-tuning that tightens up the MMA mechanics while introducing newcomers to the enduring legacy of PRIDE. Although one of its biggest draws is an updated roster that includes the new Feather and Bantam weight divisions, this shouldn't overshadowed the attention to detail that's gone into everything from more natural movements and knockout animations to new fighter entrances and submissions, including the rarely seen flying scissor heel hook that Ryo Chonan used to submit Anderson Silva in one of the unlikeliest comebacks ever.My only real criticism is that, unlike the refreshing narrative in last year's Fight Night Champion, Yuke's has chosen to play it safe by not adding anything dramatically new. This seems a shame, given the untapped potential of The Ultimate Fighter reality series that helped make the UFC what it is today. But as culmination of three years in which we've gone from a scattered lineage of average UFC games to a genuine contender for the best sports fighter available today, Undisputed 3 is, on all counts, a round three technical knockout."}