{"ref": "https://www.eurogamer.net/modnation-racers-road-trip-review", "date": "13 Feb 2012", "game_name": "ModNation Racers: Road Trip", "text": "The shorthand for ModNation Racers has always been Mario Kart meets LittleBigPlanet. Well, the Mario Kart bit is certainly true.Sony's jouncing, knockabout title flings it players around hairpin tracks where they're free to collect weapons (although, in a WipEout-ish twist, they can now convert them into boost), tackle crazy jumps, zip through giant Tiki Skulls and even pick up a tiny, crucial jolt of nitro at the very beginning of a race if they can start their engines at just the right moment. It's borrowed almost all of its best ideas, perhaps, but it's a very entertaining homage.The whole LittleBigPlanet thing is a bit misleading, though. ModNation is built around user-generated content, but it takes an entirely different approach to that offered by Media Molecule.LittleBigPlanet wants you to make exactly what's in your head, even though doing that is likely to be fiddly and annoying (and, if it's my head we're talking about, it will be filled with stray tumbleweeds and set to the distant toll of a sad, rusty bell). ModNation just wants you to make something. Anything, in fact.Sketch a track, mess with the elevations, and sprinkle it with yapping penguins: it's done in five minutes. You can spend a lot longer tinkering with the specifics if you want - just as you can spend a lot longer crafting your own kart or mod character from the various parts you've unlocked playing the campaign - but it's a system that's largely been designed around breezy immediacy. Maybe that's why it seems so comfortable on the Vita.How comfortable? Let's find out - and let's start with a look at the creation stuff, as that side of things should theoretically be most compromised by the shift to a smaller screen. Certainly, the Vita's 5-inch OLED looks a little cramped for the first time when you fill it with a few of the game's production menus, but you're also now allowed to control things with taps and swipes of your finger. It's a good trade-off. So, when making your own karts, it's easy to select spoilers, engines, bodies and all that stuff, and it's even easier to add and reposition various decorative pieces like buzz saws and lollipop aerials. Every race tends to shower you with new stuff to throw on your vehicle, and there's a randomise option that is almost as good as LBP's randomise character button. You'll find yourself pressing it for hours. Or at least a few minutes. (I pressed it for hours.)When it comes to mods - the series' vinyl-toy avatars - it's much the same business, except instead of adding tires, you're throwing on a walrus moustache and some spooky eyes. Character textures are one way in which this Vita game really stands out from the PSP incarnation, incidentally: they look really great here, giving the game a much-needed tangibility. How about the track editor, though? Well, I'm glad I pretended that you asked me that. This is all designed with the same focus on simplicity. It's a multi-stage process and you start by selecting a basic theme - Big City, Ice World, Jungle, Multi-Drug-Resistant Tuberculosis - and then tracing a layout onto the screen. After that, you can either auto-populate your track with weapon-drops, scenery, speed ramps and the like, or you can do it all by hand.ModNation's auto-population system is still fundamentally amazing. There's something extremely satisfying about watching as the camera whizzes down the track, adding elements in entirely sensible positions. It's a little like being rich and drinking lemonade as somebody else does your gardening and fiddles your accounts for you - but in a really cool, cinematic way.That said, ModNation's decorating isn't that much trickier if you want to do it yourself. Banking and adding height to your track is done with a funny little tool that you steer down the road by swiping the Vita's rear touchscreen and then operate by swiping the front, while props are pulled out of menus and placed with a jab of the finger as you rove around with the left stick. Modding the terrain sees you squashing earth down on the front touchscreen and pushing it up with the rear, which is such a cool idea you won't really mind a little brain-lag as you get used to it. After that, you can even try changing the weather by hand, like an insane aunt of mine used to, except here it actually works and nobody pops out of the bushes to tranq you.There's even more depth to the creation stuff if you want it, but the basics alone are certainly good enough for you to make something you'll be willing to share online. This is done via the Share Station, which allows you to upload and download all manner of karts, mods and tracks. At the moment, it's obviously a little quiet, but the basic system's easy enough to suggest that people will use it - and you can always browse through existing PS3 stuff anyway. There's a lot of that.You're given 30 creation slots and the browser encourages you to rate other players' entries and even modify them yourself if their designers have left them unlocked. The Share Station also includes something called Mod Explorer, which allows you to access new props by walking around in the real world. This will never catch on.None of this stuff would be worth anything if ModNation wasn't a decent kart racer. Luckily, a decent kart racer is exactly what it is, with a reasonably varied campaign and AI that doesn't feel quite as cheap as Mario Kart's can.Even with some new options in this instalment, ModNation's weapons tend not to take hold in the brain quite like Nintendo's bananas, shells and Bullet Bills have, but it's still a nice selection, with everything from mines to lock-on missiles and some really novel big-ticket items.You can level weapons up by collecting pods of the same colour or you can cash them in for nitro. You've also got a nice side-shunt move on the right stick alongside a boost and a shield and a mid-air stunt manoeuvre. Best of all, pressing the X button as you slide around corners sends you into a lazy, sinuous drift, and it's here that ModNation really makes you feel a sense of connection to the road. The best tracks aren't the busiest, then: they're often the curviest. Drifting from one turn to the next is a beautiful feeling indeed.Tracks all have optional challenges baked into them, releasing more props and encouraging replay, and by halfway through the relatively lengthy campaign, you're going to have to be racing quite well to unlock the next tour. Later levels can be a touch too lengthy, however. It's not a huge problem, but when you factor in some protracted load times, it means that - if you ever do actually find yourself on that mythical bus trip on which we're meant to be doing all our handheld gaming - you might want to stick to Everybody's Golf. After all, everybody is golf. Chew on that thought for a while.ModNation's multiplayer is probably going to leave you wanting to head to an online petition site or send an angry fax to Barack Obama. There are ad-hoc four-player options and some decent asynchronous stuff that allows you to download ghosts to race against, even filtering for local players. But there's no online head-to-head, and this is a crying shame. Apparently, the developers didn't mind chopping it out because nobody really played it on the PSP version. Given the inherent connectedness of the Vita, however, it seems weird that they didn't want to try and work out why nobody played it and maybe improve on that rather than simply lopping it off altogether.Still, you can always share things, eh? In the final analysis, it's always worth remembering that ModNation Racers is one of the few user-generated content offerings that lets even the least creative of its users generate content. As one of the idiot 10 per cent that is constantly holding the rest of the world back from greatness, I genuinely appreciate that, even if I'm only turning out wonky Penguin-speckled tracks and ugly riffs on the Batmobile.As for the wider game, this isn't the most charismatic racing series around, perhaps, but Road Trip is a surprisingly enjoyable instalment nonetheless. It's colourful, cheerful and a decent showcase for Sony's brand new hardware."}