{"ref": "https://www.eurogamer.net/king-arthur-2-review", "date": "9 Feb 2012", "game_name": "King Arthur II", "text": "Over the past couple of weeks, I've been in an ongoing debate with a colleague who has been arguing that free will either does not exist or, if it does, the only choices we can make are arbitrary. I've been arguing the opposite, but after playing King Arthur 2, I'm starting to agree with him.What I'd really like to do is feel my squires strap my armour about my body while my hand grasps at the pommel of the sword I won, before staring down at the vast armies I've amassed from the tallest tower of the castle I've constructed and then, finally, turning to meet the eyes of my beloved Melissa, the woman I first met at the royal court in London.But it turns out that King Arthur 2: The Role-playing Wargame doesn't want me to have more than one army just yet, I'm not allowed to build castles wherever I want to, and a wordless Melissa offers no explanation for why she won't marry me but will, instead, dispassionately embrace any other knight I nudge toward her.So I resign myself to taking my sole army south, expand one of my villages and then prepare to pick up my quest where I left off. It doesn't matter that I'm leaving my vast midland holdings entirely undefended, even though corrupt and beastman-infested woods encircle them. It doesn't matter that great and terrible armies march mere miles from my borders, armies that could crush and conquer my people in a moment. I've long since learned that only armies of manageable size are going to invade, usually at a mutually convenient time for a battle, and that I'm otherwise quite free to travel off and see to my own business. Providing that business is my very specific destiny.Then, just as I'm about to plunge myself into another battle against Fomorian forces from the beyond, the game unceremoniously transports me not to the mythical land of Tír na nÓg, but instead back to the humdrum familiarity of My Desktop. I will have to do everything again.This is King Arthur 2 in a nutshell. While surface impressions may suggest a game that is about uniting fifth-century Britain by words or by swords, your progress is less ambitious and mostly shepherded along a predetermined path, traced out by a plot that has sprinkled your meandering with various quests, challenges and pre-set battles. It's immediately familiar to those who played the first King Arthur  and who will also note that developer Neocore has been attentive to complaints that this predecessor was too difficult. The sequel is not only more forgiving, but perhaps altogether too pedestrian.A typical year in the game will see you marching your army across the land towards the next quest objective, possibly engaging yourself in a battle along the way, weighing up a few diplomatic decisions and finally making camp for the winter, taking a moment to issue some construction orders to regions you control. Each of these proves to be a very muted experience. Construction, for example, mostly consists of upgrading pre-set structures so that they become slightly more effective by a few percentage points.Meanwhile, undertaking one of the many quests is more akin to opening a choose-your-own-adventure book, where you click your way through various screens of dialogue and still images and find yourself presented with two or three choices for what to do next. Do you decide to sneak down into a dungeon, to believe the words of a drunk priest, or to accuse the mysterious stranger of theft? You take your pick and eventually weave your way to the end of the quest, gaining an ally, enemy or perhaps a new territory at the end, sometimes reaching the same outcome by making different choices. Then the game slightly shifts the geographic fences it has constructed about you and tells you where to march next.Battles, which are thankfully less common than quests, might begin as very ordered affairs but quickly descend into an enormous melee that has more in common with a riot than any sort of war, as units charge together and intermingle in an indistinct mess which makes them difficult to control, to manage or even to distinguish. Your best strategy is simply to prepare a powerful and diverse force beforehand.This leaves King Arthur 2's combat feeling less like grand strategy and more like making an omelette, as you carefully choose ingredients which you then toss together into a whirling mass, hoping the end result will bring you some satisfaction. Often, it does, because even at higher settings, battles can be surprisingly forgiving.I should mention that the game talks to you, too. Constantly. All the dialogue in its quests (and there are many of them) is read aloud. New quests are read aloud. Advisors pop up and talk to you. When diplomatic options present themselves, they talk to you too. I have never in my life played a game that's wanted to talk to me so much, and I've had to drag the voice volume slider down to the depths of Hades. Even the field of battle offers no escape, and a disembodied voice keeps telling me a unit of mine is about to die, though it never actually specifies which one.I wouldn't mind so much if the voice acting was consistent, but a variety of actors putting on questionable accents read out the many paragraphs in front of me, sometimes replacing each other mid-flow. In Glastonbury I met a Morgana Le Fay who was not only voiced by a man, but who had the speech pattern of a robot.All this is a shame, because although I'm dragging my feet along the plot path that Neocore has chosen for me - perhaps accruing another tiny bonus or concluding another largely irrelevant diplomatic affair - it's apparent that this game has had a lot of time and attention lavished upon it.It's a tribute to romanticism and quite beautiful, with some fantastic art and a particular, peculiar reinterpretation of an almost hackneyed British legend. King Arthur 2 shows me a Britain I really wish I knew, a Britain where the sun shines forth on clouded hills, where even Bedford is a magical and mystical land, where ancient Dumnonia is rent by smoking chasms and where great evil lurches forth from dark, Satanic mills. It looks gorgeous and often has some interesting and entertaining stories to tell.But it's broken. The plot of a land suffering corruption and sickness is almost a metaphor for a playing experience that keeps burping up bugs and crashes. During the time I've been reviewing it, two patches have been released and a number of issues are no more. Nevertheless, I currently can't make any more progress through the third of its five chapters because the next quest I try always crashes the game.Sometimes, casting spells in battle crashes the game. Sometimes, moving my army crashes the game. Sometimes I can't deploy armies and, although I control several traders who will apparently allow me to sell some of the endless (and often useless) magic artefacts the game heaps upon me, I can find no option to sell my bow of burning gold and am now so burdened with magical tat I wonder if I should just host a dark ages jumble sale.If battles and new games didn't load at such a glacial pace, I might be more inclined to keep trying, to see if I make further discoveries or perhaps gain new freedoms. But this game seems intent on either ruining, controlling or obfuscating everything I do. After much rummaging around the internet, I've discovered why I can't build more armies; apparently I'm only allowed three, which will be given to me at pre-determined times. But I still don't know why I might want to purchase a certain building upgrade, or I have to hunt through several screens of information to find out how and why I should unlock a certain power or feature, something that I might find is as arbitrary as a 5 per cent damage bonus.I really want to head north to meet the legendary Green Knight, who I can see ensconced in some mysterious forest. But I have no diplomatic options for the region and so have no choice but to leave him alone or fight him to the death. After doing so, the game tells me I've won exactly -1,026,059,136 gold coins, and so my billion gold piece deficit leaves me at a considerable strategic disadvantage. I get the feeling that, as with many other things in the game, I'm simply not supposed to do this yet, if at all.I've seen King Arthur 2 improve over just a few days, I imagine that more patches will be released - and perhaps Merlin's magic will address more of the game's flaws, pad out its linear and plodding narrative and finally turn Morgana Le Fay into a woman. In the meantime, however, it remains glossy rather than glorious, decidedly wobbly and very limited."}