{"ref": "https://www.eurogamer.net/dead-island-ryder-white-dlc-review", "date": "6 Feb 2012", "game_name": "Dead Island", "text": "In the debate about the rights and wrongs of DLC, one aspect rarely discussed is how downloadable expansions can enable a developer to build on flawed potential and polish up a rough diamond. Few diamonds came rougher than Dead Island last year, a game groaning with promise but ultimately weighed down by lacklustre presentation and lacking the inspiration to keep its over-20-hour playing time fresh.As the first narrative add-on for the game, following the XP grind of Bloodbath Arena, Ryder White's campaign should have been a chance for Techland to elevate its surprise hit into something truly special. Sadly, it seems either that the studio really doesn't understand what worked first time around, or that it's gone out of its way to sabotage its own game. Think of any element of Dead Island that you enjoyed, and chances are it's been removed or broken in this DLC.You liked the co-op, right? Playing with three friends, working together to complete the quests or just teaming up to beat down the zombie horde, was a feature that helped to soothe the sting of the game's clumsier aspects. So, naturally, that's completely disappeared; Ryder White's story is single-player only.But at least there are the RPG elements, right? Levelling up the characters, filling out their skill trees, moulding your preferred zombie-mangling warrior - this was what gave the game's insipid fetch-quests some meaning. By providing a through-line from start to end, the meta-game of self-improvement rescued what could have been a ropey FPS and made it something interesting, if not polished.Inevitably, all of that has gone. Ryder White is a character with a fixed player level and no skill tree. The crafting system remains, with a handful of mediocre jerry-rigged weapons to build, but since nothing from this DLC carries over into the main game, there's no incentive to seek them out.This in turn means there's no reason to explore Banoi's open world, but that's OK, since it's been blocked off in a series of mindless corridor rat runs anyway. There are no side quests or optional activities, just a linear series of A-to-B jaunts. There aren't even any new environments - you're dashing through the same streets, schlepping through those bloody sewer tunnels and battling in the same prison that you already know from the main story.Progress is hampered by the fact that death no longer respawns you somewhere nearby, but instead boots you back to the last checkpoint minus whatever ammo and items you used up. This add-on also ramps up the difficulty by constantly spawning gangs of sprinting infected, often from behind, from areas you already cleared. They batter Ryder to death in seconds, so while there's maybe two hours of gameplay here, it'll likely take twice as long thanks to constant restarting.Anything that was good about Dead Island has been crudely ripped out, and whatever remains has been served up in such a way that it simply isn't fun, even at the basic ~look at me, I'm killing zombies~ level. The only reason to suffer through this half-baked effort is if you reached the final stage of the main game and thought, ~This Ryder White character is fascinating - I wonder what series of tragic events led him to become a stock military villain in a zombie story?~If that question keeps you awake at night, you may be able to justify spending 800 Microsoft Points (or £7.99) and four hours of shoddy first-person zombie shooting to find the answer."}