{"ref": "https://www.eurogamer.net/soulcalibur-5-review", "date": "31 Jan 2012", "game_name": "SoulCalibur 5", "text": "Even without the perplexing addition of Stars Wars characters, the last SoulCalibur felt like a game that had run out of creative steam. All the swashbuckling pirates and disgruntled golems played much the same as they had on the Dreamcast, and although Project Soul added the Soul Crush system to make blocking more risky - as well as a customisation mode that let you adjust appearance and attributes - it was akin to owning the same sports car for 10 years straight. It still had the capacity to excite, but familiarity had dulled some of that early intensity.It seemed that SoulCalibur would join the same ranks as Killer Instinct and The Last Blade: fighting game series that once went toe-to-toe with the best of the best, but were destined to fade away. This tragedy, however, has not come to pass. Although Namco took a misguided step with the epically bad SoulCalibur: Legends, the weapon-wielding warriors have returned in SoulCalibur 5 - And this time, the performance upgrades offer much more mileage.Set 17 years after the last game, this chapter of the Stage of History is populated by 27 characters, including familiar faces like the dauntingly breasted Ivy and the whimsically sadistic Tira - neither of whom has aged a day - in addition to three descendant characters who inherit the bō-staff, ninja garb and Chinese sword of Kilik, Taki and Xianghua. Although the protégés conduct themselves in a strikingly similar fashion to their forbearers, they each pack enough new tricks to give veteran players something fresh to experiment with.The less familiar side of the roster is made up of a handful of new characters - including the hidden dagger antics of Ezio from Assassin's Creed - as well as six unlockable fighters that range from Mokujin plagiarists like Edge Master and the new mask-wearing Kilik to the throne-abusing Algol from SoulCalibur 4. While having three random-style characters may seem like a bit of a cop-out when compared to the progressive headcount of Super Street Fighter 4, the five genuinely new additions offer a solid increase in terms of match-up diversity.Patroklos and Pyrrha - respectively the son and daughter of Sophitia - are introduced in a new Story mode that sees them facing off against the likes of Voldo and Maxi while learning about the history of the warring swords. The 20 chapters it spans put an emphasis on narrative rather than collecting weapons or meeting special fight conditions, which is shame given the series' Edge Master Mode heritage. But even though you'll beat the angelic boss in little over three hours, it's an enjoyable if linear journey that benefits from the less cumbersome approach to storytelling of this mode's guest developer, CyberConnect2 (known for the Naruto games and the forthcoming Asura's Wrath).Solo players looking for a bit more substance, meanwhile, will find solace in Quick Battle and Legendary Souls. The first is similar to Tekken's Dojo mode in the way it mimics an online lobby by offering one-on-one showdowns with custom-made characters. Each AI opponent is tiered from an effortlessly easy E5 to a savagely challenging A1, and by besting them in turn, you can collect 240 different titles that include Farting Baron, Solid Man and Door Knocker is Back. There's even a Mishima Style Master title for beating the Devil Jin antics of Katsuhiro Harada.But in terms of SoulCalibur 5's steepest challenge, beating the producer in his own game comes a close second to the punishing gauntlet of Legendary Souls. It's essentially a boss rush that pits you against some of the series' strongest characters - including Cervantes with Soul Edge and Siegfried with Soul Calibur - while turning the difficulty up to 11. Even the most minor lapse here will put you through the combo blender, and although it's a shade more manageable than the equivalent SNK paddling, hardcore players should take considerable satisfaction in passing this test.For those who'd rather get creative with pants and pauldrons, the expanded Creation mode offers a level of character customisation that puts every other fighting game to shame. There's such a diverse range of commonplace and less obvious creation items - all of which can be personalised with a wide variety of colours, patterns and stickers - that the options now go way beyond making Mitsurugi look like Afro Samurai. And although the additional DLC gear may be a tad contentious, it does offer better value and functionality than Capcom's costume packs.That said, SoulCalibur is a fighting game first and foremost, and as engaging as the new modes and customisation options undoubtedly are, they all take a back seat to the changes made to the game's fighting system. On a mechanical level, SoulCalibur 5 is a methodical fine-tuning of a well-established formula.Naysayers will complain that it's losing its identity by trying to be more like Street Fighter, but in truth, SoulCalibur 5's new super gauge compliments the game's trademark eight-way run system by giving players a more defined structure in terms of advanced techniques. Guard Impacts now cost meter to perform, and have been streamlined into one ~catch-all~ input so that even new players can punish a predictable strike with relative ease. Meanwhile, the new Just Guard offers a more demanding parry for experienced players who want to take their game to the next level.This style of progressive flexibility has also been applied to the offensive mechanics. Beginners can use basic launchers to send their opponent skyward before comboing into the new Critical Edge supers - with a prime example being Leixia's spinning-top slashes. Then, once they've got the basics down and can start exploring the hidden depths of their chosen character, the new Brave Edges offer a versatile combo extension system. It's even possible for Astaroth to follow up his Critical Edge throw with a Brave Edge launcher that can combo into a midair grab - all for just over 50 per cent damage.These are the kind of skills you'll need to put into action when climbing up the rankings on PSN or Xbox Live. The usual mix of Ranked and Player Matches sit alongside a new Soul Link system that lets you keep track of up to three rivals, as well as a new Global Colosseo mode.This free DLC is a community-building tool that's similar to the player rooms in Mortal Kombat. You pick a major capital like London, Paris or New York and then enter a 50-player lobby that lets you browse through Player Cards while participating in Random Matches and Ranked Tournaments that will be held at set times each month.In terms of the all-important netcode, we were able to enjoy stable games against UK-based opponents with improved lag-reduction compared to SoulCalibur 4. And that's a sweeping statement that can be applied to the game as a whole.My lasting impression of SoulCalibur 5, though, came from a 'first to 50 wins' set that I played with a fellow reviewer over the course of a long evening. During this time, we experimented with roughly half the roster and although our initial games would've looked like an amateur showcase from SoulCalibur 4, it wasn't long before we were using the new mechanics to Quickstep out of the way of horizontal haymakers, punish whiffs on reaction with Critical Edges, Just Guard telegraphed unblockables, and stage epic comebacks with Brave Edge ball-breakers.To be fair, these matches weren't quite as thrilling as the first time I played the original SoulCalibur. But in terms of those round-to-round mind-games where you have to adapt your strategies and mix-ups to find an increasingly elusive opening against a similarly skilled opponent, I can honestly say that this was the most intense game of SoulCalibur I have ever played.SoulCalibur has always excelled at offering an accessible style of combat with a level of single-player content that other fighting games have only recently begun to match. These qualities haven't changed - and now, after what seemed like an uncertain return, the historical fighter is staging its best performance since that fateful Christmas of 1999. High five!"}