{"ref": "https://www.eurogamer.net/app-of-the-day-monsters-ate-my-condo", "date": "30 Jan 2012", "game_name": "Monsters Ate My Condo", "text": "Tricks of the Reviewer's Trade #116: Start the review with an out-of-context description of a seemingly bizarre but ultimately representative gameplay moment, highlighting the absurdity of the game's premise and/or presentation.Example: My towering condominium is leaning at an alarming angle. There are three bombs ticking away at various points along its height, and my anxiety is not helped by the fact that Boat Head, a giant radioactive crab, and Reginald Starfire, a giant blue unicorn who used to front a boy band but now works for a self-esteem telephone hotline, are standing to either side of my building, demanding to be fed. If I don't feed them in time, or feed them the wrong thing, they'll have a massive strop and my condo structure will be toppled in the ensuing tantrum. Game over.Luckily, I feed Boat Head a diamond which makes everyone fall asleep, then shovel some blue condos into Reginald's mouth which causes three yellow condo floors to fall together and form a bronze power-up, which I then feed to Reginald causing the tower to straighten up. Disaster averted, I calmly pocket several million points and continue to build.This, then, is the manic world of Monsters Ate My Condo. Its demented stylings should be familiar to anyone who has played the other titles from Adult Swim Games, but this one is a deeper cut than, say, Robot Unicorn Attack. Where that was a deliciously mental endless runner, Monsters Ate My Condo is one part Jenga to two parts match-three puzzler, all drizzled in mad manga sauce.Condo floors drop from the sky and your job is to match three of the same colour. You can ditch unwanted floors by flicking them out of the tower left or right, but it's here that the game's quartet of giant kaiju monsters hover, hungry for construction debris. Each monster is also colour-coded and has a short temper. Feed a red floor to Mr Shigoto, the enormous, green, lederhosen-wearing mutant salaryman, and he'll get cross. Make any monster too cross and they'll lash out, potentially knocking your tower down.Power-ups are the answer, as each successful group of three floors creates a bronze power-up. Three bronzes create a silver. Three silvers create a gold. Three golds create a diamond. And so on. Each power-up triggers a particular beneficial side effect when fed to a monster, with diamonds lasting much longer than bronze.That's the basic core of the game, but what makes Monsters Ate My Condo so damnably addictive is the finely tuned balance between frenetic mayhem and deep, think-on-your-feet strategy. It's a game that exists constantly on the edge of absolute chaos, and riding that wave is the source of its breathless entertainment.It also helps that this is a game that understands the power of big numbers. In my first ever game, I scored over five hundred million points, with no clue what was happening. In my second game, I scored over a billion. I really don't care if that's a good score for this particular game. Maybe the average score is a hundred billion. What matters is that I see zeroes spilling across my phone and immediately feel awesome.Lots of iOS games use wacky humour and ironic silliness to mask crude gameplay, but Monsters Ate My Condo offers the best of both worlds. It's insane and ingenious, and demands to be played.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}