{"ref": "https://www.eurogamer.net/app-of-the-day-triple-town", "date": "27 Jan 2012", "game_name": "Reviews", "text": "There are mobile games that make the journey from Android to iOS (or vice versa), and then there are games that jump from AAA console title to handheld spin-off. Those first, purely mobile titles grow their stature by catching a little bit of fire, awarding the developer just enough interest and finance to give their next big thing a shot at a wider audience.We're going to do our best to highlight those gems that we love which never make that transition - but Triple Town is a little bit different. In this case, both Android and iOS owners owe something to a little known social networking site called Facebook  (as well as Amazon's Kindle) where the game launched last year. The objective is to build as fancy a town as you can by combining groups of three or more identical objects into upgradable structures.Here's how it works. Collections of grass make bushes, which make trees, which in turn can be combined to create houses (themselves upgradeable), while angry little bears that occasionally appear as the next placeable object will wander around the map, getting in the way of everything and making you cross. In order to be stopped they must be fenced in, a process which turns them into gravestones which can then be converted up into cathedrals.You can't blindly match objects up anywhere you like, though. You also need to consider the upgrade that comes after the one you're currently working on, because the placement of the final co-joined item in each group determines the placement of said upgrade, and so on, all the way up the entire tree of upgrades. Still with me? Excellent.Amongst all of this mental effort, there is some reprieve, in the form of a platform which allows you to put one object aside for future use. It's a place you'll often use to store the rare crystals which can be used to complete any upgrade, or indeed any group of upgrades.It's not a surprise to discover that you'll struggle to find your rhythm at first until you've gained an instinctive feel for how the stacks-within-stacks play into each other, the micro within the macro. But once you make that little extra progress in your planning and understanding, the game charms you with a combination of equal parts frustration and glee.One you've run out of tiles on which to place the next object, each game finishes and you'll receive a number of coins depending on your performance. These are then used to make purchases to help you through the next match - an essential tree, for example, or a tile-clearing robot.This article contained embedded media which can no longer be displayed.There's a catch, of course - and you may come to feel less pleased with your high score, knowing that those coins earned in-game can be purchased outside of the game. Also, while Triple Town is free until you've exhausted the several thousand moves that come with the initial download, it's a number that takes you suspiciously close to the point where you'll feel you're making progress. After this, you'll need to either wait for turns to recharge or pay for a version with unlimited moves.Less cynically, though, this is a free chance to test your mettle against the structure of a refreshingly challenging game before deciding on a purchase. By the time you come to consider whether £2.49 represents good value for money, you'll either be hindered beyond progression by your own stupidity - or eager to reap the rewards from your investment many times over.App of the Day highlights interesting games we're playing on the Android, iPad, iPhone and Windows Phone 7 mobile platforms, including post-release updates. If you want to see a particular app featured, drop us a line or suggest it in the comments."}