{"ref": "https://www.eurogamer.net/dustforce-review", "date": "25 Jan 2012", "game_name": "Dustforce", "text": "Cleanliness is next to godliness, so the saying goes. And yet, while I wouldn't deny the deep sense of spiritual well-being instilled by a freshly bleached toilet pan, I can't claim to feel very zen after playing Dustforce, a time-attack platformer which takes tidying as its theme.In fact, I very nearly bit through one of my knuckles while unleashing a gargle of vowel sounds at such a high volume that my neighbour came round to check I was OK. But Dustforce doesn't care about ~OK~. It only wants ~flawless~. It wants, in the game's own dark lexicon, the vaunted ~S/S~ rating.Dustforce's levels make two demands: firstly that you must clear each environment of the muck which encrusts its floors, walls and ceilings, and secondly that you must do so with finesse. The former is the easy part - the first and lesser S of S/S. Your character, an unusually nimble janitor (a ninjanitor, perhaps?), need only scoot over the dead leaves or dust trails to dissipate them, deploying quick and heavy attacks to dislodge more stubborn clumps and deal with the occasional enemies - creatures corrupted and controlled by the accumulated filth.Keep up the pace as you sweep and your combo meter will continue to tick up. Lose your combo by taking damage or through simple sloth and you also lose the chance to snatch that second, much coveted S. Since the levels are, to put it generously, entirely merciless, this will happen a great deal.Each is an extreme stress-test of your elegant, tautly designed move set, demanding memorisation of a protracted string of dashes, double-jumps, wall-jumps and attacks. Nail it and it's an exhilarating roller-coaster of loop-de-loops and switchbacks, sending you ricocheting between surfaces and arcing over deadly pits by performing momentum-sustaining slashes against fluttering dust-monsters. The flavour of the challenges is cleverly varied: some levels are simply a breakneck slalom, while others are more exploratory, with fragmented platforms allowing players to freestyle the critical path. Further levels make monsters the major obstacle - forcing you to dodge their blows to keep your combo, deploying your own super-attack at just the right moment to clear the screen. One particularly novel challenge, called Construction Site, is little more than a jumble of floating cubes layered in filth. There's no racing line to follow here; the method of completion is simply left to the player's improvisation.The level of challenge is austere and forbidding in itself, albeit softened by the gorgeous flat-shaded vectors and soaring score - but failure can be a little too capricious. You'll sometimes slide down a wall and yet a patch of muck will somehow survive your broom, and on a rare occasion I found a vital leap repeatedly foiled by inexplicably deadened momentum. The luscious art also has a double edge: when it comes to the more elaborate bits of set-dressing, the differentiation of background and foreground is sometimes a little too subtle to grok on your first run and, once in a while, sends the frame-rate sputtering.At such times, when a minor misfortune spikes an otherwise perfect run, it's very easy to scream - particularly because, if you don't manage to snag that S/S rating, you won't earn keys to unlock later levels. There are a generous number open from the off, their doors sprinkled across a massive hub-world, but eventually you'll need to grind away at a rating in order to squeeze a key out; there's no way for fat-fingered players to stumble to the end.There is, however, a way for fat-fingered players to learn. Every level is punctuated by a leaderboard, which connects the names upon it directly to videos of their play-throughs. While I personally find the realisation of just how many people are more dexterous and valuable human beings than myself to be galling, it does serve as a valuable seam of tips. Some levels are so incoherent on first glance that you'll need a few pointers on which direction to head, while knowing the best spots to drop a super-attack is a huge boon: it can sweep away all dirt within an ample radius, eliminating threats or flushing clean an otherwise fiddly digression from the main path. A quick glance at the top 10 might also give you a hint as to which characters the level favours - although the game makes no effort to tell you, the four available ninjanitors are not equal, and while they possess much the same move set their attack radii and move speeds are minutely varied.It's likely that I'll never be good enough for this to make a meaningful difference, but I can take solace in the fact that I'd be even worse were it not for the game pad support. The keyboard just isn't the right home for these sort of controls, and besides, is far less satisfying to throw. A minor annoyance is that you have to manually bind pad controls to the various actions, and even then you'll need to have your keyboard within smashing distance in order to angrily, repeatedly access the menu from which you can reset the level.There's no wanting for content - there are 50-odd levels, each of which offers a distinct and memorable challenge, and the game comes garnished with two local multiplayer modes. Survival sees up to four players try to slap one another into spike pits or off ledges, while King of the Hill witnesses the usual scramble to dominate control points. It's lively stuff, and there's a clever twist: players can also take on the role of Dustforce adversaries, dirtbags whose very contact with the environment sloshes it in muck. This builds their combo meter, and the same happens when the Dustforce team clear away the rubbish their opponents have scattered. It's tidily designed - but alas, without online play it's unlikely to be that much use to anyone. We can only hope such support will be added in a later patch, along with the promised level editor.As with fellow hardcore platformers N+ and Super Meat Boy, Dustforce can feel a little like punishment - and for those of us whose gaming powers are in decline, its unforgiving progression system and the highly visible scolding of the leaderboards seem like a heartless reminder of failure. It is not, then, a game for those with anger management issues. But even when convulsed with fury, it's hard not to admire the pat precision of the controls or deny the transcendent joy of a high-ranking run.Those with an addiction to high scores will love the many hours they spend smashing themselves repeatedly against the levels' pitiless design. And those who aren't up for the challenge? Dustforce will just take them to the cleaners."}