{"ref": "https://www.eurogamer.net/scarygirl-review", "date": "24 Jan 2012", "game_name": "Scarygirl", "text": "With a tentacle arm, a prosthetic hook hand, an eye patch and a Nightmare Before Christmas rictus grin, Scarygirl lives up to the somewhat unkind name her parents burdened her with. But it's a Gruffalo kind of scary, the sort of character a 14-year-old girl with pink hair and thick mascara who hates her dad might cuddle up to in bed, if it were sold as a plushie. And it's this kooky appeal that makes for a perfect video game lead.The creation of 34-year-old Australian illustrator Nathan Jurevicius, Scarygirl is best known for her appearances in psychedelic, reinterpreted tales of folklore, stories through which she attempts to find her identity while under the watchful eye of her octopus guardian, Blister. This spin-off platform game sticks closely to the mythology of the world, sending the titular heroine off on an adventure over forests, up mountains and through ice caverns to find out who or what is behind her haunting dreams.Expectedly perhaps, the art and animation are the strongest aspects of the game. Scarygirl herself exudes character, with vibrant animations as she leaps, dives and helicopter-spins her way through the undergrowth. Levels are designed in the style of Klonoa, with winding '2.5D' pathways that curve into and out of the screen while parallax background layers add depth off into the misty distance. The game's 21 stages are divided into seven worlds, none of which stand out from the usual platform game tropes, but all of which have their own charm and interest.Scarygirl's primary foes are flora and fauna: aggravated hedgehogs, charging billygoats and barrier-forming purple weeds that must be plucked from the ground. Basic combat is a straightforward button-mashing affair, light and hard attacks freely interspersed with one another to form simple combos. It's possible to launch foes into the air and, with timed presses, juggle them till they explode into a puff of nothing. Meanwhile, after depleting a set percentage of an enemy's (hidden) life bar they are stunned. At this point a squeeze of the L trigger will extend Scarygirl's tentacle arm to grab the incapacitated creature. Grasped enemies can be thrown as projectiles in any direction, or alternatively used as fleshy clubs to pound on their comrades for bonus damage. Defence-wise, Scarygirl has a bubble shield, but this wears out after a few seconds. Engaging this protective orb at the precise moment that an enemy projectile is about to strike you will deflect it, turning the violence back at the enemy.There's just a single currency in the game. Gems litter the game world and directly feed into your bank which is used to purchase new attacks, extra arm appendages and vinyl toy versions of the creatures you encounter in the game, which are stored on display in the title screen hub. The shop is only available when you come across a travelling salesman every few levels, and as he is the gatekeeper to new tools and abilities, choosing where to spend your gems appears to be a game-changing decision every time you meet.In reality, the new combat abilities are largely unnecessary. Abilities such as Morph Smash, which creates a tendril club from Scarygirl's arm that can smash down onto enemies, or Pogo Attack, which allows you to use an enemy to launch into the air, are novelties. It's always simpler and quicker to resort to your standard attacks.The unlockable tools are more useful, but aside from the 'feather', which allows Scarygirl to fly-fall for longer, they're primarily just statistical upgrades for the default tentacle weapon, graphically disguised as anchors or fans. Problematically, the game fails to introduce enough formal new ideas over its course to sustain keen interest. It's telling that the onion dojo - an area Scarygirl is transported to whenever she eats a purple onion for a tutorial - is only visited twice over the course of the game. There just isn't very much to learn here.The platforming, meanwhile, is solid but ordinary. Branching paths through levels add the illusion of depth but, for players who wish to collect 100 per cent of the gems in a stage, trekking backwards and forwards through a level is an inelegant slog. A somewhat incongruous Zelda-style system where you collect heart quarters adds a much-needed second collectible beyond gems. But the rage meter which gradually fills during combat until you can trigger Rage Mode - momentarily turning Scarygirl into a true monster - lacks the bite that you need to feel like a force of terror. Where is the sense of monstrous power when all you get to do is bite trembling hedgehogs in two?Scarygirl can be commended for its ambiance. The art and animation works in concert with the audio - all vibrato wind instruments, Theremins, Eastern scales, croaking frogs and dripping water - to create a dreamlike, engaging series of locations. There just isn't really the opportunity to lose yourself in them. The lack of ceremony at the conclusion to each level deadens any sense of achievement; even your stats for the level are tucked away.Coming so soon after the assured brilliance of Rayman Origins, Scarygirl is cute, workable, but otherwise routine - its style inching ahead of its substance."}