{"ref": "https://www.eurogamer.net/hero-academy-review", "date": "17 Jan 2012", "game_name": "Hero Academy", "text": "Hero Academy - the new iOS game from the ex-Ensemble team at Robot Entertainment - is a nice piece of game design, but a truly great piece of spot-welding. As a turn-based fantasy battler, it's easy to play yet tricky to play well, it just about survives the implementation of micro-transactions, and it's delivered with a decent bobble-headed art style.What makes it a little bit more special, though, is the fact that all of this is then stuck behind a front-end that comes straight out of Words With Friends. You search for pals to battle with or select a random match-up, you make a move against your opponent, and then you sit back and wait for them to make theirs. You can message players in-game if you particularly like them (or if you particularly loathe them, I guess), and while you're waiting for a rival to take their turn, you can start a new match with someone else, safe in the knowledge that the familiar scroll-down interface will keep track of everything.The game itself is pleasantly simple, a multiplayer-only affair in which two teams face each other across a tiled pitch. The object of each battle is to destroy your enemy's crystal(s) before they destroy yours, and you take turns to play: dropping units onto the field, moving them around, attacking or throwing in items. Each turn allows you to make five moves, and that's always long enough to put a plan in motion - bring a new guy in, buff him and get him moving towards the front lines, say - but never long enough to ensure that you haven't left yourself exposed somewhere else.Unit types include healers, ranged and melee fighters; items cover things like health buffs, attack buffs and long-range offensive spells; and there are also special tiles on the board that raise or lower a crystal's defences or give you a damage booster. You select your pieces, meanwhile, from a tray at the bottom of the screen: drag a unit or an item onto the field and after your turn, a new unit or item will be randomly selected to take its place. As matches get more frantic, managing what you're holding off the field can become as important as what you're doing on it.It's not without its depths - most of which are still emerging - but it's still straightforward enough for you to be able to return to after a few days away, or after playing turns in five other matches one after another. In essence, your decisions always hinge on whether to push for the enemy crystals, thin out enemy ranks a little first, or hold back and defend your own crystals. I suspect that most of the long-term strategy is going to emerge from getting to grips with the individual teams you can take out onto the battlefield, each of which comes with its own twist on some basic unit types.There are only two teams at the moment - Council and Dark Elves - but you can expect more to follow suit, as this is where Robot Entertainment is going to be making its money (along with selling you customisation stuff and taunts to deploy after you take a turn). You can play Hero Academy perfectly well for free, of course, but you'll be stuck with the Council, who feel a little vanilla and have a very straightforward selection of soldiers.Dark Elves are already a lot more interesting to mess around with - they can leech health from enemies and summon phantoms out of downed units, for example - but, from the matches I've played so far, the two still seem relatively well-balanced. It will be interesting to see if the developer can keep that sense of parity in place as it starts loading up the store.At the moment, then, Hero Academy is very promising: a bare-bones design experiencing the lean early days of its existence. The servers are sometimes a little wonky when you're trying to connect, and if you're after variety, be warned you'll see all of both teams' units in a few rounds. That said, the audience, which is arguably the most important part of the puzzle, is already in place, and you'll have two or three battles on the go within minutes of downloading.In other words, this is a nice game that may well turn into a great game: if the players continue to stick around, if the developer doesn't let the micro-transactions take over, and if the design team keeps its eye out for bugs and exploits that emerge as people start to get really serious. Normally, it would be a case of ~Watch this space~. In the zany world of freemium iOS gaming, however, you can play the game while you do that. You probably should."}