{"ref": "https://www.eurogamer.net/mighty-switch-force-review", "date": "9 Jan 2012", "game_name": "Mighty Switch Force", "text": "By day, WayForward is just a mild-mannered developer for hire. It wears sensible spectacles and smart shoes, it slicks its hair back with odourless pomade, and it spends its working hours creating surprisingly decent licensed games. Often they're significantly better than decent, actually, as with last year's elegant and pulpy BloodRayne: Betrayal and 2009's A Boy and his Blob.By night, however, after heading for a secret cave hidden beneath a dusty mansion, or stepping inside a phone booth and spinning around dead fast, WayForward is transformed into a smart indie studio, heroically splicing genres and crafting its own retro-tinged gems like the WiiWare survival-horror puzzler Lit and the evergreen bellydance-'em-up Shantae.The Mighty Blank Blank series, as those in the know like to call it, has recently earned a place amongst the team's more interesting work. Last year's Mighty Milky Way sent you swimming through the galaxy one planetoid slingshot at a time, while, before that, Mighty Flip Champs offered up a multi-dimensional platformer in which you couldn't jump. Take that to the bank.Mighty Switch Force is the latest instalment, and although it initially seems to be the most straightforward - and when it comes to level counts it's almost certainly the slightest - I think it may also be the most satisfying too.Switch Force is a side-scrolling puzzle-platformer in which you're cast as a spindly robot cop forever on the trail of the five villainous Hooligan Sisters. The sisters spawn afresh on each new stage and must be collected, one by one, in order to progress to the waiting evacuation mech, and you've been given a Siren Helmet to aid you in your pursuit.Besides looking dapper, your fancy headgear allows you to alter the environment at the tap of a button, either shifting certain distant blocks onto the game's 2D plane in order for you to jump on them, or shifting them out again if they're wedged in your way. Be careful, though, as it's easy to end up squashing yourself.At first, the whole thing seems quietly indebted to Paper Moon, a free and uncommonly pretty browser game by Infinite Ammo that hinged on the same idea. The more you play, however, the more apparent it becomes that WayForward's using the concept for very different ends, creating short bursts of platforming intensity and puzzling cruelty rather than letting you loose to explore. At the same time, Switch Force is also making the most of the 3DS' lenticular screen, allowing you to ghost blocks in and out of existence with precision and take stock of the games' complex landscapes quickly and intuitively. Readability aside, the whole thing's a treat to behold, in fact. The backgrounds have a wonderful industrial sci-fi appearance to them, calling to mind the covers of 1980s Harry Harrison novels, while the cast of cartoon characters are beautifully, if economically, animated, and they all stand out sharply, as if cut from chunks of thick card and then stuck in front of the landscape on cocktail sticks.Mighty Switch Force is entirely enjoyable with the 3D turned down, but, like Pullblox, it benefits greatly from a sense of depth. It's enough to make you wish for a 3DS instalment of the Viewtiful Joe series.In the early stages, it's enough to make you wish for slightly better controls, too, as you're dropped into the world with only a weak laser shot, a surprisingly ponderous running speed, and a rather measly jump. It all feels a bit earthbound after the gravity-bending delights of Mighty Milky Way. That said, you'll quickly start to realise that the scheme has been built around precision rather than flair for a very good reason: after the game's halfway point, running and shooting are rarely your primary concern anyway.That's because of a range of special blocks that entirely transform the experience, tying together the puzzling and platforming elements and breaking it free of the Paper Moon comparisons once and for all.These blocks aren't that unusual by themselves, perhaps - there's a boost-block that shoots you high into the sky or across the screen, for example, and there are blocks that can be locked into place by standing on them, changing the order in which they then phase in and out of view - but they're all brought together to form some ingenious gauntlets that are built to be traversed at terrifying speed.Some levels offer stepped pyramids you have to climb by shifting fresh tiers into existence as you're powered from one ledge to the next, while others construct networks of doors that need to be resequenced in order to allow you to pass through them safely while you chain boosts.Towards the end, there are even platforms that automatically switch in and out of the screen every few seconds, rendering your Siren Helmet useless and forcing you to work to somebody else's beat for a change. Throw in enemies that have to be shot from behind, fizzing bomb-bots who can blow down weak walls, and doors that will open only if a robot is squashed against the screen by a well-placed block-switch, and you have a hectic yet brainy puzzler with an unusual focus on rhythm. Jump - shift - land - jump - shift - land - boost - squish - restart - sob.That would be enough, but each level also comes with a truly insane time target to aim for, encouraging you to pare your hard-earned five-minute completion back down to - gulp - a minute and a half, say, and making a rather short game a little more replayable in the process. If you have the speedrunning bug, be warned: Mighty Switch Force's taunting clockwork worlds are going to be a dangerous, and possibly fairly maddening, compulsion. Even if you don't, this is still clever, personable, and beautifully made."}