{"ref": "https://www.eurogamer.net/football-manager-2012-review-pc-vs-handheld-review", "date": "9 Dec 2011", "game_name": "Reviews", "text": "An article about Football Manager tends to write itself. You can continue to harp on about its destructive tendency to take over your own life. Maybe throw in a few crafted asides about taking your plucky band of strugglers to improbable European glory, and then go about the business of discussing the shiny new features, before finishing up with a tearful account of how your partner shacked up with the editor of the Angling Times because it was a better option than hearing about contract negotiations and tactical nuances before bed. Job done.But you really don't want to hear about the broken reality at the coal face of games journalism. It's quite likely that you're a bit like me - a former football management addict who had to go cold turkey and leave it far behind - and not just for the predictable reasons of it being 'too compulsive' and being threatened with justifiable violence by your significant other. The curious truth of the matter is that Football Manager just got ahead of itself, and giddily heaped layer upon unnecessary layer of detail onto its perfect core. No longer was it about simply managing the tactics and transfers of your fantasy team, but handling egos and fretting about media relations and dozens of other micro tasks that ultimately distract you from the things that you enjoyed most.But Sports Interactive knows only too well that its statistical opus will never be all things to all people. Some people evidently love meddling with the training and match preparation and poring over their youth and reserve team prospects as much as others loathe these minutiae. A large chunk of us simply wish SI would just put a 'Championship Manager 2' button somewhere and go back to basics - and that's exactly where its Football Manager Handheld spin-off comes in, with wonderfully refined versions shoehorned into the PSP and iOS platforms.For more than five years, the PSP version has provided the closest approximation of the stripped-down FM experience that many of us naturally gravitate towards, and this year's edition continues to stick doggedly to those sensibilities. If all you want to do is focus on the team selection, in-game tactics and an occasional dip into the transfer market, then it's all here, and couldn't really be any more intuitive. If you decide you want a little more depth, then there's a modicum of boardroom, player and media interaction that you can get involved with, but it has been tucked away a little. Happily, there's never any sense of impending failure if you don't bother with expanding your stadium or improving your training facilities, and the game never nags you into doing anything you're not bothered about. It's just there to fiddle with if you want it, and isn't overly complicated once you're there. On the downside, some of these features are basic to the point of irrelevance, and the squads aren't as fleshed-out as they could be, with numerous odd omissions of (long established) players being particularly noticeable.7/10The newly-issued iOS version, meanwhile - a universal app for iPhone, iPad and iPod Touch - is a different beast altogether. It has no such issues and comes with full, accurate squads (including complete reserve teams) and many features not present in the (far more expensive) PSP edition. For a start, the look and feel is completely different, with a modern touch interface sporting big, bold iPhone-friendly buttons, and an intuitive drag-and-drop system that makes tactical changes and transfer hunting a cinch.The same solid handheld principles apply to the iOS version, with the ability to 'manage' squad selection and tactics on a fairly superficial level if you wish and up to four active nations running at once (from a choice of 12). As you'd expect, the point-and-click nature of the game suits touch-screen play down to the ground, and you're never left in any doubt where anything is or overwhelmed with options. You can even get your assistant to loan out reserve team players for you to give them much-needed experience. So far, so good.Not so welcome are the presence of the now obligatory (anti) social options, allowing you to bug your friends by spamming their Twitter or Facebook feeds with news of your progress. Fortunately, it's entirely optional. More interesting is the excellent new Challenge Mode, which offers four familiar pre-defined scenarios, and tasks managers with meeting their stringent objectives - such as saving a bunch of strugglers from relegation halfway through a season or coping with an injury crisis. For the purposes of handheld play, these snack-sized portions of managerial meddling work brilliantly, and help negate the tedious faffing that often goes with getting a game up and running. Another trumpeted 'new' addition allows you to play the game 'mirrored' on a big screen via Airplay over Apple TV, providing you have an iPhone 4S or iPad 2. Unfortunately - unlike, say, Real Racing 2 - the game doesn't resize itself to take advantage of your 1080p display, but merely replicates what you're already seeing on the device. This was also possible on the previous iOS iteration, so it's misleading for SI to call it a new feature.It's also worth mentioning that the game's 2D match engine bizarrely suffers from noticeable slowdown on iPhone 4S but runs smoothly on iPad 2, while the iPad version simply scales up what you see on the iPhone and feels held back as a result. On the plus side, if you have multiple iOS devices, you can play the game on one and continue it on another using the same saved game.Despite these niggles, £6.99 is unbelievably good value for a near-perfect refinement of what many of us want from a football management game. It has more or less all the leagues you could conceivably wish for, a simple, uncluttered interface, all the transfer and strategic depth you need, and just enough media, player, staff and board interaction.8/10The 'full fat' version continues to dominate the scene on PC and Mac and it's the least shocking revelation of the year to learn that the 2012 version is officially quite good. Actually, that's a lie - it's the most complete simulation of everything connected to the business of football management imaginable. If you're an out-of-work footy manager and you're jonesing for some action, this is as close to the real thing as getting flecked with spittle by an irate Ken Bates after a 6-0 reverse to your local rivals.At this juncture it would be easy to pad out the word count by parroting the features of FM 2012, so I won't do that. There are millions of them, as there are every season. You know that, and you can look the headline changes up even quicker than I can reword them.More interesting is the fact that Sports Interactive is gradually getting better at interface design, and as a result manages to make the statistical meddling more like browsing the internet or doing your email than ever. There's still a ridiculous amount of depth, but it's much more apparent where the basic fundamentals are these days. It's also fairly straightforward to delegate, and the role of the assistant is greatly amplified. That said, the result is that he's like a nagging spouse, continually tut-tutting about your lacklustre training regime and coming up with (often useless) scouting suggestions.The man-management and media interaction are now as much of a priority as the actual match itself, with the full spectrum of moods on offer giving you a chance to be as big an egomaniac bully or cuddly uncle as you want to be, and instant feedback giving you a clear idea whether your tantrums are having the desired effect. This constant ego-massaging has turned FM into as much of a mind-game as a matter of putting more balls in the net than the opposition - but, crucially, it does add a welcome splash of RPG colour to what would otherwise be a simple team sheet preparation exercise.Continuing improvements to the 3D match engine also help drag it kicking and screaming into the present, although it's still a long way short of FIFA Manager in that regard. But, frankly, sod that. The dogged purist in me prefers to see the match unfold via elaborate text commentary, rather than see the painful truth of my tactical inadequacies laid bare.You can, of course, revert to the old 2D blobs if you wish, or turn them off altogether and go old school.8/10But if you're really intent on living out your football management dreams the way that Sports Interactive used to, the best bet is to keep things simple and opt for the iOS version. If you need all the trimmings, then by all means surrender yourself to the all-consuming PC/Mac version. Just don't let your joy about the new streamlined match preparation and in depth contract negotiation system creep into your pillow talk, for God's sake."}