{"ref": "https://www.eurogamer.net/overpass-review-an-extremely-difficult-game-about-driving-over-rocks", "date": "28 Feb 2020", "game_name": "Overpass", "text": "It's hard to imagine the naming of a video game going more badly wrong than it has here. Sticking two vaguely dynamic words together, the makers of Overpass have stumbled - accidentally, I hope - on a synonym for a motorway bridge. Apart from sounding dispiritingly utilitarian, nothing could be less appropriate for a realistic off-road driving game that is all about navigating tricky terrain.The game itself, though, has something going for it. As Donlan recently pointed out, it has more in common with Spintires or Lonely Mountains: Downhill - or even the hiking gameplay of Death Stranding - than it does with, say, Dirt Rally or MX vs ATV. Yes, it is a motorsport game, based on a real motorsport, and yes it is played against the clock. But it is not about racing. It is about route-finding, problem-solving, reading the ground.In Overpass you undertake time trials on obstacle courses or hillclimbs at the controls of either a lightweight buggy or a quad bike. You navigate your way over sunken concrete pipes, piles of logs, see-saws, mud-slicked slopes and screes of jagged rock. The controls are simple - these vehicles have just a single forward gear and reverse, plus brake and handbrake - although there are a couple of nuances. On a quad bike, you can lean your rider with the right stick to manage your weight distribution, while most of the vehicles can engage a differential lock that helps cut wheelspin but greatly reduces their turning circle. Judicious use of these tools needs to be folded into a very cautious playstyle that is all about managing momentum - not too fast for the obstacles, not too slow to make the next climb - and picking your route and angle of approach very, very carefully. One wheel at a time, as the tutorial narrator tells you in his reassuring down-home Kentucky accent.It's hard going, in an absorbing, mostly enjoyable kind of way. The physics simulation is pretty convincing, but you can't drive by the seat of your pants. You need to engage your brain and think ahead, not just about how to enter the next section but what that means for your angle of exit, where there might be an ugly camber that could topple you, less room to build up speed for a climb, or an awkwardly placed shelf of rock.This, really, is the entire game, and it's enough. The courses are naturalistic, densely designed and really challenging - especially the fearsome, head-scratching hillclimbs. In theory, this game should be more accessible than its closest cousin Spintires: Mudrunner, because it's about beating the clock round a course in a nimble racing buggy rather than running errands in obsolete Soviet heavy goods vehicles. But Spintires' nerdy specificity and sandbox approach give it an appealing novelty value and excuse much of its roughness. Overpass is pure, stripped to the bare metal, and that's an unforgiving way to be.Developer Zordix has achieved a lot with what is clearly a small budget - especially for a full-price release - but it has missed a few important tricks. There's a lack of sensory feedback to help you feel your way around the course: no controller rumble and extremely meagre audio that amounts to no more than a single, rasping exhaust note. The fixed camera is incredibly frustrating, as there's no way to look around tight corners or get a sense of what's to the side of or behind your vehicle - a criminal omission in a game so focused on the immediate environment.Worst of all, there's no free-play or practice option, no way to play the game without a timer ticking away on the screen. One of the smartest things about last year's brilliant mountain biking game Lonely Mountains: Downhill was that the first time you ran each course was always at your leisure: you were free to explore and learn before trying again for a perfect run or a fast time. Just figuring out how to get to the end of one of Overpass' courses is an achievement, but the best way to do that to begin with is to experiment, and that means wasting precious seconds on crashes and restarts.This is particularly harsh in the career mode, where damage to your vehicle is persistent between rounds and needs to be repaired, either with cash or by skipping a round while your opponents rack up more points - cash and points that those lost seconds are costing you. I love this idea, and dig the career mode's unusual branching structure, but with no practice rounds it's just too punishing. Better to familiarise yourself with the courses first in the other game modes: quick races, custom events and multiplayer, in which you race to beat your opponent's ghost either online, in split-screen, or by passing the pad.I respect Overpass's commitment to an honest depiction of this demanding motorsport discipline, and I enjoy any game that asks me to test myself against a landscape - always the most bewitching of foes. I imagine fans of the real-word sport will be delighted Overpass exists. But it's too stern an introduction for me, missing just a few features and little polish that might have made it a truly compelling curio."}