{"ref": "https://www.eurogamer.net/serious-sam-the-random-encounter-review-review", "date": "17 Nov 2011", "game_name": "Serious Sam: The Random Encounter", "text": "~Man, I hate puzzles,~ says Serious Sam at one point during The Random Encounter. The irony, of course, is that the game is almost all puzzle. It's a bizarre spin on the turn-based combat of Japanese RPGs; an adventure in which success depends on figuring out the right combinations of weapons you'll need to tackle the combinations of enemies you're faced with. And then figuring out the right order for your combinations of weapons. And the angle of fire. And...If that's not enough to get you excited, fans of Croteam's magnificently straightforward blaster should also note that Vlambeer, the imaginative Dutch developer behind this arcadey treat, has also crafted the purest game yet when it comes to the pleasures of running backwards and shooting things. It's a hymn to running backwards. It's a testimonial dinner in honour of shooting things. It's weird and spectacular and it refuses to outstay its welcome. It's like a dinner guest who tells brilliant stories for two hours and then suddenly dives through a window and races off down the street.The Random Encounter is one of a trio of indie games commissioned to promote Serious Sam 3, and it's the one that's always looked the most interesting. The easiest description of Vlambeer's effort is ~a JRPG by people who don't have a clue about JRPGs~. A slightly more enthusiastic one might be, ~A JRPG by the people who made Super Crate Box, the best arcade game of 2010.~ Quite a lot of Super Crate Box's DNA has made the transition. Some of it can be seen in the game's dinky pixelated monsters. Most of it, though, is found in the endlessly satisfying weapons. There's a rocket launcher that chews through ranks of mutant flesh with a single fusillade, a shotgun that goes off like 10,000 light bulbs exploding in concert, and a laser-rifle that sends out prongs of Christmassy green plasma in neat rows. That's just for starters. It's a straightforward selection, perhaps, but only on paper. In the thick of battle, Vlambeer only needs a few smoke trails and a 16-bit sound effect to make its arsenal feel exciting and surprising and toxically potent.The weapons provide the spine of the ingenious combat. As Sam and his party wander around a short sequence of tiny dungeons, solving comically basic puzzles (thankfully, they're actually meant to be comic for once) and trading quips, they'll be interrupted by enemies and bosses every few seconds, and taken to the scrolling battle screen. After that, it's player against horde. They're coming your way; you're running backwards and shooting. There's a twist, of course, and it lies with the fact that every five seconds the action pauses, and you can either choose to continue shooting, swap weapons and then continue shooting, or use an item. An armour boost or a revive, say, or something a little more exotic.Choose to switch weapons and you'll get a time penalty. Choose to continue shooting and, depending on your weapon, you have a range of options. Some guns, like the laser rifle or rocket launcher, allow you to redirect your angle of fire every five seconds. The shotgun, meanwhile, is an auto-targeter, but you can still adjust its range, trading reach for power. Then there's the grenade launcher, which lets you pick a blast spot on the ground before you fire it, and the cannon, which needs an entire round to charge.With three party members to control, you'll quickly learn to use load-outs that click together tactically. You'll also learn that, as with Super Crate Box, each weapon is defined by weaknesses as much as strengths. That rocket launcher has a great spread but only fires once every round, for example, while the laser rifle knocks foes back, but doesn't do much actual damage.On top of that, you've got classic Sam enemies, each with their own attacks to dodge and bosses that fill the screen: maybe with teeth or tentacles, and maybe with endless waves of deadly frogs. Vlambeer's one of those developers that realises a good video game weapon is often a tool for tackling a certain kind of space, so the baddies it crafts can be guaranteed to use space in interesting ways.The Random Encounter makes for a short game, but an extremely enjoyable one, the two-hour campaign providing you with plenty of hectic victories and glorious defeats. It also leaves you with an Endless Mode, some lovely pixelated memories, and that warm feeling that only comes from seeing something very new built from ideas that are very, very old.Even if Serious Sam 3 turns out to be rubbish, it will have been worth it for this."}