{"ref": "https://www.eurogamer.net/rayman-origins-review", "date": "14 Nov 2011", "game_name": "Rayman Origins", "text": "In 2004, Disney Studio Head Michael Eisner made a business call that had devastating creative implications. He announced that the labour-intensive 2D animated cartoon style that had defined the studio's output throughout the 20th Century was no longer financially prudent or culturally relevant. Rather, the company's creative future lay in 3D CGI, the Pixar aesthetic that was both cheaper to create and animate as well as being more current for young audiences.There seemed, to Eisner, to be nothing to lose: he would incur fewer costs, audiences would experience increased happiness. So, in one fell swoop he fired all of the studio's 2D animators and sold off the equipment used to create so many animated classics, from Snow White and the Seven Dwarves to Aladdin. It's a trend that's been echoed by the video game industry since the advent of 3D, with hand-drawn 2D art rarely seen outside of indie games and mobile titles today. The cost of creating and animating 2D assets is exponentially higher than doing the same with 3D models that can be given a virtual skeleton and then posed and manipulated with ease. Higher resolution screens have exacerbated the decline of the 2D form, as the amount of work needed to create pin-sharp 2D graphics has multiplied with each technological leap. Blockbuster gaming's embrace of 3D makes sense on paper, then. But it also comes with the implication that 3D art is the natural evolution of 2D art.This is as much of a lie as claiming photographs are watercolours evolved. And it's a lie that Rayman Origins viciously skewers while maintaining a kooky Gallic grin. Just as Disney's Enchanted had Eisner's successor re-hiring those same animators he laid off a few years earlier, having sheepishly recognised that their craft had not been superseded but merely complemented, so Ubisoft Montpellier has returned to the series' 1995 origins in 2D, hiring ex-Disney animators to work with a revolutionary 2D engine that has been part-funded by the French government. And what a revelation the artistic re-visitation brings with it: a cartoon come to vivid life. Each frame could be paused, printed off and hung on the wall. Each sprite is packed with light-touch charm that's endlessly engaging: the character that clings to the edge of a ledge using his upper jaw, arms slack by his sides; the giant eyeballs that must be poked to gain access to the next area; the rope-swing characters that extend an arm to help you over a chasm between two pillars; the giant, armoured canary that has more character packed into one squinting eye than the entire cast of Angry Birds.It's also beautiful. The forest glades, like something out of My Neighbour Totoro, through which Rayman and his friends bound in the early stages of the game - a parade of generous stacked parallax layers - dazzle, while the more generic fire, ice and underwater worlds exhibit such artistic imagination as to transcend their predictability. Bespoke animations pile high, testifying to the developer's commitment, enthusiasm and talent for extracting the DNA not only of Rayman himself but also of the classic 16-bit platformer. In doing so, they offer a window back into what was once the most popular genre in the medium while evolving it into something fresh.Creator Michel Ancel and his team's love for the platformer reaches beyond the graft on display in the visuals. This is a playful, witty game filled with nods to the Nintendo greats. One pick-up changes Lums (the game's equivalent to Mario's coins) red, increasing their value for a few seconds while a slightly off-kilter take on Koji Kondo's iconic theme plays out. Elsewhere the team riffs on classic levels plucked from Donkey Kong, Boulder Dash and Super Mario Bros. 3 before twisting them with French flair. Rayman Origins reaches back to the core of a series that has always leaned heavily upon its inspirations, and in doing so, offers a celebration of those inspirations as part of the package.~Rayman Origins is the best-looking 2D game released in a decade.~However, Ubisoft Montpellier lacks Nintendo EAD's seemingly limitless imagination: those recurring themes and one-shot ideas that spill from the greatest 2D Mario titles with such rude generosity. Miyamoto and his designers' genius is often in the way in which they establish themes and riffs and then subvert them. Rayman Origins is a more conservative game in this regard which takes fewer risks and therefore, in raw mechanical terms, offers fewer moment-by-moment rewards for the attentive player. Still, the underlying structure is robust. The game is divided into worlds which are divided into stages which are unlocked when you've collected the requisite number of Electoons - pink, anthropomorphic berries. Each stage has between three and six Electoons, one won for simply completing the level, the others won for doing so quickly, or thoroughly, or by discovering the secret area hidden in each. At the close of each world, Rayman earns a new tool, such as the ability to flap his arms and float to the ground, or to shrink to half his size. While these widen the interactive scope of the game, the designers sometimes fail to keep apace with this expansion of abilities with interesting scenarios. The same ideas repeat too often.But when the team does play around with the core mechanics - in the memorable stages that have you chasing a terrified treasure chest at breakneck speed through a shifting landscape, or the stage that plays out along a musical stave, each step triggering a different note in a xylophone melody - the results are stupendous.Indeed, in its finest moments, Rayman Origins goes toe-to-toe with the 2D platform game greats, combining tight, responsive controls with assured level design, a clutch of varied tools and, of course, some of the finest HD animated art yet seen in the medium. One area plays out in silhouette, like a French cartoon version of Super Meat Boy, while another has you swimming through pitch-black murk towards pockets of light emitting from the lamp on an angel fish or a swarm of luminous plankton. These stand-out moments elevate the whole.Charm and ingenuity aren't the only artefacts to have been recovered from the past by Ancel and his team. Rayman Origins is also a decidedly challenging game, demanding excellence from any player hoping to collect all of the Electoons available in each stage. While your character enjoys infinite lives, many stages require repeat attempts and the game teeters on infuriating too often in its latter half. Play in the well-designed co-op, however, and the challenge softens considerably, especially as players can use one another as moving platforms to press into those tough-to-reach areas. While the lack of online multiplayer may be consistent with the series' origins, it's a disappointment here, especially as the game is often at its best when played with a friend.The shadow of negative thoughts about the game's core is, in the main, cast by the brilliance of its exterior. While the cast lacks a certain creative coherence and its star lacks the iconic gait of a Mario or Sonic, Rayman Origins is the best-looking 2D game released in a decade. As such, expectations about the quality of the underlying experience are perhaps elevated too high.Viewed with these expectations in check, Ubisoft Montpellier has indisputably crafted a delightful, playful, occasionally exhilarating platformer. But while this is a game whose visuals point to a bright, alternative future, its systems too often rely on the dusty past. Half of a classic, then."}