{"ref": "https://www.eurogamer.net/sonic-generations-review-review", "date": "2 Nov 2011", "game_name": "Sonic Generations", "text": "20 years after the release of Sonic the Hedgehog, perhaps the most interesting thing Sega could have done would have been not to celebrate his anniversary, because goodness knows we have been invited to do so on enough occasions already. It could even be argued that in those 20 years Sonic has been subject to more rose-tinted compilations than enjoyable sequels.If the series is famous for one other thing besides its hero, however, then surely it is Sega's unwavering devotion to his longevity, and thus it was no surprise when Sonic Generations sped onto release lists for the end of this year, just 12 months after the warmly received Sonic Colors. What's more surprising - and gratifying - is that for once the new game is both compilation and enjoyable sequel.With help from a new time-travelling foe who has jumbled up the series' history, the action is split between 2D levels starring a mute, plain-shaded, slightly plumper Sonic, limited to spin attack and spin dash, and hybrid levels that mix 2D and 3D elements featuring the taller, mouthier and shader-spangled modern Sonic, with his arsenal of homing attacks, stomps, drifts and slides.Stranded in a whitewashed hub world that they must gradually recolour, the Sonics are served up a level each in nine Zones inspired by high points in the series' history. They start off in the familiar Green Hills before visiting Sonic the Hedgehog 2's Chemical Plant, Knuckles' Sky Sanctuary and even locations borrowed from the riskier end of the timeline, like Crisis City from the ghastly Sonic the Hedgehog 2006 and Planet Wisp from Sonic Colors.Whether you're in 2D or hybrid levels, gameplay is the usual blend of interconnected platform freeways sped across at lightning speed and trickier, precision-platforming sections featuring spikes, moving platforms and bottomless pits. As ever, it's all policed by robotic enemies who are positioned in just the right place to knock Sonic's golden rings from his cute little gloved hands. And not as ever, but perhaps as it always should have been, each level is full of secret alternative routes.Once you complete a trio of Zones you face up to a boss fight, but only once you've gathered three boss keys, unlocked by completing challenges for the preceding Zones. These challenges, of which there end up being dozens by the end of the game, repurpose the platforms and highways you've just crossed and throw in a new objective: get to the finish post before a ghost Sonic, gather more chaos than Cream, or chain together invincibility power-ups so you can cross unending spike traps, among numerous other variations.As with the main Acts, there are leaderboards recording your performance for each challenge, and as well as high scores Generations is also stuffed with unlockables. A skill shop allows you to buy gameplay modifiers, like an instant brake for speeding Sonic, or the ability to land on your feet rather than your backside after taking a knock. You can even unlock an in-game Mega Drive controller that gives you access to the original 1991 Sonic the Hedgehog game in its entirety.Revisiting that game for any length of time also lays bare some of Generations' flaws, however - like a slightly laggier jump response that frequently robs you of the bountiful alternative route you know you hit the button in plenty of time to ascend. In a game of split-second choices, it's often frustrating to have your input ignored for that vital split second, which wasn't a problem in 1991.By contrast, series mainstays like a set number of lives and numerous bottomless pits were certainly in vogue back in those days but should perhaps be facing retirement by now - or at the very least, handling of greater delicacy than Generations can muster. Using up four out of five lives completing a level and then dying halfway through the next one because you only had one left, only to be plonked back at the start with five again, feels poorly thought through. Why not just give us five lives at the start of each new level?Bottomless pits are now signposted with big red warnings, but that only prevents you falling in when you know no better - it's still very common to tumble into them because of imprecise aerial movements or because they have been thrust into your path during a high-speed section. It's player error to an extent, but enormously frustrating and surely quite easy to eradicate. Either way, there are better ways to challenge our skills, two decades on.20-year veterans of Sonic's adventures have endured far worse, however, and if they've made it this far then they will enjoy Generations and feel richly rewarded, luxuriating in things like new unlockable audio arrangements and little nods and winks to classic design schemes that most of us will never notice.And while many have been vocal about their discomfort with Sonic's 3D releases over the last decade, even they may find a happy middle ground in Generations' hybrid levels, which continue the good work laid down in 2010's Colors and rarely if ever suffer from the camera and control problems that used to plague the 3D games. The 2D levels are certainly superior, full of tricky and satisfying platform sequences and beautiful visuals, but the modern Sonic alternatives hit high notes too, like a glorious clock-tower rollercoaster in Rooftop Run and an 18-wheeler pursuit in City Escape.Sonic Generations still doesn't do much to dissuade us that the hedgehog's best days are distant memories, but at least it is a worthy tribute to them, capturing the subtler elements of the original Hedgehog's enduring appeal although still falling foul of some of his weaknesses. And looking ahead, it also suggests that the next 20 years - for Sega will surely continue to pump out Sonic games until its dying breath - at least hold the promise of many more enjoyable birthdays to come."}