{"ref": "https://www.eurogamer.net/professor-layton-and-the-last-specter-review", "date": "22 Oct 2011", "game_name": "Professor Layton and the Spectre's Call", "text": "The conventional wisdom is that everyone hates conventional wisdom. I saw a poll recently that asked the readers of a political blog, ~Do you think the average voter is adequately informed?~ Ninety-one per cent of respondents answered ~no.~ Later in the survey came the question, ~Do you think you yourself are adequately informed?~ You already know the punchline: ninety-two per cent said ~yes.~It's odd, but our democratic society has a near-universal disdain for average ways of thinking. We love to imagine ourselves as unconventional, above the fray. That fantasy is what drives the Layton series, which celebrates the power and pleasure of a non-average intellect.Professor Layton and the Last Specter (that's the U.S. title - more on that nonsense later) is the fourth game in the series. As usual, the professor's Holmesian adventures bring him to a charming village populated by simpletons. Sure, they're eccentric and often loveable characters, clever in their own way, but still doltish on the whole. They'll buy into pretty much any urban legend, just because it's what everybody else in town believes too.As a result, sinister forces find it easy to manipulate the people's fears. In Last Specter, the village of Misthallery is paralysed by fear of a marauding phantom and a witch who places hexes on people she doesn't like. Lately, the phantom has been laying waste to local buildings in curiously precise attacks that are obscured by the fog of night. One side effect of the mayhem is that the only contractor in town has become quite wealthy, as he's hired to clean up every mess. Nobody finds this suspicious.We players have to save these simps from themselves, and the vehicle for our genius is Professor Layton. He, at least, is suspicious of the Misthallery mischief on our behalf. Unswayed by popular opinion (and instinctively dubious of it), he's an intellectual superman whose thought process always leads him to the doorstep of fact. In real life, we prove our superior thinking by watching The X Factor with ironic distance. In Misthallery, we do it by solving puzzles. The puzzles in Layton are elaborate traps for the conventional thinker. They present tasks that appear to be either impossible - like the puzzle that has you divide an assortment of seven coins into two equal piles - or all too simple.One puzzle of the latter variety asks, if one bulb in a row of 10 streetlights burns out every two hours, and a repairman can only replace a bulb every three hours, how many bulbs will still be lit at the end of 12 hours? The developers are taunting us, saying, go ahead, take the obvious path to the solution. Because they're waiting at the end with a sour squawk of music and a big ~INCORRECT~ sign, Layton's equivalent of a pie in the face. You fool! Never take the direct path. (Except, of course, when the direct path is the one to take.)As the series ages and becomes a tradition, the danger is that its mental trickery will start to feel conventional itself. I whined about sliding-block puzzles in last year's review of Professor Layton and the Lost Future, so I won't belabour the point here. Suffice to say that they have lost their ability to surprise, and they're not the only puzzles in Last Specter that feel that way.But like last year, I remain impressed overall by the Layton developers' ability to stay one step ahead of our expectations. It's amazing that the studio, Level-5, hasn't run out of ideas yet. The puzzles abound with wit and linguistic sleight-of-hand, rendered in a joyful Bohemian style that lends élan to these nerdy brainteasers.The professor's trunk has been refurbished with a new handful of side games. There's one where you train an acrobatic fish to collect coins, and another where you fill in the blanks, Mad Libs-style, to the script of a puppet show as it's performed on screen. The best of the lot is the train game, in which you weave track around a game board to navigate a speeding locomotive through stations and around hazards like oncoming traffic. It's reminiscent of  the excellent iOS game Trainyard, albeit simpler."}