{"ref": "https://www.eurogamer.net/sesame-street-once-upon-a-monster-review", "date": "14 Oct 2011", "game_name": "Sesame Street: Once Upon A Monster", "text": "If there's one audience that has been consistently poorly served by the games industry, it's kids. Not the older kids, the 8-12-year-olds with their Pokemons and Lego games. They're pretty well treated these days. No, little kids. The ones who have just started school, the four, five and six-year-olds. They love to play, it's pretty much their reason for existing, and yet because their tastes are so specific and so far removed from what developers are used to making, the games industry often pretends that they don't even exist.Cue Tim Schafer's Double Fine studio and its Kinect-fuelled interactive Sesame Street storybook, Once Upon a Monster.The question is, how to appraise such a product? In gameplay terms, this is very thin stuff - not so much a mini-game compilation as a computerised game of Simon Says. Characters do something on the screen and you copy them. For vast swathes of the game, that's pretty much all you do. For everyone weened on ~proper~ games, it's easy to dismiss.That would miss the point, however. Once Upon a Monster is driven by experiential needs rather than complex interactions, and it builds on a growing trend in pre-school television that was begun, appropriately enough, by Sesame Street. On Nick Jr they call it ~join in TV~: shows where the viewer at home is addressed directly, where they're asked questions and where the action pauses, offering a gap in which the child can shout out their own contribution to the show in question.Taking that approach and applying it to Kinect, where jumping and shouting can actually be measured and responded to, is a no-brainer.And, on that basis, Double Fine has done a predictably solid job. Once Upon a Monster is a hugely charming game, and one that goes out of its way to convince youngsters that Cookie Monster and Elmo are speaking directly to them, that they can see and hear them, and want to take them on a series of adventures into fantastical worlds full of nice monsters who need their help. Taken on that basis, it's an inspired use of the Kinect technology.There are moments where the motion tracking lets it down, of course. There are times when it refuses to acknowledge an action, and some throwing mini-games suffer from extremely woolly aim. Add in a target audience that is known for fidgeting and short attention spans, and you should have a recipe for frustration.Double Fine gets around that problem by making the game extremely forgiving. If the game senses that you're not getting an action right, or that it can't read it properly, it just moves on regardless. When it comes to a task that must be completed for the story to continue, such as an accurate throw, it adds enough leeway that even a vague gesture in the right direction will work sooner rather than later.There is a scoring system of sorts, but this proves mostly pointless and is often confusing. Each chapter of each story (there are six in all) offers up to five stars. Some are earned just for progression, but others are handed out for more opaque reasons. Is it awarding stars for speed or accuracy? It's hard to tell, and when it comes to tasks that involve dodging or steering there's a good chance that the floaty control will end up losing you marks regardless. Kids likely won't care, but for those who work out that they've been judged unworthy of five stars, explaining why might be a problem for parents.Not that the stars offer much of an incentive beyond the instinctive ~ooh, stars!~ response that children naturally have. There's a final chapter in the storybook where all the stars from each story are kept. Selecting them offers up bonus content, although I have no idea how many six-year-olds will be thrilled to discover they've earned a gallery of concept art or developer interviews."}