{"ref": "https://www.eurogamer.net/the-cursed-crusade-review", "date": "7 Oct 2011", "game_name": "The Cursed Crusade", "text": "The Cursed Crusade is a lot like Metal Gear Solid. Not in any meaningful gameplay sense, unless Solid Snake has taken to slowly swiping away at mindless enemies in a lacklustre hack and slash style, but it does love cutscenes. It loves them so much that it can't let ten minutes of gameplay go by without another one.If Cursed Crusade wins any award, it should be Most Long-Winded Game of 2011. It opens with a lengthy cutscene, which leads into another cutscene which then leads into another. Finally, you get to start mashing the attack buttons and kill a handful of enemies. Then you get another cutscene. Skip a cutscene and the game just takes you to the start of the next cutscene. And so it goes on, tiny croutons of gameplay adrift in a sticky broth of heavy-handed exposition and endless peripheral chatter.And, again, this wouldn't be so bad if Cursed Crusade had a gripping story, compelling characters and satisfying gameplay. It doesn't.The story is a hodgepodge of thin medieval cliches, with an unwelcome side order of ludicrous supernatural guff. Our hero, Denz de Bayle, is cursed, you see. This means that he's able to transform into a sort of 12th century French oni demon, which fills the world with flames, gives him cool horns and... well, that's about it.~If Cursed Crusade wins any award, it should be Most Long-Winded Game of 2011.~He supposedly hits harder and is more resilient when in his cursed form, but mostly you'll use these powers for more mundane matters like finding weak spots in walls and healing. In one of the game's only clever ideas, allowing your cursed power gauge to run dry results in health damage, although you'd have to be spectacularly bad at the game for that to happen.Denz is joined on his generic quest by Esteban Noviembre, a wise-cracking Spaniard so formulaic that he might as well be called Paella los Sombrero. Together they chug through combat scenarios that never vary from the reliable old standby of having a bunch of dudes run towards you and then take it in turns swinging their swords in your direction.The game is playable with two players, of course, which means that occasionally both characters will have to stand next to a scenery item - a wagon, a crank, a door - and press X at the same time to move it. This is pretty much the extent of the game's co-operative requirements.It's all about the combat, really, since between cutscenes that's virtually all there is to do. Cursed Crusade has the beginnings of a decent fighting system, with a complex web of different abilities depending on which weapons you're holding. A sword and shield combo offers different attacks to a spear and shield. Dual-wielding two swords opens up moves that are different to those available with a sword and mace."}