{"ref": "https://www.eurogamer.net/rochard-review", "date": "4 Oct 2011", "game_name": "Rochard", "text": "We tend to talk about physics in gaming as a reasonably recent innovation, something that came about as first-person shooters gave us ever more elaborate ways to knock lamps off abandoned desks on the way to our next frenetic firefight. In reality, game physics has been around for decades. Almost since the beginning, in fact.It is, after all, the driving force of the entire platforming genre. Ever since Mario tweaked Newton's laws in his favour to change direction in mid-air, the tactile feedback between thumb and avatar has told us not only how far we need to jump, but how far we can jump.There's a lot of jumping in Rochard, a physics-based puzzle/platform/shooter hybrid from Finnish indie studio Recoil Games. It's really good jumping as well. The sort of immediately satisfying leap that feels tangible and assured. One of the first abilities you acquire is the option to lower the gravity, enabling epic weightless lunges across the screen, the sort of small-scale action movie heroics that would leave slo-mo evangelist Zac Snyder in a post-orgasmic state of bliss.Physics also plays a large part in the puzzle elements. You're playing as hefty astro miner John Rochard (it's pronounced with a soft French twist - row-char - not as a ~rock hard~ pun) as he defends his asteroid workplace from an invading gang of space pirates. This interstellar blue collar setting gives just enough justification for a series of rooms and chambers divided up by forcefields, pressure pads and elevators, all of which must be navigated to get to your next objective.Like so many post-Freeman heroes, Rochard is equipped with a gravity gun, or the G-Lifter as it's called here. This allows you to slurp up nearby objects and then fire them off in graceful arcs. For the most part, you'll be doing this with crates, but the removal and replacement of fuses is also vital to opening the way forwards.Blue forcefields will not allow any inorganic matter through, while red forcefields block Rochard himself. There are a few other field types - yellow blocks laser fire, white blocks everything - but it's the interplay between blue and red that drives much of the game, as you work out how to get objects to where they need to go without boxing yourself in.In another fairly obvious nod to the work of Valve, there are trace elements of Portal's traversal trickery at play here, and while the game never ascends to the genius heights of that series, it's never less than a pleasure to play around with the enjoyable cause and effect of Rochard's world."}