{"ref": "https://www.eurogamer.net/pes-2012-review", "date": "30 Sep 2011", "game_name": "PES 2012", "text": "It used to be simple. Pro Evolution Soccer was the hardcore football simulation - a world of skill pentagons, nil-nil draws and anoraks for goalposts, with Pierluigi Collina's demonic face beaming at you on the cover - and FIFA was the flashy, three-minute pop-song vision of football, full of perfect, arcing screamers and Robbie Williams menu music.So EA Sports began plotting, and spent the years between 2007 and 2011 rebuilding FIFA as real football. The result is the wonderful FIFA 12 - tough, physical and precise, with a new defending system that bullies you into marking space rather than haring impatiently out of position every time you lose the ball.But while FIFA grew up into a simulation, Konami lapsed into turgid and directionless iteration, and before we knew it PES had gone senile - a once-beautiful game tweaked and twisted beyond its capacity for improvement.Since then, PES has also been rebuilding, and progress has been fast. PES 2011 was divisive, applauded by some - us included - for taking bold steps to reinvent itself as a fast-moving, aggressive new spin on hoofing leather, but criticised by many - er, us included - for tripping over itself a bit in the process and shipping before it was actually finished.The good news or the bad news, depending on how you look at it, is that PES 2012 continues Konami's march away from pure simulation, and so the action remains fast and frantic, as though the ball is being greased up at every stoppage, with the emphasis firmly on fleet-footed dribbling and violent, spectacular shooting.Play against another human and the speed of movement, nimble dribbling and imprecise tackling mean that it's very hard to regain possession using the two pressing buttons and near-useless sliding challenge, as the ball can be jinked and redirected in a split-second, and defenders are often left to spectate until the attacker takes a wrong turn into some fortuitous congestion.It's not quite the attacking bloodbath of an old-days FIFA or ISS, but it's perfectly possible for a skilled player to slalom past several of the opposition team without much difficulty, while highly skilled individuals like Arjen Robben and Leo Messi flood through defences like water through a sieve.Lengthy shot animations mitigate this orgy of dribbling somewhat, allowing defensive players to get closer to their man at the business end of the pitch. But the balance is firmly towards attack, and the result is that PES is, at worst, a game of fast and whimsical fantasy footwork - easy on the eye and frequently exhilarating, whether you're dishing it out or soaking it up.Nips and tucks since 2011 see fewer goals scored from crosses, although there are still quite a few and it remains very difficult to defend them, while some of the more glaring problems of last year are fully patched up, so you now rarely watch passes trickling past defenders who could easily intercept them, for example.The referee is still quite whistle-happy at times, but his decisions all look more reasonable now, so you don't find yourself watching endless replays of fair tackles being blown into fouls. And speaking of matters out of your control, your team-mates are much better at running into space around you, so you rarely get bogged down when you're lancing forward at the spearhead of an attack.Even better, matters aren't always out of your control now, because the addition of team-mate controls allows you to directly instruct other players to run into space. At dead balls and throw-ins you can flick the right stick to pick a team-mate and then move him around, and during open play you can also direct nearby players to make runs rather than waiting for the AI to catch your drift.PES is a lot sturdier and more rounded than last year, but it's still not quite the finished article. Ball physics in particular remain rather peculiar, with strange acceleration, unlikely conserved momentum and frequent pinball moments where a volley is smashed into someone's face and rebounds miles in another direction. On the other side of the fence, FIFA 12 is certainly no stranger to deflections, but the aberrations in PES 2012 are rather more offensive to science."}