{"ref": "https://www.eurogamer.net/pure-review", "date": "19 Sep 2011", "game_name": "Pure", "text": "Remember the first time you ever rode a rollercoaster? The intoxicating, freefall terror of plummeting downwards into infinite doom; the feeling that you're surely going to die as your stomach flies past your ears. That's Pure's stock in trade.Nestling somewhere between Burnout and SSX, you'll find Pure, hurtling through the sky, whooping and doing 1080 flips while punching the air. It's that face-wobbling devil-may-care speed madness, mixed in with mid-air sick tricks, that instantly marks Black Rock's quad-bike racer as something special. Not only is it completely insane, it looks fantastic, and has that all-important addictive immediacy that makes it a ludicrous amount of fun from the very first time you play it. In old money, Pure is a straight-down-the-line arcade racer. It essentially takes extreme sports to ludicrous extremities, and creates a world in which mentalist quad-bike riders with testosterone issues feel the need to drive hundreds of feet into the air off the side of a mountain, play air guitar during the descent, and do a few flips for good measure. Broken bones? No problem.Diving straight into Pure's main World Tour campaign mode, the game gets you into the action with the minimum of fuss. The key thing to learn is the trick system, because performing them tops up your boost bar. So every time you ascend a ramp of some kind, you're advised to 'pre-load' a jump by pulling back on the left stick and then pushing forward at the last moment in what it calls a 'flick-flick' motion. This effectively launches you into the air, and therefore gives you more time to pull off the tricks you need to top up your boost. Once you're in the air, tricking is as simple as pressing a button at the same time as one of the eight directions on the left stick. At first, you'll only have access to the first tier of tricks (mapped to the A button on 360, X on PS3) which are quick to pull off, and therefore low-risk. If you manage to pull off a few tricks without wiping out, you'll unlock a further three tiers of progressively more elaborate manoeuvres, with the added bonus of being able to gain more boost for when you need it. As you become more comfortable with tricking, Pure makes it easy to chain moves together, and one of the most efficient ways of doing this is through using the modifier button. Mapped to the bumpers on 360 or L1/R1 on PS3, this allows you to do a subtle variation on one of the eight standard tricks, and proves to be much quicker than trying to chain entirely different moves together. With practice and familiarity, it becomes quite straightforward to chain together three, four or more moves together in one leap.At the fourth stage of tricking, you're able to unleash even more ludicrous feats of stunt insanity. With a massive drop at your mercy, pressing RB+LB / R1+L1 at the same time, followed by a direction, triggers the most over-the-top moves yet, such as the spiralling Tornado or the axe-wielding Air Guitar. The hardest part is landing these signature tricks successfully, but if you do manage it, not only does your boost bar get fully replenished, but you're able to pull off another signature trick into the bargain. But with danger lurking around every bend, it takes a fair amount of repeat play before you're familiar enough with these branching courses not to keep screwing up. With incessant crashing almost a given, Pure makes sure you're respawned almost instantaneously, keeping frustration to a minimum. The only penalty is the loss of some boost, along with your most recently gained trick level, but working your way back through the pack is never really a tall order.The World Tour mode tasks players with working their way through 10 tiers of events in sequence, with 50 events in total. Similar in structure to, say, Burnout Revenge, your goal is to earn enough points to unlock the next tier, which obviously means playing through each event in the order of your choosing. Pure has three types of event: Sprint, Race and Freestyle. Each has its own specific discipline, and each sees you racing alongside 15 aggressive, determined riders.Sprint, described by Black Rock itself as the game's ~Espresso shot~, is exactly that. It's a quick hit of racing, with short, sweet five-lap races, designed around tight courses and maybe only one or two trick opportunities if you're lucky. Riders jostle for position throughout the race, and with most courses clocking in at around 20 seconds per lap, there's no room for screw-ups. But in terms of getting in tune with the basic handling and cornering techniques away from the added complication of tricking, it's always good to have a crack at these events first.Race events, meanwhile, are also simple first-past-the-post affairs, but much longer, and with much more complex courses to negotiate. Arguably the most intense challenge in the game, Race events test you on every level. Not only do you have to be fast and efficient, you need to trick to regularly in order to build up a good boost stock - and doing so is a risk-reward relationship.From the first bend, you'll face the initially daunting prospect of numerous branching paths. As you'll discover, some offer better trick opportunities, while others provide a more efficient racing line or a safer passage. With races always set over three laps, and the same tracks repeated over numerous subsequent events, you'll soon become very familiar with the complexities, and, hopefully, stop sucking quite so much. Usually by the time you reach the middle tiers of the game, it all falls into place, and you'll find yourself comfortably capable of not only racing proficiently, but tricking like a demon."}