{"ref": "https://www.eurogamer.net/the-maw-review", "date": "19 Sep 2011", "game_name": "The Maw", "text": "With production values to rival most full-price platform games, The Maw is certainly an eye-catching addition to the Xbox Live Arcade line-up. It's also an entertaining one, even if the amusement is rather short-lived.It's the saga of a peace-loving alien called Frank. Snatched by extra-terrestrial bounty hunters for reasons unknown, his calming psychic powers allow him to befriend a cyclopean gelatinous blob also held captive by the bounty hunters. This blob, dubbed The Maw, is an insatiable eating machine. When the spaceship crash-lands on a mysterious planet, Frank grabs a plasma leash from the wreckage and sets off to explore with his toothsome pet.Not only can The Maw enthusiastically gobble up pretty much any living creature of equal or smaller size, it can also take on their attributes. Much like Kirby before him (and A Boy and his Blob before that) you must use Frank's ingenuity and The Maw's unique abilities to escape the planet.There are five specific creature types that The Maw can absorb. There's the fire-breathing Gastro, the electrically charged Bulbous, a weird inflatable balloon-worm known as Puff-Tor, a manic bird called Loofer and finally the hulking tank-like Beetull. Also available for your snacking pleasure are Yums, the sort of cute pink creatures you'd normally be protecting in a game like this, and Gloobers, slug-like beasts that must be removed from their rocky shells before The Maw can chow down.Progress is exploration-driven rather than pure platforming. There are moments where Frank needs to let The Maw off the leash so he can clamber to otherwise-inaccessible areas, but the main challenge is working out which powers you need The Maw to adopt, and how to manipulate the wildlife in order to achieve this aim. Frank isn't completely defenceless. He can use the leash to pull large rocks around, to pick up and throw objects and to snare smaller creatures and toss them into the gaping gob slobbering behind him. This is important since, in the style of Katamari, the level only lets you leave once The Maw has achieved a certain size.It's not exactly challenging, since there's no way of dying and no penalty for snuffling around looking for extra stuff - such as the secret Snuffle hidden in each level. Assuming you're exploring every nook and cranny you can expect to polish off each level in around twenty minutes, and with only eight levels (the last of which is...different, to say the least) that doesn't add up to a massive amount of playtime.That's not such a bad thing, however. It definitely leaves you wanting more, and it never outstays its welcome or feels needlessly padded out. It's a shame the game never really seizes the potential of the Maw concept though, since at no point is there a choice between abilities, or puzzles that require more sophisticated use of the various powers available to you. There are also some persistent niggles, such as a camera that really doesn't like you looking upwards, Frank's slightly sluggish movement and the way The Maw needs rather too much micro-management. It'd be nice if he could hungrily round up whatever beasts you unearth for him, but you either need to feed him yourself or guide him by hand so that his food is right in front of him.What the game does have is character. It's a lovely-looking title, arguably the most graphically polished game on Live Arcade despite some occasionally rough environmental details, and both Frank and The Maw are an absolute pleasure to watch. Frank's wide-eyed affection and his endearing calls of ~MAAAAH!~ when his pal wanders off are cute enough, but it's The Maw who steals the show. A combination of Slimer from Ghostbusters and Animal from The Muppets, he's a goofy and lovable slob, even as he grows from tiny globlet of slime to enormous B-movie monstrosity. There's a wonderfully subversive enjoyment in knowing that Frank is naively unleashing a beast that will probably go on to eat the entire universe.The Maw is the sort of game you'll play for an afternoon, giggling like a fool the whole time. There's not much more to it beyond that brief but satisfying flurry of amusement, unless you want to go back into each level to harvest all the Achievements, but not every game needs endless replay value. The Maw is charming, cheap and memorable enough that its short lifespan shouldn't put you off."}