{"ref": "https://www.eurogamer.net/kane-and-lynch-2-dog-days-review", "date": "19 Sep 2011", "game_name": "Kane & Lynch 2: Dog Days", "text": "I can't help wondering what the atmosphere in the IO Interactive office was like when EA announced details of Army of Two: The 40th Day. Both sequels were revealed within a few months of each other last year, and the similarities are startling.Obviously, they're both follow-ups to third person co-op shooters with a heavy focus on cover and flanking, so the gameplay echoes are to be expected. They're also both set in Shanghai, in the aftermath of one last job that goes disastrously wrong. Both concern themselves with helping our foul-mouthed amoral anti-heroes battle across the city to freedom. Even the dual animation for opening doors feels familiar.It's the depth of gameplay, or lack thereof, that proves the distinguishing factor. Army of Two wasn't the most innovative game around, but it at least included a robust co-op system and weapon customisation. Kane & Lynch 2 offers... shooting. Lots and lots of shooting. And pretty much nothing else.The story picks up with world-weary Kane arriving in Shanghai to help paranoid psychopath Lynch, his erstwhile partner, finish off some vaguely sketched black-market arms deal. The two haven't spoken since it all went a bit Bad Boys II at the end of the first game, and there's a nice undercurrent of tension in the opening moments that suits the edgy atmosphere. There's unfinished business between the two, but before it can be resolved, Lynch wants to put the frighteners on a snitch. Bing bang boom, the shooting starts, and doesn't stop until around five hours later when you plop out the other end of the disappointingly slender story.There are a number of first impressions of Dog Days that grab hold early on and never really dissipate. First is how it looks. IO has opted for a grainy, lo-fi, ~YouTube~ visual approach, and while you can appreciate the flickering urgency it brings to the cut-scenes, its impact on the gameplay is distracting rather than immersive.That shaky handheld style is divisive enough when used for action scenes in movies like The Bourne Supremacy, but for a game where there's nothing but action for hours on end, it's often downright nauseating. Sprinting is especially problematic, as the camera lurches and judders behind you, the scenery swaying in and out of focus. This, at least, can be switched off in the pause menu, but you're still left with a game that looks cheap and ugly.Light sources fragment and flare all over the place. Gory moments are buried under censorious pixel smears. Fast movement results in deliberate screen artefacts, mimicking the effect of a low resolution movie blown up to HD size. The gameworld blurs and flickers and flares constantly, to the extent that I found myself taking a break after each level to allow my rapidly encroaching headache to subside a little.This has a knock-on effect on the characters themselves, with models that are sparsely detailed and poorly animated. At one point in the second stage, while protecting a limo from attack, I was taken aback to notice that some of the enemies didn't even seem to have proper faces, just vague, lumpy people-shapes smudged under the digi-smear effect. There's a British crime boss who looks like someone tried to digitise Michael Caine but got an inflatable Harry Hill sex doll instead.The main characters fare slightly better, but even then the low-tech approach sells them short. Kane's stubbly beard jitters about on his face as if he's covered in flies, while close-ups have a bizarre, waxy sheen. A section in which the pair fight their way through a shopping mall, stark naked and bleeding from multiple razor cuts, looks more like something out of Silent Hill. And not in a good way."}