{"ref": "https://www.eurogamer.net/disciples-iii-renaissance-review", "date": "19 Sep 2011", "game_name": "Disciples III: Renaissance", "text": "I'd love to be able to start this review by telling you about the time in Mission 4 I was held hostage by a talking codpiece, or the bit in Mission 7 where I fought undead tapeworms inside the gut of a flatulent troll princess. Sadly, I can't. Nothing anywhere near that anecdote-worthy happened to me. Though Disciples III is mechanically very similar to the fabulous King's Bounty, it doesn't have any of that game's wit, energy or quirkiness.That isn't to say it's not deserving of your precious time. Disciples III's face might be po, its laces strait, but only the most ardent fantasy hater or inflexible Heroes of Might and Magic aficionado could actively dislike its hearty turn-based mixed grill of exploration, character cultivation and hex warfare.Whether you're playing one of the trio of hefty campaigns, the hot-seat multiplayer or the lone single scenario, you start off feeble, ill-equipped, and surrounded by darkness. Level maps are crammed with SSSSSSIs (Sites of Special Sword, Sorcery, Stat or Supply Interest). Creep camps, resource-producing settlements, loot hordes, buff buildings, and crawlable dungeons... you can't move your party ten paces without them stumbling on something clickable. As you push deeper into terra incognita, neutralising opposition and claiming the all-important guardian nodes, the stone and gold necessary to recruit new personnel and build city structures streams into your storehouses. The mana required to learn and cast spells and create runes also accrues. Before you know it, you're leading a gang of strutting toughs with more hitpoints than they know what to do with and scoffing haughtily at the thugs, wolves, and giant spiders that once turned your blood to ice.Of course, by this time, those thugs, wolves and giant spiders aren't nearly as common as they once were. Their place has been taken by armoured trolls, stiletto-twirling inquisitors and shambling demons the size of bungalows. Playing the campaign on the standard difficulty setting, you might coast for an hour or two on occasion, effortlessly slaying everything that crosses your path, but a tightly straitjacketed storyline means tricky encounters can't be sidestepped forever.For every battle in which you confidently press the auto-combat button and nip off to the Bog of Piney Freshness, there's one in which you're glued to your seat, nervously shuffling forces, preying for critical hits, and vainly scouring your inventory for heal elixirs and runes of stone golem summoning. For Disciples disciples, the most welcome aspect of the Renaissance renaissance has to be the revamped combat system. Gone is the old 12-square chessboard with its static pieces; in its place is a 117-cell hex-grid on which units can roam at will. Should I try to get my titan onto that melee-boosting hotspot in the centre of the arena, or keep him close to my vulnerable acolyte? Should I block that causeway between the boulders with a summoned elemental or rush everyone forward in an attempt to overwhelm their archers? Every battle is strewn with testing tactical dilemmas. Enemy AI could be sharper - its target choice and use of advantageous terrain isn't always brilliant - but the stiffness of the opposition frequently masks the shortcomings.As someone that plays more wargames than RPGs, I would like to have seen a tad more realism in the battle layer, and a touch less reverence to genre convention. Large rocks and combatants block movement but not missile fire, AI retreats are rare, and the grievously wounded seem as capable of delivering fatal blows as the fighting fit.I'd also like to have seen more varied arenas and spectacular special abilities. Though the character animations are generally superb - watching a titan swat a goblin with a tree-trunk club never gets old - and the spell effects sumptuous, there's nothing here to rival the baroque splendour of King's Bounty's Spirits of Rage."}