{"ref": "https://www.eurogamer.net/darksiders-review", "date": "19 Sep 2011", "game_name": "Darksiders", "text": "Ah, betrayal. With the possible exception of Brain Training (and I stress ~possible~), all videogame stories are about betrayal. Darksiders' certainly is. You play as War, one of the four Horsemen of the Apocalypse, and in this alternative retelling of the Revelatory bits of the bible you find yourself called to Earth to judge the sinners before everyone's ready.You've been betrayed. The higher-powers-that-be reckon you're to blame for mankind's untimely destruction. It's only by the grace of the Charred Council - the Simon, Louis and Cheryl of obelisk-based supernatural arbitration - that you're allowed to return a century after the end of the world to try and put a lid on things. And only then if you agree to have Mark Hamill escort you in the form of a devious sprite called the Watcher who lives in your arm.You're here for revenge, but ostensibly you're here to do the Council's bidding, and that bidding translates into a mixture of puzzle-heavy dungeon-crawling and brutal hackandslash, played out in a colourful, fairly-openworld third-person action game full of collectables and upgrades to gather, many of which allow you to do new things in areas you've already visited. We're back in Metroidvania territory then, but sales of Batman: Arkham Asylum and Shadow Complex last year suggest Darksiders is in good company - and 15 hours rampaging around the end of the world suggest it belongs in that company too.It certainly has the component parts. Each location yields a new toy - a grappling hook here, environmental Bullet Time there - and puzzle and enemy design falls into step with the timeline of new gizmos, demanding that you consider your new contraption first and foremost before you're gradually invited to use it in combination with other tools once you get the hang of it.As you progress through the interlinked districts of the game's cauldron of post-apocalypse, the developers demonstrate they understand the subtler side of a good Metroidvania too. Some gadgets are nifty in and of themselves - a portal gun, for instance - while others are seemingly prosaic, like a boomerang device called the crossblade and an earthquake gauntlet, but all of them are used in inventive and measured fashion. Most vitally, and no matter the scale of the complicated puzzle you're solving, you come to trust the game to treat you respectfully and deposit you in the right place to make quick progress once you're done with something.There's attention to detail, but that attention to you is evident all the way through. Some of the puzzles in the Destroyer's tower near the end, for instance, ask you to gather light sources and transfer them to a central hub, which involves retreating through your own footsteps using different mechanisms and combinations of your gadgets to the ones you used originally. While many elements of the level furniture that you require to go in both directions are in plain sight at all times, it's always clear what is relevant now and what will become relevant later on.Combat is the other great pillar of the game, and there are boatloads of ways to fight people in Darksiders, with an impressive range of mashy sword attacks, secondary weapons and combo attacks to discover or purchase from the sinister shop-demon, Vulgrim. You can also earn Wrath attacks - spikes from the ground, spinning knives, that sort of thing - and equip active and passive modifiers to your key weapons.You even get to use projectile weapons occasionally, including a sort of angel cannon and a demonic grenade launcher with remote-detonation capability. However you fight though, individual skirmishes usually end as you opt for an ultraviolent one-button finishing move once an enemy is in a dazed state.These finishers are dazzlingly gratuitous and gory, to the extent that by the end of the game the sight of War merely slicing an angel's wings off and then impaling it on his gigantic Chaoseater sword is utterly blasé. You take out one boss by going inside its head and cutting it apart from the inside out, and in another satisfying outcome you dispatch a long-term antagonist by squashing his head in your fist. Other demons simply have their arms lopped off at the elbow before you stab them in the face, and giant worms must learn not to expose their bellies."}