{"ref": "https://www.eurogamer.net/download-games-roundup-review-49", "date": "9 Sep 2011", "game_name": "Reviews", "text": "When some of the best indie games struggle to sell four figures, it can make bigging up the indie scene feel a little like shouting into an empty room.But there are so many competing platforms now, it's hardly shocking if gamers end up passing over things that they would almost certainly love. The answer, unsurprisingly, is to try to make a bigger noise by being organised and running special seasons like the Indie Games Summer Uprising on Xbox Live's Indie Games channel.I'm not convinced that even this has made anyone sit up and pay attention to what's going on, but it's not going to stop us from giving it the space such an idea deserves.Admittedly, the line-up isn't truly stellar. Compared to some of the genuinely excellent stuff that has appeared on Xbox Indie Games over the last couple of years, it's not quite what we had hoped for - but at least two, possibly three of the 10 games are well worth your time. And for a few quid (with free demos to assess), it's a reminder of the alternatives to the endless sequels out there in the 'real' world.The curious Canabalt sub-genre will literally run and run - possibly forever, in all manner of directions until it does ever-decreasing laps of itself, falls over dizzy and throws up over us all. Presumably that's where T.E.C. 3001 comes in. With the cold-hearted logic of a robot, the Tesla Energy Collector is on a mission through virtual space to harvest humans' leftover energy. What that means for us is a 21-level sequence of third-person 3D athleticism, as you sprint, jump and slide your way to the finish line.What could be just a throwaway retread of an overused idea comes alive with its arresting, cold, cybernetic visual style and a spongy control system that has you weaving past obstacles like a desperate commuter across a packed train concourse. The relentless trial-and-error nature of its one-minute-long levels means that frustration is rarely far away, but that won't stop you coming back for another 20 attempts to nail safe passage through these increasingly complex environments.If T.E.C. 3001 were an XBLA title, few would question it, so to discover it nestling in the bargain racks of the Indie Games channel might give you an inkling of the quality you can find when you bother to look hard enough.8/10 This article contained embedded media which can no longer be displayed."}