{"ref": "https://www.eurogamer.net/serious-sam-double-d-review", "date": "2 Sep 2011", "game_name": "Serious Sam: Double D", "text": "Serious Sam has one trick. It's simple, but effective. First it puts a big shiny thing in front of you. ~Check this out, Dicky-boy, it's a COLLECTIBLE!~ You pick it up, and immediately a hundred monsters spawn around the plinth. You either emerge like Bruce Campbell clutching your prize between clenched butt-cheeks, or reload and pick up the shiny thing again in all innocence. And then, a little way on, you find another shiny thing. Serious Sam: Double D, a 2D spinoff from the series intended to whip up some love before Serious Sam 3 hits, certainly gets that right. It's a side-scroller with few surprises but one trick, with a fistful of B-movie monsters that get ever bigger and a load of shiny things waiting to be snaffled. Why have one enemy when you could have 15?Inasmuch as there is deep satisfaction in blowing apart something grotesque with a gun, Serious Sam: Double D delivers - and delivers big. Barring the piddly default gun, Sam's arsenal is serious stuff: rocket launchers, flamethrowers, shotguns, all the fun of the fair at 50 decibels. The sound effects are booming and their effects are messy and immediate - when a shotgun sounds right, the wet explosions feel right.Coming at you, bro, are 2D versions of Serious Sam enemies: the one with the big eye, suicide runners, giant insects, gorillas in rocket packs and gigantic bioweapons. All are vulnerable to bullets. They're a charming bunch, and the animations are especially nicely done - the arms on the basic clawing enemies jerk up and down instantly, while the gorillas swoop in fluid little arcs and spin off in 360s to explode. You couldn't call SSDD a great-looking game, but that's not really what it's going for; it's a cheap and cheerful type of gaudy, one that fits enemies like a headless woman holding bombs over her breasts perfectly.So this is what happens: Sam walks forward, tens of enemies spawn, you shoot 'em up and then press forwards. The levels are mostly built around walking to the right, although there are occasionally multiple paths to choose and even the odd puzzle.There aren't too many of these, and it's a bit of a pity because they're a welcome change of pace - getting out of a pit by building a ramp of dead monsters, or playing the matador to make charging enemies build a corpse-bridge across spikes. Later you'll acquire a jump pad, which can be used for a neat wall-hopping trick, but it doesn't add a huge deal otherwise.  The shooting is a case of quantity over quality - for most of the game, you'll be holding down the right trigger and hopping around a gradually diminishing pile of enemies. Though certain weapons have a great kick to them, and it's obviously satisfying to kill something that's many times the size of Sam, it never quite feels good enough to justify the repetition of the whole concept. There's nothing dreadfully wrong with it, no definite flaw like unresponsiveness to point to, but it never feels just right - and surely a game that depends on shooting should have fantastic, out-of-this world gunplay."}