{"ref": "https://www.eurogamer.net/star-fox-64-ds-review", "date": "1 Sep 2011", "game_name": "Star Fox 64 3D", "text": "In the absence of genuinely new games, this one was always going to work pretty well. Not only is 3D uniquely suited to rendering Lylat War's angular Arwings and chunky extra-terrestrial battlefields, but Star Fox 64 3D - it sounds, just for a minute, as if he's been shipped off to prison and assigned a number - as been helped onto Nintendo's handheld by Q-Games, the outfit that created the wonderful and quietly unappreciated Star Fox Command. Remember that one? It took the farmyard sci-fi dogfighting template and rubbed some funk on it in the form of a light coating of turn-based strategy. It's almost sad to see the developer retreating to a remake for the follow-up. Thankfully, the team has handed in another lovely piece of work.Sharing development duties with Nintendo, Q-Games hasn't just cleared up the audio and messed around with the Z-buffer to make Fox's classic N64 adventure output in 3D. The developer's gone much further, adding new backdrops, loads of fresh environmental detailing and textures, and - as far as I can tell - comprehensively reworking all the lighting and models. The game still looks the part, but it's Star Fox 64 as you remember it rather than as it actually was - and that's a huge distinction. It's the same adventure, but it's been lovingly rebuilt strut by strut, and Q has managed to restore that elusive new car smell. If only they'd gotten rid of Falco while they were at it.The effort on display makes for a nice surprise, as does the fact that the original design, which is now 15 years old, holds up really well. The world map offers a range of paths from Corneria to the toxic planet Venom where the villainous Andross has been exiled (if you're going to exile a villain, incidentally, sending them somewhere named Venom probably isn't the best idea), and a lot of the fun of the game is found in blasting through the campaign again and again, trying to remember the different criteria that will alter your journey. How do you get from Corneria to Sector Y, rather than Meteo? Can you avoid stopping off on Titania to rescue Slippy? It's an ingenious and thrifty structure, and it feels very Nintendo. It's the Game Boy hardware design philosophy applied to software.Away from the world map, Star Fox's adventures still have a frantic pace to them whether you're racing through space corridors and accidentally blasting Falco, or battling in all-range mode's arena sequences. The sky is dense with enemies, while attack waves have a kind of 3D Galaga elegance to them, and are filled with fleeting opportunities for multi-target kills. The levels look beautiful, too: coming in low over Corneria you'll skim past translucent oceans and around jagged mountain ranges that weren't half as nice before, while Kitana is now a landscape of glinting lakes above which flutter huge clouds of enemy craft and that hovering mother ship."}