{"ref": "https://www.eurogamer.net/quarrel-review-1", "date": "1 Sep 2011", "game_name": "Reviews", "text": "I had heard that Kali was good. Heard she was better than Malik and better than Rex, and both Malik and Rex were good too. I'd scoped her out, read the profile, boggled at the Word IQ of 195. Even the name was a giveaway. Kali. I'd seen Indiana Jones and the Temple of Doom.I thought I knew what to expect, but I didn't. Not even close. Lumbago? Celerity? Vanadium? (It's something to do with metal, apparently.) Kali was pulling open parts of the dictionary that I didn't even know existed. Her words were weapons, and she flung them at me quickly. With great celerity, if you will. Over at Denki, Quarrel was initially play-tested as a board game, and it still feels like a board game. There are the bright colourful layouts for one thing, and the sprightly rattle of tiles as the anagrams get doled out for another. Even the logo looks like it should be on the front of a dog-eared box that lives at the top of a bookshelf somewhere. It's Risk mixed with Scrabble, if you want to be brutally reductive, and you can imagine that, played with friends, it would be right up there with either of them. It's tactical and cerebral enough to bring a little depth to kitchen table warfare, yet it's sufficiently swift and nasty to get people yelling at each other nice and quickly too. So, yes, as an exclusively single-player game - which is what it now is, pending a potential multiplayer patch - Quarrel really shouldn't work. Who wants to play a virtual board game by yourself? Who wants to face off against cold AI, when you could be squabbling with real pals? The funny thing, though, is that Quarrel does work. And it works because of 'people' like Kali.The idea is simple: flung out across a segmented map, you fight up to three AI players for ultimate control of the territory. Play is turn-based, and in each round you can move troops between adjoining tiles to shore up your defences, or attack players where your tiles meet theirs, in order to grab more land for yourself.So far, so Risk - but attacking is where Scrabble comes in. Each battle sees you and your foe given an eight-letter anagram, and the winner comes down to whoever can construct the highest-scoring word before the time-limit runs out. Letters are assigned values on the basis of how awkward they are to use - vowels are low-scoring, weirdoes like J and Z are worth considerably more - and each player is limited by how many troops they've brought to the battle.If you've got four troops, that's a four-letter word limit, which means you're in trouble if your opponent's heaved up with an army of seven. As with Risk, it ensures a neat tactical link between individual fights and the wider war being waged on the rest of the board.There are a handful of clever tweaks to the central premise. Capturing enemy treasure, for example, allows you to slowly charge up a meter that eventually lets you chuck a bonus troop into battle, while fights you're not involved in - when the AI is attacking the AI - aren't quite as dull as they should be, as you're free to try to untangle the same anagram they're working on for bonus treasure too."}