{"ref": "https://www.eurogamer.net/god-of-war-collection-volume-ii-review", "date": "29 Aug 2011", "game_name": "God of War Collection Volume II", "text": "Does context matter? This is the question that's been whirling around in my head, like the Blades of Chaos, as I battled through the two PSP titles in this collection, now reborn in HD for the PlayStation 3.A good game should remain a good game wherever it lands, surely? And both Chains of Olympus and Ghost of Sparta are assuredly good games, at least within their own narrow niche of blood-spattered melee combat. But they are unmistakably handheld games reworked for a different format. Does that lessen their appeal, or simply remind us of their more humble origin?Let's not get ahead of ourselves. Following the success of the first God of War Collection, which transferred the first two games into HD so that fans could enjoy the whole trilogy without having to sully their eyes with olden days pixels, it was somewhat inevitable that their handheld cousins would also get the PS3 treatment, enabling the Kratos completists to have all his brutal escapades in one place.In Chains of Olympus, released in 2008, Kratos is angry that the goddess Persephone is trying to destroy the world, and so sets off to kill the s*** out of a bunch of dudes. In Ghost of Sparta, released in 2010, Kratos is furious that his brother is being held in the underworld, and sets off to kill the s*** out of even more dudes. Also, monsters.That, in a nutshell, is both the strength and weakness of the God of War series. Kratos, our nominal hero, is a walking tantrum who stomps around Greek mythology murdering pretty much everyone he meets, having QTE sex with anyone left and then shouting about how angry he is. Subtle he ain't, but he is pretty much perfect for a game where extreme violence is the driving motivator.And here's where the restrictions of the PSP make themselves known. Yes, there's violence here, but it's timid in comparison to the ludicrous over-the-top slaughter of the main series. You'll rarely see more than four enemies on screen at once, the methods available to you for killing the s*** out of them are limited and those epic boss battles are considerably less jaw-dropping. Puzzles, never a particularly pivotal part of the series, get short shrift with basic block-shoving and pressure pad combinations seeing you through most encounters when they arise. Even the Quick Time Events that are used to take down the boss monsters feel rudimentary when played alongside the flesh-rending button-matches from the other games.Perhaps most obvious is the loss of agility. Where Kratos once sprang and slashed with balletic ease, here he feels heavier and lumbering, his movements programmed for the limited travel of the PSP's slippery control nipple. With a full analogue stick to play with, there's a heaviness that takes some getting used to. It's not terrible, but it's definitely noticeable."}