{"ref": "https://www.eurogamer.net/download-games-roundup-review-51", "date": "15 Aug 2011", "game_name": "Reviews", "text": "Nintendo deserves plenty of credit for the swift, decisive action it took recently to address the price of the 3DS - but it glosses over the equally pertinent issue of the pricing of the games.Some of us still accept that the genuine blockbusters can, on occasion, justify bigger price tags, but it's the cost of the downloadable titles that's really puzzling. Unlike rival services, Nintendo seems unable (or just plain unwilling) to adjust prices when they've been available for a while, or offer special deals. Instead, a growing number of titles sit and stagnate at prices that make little sense when you consider the quality that's offered elsewhere.It's easy to point to mobile phones, but actually, Sony has been admirably proactive lately, with plenty of deals on a wide variety of its downloadable catalogue. Whether it's been successful is hard to gauge, but at least it's not sitting on its hands. The freebies offered to PlayStation Plus subscribers, in particular, are well worth looking at. Nintendo, meanwhile, appears content to let the world change around it. No wonder the financial community is panicking.On that note: games!There's something irrationally offensive about a download game designed to act as an advert for a boxed product - and given how badly the Red Faction: Armageddon one went down recently, confidence in Kill Team cutting the mustard wasn't exactly high. But once you put aside your distaste and just take it at face value, it's a fine example of how to position a companion release.Kill Team comes across as a relentless top-down twin-stick shooter in which you have to see off thousands of Orks. Think Gauntlet meets Alien Breed with lashings of testosterone and you're close.But unlike the slightly disappointing Alien Breed reboot, Kill Team is wisely designed for two-player co-op from the get-go, rather than as some sort of bolted-on afterthought. (The lack of online co-op is a troubling omission, though.) Happily, it's great fun on your own regardless.It also benefits from a surprising amount of strategy and variety. It's not just a case of wading in and blasting or melee-splatting everything until it falls over and stops respawning. Well, it is a bit, but the difference is that choosing your pick-ups wisely becomes all-important when all hell is breaking loose around you.For a while you do feel a bit overpowered, but once you're comfortably in the groove the level designers know exactly when to test that complacency and progress isn't the foregone conclusion you thought it was.And it's a great-looking game too, with high production values and a great sense of direction as the camera dramatically sweeps around you to shift the focus of the action. With the leaderboard-chasing survival mode adding a bit of meat to the three-hour campaign, there's more than enough here for your money. Whether you're a Warhammer 40K aficionado or not, this is just the right kind of uncomplicated stress relief to distract you from the BBC News 24 ticker.8/10 This article contained embedded media which can no longer be displayed."}