{"ref": "https://www.eurogamer.net/call-of-juarez-the-cartel-review", "date": "19 Jul 2011", "game_name": "Call of Juarez: The Cartel", "text": "Call of Juarez is one of those peculiar mid-range series that have somehow survived an industry climate that is supposed to have finished off everything between tiny indies and blockbuster juggernauts. The first two games, set in the Old West, received favourable reviews and decent sales, yet you'd struggle to find anyone who calls themselves a fan of the series, or can name the characters. This is not a franchise that inspires devotion or passion.Perhaps sensing this, Ubisoft and developer Techland have shaken things up for this third entry. Out goes the Wild West and in comes modern-day Los Angeles, where federal agents battle Mexican drug cartels for control of the US border and the street narcotics trade.It's a curious swap, and one that never really sells the notion that this is ~the new Wild West~. In fact, out of the game's 15 levels, only a couple are set in the badlands of Mexico rather than urban slums, nightclubs and docks. One stage, at least, takes us back to the familiar streets of Juarez, now a dilapidated ghost town, and provides a tangible link to the previous games.One of the three playable characters also offers a slim umbilical cord between the old games and the new. Ben McCall is a grizzled LAPD detective who is also a descendant of the fire-and-brimstone preacher from the original game. He's joined by DEA agent Eddie Guerra and FBI hotshot Kim Evans. They're a clichéd bunch in many ways, saddled with dialogue that makes cartoonish overuse of the words ~mother****er~ and ~bitch~, but over the course of the game they rise above their B-movie origins and become surprisingly compelling.In fact, the story is one of The Cartel's greatest strengths. This is an action thriller very much in the vein of early Seagal rather than an over-the-top Grindhouse blowout, and despite the excess profanity speckling the script it manages to maintain a reasonably serious tone while blowing cars up on the freeway and indulging in running gun battles on public streets. It's hardly high art, but there's a cohesion and balance to the mayhem that fits perfectly with the sort of 1980s action movie tone that so many other games try - and fail - to create.Key to this unexpectedly compelling yarn is the interplay between the three leads. The stated aim of the game is to bring down the Mendoza Cartel and find out who bombed a federal building on Independence Day. The real narrative lies with McCall, Guerra and Evans as their interagency rivalry threatens to derail their investigation (which, admittedly, just involves shooting lots of people).Each character has their own professional agenda as well as personal reasons for following the case. For McCall, it's all about catching a man who crossed him in Vietnam. For Guerra, it's a chance to get enough dirty cash to buy himself out of a gambling debt. Evans has a brother running with a Compton street gang at the thin end of the drugs wedge.These duelling motivations spill out of the cut-scenes and into the gameplay itself. This is, after all, a three-player co-op game, but the need to work together to get past the enemies is tempered by an extra layer of gameplay in which each character is looking out for special items that further their own ends.For Evans, it's marked guns that aid the FBI investigation into arms smuggling. Guerra is hunting for packets of dope he can sell on the side. McCall, for some reason, collects walkie-talkies. All are highlighted with an eyeball icon when you're within ten metres, but here's the twist - all of these must be snatched without the other players seeing.There are ~secret agenda~ objectives on some levels as well, delivered by hushed mobile phone calls. These might find you planting a bug, aiding an informant or finding evidence. Again, these must be completed out of sight of your partners."}