{"ref": "https://www.eurogamer.net/mobile-games-roundup-review-39", "date": "11 Jul 2011", "game_name": "Reviews", "text": "There seems to be a near-universal acknowledgement that the iTunes App store is, to put it bluntly, a bit crap. So why on earth hasn't Apple done anything to evolve it?Perhaps the overwhelming sales numbers has convinced the company to stick with this 'winning' formula, but you can't help but wonder aloud how much more successful it could be if it made browsing a less painful process.When browsed from a computer (where I tend to browse), a simple task like selecting iPad   games is a bizarrely convoluted process, but the storefront itself must be a complete travesty to anyone actually trying to get their games in front of people. Unless you're one of the lucky few that gets pulled out for selection in 'New & Noteworthy' or 'What's Hot', your game is going to get almost zero visibility. And even if it does, the chances of it staying visible are even less likely without a concerted PR push elsewhere.It's much the same story in the Android Market, while the less said about Microsoft's efforts on Windows Phone 7, the better. Anyone would think they were trying to make the process of finding out about the best new games as much of a ballache as possible. Which is where we come in. Look! Games!As part of Kairosoft's ongoing quest to simulate every facet of human existence, the Japanese studio turns its all-seeing-eye to education.As with its other endlessly infectious efforts (Game Dev Story, in particular), the aim is to become top dog in your field through a mixture of diligent resource management, astute hiring (and firing) and building the right facilities at the right time.As a formula, you'll know what to expect by now; it's presented in the exact same adorable pixel art style of its other trio of releases and features the usual drag-and-drop mechanics and simple drop-down command interface.But while it gives the usual impression of instant accessibility, it crucially lacks an adequate tutorial (unlike the excellent Grand Prix Story) and largely leaves you to your own devices to figure out the ins and outs of building up your educational institution. Without an a defined set of goals to shoot for, its likely that you'll spend early hours watching pupils and teachers wandering around aimlessly, until you eventually run out of cash and dive into the help menu to figure out what you're doing wrong.Given time, though, and Pocket Academy gets under your skin just like the other Kairosoft efforts, largely thanks to the attachment to your pupils, the satisfaction from their eventual progress, and the burgeoning relationships with other pupils. It's enough to bring a tear to your eye.8/10 This article contained embedded media which can no longer be displayed."}