{"ref": "https://www.eurogamer.net/resident-evil-the-mercenaries-3d-review", "date": "5 Jul 2011", "game_name": "Resident Evil: The Mercenaries 3D", "text": "With The Mercenaries 3D, Resident Evil finally sheds the last vestiges of its horror past and gives in to the third-person shooter urges that have been tugging away at the franchise since 2005, when this game mode first appeared as an unlockable bonus in Resident Evil 4.It's an unpretentious timed shooting gallery, more interested in leaderboards than atmosphere and dread. You pick one of eight characters, all drawn from Resident Evil lore with their own unique weapon sets, and then dive into thirty stopwatch missions aiming for the best time and high score. There's no story, no pacing – just enemies and locations from the fourth and fifth games, shuffled around and thrown in your face relentlessly.And it works, at least to start with. Hush the nagging voice that asks ~shouldn't Resident Evil be scary?~ and The Mercenaries is a solid and often satisfying action game. Control is simple, with movement assigned to the thumbstick, while the right bumper sweeps you into first-person view for aiming and shooting. This being Resident Evil, there's no shooting from the hip or moving while aiming. Well, that's not technically true, since you can shuffle around in first-person view by holding the left bumper as well, but it's fiddly, sluggish and more likely to get you killed than simply dropping your weapon and making a run for it.The Y button is called into service for most important functions, including the collection of dropped ammo and green herbs, so your thumb doesn't have far to travel in the thick of the fighting. The A button instantly uses a health item, while up and down on the d-pad flick through your weapons. The touchscreen can be used for more detailed inventory work, such as selecting a grenade or mine, but this can be unreliable as you'll be tapping with your left thumb rather than the stylus, and soft flesh doesn't always give the immediate effect you need.Mostly, however, it's a dependable control map and one that quickly becomes second nature. If the game has a technical failing, it's that the small screen of the 3DS means that peripheral vision is vastly reduced and navigating past low obstacles becomes a problem as they disappear off the bottom of the screen along with your unseen legs. The view tips down automatically if you descend stairs or a ramp, but you'll still spend a lot of time waffling around trying to position yourself over an item or trying to get past a barrier in a hurry.This claustrophobic feel would be beneficial if the game was interested in spooking you, but with enemies that simply stand around or stampede towards you it can feel restrictive. Enemies won't attack straight away, lunging in close then hanging back so you have time to at least retaliate, but there are still instances where you can be clobbered or grabbed from behind with no way of knowing what was coming.Some weapons deliver the sort of impact you hope for but others, such as the sniper rifle, feel strangely weightless. Headshots are no longer a guaranteed kill, and it's easy to waste ammo plugging away at an enemy who is suddenly resilient for no apparent reason.When the parts click into place, however, these wobbles are easy to forgive. Building up a combo streak, alternating between weaponry and melee to rack up points and time bonuses, making use of the environment to stay one step ahead of the throng – this all hits the sweet spot, and it's here that the game really starts to pull you into its bloodthirsty orbit. Sadly, despite this promising bedrock, the game's weak structure holds it back from achieving its potential."}