{"ref": "https://www.eurogamer.net/dynasty-warriors-gundam-3-review", "date": "5 Jul 2011", "game_name": "Dynasty Warriors: Gundam 3", "text": "They all look the same, so they say. Blindness to nuance and personality in the face of the unfamiliar has always been the bigot's way, and how many gamers are guilty of the same when looking to Koei's Dynasty Warriors series? ~There's no real challenge,~ they argue, setting the difficulty to easy and switching off after an hour. ~You simply mash the buttons to trigger an apocalypse of fireworks,~ they explain, ignoring the capacity for skill beneath the pyrotechnics. These are half-empty criticisms for anyone who has invested the time and effort that Koei and Omega Force ask. The developers may have failed to keep pace with global trends, leaving their once-commanding hack-and-slash series fading in the face of newer, bolder creative visions. But only a wilfully ignorant critic would claim nothing changes from release to release.Dynasty Warriors: Gundam 3 arrives, then, as the most refined of the series' robot spin-offs in recent years. In fact, it's one of the most pacey and exciting Dynasty Warriors games of its generation, and it outshines recent entries to the mainline series in almost every way. Make no mistake: there are shortcomings here. But approached with the right mindset and expectations, this a game that offers considerable breadth and depth.For Gundam fans, it is a crafted package, packing a huge number of battles from the long-running animated series' mythology into the journey. While there is a main storyline to pursue, the quick-fire nature of the stages (many of which can be completed in as few as three or four minutes) means that you'll be dipping in and out of historical fights across various timelines. The game's freeform structure runs several campaigns concurrently, allowing you to flit between those in which you must befriend another character to those set in the distant past, revealing the key protagonists' backstories.~The cel-shaded mecha have a solidity and grace that the Dynasty Warriors titles set in the Romance of the Three Kingdoms era have always struggled to achieve.~That said, only the most avid Gundam devotee will be able to maintain a handle on the huge cast of characters (52 are playable, with many more pitching in with support dialogue) and the cat's cradle of social ties that draw them together. This isn't helped by the fact that only a handful of these characters are elaborated beyond the most basic level.Instead, the air fills with ridiculous battle cries during play (Japanese or English dialogue can be selected), urging you on for who-knows-what. It's never really clear who you are fighting or why, and unless you have a deep-seated affection for Gundam, the game is unlikely to make you a fan of the universe on anything except an aesthetic level.But it might well do that, because Gundam 3 is a pretty game. The cel-shaded mecha have a solidity and grace that the Dynasty Warriors titles set in the Romance of the Three Kingdoms era have always struggled to achieve. There is a huge array of different mecha to collect and pilot in the game, and slicing through a sea of robots with a giant pink beam sword never grows old. The environments in which you battle may repeat too often, but they are filled with enough action and interest to bear that repetition."}