{"ref": "https://www.eurogamer.net/aion-patch-2-5-hands-on", "date": "21 Jun 2011", "game_name": "Aion", "text": "When Aion was developed during the ever-expanding WOW bubble, there was still a feeling in the air that Blizzard had achieved something extraordinary, yet only exposed the merest tip of a subscriber iceberg. Surely - the dollar-eyed reasoning went - if a single game could attract a seven-digit subscriber base, then the overall potential must be unimaginably higher.Less appealing to the money-men of course was the notion that perhaps 15 million fervent MMO players was all the world had to give, and the majority of those would be happy to remain firmly ensconced in Azeroth.  When NCsoft's Aion launched in 2009, it encountered issues that went beyond a mainstream Western aversion to the aesthetics of the Asian MMO - either you dig doe-eyed adventurers with a sentimental heart fighting alongside talking chipmunks with boobs, or you don't. Instead, pre-release concerns surrounding level grind proved to be well-founded, and the visually unprecedented engine struggled with the large-scale player-versus-player battles that are so critical to Aion's end-game.Invited to a preview of the recent 2.5 patch, Eurogamer spoke to NCsoft about the game following its 2009 launch, developments since then, and where the game is heading as the industry evolves in the wake of WOW.Tellingly, our first question about post-launch refinement reveals a disparity between East and West that transcends player preferences.Adam Christensen, associate producer of Aion, explains: ~One of the most important things identified was the relationship with HQ,~ he says. ~There were a number of things that the North American audience wanted to see to make it more suitable for the West. It was almost a sour spot, because the game right now is in many ways the game we wish we could have launched with.~Scott Hannas, writer of the Aion game guide agrees: ~One of the changes we wanted to make early on was to improve the levelling process and make it faster.~When it comes to that divisive setting and art style, Aion always had a fuller world than its contemporaries. Take a break, and cotton-tailed bunnies play nearby while birds swoop through the trees. It carries a sense of eerie other-worldliness with it as well: the sinister seventies science-fiction soundtrack; the twinkles as you bandage yourself, delivered with a blooming, rippling wind-chime, a vibrato swirl of Mellotron cheese.But that all added to the kitsch campness of the game. And at its heart, Aion is a seriously, insanely kitsch game. The sheer vibrancy of the colours alone is enough to make a blind man see again.It's hard to maintain a frugal, cynical, reserved British outlook in the face of such brash extravagance, but maybe that's the point of Aion. There are more than enough marching dwarves in the fantasy MMO setting, scowling with axe-bearing fury while making clichéd derogatory banter with the gnomes. Deep down, we all know they share a deeper spiritual bromance in the face of a common enemy.No, what gamers need in the barren desert of original fantasy is an eight-foot tall Bagpuss wearing hover-boots. It could only work in Aion - and it does work in Aion. We meet him outside of Esoterrace, an instance which begins with a natural hill-climb through the rainforest, fighting feral animals and biologically unlikely vegetation picked straight from The Little Shop of Horrors. The sky above is dominated by a titanic dragon - the end of our destination and the lair of the final boss.The first boss, though, is Dalia Charlands, an enormous miserable bastard of a tree, with charred roots crawling into the sky. He serves as more than just an introductory battle in the zone, a challenging enemy with a party-wiping area-of-affect damage. His demise dynamically changes the future of the instance: following his death, a drawbridge pulls up, committing players to the hard mode. It neatly sidesteps the immersion-breaking, portrait interface system so common to other MMOs.But it's the sheer size of the instance that represents its most notable feature. The wind-stream system introduced in an earlier patch sends players on a dizzying rush through the environment, carried on a tunnel of turbulence deep into the canyon, before twisting and turning into the blinding sunshine. The serene but deadly natural exterior ultimately gives way to a stone-clad chamber filled with arcane energy and giant marauding golems."}