{"ref": "https://www.eurogamer.net/dungeon-siege-iii-review", "date": "17 Jun 2011", "game_name": "Dungeon Siege III", "text": "I have a signature move in co-op action RPG Dungeon Siege III. How many games can I say that for? Basically none.What I like to do in Dungeon Siege III is wait until there's only one monster left to deal with. Then I summon a mirror image of myself - something I can do because I chose Reinhart Manx as my character, a mage who makes up for his terminally boring dialogue by being the spitting image of Kenny Rogers - and run off to whatever chest is nearby.As my mirror image tangles with the monster, I pop the lid of the chest, sending Dungeon Siege III's characteristic ejaculation of loot (there's honestly no other word for it) flying twelve feet into the air over my head. Then I turn around and, with the touch of a button, bring a whip of purest energy down on the monster's head to send it crumpling to the ground.All is silence. Finally, the airborne loot comes tumbling to the ground, gold coins and magic pants spilling across the floor as I remain still, like in a Chinese action movie. I hold the pose for a moment, then hoover up the loot and go hurtling down the corridor to the next fight like a boulder with an agenda. He's not graceful, is Reinhart, but it's always a corridor, and there is always a next fight.Made by Obsidian Entertainment (Fallout: New Vegas, Alpha Protocol, KOTOR II), Dungeon Siege III is radically different to Gas Powered Games' first two Dungeon Siege games, which offered top-down strategy and party management, not unlike a dungeon crawl crossed with an American football simulator.Despite this, it keeps more than enough of their spirit alive to be called a sequel, if not a successor. The world still takes the form of one endless, branching corridor overflowing with monsters; the colour palette is still kaleidoscopic; the camera still hovers high overheard like a pervy eagle; and the plot is still grave yet lightweight, with the occasional gag.In Dungeon Siege III, all of the playable characters are descendants of the 10th Legion, the highly trained army that originally marched out and founded the Kingdom of Ehb, where the series is set. Since then, the 10th Legion has fallen into poverty and disrepair (and pies, if Reinhart Manx is any indication), and a war has broken out between loyalists to the Ehb monarchy and loyalists to the Church, led by one Jeyne Kassynder (BOO!).Since the game opens with Jeyne Kassynder (BOOO!) putting out a bounty on surviving 10th Legion descendants, your side is basically chosen for you, and yours is the hugely satisfying job of bringing the 10th Legion back to full strength by finding and recruiting other descendants, reclaiming Legion property and convincing the populace of Ehb that you're the good guys. Or at least, the guys who are really good at killing and unable to say ~No~ to any and all requests to go and save husbands, priceless trinkets or pies.Yes, there are some RPG elements in Dungeon Siege III, in the form of towns and buildings where your right shoulder button has you talking to people instead of shanking them. But these are more like motorway service stations than anything else - brief pitstops where you can pick up a quest or two and sell your loot before getting back on the road.Every so often, you'll get a tough decision that you and your co-op partner can squabble over. You just defeated a boss; do you kill her, imprison her, free her or send her back to her master with a message? While these represent high points, they're fairly rare. The primary purpose of these sections, really, is to give you a break from the combat so that it stays fresh - 'palate cleansers', in the trendy terminology.Combat in Dungeon Siege III is relatively simple. By holding down the left trigger, you block, and if you try to move while doing this, you'll dodge. Almost every other button on the pad is assigned to your character's unlockable abilities, and by blocking and using your basic attack, you'll charge focus that will let you use your fancier powers."}