{"ref": "https://www.eurogamer.net/no-more-heroes-3-review-sudas-series-back-at-its-wonky-best", "date": "27 Aug 2021", "game_name": "No More Heroes 3", "text": "In one of the many, many, many fourth-wall breaking interludes in No More Heroes 3, series star Travis Touchdown guests on a TV show to discuss his deep love and appreciation for the work of Takashi Miike, Japanese cinema's most prolific, varied and plain wildest of directors. It's another self-indulgent pop culture reference in a series that's awash with them, but there's something different here - the sense that series creator Goichi Suda aligns himself somewhat with Miike. It's something underlined when Travis goes into an extended rant about how a director like Miike - a man whose most notorious film has its opening title spelled out in a splash of semen - went on to create the idol series Girl x Heroines in order to strengthen his production crew. It's something Suda himself did with Travis Strikes Again, the stripped back spin-off he used to educate his young team before they set to work on a No More Heroes game proper. I detested that particular game for leaning into the excesses of the series while lacking so much of its style, and yet here I am absolutely adoring No More Heroes 3. So what's changed? Well, it helps that this is a proper No More Heroes game, returning to the over-the-shoulder action that sees Travis scythe through small mobs and tackle screen-filling bosses. It's even more of a No More Heroes game than 2010's sequel, with the open world sections that were excised for No More Heroes 2 restored, and with some style too. The set-up is familiar, but - somehow, and to Suda's credit - even more outrageous than what's gone before. In a cute animated pastiche of 80s Spielberg schmaltz, a kid befriends a fluffy alien called Fu and helps him return to his home planet with the promise that one day he'll return. Return he does some 20 odd years later, only this time he's grown into an obnoxious, extravagant (and, I have to say, exquisitely designed) alien who's hellbent on anarchy, and has brought a gaggle of extraterrestrials from the prison he's just enjoyed a spell at along for the ride. And so begins Travis's quest to bring them all down one by one until he's confirmed as the number one assassin. The same as it ever was, then, only this time out the stakes are that much higher - and the action, in tandem, is that little bit more extreme. After the ultra streamlined Travis Strikes Again, I sort of forgot how much I enjoyed No More Heroes' particular brand of action too - simple yet satisfying and delivered with screen-filling overexuberance, that signature beam katana playing its part in show-stopping Death Blows and the combat emboldened by a handful of neat additions.Indeed, one of them's lifted straight from Travis Strikes Again - maybe I was too mean on it after all - with a Death Glove that can be equipped with three different skills to provide some welcome variety, though more importantly Travis can also now go 'Full Armor', donning a mech suit (complete with 'Henshin' battle cry, of course) that ramps things up to an enjoyable degree. That mech suit cameos in the shooting defense missions, one of an array of mini-games that can be found in the returning open world. It is, as fans of the first game may well be reassured to learn, a fairly dismal open world - part satire on the form, and partly because there's that persistent feeling that No More Heroes 3's been made on some backlot on the cheap by a crew buzzing on cheap beer and cheaper hash. Which, of course, is part of the series' charm - divisive as it may be. The bleached out Santa Destroy, with its empty streets and bare backlots all of its own, feels by either accident or design like it's nailed something of Philip K. Dick's California in its baked banality, and No More Heroes 3's world - divided neatly into five areas, and easily explored on Travis' overstated big red bike - retains all that while performing markedly better than its notoriously leaden predecessor. Which isn't to say it's pretty - far from it - but it's at least functional this time around. I don't think you go to a No More Heroes game for a technical showcase, though, and rather for the gonzo stylings of Grasshopper Manufacture and Suda himself - and that's something No More Heroes 3 delivers in giddy excess. Whether it grates or titilates is down so much to personal taste - or maybe even your mood - and with an extended runtime over its predecessors there's every chance that this will test the patience of even diehard fans. And yet I sort of loved it. Does it move the No More Heroes formula in any meaningful way? Not really, and the trims and tucks and small additions don't exactly add up to ten years' progress. Does it spark and pop - and more than occasionally misfire - with all the vim and swagger of those original games? That it does, and fulsomely. This is a return to more full-blooded, frantic and outrageously over-the-top action, a game that's obnoxious, inventive and wildly inconsistent - chalk this one up as one of Suda's better works, though, and arguably the best of the No More Heroes series to date."}