{"ref": "https://www.eurogamer.net/mobile-games-roundup-review-11", "date": "23 May 2011", "game_name": "Reviews", "text": "Is this the best time ever for video games? As someone who reviews 10 games a week, and tries out plenty more, I've almost started to take for granted that there will be a minimum of two or three truly great games out. At that rate, over the course of a year, you're looking at as many as 100 great games that are worth spending money on - and that's just in the downloadable gaming scene. This week provides an embarrassment of riches, and yet again, I didn't even cover half of the worthy contenders beating a path to my door. From absolutely nowhere, we've got a new poster child for the Android scene in the shape of Cordy, an effortlessly charming superbudget LittleBigPlanet. MotorTrialz similarly pinches a good idea and refashions it to great effect, while Remedy trawls its back catalogue and delivers probably the best mobile racing game in the process.And then there's Ozone HD, a game that completely passed me by last summer but is well worth investigating, while the awesome Pac-Man CE DX makes a debut mobile appearance on Windows Phone 7 - but does it match up to the 10/10 I slapped upon it last year? Hopefully, RedLynx will one day sprinkle its incendiary genius over the smartphone scene and deliver the gaming crack that is Trials. Until that day, be content with the mildly addictive MotoTrialz.When developer Tooko originally released iTrials, its 'tribute' to the side-scrolling stunt racer, last October, RedLynx had a justifiable paddy about it being rather too close to its inspiration. Six months later, it returns with a new name, different locations and a few placatory tweaks, and takes its place as the best mobile motocross stunt racer around.As you'd expect, there's only one goal: get to the finishing line as quickly as possible and bask in the glow of online leaderboard glory. En route, there's the usual assortment of ramps, logs, see-saws, moving platforms and meddlesome obstacles to negotiate, along with frustration-reducing checkpoints that prevent you having to start from scratch as soon as you fall off. Success comes down to that tricky compromise of judging momentum and balance, and Tooko does a fine job of approximating the formula with (usually) convincing physics and an intuitive, streamlined control system that doesn't (usually) result in you hurling your iPhone through the nearest window. Always worth bonus points, that.For your massive 59 pence outlay, you get 27 tricky-as-you-like courses, rendered with the requisite loving care, and the chance to obsess over your times with your equally OCD friends. Honestly, what's not to love?8/10"}