{"ref": "https://www.eurogamer.net/download-games-roundup-review-25", "date": "20 May 2011", "game_name": "Reviews", "text": "With PSN still out of commission, and Nintendo seemingly holding back games for the upcoming launch of its 3DS eStore, it might look like a bit of a dry week in the scorched pastures of download gaming - but seek and ye shall find.With merciful timeliness, the spotlight falls firmly on the Xbox Indie scene, with no fewer than three games featured: two excellent brand new titles dropped out of nowhere in the shape of Blocks That Matter and Mr Gravity, while the other, Decay, recently concluded its four part series, so we finally got around to sampling that all at once.While we're on the subject of indie gems, it sounds like our recent Game of the Week Sequence hasn't exactly enjoyed stellar commercial success since it hit the Indie store on May 5th, with only a few thousand sales in the first couple of weeks. Meanwhile, Minecraft clone Fortresscraft has reportedly sold over 100,000 already, so it's not as if people aren't aware of the indie channel. Perhaps 'rhythm-action RPG' just doesn't sound interesting, but give it a try. You'll almost certainly love it.Every time you think you might have had your fill of 2D platformers with a retro twist, up pops another one to make you feel like a berk for ever harbouring such doubts.In this charming tale of indie developer abduction, you're tasked with saving the hirsute Swing Swing Submarine duo via their abandoned and underestimated Tetrobot. And so begins an improbably engaging journey in which you must collect blocks of matter in order to fashion a route to each level's teleport exit. To begin with, your humble Tetrobot can only collect blocks by headbutting from underneath, but as you progress you gain new abilities, such as a drill, and gradually learn how to deal with different block types and how to create block-clearing chain reactions.But rather than just being able to collect blocks and replace them where you see fit, you have to adhere to rather eccentric rules that insist you place them in Tetrominoes. And not only that, they must start off next to an existing structure. This fascinating mash-up of platform and puzzle game even manages to morph into a bizarre boss chase sequence as you hurriedly lay out your blocks in a desirable formation before the evil monster catches up and noms you to death.With new abilities and more sophisticated challenges appearing in each and every level, it doesn't take long before the penny drops: Blocks That Matter is yet another fantastic addition to the indie scene. With tons of levels to patiently chip your way through, it's well deserving of its slightly higher price point. If you had any doubts about the indie scene's relevance, now would be a fine time to have your preconceptions challenged.8/10 This article contained embedded media which can no longer be displayed."}