{"ref": "https://www.eurogamer.net/sbk-2011-review", "date": "18 May 2011", "game_name": "SBK 2011", "text": "The 2011 Superbike World Championship is under way, and it's shaping up to be a classic. Last year's champion, Max Biaggi, put down the fastest lap times at Phillip Island and Monza, but was denied a first-place finish on both occasions. He also suffered an embarrassing disqualification at Donington Park after he failed to pull in for a jump start, and this helped Carlos Checa edge out a lead over his former MotoGP team-mate. However, rivalry is the mother of epic racing and it will be interesting to see how this season progresses.Healthy competition has also played its part in recent motorcycle games, with Monumental and Milestone taking charge of the respective MotoGP and SBK licenses. The ensuing rivalry has resulted in some excellent simulations. SBK X took the crown last year with its superlative riding physics, but with Monumental stepping up its game with MotoGP 10/11, the disparity between the series has shifted from a difference in quality to two distinct styles of racing simulation.Milestone needs to make a confident response - and because it already had an accomplished template to build upon, SBK 2011 has turned out to be tempered refinement rather than ballsy revolution. This means the presentation and structure will be instantly familiar to anyone who bought SBK X. But once you take this game out for a spin, it's clear that Milestone has focused its efforts on the simulation.SBK 2011 removes the separate Arcade mode that featured in last year's game. This means anyone who fell in love with the Boost and Wheelie buttons (anyone...?) will have to switch to Low simulation as the lowest point of entry. But with more progressive assistance between the three levels of riding simulation, SBK 2011 offers genuine accessibility.The new SBK Tour mode makes up for the lack of arcade features by offering 50 racing challenges. These start out easy and include a lap of Silverstone on an Aprillia RSV4 Factory without exceeding 60 seconds of maximum braking time, but quickly move to trickier tasks like a lap of Vallelunga on a Ducati 1198R in less than 165 seconds with at least 25 seconds of wheelie time. Completing these challenges also unlocks bikes and riders for the fourth Legendary class, including Carl Fogarty on his Ducati 996 and Pierfrancesco Chili on his Suzuki GSX750R.The other modes include Quick Race, Time Attack, Championship and Race Weekend, all of which make a return on a copy-and-paste basis. The updated roster also features the riders and teams for the new Superbike season, including Marco Melandri and Eugene Laverty for the Yamaha World Superbike Team. But the Supersport and Superstock classes are based on last year's line-up, so anyone looking for Luca Scassa will find the Italian glaringly absent.(We asked Milestone for comment and it said: ~The reason is connected to development of the game. The liveries and teams of 2011 for Supersport and Superstock are available too late in the production cycle of the game to be updated~.)"}