{"ref": "https://www.eurogamer.net/mobile-games-roundup-review-21", "date": "16 May 2011", "game_name": "Reviews", "text": "Yet again I find myself in the position of having an incredible number of interesting mobile games to review - and not enough space to cover them all. Not only that, games I've reviewed before keep getting updated with new features and  content, and often deserve a reappraisal. But, again, there's no damn room. The onward march of new releases and the need to cover five platforms fairly mean that a lot has to be missed out.Inevitably, the comments will be full of exasperated cries to review all manner of worthy candidates - and all I can say is that I'm on it. If not this week, then sometime in the future. One such example is They Need To Be Fed, a game I've had near the top of my list to write about since February. But in the face of younger, probably better looking options, I've decided this time to grant it a well deserved minute in the sun. The whole 'cryptic canvas' concept is one of those ideas that works brilliantly on touchscreen devices - or at least ought to. When the first version came out last summer it was evidently something of a work-in-progress; the interface was a bit fiddly, you didn't get any clues and there was only one canvas. Humbug.In its wisdom the Big Ideas team has beefed up the content immeasurably, and decided to offer up a free demo canvas (of your choice!) as a means to lure you in to buy the five others currently on offer. As well as the obvious gamer-centric Arcade Classics canvas, there are also US TV dramas, Scary Movies, Books 2 Film, Eighties Movies and Rom Coms.Identifying clues is now a more intuitive process. While before you might mistakenly think an adjoining picture was part of the same hint, the game now highlights the clue in question so that there's no ambiguity.And on top of that, if you're really stumped you can now call upon the three-tier clue system - at the expense of your points tally.Now all you need to do is slowly lose your marbles, staring at little pictures until cordite smoke starts to emit from your ears. 8/10"}