{"ref": "https://www.eurogamer.net/darkspore-review", "date": "3 May 2011", "game_name": "Darkspore", "text": "It's hard to shift the cynical feeling that Darkspore, Maxis' action RPG, is more about finding a way to recycle the no-doubt expensive character-editing tech created for the divisive oddity Spore than it is about creating a top-notch dungeon crawler. That's not to say it's bad, as dungeons crawlers go. But you can smell an air of 'systems first, personality later'. It's a robot with a toothy grin crudely painted on its cold, metal face.Darkspore is a game about having an assortment of semi-customised cartoon monsters beat up a load of other cartoon monsters while hunting for loot to make them more efficient beater-uppers. It's sci-fi Diablo, more or less, but with a reasonably advanced character creator and the sort of tone you'd expect from a 70-year-old chemistry lecturer.The voiceover-led plot – something about evil genetically modified beasties up to generalised no good, who must be stopped by non-evil genetically modified beasties – is so tediously presented and explained that not a single detail of it remains in my consciousness. Its tiresome prattle seems almost as procedurally generated as some of the creatures and levels are.A limping, character-free morass of uninspired sci-fi tropes, read in a monotone by an unhappy-sounding woman with a vocoder, Darkspore's story is drier than a yard of Jacob's Crackers. It doesn't even remotely gel with the cheerfully over-the-top combat, claymation-style characters or general air of innocent violence. A shame, because it only adds to the sense that this is a game designed by committee; if it were removed entirely, Darkspore would likely have more personality, not less.There are moments when Darkspore seems much more sure of itself. The invention denied the plot finds its way into your creatures' powers. Each of your heroes – of which there are 100 to be unlocked in total, although most are variations on earlier characters – has four active abilities in addition to what, in most cases, is a distinctive standard attack. There's impressive variety to these: one ED-209-type fellow can unleash a volley of 15 missiles; a purple, taloned beastie performs a stoutly effective teleportation attack; a spindly plant-thing can sprout a giant healing tree or summon two insectoid defenders.Experimenting with new creatures' powers and wiping out a good dozen enemies with a button press is where Darkspore finds its voice. If playing solo, you enter missions with a squad of three beasties, only one of which you can control at any one time. However, each chap's third power is shared with the group, meaning you have five abilities at your disposal no matter who steps up to bat. The wise man creates his squads with this in mind, devising effective combos based on what's shared with whom.In an irksome wrinkle, your creatures take double damage from enemies of the same assignation (e.g. Bio, Necro, Plasma, Robo), although the reverse doesn't appear to be true. There are other negative combinations to be discovered – generally by noticing that particular creatures fall over worryingly quickly. This means certain squads tackling certain levels are on a suicide mission, and favoured creatures must regularly be benched. This, in turn, ties in to a bloody odd gambling element to the game; once you complete a level, you're offered the option to immediately progress to the next, harder one with the same squad, without any chance to change members or equip new loot, and with the promise of bonus rewards if you can pull it off.I often found myself weighing the desire for mega-kit against the likely tedium of carving straight into another long, samey level without downtime and possibly having to repeat it later if things went South. Then there was the risk of having selected a squad that was quite blatantly going to get its little pseudo-plasticine bottom kicked because the promised mission was populated solely by matching monsters. Tackling Darkspore on a mission-by-mission basis is a reasonably sure way to make it through the game, but if you want a shot at the rarest loot, you need to consciously put yourself on thin ice."}