{"ref": "https://www.eurogamer.net/virtua-tennis-4-review", "date": "29 Apr 2011", "game_name": "Virtua Tennis 4", "text": "It's the Tetris problem. Occasionally a game maker happens upon a flawless recipe on the first attempt, a kind of perfection that would be compromised if any of the ingredients were added to or taken away from. So it is with Sega AM3's Virtua Tennis, an arcade game that translated the stretch-and-dive drama of professional tennis with such assured brilliance that, aside from a conspicuous lack of female players, precluded a sequel. But while perfection may be the goal of every game designer, it's the enemy of the businessmen that pay for the game designer's computers, electricity and crunch-period pizzas. No, a publisher wants the recipe to be delicious, but somehow flawed or lacking. That way, it can be improved and built upon in sequels and the initial investment recouped time and time again. It's the great unspoken tension at the heart of the sequel-driven games industry. And it's a tension that runs through Virtua Tennis 4's centre court.Because the fundamentals of Virtua Tennis cannot be improved upon. Its breezy court play, with its arcade heritage, is as fresh and comfortable today as it was 12 years ago. Viewed at the ground level of matches, it remains the best video game approximation of the sport available. There have been tweaks made to the core engine – with characters less likely to leap into cross-court dives, and more balanced AI – but they are just tweaks, and the game has all of the delicate balance of its earliest predecessors: easy to pick up and play, difficult to master.So it falls to the gimmicks and framing of the package to attempt to introduce relevance in an increasingly competitive niche. Virtua Tennis 4's innovations come not in ground-level play, the way that lobs and volleys are handled, but in 3D television support, Kinect and Move control options (Wii MotionPlus having already been introduced in Virtua Tennis 2009) and an overhauled World Tour mode. They're additions that give the illusion of expansion without messing with the secret recipe that earned Virtua Tennis its place in the canon. ~Better with Kinect~ proclaims the Xbox 360 packaging, a bald lie that will disappoint every person it convinces. While playing Virtua Tennis 4 with Microsoft's motion sensing camera is relegated to a bespoke Motion Control Mode specifically designed for the task, the execution is a resounding disappointment. Reasoning that the average living room floor is considerably smaller than a tennis court, Sega auto-handles your character running for the ball in the Wii Sports style, relegating the interactivity to swinging your empty hand around to set up strokes. However, these map poorly to your motions, the racquet failing to turn as you swivel your wrist (and as the wrist is the only piece of the body the Kinect needs to pick up on, it's a fundamental flaw), while lobs are read as gentle forehands. Inexplicably, the camera jumps from first- to third-person in between each shot during play, a perspective shift that will make even the most focused player feel as though they're playing on the deck of the Titanic minutes before it sank.PlayStation 3 owners fare a little better, benefitting from the fact they hold a piece of hardware that has some resemblance to the handle of a racquet. Here movements map accurately onto the screen, and there are glimmers of excitement and enjoyment to be found. However, the wider issues with the mode, from the low-slung camera to the shifts into and out of your character's eyes to the problems in reading the power of your inputs ensure that, for players who want to pretend they're playing tennis with their bodies, Wii Sports remains a more enjoyable proposition.Thankfully, once you settle down with a plastic controller (or better still, an arcade stick to replicate the original Naomi cabinet's click precision) the game responds exactly as it should. There's just one innovation to the core tennis experience here, the introduction of 'Super Shots'.During play, a gauge at the top of the screen fills. Once filled, there's a chance that your character will execute a Super Shot, a quick, precise strike that is near-impossible to return.Before a Super Shot is played, the game slips into slow motion, the camera wheeling around your character as they power up for the strike. The gauge empties as soon as a Super Shot is played and, as it often takes a full two games for it to fill each time, it's not so intrusive as to upset the balance. It's ridiculous but nevertheless exciting, the kind of mechanic that only Sega would drop into a game like this, but Virtua Tennis 4 is all the better for it."}