{"ref": "https://www.eurogamer.net/outland-review", "date": "26 Apr 2011", "game_name": "Outland", "text": "Outland is pure design craftsmanship. Housemarque's latest isn't particularly original. It's better at cleverly combining old ideas than minting fresh ones and, despite a luminous, bloomy shadow-play art style, it's actually not that huge on personality, either. Instead, what marks it out is the grace with which it spins out its mechanics, twisting and turning each new concept in order to get everything possible out of it, then introducing something complementary – or contradictory – and twisting and turning again. It's more fun than it sounds.Actually, it's a lot more fun. Suggesting once more that it's Treasure's back catalogue and the Metroid template that really get downloadable developers excited, Outland combines the ability gates and intricate mapping of a Samus Aran adventure with the polarity-shifting bullet hell of Ikaruga. To fuse it all together, Prince of Persia's nimble wall-springs, ledge grabs and sword fights are employed as you navigate delicate silhouette environments taking on some distinctly non-delicate silhouette menaces. It's shooter flesh on a 2D platforming body, and it's an excellent graft job.There's a narrative, but we're in a good mood, so why spoil things? It's about gods and goddesses and nature and harmony, and the game's few moments of narration come across as the kind of lumpen poetry nice old ladies like to have stitched onto bookmarks. Instead, Outland's real plotting lies with the elegant curving line that marks your expanding skills – and this story is absolutely enthralling.The unlock list holds few surprises. The most entertaining addition is probably a move that sucks in all nearby projectiles before blasting them outwards again. But all are well-explored and crafted with the same precision that has defined Housemarque's twin-stick back catalogue (Dead Nation, Super Stardust HD). There's a ground pound that would make Yoshi proud, a wall charge that's just as satisfying as it was in Shadow Complex, and a brief but sizzling laser-beam blast to compete with anything from Gunstar Heroes.Showier skills have to be recharged by collecting orbs from dead enemies, introducing a nice rationing element. Only Launch Pad, one of the very last moves to be unlocked, offers even the faintest degree of input fuzziness, becoming occasionally irritating as you boost between one floating anchor point and the next, or miss and land on the business end of a passing spider.Taken as a whole, your abilities make for one of those rare games in which you end up feeling almost as graceful with the control pad as your on-screen double is with his arms and legs. If Outland was just a simple action platformer, then, it would be pretty entertaining stuff by itself. It's not just a simple action platformer, though, and it's only after you're already on your feet and moving that the game layers on its most exciting element: the ability to shift your character between light and dark (or rather, blue and red) alignments."}