{"ref": "https://www.eurogamer.net/resistance-3-hands-on-1", "date": "20 Apr 2011", "game_name": "Resistance 3", "text": "After a faithful 16-year love affair, Insomniac Games and Sony are officially seeing other people. Having birthed PlayStation icons like Spyro and Ratchet & Clank, the studio hooked up with EA last year to work on a ~brand new universe and franchise~. And it's currently flirting with mobile and web games, through the new Click division. But from the PS3 pods and giant Ratchet boots in the reception area of its impressive 200-man HQ in Burbank, California, through the corridors plastered with the achievements of a relationship worth 35 million game sales, it's clear Insomniac's heart still belongs to Sony. As, of course, do its biggest franchises. And for the third outing for its Resistance series, expectations are high for the team to build on the considerable success of the previous game. The premise this time is that, after the grandstanding of Fall of Man and its sequel, Resistance 3 tracks the personal journey of Joseph Capelli across a ravaged US, where mankind has been crushed to the brink of extinction by the Chimera. Insomniac calls it The Road meets District 9, marrying the intimacy and haunting isolation of the former with the effervescent sci-fi of the latter: survival in a brutal world. After the tumult on show the last time we sat down with the game , the campaign offering at today's event represents a deliberate tonal shift. The mission appears halfway through the game. Dropped into a valley in Mount Pleasant, Pennsylvania at twilight, Capelli is immediately under threat from the Chimera and must cautiously, delicately make his way forward. Variety in pacing is at the heart of the studio's aspiration to create a ~rollercoaster~ experience, with peaks of ethereal calm plunging into troughs of synapse-frazzling frenzy.This represents a marked contrast to Sony's other recent FPS heavyweight, Killzone 3, a game with only one pace: off its tits. Guerrilla's epic consciously, unapologetically overwhelms as the action is unloaded with machine-gun force. But the trade-off for this undoubted sensory rush is an absence of moments to gather oneself and just soak up the experience. ~The intensity of the combat setups is heightened if you have a bit of a break, rather than it being balls-to-the-wall for three or four hours,~ reckons Resistance 3 lead designer Drew Murray. ~You just get numb to it.~He concedes that previous Resistance games made the mistake of feeling ~somewhat relentless~, and reveals that a change in approach for part three was, as a result, a challenge the team initially found ~unnatural~.A level set on a boat sailing down the Mississippi, playable for the first time at today's press event in LA, illustrates the point. ~We give you a minute and a half of not much to do; you're just absorbing the world,~ he explains. ~There was a lot of panic and fear [in the studio]. 'This is just boring. It kinda sucks. People are gonna go crazy and hate this.'~But – wisely – the team stuck to its guns.  Or, rather, kept them holstered, to allow this eerie journey across the water to unfold steadily, building the tension impressively before the inevitable arse-clenching firefight. ~I think it's been very different for us,~ admits Murray, ~but it builds a deeper connection to the world than just shooting everything.~Perhaps the most significant single creative decision has been the reintroduction of the weapon wheel. It's about freeing-up player choice: why litter a game with spectacular, varied weapons only to severely limit what can be carried around?The response Insomniac received at a recent community event for fans proved encouraging. As players discovered the wheel there was, Murray relays, a spontaneous round of applause. After all, whether it's Resistance or Ratchet & Clank, kickass guns are what Insomniac does best.Speaking of which, there's a new one on show in the latest build. Dead Eye is a Chimeran sniper rifle whose secondary fire is a powerful, charged shot that explodes on impact. It's the weapon of choice for a new enemy, the Sniper Hybrid, which also boasts cloaking power – not to the point of total invisibility, but enough to have you nervously squinting around the environment looking for any sign of movement. The dead giveaway – silly Sniper Hybrid! – is the red laser-targeting light blazing a trail through the darkness."}