{"ref": "https://www.eurogamer.net/red-faction-armageddon-multiplayer-hands-on", "date": "19 Apr 2011", "game_name": "Red Faction: Armageddon", "text": "You already know about the bizarre shift Red Faction Armageddon has made from Guerilla's worthy socialist plot to an ~alien invasion~. Basically, folks (that's you) seemed to think imposing the story of Das Kapital on a ~blowing-stuff-up~ shooter held the same socialist fascination as monkey-suited Ed Miliband explaining how he's against cuts whilst in favour of cuts whilst making cross-eyed faces like he's crapping himself, and oh God that BORING voice... Anyway, I've been tasked specifically with the new multiplayer aspect of that jump, 'Infestation', which pits a fistful of human players against waves of AI attackers. Yes, ladies and gentlemen, it's Horde mode! Infestation is purely co-op; you and up to three other players choose a map, choose your equipment (more on that later) and then shoot aliens until the victory conditions are achieved. As you go along you unlock both weapons, Nano-Forge abilities, and new levels and modes. Roje Smith, Armageddon's associate producer, is talking us through the design decisions as we're playing. First off, he explains why they've started from scratch after Guerilla's relatively well-received multiplayer. ~For Armageddon, regardless of mode, we wanted to strongly focus on the story. It's all about humanity's fight to make Mars safe from the creatures that are tearing it apart,~ he says.~There is no longer this sense of oppression on Mars with human vs. human conflict; this time, it's all about survival and preventing human extinction by an alien force.~ So why a survival mode rather than Left4Dead style PvP? ~We decided that our multiplayer should serve as a complementary offering to single player and still put players in a ~backs against the wall~ survival setting. ~This meant that our multiplayer would have to be a cooperative and story-based experience so each map in Infestation has its own fiction that helps to fill in the gaps from the single player story.  For example, the backstory to the ice levels gives the player better insight into the single player events that take place there.~ Moving away from competitive multiplayer sadly meant abandoning much of Guerilla's RPG-heavy multiplayer mode; however, core mechanics of some game modes have transferred, such as Defend incorporating elements of Guerilla's Siege mode.The standard weaponry from Armageddon's single-player has carried over, so before you enter a mission there's the usual range of pistols, shotguns, assault rifles, sniper rifles, grenade launchers, rocket launchers and so on. However, you can only take a limited selection into a mission, and that includes other special in-game weapons. ~We raise the bar when it comes to our special weapons,~ says Roje. ~Think about the Plasma Beam (like a 100 foot long light saber) or the Singularity Cannon (a black hole that engulfs anything within its radius before it implodes).~ Most notably, the new ammo-free Magnet Gun has carried over, meaning the environment is a weapon as you throw aliens and buildings into each other.  As importantly players also level up through gameplay, which unlocks more guns, maps, and gives you additional combat options, notably the Nano-Forge abilities (extra-magic superpowers). ~In Infestation, every unlock has a direct effect on how strong your character is, which Nanoforge abilities they can use, how powerful their weapons are and so forth.~ says Roje. ~It may not have the aesthetic unlocks of Guerilla's multiplayer, but... I think it's safe to say that most players would prefer to have more health and stronger guns than choosing whether they want their new badge to be orange or blue.~ The Nano-Forge superpowers are hugely important in multiplayer. Impact is a simple damage attack, which hurts nearby enemies. The Shell ability drops a force-field bubble to deflect projectile attacks and dissolve melee enemies. Shockwave traps your enemies, floating, in a stasis field, leaving them totally vulnerable, which is useful in defense or offense. The most important Nano-Forge, in my opinion, is repair. ~Since the structures in our environments are fully destructible,~ says Roje, ~players will be put into many situations where their cover gets destroyed, leaving them exposed.  Repair can become a life saver.~ As players can only take one each of these into a mission, selection really needs to be a co-operative process."}