{"ref": "https://www.eurogamer.net/uncharted-3-multiplayer-hands-on", "date": "18 Apr 2011", "game_name": "Uncharted 3: Drake's Deception", "text": "A cargo plane accelerates down a runway with Drake and his compatriots stowed away inside. As the rear door yawns wide-open, a convoy of terrorist-carrying trucks is in hot pursuit.The vehicles draw up to the craft, weaving in and out at high speed, as machine-gun wielding passengers leap recklessly between them to gain a better vantage point. Drake's group engages the enemy in a fierce battle as bullets and grenades burst into fireworks of carnage. Suddenly, a second plane swoops into view, weapons flaring. There's a massive explosion as the rear-most truck bursts into flames and carousels spectacularly upwards, almost colliding with the airborne craft. The cargo door draws up. Drake is away. Or is he?It's a sequence of typical cinematic flair from Naughty Dog. And if you didn't know any better, you'd swear it was a set-piece from Uncharted 3's campaign. But the first dead giveaway is the four Drakes on the plane. What I've just described is in fact the opening of a multiplayer map - one you'll be able to play in two months' time as part of the upcoming beta. ~We're showing we can take our epic, action-adventure feel from single-player into multiplayer,~ says game director Justin Richmond. ~We got a little bit of that feeling last time, but this time we're really pushing that and making it feel like it's something new and different that people haven't seen in the multiplayer arena before.~Naughty Dog co-president Evan Wells chips in: ~We've improved our multiplayer technology now to allow networkable moving objects and really open up the opportunities for the designers to come up with some great experiences.~ And this is just a single bullet point on an impressively comprehensive list of new features unveiled to the press at a multiplayer hands-on event in Los Angeles. Before the event I spend a fascinating morning in the company of Nathan Drake actor Nolan North, Uncharted writer Amy Hennig and others watching a cut-scene from the game being motion-captured (more on that next month).But the afternoon is all about multiplayer. And, having had a first run at it in Uncharted 2, the studio's goal this time is no less than to be the ~go-to game~ for multiplayer gamers on PlayStation 3. ~We have our work cut out for us,~ acknowledges Richmond. ~There's a bunch of other titles out there - Call of Duty, even Killzone - that are very, very big in the multiplayer arena. I think we bring something new to the table, something that people haven't done before - and we don't do something that's half-assed. ~We want to push as hard as we possibly can. The only way to do that is to make your goal be so lofty that it becomes something that's almost impossible but you might be able to do it. I think we can do it.~It would be easy to be overawed by the challenge of following what is rightly regarded as one of this generation's finest games. But every member of the team I speak to exudes a quiet confidence that never strays into cockiness or complacency. Let's get into the game itself. Two maps are available at the event: Airstrip and Chateau. The former is the one already described; after that set-piece it cuts to a more familiar multiplayer setting. The latter is set in and around the fire-damaged chateau seen in the single-player footage previously released.Two main modes of play are available today: 5 vs. 5 Team Deathmatch (there's a 10-player limit in MP) and the all-new Three Team Deathmatch, which pits three teams of two against each other. It's a brilliant addition, encouraging a surprising degree of tactical play from the off, even amongst rival journalists thrust together by fate. This is aided by a respawn system that gives the option to respawn as normal or near a team-mate if they're not currently engaged in a battle. Alongside promoting co-operation, Naughty Dog also wants to bring balance to team-based games, mainly to stop it being quite as humiliatingly pointless for the losing side in an obvious mismatch.The 'Player Balancing' system introduces Power Plays, which kick in when one side builds a clear lead. Examples include Elimination, which temporarily stops one side from respawning, and Exposed, which reveals the locations of the opposing team. For its part, the winning team is granted more chances to earn cash. Throw in Overtime and Sudden Death and the idea is that even the most one-sided match ought to offer its moments of drama and excitement for everyone."}