{"ref": "https://www.eurogamer.net/gears-of-war-3-multiplayer-beta-hands-on", "date": "15 Apr 2011", "game_name": "Gears of War 3", "text": "It's impossible to play Gears of War 3's multiplayer beta without hearing an internal narration from Cliff Bleszinski. Roadie-running from our spawn, shotgun cocked, the first thing we see is a chicken. ~That's no chicken, that's a mother****ing Gears chicken!~ You shoot; the bird explodes with a comical blast. Blood and feathers coat the screen. ~Ka-boooom, right!?!~Right. Gears 3 is a triple-quarter pounder: all the cover-dancing gib fireworks you know and love, smothered in an overhauled progression system with more weapons, characters, unlockables and screen-filling stattage. Gears of War 2 had its own progression system but this is in a different league. After every game ribbons and medals cascade onto the screen, thousands of points pour into the experience bank and progression towards other goals is soberly noted. It's still about beefy blokes shooting each other with shotguns, though. Any veteran of Epic's series will be instantly at home with Gears 3; the default weapons are carried over as-is, their feedback still puts hairs on your chest, the movement and controls are identical and everything living contains a butcher's shop. Clearly, it ain't broke. But when Gears 2 launched, something else did need work: the matchmaking. Over many updates Epic have made Gears 2's online unrecognisable, but many players still bear the scars of its botched launch – when the matchmaking worked painfully slowly, if at all. Betas for games this big can seem like marketing stunts, but when it comes to Gears 3 it's about making a necessary statement: not this time. It's a chance to hit the ground running, recast its rock-solid gunplay within a better multiplayer framework and prove the COGs can keep up with the CODs. If you've played a shooter in the last few years the structure will feel familiar. Gears 3 doesn't do anything especially original, but its persistent awards and rewards cover almost every action you perform in the game – the focus is on the messily homicidal, naturally – and only occasionally seem anodyne. The beta's levelling is fast, with frequent rewards of playable characters and gun decals. Stats that cast you in a good light are regularly cherry-picked. For a Gears game it's remarkably civil, and while it may not blow anyone's mind it does the job. Cast your mind back to the gaudy, clunky menu screens of old – gone. Gears 3's menus and stat-troves are slick with not a blood-red background to be seen. The matchmaking options are simply presented, easy to navigate and fast at getting you in there, with around a half a minute wait average.When players drop out, AI bots instantly fill in – they look like absolute chumps when watched with spectator cam, but in-game they're a decent enough substitute. The switch to dedicated servers is clearly working wonders.   The beta's modes – team deathmatch, capture the leader and king of the hill – are refinements of old ones, but they're pretty great all the same. Team deathmatch starts each team off with 20 shared lives and sticks both counts at the top left of the screen. When those are exhausted, there's no more respawning. Old hands will recognise characteristics of Warzone and Execution, but this bleed-out of shared resources provides the perfect foundation for Gears' most all-out gunning."}