{"ref": "https://www.eurogamer.net/xperia-play-review", "date": "8 Apr 2011", "game_name": "Reviews", "text": "Video games and mobile phones have, until very recently, enjoyed a rather dysfunctional relationship. Basic Java-based efforts played on woefully ill-suited numerical keypads were the order of the day not so long ago, and even when industry veteran Nokia attempted to remedy the latter issue with its gaming-centric N-Gage, the general public was curiously apathetic. Gaming on phones didn't really come of age until the launch of the Apple iPhone, a device which has succeeded in turning sectors of society previously disinterested in video games into rabid Angry Birds fanatics. Before we plunge into an in-depth analysis of Sony Ericsson's Xperia Play – a handset with the unique selling point of a dedicated gaming interface – it's worth noting that the iPhone is largely devoid of physical buttons. So one could be forgiven for writing Sony Ericsson's 'PlayStation Certified' challenger off as another N-Gage, but that would be to miss two crucial points. Firstly, this device has the considerable reputation of Sony's gaming division to draw upon, and secondly, it's running Google's Android operating system – a mobile platform that has made a habit of giving Apple a bloody nose and is dangerously close to achieving numerical supremacy in the smartphone arena.When you consider the hype and expectation surrounding the launch of the Xperia Play, it's surprising that first impressions are decidedly downbeat. Despite tipping the scales at a rotund 175 grams, it's created almost entirely from cheap and glossy plastic, and exudes all the sophistication of an omnibus episode of The Only Way Is Essex. The 16mm thickness of the Xperia Play also counts against it in this era of rapidly-thinning smartphones. Another area of the device that is noticeably lacking is the LED backlit LCD screen. At four inches it's certainly large enough, and the 480 x 854 resolution ensures pin-sharp image quality, but the brightness is below par and colours have a tendency to look washed out. Super AMOLED technology – like that seen in Google's very own Nexus S handset – would have delivered a more striking visual impact.On the subject of internal parts, gadget fiends are certain to feel aggrieved by the lack of a dual-core processor. Although the Xperia Play's 1GHz CPU performs admirably in general tasks, it lacks the future-proofing of a more advanced chip. By the end of 2011, this phone is likely to be seen as something of a weakling – in the Android arena, at least.The negativity quickly dissipates once you slide open those glorious PlayStation-style controls, however. Although we've seen gaming interfaces on mobiles before (on the N-Gage and the under-appreciated Sagem MyG-5), they pale into insignificance next to what's presented here. In short, imagine if the bottom section of the PSPgo was wrenched from its moorings and slapped onto an Android mobile. That's essentially what you're getting with the Xperia Play, and the results are predictably exciting for passionate mobile gamers.To keep the phone's thickness down, Sony Ericsson has given the buttons a very low profile; all physical inputs reside in shallow dips within the casing, and despite the lack of travel, they perform well. The two touch-sensitive discs that lie between the D-pad and those iconic face buttons are intended to replace the dual analogue sticks of the legendary PlayStation pad design. These too work better than you expect, and the lack of tactile feedback provided by moving parts is mitigated by two small recesses marking the centre of each pad. As soon as your thumbs lock on to these subtle dips, everything else becomes second nature.Some elements of the Xperia Play's refined gaming interface fail to pass muster, however. The L and R triggers feel flimsy and indistinct, and their location makes them difficult to press with any degree of certainty, especially when you're in a particularly fraught gaming situation.Since the launch of the Nintendo 3DS – which can only manage a pathetic three hours with wireless and its much-hyped auto-stereoscopic 3D effect switched on – battery stamina has become a hot topic amongst mobile gamers. The Xperia Play's 1500mAh power cell is pretty standard for an Android-based smartphone these days, and with general phone use will require at least one charge a day. If you're looking for figures to illustrate pure gaming stamina, Sony Ericsson has pinned the Xperia Play's staying power at around five hours. Our tests revealed a slightly lower total, but not by much. It's worth bearing in mind that 3D graphics tax the phone's CPU more than 2D, resulting in a shorter play time between charges."}