{"ref": "https://www.eurogamer.net/wwe-all-stars-review", "date": "7 Apr 2011", "game_name": "WWE All Stars", "text": "It may be a novel thing for the world of sports entertainment, but THQ San Diego's decision to pit the legends of wrestling against the new class in WWE All Stars is nothing innovative when considered in the broader context of sports video games – as anyone who has suffered a beating at the hands of my World XI in FIFA will grumpily attest.WWE All Stars is unique in at least one respect, however. It's as if the team took a look at the rippling, definitely-not-steroid-enhanced muscles and unselfconscious pageantry of WWE (a franchise that invented concepts like a match where 10 participants try to set up ladders and use them to grab a briefcase suspended in the sky), and said, ~You know what this needs? Exaggerating.~As it turns out, they were onto something. WWE stars may look more like action figures these days than their actual action figures, but for fans of the organisation's relentless TV and PPV output (such as myself), there's a special thrill to probing the character roster and unfurling the spectacular caricatures of signature moves and finishers like the 6-1-9, the Tomb Stone Piledriver and Attitude Adjustment.In fact, if you aren't excited by the prospect of watching Undertaker grab his opponent by the neck, pirouette 20 feet into the air in slow motion and bring him crashing down to the mat with such force that it sends ripples across the canvas, you probably want to deduct a point from whatever score I whack on the end of this. (No peeking, obviously.)As the name suggests, All Stars is home to around 30 wrestlers drawn from the ranks of current WWE Superstars and retired Legends. It allows you to construct all sorts of fantasy bouts between them. So if you've ever wondered what Andre the Giant would look like receiving a Pedigree from Triple H, or want to see Mr Perfect putting Sheamus in a Perfectplex, here's where you sign up.Combatants are broadly split into acrobats, grapplers, big men and brawlers, and using the face buttons each can perform light and heavy strikes and light and heavy grabs. The former soften people up, while the latter allow you to transition into a throw, suplex or another twisty or flippy move at the press of a button. You can also perform Irish Whips, bounce off the ropes, climb turnbuckles and duck under the ropes to go searching for a steel chair, if you're so inclined.As you wrestle, your character builds up juice to spend on special moves (like one of Mysterio's delicious squirrel-clambering-over-the-body DDTs, or Kofi Kingston's Trouble in Paradise spinning roundhouse kick), and you also juice up your finisher bar, which allows you to go into signature finishers like Bret Hart's Sharpshooter. The heavier-hitting stuff is harder to find openings for and execute - although if it does connect then it can't be reversed.As you and your opponents improve, whether AI or human, combat starts to revolve more and more around reversals, activated with the bumpers at a specific point when you're receiving a move. The AI seems to deploy them more when you reach for moves you've already used a few times earlier in the bout. Even if those moves go through they do less damage than you would if you mixed things up."}