{"ref": "https://www.eurogamer.net/the-3rd-birthday-review", "date": "7 Apr 2011", "game_name": "The 3rd Birthday - Parasite Eve", "text": "For the survival horror hardcore, a new Parasite Eve game has been a long time coming – 11 years, if you haven't been keeping up. Well, you can keep waiting, because The 3rd Birthday bears very little relation to the series that provides the game's sighing, whimpering lead character, Aya Brea. No wonder Square Enix has positioned it as a spin-off.On the plus side, you can dive into The 3rd Birthday's intertwining narrative without feeling like you've missed anything: you really haven't. For Aya Brea's part, she couldn't fill you in on what happened anyway. She wakes up in a blood-soaked wedding dress in 2010 without a single memory of what came before, or why she can transfer her soul from body to body. Maybe someone played Especially For You as the first dance music by mistake. With this 'Overdrive' ability, Brea subsequently becomes an essential part of the Counter Twisted Investigation's fight against the towering 'Babel' roots that inexplicably burst out from underneath Manhattan a couple of years later. As a seemingly unending army of Twisted organisms starts spawning, aiming to take down snivelling humanity, she finds herself embroiled in a nightmarish, body-surfing, time-travelling shootout to prevent the whole sorry chain of events from ever occurring.Its hilariously convoluted premise aside, The 3rd Birthday is a brain-optional affair. Once the basic mechanics are nailed down, it quickly boils down to a relentless and ultimately repetitive series of stiff encounters against the Twisted masses. In its favour, the ability to instantly dive into the body of any of the human allies that populate the environment is a pleasant distraction from many of the game's more irritating tendencies – of which, more in due course.If any of your AI helpers happens to be in your immediate proximity, a quick stab of the triangle button sends you directly into his or her body, and serves as a handy means of topping up your health and ammo. After a period of the game shouting at you to take advantage of flanking positions, it settles into a pleasantly restless groove where you're constantly sizing up whose body to occupy next. This positional strategy becomes especially apparent on some of the game's more testing encounters in which you essentially play tag-team bash-the-weak-spot. With numerous soldiers to switch between, you might need one of them, for example, to stray from the pack and leg it up to a vantage point before you can start to do any real damage. Once the boss turns its attention on him, it's usually a good idea to swiftly switch back to someone on the opposite side to continue chipping away at its distressingly multi-layered health bar while the opportunity presents itself.You're occasionally allowed to, essentially, psyche out enemies when prompted by the gigantic triangle icon that appears. If you activate it quick enough, you'll Overdrive into them and carve off a significant chunk of their health in the process. Another neat – albeit risky – tactic involves invoking a coordinated Crossfire attack by locking onto the enemy for a brief moment without shooting. Once the bar fills up, everyone blasts furiously on the target at once."}