{"ref": "https://www.eurogamer.net/european-nintendo-3ds-reviewed", "date": "25 Mar 2011", "game_name": "Nintendo 3DS", "text": "The 3DS is the latest, and possibly the most outlandish, handheld games console from Nintendo, a company which has dominated handheld gaming since the Game Boy launched almost 22 years ago.There was much excitement at the first demonstrations of its remarkable screen, which allows players to view games in stereoscopic 3D without the need for glasses. But a seemingly lacklustre line-up of launch software and steep pricing of both the 3DS and its games have recently deflated the hype. It looked as if Nintendo was just adding gimmicky features – and a great deal of cost – to the DS without responding to the radical changes in mobile gaming brought about by the smartphone explosion.In truth, both the 3D screen and Nintendo's conservative strategy have distracted us from one simple fact: for the first time in over six years, we have an all-new generation of DS. 3DS is the successor to the world's most popular gaming device. And that makes it a pretty big deal.Here we bring you an exhaustive overview – and our verdict on – the final, boxed, European version of the 3DS hardware, which launches across Europe on March 25th. We've also factored in our initial experiences with an imported Japanese 3DS. But what about the important part?3DS software is arriving in volume now. We'll be bringing you more reviews of European launch games in the coming days, and updating this article with links. You can also check out our previews of Kid Icarus, Zelda: Ocarina of Time, Dead or Alive, Steel Diver, Asphalt 3D, Combat of Giants and Game Boy Classics Super Mario Land and Zelda: Link's Awakening, which will be made available on the 3DS' own Virtual Console.Street Fighter is the stand-out launch game, while Pilotwings and Nintendogs offer minor Nintendo favourites with typical polish and Ridge Racer 3D delivers a solid version of a classic game. Whilst it's not the most exciting launch line-up we've ever seen, there's a surprising breadth of quality on offer here.Even if you're not totally convinced by the games, however, 3DS comes with plenty to play with.3DS is supplied with a power adapter – exactly the same as that used by the DSi and DSi XL – a charging cradle, a thick stack of (excellent) manuals in several languages and a set of 'AR Cards' for playing around with the machine's augmented reality mini-games. It also has a 2GB Toshiba SD card already sitting in its SD card slot.The charging stand is a small, lightweight and cheap chunk of black plastic. Plug your charger into the back of the stand and it will top up the 3DS' battery via loosely sprung contacts whenever you drop the console into the cradle. A flap at the back allows access to the stylus and card slot without unseating the device.There's a fair amount of software pre-installed. Camera and Sound utilities are joined by a Mii Maker for creating Nintendo's avatars; the StreetPass Mii Plaza, where you collect other 3DS owners' Miis and participate in simple mini-games; a suite of AR Games; a shooting game called Face Raiders that shows off the machine's cameras and gyroscopic motion control, as well as its 3D visuals; and utilities such as an Activity Log, Download Play and System Settings.What you don't currently get is a web browser, the Nintendo shop, or the system transfer utility that will allow you to transfer DSiWare games and save data across to the 3DS (if you download a similar utility for your DSi). These will apparently be added in a system update soon."}