{"ref": "https://www.eurogamer.net/crysis-2-review", "date": "22 Mar 2011", "game_name": "Crysis 2", "text": "If the previous 10 years of video game design were led by the characters we control, this decade is already being defined by what they wear. Not in terms of fashion; aside from the cut of Bond's tuxedo in Goldeneye, style never had very much to do with shooting games. But in terms of the performance-enhancing abilities they offer our avatars, the identity of many titles now pivots on the suits we are given to wear.Suits transform the man into the super man. They allow us to skid on our knees at 50mph, to leap tall buildings in a single bound, to punch through concrete. They cloak us with invisibility, they toughen our exteriors to withstand the bite of shrapnel and they provide justification for the head up displays that almost no video game can do without.It started with Master Chief, a faceless cipher whose identity exclusively hangs on his regenerating armour. From here games as diverse as Vanquish, Dead Space and, in its latter stages at least, BioShock have relied on the suits their characters wear for relevance. Stepping into the shoes of a space soldier is no longer interesting enough. We demand rocket boots.This is threaded into the very story of Crysis 2. The man in the nanosuit, a soldier known only as Alcatraz, is so peripheral to the plot that, for the first half of the game, every other character you meet presumes he is someone else. Like Clark Kent, they don't care about him. All that matters are the clothes he wears, a futuristic weave of technology that enables its wearer to stiffen himself to withstand the blast of a grenade, or blend invisibly into his surroundings. The characters on your side are only interested in putting the suit under a microscope; the characters that oppose you are only interested in stripping you of it.So Crysis 2 is a game about a suit. But it's also a game about a suit. The mechanics all fall within the triangle of abilities that the silvery, sinewy lycra provides. By default, in 'power' mode, you can run at twice the speed of a man and jump twice the distance. Tap the left bumper and the suit hardens into 'armour' mode, turning you into a human-shaped tank, able to take a missile to the chest and walk away giggling. Tap the right bumper for 'stealth' and you turn into a ghost, blending into your surroundings and evading detection. This combination of abilities offers the ultimate gaming power fantasy. One moment you can be Solid Snake, skulking behind an enemy till you see the hairs on the back of his soon-to-be-broken neck. The next, you're a Big Daddy, charging forward into the slack jaws of death, cannons to the left, cannons to the right. The wide-open spaces of Crysis 2's New York are playpens in which you can toy with your prey in whatever way you wish using these tools.For console gamers whose tactical brains have grown fat and dull after so many Call of Duty-style corridor shooters, the opportunity to plan, think and execute without fairground direction is invigorating and sometimes paralysing. The suit may turn you into a God – but you're the one that has to provide the divine inspiration.Your power trip is tempered by the suit's power gauge. Any ability you use drains its energy and you become a standard-issue human soldier for a few seconds. It's a smart, if obvious, economy - but it's also supremely well-balanced.For example, while in stealth mode, the power will drain slowly when you're standing still. Start to run and the gauge will deplete more quickly, while, if you slide or power jump, you'll run out of juice in seconds. Through this carefully constructed mechanic, a pitch-perfect balance is struck between planning and being able to react on the fly. Enemies fall into two classes: Cell agents, those military men hoping to prise the suit from your body, and aliens, nine-foot, hunched, tentacled bipeds. Dead aliens drop firefly-like clouds of nano catalyst which can be used to upgrade the suit's capabilities, dampening your footsteps while in stealth mode, for example, or adding tracer lines to every enemy shot to show where it came from. Each of the suit modes has three different upgrade options, but you can only have one active at any one time, making upgrades a strategic choice rather than a linear RPG land-grab. It's tough to convey quite how incredible Crysis 2's world looks. It's not strictly beautiful. Rather, this is a New York in the advanced stages of military infestation: makeshift tarpaulin camps, sand bunkers, plastic radioactive decontamination showers and upturned buses litter the streets, making it a messy, uncomfortable place to visit."}