{"ref": "https://www.eurogamer.net/samurai-warriors-chronicles-review", "date": "22 Mar 2011", "game_name": "Samurai Warriors: Chronicles", "text": "It's about empowerment. While the Western approach to video game violence most commonly sees the player cowering behind scenery and occasionally peeking out to fire off a few rounds, in Japan they clearly believe attack is the best form of defence. This is what the Warriors games do so well; here, as ever, you're cast as a character in an exceptionally violent historical drama and simply asked to kill people. You jab the Y button, enemies fall over, repeat. And, for a time, it works: you're a one-man army, decimating your foes with just a few button presses, and it feels good.The problem with putting Samurai Warriors on a portable is that, inevitably, compromises have to be made. It's hard to escape the fact that a smaller screen can't capture the scale of the home console version. Scrunched down onto 3DS, the battlefields naturally shrink, enemy forces are less daunting in both size and number, and no amount of 3D jiggery-pokery can make up for that. With the series' most important facet neutered somewhat, Samurai Warriors: Chronicles is fighting a losing battle from the start.Rather than playing as an established hero, you start the game as a male or female warrior of your own naming. Aside from the thrill of having a brave warrior named Bob playing a pivotal role in 16th century Japanese military conflict, this makes precisely zero difference to how the game fundamentally shapes up. The objectives are familiar – go here, kill him, defend this, destroy that – and the mechanics are identical, with more hacking and slashing than Geohot with a full bladder.  During the earlier stages, and particularly on the easier difficulties, that's about all there is to it, but it would be a lie to suggest there are no tactical elements present. Accompanying you on each stage are three other fighters, all taken from the annals of Japanese history, and each of whom needs levelling up along with Bob. Switching between them is a simple matter of thumbing their portrait on the touchscreen. In theory, this allows you to select which of your fighters is best suited to a particular scenario, but most of the time you'll simply plump for whichever is closest to the action. This presents a problem unique to the 3DS game, in that your eyes will constantly be flitting from top screen to bottom, especially with the wealth of mission objectives that pop up during each encounter. Often you'll be battling one enemy before being alerted to the fact that another is about to capture a castle or reach the escape point; at other times you'll need to activate one of your character's special skills to get out of a tight spot. The constant need to readjust may be too much for some; turning the 3D off resolves that issue, but rids the game of its lone USP. It's a pity, because the 3D effect is quite something. This mightn't be the ideal graphical showcase for your shiny new handheld, but the battlefields seem to stretch well into the distance behind the console, while the flourishes of the most powerful Musou attacks bring the action to the forefront. The occasional cut-scenes in particular feature neat particle effects that see cherry blossoms appear to float just in front of the screen. They're a little too choppily edited to truly dazzle – 3D needs a Cassavetes rather than a Bay directorial approach to really let the retinas bathe in that extra depth – but there's some impressive stuff here nonetheless.That said, battles do feel less spectacular than in previous Warriors titles, thanks chiefly to the reduced enemy count and some slightly sluggish controls. Bob's default weapon deals plenty of damage, but is slow to wield, and while more responsive swords are available, there's definitely a sense that the speed has been dialled down a touch."}