{"ref": "https://www.eurogamer.net/mobile-games-roundup-review-35", "date": "21 Mar 2011", "game_name": "Reviews", "text": "It's probably no coincidence that Apple decided to launch the iPad 2 on the same day as Nintendo's 3DS, and as far as spoilers go it's an interesting one. On the surface, they don't compete and they offer very different things, but in reality both are likely to appeal to the same early adopters who must have everything the day it comes out. Such as myself.Being forced to decide between the two isn't a hard decision though. A lot of hot air is being spouted about the new iPad's superior graphical performance, but despite having tested hundreds of games for these features I have only experienced performance problems on the current hardware once, and that was more down to a dodgy conversion than the system itself.Then again, the 3DS' strangely unspectacular launch line-up doesn't exactly make you want to rush out and slap a few hundred quid on that either.So here's a better idea: wait for a while and instead spend a few pennies on some of the really good games below.Back in the dim, distant and possibly musty past, publishers rarely bothered to put so much as a screenshot on the back of the box, so we had no idea what the games looked like. (Which was probably just as well.)Instead, most resorted to illustrating their wares with a kind of 'artist's impression' – generally a stylish-looking pixellated LEGO man in colourfully blocky environments. It was a gigantic lie, obviously, especially as games never ever looked like this.Until now. Because Kami Retro essentially brings the lies of the past to life, in what amounts to Lemmings re-imagined as a hyperactive platformer.Sounds good? It is. Like DMA Design's 20-year-old classic, little men drop out of a trapdoor and start walking, and it's up to you to ensure that they don't meet a spiky, fiery doom en route to the exit. Instead of having to painstakingly nanny loads of the blighters at once though, you have just enough time to manage each one's journey in turn, because they enter the fray at considerate intervals.Making sure that they all get home intact is a two-stage process. First you have to make sure that all the bounce pads and fans are arranged just so, and when you think it's set up properly you have to usher them to safety. You do this by swiftly drawing their jump paths and sweeping a line through them to get them to turn around at the right moment as they sprint along.Levels come thick and fast, but what starts off as a charming, casual diversion soon bares its teeth and has you utterly absorbed in its gorgeous and inventive platform puzzle madness.8/10"}