{"ref": "https://www.eurogamer.net/nintendogs-cats-review", "date": "18 Mar 2011", "game_name": "Nintendogs + Cats", "text": "In times of stress, I often turn to videos of kittens on the internet to make myself feel better. As such, Nintendogs + Cats provides a valuable service for me. You don't feel quite so bad about the state of the world after you've opened up a 3DS and tickled a puppy or a kitten for a few minutes. Purely as stress relief, this might actually be the most effective game I've ever played – it's way better than shooting at 12-year-olds over the Internet.If you're of a similar disposition, Nintendogs + Cats will melt you into a puddle the first time you see it. The puppies are terribly, terribly sweet, and there's a big enough selection of breeds on each version to ensure that there are at least a few that will tickle your individual cute sensors into helpless submission. They are hyper-adorable versions of their real-life inspiration, with big, sparkling eyes and playful, obedient dispositions.Upon first loading the game, you're prompted to pick one puppy to take home to your cream-and-beige, tastefully plain, very new-age-Nintendo house. Each breed comes in all sorts of different colours – I opted for a brown-eyed black, white and brown Pomerian. You're gently guided through the basics of pet care, teaching the pup to remember its name (Albert, obviously) then stroking it with the stylus to calm it down. Nintendogs are not demanding virtual pets. They need the odd bowl of water or food, but when the game's off, they don't wither away without you.The puppies look, if possible, even more disarming with the 3D slider turned up. The animation is wonderful and subtly realistic – the fur looks soft, the eyes lively and mischievous. The 3D effect is especially impressive in Nintendogs + Cats, mostly because there's not much to do except look at your pet. Suspend your disbelief and it really does look like there is a tiny animal living inside the 3DS. When they jump up to the screen to lick your face or bark for attention, it's like their paws are up against an invisible barrier a few inches from your face.After those first 10 minutes of gentle instruction you're left entirely to your own devices, free to play with the small selection of toys already in your inventory, go for a walk or head out to the shop to buy more with your small reserve of starting cash. Unlike, say, Kinectimals, there's no hand-holding and no slow, grinding process of unlocking new things to do.Teaching tricks is a matter of making stylus gestures or using a treat to get the dog to sit up, lie down, beg, jump or sneeze, and then repeating a command three times into the microphone. Each trick comes with its own tutorial telling you how to make your dog perform it, and the voice recognition appears to be excellent – not once have I had a problem telling Albert what to do, or getting him to respond when he's called.Dogs can learn three tricks per day, and you can enter them in three different mini-game competitions to earn cash for new accessories and toys. The best by far is the Obedience Contest, which uses the camera and the Augmented Reality cards that come bundled with the 3DS to make your puppy come to life on your living room carpet. It's a simple tricks contest, over in less then three minutes – you give the dog commands and get points when it responds promptly."}