{"ref": "https://www.eurogamer.net/rift-review", "date": "14 Mar 2011", "game_name": "Rift", "text": "Ah, disappointment, shall I count the ways I've known thee? Warhammer Online, with your action-packed zones that came to feel as claustrophobic as an ill-fitted, testicle-crushing pair of trousers. Age of Conan, how you delighted and enthralled us with your storyline – for the first 20 levels. And how could we forget Aion's psychedelic rush of saccharine colour which descended all too quickly into a bad trip of soul-withering grind?In many ways, we massively multiplayers are our own worst enemy. We demand that MMO games launch with a level of polish and content that could only ever come from long-term  refinement and evolution. Include cherished features from another title and you're building a clone, deliver a revolutionary concept without adhering to expectations and you've dropped the ball.You're damned if you do and damned if you don't, but such is the way of MMO development. Only the true outliers like Eve Online can afford to take a deeper level of risk, growing organically with their playerbases.Into this market enters Rift, Trion Worlds' first foray into games publishing, riding on the back of a mind-boggling level of investment and steered by industry luminaries including Scott Hartsman (EverQuest II) and Ken Allen (Lord of the Rings Online, Dungeons & Dragons Online), to name just a couple.It's an impressive CV, and it comes as no surprise to learn that Rift takes its inspirations from a broad range of MMOs released over the last decade. The interface is highly derivative of World of Warcraft's; the art direction shakes EverQuest's hand enthusiastically and asks after Aion; the public grouping system makes your heart sigh at what might have been for Warhammer.And so it would be easy to consider Rift as simply an accumulation of previous endeavours with a few twists. This is true to an extent, but to do so is to ignore some of the braver decisions made in development. Consider the soul tree system, for example, where the four character class archetypes (cleric, mage, warrior and rogue) each gain access to eight sub-classes.We take it as a truth self-evident that all role-playing games should incorporate punishment – if not outright prohibition – for reneging on decisions made during character development. Not so in Rift, where each character has access to four specs, each a combination of three sub-classes. For a modest fee, even these can be reset, making experimentation and risk-taking part and parcel of the learning process.Rather than cheapening the investment in your characters, it adds depth and a chance to experience entirely new sides of the game, minus the long, lonely grind to the end of the levelling tunnel where your friends sympathetically await your under-geared return. No longer should you find yourself confined to the bench while a more experienced tank is given priority on learning a new boss encounter. With a few changes, most classes can bring something vital but fresh to the group, whether it's a much-needed injection of off-healing or an invigorated focus on raw damage.This complimentary approach to adapting and adjusting your class extends into the player-versus-player Warfronts of Rift."}