{"ref": "https://www.eurogamer.net/champions-online-re-review", "date": "9 Mar 2011", "game_name": "Champions Online", "text": "There's a wonderful moment, around an hour into the film Logan's Run, where there's a shot that looks suspiciously like a plastic toy car being pulled through a length of Habitrail hamster tubing. You either wince in horror – suspension of disbelief not just sent crashing to the floor, but taking the ceiling with it – or you grin precisely because it's so silly. To those who have a soft spot for such things, it's endearing. A similar air of techno daftness abounds in Champions Online, Cryptic's superhero MMO which turned free-to-play recently.Sadly, the game missed the mark on its arrival in 2009. While it delighted many with its freakishly free-form character creation, it fudged the early game with a bewildering stat system that turned many players off long before the first month was over. It was an overwhelmingly underwhelming start, and the game has travelled a rocky road through player revolts and balancing problems ever since.Sensibly, fixing this unfriendly welcome is the first order of business for Cryptic in this relaunch. As a Gold subscriber, you can still create a fully customized character with all the tweaking this entails, while Silver players choose from a range of pre-built Archetypes. Eight are on offer immediately with a further two available for purchase. There's enough variety in the basic offering to keep most players interested for some time to come. As his name suggests, the Inferno will appeal to devotees of blasting magic while the Solider provides the gruntish, gunslinger role. The Grimoire channels into the darker arts of sorcery. A full breakdown of entitlements can be found on Cryptic's website.Some premium cosmetic items and travel powers are also excluded from character creation but there's still the staggering set of options that so impressed us all at launch. With only one faction in Champions Online, there's more freedom for outlandish creations. You don't need to be evil in order to produce a dark, brooding character with arching wings that suggest a menacing death by pointy things. Or why not create a Playboy bunny with pink furry ears whose laser bolts possess the power to transform enemies into teddy bears? It's likely that your first few hours with the game will be spent playing with these options, an experience that justifies the download in itself.Millennium City feels like a vision of the future seen from the fifties, where the secrets of the atom have only just begun to be probed. Somewhere in this world – you're quite sure – there are fresh-faced women wearing starched aprons, whipping up a batch of cookies for their husbands while mutants rip the head off next door's dog and futuristic, angular Chevys glide past the windows. Gangs of pimped-up hoodlums populate the streets as civilians run in terror. Bowler-hatted miscreants reminiscent of A Clockwork Orange keep watch on the docks. Oh, and there are mimes. Mimes you can kill. The missions themselves have enough variety to drive the story forward, without feeling as though you're simply running circuits around a city repeating the same work ad infinitum.The soundtrack keeps the faux-seriousness of the action chugging along delightfully. If you've ever owned a Casio keyboard, you'll be well acquainted with the sound effect button that does an impression of an electric guitar. Little touches like this and the drum-and-rawk riffs between mission hand-ins pepper the game's music, and the vibe sets the scene perfectly. It may be a little too generous to describe it as Bond-esque, but it's certainly good enough to be Dr Evil's jogging music.While the crafting system was never revolutionary – more alchemy and experimentation than raw manufacturing – it's something that at least needs to receive lip-service in order to make an MMO feel complete, providing another level of customisation and a pleasing addition to advancement. Again, Silver members pay nothing for the same access as subscribers.Aside from content expansion packs, limitations amount more or less to mere inconveniences. Having one bag rather than the premium four means you'll find yourself visiting the vendors and bank more often. Limiting the number of slots on the Auction House means that the more devoted economists will come out decidedly poorer than they'd prefer – unless they dip into their own pockets.But, overall, the free game is extraordinarily generous, and this extends into the player-verus-player instances where a separate queue is provided for those with only Archetype characters at their disposal. It must have been tantalizingly tempting to consider combining these two in order to create feelings of weakness or limitation in the Silver players, nudging them towards a subscription. Cryptic is due no small amount of kudos for resisting that temptation."}