{"ref": "https://www.eurogamer.net/hyperdimension-neptunia-review", "date": "9 Mar 2011", "game_name": "Hyperdimension Neptunia", "text": "Hyperdimension Neptunia is the latest member of a small family of releases to choose the videogame industry for a theme. Unlike iPhone app-du-jour Game Dev Story or SEGA's eccentric Segagaga, however, you are not charged with steering the fortunes of a virtual games company. Instead Idea Factory's idiosyncratic role-playing game offers, ostensibly at least, an abstract, metaphorical take on the videogame business, featuring game consoles personified as warring goddesses that vie for dominance over the land of Gameindustri.It's a ripe premise, but almost immediately whatever metaphor the developer was aiming for falls apart. Despite lines of dialogue that poke fun at JRPG conventions (~I'm apparently an amnesiac, so I need you to explain stuff to me in a manner convenient for the players to understand,~ says your character, Neptune) it's never quite clear who or what is the primary subject of the satire. Rather, ideas and conventions from videogames are invoked with no rhyme or reason (from Princess Pear, a character who is running from castle to castle in order to evade her rescuer, to a Nintendo DS-style piracy device). The writers grin idiotically as they rely upon our familiarity with their reference points to make the game funny and interesting, inviting us to join in gags that lack bite and, more often than not, a punch line. It's hardly Nippon Ichi's fault - the publisher's English translation is generally robust - but joke after joke falls flat, the dialogue inane and childish, the Japanese writers missing every available opportunity to say something witty or insightful about the industry whose terminology they plunder with such gleeful abandon.Moreover, the game adheres to a strict and orthodox JRPG template, both in terms of the narrative and game structure, a decision born not of irony but of a plain lack of imagination, one entirely at odds with the developer's boastful name.The wearying effect of the witless writing is exacerbated by the plain sexism on show in almost every one of the garrulous cut-scenes. The camera lingers longingly over stills of each girl's crotch (and, as the cast of Hyperdimension Neptunia is exclusively female, that's a lot of crotch), while characters make lewd comments with all the awkwardness of a children's TV presenter telling a dirty joke. In one of the earliest acts of the game, your character arrives at a busty barely-legal nurse's home only to have her scratched, suddenly-naked body bandaged to a soundtrack of squeals of delight.Some will claim the game is playing on established anime conventions. True. It's playing on conventions of plain old ugly Japanese sexism, and while the Carry On tone ensures the game stops short of titillation, the innuendo leaves a bad taste in the mouth. Not because its innuendo - we love a bit of innuendo, especially in your mum's pretty mouth - but because it's dull and stupid and essentially based around girls made to look and sound like schoolchildren. Almost as unforgiveable are the game mechanics beneath the story. Peel back the mess of a narrative and the RPG underneath is feeble and undernourished, far less robust than the studio's previous effort, Trinity Universe."}