{"ref": "https://www.eurogamer.net/download-games-roundup-review-17", "date": "4 Mar 2011", "game_name": "Reviews", "text": "It might be enjoying the extra daylight of a full review elsewhere, but it's worth dwelling on the joy of seeing neglected classics like Beyond Good & Evil 'remastered' in HD for the download generation.Unlike SEGA's bizarrely shoddy treatment of its Dreamcast titles (to date), Ubisoft deserves enormous credit for bothering to cast a backward glance at a title that would have otherwise slunk into retro obscurity. Seeing such an enduring gem of game generate such excitement the second time around makes me wonder what other games from generations gone by warrant a similar second chance - apart from ICO and Shadow Of The Colossus, obviously.System Shock 2 immediately springs to mind, as does the original Project Zero. Hey, how about Amplitude and Frequency, or Gregory Horror Show? And wouldn't it be nice if Capcom could bring us an HD Resident Evil 4 while we're at it? Before we get sucked into a vortex of our own wistfulness, here are some new games that you might quite like to play. I did.It's not usually a good sign when you spend the first five minutes with a PC game messing around with configuration settings. But then the penny dropped: it's supposed to look like it was made by Revolution Software in 1993. After that little embarrassing oversight, there was something oddly evocative about settling down with Joshua Neumberger's loving homage to adventuring's glory days. Suddenly I'm juggling floppy disks, a pile of (unread) college text books, and I'm entering a dystopian future armed with a fluff-ridden mouse with which to probe my unfamiliar surroundings. Gemini Rue gets things right from the off by virtue of set piece intrigue, inclement weather, sharp writing and half-decent voice acting. And unlike most modern day point and clickers, it doesn't hold your hand at every opportunity.Somehow, pacing the rain-drenched planet of Barracus by night without much of a clue what to do didn't matter. I was 20 again, with all the time in the world to figure out what to do with my lock pick and communicator. I wanted to find out about Delta Six, and why he's lost his memory, and how to get him free, and I wondered why more games don't try to rip off Blade Runner.If you're done with all the remakes, and hanker after an adventure that remembers exactly the way things were, Gemini Rue demands your attention.8/10"}