{"ref": "https://www.eurogamer.net/medievil-review-polished-remake-fails-to-de-clunk-the-ps1-original", "date": "24 Oct 2019", "game_name": "MediEvil", "text": "While never one of Sony's most popular mascots, I spent many an hour with Sir Daniel Fortesque the first time around. Drawn to him the way I'm inevitably drawn to the happy-go-lucky losers - you know the ones - I fell fully and completely for 1998's MediEvil. Stuffed with charm and colour and soft, gentle humour, its hack-and-slash gameplay easy to play but tricky to master. Though not particularly cerebral it was somehow both accessible and rewarding, with Fortesque himself - a hapless but memorable hero with a mile-wide cowardly streak and misplaced jawbone - leading the charm offensive. I remember a lot about the original. Its music was sublime, as was its colourful, Halloween-y world, Gallowmere, but it's Fortesque's story that stuck with me the most. The comparisons to Tim Burton's seminal Nightmare Before Christmas are predictable enough - not least because of Fortesque's skeletal frame, appealing character, and ~failing-upwards~ hijinks - but doing so is a tad unfair because MediEvil truly crafted an identity all of its own.The history books of Gallowmere tell of a hero, Sir Daniel Fortesque, who single-handedly defeated Zarok the Sorcerer. Thing is, our Danny has a penchant for exaggeration. His ego fanned by the frequent, if erroneous, retelling of his courage, Fortesque was left with no choice but to lead the charge when Tarok returned from exile. Sadly, Danny was the first to die in that mighty battle and embarrassed by that fact, the King revered him as a hero, anyway. When Zarok returns hundreds of years later with a bevvy of undead denizens in tow, however, Fortesque too is resurrected and afforded the enviable opportunity to finally prove his critics wrong.As you would rightly expect, this retelling of MediEvil's story is faithfully done, each scene painstakingly rebuilt not to change the original presentation, but merely to polish its natural charm. It looks, and sounds, spectacular, but while the score and visuals enjoy a well-deserved polish, it's curious that MediEvil's gameplay and mechanics - which were a little clumsy even back then - didn't get that much-needed overhaul, too.Nostalgia's a funny thing though, isn't it? I remember Fortesque and the music and those wonderful Tim Burton-esque set-pieces, but I failed to remember what a ballache the original MediEvil was to play. It's just as well Dan already has a reputation in the Hall of Heroes for being a bit useless, as he's almost totally useless when I'm controlling him. Though players can now swap out MediEvil's classic controls for something a little more contemporary, moving about Gallowmere is an unadulterated slog, particularly in the handful of platforming sections where Dan's control scheme lacks the finesse the game is asking of you. Enemies are varied enough, and you'll build a reasonable arsenal as you progress, but although you'll have primary and secondary attacks, alternative weapon modes, and a handful of special abilities, taking on enemies is mostly a mash-this-button affair that also lacks precision. Fighting from afar is undoubtedly the way to go - Dan can carry spare life vials, sure, but all it takes is a couple of unlucky jabs to halve your health if you're not paying close enough attention - but there are limits to the number of ranged projectiles you can carry, forcing you into the fray from time to time. In its finest moments, I remember why I recall MediEvil so fondly. There are impetuous imps that'll steal your gear, and although the story is fairly linear and unornamented, there are a handful of secrets squirrelled away in Gallowmere, too. The environments, particularly of latter areas, are marvellously macabre. Fill a mystical chalice with the souls of the undead you, er, make undead again, and you'll gain access to the Hall of Heroes, where Gallowmere's greatest heroes bestow you with extraordinary gifts and weaponry.However, most levels involve killing enemies, scouting for runes, unlocking doors, besting bosses, and little else. Boss fights range from brilliant to boring, and the latter examples not only shatter the pacing and immersion but also frustrates further given there are no mid-level checkpoints. A silly mistake or a mistimed attack could send you all the way back to the beginning again, and where's the fun in that? Though neither long nor sadistically difficult, the levels are packed with enough enemies and hazards to easily overwhelm you, so getting through them is by no means a certainty. The most terrifying thing you'll find in MediEvil, however, is the camera. While you can, ostensibly, draw it in to sit atop Fortesque's bony shoulder - or ~Dan Cam~ to use the game's own delightful term - the feature is disabled in areas where a fixed camera angle is in play, and can't be toggled on and off even when it isn't. In Return to the Graveyard, for example, you'll encounter a number of places where the angle - quite intentionally - obscures your view as you race down tunnels. Rather than bolster tension, however, all this does is frustrate; the denizens you'll encounter might look pretty harmless, but they can be powerful in even small groups, particularly if you're backed into a camera blind spot and can't see what the hell you're doing.Given MediEvil's 21-year-old story is so carefully retold in the remake, it's puzzling that so many of these dated design choices weren't afforded the same improvements as the visuals and sounds. In trying to be faithful to the original game, all the developer has done is shine a light on the game's few, but substantive, flaws, failing to capitalise on this timely opportunity to improve MediEvil's mechanics for a new generation of Fortesque fans. It's a little disheartening to revisit a game you once knew so well and find it doesn't live up to those rose-tinted recollections. While it would be unfair - and untrue - to say I didn't have fun stomping through the pumpkin fields again, I'm left wondering if, this time around, poor Dan was better off dead."}