{"ref": "https://www.eurogamer.net/homefront-hands-on-1", "date": "1 Mar 2011", "game_name": "Homefront", "text": "Leaping into a Homefront multiplayer demo in its first throes is like witnessing several dozen people all failing their driving tests at once. The game's jeeps and tanks are pretty zippy once you get to grips with them, but they're quirky; with forward and reverse on the left stick, and turning tied to the camera, there's a little bit of brain-lag to take into account. So, for the first few moments, fender benders and other slapstick RTAs dominate most of the action on the map.Homefront's single-player mode bravely asks the question, ~What if North and South Korea joined forces and tried to take over the world?~ (The answer, incidentally, is that ignorant westerners such as myself would spend a lot less time asking questions like, ~Which one's the bunch who really like StarCraft?~)The multiplayer game, meanwhile, asks simpler questions such as, ~Would you prefer to blow up 31 other people using a silenced SMG or a rocket launcher stuck to the undercarriage of a model helicopter?~Kaos Studios made a name for itself with the likes of Frontlines: Fuel of War and, before that, the Desert Combat mod for Battlefield: 1942. Large-scale encounters are in the team's DNA (as are Homefront's remote-controlled drone vehicles), so it's no surprise to see that Homefront's multiplayer cranks the player cap up to 32.Nor is it a shock to realise you're being let loose in some of the largest maps you've probably seen in quite a while. The developers don't want these roomier, busier theatres to lapse into bland chaos, however, so they've introduced a few ideas to keep players focused.Which is why while Homefront has staples (such as customisable load-outs, a persistent experience system, weapon unlocks and lots of familiar vehicles to blast around in) it also has a brand new idea. Titled Battle Points, or BP, it's a brilliantly shameless ploy to pay people to work together - and it seems to do the trick. While you're awarded BP for kills and assists, you also get them for any action that helps your side directly or indirectly - whether you're capturing and defending locations, or zipping around in a recon drone and tagging enemies for the benefit of team-mates' radars. BP can be used to buy weapons and vehicles on the fly. It's all done down on the d-pad and it's a pretty compelling system. Chunky decisions abound: head to the shops early and get a nice big gun, or wait to save up for that tank you've always wanted? It's like being eight again and learning to manage pocket money. The new system has allowed Kaos to create matches that have an intoxicating sense of momentum to them as the big unlocks get earned. It's s also provided the opportunity to fix a couple of things that have needed fixing for a while. Take vehicle spawning, for instance: rather than camping at vehicle hot spots for the next tank to auto-generate, you can buy one then choose to spawn in the driver's seat wherever you are. Or you can spend a bit less and spawn in another team-mate's vehicle, giving him a pleasant surprise – and a turret operator – in the process."}