{"ref": "https://www.eurogamer.net/child-of-eden-hands-on", "date": "1 Mar 2011", "game_name": "Child of Eden", "text": "Whether it's a Kinect game for the rest of us, a bold audiovisual sculpture, or even, y'know, a twitchy arcade rail shooter, Child of Eden is looking wonderful. Sounds pulse, lights blink and shift, lines warp and flutter and then slowly congregate to form space whales or galaxy-spanning birds - it's a bit like enjoying a Valium overdose while you relax in a glass elevator filled with orange Fanta and Bonjela. (We checked.)With Rez's sharp edges and flickering lasers giving way to curves and fins and petals, and the organic replacing the cold and technological everywhere you look, this is surprisingly calming for a frantic blasting game. Targets flit in and out of focus, watery turrets fire off volleys of speeding torpedoes, but the whole thing manages to feel delightful and relaxing at the same time.With the tagline of ~Hope and Happiness~ and at least one boss that takes the form of a giant rippling flower, Tetsuya Mizuguchi and his team have created a game in airy pastels, filled with soothing murmurs and bursts of J-Pop. It's unashamedly earnest, and unashamedly cheery: even the unfurling of a massive enemy's health bar seems strangely comforting.How does it play? Brilliantly. Last time I encountered the game, I left with the impression that the serious way to play Child of Eden was with the controller, moving the aiming reticule in precise semi-circles as you paint and release, selecting targets and then shattering them in itchy little sonic bursts.The Kinect functionality was still a selling point, but it was there for when you had friends around and you wanted to show them what it was like to stand in your living room and wave your arms around like an inscrutable and all-powerful space wizard. Now, however, as Q Entertainment eases into the final stretch of development, Kinect has snapped sharply into focus: the game copes well with even the most minimal of gestures, while the bounding box means that you won't be constantly nudging the camera off its pre-aligned route through each level unless you mean to.With the roving reticule responding quickly to sweeps and arcs of your hand, you can enjoy the game as a genuine challenge as well as a fancy display of sound and colour, and yet the controls still retain their stylish tweaks. There are two main weapons to choose between – an auto-fire Tracer, and a more standard Rez-styled paint-targets-and-then-unleash setup - and a brisk clap of the hands switches you back and forth between them so quickly that the game's arsenal soon becomes second nature. For particularly tricky moments, a smart bomb – it used to be called the Happy Bomb, and it's now been retitled Euphoria – is triggered by holding up both your hands."}