{"ref": "https://www.eurogamer.net/deus-ex-human-revolution-hands-on", "date": "24 Feb 2011", "game_name": "Deus Ex: Human Revolution", "text": "Now, where did we leave things? Last time on Deus Ex Street, poor Adam had been beaten senseless then strapped to an operating table to have most of his internal organs and limbs replaced, nice Dr Megan had gone missing and those naughty geezers from the other side of town had been causing all kinds of problems for friendly neighbourhood science genius David Sarif.Six months later. Jensen's back on his feet (though they're probably not his original feet) and so, apparently, is Sarif Industries. Conspicuously absent, however, is Jensen's erstwhile love Dr Megan Reed. She was killed during the attack, we're told. We didn't see it happen, which at least to me raises a conspiracy flag, but Jensen, Sarif et al seem pretty sure she's corked it. Also missing is the air of well-natured optimism that our first experience of this new age of humanity had offered.Surliness and paranoia are the orders of the day, with the freshly-augmented Jensen greeted by a mixture of awe and horror by his colleagues. Awe, because they'd heard the rumours of what he'd been through, the sheer extent of his injuries and mechanical alternations, and the miracle that he stands glowering before them today. Horror, because, well, the same reasons.This is, it seems, a key element of this new Deus Ex. Augmented humans are not enviable superhumans: they're mechanical Frankensteins who raise frightening questions about what 'human' means. Jensen is, in a lot of eyes, a monster.But what a monster. A first peek at the abilities his augs offer suggests a far more elaborate skill tree than either of the prior DXes. His skills are divided roughly by body part - cranium, torso, arms, legs and skin. Within each of these categories are a clutch of sub-powers, which essentially allow you to build Jensen into the action hero you want him to be. An invisible, silent spy? A juggernaut able to move and kill at incredible speeds, even able to fire explosives from his chest? A hacker, a sniper, an athlete, an explorer, a double-hard bastard with radars for eyes? It's gratifyingly elaborate, a grand hit of the tactical thinking that lies ahead. Nu-Jensen's first mission is to tackle a group of Pro-Human Purists, who've broken into another of Sarif's factories. Sarif is simultaneously Christ and Satan in this universe - the bright hope of curing disease and fixing any injury, and the terrible mutilation of replacing limbs, organs, even brains with machinery. That his business is a target for fanatics is scarcely any surprise. That he sends his own personal Terminator to go fix the problem is no less of one.That said, in a direct nod to the original Deus Ex's first mission, Jensen is given a raft of choices as to just how much of a Terminator he wants to be. Lethal or non-lethal takedowns, ranged or close combat? I go non-lethal, and for the stun gun rather than the long-range tranquilliser rifle. I want to be in the middle of things, but I don't want blood on my hands. No-one appears to judge me for my choices at this stage, but the levelling and achievement notifications reveal I'm racking up rewards for maintaining certain approaches. This, in turn, grants me more aug upgrades. For now, my choices are limited - I pick a raft of stealth powers, primarily temporary invisibility and dampening movement noise. I can't yet speak for how well it works as a straight-up shooter, had I chosen the more bloodthirsty options, but as a stealth game it seems to be shaping up phenomenally. While there's a cover system, which involves a fan-outraging but genuinely non-disruptive switch to a third-person perspective in order to get a better sense of what's around Jensen, where the stealth really shines is when it's simply about not being seen. Run, duck, hide - breathlessly behave as you would were you trying to avoid detection. It's about gut instinct and observation, and even the stealth-orientated augs don't replace that.What they do do is - hey! - augment it. The base-level Cloak, a sub-dermal enhancement that permits invisibility, lasts just a couple of seconds before draining Jensen's battery. This doesn't render it useless - instead, it ensures it's a genuinely tactical tool rather than a superpowered cheat. I found myself gauging guarded gaps between crates and pillars, trying to do the maths on whether I could make it from cover to cover before my Cloak flickered away and left me in plain sight of three angry fanatics. Deep breath, activate, leg it! When it worked, it felt fantastic: the heart-pounding tension of knowing that the difference between life and death was a matter of milliseconds. When it didn't work... well, Jensen sure doesn't last long if you've not riddled his tortured frame with armour and health augs."}