{"ref": "https://www.eurogamer.net/de-blob-2-review", "date": "22 Feb 2011", "game_name": "de Blob 2", "text": "The best games are often those that don't need to bulk out their premise with weak secondary mechanics. THQ's de Blob for Wii wasn't the best game in the world, but the idea at its heart is timelessly fun all by itself: colour in. How wonderful to see it back for another try, especially now that it's multi-platform.In de Blob's word, cute little one-eyed menaces called Inkies have stolen the colour from the world, trapping its denizens in grey suits, building monuments to the monochrome and splattering toxic black ink all over the place. As a colourful amorphous blob, your job is to slop colour over everything, soaking up paint from big, bright pools and rolling yourself over buildings, trees and cheerful little characters until it's all singing and dancing again. That colouring in is as fun after five hours as it is for the first five minutes.But it's not a free-form structure. de Blob 2 prods you around levels with specific challenges, transforming the place area by area. It works the colouring into tricky platforming tasks and combat with the inky bad guys. Some buildings need to be painted specific colours, and after the first level you're introduced to the concept of mixing, leaving you searching the back of your brain for long-forgotten primary-school knowledge about how to make brown from red, yellow and blue.Painting an entire building lets you liberate its inhabitants from monochrome slavery, earning you extra time to spend on the level's main objectives. A helpful compass encircles Blob, showing you which direction to take to find particular colours or the next task. You can turn it off, but you won't want to – one of the original de Blob's main problems was that it wasn't always obvious where you were supposed to go, and the compass solves that completely.The levels themselves are huge and come in all sorts of strange forms, from an ice-covered city to a soda-pop production plant. It's to de Blob's credit that it never runs out of ideas, saving a unique power-up or environmental gimmick for each new place. Seeing them gradually transform from grey expanses into brightly-coloured, cheerily un-coordinated cartoons is a visual reward that never gets old, backed up by a superb soundtrack that layers different catchy beats on top of each other depending on what colours you're using and how much you've managed to restore.De Blob 2 breaks up the levels with 2D platforming sections that the original didn't have. From time to time you'll have to infiltrate INKT Corp technology and sabotage it from the inside. It's here that de Blob's puzzles and quirkier ideas are hiding: gravity-flipping, switch-hitting, even magnetic puzzling.It's only once you're done with all these challenges that you're really free to roll around rejuvenating trees, smashing up INKT Corp stuff and redecorating all the buildings you'll have missed – by which point, you'll probably want to move on. These levels are loooong. One particular stage about halfway through the game took an hour and a half, and that was without any deaths or restarts."}