{"ref": "https://www.eurogamer.net/lonely-mountains-downhill-review-a-celebration-of-landscape", "date": "22 Oct 2019", "game_name": "Reviews", "text": "Games are not good with nothing. They take nothing and they have to fill it, with guns and targets, sure, but also with XP and challenges and Jimmy Lightning popping in to tell you how brilliant you are. But nothing can be nice. Nothing can be soothing. Nothing can be a game with the wisdom to leave you alone with your own thoughts, a game that simultaneously encourages your thoughts to flock and scatter the way they normally don't.Lonely Mountains is not built of nothing, of course. There is a soaring artistry at work in the way the low-poly landscapes you race through are put together. There is an ideal kind of rickety momentum to the physics as you hurtle from the top of one slope all the way down to the bottom. And yes, you complete challenges and you unlock things - new bike parts, new trails, whole new mountains. There are achievements and all sorts of secrets to hunt for.But still! At the heart of it is wilderness and a sense of absence. The title says it all: it's you, by yourself, biking a trail, getting from the top to the bottom as quickly and as safely as you can. Or take your time. Or wipe out as much as you fancy, the full-stop of collision bringing the wayward, dreamy sentences forming in your mind to a sudden conclusion. Do what you want. Ignore the stuff you're not interested in. Take the bike and go!I love this game. I love the way the low-poly art style perfectly captures something about the natural world, about its love of form, its scatterings and outcroppings. I love the way there's no music to distract you from the soundtrack of the lonely biker, the burr of a distant woodpecker, the ticking of the bike chain. I love the way you can learn to get the absolute most out of your bike, learning to conserve your rechargeable dash, and knowing when you've got enough weight behind you to stop peddling for a bit. I love the dance between elegance and those sweeping corners and absolute calamity as you misjudge something and plant yourself in a tree.The levels are intricate but never seem artificial. You can follow the path that's been worn into the ground, but you can also step away from it and find a forgotten look-out spot or a dangerous shortcut. They are enlivened by a ticking clock but they are not bound to it. They are race tracks but they are also wonderlands where it's nice to simply stop and take in what's laid out around you.This is a game with a link to Trials, sure: you can focus on your completion times and you can chisel every last second out of the track. But what it really reminds me of is a tree, of all things, that used to stand in a sad little park opposite a house I lived in way back. For most of the year this tree was gnarly and shapeless, a mess of sharp twigs and blackened urban-tree bark. But one winter it snowed, and I awoke to see that what I'd always thought was a tree was really a single, curving stroke of white, a painter's line picked out in settled snow on the trunk. To find the shapes in nature a game has to first feel a bit like actual nature. Lonely Mountains: Downhill is genuinely transporting."}