{"ref": "https://www.eurogamer.net/deathsmiles-review", "date": "18 Feb 2011", "game_name": "Deathsmiles", "text": "It started with Defender. Eugene Jarvis' dastardly shoot-'em-up was the first videogame to wear its difficulty on its sleeve, just as players would wear its mastery as a badge of honour following its October 1980 release. Defender divided gamers into two camps: those who played games for pleasure and those who played games for prestige. Soon after its release, it was taking 150 million quarters a week across the US from those hoping to bask in cathode ray kudos.It's a tradition that Cave, Shinjuku's premier boutique shoot-'em-up developer, picked up 15 years later. The company's work with the Donpachi series established its own devilish sub-genre, 'bullet hell'. For years, Cave's precise, inimitable games have challenged the best arcade players to pick their way through squalls of pixel chaos. Those who manage to do so in a single credit are gods among men; their high scores are numerical read-outs of prescient hand-eye co-ordination and the ability to plot a route to victory through a curtain of pandemonium.More recently, with the decline of the arcade, Cave has been attempting to find ways to serve a less twitch-proficient audience, both by way of its iPhone ports and this, the first of the company's arcade titles to be released in Europe in a box. Deathsmiles, which debuted in arcades in 2007, is a horizontal shoot 'em up that manages to serve both types of player that Defender split apart: those who play the game for pleasure and those who play it for prestige. Its solution is simple. Each of the game's eight stages can be completed at one of three 'ranks', difficulty levels that can be adjusted on the fly as you move between levels. For those who want to play simply to make it to the credits in one piece, the challenge can be reduced to make the game suitably accommodating. But lowering the difficulty level of a stage also reduces the amount of points on offer, ensuring that those players who want to play for the awe and respect of their peers are provided with a suitable challenge.Increasing the difficulty of a stage results in more than just speeding up bullets and heightening their density on screen. Entire enemy attack patterns are modified depending on which 'rank' you select, giving the game a very different feel as you slide between difficulties. Of course, with infinite continues and just eight relatively short stages, if you're to draw true value from the package, you're going to have to start to care about score attack, and it's here that Cave's pedigree shines through.Unusually for a contemporary shoot-'em-up, there are two fire buttons, one for attacking to your character's right and one for attacking to her left. In contrast to Gradius, the stage design encourages you to use the entirety of the screen, darting forward to dodge around obstacles, or retreating from bosses. As such, enemies come at you from all directions.As has become standard in Cave shooters, if you tap the fire button you'll shoot weak bullets but will be able to move at speed, while holding the button down will fire a more powerful shot but at the cost of manoeuvrability. Hold down both the left and right attack buttons at once and a circle will encase your character, who then auto-fires at any enemy that falls within its circumference.The key to growing more powerful and attaining high scores is in collecting the gems that enemies drop. Catch these before they hit the ground and they will be banked. Collect 1000 gems and you'll be able to activate 'Power Up' mode, in which your character enters a heightened state of ability and your score becomes subject to dizzying multipliers. While in Power Up mode your gem counter reels back down to zero, the speed at which it empties dependent on the weapon you are using, and the key to stratospheric scores is in shooting down as much as you can while in this state."}