{"ref": "https://www.eurogamer.net/dead-or-alive-paradise-review", "date": "16 Feb 2011", "game_name": "Dead or Alive: Paradise", "text": "To experience the best of Dead or Alive: Paradise, all you need to do is watch the opening cut-scene. Jiggling boobs! Wiggling bottoms! Hair-flipping! Tree-climbing! Two girls barely old enough to take the Key Stage 3 exam licking an ice cream - at the same time! From the shower scene to the final shot of the lady in the pink canoe, it's a cavalcade of impossibly subtle visual metaphors that serves to remind us just how far women have come in their quest for equality.Of course, there's no point complaining about all the tits 'n' ass in a Dead or Alive game. That would be like complaining there's too much port and Blue WKD in your pint of Cheeky Vimto. Besides, when it comes to Paradise there's plenty of other stuff to complain about - such as the rotten visuals, flimsy gameplay, poor controls, limited customisation options, lack of online functionality, shoddy AI, lazy presentation and pathetic excuse for a storyline, to name but a few.The premise is simple, and stupid. Playing as one of the DOA girls (there's a roster of 12, including familiar faces like Tina, Ayane and Kasumi) you get to spend a two-week holiday on Zack Island. There you can visit places like Tranquil Beach, Niki Beach and Bass Island, which are all the same except with the palm trees in a different order. There's the Pool and the Pool Side, which again are remarkably similar. You can buy dull items at a grand total of three shops, or visit the Radio Station, which is actually a music options menu masquerading as a Radio Station.There's very little to do at any of these locations. The beach volleyball mini-game is rubbish - the controls are simplistic and unresponsive and the animations are laughable. It feels like you're trying to command robots whose batteries have run out. The only saving grace is the way the women's boobs wobble around independently of the rest of their bodies, as if filled with sand and helium, in that trademark DOA way.Alternatively there's Pool Hopping. This involves jumping across a series of floating platforms with shape button symbols on them. You earn money for hitting the correct buttons, but your character will still jump even if you press the wrong one. The real challenge is getting the game to recognise whether you've tried to tap the button quickly to do a short jump or held it down for a longer one. It's all very arbitrary.When you're bored with these mini-games, which will happen within seven minutes, you can head to the shops. This is where you can spend your hard-earned cash on nothing of any real value at all, from ugly swimsuits and leopardskin-print beachballs to chips, tangerines, harps and enyclopaedias. No idea.It's important to point out at this juncture that purchases are made via a cumbersome menu system. You must also use menus to navigate between the pool, beach and so on. You can't just walk around and visit different physical locations as if you're in some crazy kind of ~virtual world~ - what do you think this is, 1997?At the end of the day, which can't come soon enough, you get sent back to your hotel and presented with another menu featuring yet another set of tedious options. These include changing the clothes your character's wearing, choosing from a wide range of teeny-tiny lycra triangles. Often you'll find a present from some bloke called Zack waiting for you, and often it will be useless and bizarre. Gift-wrapped cabbage, anyone?"}