{"ref": "https://www.eurogamer.net/army-of-two-the-40th-day-chapters-of-deceit-review", "date": "16 Feb 2011", "game_name": "Army of Two: The 40th Day", "text": "One of the pleasures of reviewing downloadable content is that the game itself is a known quantity. With no need to spend time on important, but not particularly interesting, nuts-and-bolts elements such as graphics and control, we're free to consider the game as an experience and as a narrative.Sadly, for Army of Two, that doesn't work in the game's best interests. Two new campaign missions await in this rather pricey bonus chunk, but since few players will be hungry for more of the game's underfed story, it can only fall back on gameplay mechanics that were only adequate first time around.Unlike the original game, which offered a cut-and-dried alternate ending for your download pleasure, these levels occupy a strange and confusing place in the story, with characters killed at the end of the game now brought back to life, and objectives once completed still to be tackled. They're classed as Chapters 8 and 9, and take up residence at the end of the level select menu, yet seem to take place somewhere between the hospital stage (Chapter 4) and the shopping mall (Chapter 5).There's nothing in-game or in the pre-download text to explain what the heck is going on. This is crude, cut-and-paste storytelling, not helped by the fact that the story was hardly streamlined to begin with, and for those who care about such fanciful notions as context and purpose it makes for an annoyingly fragmented re-introduction to the world of Salem and Rios.If you've come solely for the action, things are on a firmer footing - although not by much. There are no new co-op moves, and no new weapons or enemies, but you do get lots and lots of enemies to kill. Played on normal difficulty you're looking at around 90 minutes to blaze through these new missions, and if anything they're even more ferocious than the existing stages: the body count for a normal run through Chapter 9 stands at over 400.Sadly, the same dearth of imagination that ensured the full game never became more than ~quite good~ eats away at the design and pacing here, with little inspiration in the locations or what happens within them. Tromp down the corridor. Dive into cover. Distract. Flank. Snipe. It's literally more of the same, which would be fine for a game that had already proved its worth, but for a rough diamond like The 40th Day you'd be forgiven for wanting a little more polish after the fact.Unforgivably, these missions don't even offer many memorable set pieces. Only one shoot-out, halfway through Chapter 8, gets the pulse racing. Taking place in a large open courtyard, it offers a thrilling array of tactical opportunities, menacing you from all sides and requiring focused co-operative play to survive."}