{"ref": "https://www.eurogamer.net/download-games-roundup-review-33", "date": "11 Feb 2011", "game_name": "Explodemon!", "text": "At what point does a knowing tribute just descend into a brazen rip-off? We see a lot of titles in the download and mobile scene that sail perilously close to the wind, at times, but there's a big difference between being 'inspired' by the mechanics of another game, and just lifting them wholesale.Twisted Pixel had a justifiable pop at Capcom recently for Maxplosion, and this week we've several more examples of games that don't even bother to disguise what they're ripping off. In the case of Explodemon, though, the similarities are purely coincidental, and, indeed, the games are actually very different.But even when games are basically identical, most people might not even realise how much of a direct copy they really are – as is the case with Boulder Dash clone Digger Dan. Fortunately it's a pretty decent evolution, so you can leave us granddads to mutter about the good old days when everything was original... Some annoying individuals – like Pac-Man – can eat all they want and never seem to put on an ounce. Others only need to glance in the direction of a mince pie for the buttons to start straining. It's a condition that the stars of this enjoyable platformer can certainly relate to as they try get off Planet Earth the only way they know how: by consuming everything in sight.Like a gluttonous LocoRoco on a Katamari kick, you flibble and wobble your gelatinous form around a series of familiar locations, starting off small and gradually ballooning in size as you chow down every last object that will fit in your gaping maw. What the blob lacks in grace he more than makes up for in versatility; he can squeeze into narrow gaps, bounce between walls, and use his mighty behind to butt-stomp destructible objects. He's also not averse to gobbing out undigested chunks as makeshift missiles, which is pretty handy when you need to activate an out-of-reach switch or smash up a projectile-spewing sentry.Like all the great games Drinkbox Studios riffs on, About A Blob has that happy knack of introducing fresh ideas and powers that evolve the gameplay at the right time, and sets them in levels that you'll rarely fully explore or complete at the first time of asking. That urge to go back and ace a level is a definite plus in a compact game like this.Less convincing, though, is the option to play co-op. The ability to suck up each other's ammo and damage one another or knock each other off course means you'll frequently wind each other up – (usually) without meaning to. With few, if any, tactical advantages to co-op play, you'll quickly revert to solitary pleasures.With a loveable art style and knockabout humour adding gloss to its warmly familiar gameplay, Tales From Space: About A Blob is the perfect platform snack.8/10"}