{"ref": "https://www.eurogamer.net/deus-ex-human-revolution-hands-on-1", "date": "3 Feb 2011", "game_name": "Reviews", "text": "Call me paranoid, but there might just be some sort of conspiracy here. Maybe I'm just imagining things. Or maybe it's the four mysterious figures on flickering video screens, faces blanked out, talking about how they're planning to hoodwink humanity. ~A few weeks of discomfort and the public will be primed for the recall,~ one hisses. C'mon, it's not just me, is it? These are shadowy, sinister puppetmasters if ever I saw some. Rotters! Rotters, the lot of 'em. Or are they?The first scene of Deus Ex: Human Revolution is a familiar one. Among the many, many legendary qualities of the original Deus Ex was its pre-credits introduction, which featured two of the game's major characters in full-on Dr Evil mode, choosing history's least subtle secret meeting place (underneath a gigantic, creepy stone hand, of all places) and scattering ominous plot-bombs all over the shop. Human Revolution has a lot to live up to, but also a little bit to live down - so it's warmly reassuring to see it kick off with a similar setup but a little more finesse. Blatant conspiracy this may be, but at least it's had to good grace to not immediately show us who the power-crazed conspirators in question are.So from hereon in, we start guessing. This game of intrigue, violence and augmented humanity swiftly moves to the viewpoint of tiny-bearded, unsmiling protagonist Adam Jensen, a disgraced former SWAT bruiser now heading up security for one David Sarif. This businesslike but apparently good-hearted science genius heads up Sarif Industries, an organisation pledged to ~make human-controlled evolution available to all~.Question is, how much of humanity actually wants that? Sarif has a mechanical hand of some sort, hi-tech and powerful-looking - the result of an accident or an experiment? For now, we don't know much. What we know is that he's Jensen's boss. He's also the boss of Dr Megan Reed, a slightly nervous scientist who appears to be more than close to Jensen. Missus. If you know what I mean. Just good friends, if you catch my drift. Nudge nudge, eh? Fnarr fnarr.They're not so close that she doesn't keep secrets from him, however - a nosy dig around her quarters reveals repeated references to a 'Patient X', someone she'd really rather not talk about. Instead, she's taking Jensen to meet Sarif.Conveniently, this involves a guided tour of the labs. This serves as both a muscle-flexing demonstration of how capable Human Revolution is in the graphics department (a particularly glossy and detailed take on Crystal Dynamics' Tomb Raider engine), and to set up the world.Sarif Industries is a disorientatingly bright and optimistic place, completely at odds with the sinister paranoia and darkness of Deus Ex as we (think we) know it. In fact, the guided stroll through its hi-tech maze of chatty scientists, mechanised arms and - most arrestingly - a headless robo-torso on legs exercising cheerfully on a treadmill - most evokes the legendary train journey that opened the original Half-Life. This is a place of industry, an enclave of great minds working on great projects.Yet there are weapons here too. An automated turret gun demonstrates gunning down multiple drones behind a bulletproof window as you pass. ~Defence contracts keep us afloat,~ someone observes, but those contracts fund R&D that ~could improve everyone's lives~.Life through death, eh? There is, as they say, no such thing as philanthropy. Perhaps that's why Dr Reed seems so sad, almost apologetic. At least she seems nice, unlike Sarif's tech guy Pritchard - a preening, prissy prat in a ponytail. I suspect I'm being gamed, however: he's so evidently unpleasant to Jensen that in turn it seems unlikely that he'd be secretly unpleasant too. I mean, he's even got an English accent - the Hollywood stereotype of villainy. For this reason, I am convinced, he isn't any such thing. Sarif, though... I don't know, this Tony Stark act seems too good to be true. He seems nice enough in person, however, even if he's wearing a waistcoat apparently made out of metal hexagons. It's worth observing at this point that everyone I've encountered so far, even the incidental scientists, has appeared remarkably distinct. There is individuality and character to all these people. I don't know whether the game can keep that up for its duration, but within this extended tutorial it's certainly impressive."}