{"ref": "https://www.eurogamer.net/pro-evolution-soccer-2011-3ds-hands-on", "date": "26 Jan 2011", "game_name": "Pro Evolution Soccer 2011 3D", "text": "3D movies might be doing the business in Hollywood right now, but in the home – as with HD – the appeal of gaming and sports will be key to persuading consumers to make the switch to the next dimension. In PES 2011 3DS we have a title that ticks all the boxes and in portable form with no need for comedy specs or another new telly – and it duly delivers arguably the most visually impressive experience of the system's launch line-up. If sales figures were a football score, FIFA 11 vs. PES 2011 on home console would be a drubbing in EA's favour. PES producer Seabass and his team, after much soul-searching, made important and positive steps forward for the franchise in last year's version – but that didn't stop the gap in sales from widening ever further. On 3DS, though, with no FIFA at launch it's an open goal for Konami and a fantastic opportunity to set the pace on a new platform. As European PES Team Leader Jon Murphy says at the 3DS showcase event in Amsterdam: ~It's the first PES we've ever had out for the launch of a new machine, so I think that tells you a lot~.Content-wise PES on 3DS is a port of the most recent PSP version, minus the Copa Libertadores, with 60 countries, 170 teams and the Master League. In the demo version available at the conference, the only option is Real vs. Barca – but that's enough for a useful taster of the action and a preview of the game's most radical feature: Player's View. A short playtest is insufficient to judge whether the game will be as subtly playable in the over-the-shoulder camera view – it's such a startlingly different way to experience PES that some brain rewiring is required. But as a showcase of 3D it's phenomenal. Off all the games I've tried on the console, nothing comes close to the stunning sense of depth PES achieves when the camera is positioned just behind the keeper for a goal kick, and the other end of the pitch really does look like it's a hundred metres away. As impressive as other 3DS titles are, the third dimension is typically far shallower than is seen here with the sudden and striking awareness of the space around you on the pitch. During play the dynamic camera swoops and rotates around, following the player under your command. An arrow icon at the controlled player's feet points towards the opposition goal at all times to give you a sense of your bearings. It's confusing at first, compensated by the thrill of pumping a ball down the wing for another player to run onto as the pitch stretches out before your eyes. And while falling clearly short of the detail of the PS3 and 360 versions, smoothly-animated player models look great on the small screen."}