{"ref": "https://www.eurogamer.net/spare-parts-review", "date": "25 Jan 2011", "game_name": "Spare Parts", "text": "Spare Parts finally, spectacularly, irrevocably falls to pieces right on the finish line. After several hours of just about holding itself together over four stages of passable late-nineties platforming and mindless button-mashing, it staggers into a final boss fight so horribly misconceived that I was almost convinced it was an elaborate prank of some sort.But I'm getting ahead of myself. Let's rewind to the start, when Spare Parts still looked like a promising downloadable jaunt with high production values.The spare parts of the title refer to chunks of spaceship gadgetry, scattered over the surface of a mysterious planet. The phrase could also refer to the hapless discarded robots that are press-ganged into service by CON-RAD, the ship's computer, to retrieve the important bits so he can escape from a bobble-headed Darth Vader-style enemy who has followed him here to pilfer his cutting-edge systems.If you were feeling uncharitable, spare parts could also refer to the game's design, which feels cobbled together from old ideas and concepts that are never developed beyond their basics. In construction, it all fits neatly into the classic 3D platform game mould, as if someone was impressed by the first Ratchet & Clank game, decided to make something similar but then got frozen in carbonite and thawed out last year with only a fuzzy memory of what it was they were trying to achieve.You guide your robot around four predictably themed stages (jungle, caves, mountains, temple), double-jumping and mashing the buttons for all your worth to bash enemies. Do you do a ground slam if you double jump and press X? Yes. Yes you do. It's familiar, even comforting, but hopelessly derivative.Along the way you're searching for ship parts, as well as new power-ups for your robot. Coins can be beaten out of bad guys or smashed out of the scenery, and later cashed in at the gameplay hub to upgrade your abilities even further.These abilities form the basis of the game's puzzles, so let's take a closer look. Power arms let you smash or move heavy objects. Magno Boots let you walk up the occasional metal wall, fire off an EMP or power certain pads embedded in the floor. Rocket Boots, surprisingly, let you fly for a short distance and can be used to set fire to things. The Nano Trigger is a vaguely defined gizmo that lets you use control panels late in the game. Finally, the X-Scanners are a set of goggles that highlight useful bits of the level.The X-Scanners are important because they highlight one of several persistent problems with the gameplay, namely that you even need an option to tell you what can be interacted with and how. This is one of those games where you'll find yourself utterly stuck, having tried everything you can think of to find the way ahead. Then you try the X-Scanners, and discover you can move something. It's usually something you tried before, but the game's fussy precision means that it's entirely possible to stand right next to an essential object with no effect.Gameplay lurches along in this fashion across the short playing time. Brief formless sections of uninspired platforming and melee combat lead you into big environmental puzzles so irritatingly designed that the game actually has to show you what goes where.One notable example of this problem comes at the start of final stage, the ancient temple. Hemmed into a small area, clearly you need to do something to move onwards. There are gates that can be moved, and some water wheels that can be pushed under waterfalls, but they all slide back instantly.I tried every possible combination. Nothing worked. I quit the level, and started it again. This time I got a short cut-scene highlighting the very waterwheels I'd just been banging my head against. Now, freed by the triggering of their magical cut-scene, they locked into place and the puzzle unfolded. Bug? Glitch? Sloppy design? Who knows, but the fact that Spare Parts is a game where you're always aware that it's probably the game at fault, not yourself, doesn't do it any favours."}