{"ref": "https://www.eurogamer.net/alan-wake-the-signal-review", "date": "6 Jan 2011", "game_name": "Alan Wake: The Signal", "text": "Alan Wake is best when it's ending. That's a compliment. The game hits an aesthetic high whenever one of its episodes draws to a close, with a stark title screen and a cut of music that's perfect for the moment. I savour those few seconds when the text (~End of Episode Five~ or what have you) slinks on-screen in tendrils of smoke, and I love that the song makes everything you just played feel like a grand journey.So at the conclusion of the new downloadable episode The Signal, when the closing sequence came up on my screen with another spot-on song selection, the whole game once again became profound in retrospect. Alan Wake has a pernicious ability to burnish itself in memory. All its finer trappings - the rich darkness of its American Northwest setting, a well-rounded supporting cast, the stabs at emotional complexity - make it a wonderful thing to reflect on after the fact. I wish I could fall into that same reverie while actually playing The Signal. It might turn an inconsistent episode into the transcendent experience it aspires to be.Although not much of the story is clear-cut in the messy seventh chapter of the Alan Wake saga, it's reasonably well established that the action takes place in the imagination of tortured novelist Wake. Sinking deeper into the mysterious Dark Presence, Wake conjures a funhouse version of Bright Falls that you traverse as his mind attempts to save itself. One misplaced thought from our hero makes the street collapse in on itself; another grows a nightmarish forest of flickering street lights.Hovering above this mess are the author's precious words - typewritten spirits like the ones that appeared near the end of the main game. Shine your torch on the ghostly word ~tools~ and a cache of batteries and ammo appears. There are evil words, as well, like ~possessed~, which spawns one of those angry magic refrigerators to delight us with its wobbly, Wake-assaulting hi-jinks.This wordplay is the most interesting new layer that The Signal adds to the Alan Wake template. As silly as it sounds, the Courier Bold poltergeists make for some interesting battlefields, like the furnace room where every oven contains a ~blast~ waiting to char enemies with a stream of hellfire. It's a flamewar brought to life. (But trolls take note: In this arena, your words can burn you, too.)Not every fight benefits from such a clever setup, though, and as a result, the limits of the torch-and-gunfire combat design show through. The Signal makes an obvious effort to step up the difficulty, mainly by throwing more shadowy ghouls in Wake's direction. It's a misguided effort, like trying to top 100mph in a rental sedan - this rig was never designed to go that fast. There's often no way to work your torch and pistol quickly enough to survive.When the enemies swarm, you can either pop flares and struggle to fend them off, or you can run like a frightened cat. (Given that this is Wake we're talking about, it's more like an out-of-shape, wheezing cat with no fashion sense, but the principle remains.) The coward's way out is quite effective. I made a half-dozen attempts to shine, shoot and sneak my way through the aforementioned streetlight forest; then I decided just to book it through the whole damn thing. I only had to try that once. You can tell that The Signal is trying to evoke a fight-or-flight response, which is a smart idea for a thriller, but too often ~flight~ wins the debate hands down."}