{"ref": "https://www.eurogamer.net/need-for-speed-world-review", "date": "6 Jan 2011", "game_name": "Need for Speed: World", "text": "If you were in the Headstart week of Need for Speed World, in which early birds could tour the world a week early, you'll have experienced a discouraging sense of isolation. The first multiplayer race I tried to join was a matter of sitting in a lobby with a single, silent avatar chosen from the small and self-consciously macho collection available. The minute-long lobby wait was so pregnant with tension that I typed an embarrassed “hi” into the chat window, with 30 seconds left to the race. Fifteen seconds later, I got the reply “bailing if only 2”. He proved himself no liar, and some seconds after I was kicked back into the world. Was he rude? Was I expecting too much? Is it mentally ill to fall in love so easily?As the week dragged on, it became clear that I couldn't honestly review the game as an MMO racing game on the basis of the races I was having. There simply weren't enough people. I experienced the reasonable but testing difficulty curve of single-player games - and their inferior Rep (NFSW's XP) rewards - and I initiated a lucrative set of familiar solo pursuits with the police force. But those multiplayer races - surely the entire point of a genre with MMO in it - were attracting a maximum of three participants, whether I was on the American or European server. Generously enough, you can take your drivers onto either server, a boon to anyone who keeps odd hours.It doesn't help that the basic, free-roaming world is almost completely aimless. Your physical relationship with other cars changes depending on what you're doing. In the free-roaming world, other players are ghosts that can be freely driven through. Collisions are possible with server-operated cars and cops, which stutter into existence as you drive around. But anything that you might want to elicit a reaction from - say, a human being - is untouchable.So, unless you're keen on setting off a cop chase, or chasing a stranger around like a ghostly Labrador, there's little to be gained from roaming. Gaining a familiarity with the world might be a benefit, maybe, if you could define and invite people to your own races - as in Codemasters' poorly-reviewed Fuel. But otherwise, the thoughtful convenience of being able to teleport to a race start location renders a wider knowledge of the world redundant. In turn, the ability to remotely join the queue for a multiplayer race renders the teleporting option redundant. This means that there's a inertia with free-roaming and the logging-in entry points are the busiest places. Occasionally, someone does a reverse donut.If you want to interact non-competitively with people in a more substantial way, you can join a Stadium event. This is an area in which you can do anything you like - in less charitable words, there are no goals, and no point. Pose, ram each other, chat, take snapshots. Show off your new vinyls from the impressive - if not Forza-standard - customisation shop. See if you can spell swear words with the shapes. The first stadium - and the only one you'll see for a while - doesn't have ramps or banks, or anything to encourage driving around - it's a simple baseball diamond. Donuts it is, then."}