{"ref": "https://www.eurogamer.net/sayonara-wild-hearts-review-exuberance-precision-and-shattered-love", "date": "4 Oct 2019", "game_name": "Sayonara Wild Hearts", "text": "A huge part of any creative endeavour, I suspect, is learning how to stick things together. It's so strange, really, that at the heart of such a mysterious process should be something so deeply, infuriatingly practical. So how do you stick things together? Some of the best film-makers find their movies in the edit, in that frightening, abstract landscape where time is fractured and can spin backwards, forwards, sideways if you want, while, simultaneously, the cutting suite is littered with old Hula-Hoop packets, its tables haloed with coffee stains. It's not just film: Ralph Ellison, when asked why his second novel was taking so many decades to finish, generally replied by saying that he was working on ~the transitions.~ (Also, his house burned down at one point, which can't have helped.)And here is Sayonara Wild Hearts. It's a game I want to shake and then hold to my ear, listening for a rattle, for a hint of the shape of the internal mechanism. In one way, Sayonara Wild Hearts is absolute simplicity. In another it is a dizzying headlong rush of ideas, pranks, nightmares, middle-eights and other glittering fragments. What sticks this together is interaction. You move, you avoid, you collect, you match the rhythm, and around you one thing becomes another, becomes another, becomes another. A highway grows ambitious and launches itself at the sky. A deer bounds across a fractal winter forest. A ship rolls over humpbacked low-poly waves. Onwards!The theme, if you ask me, is heartbreak and bitter romance and the journey through it all, but experienced as it can only be experienced in the teens and early twenties, when the drama is lurid and the setbacks are brutal and echoing and unprecedented. The whole thing is delivered with the vividness and force of a good revenge fantasy. More practically, Sayonara Wild Hearts is rhythm-action, I guess. You pick through a shuffled deck of scenarios, dropping down tunnels, racing over streets, bounding across rooftops and lancing through the void. Skateboards? Bikes? Magical thermals? No problem. If you see hearts, collect them. If you see obstacles, get around them. How? Sayonara wants you to work that out as you go, as it shifts between two dimensions and three, sending you into the screen, across the screen, out of the screen. One section is a sort of urban chase, sudden intersections appearing out of nowhere. Another is space invaders (again: sort of), playing out on the gently curved surface of a VR headset.The hearts pull everything together. You follow them to uncover racing lines that lead through the shifting visuals, with their bruised 80s cocktail colour schemes and their brittle pop soundscapes. And you note each one, I guess, thinking of the deep wrongs that your pirouetting, motorbike-racing eternally-spurned dandy has suffered. (Keeping track is such a crucial part of heartbreak.) Buttons appear allowing you to land rapier blows in one section and fire rockets in another. A Rez reference gives way to a bit of good old F-Zero. It would be too much, but Sayonara Wild Hearts can change suits so often because the rules of the game remain constant: aim for this, not for that, and watch for the glowing prompts.There are high scores and different ranks, but I had a lovely time fumbling through like a clumsy tourist, listening as choruses and verses turned into actual songs, as one theme gave way to another, a progression of dreams, almost, with the same go-anywhere nature and the same steely sense of a shared theme running beneath it. The soundtrack stretches the boundaries of synthpop from Debussy to Bach. It tinkles and glitters and wafts, but it also thuds like an MRI magnet when it wants to.All of this is the work of Simogo, a studio whose games I love, and whose forthcoming projects I always worry about slightly, worrying because the team seems to have such confidence and such taste that I am forever waiting for things to be over-worked, over-considered, to become too stylish, sharp-edged and chilly.That hasn't happened yet. I now doubt it ever will. Sayonara Wild Hearts is such a simple thing but also such a complex thing, such a heartfelt thing. And so dense! Its exuberance is precision, its chaos is sheer choreography. It can reference Panzer Dragoon, Jet Set Radio, Dyad and Thumper while remaining entirely coherent, entirely itself. And as for the shape, I would say it's more of a playlist than the standard video game movie pastiche. But then I think back to its atomiser bursts of transitions, one idea gusting into another, and I wonder if it's all more ephemeral that that. Maybe this is perfume, following the shape of the breeze. From top-note to drydown, vividly here and then vividly gone."}