{"ref": "https://www.eurogamer.net/castlevania-lords-of-shadow-review", "date": "6 Jan 2011", "game_name": "Castlevania: Lords Of Shadow", "text": "The first thing you should understand about the new Castlevania is that it's possibly not the Castlevania you were expecting. While Konami's latest offers plenty of Gothic crenulations and whip-centric combat as yet another Belmont faces off against a wave of Halloween nasties, it sidesteps, to a large extent, the architectural complexity and wily level design that has helped define the series.You'll still be unlocking new skills to open what amounts to a variety of different doors, engaging in a little light puzzling, and picking your way through environments that grow gradually more elaborate as you head deeper into the adventure. But MercurySteam, the series' current custodian, has shifted the emphasis away from the detailed non-linear exploration of a single location in order to embrace an action adventure with a broader, but more straightforward, approach.The second thing you should understand, however, is that this isn't necessarily as bad as you might fear. Stripping away much of the intricacy – the levels folded in on themselves, the poring over the mini-map as you hunt for promising gaps – sounds like heresy, but it feels, more often than not, like smart pragmatism. This is a series that has always struggled whenever it has headed away from a 2D plane, and while you can curse the developers for lacking the ambition to truly get the old formula to work in three dimensions, you can't really fault the adventure they've offered up instead. As reboots go, this is smart, pretty, and generous.Fans will understandably be miffed at the absence of things like the classic soundtrack and the old plotlines – Lords of Shadows is determined to start its own story from scratch, with Gabriel on a quest to bring his dead wife back to life – but there are plenty of things to help distract them from their misery.Things like combat, for example. It bears the undeniable influences of God of War, certainly, but it brings a unique flair to proceedings too. While there are regular arena brawls and QTE-heavy takedowns, your whip-like Combat Cross makes dealing with the enemy onslaught a pleasure. By the time you've decked the Cross out with chain, hook, and stake attachments, you'll be knee deep in combo options and diving into the upgrade shop every few minutes.Although the early bosses suggest the developers have played a little too much Shadow of the Colossus, later set-piece encounters add a wide range of monstrous, multi-wave brutality to proceedings. When you're into the meat of the game and taking on three-storey crow witches and shape-shifting Lycan chieftains, you'll need to master everything in your arsenal, from nimble dodge to hulking finisher.If MercurySteam is good at the bosses, what the team genuinely excels at is layering interesting ideas on top of the combat. Aside from side weapons like throwing knives, dark crystals and, um, fairies, Lords of Shadow offers two different flavours of magic – Light and Shadow – one of which dials up the force of your blows, while the other allows you to gain health with each strike. Ensuring that every fight is therefore an opportunity for either showboating or recharging your batteries, it's also worth remembering that both come at a cost, and to top up your magic meters you'll need to string together uninterrupted combos without taking any damage. Skilfulness is incentivised, in other words, and button-bashing will only get you so far.When you're not hacking apart grenade-lobbing goblins and nimble poison-spouting ghouls, you'll find that Castlevania's been taking notes from Uncharted, too, with plenty of wall-clinging and chasm-jumping to get you through the game's increasingly devious spaces. The camera's surprisingly good, considering you have almost no control over it, and the Combat Cross is on hand to cheer you up here, too, helping to distance Belmont from the Drakes and Crofts of the world with a series of swinging and rappelling options."}