{"ref": "https://www.eurogamer.net/littlebigplanet-2-review", "date": "5 Jan 2011", "game_name": "LittleBigPlanet 2", "text": "Few games leave no room for a sequel. It makes for poor business and, let's not forget, while the intended destination for most videogame makers is fun, the fuel that gets them there is potential profit. These days, if you want to make money from a blockbuster, the sequel is part of the business plan. But at the beautiful, altruistic core of LittleBigPlanet was the dream of a world that could not only nurture and grow life, but also sustain it. And nearly two years since its debut, this patchwork dimension is still achieving just that. This simple little platform game and its idea lifted from PC game development – that giving your players the tools to make their own stuff after they've finished with your levels will not only maintain the life of your creation, but will enrich it and increase its value – has succeeded in building a community of amateur game designers. They deliver fresh content on a weekly basis, over three million levels to date. Not all of it is very good or interesting content, but enough of it is worthy of attention to keep LittleBigPlanet a perennially habitable planet. So why the need for LittleBigPlanet 2, then? If the only type of content that could be generated by makers using the first title had been yet more woolly platformers, then it would make sense to create a spin-off, focusing on different styles of game. But the original game offered just enough flexibility to allow a creative designer to cajole its virtual ropes and pulleys into making a shoot-'em-up, or a giant calculator. On this basis, LittleBigPlanet's original dizzying potential precluded a sequel. No?The first hour or so spent with that sequel will do little to convince you otherwise. Visually, this sequel maintains its predecessor's crafty, design-savvy aesthetic; as though Hartbeat were remade by Taschen. It's achingly pretty and art magazine-ish, not very much like how videogames usually look at all and all the better for it.Structurally too, LBP2 is identical to its predecessor. Stephen Fry's warm, reassuring tones narrates the menu screens, which direct you one of three ways: into the six themed worlds that comprise the single-player campaign, towards the workbench where you can start work on your own level, or online, where you can sample those created by others. But before you can do anything else, you must complete the seven main stages that comprise the first world, thereby learning the basics of play. The platforming mechanics have been left untouched since the previous game – presumably to allow for compatibility with all of the user-created worlds born in the past 24 months. Sackboy still has a jump that lacks the nippy, digital precision of Mario's by some margin, yet can grab and pull certain obstacles for added flexibility, allowing developer Media Molecule to insert the cross-stitcher's equivalent of crate puzzles into the game's levels. Each side-scrolling stage exists on three planes: fore, middle and far, which can be hopped between in order to move behind or in front of obstacles. Jumping between planes is quick and seamless, but, as a feature rarely seen since the SEGA Saturn's Guardian Heroes, it still feels curiously anachronistic.The level design is never anything short of robust, and, while this is still nowhere near as tight a platform game as Nintendo's strongest output, at its best it's really good. The palette of objects and ideas is richer than in the first game, and you'll encounter a greater range of environmental hazards than before. The palette of tools with which you can interact with the game is also richer, each world you work through pushing more makeshift gadgetry into your paws, from the delicious Sniper Trifle, to a grappling hook, used creatively throughout the campaign to swing and rope climb, to a trio of pilotable mecha-style soft toys, unveiled late in the game. These tools add much-needed diversity to the core stages, which happily improve in quality over the course of the experience on this account."}