{"ref": "https://www.eurogamer.net/world-of-warcraft-cataclysm-review", "date": "24 Dec 2010", "game_name": "World of Warcraft: Cataclysm", "text": "Developers and fans of hardcore, sandbox online games like EVE or Ultima Online – emergent, changing worlds born from dog-eat-dog player interaction – like to dismiss the more populist virtual worlds, like World of Warcraft's, as ~theme parks~. The implication is that they're kiddy activity centres where every event has been designed by committee and carefully stripped of personal risk, and where nothing ever really changes. After you've killed the biggest dragon in the world, you can get off the ride, rejoin the queue and do it all again. Hell, the polygons probably have padding. That's not real life!Well, no. It's a game. Horses for courses, but it's always struck me as a curious insult; theme parks are, after all, supposed to be magical and exciting escapist wonderlands where the fun never stops. If I can have that without paying 10 dollars for a Coke and wading through thousands of human bodies to get to the entertainment, sign me up.I guess Blizzard feels the same way. Almost everything it's done with Cataclysm – the third WOW expansion, which goes hand-in-hand with a sweeping reinvention of the six-year-old game – is about maximising the easy-access fun and minimising the unpredictability and pain. In fact, the developer's now so comfortable with the theme park motif that, in the old-world zone of Azshara, it has actually constructed a rollercoaster.The Goblin-built Rocketway sits players on a cartoon missile and shoots them around the crescent bay of this rocky zone, eradicating tiresome travel times with its big-dipper bumps and swoops. And, yes, there's an achievement for riding it from end to end: a digital souvenir.Indeed, Azshara is a demonstrative case-study for Cataclysm. It's one of the most extensively remodelled areas from the original game. Feeling that the six-year-old experience of levelling to 60 was confusing, bitty and dry when compared to the much slicker, more eventful questing offered in the expansions, Blizzard has used the catastrophic emergence of the dragon Deathwing into the world as an excuse to re-engineer the whole thing.Floods and eruptions have physically changed the world, and events have moved on, rewriting the scenarios and quests of the two continents of Kalmidor and the Easter Kingdoms. Some zones have changed more than others, but the overall experience is overwhelmingly different, right down to the evocative music. This reboot is, in fact, free, and was pushed out to all WOW players in a mega-patch a few weeks before Cataclysm launched.Azshara was known as one of the worst zones of classic WOW, with its awkward geography and thin, context-free questing. Now, boasting over 100 new quests and revised from level 40ish down to levels 10-20, it introduces the newly playable Goblins, a comedy race of rapacious capitalists, to the old world.Old Azshara was a rugged mountain wilderness where life was hard, travel was long and experience had to be won with grit and determination. New Azshara is an explosion of gratuitous entertainment, where quests flow smoothly in jolly yarns with satirical punchlines. Sentient dinosaurs plot to colonise space, vain mages tout mini-games, ancient dragons do rom-com, elemental giants do toilet jokes and you're showered in so much experience and loot you can barely keep up with your own levelling.There can be no doubt about it; it's a revolutionary improvement. The revamp answers a decade of justified criticism of MMO content, junking grind altogether and remoulding old tropes into new (and, incidentally, wonderfully-written) adventures. It is indescribably more fun.It's also quite silly. WOW's Cataclysm is the apocalypse as romp. As destroyers of worlds go, Deathwing is a pretty benevolent one, leaving a trail of entertainment in his wake.There's just one problem. Old Azshara was annoying, but it was also melancholic and mysterious, and wringing progress from it made you feel like hardy fantasy frontiersman and explorer, not a kid at a fun-fair. And due to the ephemeral nature of online gaming, it has gone forever now, and a small part of WOW's soul has been lost with it."}