{"ref": "https://www.eurogamer.net/back-to-the-future-episode-1-its-about-time-review", "date": "24 Dec 2010", "game_name": "Back to the Future: It's About Time", "text": "Touch of Evil may be the classy choice, but for me, the first moments of Back to the Future offer the greatest opening shot of any movie ever made. The magical twinkles of sound that accompany the date and time – date and time! First thing you see! – appearing on screen, followed by the steady, comforting chittering of dozens of pendulums and cogs, and then the fade up and the pan past that endless array of time-pieces.There's an awful lot going on in that tracking shot in terms of exposition – the news report on the telly, Marty's skateboard thudding against the plutonium crate, the mad-scientist dog food dispenser – but there's even more at work in terms of theme, and in terms of foreshadowing. Look closely, and you'll see a 1950s jukebox nestled in amongst the junk of the cluttered lab. Look even closer and you'll see a hint towards the very end of the film: one of the doc's many clocks has a tiny human figure hanging from the hands.The opening of Telltale's Back to the Future game is similarly packed with information. While the first episode of five will ultimately whisk Marty and the DeLorean back into the past on a new adventure to save the Doc, it starts with a reverent reworking of one of the first movie's greatest scenes: night has fallen on the glittering rain-slicked tarmac of – at this point – Twin Pines Mall, and an unwitting dog named Einstein is about to make fictional scientific history.Telltale plays the scene straight, for the most part – right up until the twist ending that propels you into the game's own narrative, which takes place a few months after the end of Back to the Future III. While you could argue that the developer's using a touch of the familiar to clue you into the adventure game's movement, inventory and dialogue systems, in reality, you'll know this is a promise being made. We understand the movies every bit as well as you do, Telltale is whispering. You're in safe hands.That's a relief, because a Back to the Future game is a frightening prospect. For fans, there's the fact that all previous Back to the Future games have been terrible, but there's also that slight twinge that comes from having to acknowledge that something you love so personally is loved, equally personally, by hundreds of thousands of other people. Anything that ropes in Doc Brown, Marty McFly and Hill Valley had better be worth it.For the developer, it's even more terrifying: fumbling a license this powerful would be a difficult disaster to distance yourself from. That it's fallen to Telltale, then, is both natural and quietly worrying. With a growing reputation as the voodoo witch doctors of gaming, reanimating the most cherished corpses of childhood to make the limbs twitch and jerk for a few final hours, Telltale has always delivered, on time and on budget, and with an admirable sense of warmth. The games themselves, however, can occasionally be workmanlike rather than genuinely involving.Happily, Back to the Future is one of the team's better efforts: it may not be the most satisfying of adventure games as far as puzzles go, but it's heartfelt, engrossing and often clever. If you spent your early years dreaming that the family's Citroën Dyane was a DeLorean, constructing your own Flux Capacitor out of cereal boxes or urging Mum to hit 88mph on the way back from Morrisons, you're likely to find this an enjoyable two or three hours, leaving the four subsequent episodes with a promising foundation to build upon.Crucially, It's About Time really looks and feels like Back to the Future. The choice to go with an art style based on broad caricature is a good one: it fits well with the limitations of Telltale's rubbery graphical approach and allows the cast to shine."}