{"ref": "https://www.eurogamer.net/echochrome-ii-review", "date": "21 Dec 2010", "game_name": "echochrome ii", "text": "It's easy to grow weary and cynical about the proliferation of sequels in a games industry where numbers are slapped on the end of any reasonably successful product, apparently without a thought. ~If sales = good then sequel,~ rattles the industry machine. Very rarely do those follow-ups bother to advance or evolve what came before, apart from the expected visual tweaks and a couple of vaguely different features.The stubbornly lower case echochrome ii is one of those rare gems, a game that bears only a surface similarity to its ancestor. Instead of churning out another couple of hundred levels of monochromatic physics-warping puzzles, Sony's Japan Studio has taken the series off in a whole new direction, seamlessly incorporated Move motion control and addressed the major criticisms of the first game along the way.~Once you understand how it's done, and have played through a few dozen levels, the novelty wears off, and all that remains is the rather cold process of grinding away until some combination of the game's five laws guides your little man successfully between his objectives.~ That was Tom, dissecting the original in 2008 and finding a good-but-not-great 7/10 in its squishy guts.That's not the case in 2010. Now rebooted to use light and shadow as its major gameplay components, echochrome ii offers a generous and varied buffet of appetising ideas where before there was only a giant bowl of pasta that became stodgier and harder to digest over time.In essence, the concept is the same: get the little man to the exit. In practice, it's totally different. He's now a shadow, and can only traverse the shadows of the 3D blocks that hang suspended in front of you. Using the Move wand as a surrogate torch, you can manipulate, move and stretch these shadows to create new pathways for the little fella to travel along.It's similar to the graceful but superficial Wii platformer Lost in Shadow, but by trimming away the whimsical fantasy setting and delving deeper into the myriad possibilities of playing with light, it's by far the superior title.Key to this deeper exploration are a handful of special blocks which are mixed and matched along the way. Circular shadows can be ~embedded~ in flat surfaces to create little semi-circle trampolines. Blocks with holes in will allow the man to fall through, but only if the hole is visible. You can close them up by altering the angle of the light.Doorways allow the man to pass through solid shadows, provided you can place both entrance and exit safely. The level exits must also be aligned from an oblong block and a circle, creating the 'Goal' archway through which you must escape. Add in the complete freedom to illuminate these constructions from every conceivable angle, and the scope of the puzzles falls into focus.Individually, these simple functions have obvious uses, but the game quickly forces you to explore and experiment, thinking your way around the various ways the physical laws of this abstract universe can interact. Like all good puzzlers, echochrome ii specialises in scenarios that appear bewildering and impossible at first, only to give way to an elated eureka moment when the solution suddenly becomes so blindingly obvious you wonder how you never spotted it before. The reason you never spotted it, of course, is that these are incredibly well-designed puzzles that mask their complex construction behind a simple façade, and only give up their secrets once you've put the work in."}