{"ref": "https://www.eurogamer.net/killzone-3-hands-on-1", "date": "16 Dec 2010", "game_name": "Killzone 3", "text": "When it comes to enemies in shooter sequels bigger isn't always better, but it's usually the answer everyone offers. Halo went for the Scarab, Gears gave us a giant worm – even Call of Duty had a Soviet rocket. So to discover Killzone 3 has a massive four-legged robot pocked with artillery and shouldering a huge laser cannon is no surprise – and you'll be amazed to learn it's up to you to step into the Hoxton fin of Sgt. Tomas Sevchenko, and sort it out before it destroys what remains of your ISA invasion force.After the ice-locked ships and glacier environments shown earlier this year, the latest campaign level we get to play – in single-player and surprisingly sturdy split-screen – offers a more familiar backdrop. Sev, Rico and company are still on Helghan and we pick them up trying to access a space elevator before remaining Helghast forces can use it to launch a surprise counterattack on the ISA homeworld. It's all brown trenches, rubble and metal walkways, and the overhanging skybox is a fetching shade of nuclear beige.Said stompy robot stands in our way, but there is some debate about how to deal with it. Rico is very keen on riding up to it on Intruders – Killzone's memorable aerial transport ships – and smashing its face in, but boring old Captain Narville is anxious to preserve the body of the small ISA force by pulling back and coming up with a better plan. While you run around trenches shooting snorkel-wearing red-eyed assault troopers and flamethrower enemies in the face, Rico and Narville bicker with one another using highly charged clichés like, ~Don't you ever questions my orders on an open channel.~This gives us a chance to pay attention to the moment to moment gunplay. Killzone 2 had a certain heft to it – partly because of its deliberately cumbersome cover system and partly because of the famously awful controller lag – but Killzone 3 is a considerable improvement without losing any of that distinctiveness. You still grip the left trigger to crouch or seclude yourself in cover, then pop out with the left stick and fire (using iron sights as well if you like) but control is more immediate and precise. If you found the last game a slog, you may want to take another look now your gun actually fires bullets out of it on the same day you press the button.There's no more deviation from the path than there was last time out, but this is no bad thing – like Call of Duty, Killzone was always good at organising spectacle around you while you trundled up a camouflaged valley of angry men and carnage.  Helghast with flamethrowers toast your squad mates, dropships zoom around overhead, and all the while the giant robot – a MAWLR, apparently – is flapping around audibly charging up its main cannon and using it to scorch the scenery around you and your friends."}