{"ref": "https://www.eurogamer.net/atelier-rorona-the-alchemist-of-arland-review", "date": "15 Dec 2010", "game_name": "Atelier Rorona", "text": "Given that she's apparently responsible for the prosperity of Arland – for reasons too complex and frankly uninteresting to detail here – junior alchemist Rorolina Frixell isn't particularly well treated by its residents. Within minutes of this game starting, her shop is threatened with closure unless she completes 12 assignments in a three-year period. Her lazy alchemy master, Astrid, is too busy making suggestive remarks to do any work – and judging by her understudy's lack of knowledge, she's clearly failed to impart a great deal of wisdom during her calamitous tenure.So time's a-ticking and our hero has to learn the ropes quickly, collecting items in the wild and throwing them into her cauldron – all the while attempting to win over the villagers who ask her not to stand near them and complain when she's 24 hours late bringing them gold ingots while they mooch around the village square all day. The tone aims for whimsy, but there's a slightly nasty taste to the constant exploitation of Atelier Rorona's female lead. Throw in a talking fox, a rape and a depressingly bleak denouement and it'd be Lars von Trier's favourite game.Rorona herself – nicknamed after Scooby Doo's favourite Mexican lager – is your typical JRPG heroine, which is to say that she's skimpily attired, saccharine-sweet and almost intolerably shrill. But she's also strong-willed and prepared to knuckle down to save her workshop, digging up cabbages for hours on end to provide dinner for the very royals trying to shut her down so they can build weapons factories. Her constantly chipper demeanour eventually wears you down; she's so determinedly good-natured in the face of adversity that she's impossible to dislike. Her life is split between her workshop and the monster-infested environments outside of Arland. Dungeons in all but name, they're segmented into a number of different areas, each offering specific ingredients to harvest and creatures to kill. Bushes, clumps of rocks and nests hide items – though 'hide' really isn't the word as they're helpfully signposted with a big blue star – which can then be combined in Rorona's cauldron back at base. Most enemies can be avoided, though some are too big or too fast to sidle past on the narrow pathways, while others block key exits and treasure chests and must be beaten before you get to the best or rarest items.Combat is a very traditional turn-based affair with little invention to speak of. Aside from standard attacks, each party member – up to a maximum of three – can choose from a series of Skill moves which, in a rare moment of creative economy, deplete HP rather than an additional meter.As Rorona is the only team member who can use items, she's often cast in the role of healer, especially as her allies – particularly after the first couple of assignments – are much more powerful. Kindly knight Sterk might charge an exorbitant fee for tagging along on Rorona's journeys outside the village walls, but he can take out lesser enemies with a single blow. Party members can periodically defend Rorona or add an additional attack to her own, while elemental abilities eventually come into play, but it's clear that this is not where the meat of the game lies.That comes when you unload your basket at the end of a hard day's foraging and start the process of synthesis. Key items have recipes, which are either learned over time or from purchasing books from the village shops, and you need to find the right number of each ingredient type to start mixing. While it's a shame you can't experiment a little more, some of the recipes are flexible in that they let you use any item that falls in a particular category. Who'd have thought beehives would be a useful ingredient in building a bomb?"}