{"ref": "https://www.eurogamer.net/drawn-dark-flight-review", "date": "15 Dec 2010", "game_name": "Drawn: Dark Flight", "text": "Sometimes, a game gets by on its character alone. That was the case with last year's Drawn: The Painted Tower, an unassuming little point-and-click adventure which might have passed you by. It was hampered by some unfortunate puzzles, a dreadful hints system and a slight lack of variety, but it exuded something special.The same is true of its follow-up, Dark Flight. But in the year since the first game, something remarkable has happened. Drawn's developers have not just maintained the spectacular, magical ambiance of their low-key original, but expanded upon it to a truly wondrous degree. And, most impressively, they've also fixed just about every problem I had with The Painted Tower. The result is that I've spent the past week giddily pestering everyone to play it. Seriously, oh my goodness, play it.Dark Flight isn't perfect, by any means. Like its predecessor, it's very short (I clocked around five hours), some might say it's too easy, and the ending arrives with an awkward abruptness and, frustratingly, a ~To be continued...~ message. But it's telling that my reaction was to become excited about the inevitable sequel rather than scream unpleasantries at the monitor.Drawn's world is the Kingdom of Stonebriar, and your quest - whoever you are - is to save a young queen-to-be from evil forces looking to harness her power. The queen, Iris, is gifted with the ability to paint pictures which come to life, and that in turn grants you the ability to delve into them, making the real fictional and the fictional real, in order to solve a variety of generally straightforward puzzles.It's certainly been built with accessibility in mind, released as it is by Big Fish Games, one of the leading casual game publishers online. But the level of challenge isn't the point here. It's a rare adventure game in which the puzzles simply make sense, and never feel convoluted despite several intertwining layers within the fiction.With the exception of a few mini-game puzzles, most of Dark Flight's challenges amount to simple inventory work. However, in an ingenious move, real items function within paintings, while drawings become their concrete counterparts in the real world. A sketch of a spade torn out of a scrapbook might well dig a hole in Stonebriar proper. Or a fan positioned next to a painting might blow away the clouds depicted within it. Dark Flight cements a perfect internal logic that's entirely fantastical, but brilliantly consistent.It's unlikely that a seasoned player would end up baffled by most of these conundrums, but Big Fish has nevertheless tidied up the hints system which plagued The Painted Tower. Before, it never quite seemed to grasp context very well, pointing you in directions you'd already taken ages ago and, infuriatingly, requiring a sizeable 'recharge' period between each clue. Now, a simple click on the disembodied head of your guide (a petrified butler named Franklin) triggers a series of increasingly explicit context-sensitive pointers – no caveats to be found.I'm sure it will come under criticism for turning an already easy game into a breeze. But you don't have to use the hints, and there's nothing worse than getting so head-poundingly stuck in an adventure game that you've no choice but to give up. Drawn: Dark Flight ensures that this would never be the case."}