{"ref": "https://www.eurogamer.net/mario-vs-donkey-kong-mini-land-mayhem-review", "date": "15 Dec 2010", "game_name": "Mario vs. Donkey Kong: Mini-land Mayhem!", "text": "Can a man really escape his destiny? Jumpman changed his name to Mario, moved to a Mushroom Kingdom, and went on to become a Walt Disney-like amusement park mogul. Just when he thought he'd left it all for good, he gets pulled back to face his oldest foe... construction work. Oh, and Donkey Kong.Lording it over his theme park ~Mini-Land~, Mario gives away figurines of his original damsel in distress Pauline to his first 100 customers. Donkey Kong arrives late at the scene and misses out on what he believes is his rightful swag, so he kidnaps the real Pauline instead. Mario does what any reasonable person would do in that situation and unleashes his hoard of miniatures to get her back.The plot is as relevant as it is in most Mario games: it's a bare-bones excuse for some platform-based puzzling. As with the last couple of entries in the series, you do not control Mario himself, but guide wind-up miniatures in the moustachioed mascot's likeness.The goal of each level is to make sure all minis survive to reach a door marking the exit. Where previous instalments allowed you to stop minis or change their direction, that's no longer an option in Mini-Land Mayhem. Once activated they march forward, only changing direction when bumping into an obstacle.So Mini-Land Mayhem places greater emphasis on manipulating the environment. Each level gives you a set amount of objects you can place to guide the mechanical tykes to safety. It starts out simple enough, with girders that can attach to rivets to form bridges, walls and ramps. Stages gradually grow in complexity as they call for you to place springs, conveyor belts and pipes, which recall a 2D version of Portal with a Mario twist.It's a less forgiving game than its predecessors. In Mini-Land Mayhem, it's mandatory to rescue everyone. To make make things more tense, each exit closes a few seconds after a mini enters, and it's game over if anyone's left stranded.This can seem daunting the first time you set eyes on all the traps and obstacles between you and your goal, but you'll find the Minis guide you as much as you guide them. Plotting a whole course from scratch proves to be an exercise in frustration, but you quickly adapt to figuring it out as you go.Solutions are often deceptively simple. One moment you'll panic, and the next have a good handle on the situation. Tinkering with each stage's geometry is both mentally taxing and genuinely thrilling.One of the reasons the puzzles work so well is that they're malleable, with multiple solutions. While there's usually a best way to solve any particular level, there are alternate routes that are a joy to discover. It's easy to think you've made a critical error only to discover at the last second that there's a way out that's more efficient than your original plan. That feeling of just barely scraping by is consistent throughout.The game owes much of its attraction to fiendishly clever level design that manages to condense Rube Goldberg complexity into areas rarely spanning more than two screens. Keeping track of minis is seldom an issue (it helps that you can pause and look around when laying a girder or conveyor belts) so it never feels as if the left hand doesn't know what the right is doing.There's a decent amount of variety, too. While most stages are simply about guiding mini-Marios, there are offshoots where you have to guide toy versions of characters like Peach and Toad to their own colour-coded doors. Some unlockable stages alter their rule sets by activating all the minis at the off, or tasking you with guiding various characters to the same door in a specific order. It never strays far from its premise, but evolves enough to stay interesting.The exceptions are the boss fights against Donkey Kong. These all involve building a way for minis to hit three switches on a construction site. While fun in moderation, these sequences look and play too similar with too great a random element, making it a chore to achieve high scores.This is too bad, as the incentive for replaying stages is high. Each level contains a hard-to-reach badge and trophy associated with a high score. Collecting these unlocks special and expert stages respectively, adding a lot of value to the package. It may seem like you're making swift progress... until the credits roll and you realise you've still got approximately two-thirds of the game to go, and it only gets harder. Rounding out the game is a level editor.If there's one thing holding Mini-Land Mayhem back, it's that, compared to other recent puzzlers like World of Goo and P. B. Winterbottom, it lacks personality. The Mushroom Kingdom has a rich ancestry that the best Mario games have cultivated for clever satire or winking fan service. But aside from Pauline's presence and some lovely nods to early NES Mario soundtracks, there's nothing particularly fresh about Mini-Land Mayhem's trappings. The mechanics may be polished, but the tone is sterile.However, it's expertly paced, with bite-sized levels that walk a tightrope between pull-your-hair-out maddening and knowingly easy – and while it can be overwhelming and cause you to doubt yourself, it's always worth it for that moment of relief where it all slots into place. There's no one thing Mini-Land Mayhem does that's particularly new or innovative, but it borrows the best elements of games like Lemmings, The Lost Vikings, and traditional Donkey Kong platformers to form an extremely refined puzzling adventure. Mario vs. Donkey Kong: Mini-Land Mayhem! is out now in North America. It will be released in Europe in the first quarter of 2011. It's region-free and import-friendly."}