{"ref": "https://www.eurogamer.net/danceevolution-review", "date": "7 Dec 2010", "game_name": "DanceEvolution", "text": "When I lived in Japan, there was a girl who came to my local arcade on Wednesday evenings to play Beatmania and Dance Dance Revolution. I would go to watch her (not in a creepy way – I wasn't hiding in a bush or anything). She was incredibly, unfeasibly talented at playing rhythm-action games. Playing Expert+ on Beatmania, she'd be utterly motionless except for her hands, which moved so fast in the flashing light of the arcade machine it looked like her fingers were multiplying. On DDR, if she was feeling particularly ostentatious, she'd play two-player by herself, contorting around both dance mats in a blur of hands and feet. It was mesmerising.Dance Evolution would make even that girl look incompetent. Taking humiliation to the next level, the game digitises your image and displays you on-screen as a live-action 2D backing dancer, flailing desperately in the company of perfectly-animated 3D models. Kinect is so low-definition you become a poor-quality GIF with a shimmering outline of white pixels. This, in combination with the brilliantly surreal songs and routines, makes Dance Evolution the funniest game on Kinect. It's steadfastly and unapologetically Japanese. Not one of DE's 30 songs will be recognisable to anyone outside of Asia – they're a dreadful selection of relentlessly cheesy pop tracks, eurobeat travesties and strange R&B efforts. The on-screen text suffers (or benefits, depending on your perspective) from weird, cryptic translation: ~You played without the Dance Gauge, didn't you? Did you enjoy the dancing? When the Dance Gauge goes up enough, you can fly to the Parallel Universe! Take on the challenge of using the Dance Gauge to go to the Parallel Universe!~ (No idea.)The voyeuristic announcer enjoys saying bizarrely literal things like, ~Heat up the floor with your hot moves!~ without any trace of irony. And best of all, the dance routines are alien to everyone except Japanese teenage girls, relying heavily on para-para-style sweeping hand gestures – fig. 1 – and jumping up and down.For most of us, then, there are barriers to overcome. Think of Dance Evolution as a journey of cultural discovery. If you have a thing for J-pop and want to dance like a Japanese girl, it's amazing. If you like comedy, it's definitely worth trying a few songs and spending half an hour convulsed with laughter. But I can't think of many people I know who might actually want to buy this game.The visual language it uses – slowly contracting green, blue and orange circles, bright neon arrows – is much closer to traditional that featured in Japanese rhythm-action than Western dance games. It takes some getting used to, but after a while it's easier to understand than the movements of a motion-captured 3D model. It's also comfortingly videogamey, giving you targets to hit, a combo counter and a big obvious score monitor."}