{"ref": "https://www.eurogamer.net/total-war-shogun-2-hands-on", "date": "3 Dec 2010", "game_name": "Reviews", "text": "They say it's called a revolution because over time it always comes full circle. And that saying applies perfectly the Total War series. In 2000, Shogun: Total War came marching over the hill to change the way we look at real-time strategy gaming forever. Now, a decade on, the masterminds behind the franchise hope Shogun 2 will represent another groundbreaking milestone. Only this time, Creative Assembly is targeting a multiplayer revolution.~In Napoleon we had a multiplayer campaign and drop-in battles for the first time,~ explains Ian Roxburgh, multiplayer design lead on Total War: Shogun 2.~We've kept those and now the multiplayer campaign also includes a fully co-operative mode. You can share field of view and victory conditions with your team mate. ~We've also added a feature called Unit Sharing, so when you're attacked by the AI your ally can enter the battle with you and control some of your troops. It means both players can remain involved at all times.~While this feature is a welcome addition, it's far from being Shogun 2's most standout multiplayer innovation. That accolade goes to the revamped skirmish multiplayer mode which, unlike the modes featured in previous Total War games, attempts to inject context into brutal online bloodbaths. ~What we want to do is make multiplayer feel more like the essence of Total War,~ Roxburgh reveals. ~We want each multiplayer battle to mean something. You still choose an army and then fight someone but now there's a context to it. ~We're calling it the Avatar system. You now get to create and level-up a general unit who will stay with you for the duration of your multiplayer escapades and lead your troops into battle.~Extensive aesthetic customisation options will allow you to create a visually unique commander, and your Avatar's abilities will also be upgradable via a skill tree. Fighting battles will earn you experience that can be channelled into a number of specialist areas, including your general's ability to rally his troops or wield bows with increasing skill. ~We really want to give players a feeling of ownership over a leader character that can be customised and upgraded,~ says Roxburgh.While the tried and tested way of playing multiplayer from previous Total War titles will be retained in Shogun 2, this sequel aims to transform our battles against opponents in mysterious faraway lands like Scunthorpe or Stroud into more purposeful encounters. Along with taking advantage of avatar upgrades you'll be able to bolster your troops' abilities, making them faster, stronger, deadlier and able to go longer between toilet breaks in wintry conditions. Clearly, the opportunity to mould your armies to suit your playing style has the potential to exponentially broaden the series' multiplayer appeal and longevity.These new multiplayer battles will be orchestrated from a traditional turn-based campaign map similar to the ones we've grown to love during the series' single player experiences. It features 65 provinces and 12 naval regions across which players will form clans and fight for ownership of Japan.Each of the provinces possesses its own tactical, economical and military advantages. Some contain specific dojos that allow you to recruit higher level troops, ensuring your army options will ultimately be decided by your battlefield prowess. ~As a member of a clan, when you capture a region, you earn points for your clan for that particular province,~ explains Roxburgh. ~The clan with the most points owns the region and gains the benefits from it. ~We have a dynamic system that creates new gaming worlds depending on how many clans are entering. About 30 clans will fight in any one gaming world. Each 'season' will last two weeks, after which the top clans will be promoted and the bottom ones relegated.~"}