{"ref": "https://www.eurogamer.net/dead-nation-review", "date": "1 Dec 2010", "game_name": "Dead Nation", "text": "A top-down twin stick shooter filled with zombies, the only way Dead Nation could be less original is if developer Housemarque found a way to squeeze some space marines and a dropship in there. It's the definition of a Ronseal game, offering exactly what you expect and not a pixel more.Do you like shooting zombies? Lots of zombies? Have you not had your zombie-shooting itch scratched by Left 4 Dead, Dead Rising, Red Dead Redemption: Undead Nightmare and every other game with ~dead~ in the title? Or by The Walking Dead on TV? Or by Pride and Prejudice and Zombies, which was a book and is now being made into a film? Zombies, rather appropriately, are bloody everywhere and it's sadly inevitable that Dead Nation's no-frills approach leaves it suffering from a severe case of over-familiarity. That's a pity, since there's a solid and satisfying shooter engine under the tired memes, and it's delivered with admirable attention to detail.It seems redundant to explain the plot but in the interests of review etiquette: zombie outbreak, you survivor, reach safety. What matters is what happens next, as you advance through 10 levels of undead mayhem, exploding thousands of heads along the way. Starting out with basic armour, an assault rifle (with infinite ammo) and a linear path ahead of you, the action quickly establishes a rhythm of cautious progress punctuated by sudden influxes of zombie hordes that send you back-pedalling down the street, firing into their scrabbling mass. Every now and again you'll be sealed into a small area, and only allowed to leave when every zombie is splattered.There are two currencies at work in the game's economy. One is plain old cash money. This can be found in the boots of undamaged cars, or in crates tucked away in the margins of the level. At each checkpoint you find a weapon shop where you can spend your loot on new weapons or upgraded stats for your existing arsenal.The other currency takes the form of floating red blobs, left behind by every enemy killed. These raise your multiplier, and since Dead Nation is very much a high score game it's in your interests to keep that number high. International leaderboards track not only personal performance, but also which nations are doing best in the fight against the zombie epidemic. It's a witty concept, even if it's immediately clear that by using simple ~most kills~ criteria the US is going to dominate the top spot through sheer weight of numbers.These two driving needs allow for the game's most interesting strategic twists. Cars not only contain gold, they double as useful smart bombs, detonating after a few shots and wiping out any zombies in the blast radius. Some have car alarms, and once triggered will attract every ghoul in range to come and hammer on its soon-to-explode chassis. Of course, doing so before you've cleaned out the money within means the cash is lost forever. Wade into the undead for monetary gain, or take the opportunity to clear some space quickly and easily? It's a trade-off that tugs at you throughout the game.The same is true of the multiplier. During quieter stretches, you'll come across lone zombies, or small groups that pose little real threat. Do you take them out, perhaps by using the charged-up power shot that decapitates zombies in a line, and stop that multiplier from drooping? Doing so may result in a rush of enemies though, so there's yet another balance to be struck.You'd expect nothing less from the developer of the superb Super Stardust HD, and Dead Nation's construction is suitably confident and robust. It's noticeable in the little things as well, like the handy circle indicator that shows you exactly how much terrain an explosion will damage, and the slick blue silhouette that keeps you in view, even when behind scenery items."}