{"ref": "https://www.eurogamer.net/fable-iii-understone-quest-pack-review", "date": "29 Nov 2010", "game_name": "Fable III: Understone Quest Pack", "text": "It must be a tricky business for developers, this downloadable content lark. Release a pack too soon after a game's launch and you get people accusing you of deliberately slicing content out of the original to repurpose for profit at a later stage. Wait too long, however, and your fickle audience may well have moved on. And do you assume everyone's completed the game, or do you make it accessible to anyone, no matter how far they've progressed through the campaign? It's a bit of a minefield, and it's one that thus far Lionhead has clumsily blundered through – emerging deaf in one ear and with some nasty-looking shrapnel wounds, but with limbs just about intact. Fable II's Knothole Island wasn't bad, while the subsequent See The Future was practically a paid trailer teasing this year's follow-up. Understone Quest Pack falls somewhere in between the two in terms of quality and content, offering three new quests, two of which are high-score challenges, with the third being a more substantial story-led mission.It gets off to a good start, with two new weapons provided as gifts before you even start the quests proper. The Full Monty pistol is a little more powerful than your average gun, while The Marksman 500, a rifle used by Reaver's guards, was my weapon of choice for the DLC pack – partly because completing one of the challenges instantly makes your character 25 per cent more attractive. It does, however, have the side-effect of making the main DLC quest embarrassingly easy.The Voice takes place in a new location hidden underneath the grimy streets of Bowerstone Industrial. It begins when you meet a new owner of one of Reaver's factories, who is perturbed to hear a mysterious voice rumbling enigmatically around the clanking machinery. He leads you to a cellar which ultimately leads to a small village – the Understone of the pack's title, which basically looks like some old Bowerstone assets chucked into a cave – built beneath the surface. Along the way, you're constantly warned that your intrusion will result in your demise, as Understone's security system is gradually activated the closer you get to your destination.Rather than facing off against steam-powered gun emplacements or anything interesting like that, you're instead confronted by skeletal wolves and reanimated Hobbes. If you've finished the game, they shouldn't present any challenge whatsoever: my five-star skills with ranged weaponry allowed me to take any one of them out in a single shot, while even a three-star hammer or sword should comfortably get you through to the dingy hamlet itself. Once there, you meet a few of the downtrodden inhabitants, all of whom believe that the above world has been destroyed. A mechanical lift takes you closer to the source of the voice, via a series of further encounters with enemies appearing in slightly larger numbers, electric fences blocking your escape until you've finished them all off. Finally, you face a brand new enemy – brand new if you've not already purchased the Industrial Knight costume from the Sanctuary Shop, anyway – who is about as tough to beat as the white Balverine in the main game (which is to say, not very)."}