{"ref": "https://www.eurogamer.net/operation-flashpoint-red-river-hands-on", "date": "23 Nov 2010", "game_name": "Operation Flashpoint: Red River", "text": "Operation Flashpoint is one of those shooters in which getting shot actually matters. It could be said that's true of every shooter, but not to this extent. In many modern FPS games, each bullet you take merely drains a little colour from your world until you finally keel over. It's no worse, in a sense, than being told Fred Astaire has died.In Flashpoint, however, even when bullets are simply landing nearby, it's a sign you're probably doing something wrong. By the time they're actually thudding into you, it's almost certainly game over.Players tend to call this sort of thing a simulation. Codemasters prefers to think of it as a military game with a heavy emphasis on ~authenticity~. With Red River, the team is attempting to pull off what should be authentically difficult. They want to keep Flashpoint's hardcore fans happy their game isn't being watered down, while simultaneously making the intricacies of the genre more accessible to new players who might not be used to playing games in which getting shot is a big deal.Here's why you should hope they succeed: Operation Flashpoint is a bit amazing. As mainstream military shooters become increasingly scripted, and increasingly tempted up skidoo-filled mountain pathways by the allure of the cinematic experience, the things they have to do to actually thrill players has gotten ridiculous. It's like the arms race but blended with amusement park rides.Black Ops, for example, needs to arrange for intricately stage-managed avalanches, frantic abseils out of burning helicopters and all manner of other bombastic conceits, just to get your pulse racing for a few minutes. Operation Flashpoint, on the other hand, can deliver authentic terror with nothing more than a stretch of empty road leading to a bombed-out village. Oh, and snipers.Red River is set in Tajikistan. It's some time in the near future and embattled US forces, weary from fighting insurgents in Afghanistan, are pushing upwards into new territory. They're heading for a potential clash with factory-fresh Chinese troops coming the other way. Early on in the central campaign, during a level called The Human Terrain, you'll find yourself on that aforementioned stretch of empty road leading to that bombed-out village. Your four-man fire-team, flanked by Alpha and Charlie units on either side, is pushing across a couple of hundred yards of gravel on an escort mission designed to win the hearts and minds of the local population. That's when the fighting erupts.A Flashpoint encounter may look like an old-fashioned shooting gallery - insurgents appear on overhanging ledges and burst out of doorways - but Red River hasn't become Wild Gunman. It's a far more thoughtful game where progress is slow and hard won. Each encounter hinges on the planning stage as you arrange your squad-mates and scope out enemy positioning. You must then try to out-think your opponents before you're overwhelmed by smart AI that's all too happy to rush you, or fall back and flank – AI's that's happy to wait out of sight until it has just the right shot. Both enemies and computer-controlled allies use the same last-known-position algorithms. This gives each firefight a convincing kind of crescendo structure: you always have to be thinking ahead but you always have to be moving, too. Listen to the sounds of gunfire - if it's getting closer, chances are you've had it."}