{"ref": "https://www.eurogamer.net/harry-potter-and-the-deathly-hallows-part-i-review", "date": "19 Nov 2010", "game_name": "Harry Potter and the Deathly Hallows - Part 1", "text": "For 13 years I've been wishing that somebody would make a great Harry Potter game. Hogwarts, with its magical secrets and hidden nooks, is a setting made for interactivity; I've always imagined that a talented developer could create one of the best adventure games ever made with this material.LEGO Harry Potter is brilliant in its own way, and something I would doubtless have thought was amazing when I was nine and first started reading the books, but there's surely room for a more adult interpretation. Harry Potter's fans have grown up just like he has, after all.Harry Potter and the Deathly Hallows could fit this remit. It's set in the fiction's darkest period, with Harry away from the safety of Hogwarts and on the run from Voldemort's Death Eaters, alone and afraid in a world with no Dumbledore and very little hope for salvation. The colour scheme certainly conforms; the saturation has been turned right down and everything has a hint of grey to it. But instead of a mature adventure, we've got a sequence of seemingly unconnected events stitched together into a shooting gallery, with a cover system that barely works and some of the worst first-person stealth sections I've seen in the past half-decade.As a person who's intimately familiar with Harry Potter, you'd think I'd have a good idea of what's going in in Deathly Hallows, but no. Often it doesn't even bother putting a cut-scene between missions to explain how they're connected to each other.Near the beginning of the game, just after Harry escapes The Burrow, you're given the choice between three missions. One drops you into a dragon's lair and tells you to escape – with absolutely no explanation of what Harry is doing in the dragon's lair or how he got there. The other two have you rescuing Muggle-born wizards from Snatchers in completely disparate settings with a similar lack of context.The game explains itself so poorly that it's a complete muddle, even for fans, let alone for the casual players to whom its over-simplistic shooting is presumably designed to appeal. The actual missions are roughly comparable to a light-gun shooter. You run through levels as enemies appear out of nowhere in plumes of black smoke, aiming at them with the left trigger and shooting spells at them with the right.There are only a few enemy models, so it's as if all the Death Eaters are from the same two families. Occasionally you'll be shooting at two identical ones standing right next to each other. Harry can snap into cover against conveniently-placed pillars, upturned desks and sheets of corrugated iron, but it's barely necessary because the enemies can't aim very well and there is no such thing as AI.It's literally mindless. Defeated wizards drop potions, but the game never tells you what any of them do, just invisibly applies their effects. Harry levels up completely on his own – the most you hear of it is when ~Health Increased~ or something similar appears on the screen. In a similar attempt to remove all impetus towards independent thought from the game, you can press a button to cast Four Points, a spell that shows you exactly where to go at all times via a glowing trail – unless it's behind you, in which case you'll have to turn around before the button will work.Occasional moments of variety come in the form of stealth sections. Under Harry's invisibility cloak, you must walk around in first-person, viewing the world through the silvery folds of the enchanted material and listening to his panicked breathing as he sneaks around on a crowded street or inside the Ministry of Magic. If you bump into anyone you immediately become visible, and therefore susceptible to attack."}