{"ref": "https://www.eurogamer.net/download-games-roundup-review-48", "date": "12 Nov 2010", "game_name": "Reviews", "text": "Some weeks, you only have to turn on your console and there's some curious downloadable wonder making eyes at you. This week is one of those rare, beautiful occasions when no effort was made to trawl the dark recesses of the download stores for interesting content. It all just came to me with a beaming smile and a piping hot drink.Maybe there's a logic to it. Maybe the schedulers of Xbox Live, PSN, WiiWare and Steam have deliberately held back the choice cuts for the crazed run-up to the holiday season. One of my favourites this week, The UnderGarden, was deemed worthy of a full review, and rightly so. It's gorgeous. A real Sunday afternoon chill-out of a game. Go see.Fighting fans are well catered for with The King Of Fighters 2002: Unlimited Match, another gem, as are the shmup crowd with the elderly but still sprightly (or spritely?) Guwange. But that doesn't mean that I've been left with the dregs. Ho-no.At the very least, give ThruSpace a spin – especially since Nintendo has finally given us the option to download a free demo. More of that, please.Spatial awareness is a useful skill. You can weave through Victoria Station concourse in rush hour without being killed in the face. You can peer down curious Kyoto side streets and remember where the hell the Pocari Sweat machine is. And you can play strange, hectic puzzle games that look like three dimensional Tetris. Win!Luckily, Keys Factory's monumentally addictive WiiWare debut is a whole lot more interesting than that, requiring players to guide 3D shapes (or Keydrons, as they're known) down a moving tunnel before slotting them snugly through predetermined shapes in the oncoming wall.At first, these Keydrons will be relatively simple constructions; by rotating them through 90 degrees with the dpad you might, for example, be able to turn a three-square-wide shape into a two-square-wide shape. It's essential to get your head around how the shape will look once you've rotated it – something that those lacking spatial awareness will struggle horribly with.For those who cope just fine with shape-shifting, a secondary combo challenge awaits where you must not only get through the gap, but fashion a shape that allows you to collect two crystals. Build up a multiplier, and worldwide leaderboard glory awaits. You can also try to rotate the Keydron effectively enough to fill in all the available squares in the gap in the wall. Given the game's incessant pace, I can't imagine you having much joy with that unless you're on a Red Bull drip.Some people have nightmares about taking out their zombie wife with a sniper rifle. Me? I'm spinning through 3D space at high speed fretting about getting shapes to fit through narrow gaps. Horses for courses.8/10"}