{"ref": "https://www.eurogamer.net/test-drive-unlimited-2-hands-on", "date": "11 Nov 2010", "game_name": "Test Drive Unlimited 2", "text": "~New hairdresser discovered!~ When this message flashes across the bottom of the screen in the middle of a time trial, you know you're playing a unique (and some might say, uniquely French) racing game.You also know – if you didn't already – that it's a sequel to the inimitable Test Drive Unlimited, and that Eden Games' unusual preoccupations haven't changed a jot since that rough diamond was released back in 2006.This is still a racing game that's as much about exploration and glamour as it is lap times and racing lines; a game where the customisation focuses on your threads and cribs rather than your cars' decals and differentials; a game with Second Lifestyle pretensions of persistence and wish-fulfilment. Here, your avatar isn't just a silhouetted crash helmet – it's a sexier, better you.And that's just as well, because after a good few hours with a beta build of the game – not the very latest version, mind – it still seems to be a game whose immense charms are pegged back by basic handling and a cumbersome interface. However, the more you play, the less noticeable these issues become. You may be familiar with the headlines already. Motorbikes are out and off-road is in. There's dynamic weather and an accelerated day/night cycle which, as long as you are logged in, are synchronised for absolutely everyone playing the game. And Test Drive Unlimited 2 offers the island of Ibiza as an entirely new free-roaming playground paradise, later taking you back to the original, but reworked, Oahu island in Hawaii.Not that anyone who made themselves comfortable on Oahu four years ago will be experiencing severe pangs of homesickness at the start of the game. Ibiza is a subtly rather than strikingly different environment: a bit less ruggedly spectacular in its scenery, and studded with towns whose streets are narrower and more haphazard than Hawaii's spacious grids.It's more European, in other words, and the implied four-to-the-floor Eurohouse thump behind it suits TDU's cheerfully cheesy continental vibe. But the predominant mood of marinas, holiday homes and the high life hasn't changed much. The island is knitted together by a similar network of motorways, mountain switchbacks, leafy suburban lanes and those thrilling, sweeping coastal straights.The biggest environmental changes, then, are the dynamic weather and time of day. These have a mild effect on gameplay – you'll certainly lose grip on wet roads on the simulation handling setting, although Eden never quite dares to plunge you into the pitch blackness of night-time countryside. They do add terrific atmosphere as you raise your roadster's roof in a summer shower or speed through an inviting, twinkling town at night.After selecting your avatar from a few distinctly uncanny valley girls and boys – dancing in creepy slow motion at a pool party – you're offered a Ferrari California as a birthday present. This isn't a riches-to-more-riches tale, though. It was just a dream and you're a humble hotel valet, but you still get to give a girl a lift in the voluptuous sports car before starting from scratch.Scratch, unconventionally, is the 'Classic' racing class, whose vintage motors have been segregated from the main 'Asphalt' cars and the 'Off Road' SUVs. They're not the quickest, but it's nice to start out in a seventies Lotus Esprit, Lancia Delta Integrale or Ford Mustang rather than a modern hot hatch for a change.There are many significant changes to the game's structure. Instead of simply exploring the island to discover new events, you need to pass Gran Turismo-style licence tests (which the game's relaxed handling model and open-road driving style don't really demand, frankly).Competitive single-player events like races and time trials are now clustered into Championships. You can warp between championship event locations at will, whether you've discovered them on the map or not, so these offer a practical advantage as well as a more organised structure. You'll still need to spend plenty of time following your sat nav and dipping into the sluggish map to uncover new locations and events, though.Progression wasn't very well paced in this beta version, with grindy cash bottlenecks occurring before you could afford the cars to participate in the entry-level Off Road and Asphalt events. The acquisition of a house with third garage slot – you start with just two attached to a dismal trailer home – seemed to be a long way off, thus forcing you to sell one of your early cars."}