{"ref": "https://www.eurogamer.net/ai-the-somnium-files-review-a-bizarre-story-masterfully-told", "date": "17 Sep 2019", "game_name": "AI: The Somnium Files", "text": "A gruesome crime scene, a woman mounted on a merry-go-round, her left eye gouged out. A broken down theme park, slicked with rain. It's a perfectly noirish opening, introducing us to a future version of Tokyo and our hero, detective Kaname Date. Soon Date is interrupted by his partner, a - and there's really no way to ease you into this - fully sentient AI who lives in his left eye socket and sometimes takes the form of a one-eyed transparent hamster or a young woman. Her name is Aiba, short for eyeball.Date and Aiba travel from place to place, interrogating witnesses and suspects and searching for further clues. Through all this, Aiba is as much a snarky sidekick as she is a helpful tool. She checks the internet for information, creates heat maps of suspects to tell whether they're lying and gives you x-ray vision. As one murder is followed by another, Aiba and Date use another special instrument in their arsenal to attain the information they need to find leads:  a machine that allows them to enter another person's subconscious and interact with it via a dreamscape called a Somnium. These sections play out like small escape room puzzles. You take direct control of Aiba to interact with a handful of enigmatic items in order to break the dreamer's mental locks which keep important secrets and traumas buried.  Every action deducts time from a six minute time limit. Some actions allow you to conserve time via so-called TIMIES, but you can also collect negative TIMIES with can stack throughout a Somnium. Among the many aspects of The Somnium Files that are surprisingly difficult to describe, these rank at the very top, and puzzle solving is a very generous term for some trial and error kicking, tapping and poking each item.As frustrating as making essentially random decisions can be, especially on a time limit, the dream puzzles showcase The Somnium File's main appeal - sheer creativity. Both the interactive segments, including some quicktime events randomly thrown in for variety, and the visual novel portions where you just follow the story, are full of moments that completely took me by surprise. What a delightful rarity! The Somnium Files also makes use of branching narrative paths, in a similar manner to designer Kotaro Uchikoshi's Zero Escape series. Depending on the decisions you make during a Somnium, the direction of the overall plot radically shifts - quite often, really radically. You can later go back and make a different decision in order to follow the alternate path. Without giving anything away, it's fair to say that each path is completely the others, and each path is vital to putting the whole story together. Just do yourself a favour and finish one branch first before going back, it helps connect the dots better.In investigation segments you scan a static screen Ace Attorney-style for clues, clicking on objects in view - although there are less frustrations than you might find in Capcom's series. As long as there are still questions to ask or things to look at, you simply won't be able to leave the map you're on, which at least tells you there are still options to exhaust. The only thing that takes a bit of getting used to is that asking the same question several times will get people to elaborate, rather than repeat themselves. If you want to check someone's statement again, use the game's log. You can also check a glossary for the many terms specific to the universe. That will hardly be necessary however - you will all but drown in repeated exposition and conversation summaries.The Somnium Files features a small cast of characters, each with a distinct look, and Uchikoshi takes the time to build their personal stories. I wouldn't say there was anyone I liked per se, I don't think this is the kind of story in which likable characters emerge, but their motivations are cohesive and it's exciting how everyone you meet, from pink-haired streamer Iris Sagan, to your 12-year-old charge Mizuki to a corrupt politician and the yakuza, are somehow involved in the case.  Of course it's thanks to a distinct type of anime logic that a bunch of teenagers would be involved in a crime spree at all, but discovering the hows and whys, as overwrought as they can be, is half the fun. Everyone's personality also comes through in the superb voice acting. Date for example is voiced Greg Chun, who also voiced Yagami in Judgement. The only aspect that detracted from the overall mysterious thriller atmosphere for me was the sleazy humour, reaching from jokes about Date dating underage girls to low-effort innuendo. Nothing egregious - just stuff that comes with the anime/visual novel territory.The futuristic setting fits the mood of the story, and the pacing is excellent, with new revelations and twists emerging just as you think there will be a dip in the action. Most of all I think that AI: The Somnium Files showcases  a great way to use branching storylines and how to make players want to go back and explore some more, it's a technique some of the very best visual novels of the genre, such as CLANNAD and Steins:Gate, are so good at. That's why I think The Somnium Files is broadly recommendable - to those still new to visual novels, to fans of Uchikoshi and this brand of games in general, and to those simply on the hunt for an engrossing interactive story."}