{"ref": "https://www.eurogamer.net/on-the-battlefield-hands-on", "date": "5 Nov 2010", "game_name": "Reviews", "text": "This week's EA Winter Showcase saw Battlefield looking to the past and the future – the former by way of a Vietnam-themed DLC expansion for Bad Company 2, and the latter with an extremely ambitious free online title, Battlefield: Play4Free. Putting aside DICE's apparent newfound love of text-speak (at least it's not called Battlefield LOL), it's good to see the series fighting on multiple fronts. Battlefield 3 might still be incubating somewhere warm – and probably fairly noisy – in the developer's studio, but there's a lot of war to be had in the meantime while we wait for it to come together.As with budget student travel, Vietnam's the best place to start. A download add-on for Battlefield: Bad Company 2 (it will require the disk), your 1200 MP or equivalent will buy you four maps, 15 new weapons and six new vehicles with which to play the standard Bad Company 2 multiplayer modes. The maps on display were goodies. Both Rush offerings with a lot of variety, Hill 137 kicks off in luscious jungle before sending you up a steep bank and into the scorched environment of a freshly napalmed encampment, riddled with survivor tunnels. Vantage Point, meanwhile, is a spin on Battlefield: Vietnam's Cambodian Incursion, with a tightly hemmed-in river giving way to open sniper territory, topped and tailed with a fishing village and an American base. Both are lookers - a stylish mixture of deep greens, bleached yellows and washed-out browns perfectly capturing the ambience of the conflict, while the Frostbite engine works its peculiar weighty magic on rocks and rivers alike.The new vehicles include Hueys, the classic Apocalypse Now patrol boat and the T-54 Russian tank. The weapons range from banged-up AK47s for the Vietcong to M16s and M21 sniper rifles for the US. Motion sensors and red dot sites are out, naturally, but iron sights are in. Crucially the expansion's packing a flamethrower, too. Slow to kill in a game in which an enemy with the right gun can take you down in seconds, it's balanced by the fact that it's enormous visceral fun to use up-close, and it allows you to set fire to everything except mud, stones, and water. As Richard Nixon once said, Vietnam isn't Vietnam until you've set some innocent person's home on fire, and it will be interesting to see what the new gadget brings to multiplayer tactics in this hectic game.With an international war crime flickering into smoky life behind us, it's probably a good time to turn to Play4Free. Battlefield's already marked out territory in the microtransactions-powered online shooter space with Heroes, but the developer's latest foray is a clear attempt to play to the desires of a slightly different audience.You won't be rushing into cartoony battles with a sombrero on your head in Play4Free, in other words. Rather, this is a far more po-faced blend of Battlefield and Bad Company ideas, letting you loose in a series of more realistic maps with four familiar classes to choose from – Assault, Recon, Medic, and Engineer – and a levelling curve that attempts to mimic the progression of a real soldier's career. (That said, it's lacking the bit right at the end where they retire and settle down to write large-print military potboilers with titles like Killnuts: A Jazz Rickshaw Adventure.)"}