{"ref": "https://www.eurogamer.net/kinect-reviewed-review", "date": "4 Nov 2010", "game_name": "Reviews", "text": "It's here. Finally. We won't bore you with the palaver involved in bringing you this bumper presentation of Kinect launch coverage – let's just say it's been an interesting, and exhausting, few days.But even if you knew the story, it wouldn't explain why the eventual arrival of Microsoft's magic camera was met with such drama and excitement chez Eurogamer. Nor would the level of hype whipped up by the ringmasters at Microsoft, although that certainly helped (it's not every day we feature an Oprah clip on our website).Maybe it's the large and lavish line-up of launch software. Maybe it's the contrast with the softly-softly approach Sony took for PlayStation Move. But the fact is, this doesn't feel like a mere peripheral. It feels more like a new hardware launch than anything we've seen in years.Kinect isn't perfect by any means. It's expensive, finicky, unreliable and difficult to accommodate. But it's also an extraordinary piece of futuristic technology, and when is the last time the gaming world was treated to one of those?Below we'll bring you our verdict on the hardware itself, its impact on the Xbox 360 interface and the Kinect experience as a whole. But first, the bit you really care about.We've reviewed what we see as the six most important launch games for Kinect. Microsoft must have agreed because they're the ones which were bundled with our test unit. (They also sent us the abysmal Fighters Uncaged, Lord knows why - so we reviewed that, too.)Follow the links below and you'll find full-length, detailed reviews from deputy editor and seasoned Wii warrior Ellie Gibson, EG TV editor and shameless exhibitionist Johnny Minkley, friend of Eurogamer and virtual naturalist Keza MacDonald, and your host, reviews editor Oli Welsh. We've also captured video footage of the games - warts, glitches, embarassing replays and all.Although Eurogamer is a gamer's site we pride ourselves on the fact we take casual and motion-controlled games seriously, having reviewed them on their own terms ever since the arrival of Wii Sports. We hope that's reflected in these reviews.As you can see there isn't exactly a standout, and what you decide to pick up with your Kinect will probably be down to personal taste. No need to choose with Adventures; it's bundled with every Kinect and it's an enjoyable, if limited, tech demo. Kids will love it. But they'll go absolutely barmy for Kinectimals, which surprised us by having the most substantial content of the launch games.Kinect Sports is an exemplary party game, and one of the most convincing performances by the Nintendo cover band at Rare in a while. We loved the football and the punchy presentation, and it's definitely the pick for social play. Dance Central isn't quite the advance on Just Dance we were hoping for, but it's a welcome touch of cool from Harmonix with a terrific song list. The sequel should be stellar.Joy Ride is the only major luanch game you should actively avoid; Kinect will have to wait a little longer for its first worthwhile racing game. As for Fighters Uncaged: ~No no no no no no no,~ says Ellie.But before you can get stuck into the games, how do you get it all up and running?At £130 Kinect is a very expensive peripheral, even considering Kinect Adventures comes bundled in. Good thing it feels expensive, then. It's quite large, solid and glossy, similar in finish to the slimline Xbox 360. There are sharp, angular vents on each side and three big sensors on the front. The unit also sports a power LED.If you have one of those slimlines, you can plug Kinect's single lead straight into the console. If you have an original model, you'll need to use an additional cable which splits into a USB connector and a separate, compact power adapter. For some reason Kinect only works with the USB port on the back of your Xbox, so if you own a wi-fi adapter you'll need to plug it into the front of the machine with an extension cable; it's a bit inelegant.Kinect should be situated in the centre of your TV, above or below it, between two to six feet off the ground. This shouldn't be a problem. The problem is playing space. You need six feet of distance from the sensor (1.8 metres) for solo play. Move your coffee table out of the way and you might manage that. But if Kinect is going to detect two people at once, you need eight feet (2.5 metres) of space, clear of obstruction. You'll also require enough lateral room for the two of you to stand well clear of each other."}