{"ref": "https://www.eurogamer.net/download-games-roundup-review-39", "date": "29 Oct 2010", "game_name": "Reviews", "text": "One day publishers will all collectively bang their heads together and figure out what they ought to be charging for downloadable games - and by extension, downloadable content. On the one hand, you've got the likes of Rockstar effectively slinging out an excellent Red Dead Redemption sequel for a mere 800 Microsoft Points (roughly £6.80), while on the other, you've got Konami putting out a wearisome PSP port of GTi Club Supermini Festa for £23.99.And then, of course, you've got the whole pricing model of on-demand games, which invariably end up costing far more than you'd be able to pick them up in the shop - with none of the benefits of being able to lend them to mates or trade them in at a later date. Right now, it seems like many publishers simply haven't got a clue, while others, like Rockstar and Zen Studios - the makers of the marvellous Pinball FX 2 - show how it should be done.All hail Zen Studios for ensuring that we can all officially shut the hell up about DICE's fantastic early '90s pinball games on the Amiga. Simulating the ancient art of Pinball might seem like one of the most pointless wastes of time in the history of videogames, but put your preconceptions to one side, and you may be surprised at how much fun they can be. Especially when they've been lavished with as much lifelike attention to detail as Pinball FX 2.Sensibly, you can try out each of the new tables for free, as well as updated versions of the four tables that featured in the 2007 original (backwardly compatible if you own the original), and new versions of the various downloadable ones as well (again, backwardly compatible if you've bought them already). In all, you'll have access to 12 excellent tables, each now playable in the new split-screen mode, and benefitting from noticeably improved visuals and a spanking new physics model. The real genius of this revamped version, though, is the new social gaming features, which lure you back in by letting you know when a friend has topped your score. Even in the two days between the game's release and writing the review, I couldn't help but make sure that EG's own Rich Leadbetter was comprehensively conquered.Real pinball fanatics will be in tinkering heaven, too, thanks to the ability to fiddle endlessly with all manner of settings. Just don't get into a conversation with anyone who does this, ok?If you've even vaguely have the urge to flip a steel ball around a pretend pinball table, then   Zen have a little something for you. Just don't dare start beating my scores.9/10"}