{"ref": "https://www.eurogamer.net/vanquish-review", "date": "26 Oct 2010", "game_name": "Vanquish", "text": "It's entirely in keeping with Platinum Games' devil-may-care attitude. For years, we've written off Japanese studios when it comes to first- and third-person shooters: always playing catch-up to their American counterparts, never quite delivering. But Shinji Mikami was never going to meekly push his team's debut shooter centre stage with a deferential bow and an apologetic glance, pleading: ~Might this be good enough, Yankee-Doodle-sensei?~ It's just not the Platinum way. What is, you ask? Well. You kidnap Master Chief, that icon of contemporary Western shooters, that representative of all that is strong and successful about the white man's videogame and its gun-toting alpha-male hero. You strip him naked and throw him into the alleyway behind your Osaka studio, keeping only his clothes. Why just his clothes? Because you don't need the man. Master Chief himself is just a cipher. It's his armour that holds the iconographic value.And once you have the armour, this suit that embodies the great American videogame? Well, then, you do what the Japanese do best. You mod the f*** out of it.When Sam Gideon emerges in the Augmented Reaction Suit (ARS) 18 months later, it's clear combat has, once again, evolved. The round edges from the time it belonged to Halo's hero are still recognisable, but the exoskeleton now bears fifty booster flaps, whirring transistors and other bells and electric whistles. Sure, Halo: Reach gives you a jet pack. But Vanquish gives you the ability to slide 40 yards on your knees along concrete, ducking through the legs of a giant bipedal robot while firing rockets at point-blank range into its groin. Vanquish lets you shoot individual enemy missiles out of the air like you're knocking apples from a low-hanging branch. Vanquish lets you speed up and slow down time at the touch of a button, lurching forwards and backward as you set the pace of war like a mop-haired conductor directing an orchestra of bullets.  Vanquish changes everything.Not that it does anything particularly new, mind you. Rather, Platinum has extracted the best elements of Western gaming's totem shooters: the cover mechanic from Gears of War, the squad-based progression of Modern Warfare, the environmental degradation from Bad Company and the psychics–bending weapons of Half-Life. Then it whisks them up with a host of less obvious ingredients. The recurring hail of tracer gunfire is taken from Cave's ~bullet hell~ shoot-'em-ups; the gigantic boss battles are borrowed from a Metal Gear Solid cut-scene; the constant score-attack incentives are lifted from Geometry Wars. Then it tops the recipe off with set-piece after set-piece stolen from the idea safe hidden deep within Christopher Nolan's creative consciousness. Some, you've seen before. Many of the stages in the game's five Acts take place in the inside curvature of a giant ring world, hundreds of miles of city stretching up into the sky in a gravity-defying scene plucked straight from Inception. But that's not to say Mikami and his team don't play with the idea. Midway through Act 2, for example, you streak along a train track that runs inside the circle, bending upwards into the sky like a giant's rollercoaster, while an enemy train circles above and below you like it just flew in from F-Zero.Other set-pieces are entirely new and, pleasingly, often generated on the fly. Sliding past a mecha in bullet time and picking off the pilot before somersaulting up to the controls, punching in an override key and turning its turrets against its own side is one of the year's most memorable moments.It's not that the idea of commandeering an enemy vehicle is innovative. But the style with which it's handled in Vanquish is unrivalled. If games are adolescent power fantasies that give us the chance to be cooler, faster, more athletic, more precise and less like the lumbering morons we really are, then in Vanquish they reach the full extent of this ambition.It's a cover shooter, at heart. You move from pillar to post lining up shots on enemy robots, d-pad switching between your three equipped weapons. But play the game like a straight Gears of War clone and you'll catch less than half of the appeal."}