{"ref": "https://www.eurogamer.net/indie-at-the-expo-hands-on", "date": "25 Oct 2010", "game_name": "Reviews", "text": "Amid all the big-game bluster at the recent Eurogamer Expo it was refreshing to see the constant mill of people around the Indie Games Arcade at the back of the hall. Fortifying himself with a hot dog at the tail-end of the Saturday, our correspondent dared to enter this den of experimental gaming thought. This is the report he filed.Here's the situation, or at least the one that I could decipher, in the beta demo of Tiny and Big. Tiny is a cute chap with Bomberman eyes, and he's chasing his foe up a mountain. The guy being chased is called Big, although in fact he's very small, and he has fiendishly stolen Tiny's granddad's pants. Dramatically, it has been revealed that these pants (Y-fronts, in fact) bless the bearer with the power of teleportation, but only when worn on one's head.It's a deep and emotional tale, yet also one packed with some impressive physics puzzling. Tiny is armed with a laser-cutter, and the world he inhabits is one packed with teetering columns and wobbly platforms. A left click pulled across a piece of rock at any angle will slice it down that line, meaning that one chunk of rock becomes two, generally with the top-half slowly sliding down to where gravity instructs.If a little more encouragement is needed, however, you can always attach a rope with a right click, and tug the newly unstable structure in your direction. Every crack and smash, meanwhile, is accompanied by huge onomatopoeic on-screen text saying ~Crack!~ and ~Smash!~. It really is quite charming.The quest for the pants becomes one of building your own platforms and toppling obstacles, essentially tactically deconstructing the various towering objects that pepper the terrain. It's a clever game with a beautiful art style, and its beta demo is certainly worth a download from developer Black Pants' website. Yes, there are rough edges in Tiny's movement in this early version - but the dialogue, gameplay and basic concept sparkle enough to let you forgive the occasional unfair plummet and untimely death. Roll on the full game episodes...When it comes to turn-based strategy that doesn't start in 'Civ' and end in 'ation', this particular EG correspondent generally responds in the way a Labrador might to being set a particularly difficult maths problem. To which end (as I tilt my head on one side and look at you quizzically before making a move to lick your shoe), I must say that even someone as clueless as me can see the innate charm of Skulls of the Shogun.The clear inspiration here is Advance Wars, though there's a touch of Final Fantasy Tactics in there too. The rubric has it that two spectral teams of Samurai types are having a showdown in the afterlife as a part of the ancient ancestral battle between primary colours.Each team has a selection of horsemen, archers and foot-soldiers, backed up by a General who comes with the advantage of two different attacks and steadily increasing health, yet the disadvantage of prompting your own personal game over come his death. Each player (although there will be singe-player levels available) gets to move five units per turn, moving to strategic spots on the sumptuous battlefield, haunting different locations to summon up bonuses or making attacks on your foes. Have him eat the skull of a fallen opponent, meanwhile, and your chosen little Samurai chap will become ever more effective as a smiter of his enemies.It's a charmingly free-form affair, not limited by some boring grid beneath the battlefield, yet there's a deep vein of tactical thought that runs beneath its easy-access veneer. Best of all, however, is that it has magical foxes. What's not to like?"}