{"ref": "https://www.eurogamer.net/costume-quest-review", "date": "21 Oct 2010", "game_name": "Costume Quest", "text": "If, like me, you have a bit of a sweet tooth, Costume Quest is going to be deadly for your waistline. An hour in and I was craving a pack of wine gums. By the time I finished the game, I'd demolished a whole bag of Haribo.As you explore you'll come across candies in the street, in bins, bushes and piles of leaves. They cascade into your tote bag or pumpkin pail from the hands of generous neighbours. They're the game's currency, used to buy Battle Stamps, the buffs for your character's attacks. They're omnipresent. If there's been a more effective gaming advert for the confectionery industry – and no, Sam Fisher's surprising affection for Airwaves chewing gum doesn't count – then I haven't seen it.Fortunately, Costume Quest isn't the kind of sugary indulgence that's likely to make you feel sick. Rather, it's a light and delicious treat that's perfect for enjoying between this winter's gaming meals without the risk of ruining your appetite. You play as either Reynold or Wren, a pair of twins forced by their parents to go trick-or-treating together on Hallowe'en night. Whichever you pick, your sibling – dressed as a large boiled sweet – is kidnapped by monsters attempting to steal all the local candy for a mysterious glucose-related master plan concocted by a snooty witch named Dorsilla. Your job is to rescue your sister or brother and foil Dorsilla's syrupy scheme. To reach your Wiccan foe, you're tasked with unlocking a large gate at the edge of your neighbourhood. To do this you need to liberate all the candies from the various households – in other words, knock on every door and ask ~trick or treat?~ Sometimes you'll have your bag filled with candy; sometimes you'll encounter monsters and have to fight them in fairly rudimentary turn-based combat sequences.What makes this more interesting than it sounds is the set-up. In the early stages you're dressed up in a cardboard robot outfit and a friend – who you rescue from the local bully – is a rather feeble-looking knight, complete with crumpled bin-lid shield. But as battle commences, the kids enter a flight of fancy whereby they transform into huge and powerful versions of the characters they're dressed as. So Reynold becomes a giant, missile-firing mech and Everett is suddenly a hulking, chainmail-clad paladin.Encounters are reminiscent of the Penny Arcade games or the Mario RPGs, with timing-based inputs boosting the power of your attacks and reducing the force of your enemy's blows when defending. A special meter which builds during each turn eventually allows you to unleash a more powerful attack, while the aforementioned battle stamps let you dodge more effectively, poison or burn enemies, or even stun one of your opponents by pelting it with rotten eggs. Once you've cleared out all the houses, you're free to move to the next area, though most players will want to polish off the brief side-quests or explore for hidden items. Treasure coffins hold extra candy and costume parts, though you'll need to speak to NPCs to obtain the patterns first.Each costume (there are 11 in all) has its own special abilities, though there's so much joy in their discovery that it'd be remiss of me to spoil too many. There's a genuine, childlike thrill to witnessing the transformations: a tinfoil hat, large sheet and feather duster make for a perfect home-made Statue of Liberty, and while the charmingly simplistic art style – halfway between Fairytale Fights and Animal Crossing – doesn't show off the sticky tape, the loose threads and the crinkles in the foil, you know they're there."}