{"ref": "https://www.eurogamer.net/just-dance-2-review", "date": "21 Oct 2010", "game_name": "Just Dance 2", "text": "Junior Senior's Move Your Feet is one of those records that has next to no virtue away from the dance floor. Its grating vocals, synth horns, cheap repetition and blaring, kitchen-sink production trample tastelessly all over the legacy of the disco legends like Nile Rogers that it rips off. Unfortunately for music snobs everywhere, it's also insanely catchy and great fun to shake your ass to.In short, Move Your Feet bears the same relation to serious music that Just Dance does to proper videogames.Just Dance is a stupid, shallow, garish thing that mocks the skill and sophistication of great game mechanics. It has absolutely none of the score-attack cachet that helped the hardcore get along with Guitar Hero. It is principally loved by small girls and, secretly, their parents, who stick it on when drinking white wine with the neighbours after X-Factor on a Saturday night. People, in other words, who couldn't possibly know better.So we watched its stupendous sales from our ivory comments threads and shook our heads sadly, pelting it with the rotten tomatoes of our scorn. It was a soulless cash-in, we surmised, an unrefined piece of waggleware, a cynical land-grab for the Wii's clueless casual market who only snapped it up in their ignorance. Right?Wrong. How's this for an inconvenient truth: Just Dance sold multiple millions for the simple reason that it's incredibly good fun. And being good fun is to games what having a good beat is to dance music; it conquers every criticism.And cynical? However calculating the boardroom meeting that greenlit it, in itself Just Dance is about as cynical as a three-week-old Labrador puppy. It is imbued with an infectious, childish joy in dancing, and a love of music every bit as genuine as the more studied beatmatchers from Harmonix, Freestyle and the like.Nonetheless, Ubisoft Paris is going to have to do something to justify this sequel, released just 11 months after the original, which is still shimmying around the lower reaches of the UK Top 10. Fortunately, Just Dance 2 makes a compelling case for itself right away with one brilliant addition: duets.11 of the 44 new songs on the disc have been choreographed specifically for two players, represented by two dancers on the screen. These routines are absolutely priceless. Just Dance was always much more fun in company, and now the duets enshrine this in gameplay, tugging you into happy interaction with each other.Vampire Weekend's A-Punk segues from indie-kid stamping to ballet pirouettes; Donna Summer's Hot Stuff is hilariously cheesy his'n'hers disco flirtation, complete with mime; twin B-boys duck and weave around each other and shake their afros to Kriss Kross' riotous Jump. There's even a Charleston. The duets are the highlights of Just Dance 2, and the perfect showcase for its cheeky energy.The game's heart and soul is its choreography, and once again this is superb. In a very real sense, choreography is Just Dance's level design, just as (if not more) finely calibrated and creative as, say, the note patterns in Rock Band. Every routine is perfectly pitched for difficulty – easy enough to get into on a first go, hard enough to make you want to learn – and they're all witty, appealing and full of character.But it's the brilliant performances of the dancers that make them so infectious. However good your motion capture, a dancing avatar is always going to look like a puppet; Just Dance's stroke of genius is to use stylised video instead, and the irresistible, human energy and mischievousness of these dancers radiates from the screen. They're bouncy and irrepressible, a little bit clownish but with lots of charisma and a certain innocent sexiness too.Just Dance 2's dance and choreography teams are one and the same, so take a bow, gaming's unsung heroes of 2010: Julia Spiesser, Jérémy Paquet, Zack Reece, Nicolas Huchard, Julie Dorval, Natalie Lucas, Jessica Katanga and Les Twins. Stars, every one."}