{"ref": "https://www.eurogamer.net/arcania-gothic-4-review", "date": "21 Oct 2010", "game_name": "ArcaniA – Gothic 4", "text": "In the time-honoured RPG tradition, I've been collecting swords.Not to use, necessarily – Arcania's endless kill-and-loot cycle so rarely throws up compelling gear, it's almost a joke – but to sell. Gold is required to buy crafting blueprints from the smithy, so I can tinker up some interesting magical weapons of my own. These blueprints are astronomically expensive, but I've been collecting for some hours now. Let's see what the shopkeeper thinks of my wares.32 swords, nine crossbows, 19 bows, 17 shields, a dozen orcish maces, a couple of hundred arrows and a magical warhammer nearly twice my height called Cold Hatred. I wait for the trader's reaction to my titanic haul. Seriously, I'm like Doctor Who, cheerfully jogging an endless string of first-division players out of the Tardis in front of a baffled Fabio Cappello.Does he stagger back in amazement at the implausibility of it all? No. He tosses me a pittance, which nudges my funds the tiniest pico-increment towards affording something truly useful. This scene illustrates the lack of balance that permeates Arcania. The fourth instalment of the Gothic RPG series has fallen to German developer Spellbound after the original studio, Pirhana Bytes, split from their publishing deal with JoWood in 2007. It's familiar territory for fans of the series – at heart, it's a trad hack-and-slash RPG – but after three years in development (and with some obvious areas of excellence we'll come to) you might expect something a little more rounded, a little more intelligent, a little more... developed.Take the visuals. In many regards they're spectacular and evocative. You'll see some breathtaking vistas in Arcania; looking down from a high mountain across acres of woodland, with snowy peaks rising in sharp, blue-white relief in the far distance, you might make out a temple nestling among the crags and, with a feeling of warm anticipation, realise you'll probably end up there soon.Sunrise and sunset can be times of wonder. An early bow-tutorial quest sees you hunting deer at sunset in a woodland glade. Excellent use of high dynamic range lighting creates a contrast between deep, shady greenery and the honeyed richness of the setting sun, which paints its way through branches and boughs to colour the terrain in a terrifically atmospheric way. It can be heart-stoppingly beautiful.But in the same breath, the graphics also disappoint. For instance, dialogue sequences, which use the in-game engine, fail to show off the superb character skins, as high-res textures often don't resolve and those crisp, steely suits of armour slump into drabness. The commendably intense levels of foliage draw in and out of the middle-distance as you wander the world and this really breaks the spell every time you notice it. The worst assault on the senses comes courtesy of whoever decided to apply tree-sway animations and, seemingly drunk on a dream of dancing foliage, turned the dial to 11. Trunks and branches take on a rubbery life of their own and, in certain parts of the world, entire woodlands sway and lurch sickeningly. It's as though you're stalking through a nightmare landscape of leafy cartoon blancmanges – a sad undoing of somebody's hard work that butchers the suspension of disbelief. The sense of simultaneous success and failure is felt everywhere. Take the quests. They're prolific, and there's a great incentive to do them, as it soon becomes apparent that completing quests is a far more efficient way of levelling than grinding your way through monsters. But fetch-quests and kill-quests are all too frequent, and the machine-shop repetition soon leads to the kind of RPG ennui we've all felt. But it's the critical-path quests, which should feel big, meaty and important, which form the greatest source of irritation. Here's how they work, every single time.You enter a new area of the world, with a single objective for the storyline. You meet an NPC. He tells you what must be done to drive the story onwards and get you closer to your goal. Then he throws in a complicating factor – essentially a storyline sub-quest. Can you maybe go and get this thing for me?"}