{"ref": "https://www.eurogamer.net/assassins-creed-brotherhood-hands-on", "date": "19 Oct 2010", "game_name": "Assassin's Creed Brotherhood", "text": "Rome wasn't built in a day. It was built in 365. While the multiplayer component to Assassin's Creed: Brotherhood has been in development for years now, the single-player game has been pieced together in just 12 months by much the same team as built the second game. And how they've used that time. When you first step into the Roman colosseum, it's another Damascene moment. The sense of awesome scale and craftsmanship that's gone into recreating this ancient monument is comparable to the first time you rode over the crest of the hill and saw Jerusalem laid out on the horizon of the first game.It's in ruins, of course. By Renaissance Rome the colosseum was a tourist attraction, much as it is today, the sand once stained by the blood of so many martyred Christians now overgrown with tall grass, the tiered seating worn and crumbled by time and the footfall of a hundred thousand sightseers. The result is a strange feeling of virtual tourism within tourism, as you marvel at the hustle and bustle of 16th Century Italy and marvel again at the remains of a Rome 1200 years older still visible through the cracks of the Catholic architecture now built upon it.The year's work hasn't all been architectural, though. Brotherhood opens moments after the second game closed, implying that, for its writers, the story of Ezio Auditore da Firenze was planned in full long before Ubisoft Montreal split it into two separate games. But the game systems that the story and setting dress have been tweaked and added to in exciting, meaningful ways that run deeper than the tweaks to the combat system.The Brotherhood of the title is more than a narrative congregation, though it is that too. At the start of the game Ezio arrives at the Villa Auditore from Florence still a young man. He has a boastful swagger, the sort of braggadocio any twenty-something who had single-handedly thwarted a circle of Templars and confronted the Pope within the Vatican itself would exhibit. Moments later, his lovemaking interrupted, his villa decimated by cannon fire, his friends and family dead and his torso sporting a deep wound, he escapes a grown man, finally understanding that a war that cannot be won singlehandedly.In mechanical terms, this realisation translates to a kind of management metagame overlay to the now well-established Assassin's Creed template. In between chasing the story missions, clambering over architecture and killing in silence, Ezio can find and recruit assassins, men and women sympathetic to freedom's cause, who join his ranks on principle. You have up to eight slots in your assassin's guild, and can dress and equip each as you see fit. These fighters can then be called upon during the normal flow of play to, for example, stealthily take down a target you mark, or create a distraction allowing you to move through the world undetected."}