{"ref": "https://www.eurogamer.net/football-manager-2011-hands-on", "date": "14 Oct 2010", "game_name": "football manager 2011", "text": "You never quite know what to expect from the Football Manager series. One year you're eulogising about major advancements like the top down 2D engine, or more recently its 3D successor; the next you're forced to scour the game, piecing together myriad tweaks and small new additions. This year's version looks like it's going to sit somewhere in the middle.If you're one of the hundreds of thousands of players who've spent countless nights fluctuating between household item defenestration and skipping around your living room with hands aloft after an extended FM session, you'll know just how deep and complex this simulation series is. In recent years, many fans have complained that FM has become prohibitively inaccessible, despite the presence of advisors. With Football Manager 2011, this could be about to change thanks to some of the most comprehensive and informative player assistance features to date. A new series of clearly explained and unobtrusive hints and tips have been added that cover everything from the game's core concept to its more complex workings.But while accessibility is all well and good, you're probably itching for a rundown of FM2011's new features. If you're looking for something revolutionary, it's likely you could be a little disappointed. But the good news is this is a game stuffed with sizzling nuggets of potential.If there's one word that best sums up Football Manager 2011's strides this year, it's communication. I've already touched on the more welcoming nature of FM11's player guidance system, but in addition to this there's a revamped player and board interaction feature. Talking to your staff and employers is now a much more personal and engaging affair. Speak to someone and you now find yourself faced with numerous conversation options. Saying one thing to a player then reading their reaction in the press is a thing of the past.To ask a first team player to take rookies under their wing you must first choose the manner in which you make the proposal. That's where knowing your players comes into effect. If you're dealing with an over paid prima donna, appealing to their ego to convince them to take on an up-and-coming kid is likely to reap greater dividends than taking a baseball bat to their kneecaps and telling them to lump it. Giving players instructions how to play is another option. You can order them to start dropping deep to receive the ball more often or dribble down the left wing on a regular basis. Suggest something that's totally out of kilter with their playing style and you could be in for a bust-up.Similarly, you can converse with your board to request more funds or time, or suggest affiliations with feeder clubs. As with player interactions, it's how you sell your argument that can be key. Once you've made your conversation choices, you're presented with a full (if admittedly slightly simplistic) breakdown of your entire discourse. Press conferences have also been polished, with a more interesting set of questions posed to you and a greater, less black and white variety of responses at your disposal."}