{"ref": "https://www.eurogamer.net/assassin-s-creed-brotherhood-hands-on", "date": "27 Sep 2010", "game_name": "Assassin's Creed Brotherhood", "text": "Let's play a word association game. If I was wearing a loud shirt, sporting silly glasses and holding a giant foam hammer, and I shouted 'Assassin's Creed multiplayer!' at you, what would be the words that instinctively tumbled from your mouth? I strongly suspect they'd be 'needless', 'pointless' and 'futile', possibly followed up with, 'Where am I? What's going on?' You couldn't be blamed for this. There's a grand history of rubbish multiplayer modes built as an afterthought, for the sake of emblazoning the game box. There have also been plenty of decent stabs at online play sent out to die at the hands of monolithic competition and under-populated servers. What's more, when games like Assassin's Creed and Dead Space - both famed for strong solo narrative experiences - suddenly get lumbered with multiplayer, it all seems ever more frivolous and unnecessary. I can't speak for Dead Space 2. But having experienced the multiplayer aspect of Assassin's Creed: Brotherhood, I can only apologise for imagining those cynical associations popping into your head. This is an interesting, engaging and welcome addition to the series, and it's quite different to anything already available on consoles. You play as an Abstergo agent honing your assassin-murdering skills within the original Animus - not the one Desmond's merged with in AC2 and Brotherhood single-player. Because you're no longer inside the rather ramshackle affair maintained by Danny ~bloody~ Wallace, the UI and menu screens within the MP contingent feature the sleek white colours and stark geometry of the first game.The primary multiplayer mode is called Wanted. It's a cat and mouse affair where everyone is the cat, yet simultaneously the mouse. Each of the eight players chooses their character's appearance – sultry Courtesan, hook-masked doctor or hooded executioner - before entering the map. The trick is that each castle and city is flooded with the familiar NPC crowds, and many of these aimless wanderers are direct doppelgangers of you and your prey. Upon spawning, you're given a target and an approximate compass bearing. You then head off to make a killing, knowing any non-NPC-like behaviour will make it obvious to your own pursuer that it's slow-motion stabbystab-stab-stab time.It's a gameplay idea that's already been used to middling effect on PC in The Ship, but here the action has a faster pace and a greater feeling of consistency. Indeed, just to pre-empt the comments thread, it's worth noting that the developers at Ubisoft Annecy claim to have come across The Ship long after they'd come up with their own premise.That idea was inspired by the real-world people-hunting game Assassin (as detailed on Wikipedia). The Ubi boss types decided it wasn't a strong enough concept to merit the launch of new IP, so it was merged into ongoing Assassin's Creed battleplans instead. As pursuer in Brotherhood, however, you won't be an annoying student armed with eggs and water. Every character has a unique hidden melee weapon with which to take down targets. You'll find yourself in the general location of your prey and scanning the crowd for unusual behaviour. Anyone climbing walls, dashing over rooftops or diving gracefully into a hay cart is clearly another player and perhaps your target – but subtler activities like running or even walking a little too confidently will also give the game away. Once you're certain you've identified your contract (or have accidentally targeted a pedestrian in a tragic case of mistaken identity), you can take them down with an automated attack from street-level or rooftop vantage point. You could also use some of the assassin paraphernalia you've unlocked and brought into the arena."}