{"ref": "https://www.eurogamer.net/sid-meiers-civilization-v-review", "date": "21 Sep 2010", "game_name": "Sid Meier's Civilization 5", "text": "When I first got my hands on Sid Meier's Civilization V, my life became a fight. I don't mean I was struggling to guide my civilisation to global renown, languidly picking my way up the research tree, sending little men to die in little wars. It wasn't that kind of fight. I mean I was fighting not to click the icon that led to the game that led without fail or mercy to me entering a kind of strategy fugue, which I'd emerge from, hungry and dehydrated, between three and seven hours later. To say this game is addictive is like saying that dry toast is edible. Of course it is, but that's not the whole picture.If you haven't played a Civilization game before, they have the grandest of all strategy concepts. You're given control of an entire race of people circa 4000 BC, and from a humble beginning caving in the heads of local barbarians you engineer your nation's success over whole millennia, eventually reaching a day-after-tomorrow technological level with Nanotech and (new with Civ V) Giant Death Robots.One of the more curious parts of Civ is the different ways you can win it. The Domination victory has been simplified with Civ V to ~simply~ holding the capitals of all the other civilisations. Then there's the Science victory, whereby you assemble the various parts of a spaceship and launch it; the Diplomatic victory, where your peaceful ass is voted to be head of the United Nations; and the Cultural victory, which in Civ V means using culture points to complete five social policy branches and then the 'Utopia Project'.Maybe this is all sounding unpleasantly dry and complicated, but it's not in the slightest. The turn-to-turn action in Civ V is built out of nothing but intriguing little questions. This is its genius. ~What's this city going to build?~ the game asks. ~Good, good. Now, where's this ship going to move? Oh, wow, you researched Banking! Holy crap! Now, what would you like to research next?~And then it's 7pm and you're eating fistfuls of dry cereal straight out of the box because the prospect of leaving the game to cook something as complicated as cheese on toast is an impossible idea. Mouth full of bran flakes, you order Beijing to begin the 40-year construction of the Notre Dame.Which is something else that gives the game colour. Civ forgoes abstraction for letting you re-assemble human history in the wrong order. The Americans can build the Pyramids and the English can build the Pentagon, and every race is led by a disturbingly immortal imagining of one of their most famous leaders. If you spend a game neighbours with France, you're going to be putting up with Napoleon for several thousand years. Probably best just to start a new game. Or crush him immediately under a swarm of primitive spearmen. ~What are you going to research?~ SPEARMEN. ~What's this city going to build?~ SPEARMEN. ~Where are these units going?~ TOWARDS THAT BASTARD.Civilization V's primary goal was to streamline this concept even further, something it's done a wonderful job with. If you've never played a Civ game before, this is the place to start. The interface, the information the game provides you with, the array of excellent sound effects as you clunk and swoosh your way through various decisions - it's all pretty much perfect. Likewise, a lot of attention's been lavished on the visuals of the world, the idling deer, the animations of your workers and so forth. This and the swap from the series' traditional square grid to a hex-based map, has created a place that's pleasant to explore and develop."}