{"ref": "https://www.eurogamer.net/sonic-free-riders-hands-on", "date": "21 Sep 2010", "game_name": "Sonic Free Riders", "text": "Remember Sonic Riders? No? That's probably because it was awful. It's the worst racing game I've ever had to play except Donkey Kong Jet Race. It was convoluted, impossible to control and inflated beyond all sane proportions by one of the most nonsensical stories in game history (even by mid-noughties Sonic spin-off standards), narrated by voice actors with the cadence of malfunctioning robots.The only way to make it worse would have been to add dodgy motion control - and lo, that is exactly what SEGA did with Sonic Riders: Zero Gravity on the Wii. It was, as anyone could have predicted, even more awful. ~A complete waste of time, effort and the planet's resources,~ said Ellie. ~Please stop it.~Unfortunately, here it is, back yet again. Why SEGA has chosen this particular racing game to resurrect for Kinect is a question for the ages. Perhaps Sonic Team thinks that taking the controller away entirely will solve the series' congenital control problems.Let's be honest: it's not looking hopeful. Racing games are supposed to be fast and precise, but Kinect has a bit of lag and prefers to use broad gestures rather than small movements. Sonic and friends (and far-fetched, barely recognisable acquaintances) are still stuck to those questionable hoverboards. But let's try to put the past behind us. Joined by fellow Friend of Eurogamer Jon Blyth, I stand in front of Sonic Free Riders with my negative preconceptions tucked away in a black box at the back of my mind.It takes fully five minutes to get off the menu screen. Riders, like Kinect Sports and Adventures, requires you to select things on the menu by moving your hand back and forth across the screen to scroll through options, then holding your hand up in front of an icon to select it. We're supposed to drag our desired character icon to the 'Start' icon at the bottom of the screen.  Sweeping back and forth doesn't work. At all. After a few seconds of trying, we decide to go with the default course and characters to save ourselves the hassle. But then, when we try to drag them to the Start icon, the camera keeps losing our hands and the icon snaps back to its starting position. Occasionally the character wheel spins of its own accord, presumably reacting to some inadvertent gesture. It's not going well.Eventually - eventually - we manage to select characters and boards, moving our hands very, very slowly to help the game understand what we're doing. Once we finally conquer the menu screen a short tutorial pops up to tell us how to steer the imaginary jetboard we're standing on. Stand straight on towards the screen, leaning left and right to steer? Stand side-on and bend the knees, like you would on a skateboard, snowboard or Wii balance board? Oh no - it wants to us stand sideways on and bend forward and backwards at the waist.Not just a little bit, either, but really flinging your head and torso towards the floor in either direction. Jon immediately throws himself forwards and veers wildly away to the right; I try a more reserved interpretation and fail to turn at all. Neither of us touches any of the guide cones that we'resupposed to slalom through. It's still not going well."}