{"ref": "https://www.eurogamer.net/battlefield-bad-company-2-vietnam-hands-on", "date": "17 Sep 2010", "game_name": "Battlefield: Bad Company 2 Vietnam", "text": "Of all the immoral, bloody and pointless conflicts the world has seen, the Vietnam War at least had the best soundtrack. That's what all the movies suggest, anyway. And it's a theme DICE appears to be continuing with Battlefield: Bad Company 2 - Vietnam. As the trailer released to announce the add-on illustrated, songs from bands like Creedence Clearwater Revival have been licensed for use in the game. There's a wide selection of tracks from the sixties and seventies, and you can listen to them while hooning around in tanks and flying helicopters.Huey helicopters, to be specific. As you'd expect, DICE is working hard to ensure everything in the Vietnam expansion is historically authentic. The Huey is an easy chopper to manoeuvre and packs a healthy amount of firepower, what with its two gatling guns. Throw in that option to listen to a funky soundtrack while you shoot and it's a pleasure to fly. Naturally, there are new weapons from the period to play with too. Such as the AK-47, complete with clickable reload sound. The one we get to try out during our playable demo appears rusty and is held together by dirty bits of bandage - which, a bloke from DICE tells us, was a typical state of affairs at the time. There's a new grenade launcher, modelled on those used in your actual Vietnam War. The rocket launcher is based on the one used in the sixties and seventies by the North Vietnamese army. Ammo packs are back but now they're in the form of rusty tin boxes. This time around the engineer gets a PPSH assault weapon and a blowtorch for repairing vehicles. The medic has a heavy machine gun, again based on those used during your actual Vietnam War. Tin box medpacks have been replaced by rucksacks. And instead of defibrillators, medics now use syringes to revive fallen comrades. There's good news for fans of the sniper class (which is ~the most interesting class~, according to the DICE bloke). The sniper rifle is no longer bolt-action but is now fully automatic, meaning you don't have to reload all the time. However, it has a much heavier recoil. Perhaps the best new toy on show is dynamite - ~Real dynamite,~ as Mr DICE puts it. Forget C4, now it's all about sticking scarlet sticks of boomboom wherever you please, then pressing the plunger to cause huge explosions. On top of all that there are new vehicles to try out, too. The Vietnamese get a new type of jeep, while the Americans have historically authentic tanks. These have glass-fronted booths so you can survey the battlefield while shooting it to bits. What you'll see, if you're playing the Phu Bai map on show today, is an awful lot of paddy fields. During the pre-mission briefing, you're informed that these fields are supplying the North Vietnamese army with all its food - so it's imperative the US army takes them out.  They're surrounded by majestic mountains, palm trees and wooden huts, just like in the movies. And in actual Vietnam. Once again, DICE has created maps which are playgrounds for Battlefield players, packed with places to take cover and stuff to blow up. The environments look realistic, authentic and detailed, and should be exciting places to explore - especially with those new weapons in tow. True, BC2 - Vietnam doesn't appear to be introducing any fundamental changes to the multiplayer gameplay or adjustments to the interface. But this is an expansion, not a sequel. Besides, there's the downloadable Onslaught add-on if that's what you're after. And in any case, there wasn't much with the original Battlefield: Bad Company 2 which needed fixing - hence it scored 9/10 in our review.In other words, Battlefield fans might as well sit back, relax and wait for what looks like being another top quality offering from DICE. And perhaps listen to some Creedence Clearwater Revival to get them in the mood.Battlefield: Bad Company 2 - Vietnam is out this winter for PC, PS3 and Xbox 360."}