{"ref": "https://www.eurogamer.net/metroid-other-m-review", "date": "9 Sep 2010", "game_name": "Metroid: Other M", "text": "For the first 20 minutes, Metroid: Other M does a decent job of confirming your worst suspicions about just what Team Ninja might do to if it ever got its hands on Samus Aran. With the start screen out of the way, the game immediately descends into a pretty – and pretty vapid – fug of cinematics, back-story and bizarrely delivered dialogue, while the roving cut-scene director never misses an opportunity to perv over the famous bounty hunter's jumpsuited body. By the time training is completed and a rather mopey Samus dons her armour and answers a distress call that takes her to an abandoned space ship, the more melodramatically inclined could be forgiven for deciding that the series' new caretakers have set out to systematically dismantle everything that ever made Metroid wonderful in the first place. For a few minutes more, the disappointments continue to pile up. Oh dear, the space station isn't abandoned at all, but is instead filled with a squad of jerky NPC soldiers. Oh dear, one of the jerky NPC soldiers is Samus' old boyfriend. (Boyfriend? Seriously? Did they watch Kirsten Dunst movies together? Did their lips ever meet over a single strand of spaghetti?) Oh dear, another one of them looks like David Beckham. All that's left is for the team behind all those Beach Volleyball games to wedge the camera right inside Samus' unmentionables, and we can all go home and smother ourselves with our fan-made Ridley pillows.Don't panic. For starters, Samus keeps her clothes on most of the time after that, and she saves her dull observations on all things cosmic for the cut-scenes, the traditional spot for putting the kettle on and fussing over the cat. More importantly, that squad is hardly a constant presence in the game that follows. Rather, they're an occasional intrusion as Team Ninja's pacy sci-fi mystery plot starts to unfold.In Other M, as it should be, lonely wandering is still the order of the day, and the game is actually almost everything Metroid fans have been saying they've been after: a genuine sequel to Super Metroid, with an intelligent third-person camera and plenty of time to revel in the good old gadgets.Tending to favour a side-on perspective, Samus Aran's exploration of various spooky spaceship corridors and holographic outdoor environments is entirely evocative of the series' early 2D days - and yet, the game is hardly a throwback. Team Ninja hasn't run aground with Metroid; in fact, it's hit an enviable sweet spot with a game that acknowledges the franchise's history while finding room to employ some of the smarter tricks that Retro Studios dreamt up in the Metroid Prime series.Environmentally, Other M doesn't deviate too far from the standard template. If you're expecting ice and lava, jungles and derelict warehouses, Other M won't disappoint, crowbarring some pretty large outdoor vistas into the shape-shifting interiors of its space station. While the wallpaper grows a bit predictable, however, the game's greatest strength lies in the creatures you fight as you explore.Team Ninja truly understands the warped Galapagos appeal of the Metroid menagerie and offers up some really inventive monsters, ranging from leathery bipedal armadillos who can match Samus for gymnastic ability to evil, razor-teethed Pokemon, and a kind of driftwood Diplodocus who appears to have had a radioactive grapefruit driven into his gut. (I'd shoot that bit if I were you.) Everything's drawn beautifully, too, from the hard-candy glossiness of the metallic enemies to the gooey, stringy excesses of the organic bits – just the kind of thing the Wii generally struggles with."}