{"ref": "https://www.eurogamer.net/dragon-age-origins-dlc-roundup-review", "date": "9 Sep 2010", "game_name": "Dragon Age: Origins", "text": "It's unfortunate that Witch Hunt, the latest in BioWare's long but less than illustrious DLC campaign for the original Dragon Age, arrives at the same time as Mass Effect 2's wonderful Lair of the Shadow Broker.Witch Hunt is above average when placed alongside painfully thin predecessors like Return to Ostagar and Darkspawn Chronicles, but when compared to the masterful way that Liara has been folded back into the Mass Effect story, it ultimately serves only to highlight the unfortunate difference in approach that BioWare has taken with DLC for its two blockbusting RPGs.For one thing, Dragon Age is now actively penalising players for having multiple playthroughs – a staggeringly horrible decision for an RPG. If you've got characters saved for every origin story, plus one for each downloadable chapter, then the game will have started prompting you to delete a character before you can play any new DLC. To clarify – it's not just asking you to clear out some old save files, but to erase every trace of an entire character.Adding insult to injury, you need to do this even if you plan on playing the DLC with an imported character. So even if you're planning on using an existing character rather than starting another new one, you'll still need to pick one of your current characters to sacrifice. You could, theoretically, work around it by putting your characters on a USB stick, like some digital Noah's Ark, and keep them that way, but why should we have to? It's a terrible idea for a game built around the idea of creating multiple variations of character and class, and along with the way each new downloadable chapter is selected from the menu rather than incorporated into the existing game world, it suggests Dragon Age was poorly designed from the start where DLC is concerned.That annoyance out of the way, the Witch Hunt tale kicks off with you and your Mabari war hound arriving at Flemeth's hut on the trail of Morrigan. There you meet a Dalish elf called Ariane, who is also seeking the pagan floozy. She believes Morrigan has stolen an ancient book from her tribe, and naturally they want it back.From there it's off to the Mage's Circle to discover what the book was, and why Morrigan might want it. BioWare deserves some perverse praise, at least, for opting to open an action-RPG chapter by making you look things up in a library. There you learn that Morrigan appears to be interested in the Eluvian mirror from one of the Dalish quests in the main game, an interesting connection but one that soon feels more like an excuse to reuse existing assets than any attempt to sketch a larger story.Meeting up with Finn, another in Dragon Age's apparently inexhaustible supply of mewling ineffectual males who look exactly like Alistair, you venture into the cellars of the Mage Circle just as you did at the start of the full game. This time you're repairing tears in the Veil rather than clearing out low-level rat enemies, but déjà vu proves impossible to avoid."}