{"ref": "https://www.eurogamer.net/and-yet-it-moves-review", "date": "2 Sep 2010", "game_name": "And Yet It Moves", "text": "There are moments during And Yet It Moves that snap you right back to the very first time you started playing videogames. When everything felt fresh, surprising and unfettered by expectation, and you figured things out not through learned responses and experience but pure, wide-eyed intuition.There's no dumb back-story to wade through. No feeble attempt at scene-setting exposition. Just you, trying to gently coax a badly drawn boy through a ripped-up two-dimensional world to an elusive exit. With the press of a button, you can pause the action and literally tilt the entire environment through 360 degrees - and everything in between.As the world flips around at your command and gravity shifts your character's orientation, what were once walls and ceilings become viable platforms for you to traverse. A once-impossible maze suddenly becomes a physics playground to careen and slide your hapless traveller around.But death is everywhere. Tilt the cardboard playground too violently - or at an unfavourable angle - and your fragile passenger risks being shattered by the crippling velocity of the fall. Even in abstract worlds such as these, the well-worn rules of platforming apply.Gradually, mere plodding exploration becomes something of a gentle luxury, as the game throws up ever more complex and bizarre obstacles between checkpoints. Angry gorillas bar your progress, demanding a hearty banana main course before they'll shuffle off. Sometimes it's just a case of applying dumb brute force, shepherding rocks (or, sometimes, bats) and using gravity to smash through blockages, or creating a chain reaction of fire to clear a hornet's nest.Just when you feel like you're getting a handle on the game's eccentric demands, developer Broken Rules resorts to the freakish and sinister, accompanying increasingly acid-fried psychedelia with throbbing, spongy soundscapes that seem specifically designed to peer into one's dark recesses.For maximum disorientation, you'll find yourself oscillating gently on pulsing columns of sound, rotating through insubstantial environments where platforms vanish no sooner than they've appeared. Where inky voids threaten to suck you into the abyss. Where inverse dopplegangers demand that you simultaneously guide them to the door that you just emerged from. If it feels like you're losing grip on reality, don't worry - you are.Before long it's not merely the world that you're able to twist and rotate, but entire platforms. What was once reliably nailed down coils and uncoils with predictably unpredictable effect. It's one thing sliding down momentarily onto something that periodically disappears, but another thing entirely when the mere act of rotation distorts the very item you're hoping will break your fall.From there it only gets stranger. Criss-crossing, shape-shifting items of organic garishness provide a seemingly impossible cage to negotiate. Somehow you squeeze gracefully through the narrowest of gaps, only to find yourself crushed and exasperated at your own lack of care."}