{"ref": "https://www.eurogamer.net/dead-rising-2-case-zero-review", "date": "1 Sep 2010", "game_name": "Dead Rising 2: Case Zero", "text": "After half an hour of knocking the undead around with a trashcan, I suddenly realised that ~zombie~ would be a pretty good word to play in Scrabble. It's not a game-changer necessarily, but lay that across a triple score tile, preferably landing the Z on some kind of letter multiplier, and you've got yourself a handy boost if you're getting behind. This is the sort of thing that tends to happen whenever you play Dead Rising. You get into the zone, you start busting heads, and pretty soon you find yourself thinking about stuff like Scrabble.Dead Rising 2: Case Zero is a bizarre idea: a slick chunk of pre-release DLC, a playable prologue for a game that hardly seems likely to thrive on story. If you're in a grumpy mood, you could be forgiven for writing this off as an expensive demo. If you're feeling a little more charitable, however, you'll notice the finer points - the chummy cluster of Achievements, the fact that you can grind your character up to level five and then import that status into the full game when it arrives - and it becomes something a little more benign. Let's call it a cheap piece of fan-service that players are more than welcome to ignore.Set two years before the events of Dead Rising 2, Case Zero gives you a little bit of insight into the early days of the series' new protagonist Chuck Greene, and tells you what he gets up to before he reaches Fortune City and starts shoeing zombies on a daily basis. Chuck - who looks like a direct-to-video Paul Newman - and his infected daughter Katey have wound up in Still Creek, a limp sprawl of motels and gas stations strung across a dusty patch of sun-scorched earth just outside of Las Vegas.The astonishingly long and uninteresting opening cut-scene shows the big man getting his truck pinched, and sets up the basic predicament: the town's filled with shambling undeads, the military is set to arrive before the day is out, and unless Chuck can get his daughter some Zombrex - an anti-zombifying medicine which I believe contains Bifidus Acti-regularis - she's going to start drooling and biting off chicken heads. Also, if Chuck could gather together five parts of a motorbike (this kind of thing thrills old people like me, as it brings back memories of the original ToeJam & Earl), he might be able to get out of Still Creek before anything tragic happens.What this breaks down into is an introduction to the central mechanics of the sequel. Most of them - scavenging for weapons, trying on ridiculous clothes, smacking people over the head - will be pretty familiar to veterans of Willamette Mall, as they're also the central mechanics of the original game. A handful of them are new, however.Zombrex: that's new for starters, and in Case Zero it amounts to yet another clock to watch in a game that's already piling on the time pressure. Finding medicine for Katey, accidentally giving it away to a stranger during a side-mission, and then looking around for even more doesn't really make much sense in a micro-game that already has a fairly tight deadline in place. That said, it allows the developers to incorporate a series of different endings, and ensures that there's an extra sense of panic as the minutes tick down to the arrival of the military (who will take Katey away if they find her). It will be interesting to see how it plays out in the more expansive plotline of the main game."}