{"ref": "https://www.eurogamer.net/download-games-roundup-review-37", "date": "20 Aug 2010", "game_name": "Reviews", "text": "It would be really nice if we could reliably pick an interesting game from each download platform every week, but sometimes you just have to get what you're given.This week is a pretty good example, with nothing worthy of full investigation on most of the major download avenues. Maybe it's just part of the traditional summer lull, with some key games being held back. Or maybe it's just how the chips landed. Whatever the reason, we had a steaming pile to waft away from your delicate senses, resulting in this rather Apple-skewed selection.Part of it, though, was simply down to timing, with lovely little offerings like The Incident and Monster Dash being far too good to ignore. And when someone recommended that we check out Leave Home on the Xbox Indie channel, there was no way we'd pass up on the chance to recommend one of the most creative and interesting games on the entire service.The cool kids probably realise that this came out ages ago, but hey, sometimes being behind the curve can be hip too. Just ask Huey Lewis.The great man also observed that the power of love is a curious thing, and he'd doubtlessly also predict that Leave Home could make one man weep, and another man sing. That, you see, is because it's a twitch shooter, involving no small amount of improbable hand-eye co-ordination.But unlike all the other downright mean-spirited shooters that gifted types tend to get all frothy about, Leave Home understands that we can't all play by sense of smell. It cunningly caters for cack-handed sausage-fingered idiots who couldn't hit a cow's arse with a banjo.Playable for five minutes, Leave Home works on the basis of anger, and the assumption that the more you kill, the more psyched and angry you get, and turns up the heat accordingly. If you die, you carry on, but the game dials things down again, building up momentum the longer you stay alive, and the more you shoot. It also has a tendency to flit between short chunks of gameplay, wrenching you out of one section and dumping you into another, seemingly without warning. Play it again, and different outcomes emerge, encouraging replay and inspiring great intrigue. With its disturbingly frazzled intro and mangled retro aesthetic, this is a glorious trip into one man's fractured imagination. Any game that can legitimately boast metaphorical explosions should leave Minter spraying lentils over his keyboard with jealousy. 8/10"}