{"ref": "https://www.eurogamer.net/bloodline-champions-hands-on", "date": "10 Aug 2010", "game_name": "Bloodline Champions", "text": "It's the closing seconds of the match point when you get your chance. The other team are dominating the field. Your team? Underdogs, held together by a star player. Who isn't you. You? You're nobody. And now it's your time to step up to the plate. All eyes on you, kid. Packed tight with tension, you take aim and take the shot.Your Healing Word goes whistling across the field and bursts on your side's Ranid Assassin the moment before the Fireball hits him, healing him for 14 damage as he receives 17 damage and keeping him alive. The crowd, the one in your head, goes wild. The crowd in your head wants to buy you things and have your babies. In a final, suicidal play, the Ranid Assassin takes his cue and goes skidding into the enemies' line with a Venom Dash, with you flinging more Healing Words in his wake. You'll win this game yet.Online action title Bloodline Champions doesn't just feel like an eSport, a label which only really means that a game's been developed with a slightly crazed eye for balance and smoothness of play. No, Bloodlines Champions feels like a sport. Every round tells its own little story, every round is an opportunity for glory and every round breeds enmity and bonds between players. And, you know - it's also been developed with a slightly crazed eye for balance and smoothness of play.~It's important for us to mention that we are not developing Bloodline Champions as a pure eSports game,~ says Tau Petersson, CEO of Swedish developer Stunlock Studios. ~It's meant to be suitable - even great - for eSports, but it's just as important for us to make the game accessible to the average gamer - perhaps even the casual gamer - who have little interest in organised competitive gaming. It's meant to be action-driven fun for everyone.~The action itself is a hybrid of Defense of the Ancients and World of Warcraft's Arena battles. From the former, Bloodline Champions takes the top-down perspective and wide range of slick hero characters to choose from (here called 'Bloodlines'), and from the latter it takes the idea of cooldown-centric powers and no-frills battles.A match starts, two teams (called Warm and Cold) go surging up to meet one another, and after about a minute of frenzied action one team will have micromanaged their way to being the last bastards standing, often through rapid teamwork involving the MMO stalwarts: tank, healer, damage dealer.But playing the latest beta build, it's clear you won't get far judging Bloodline Champions on its influences. This game is very much its own beast. The way the characters move, the fact that each Bloodline is given abilities centring around defending and countering, the presence of cooldown times instead of mana, the small size of the arenas: all of it exists to magnify the quality and the variety of the duelling in the game.All of Defense of the Ancients' slower-paced moments have been stripped out, producing a chopped, lightweight game of striking, blocking, trapping and fleeing, a game which isn't about where or who you fight, but how you do it. Lots of attacks have delays or firing arcs that make them difficult to land, and even healing powers need to be aimed like projectiles."}