{"ref": "https://www.eurogamer.net/ancestors-the-humankind-odyssey-review-broken-bones", "date": "28 Aug 2019", "game_name": "Ancestors: The Humankind Odyssey", "text": "I was on the bus the other day when I realised that Ancestors was probably starting to get to me. I found myself thinking about haircuts. About hairstyles. Looking at all the different ways of dealing with hair that were evident around me. Why do we do this? I wondered. The fringe, the pony, the pompadour. Why do we do this with our fur?Fur? Every now and then, just to freak myself out, I try to remember that I'm a great ape. I haven't evolved from an ape, I don't share a common ancestor with an ape, I am one. My hands are ape hands. My feet are ape feet. Making a sandwich, using a stapler, worrying about the season finale for Million Dollar Listing: NYC? All of these are ape behaviours. And now here's Ancestors to remind me afresh.Ancestors - its full name is Ancestors: The Humankind Odyssey, just in case you weren't already thinking about the first act of 2001 quite enough - is an attempt, I think, to make a game of something like Yuval Harari's book Sapiens. How did modern humans get going? Let's see! Meet a group of hominids, living their lives millions of years ago. They're out there deep in the wilds somewhere. Can you lead them on a journey across hundreds of generations and put them on the path towards becoming something like us? Can you take them from fur to the side-parting, to the meet-me-at-McDonalds?This is a pretty ambitious agenda for a game, and it makes for some wonderfully bewildering opening moments. First off, I'm a little hominid baby, lost in the jungle, scary faces emerging from the smoky surroundings, overwhelming sounds and sensations and movement as I try to find a place to hide. This smoke is the primordial imagination, and it's all about the fear of being eaten. Then, seconds later, I'm a mature hominid, setting out to find the baby. I can use sight and sound and smell to select points of interest around me, and I can memorise one of these points of interest at a time to highlight it on my HUD and allow me to investigate further. I need to eat, drink, and sleep enough to stay healthy. I need to learn how to tackle snakes and boars and big cats and other wild animals. I need to learn what the different kinds of plants around me do, and what stones are, what water is. I need to learn about gravity, too: I need to stop falling out of trees every five minutes and breaking a bone. I really need to stop breaking bones, actually, because it slows me down. And I need to find that sodding baby.This was my first day of Ancestors - my first real-world day; it took me forever. I would leave the settlement, go and look for the baby, get lost, fall out of a tree, break a bone, eat the wrong thing, get poisoned, lose all my energy, forget what I was looking for, fall out of another tree, break another bone, onwards and onwards. I would start over again and again. It was a bit like I was borrowing cars from a showroom and returning them dented and with broken windscreens, with missing wheels, with smoke curling up from under the hood. Except the cars were hominids, and cars themselves were a distant dream, millions of years distant, and I was not getting my species any closer to them with my current behaviour. Sometimes I wouldn't break a bone but I would get bitten by a snake. Sometimes I would find the baby and then realise I had lost my settlement. If evolution is a lottery, this was one of those lotteries you can only enter by buying a ticket from someone stood outside a second-hand furniture showroom, wearing an ID tag that looks like it's been hastily photocopied and filled in with crayon. Slowly, though, the game came into focus. While none of Ancestors is what I'd call fun, some of it is sort of wonderful: it's surprisingly good at making the world around you seem disorienting and frightening. Venture too far and it all gets dark and misty: your inchoate thoughts are telling you that you've moved beyond the zone of safety. Then there's traversal: it's great to scale trees and leap from branch to branch. You get to understand how powerful a hominid must have felt up high, compared to how vulnerable they would have felt on the ground. If I was a television historian I would say, ~These trees would have been like motorways to the ancient hominids!~ But that probably only illustrates why we should all be pretty suspicious of television historians.On the less cheery side of things there's the UI: a load of ugly stuff on the screen that doesn't really make much sense for quite a while. There's the blocky way that your senses reveal points of interest. And often there's a fourth-wall breaking load of scientific blather that really does the game no favours whatsoever. Alongside the hominids and the not-knowing-what-water-is business, there's simultaneously imagery of axons and dendrites, the outputs and inputs of nerve cells, and talk of neuronal energy and dopamine levels. Listen: don't talk about dopamine like I should know what it means! It functions as a freaking neurotransmitter, mate. I have met actual neurologists who spend their time quietly hoping nobody asks them a tricky question about dopamine. Feel free to talk about this stuff at dinner parties or when you're trying on a new turtle-neck jumper, but it probably doesn't belong as screen dressing in your third-person action game about plucky apes.Okay, so in Ancestors most of this neuronal stuff actually adds up to a skill tree as you unlock new behaviours and preserve them for future generations. But still: pick your battles, developers. You've already got me playing a hominid lost in the ancient jungle. Maybe knock the coating of brain chemistry on the head for a bit.Progress here is in fits and starts. After I got the baby back to safety, I took things pretty slow for a while. I didn't want to lose my way or break another bone. So I started investigating the world that was very near me, highlighting points of interest with intelligence - I'm not bragging, that's what the system is called in the game - and then learning what everything did. Pick up a leaf and inspect it. Mmmm, I could probably eat this. I could probably eat those berries. Maybe I could hit someone with one of those branches. Maybe this could be medicine. Ooh, basalt! Basalt's always money in the bank!It's all a bit compacted - you can see why Kubrick decided to have a monolith turn up and point people in the right direction - but I appreciate what Ancestors is trying to do. I'm willing to look past the UI, the bland art and models, the clunkiness of the transposition of hundreds of thousands of years of evolution into a muddly apey sandbox. I actually really like the lurches in space and time that power Ancestors. In terms of space, you learn new behaviours that allow you to venture further afield. You learn to communicate, to fight, to call the group together when needed. You learn to mate to give your group a better chance at survival, even if this fearless game of dopamine-referencing is endearingly coy about ape sex most of the time, the camera tilting up to the sky for a few seconds as if a bunch of nuns might be watching on Twitch. Thankful as I am to skip this stuff, it is all a bit weird, really, as a trip to Monkey World will reveal that a lot of apes aren't coy about ape sex in the slightest. (Also: pretty blase about chucking their own faeces around.)In terms of lurches in time, your hands are on the controls. When leaping forward a generation, you have to reinforce any skills that you don't want to be lost to the ages, a sort of topiary of the gene pool which is quite playful, even if making you consciously choose what to retain sort of misrepresents the way this stuff works, casting the player, as it were, as 2001's monolith. Then you can also leap forward through evolution,  which sees you bouncing across decades and centuries and whatnot based on how many Evolution Feats, which tend to be big in-game events, you've achieved. This is where the heart of progression lies, as your progress is matched against the pace of historical evolution. (Can you stay ahead of the real world? Reader: I could not. Probably too many broken bones.) It's also where Ancestors stumbles in its central conceit, and how couldn't it? Ancestors takes you back to the distant past but seems to know what's coming. The whole thrill of evolution, according to my limited understanding anyway, is that it doesn't need to know what's coming.I am scratching the surface of this game, but I feel sometimes that I could play Ancestors for a hundred years and still be scratching the surface. Regardless, there's something appealing but clumsy at the heart of my experience which seems to speak to what Ancestors is trying to do. This is history, sort of, and a video game, sort of, which means that, ultimately, as much as you're learning about evolution and hominids and Darwin, you're also learning about how this decidedly odd game functions - and the interaction of these two things can get blurry.One of the points Harari makes early on in Sapiens regards how a cooked diet may have shortened our intestines, and how our new shorter intestines allowed our brains to get bigger, but also bound us to a certain kind of cooked diet, and then from there you get settlements and farming and cities and culture and streaming services and the idea, at the end of it, that the planet is a giant resource waiting for us to mine. And now we're all doomed and we're all complicit! (I may have extended this point a little past where Harari leaves it.) It's fascinating stuff, giddy and queasy and utterly unsettling. And it's just the sort of point you can make in a book, but which you have to cludge a bit to fit into a game. In Sapiens, evolution is paved with consequences. In Ancestors it seems to be studded with goals.Oh lord, I am seriously out of my depth here. The problem as I see it is that the contractions and metaphors and short-cuts needed to make Ancestors into a game leave me wondering whether it actually has much to add to anyone's understanding of evolution in the first place. But does this matter? All the science blather on the screen suggests that Ancestors wants to be taken seriously as a sort of playable documentary, but what I got out of it over time was quite different. Science aside, this made me think about how terrifying those early days must have been for those plucky hominids, the jungle crowded all around, survival seeming very unlikely indeed. Ancestors isn't really about the neurons and the connections that got us here, then. I'd argue that at its clearest it's about the empathy that is possible because of where all those neurons and connections are today. This weird, difficult, silly game is, deep down, actually sort of memorable."}