{"ref": "https://www.eurogamer.net/download-games-roundup-16th-july-2010", "date": "16 Jul 2010", "game_name": "Reviews", "text": "Damn it, people. Will you stop releasing so many good downloadable games so I can revert to being miserable about the state of gaming? Every week I think we're due a fallow period, up pop another clutch of outstanding titles that embarrass most of the games lining up on high street shelves.With games as good as Helsing's Fire, Osmos and Lumi appearing out of nowhere, it's no wonder people are spending less on boxed products. Recent figures from Chart-Track and NPD might look depressing on the surface, but perhaps we're simply spending our money on better-value games available for download?With so much quality available for so little, why on earth would anyone buy one average game when they can have as many as ten more interesting, more creative games elsewhere? The hard part, obviously, is knowing where to look, which is where this roundup comes in...Welcome to the iPad's new poster child.In Osmos, you are a thing. A 'mote', floating listlessly in the ether, disconnected from desire. You're able to consume the smaller motes around it, or to be consumed by the larger ones; the soothing ambient sounds belie your permanently fraught existence.To propel yourself, you must expel matter by tapping behind the mote. Eject too much and you risk becoming smaller than the mote you wish to consume, but take too long to reach your destination and you risk missing the object of your affection altogether. It's a deliciously delicate balancing act.Osmos is all about momentum. If you don't get off to a good start, often the bigger motes that surround you will continue their inexorable journey to becoming huge, and make it impossible to consume them. But in the haste to get going, you often leave yourself in an area of the environment devoid of tasty morsels, or perhaps disappear off the edge altogether. Originally released on the PC and Mac last year (you might recall Jim getting in a froth about it), its transition to iPad is extraordinary. Positively tailor-made for tactile, multi-touch play, you can pan, pinch and zoom with ease, and deftly guide your mote with pixel precision.At the very least you'll gaze into its gloopy beauty and sink into the chilled tranquility of arguably the finest ambient soundtrack ever committed to a videogame. Quite unlike anything you've played, Osmos is the kind of game even Brian Eno would admire.9/10Professor Helsing is the thinking man's vampire killer. He doesn't need sharpened stakes, silver bullets and crucifixes. This refined fellow can take out the undead with the power of light, a carefully brewed tonic or two, a carefully teased moustache, an arched eyebrow and a deft quip. What a gent.Set across 90 levels, Clickgamer's cheaper-than-chips puzzle game cannot fail to charm the leather thongs off the most jaded handheld gamer. Viewed from above, the action places you in a room full of grisly monsters, and it's your job to bathe all of them in light and throw tonic at them. By placing your blazing torch with your finger, you can often angle it so that most (if not all) of them are lit up at the same time. Once you're ready, you hit the tonic bottle at the bottom of the screen, sit back and enjoy watching Helsing high five and fist bump his faithful assistant, Raffon. As you work your way through the various dungeons, new challenges crop up to make matters more challenging, such as colour-coded monsters resistant to certain tonics, or armoured foes, or maidens whom you mustn't expose to light. Eventually you'll fight the level's boss and duck into the shadows to avoid their all-pervading attacks.With its insidious wit and gothic charm, Helsing's Fire is a joyously original instant classic that iPhone owners should buy immediately. 9/10"}