{"ref": "https://www.eurogamer.net/ion-fury-review-a-brilliant-blast-of-nostalgia-and-a-decent-first-person-shooter-too", "date": "23 Aug 2019", "game_name": "Ion Fury", "text": "Ion Fury isn't so much a blast from the past as a gunshot straight through it, carving its way along time's back-alley and punching a hole in history's skull. Coming at you from the business end of 1996, Ion Fury is a brand new 2.5d shooter published by 3D Realms (the publishers of Duke Nukem 3D) and created in the Build Engine (the engine used to design Duke Nukem 3D). Let's stop for a moment and take that in. For a fan of classic shooters, this is like finding out John Romero has created a fifth episode to the original Doom. Oh wait, that happened as well. Somebody pinch me, I must be asleep.In truth, I've been living in FPS dream-world for the best part of a year. The last nine months have seen the birth of two knockout retro shooters - the magnificent Dusk and the scintillating Amid Evil. Ion Fury, however, is the first one to come at me toting not just a shotgun but pedigree as well. Ion Fury is here to remind us what it was like to kick ass and not chew bubblegum, in the days before Duke fell forever into decline.Ion Fury's premise is typically slight. Players assume the role of Shelly ~Bombshell~ Harrison, a bomb-disposal expert on a one-woman quest to rid Neo D.C of the evil Dr Heskel and his cybernetic army. This isn't Shelly's first rodeo as a video game protagonist - Ion Fury is technically a prequel to the mediocre top-down shooter Bombshell. You don't really need to know about it. I'm just getting ahead of the comments.Anyway, this is all the story Ion Fury needs to knock together 8-10 hours of relentless, bloody, synth-buzzing action. What makes Ion Fury so fascinating, however is its unique blend of technology and aesthetic. Or should that be technology as aesthetic? See, Ion Fury isn't just a shooter created in the Build Engine, it's an ode to that tiny transitional slice of gaming history when shooters were neither 3D nor 2D.The developer, Voidpoint Interactive, is assembled from veteran Build Engine modders, whose designers and artists have used every trick in the book to produce one of the best and most distinctive-looking games this year. Far from being a dark and dingy assemblage of corridors, Neo D.C. is a smoky, neon-drenched cityscape bursting with colour and detail. Its towering skyscrapers are fronted by glittering animated billboards while needle-like searchlights pierce the cloudy sky beyond. Up close, you can see the painstaking pixel-work in every enemy, weapon, and environment texture. I'm especially fond of Ion Fury's use of colour as lighting, splashing of purple and orange textures across the ground that ~illuminate~ enemies who step onto them.It's a fantastic use of decades-old tech, taking what was in 1996 a necessity and elevating it into a style. But Ion Fury is far more than an artistic curiosity - it's a formidable FPS in its own right. Across the game's length you'll pick up a total of nine weapons, ranging from your trusty 'Loverboy' revolver to the ferociously powerful chaingun. My personal favourite is the Disperser. Its default mode fires a compacted cluster of shotgun pellets that makes a noise like the devil slamming a door in Hell. Later on, those shotgun shells can be switched out for bouncing grenades that turn any nearby adversary into a scarlet puddle.Crucially, all weapons remain useful throughout the game's length, and in fact evolve in their usefulness as you encounter new types of enemies. All opponents in Ion Fury are products of Dr. Heskel's brilliant, evil mind, from the standard grunts who conceal their robotic forms beneath a tan shroud, to the horrific scuttling headspiders which leap from the ground to bite at your face. As you progress deeper into the game, you'll do battle with giant, rocket-spitting mechs and skinless superhumans who have a nasty tendency to turn invisible and then reappear right in front of you.All of this comes together to form a ferociously capable first-person shooters. The pace is breakneck, the level design complex, and the soundtrack an electrifying neo-noir pulse. But if you can bring yourself to stand still for a moment, you'll notice that Ion Fury is also a surprisingly literate shooter, crammed with references to action films and other first-person shooters. Its fizzing neon world is influenced by films ranging from The Terminator to Judge Dredd. Game-wise, there's a strong emphasis on interactive environments, a big focus of Duke 3D. There's even a pleasing nod to Quake in the form of flesh-throwing zombies that like to ambush you from waist-deep water.Unfortunately, while Ion Fury is clearly knowledgeable about FPS history, it doesn't deploy this knowledge in any meaningful fashion. This is most evident in the character of Shelly herself. Like Duke, she's mainly a grab-bag of quotes from action films like the Matrix and Die-Hard, alongside the occasional witless insult. Not only do these quips become tiresome way before the finish line, I also feel like it's a missed opportunity. With the exception of No One Lives Forever's Cate Archer, good female shooter protagonists are few and far between. There was a chance here to do more than simply read history back to us, but also to reflect on it, and perhaps even write-in what was missed the first time around. Sadly, Voidpoint settle for ~Duke but female~, which is fine, but not that interesting.This issue is also present at the game's broader scale. Ion Fury is a superb embodiment of first-person shooter convention, but unlike Dusk and Amid Evil, it rarely attempts to challenge or evolve upon those conventions. If anything, Ion Fury becomes less ambitious as it goes along, starting out in that remarkably designed cityscape before descending into a more typical tour of first-person shooter locations. There's your train level, your sewer level, your secret lab level. They're all well designed - I particularly enjoyed the creepy mansion level that pays its dues to Monolith's Blood - but they nonetheless feel like places I have explored before. Ion Fury may not elevate the first-person shooter to new heights, but in its defence that was never the goal. It just so happens to have launched at a time when other nostalgic first-person shooters have also pushed the genre forward in ways we couldn't have anticipated. Regardless, Voidpoint's own work remains a thoroughly entertaining first-person shooter, and the way it pulls the Build Engine up by its bootstraps makes it worth the price of entry alone."}