{"ref": "https://www.eurogamer.net/tiger-woods-pga-tour-11-review", "date": "1 Jul 2010", "game_name": "Tiger Woods PGA Tour 11", "text": "Here's a curious nugget of Hollywood lore: when someone is called in to polish up an existing script, they only get an on-screen credit if they replace at least half of what is already on the page. The result? Lots of writers making sweeping changes to scripts that may only need a small tweak, and lots of expensive blockbusters that don't make a lick of sense.Each year, it seems that the team responsible for the Tiger Woods series is placed in a similar situation. The laws of marketing demand that an annual product needs nice, clear bullet-point improvements to bolster the press releases, sex up the back of the packaging and generally convince the world that, no, honestly, this is videogame golf as you've never seen it before.Even though the series arguably hit its creative peak in 2008, with the introduction of GamerNet, PhotoGameFace and simultaneous online play, those poor developers still have to shuffle the old pieces around, chopping and changing and mixing things up so it looks different enough to warrant a new number on the front.This is why Tiger Woods is such a pain to review. Not only do you have to stretch for more golfing puns, but it's still, on balance, the best golf game around. Admittedly, it's pretty much the only golf game around, but unlike other sports franchises (yes, we're looking at you, Smackdown) the lack of meaningful competition hasn't dulled the expected EA Sports depth and polish just yet.It remains a good, sometimes great, golf game. Where core mechanics are concerned, it's also more or less the exact same golf game you had last year, and the year before that. So do you score it for the newcomer or the disillusioned veteran? Let's delay that decision for a few paragraphs more.The list of new features for 2011 is unlikely to elicit much excitement from cautious fans wondering whether to jump back aboard this year. True Aim is the latest in a long line of important-sounding EA Sports features to mask a rather mundane reality under its capital-letter branding. Basically, True Aim strips away the numerous assists that come with the golf-game territory, forcing the player to rely solely on their own eyes and a rudimentary GPS overhead view that allows you to gauge long distances.It's like those driving games that boast ruthless simulation modes enjoyed only by the terminally anal or the desperate to impress, since both make the mistake of handicapping the player just for playing a videogame. Of course, with practice, you can play the game using True Aim and will probably feel very smug for doing so. In that sense, at last, it represents an olive branch extended to the hardcore who may feel the series has abandoned them for casual mainstream acceptance in recent years. And, hey, that's fine - but let's not pretend it makes the game ~true~.More useful, and a lot more videogamey, is the idea of Focus. This is a finite resource that you use up every time you resort to an artificial boost during a match. Want to hammer the button for an extra powerful tee shot? It'll cost you. Want to target the green more precisely, or add spin to the ball in the air? It'll cost you. Most importantly, if you want to use the Putt Preview, that'll really cost you. Previously restricted to one use per hole, this vital sort-of-cheat is now available as many times as you can afford.Focus is regained for every stroke you take without boosting or tweaking, and once you know the courses it becomes a tactical addition. Do you save your Focus for that tricky green on the ninth, or use some of it now to get you out of a bind? It's hardly a sweeping improvement, but it is a change for the better, forcing you to play the whole course in your head, not just tackle it as a series of unrelated holes."}