{"ref": "https://www.eurogamer.net/battlefield-bad-company-2-onslaught-review", "date": "28 Jun 2010", "game_name": "Battlefield: Bad Company™ 2", "text": "A student banquet: that's what this premium downloadable content pack offers to long-standing Bad Company 2 players. It's when you can't afford to go to the supermarket, having splurged your spending money on cheap booze and ironic t-shirts, so you use up whatever leftovers and ingredients you have lingering in the fridge, mix them together in a slightly different way and bung it all in the oven. The result may stop your stomach rumbling, but it'll never delight the palate.Now, I'm certainly not insinuating that DICE can't even afford to pick up a giant sack of Lidl pasta, but there's no mistaking the familiar flavours being reheated here. From the maps to the mechanics of this new co-operative mode, it's refried beans all the way.Playable by up to four players, Onslaught tasks you with steaming into enemy territory and holding key map points. Once an objective is cleared, you move on to the next. Capture all the objectives and you win. Yay. Meanwhile, the game is throwing everything it can at you to stop you in your tracks. Tanks, attack choppers, mounted machine guns, snipers: they're all ready to roll into view (or not, in the case of those pesky snipers) and put you in the ground.As long as one team member remains alive, the game continues. Should you all die at the same time, it's game over, and you have to restart from the very beginning. If you play solo, you get infinite lives but basically have absolutely no chance of success. This is very much a four-player affair, and even tackling the game in a pair means the odds are stacked against you.Thankfully, you'll carry over whatever equipment and weapon unlocks you've earned in the competitive multiplayer mode, but that trade doesn't work in reverse. If you were hoping for a quick way to boost a few ranks against easy-level AI foes in Onslaught before heading back into the online fray against your friends, you're out of luck.As with most online shooters, the experience varies hugely depending on the quality of the other players. Find yourself with a bunch of muppets who can't seem to shake the idea of running around shooting at everything that moves, and it's agony. Team up with efficient, strategically minded soldiers and it's a potent example of everything that makes Bad Company 2 so great. Protecting your brothers in arms, sharing ammo packs, reviving fallen allies as enemies encroach from all sides, surviving by the skin of your teeth as you react to each new threat with near supernatural ferocity... Yes, it's still an amazing feeling.It's also very familiar. You'll be advancing down the well-trodden paths of Valparaiso, Atacama Desert, Isla Innocentes and Nelson Bay once again, and while these are undoubtedly superb multiplayer maps, they're also worn thin by three months of competitive play. Admittedly, they have been given a minor tweak for Onslaught, but switching the lighting from night to day doesn't make any real difference to maps most players will be able to navigate blindfolded.There are no new weapons or vehicles added to the layouts, and no new pathways to exploit, which probably explains why this 800 Microsoft Point download (£7.19 on PSN) clocks in at just under 1MB in size. It's possible that the guts of Onslaught were already served up in the two recent and sizeable multiplayer updates, but even so - there really is no new material here."}