{"ref": "https://www.eurogamer.net/transformers-war-for-cybertron-review", "date": "24 Jun 2010", "game_name": "Transformers: War for Cybertron", "text": "Despite Transformers' three-decade history dovetailing almost exactly with the rise of home gaming, it's been a constant source of frustration that Hasbro has only ever managed to commission one decent videogame - and Transformers: Armada was far more successful as a tech demo than an exercise in pushing your nostalgia buttons. But then, like a mirage, came the first shots of War For Cybertron, a back-to-the-old-school prequel that looked like the sort of game Transfans had been hounding Hasbro to make for years. The shockwaves put the community on red alert, prowling constantly for new information - Decepticon and Autobot campaigns, design your own transformer, COD-style multiplayer - could this actually be good? They had the latest Unreal engine, Optimus Prime voice god Peter Cullen and all developers High Moon Studios (Darkwatch, The Bourne Conspiracy) thought they needed was a little Energon and a lot of luck. Maybe that list should have included a few fresh ideas, too. Transformers was always a mongrel franchise; the original toy range was cherry-picked from a range of different Japanese toy lines, and so perhaps it's appropriate that War For Cybertron has strip-mined the gaming trends of the last few years. The bulk of the gameplay has come from Halo: two-tier rechargeable shields, a loadout of two weapons plus grenades, and more glowing purple décor than an irradiated New Age emporium. The rest is all Gears of War ~OMG look over there!~ explodo-porn.Copying two rights doesn't necessarily make a wrong, it's just that shooting and gawping aside, there's not much more to it. We're firmly in a rinse-and-repeat cycle of corridor, room full of enemies, man turret, push button to open door - and these days, that's just not quite good enough. The robots lack a sense of weight and inertia too, and it's hard to shake the feeling that you're just controlling human soldiers who've overspent on their Halloween costumes. Although we do have to give props for the world's first ~on snails~ shooting section. In fairness, High Moon has attempted some extra gameplay spice by giving the robotic warriors a range of Team Fortress-style character classes. Leaders (like Megatron and Optimus) are hulking tanks with group buffs, Scouts (like Bumblebee) are agile and able to disguise themselves, Scientists (like Ratchet) are medics, and Soldiers (like Starscream) are all-rounders. In practice, other than speed it doesn't really make a huge difference; with the exception of the Scientist's medi-rays, none of them have any particularly useful abilities or perks anyway.The classes work much better in multiplayer co-op than they do in solo play, as the friendly AI is too flaky to be much use - especially when you're standing next to Ratchet with almost no energy screaming for a heal from the jug-horned fool while his Cybertronian ambulance rams against a wall repeatedly. High Moon has also made some quite strange gameplay decisions. Take the recharging shield, which only recharges a miserly 25 per cent, rarely enough to get you out of danger. Brilliantly, checkpoint restarts only give you back the energy you had when you triggered them, so you can end up endlessly dying as you try to defeat a boss with only the quarter-full health bar you had when you first met him. Similarly, thanks to a fiction-bending reliance on ammo for Transformers weaponry, you often end up in situations that just don't feel right. Watching Lord Megatron repeatedly suffering the indignity of being shot at by drones while he desperately scours the debris looking for an elusive ammo box to replenish his, er, fusion is just sad. Why not have the all-but-useless Energon you pick up from fallen enemies replenish your weapons instead? It's a case of transforming the concept to fit into a Gears-shaped hole, and it's sloppy thinking. And we haven't even mentioned the invisible enemies yet."}