{"ref": "https://www.eurogamer.net/download-games-roundup-review-18th-june-2010", "date": "18 Jun 2010", "game_name": "Reviews", "text": "E3's over! Out of the frying pan and into the games.A cantankerous old copper, a halitosis-ridden fat slag, a taser-wielding granny, hepped-up ASBO yoofs raving on mints, a blind sex fiend, a half-dead heroin addict.These are the things that put the 'Great' in Britain, and just a fraction of the fescennine cast of this unexpectedly brilliant point-and-click adventure from Northern Irish animation studio Straandlooper.Rocking up fully formed and foul-mouthed on the iTunes store a couple of weeks back, the first episode of this alternately hilarious and harrowing tale explores one man's struggle to deal with a hostage situation while trouserless and locked in his own cell. Harking back to the early nineties glory days of sharp writing, stylish art and amusingly malicious puzzles, its effortless charm is apparent right from the opening cut-scenes. With its surly dry wit etched into every line, there's an admirable craft that you'd expect from seasoned veterans, never mind start-up rookies.It's a tricky little sod, mind you. In typical point-and-click style, picking up everything, scanning every last pixel and 'creatively' combining items until something clicks is often the only way to progress, and with no helpful 'highlight' feature on what you can pick up, you'll repeatedly hit cul-de-sacs.The payoff is always worth it, though, with some of the best one-liners and crackpot characters seen in an adventure game since the mighty Day of the Tentacle. Yes, it really is that good, and insanely good value for the three hours of fun it provides.9/10Never mind the 3DS - get your 3D gaming thrills right now on the DSi with this alluringly broken hidden object game.Sporting one of Nintendo's most convoluted titles ever, the gameplay is almost as clunky as the name, and yet there's improbable satisfaction in trying to wrestle with the limitations of the hardware, if only to make the most of Good-Feel Co.'s lofty ambitions. Tasked with peering into a beautifully illustrated diorama, the DSi's camera supposedly tracks the position of your head in relation to the screen, and gives the impression of three-dimensional depth whenever you change the viewing angle of the system.If you line up the objects just so, the idea is that you can pick out letters and specific shapes and move onto the next puzzle - in theory, anyway.Even in optimum lighting conditions it's all a bit of a fiddly muddle, though, as you painstakingly attempt to make the necessary fine adjustments while also trying to point to the object on the touch-screen before it skews out of perspective again.Play it in anything other than optimum lighting conditions, and these mild frustrations turn to impotent rage.Tales In A Box certainly scores top marks for originality and its classy visual sheen, but it's sadly hobbled by somewhat incapable hardware. Maybe next year eh?6/10Poor, unloved Gitaroo Man. Arriving at a time before rhythm-action turned into the globe-straddling corporate behemoth that it is today, it was content to peddle its peculiar brand of J-Pop infused button-stabbing nonsense to no-one in particular. As infectious as its quirky charms undoubtedly were, you wouldn't have paid more than about a fiver for it. But now in this brave new world of digital distribution, revisiting such simple but profoundly brilliant idea makes much more sense - hence Vibes, a completely unapologetic homage to iNiS' forgotten gem"}