{"ref": "https://www.eurogamer.net/train-sim-world-2020-review-quietly-thrilling-and-thrillingly-quiet", "date": "20 Aug 2019", "game_name": "Reviews", "text": "Coasting through the San Francisco Bay area in a muscular F40PH-2CAT diesel-electric locomotive, there's 750 long yards to go until you have to come to a stop at a platform. That shouldn't be too tricky, especially as you've had a lengthy stretch with little more to do than take in the view and prepare your thoughts. With the throttle already set to idle, momentum and the train's sheer weight are all that is propelling you forward. 750 yards might as well be 750 miles. All it takes is a steady movement with a single brake lever, and the giant vehicle you are commanding should glide to a standstill with perfect elegance.That's how it should work. That's what real train drivers do. As passengers we see trains coast to a precise stopping position so frequently we lend no mind to the skill that might be needed, instead focusing our thoughts on lost minutes and the scramble for a table seat.In your first few hours of Train Sim World 2020, however, you'll learn a great deal of respect for the starring vehicles' drives. As 750 yards ticks down, it's all too easy to lose yourself to a frenzy of lever yanking. Pulling the brake to 'service' loads pressure into the system. With the pressure at the right level, shifting the same lever with precise timing to its 'LAP' position applies the brake. Then you shudder to a halt near-immediately, 600 yards out from the destination. It's time to release the brake and dial up the throttle again. An inevitable stuttering cycle of speeding up and slowing down spirals, leading you to overshoot the ideal stopping point just moments after you came short byy five or so yards. There's enough train on the platform to unlock the doors and welcome new passengers, but you were late, clumsy and left plenty of room for improvement. Heart beating, breathing clipped, it's time to hit restart. You know you can do it perfectly with that one more go.And that's the peculiar thing about Train Sim World 2020. It's entirely fair to describe it as slow, meditative and - relative to the furore and fury of a typical action game - even empty. But surprisingly often, it pokes at you like an arcade game does, luring you back in with its remarkably generous capacity for perfection. You know you could do better. You know you could lift your score a little higher.Put another way, even if you don't subscribe to railway magazines and travel the country visiting heritage steam lines (and you should, because trains are cool), developer Dovetail's creation can be a powerfully compelling game.It is, of course, still a simulator. While the likes of a scoring system showcase how it borrows from conventional gaming, Train Sim World 2020 is studiously devoted to realism, from the handling of the trains and their operation to the carefully reproduced stations and sternly implemented timetables. There's personality in there for sure; this is a release that stands out as refreshingly unconcerned by game design fashion, and is proudly unashamed in its enthusiasm for railways. The studio's effort is sincere in tone and largely sober in presentation, but the passion for trains always bubbles near the surface, and is rather beguiling.Essentially, Train Sim World bundles several train lines - or 'routes' - and provides myriad ways to explore them. There are tutorials to master, timetabled services to perfect and a bounty of scenarios, where you might have to deliver freight or keep a fast passenger train performing at the peak of its ability. While it may seem something of a stretch to list 'tutorials' as a significant gameplay feature, the various vehicles throughout this release are varied and complex, meaning getting to grips with each one is a significant part of the game. To an extent, the locomotives of Train Sim World 2020 are its characters. You don't nip through a quick tutorial to understand them; you spend a game getting to know them.Train Sim World 2020 is delivered as something of a hybrid of full release and update. For those new to the series, purchasing the 2020 version will grant access to four distinct routes on console, or five on PC. Spend a little extra on the Deluxe Edition, and you get an additional route; the brand new Peninsular Corridor. Ultimately, Train Sim World is a platform that lets you access the various routes; some are included, and many others are available as DLC.As such, existing Train Sim World owners can access the 2020 version as a free update to the platform itself; that is to say the presentation, scoring system, scenarios, tutorials and other elements. And if existing owners do opt to buy the full version of the game, all the bundled routes will be added to their collection.The reason Train Sim World 2020 - however you access it - warrants consideration as a meaningful release is because of the updates to the platform. On paper, they don't appear to amount to much, but their impact is rather significant. Overall, the changes favour accessibility. That's not to say this simulator as been diluted down to welcome the masses. Instead, numerous subtle tweaks make it  more welcoming to the player who isn't a simulator devotee or railway enthusiast, while equally serving the train obsessive or simulator fan that isn't au fait with traditional video games.Where the tutorials used to offer an overview and then leave you to it, now they provide something like narrative arcs that build up your relationship with the included trains and routes. Hidden objects around the game world encourage you to explore the world beyond the driver's seat. And a rather brilliant hybrid scoring and XP system encourages you to think about the way you play, rather than simply completing journeys.Train Sim World 2020 isn't visually dazzling, and many of the scenarios and even routes are somewhat similar. There are dozens of hours of gameplay in there, but most of it involves not just the same kind of interaction, but also similar objectives, experiences and gameplay tones. This is a game that doesn't shy away from repetition.But none of that stops Train Sim World 2020 being enchanting. It makes driving a train feel powerful and rewarding, even if the process of doing so is meticulous rather than drenched in the high-octane.For the rail enthusiast, there's plenty to love about Train Sim World 2020, even if it's a 'warts and all' affection. It reminds you why trains are so beguiling to those that love them, and brings to life the perennial childhood fantasy that is being a train driver. And for the player more used to glaring down the barrel of a firearm or committing to an ornately crafted narrative? For those with just a little fondness for the wonder of trains, or even half-remembered visions of childhood trainsets, there's a chance Train Sim World 2020 could surprise you. With an open mind to video game minimalism of a very particular type, you might be pleasantly surprised.This isn't a game that is perfect, and it certainly isn't a game for everyone. Many will simply find it dull. It is as distinct as it is understated; both quietly thrilling and thrillingly quiet. It provides a meditative form of escapism, if not a cathartic one. And it's a reminder that trains offer much more than just a way to be late for work. They provide a means to leave where you are, regardless of where you are going."}