{"ref": "https://www.eurogamer.net/bodycount-hands-on", "date": "14 Jun 2010", "game_name": "Bodycount", "text": "When your game's title music is provided by electro noiseniks Holy F***, some might call that a happy co-incidence. I prefer to think of it as Bodycount's mission statement.Creative lunatic Stuart Black prefers to think of it as an ode to Lady Gaga. ~When that first came up, people were like, what the hell does that mean? What, are you going to shoot crystals and people in jumpsuits?!~~But I'm like, no, it's about the spirit - though I do love [her] aesthetic and all that jazz. It's not about copying that. It's about that creative energy and that creative spirit and imbuing that in the software. Now, when I play [Bodycount], I feel that infused at all levels, whether it's shooting the gun, or the front end, or the way the operative speaks and what-have-you. It all has that pop cultural freshness to it.~Bodycount also has the flagrant thieving magpie mentality of a Noel Gallagher, where riffing on other people's brilliant ideas is part of the aim, or indeed the whole point. Take the game's chaotic 10-minute E3 demo, based on a relatively early part of the African portion of the game called The Freeway Underpass. Within the first few minutes, Bodycount is wearing its long list of influences like a badge, with loving, wide-eyed homages to Resident Evil 4, Metal Gear Solid and Crackdown in gleeful evidence.~We want to fantasise the world in the same way that they do in the Resident Evil games, or Crackdown,~ nods Black. ~I'm a particular fan of Crackdown, and it's great to see Dave Jones back making games again, so the orbs [that burst out of fallen enemies] are a little bit of a homage to that. We've also got exclamation marks on our target structures, as a little nod to Metal Gear, so we've seeded little things in for the people who've inspired and influenced us.~Perhaps the most striking of all these homages to gaming's most iconic scenes is the moment the fearsome 'Psycho Tank' comes bursting out with all the gusto of the terrifying Leatherface, or the fearsome Gatling Gun Majini in Resident Evil 5.Was that Resident Evil reference intentional? ~Exactly, that's the kind of tip that we're on,~ admits Black. ~We have a few moments like that in the game, where class-based NPCs like the Psycho Tank, with a 50-calibre gun comes bursting through walls at you and does these big sweeping arcs of fire that you really want to stay out of the way of.~Although Black stresses that these high-powered foes aren't classed as 'boss battles', they certainly take a concerted effort to bring down, especially given that they're backed by a posse of trigger-happy grunts appearing from all angles. It's breathless, and offers the first glimpse of how Codemasters is going to deliver on its many bold claims.While all the chaos is kicking off around you, the ongoing narrative exchange between the lead character Jack and the 'operative' who communicates with him over the headset is certainly an interesting dynamic. But rather than have three distinctly different female operatives chatting to you at different times, the focus is now down to just one to avoid, as Black says, ~spreading ourselves thin~.~The story naturally seemed to lend itself that way,~ he says. ~I'm much more interested in characterisation and character arcs, rather than plot machinations, and in the writing of it I found a really strong voice for a version of an operative.~It became a little bit more about cultish indoctrination: the way Melanie calls you John instead of your name Jack, the way when you join a cult they give you a new name because they want to supplant your old identity and therefore a new personality based upon that.~What's more than apparent - even from the brief demo - is the overt flirtatiousness from Melanie, as if she's getting some sexual kick from your killing prowess. After one rather intense encounter, she chimes in with, ~You're still hot, John,~ while later she appears genuinely affectionate. ~I'm here for you, I need you to come back to me,~ she purrs."}