{"ref": "https://www.eurogamer.net/motorstorm-apocalypse-hands-on", "date": "11 Jun 2010", "game_name": "MotorStorm: Apocalypse", "text": "If there's music playing at the end of the world, it will probably be dubstep, the brutally slow, lurching concoction of industrial beats and weapons-grade bass distortion currently dominating the dancefloors of London and the teenage bedrooms of Antwerp. If there's music playing at crusty extreme sports festivals - like the festival of outlaw off-road racing that's the fantasy of the MotorStorm games - around the world right now, it's probably dubstep too.So it's entirely fitting that it's dubstep assaulting our ears (and bowels) in the bowels of this spartan London nightclub while we nibble pastries and sip coffee at a completely incongruous hour of the morning. Fitting because we're here to see the new PS3 game that takes the MotorStorm festival to the end of the world.In MotorStorm: Apocalypse, the rallying hedonists eschew the desert, volcanic and Arctic wildernesses of Sony's past three MotorStorm games for a nameless, abandoned city on the West Coast of the USA. (Screens leaked earlier this week suggest it was once identified as San Francisco.) The city's abandoned because there has been a terrible earthquake. In fact, there are terrible earthquakes still going on. It's not post-apocalyptic; it's just apocalyptic, according to Evolution Studios game director Matt Southern, who is quite Northern.So, as you race through the deserted streets, the ground shifts beneath your wheels, buildings topple around you, bridges twist and lurch, routes are closed and opened dynamically by the chaos, chunks of masonry crash into the tarmac, explosions bloom in the motion blur. Let's point out that elephant straight away - at first glance, MotorStorm: Apocalypse looks exactly like Disney's recent action racer Split/Second, which had a different conceit, but a near-identical visual impact. And in terms of visual impact at least, Black Rock's slick turn will be hard to follow.But then the dust clears to reveal a rather different game. MotorStorm: Apocalypse's main inspiration is actually Modern Warfare. Front-loaded with a focused, bombastic, seven- or eight-hour story mode, Apocalypse then segues into an open-ended afterlife of levelling, perks and customisation in an expanded single- and multiplayer Wreckreation suite. It even makes a further excursion into Sony's play-create-share manifesto with a game mode creator, allowing the community to write and share its own race rules.It's an interesting application of thinking from other genres - shooters in particular - to racing: deliver self-contained bang for buck that can be devoured in almost a single sitting, then entrap your community with extra features and moreish grind. The latter's already evident in the likes of Gran Turismo and Forza Motorsport, but new to this more immediate end of the racing spectrum. The former, however, might be the more controversial innovation.Apocalypse begins with a playable prologue as the MotorStorm festival's custom aircraft carrier arrives at the devastated city; you'll drive off a landing craft and straight up the beach. You then play through three characters' perspectives on the events of the 48-hour festival, each representing a difficulty level: the Rookie, the Survivor and the Veteran. Every race will be an unrepeatable one-off event - a chapter in this racing tale - and in this single-player mode all the earthquake damage will be persistent. If a building falls down, it stays down. By the end of the festival the city will be in total ruins, and you'll drive out the way you drove in, in a playable epilogue, as the last of it comes crashing down around you.~In terms of influences for the game, I've actually tried to pretty much ignore contemporary racers and look to classics like OutRun and the first Burnout games, and also movies like 2012. For example, the inspiration for the three difficulty levels came from StarFox,~ says Southern."}