{"ref": "https://www.eurogamer.net/prince-of-persia-the-forgotten-sands-review-3", "date": "7 Jun 2010", "game_name": "Prince of Persia: The Forgotten Sands", "text": "Once you POP, you can't stop. So seems to be the case as far as Ubisoft's concerned, anyway. More than two decades after the original game's debut, the Prince of Persia is back. Again. And he's everywhere. There he is in your local cinema, trying to get off with Gemma Arterton and pretending to be surprised that Ben Kingsley is up to no good. There he is on the PC, the PS3 and the Xbox 360, appearing in a game which has a go but ultimately ends up being a bit 6/10. And here he is on the Wii. Prince of Persia: The Forgotten Sands isn't based on the new movie. That's despite the fact our hero bears a striking resemblance to the Prince in the film, who as everyone knows is played by Jake Gyllenhaal, who as everyone knows is played by Justin-Bobby out of The Hills. Nor is it a sequel to the 2008 series reboot, which introduced an ~illustrative art style~ and open-world structure, and also turned out to be a bit 6/10. Nor is it a port of the game Dan recently reviewed, despite sharing the same name.This version has been built for the Wii from the ground up. It's even got a different storyline - some nonsense about a genie and a magic sword and the Prince wanting to impress his Dad. However, there's plenty here which will be familiar to anyone who's played a Prince of Persia game before. Your mission is to run, jump, swing and slash your way through a series of beige environments, solving a variety of puzzles along the way. It's as if Ubisoft has upended the hourglass and taken us all the way back to the Sands of Time era. Not least because the Wii version of Forgotten Sands looks like a PS2 game. A very pretty PS2 game, mind; one with proper lighting and nice textures and a high level of environmental detail. The character models are decent and the animations are superb; the prince's moves are fast, fluid and satisfying to perform. This is one of the best-looking titles available for the system. The high standards of presentation also extend to the soundtrack. Forgotten Sands for Wii has an original score produced by Tom Salta. Us neither, but Ubisoft gave him his own press release so he must be a big deal. It says here the score's ~contemporary world music aesthetic~ was produced using made-up instruments such as the ~bowhammer cymbalom, lakota slide, walimba, ney and duduk~, along with ~custom made~ ones (our money says two coconut shells and a yoghurt pot filled with macaroni). Anyway, well done, Tom Salta - your score does a good job of creating atmosphere and enhancing the gameplay experience, especially when the bowhammer cymbalom kicks in. Forgotten Sands looks and sounds good, then. It also plays well, although again, rather like a PS2 game. The Sands of Time, to be precise. Every environment is littered with beams to balance on, ledges to hang from and poles to swing around. They're all laid out in a logical, linear order, so you never have to look far for the next platform or hand-hold. There's no need to time jumps too precisely, as the prince is smart enough to know you're hoping to land on that nearby beam and not plummet into the chasm below when you press the A button. It's easy to skip and flip seamlessly through the earlier levels, without having to pause to work out your route or pull off precise moves. Which will please those who want an easy ride, but not hardcore action adventure fans. If your idea of a great platformer involves tricky pathfinding and precision button-pressing, Forgotten Sands will disappoint. With that in mind, it's probably more suited to younger gamers than those who remember the original Tomb Raider games being released, and who sadomasochistically enjoyed Lara's stringent demands for pixel-perfect manoeuvring."}