{"ref": "https://www.eurogamer.net/pro-evolution-soccer-2011-hands-on", "date": "1 Jun 2010", "game_name": "PES 2011", "text": "Change is easy to promise, but much harder to deliver. The pleading husband, as his long-suffering wife threatens to walk out, insists he'll change; things will be different this time if only she'll stay. Why should she believe him?So it is with PES. The fanatical devotion Konami's football series has inspired in fans has been a virtual love affair of breast-beating intensity. But the gnawing sense of late that it has let itself go has tried the patience and passion of even its most ardent devotees. As they remorsefully turn away and into the arms of a pouting rival, PES promises to change. Why should we believe them?The reality of this change could not be clearer as I step inside Konami's headquarters in Tokyo, an imposing skyscraper in Midtown housing 2000 of the company's top talents. Kojima Productions is based here, as is the ever-palpitating Dance Dance Revolution team. This is the first time Konami has invited Western journalists into the heart of its operation, to see where and how its games are made.Barely a week goes by without a European or American studio exposing its mind, body and soul to the press, but in Japan this level of access is still a big deal. Indeed, it's taken years of internal wrangling to reach this point, I understand; and it's fallen to the PES team to usher in this apparent new era of openness.A major step for Konami, then, and one Shingo ~Seabass~ Takatsuka, the redoubtable producer of PES, realises is a crucial part of the reinvention of his series. Another part is his own frankness about where it's been going wrong.~We are always challenged to make a change,~ he says, speaking through a translator. ~In order to make the game feel like PES, this perhaps became an excuse for not making enough changes. This time our hidden slogan is 'break what is PES' - we wanted to take the change much further and we wanted to make the next step.~ To avoid misunderstanding, he adds: ~We get asked if we'll lose the feeling of PES. I assure you this feeling will never be lost.~Strikingly, Seabass pinpoints the beginning of PES's problems at the advent of new consoles. ~As the leader of the team, I really wanted to create PES 2011 at the start of the current generation of consoles,~ he reveals. ~But from the PS2 to PS3 that timing was very difficult for us; probably we were not prepared enough. Looking back our team spirit needed a change as well at that time.~He adds: ~We were running in many different directions; today I think we're pretty much stable on which direction we should go. We're not shy of saying we made our mistakes in the past, but we want to use that to give back double, even triple the expectations of our users today. I think we can do that with PES 2011.~'Change' and 'Freedom' are the key themes of PES 2011 for Seabass. He arrives at the initial presentation in buoyant mood, all smiles and handshakes as he leads us through this season's instalment. ~The game isn't finished, but I want everyone to play it and give feedback~. It's by far the earliest the game has ever been shown to the press, a brave decision and another facet of the Change Agenda, inviting comment and criticism at a point where there is still sufficient development time to accommodate anything that resonates."}