{"ref": "https://www.eurogamer.net/terminator-salvation-review", "date": "21 May 2010", "game_name": "Terminator Salvation", "text": "I was in Canada last week, so unlike a lot of people in Europe faced with the possibility of buying the multi-format Terminator Salvation game this weekend, I've had the opportunity to see the film it's based on. I quite like it! John Connor listening to his mum's tapes is a bit Norman Bates, and the only quotable dialogue is the dialogue quoted from Terminators 1 and 2, but director McG appears to have mastered glossy, FX-heavy set-pieces, if not deed polls. Sadly the same cannot be said for GRIN with the videogame adaptation.Thrown into the raggedy boots of John Connor (but not Christian Bale), you're tasked with leading a group of resistance fighters across post-nuclear Los Angeles two years before the events of the film, and for the most part it's a cover-and-flank third-person shooter with its probing red eyes fixed on Gears of War's coat-tails. You clip yourself to cover, go into iron sights with the left trigger and let rip with the right, occasionally tossing the odd grenade or pipe-bomb at spider bots, flying aerostats ~wasps~ and more elaborate Terminators with miniguns and worse.Unfortunately Salvation is horribly shoddy from the very beginning. For the game of a film ostensibly concerned with making the difference between humans and machines count, it's ironic that your NPC allies are noticeably artificial and robotic in their movements, while environments - though detailed - are scabby on account of the scarcity of proper lighting, not to mention book-ended by load screens that sometimes feel as though they last longer than the battles in-between. In-engine cut-scenes launch themselves in a judder that occasionally has you wondering whether the game has crashed. On one occasion, I took out a flying Hunter-Killer, which started to blow up only to be interrupted by the subsequent cut-scene, which then deposited me back on the rooftop for another couple of frames of the HK explosion before it went to the load-screen for the next level.All that's before you consider the actual content. You're spammed with thankfully-ineffectual wasps from the get-go, while dithering spider bots only need to be half-heartedly flanked to expose their delicate hindquarters and most of the rest require only brute force to dispatch. Naturally everything comes in small, unambitious waves whenever you enter a predictably laid-out fighting area with concrete lane dividers, car wrecks and barrels distributed to allow for manoeuvrability, and for variety's sake sometimes you can't flank. Most of the weapons at your disposal lack punch, and the cover system is too adhesive and arbitrary about the positions from which it allows you to fire, while your squad-mates are useless, only firing sporadically at the weak-points you work hard to expose if they even bother at all. Instead they spend most of the time bickering humourlessly. Fortunately if there are grenades around you can just throw those instead and achieve the same results from most positions.There is at least a two-player co-operative alternative, but this is only available in split-screen, and the sudden arrival of somebody who understands the basics of going to the other side of the arena so that one of you is always facing a weak spot, or drawing attention away from the other player, merely serves to collapse the already amazingly short runtime from four hours or so down to around two or three. There are occasional attempts to change things up with on-rails shooter sequences or turret guns, but the heady heights of adequacy remain elusive.Redeeming features? Well, the menus are as slick as those in the developer's other recent film-to-game, Wanted: Weapons of Fate, and the shiny T-600 head you can move around on the load-screen is eerie and imposing. In fact, he's arguably the highlight. Staring into his monstrous red eyes as they twist and focus is as close as the game manages to the oppressive atmosphere of the films.Terminator Salvation does at least have the decency not to be appallingly difficult, although its system of only refilling your health bar at the end of individual waves is peculiar and sometimes catches you out. For the most part though it's plain sailing, thanks to enemies who stand out in the open helpfully waiting for you to outwit them. Even the Hunter-Killers - giant dropships with enough firepower to level buildings - are obligingly incompetent, hovering to specific gaps in the masonry of whichever building you're inside so you can pick them off with a shoulder-mounted rocket launcher, of which there will be dozens littered around the set-piece area.Were your movements less plodding, the weapons a bit meatier, the enemies even basically tactical, the story and dialogue more than perfunctory, the environments remotely imaginative, or the co-operative mode online-enabled, Terminator Salvation would still be far too rough around the edges, far too short, and far too cynical to withstand much critical inspection, but as it is, it's rubbish on virtually every count. The film is surprisingly not-awful, so I suggest you wait a week and go and see that instead, and I really hope GRIN stops signing on for these wearisome contract jobs, because while they probably pay the bills, they also undo a lot of the goodwill established by games like the flawed-but-ambitious Bionic Commando. One point for the load screen, and one point for not exploding my PlayStation 3, although I may burn it down anyway just to be on the safe side."}