{"ref": "https://www.eurogamer.net/dragon-age-origins-the-darkspawn-chronicles-review", "date": "21 May 2010", "game_name": "Dragon Age: Origins - Darkspawn Chronicles", "text": "Let's talk a little about meaning. Meaning's important. Take the word ~chronicles~, for example. What does that suggest to you? An ongoing saga, perhaps. A record of some event so epic that it can only be told one piece at a time. Majestic myths, tales too big to be constrained between Once Upon a Time and Happily Ever After. What it doesn't suggest is something you can finish off in about an hour.That, needless to say, is what we get with the latest Dragon Age downloadable. As with the similarly short-lived Return to Ostagar, let me make it perfectly clear that I'm not about to fall into the trap of equating length with quality. If this was the finest hour of gaming ever produced, or even just up to the quality of its parent game, then the low price (400 Microsoft or BioWare Points, or £3.99) would be perfectly justified. But it's not. It's yet another linear hack and slash journey through familiar environments that stumbles to a halt before it even gets up to speed.The twist is that this is a standalone outing which casts you as a Hurlock Vanguard working for the very same Archdemon you spent many hours working to defeat in the game proper. Set during the climactic battle for Denerim, the episode sees you advance through the city, killing everyone in your path and occasionally performing rudimentary ~quests~ that involve nothing more taxing than smashing gates, pulling two levers or, you know, killing everyone in your path.As such there's no levelling or XP to tinker with, and the sparse loot on offer is just enough to kit out your Hurlock once with maybe a spare sword left over. Not that you'll need the leftovers, since your companions are mindless monsters, most of which can't use armour, weapons or even potions in some cases. Rather than recruiting these beastly brothers in arms, you enthral them using the only new ability of note. Select a random creature, cast the enthral power on it and it joins your team. When you've had enough, you can kill it and choose another.Keeping creatures alive is recommended though, since their approval rating grows based on your leadership in battle. Get stuck in alongside your squad, build up a body count, and they'll be more loyal, unlocking status-boosting effects along the way. Squad members are easily replaced, but you'll need to start building that loyalty all over again, and the campaign just isn't long enough for that to be viable more than once or twice.On a purely conceptual level, the idea of a Dragon Age monster squad is appealing, and the initial stages of the DLC make agreeably twisted use of it. Rampaging through the market district with a trio of drooling monsters, murdering innocent characters willy-nilly, is basically what many people wanted Overlord to be: a bloodthirsty evil simulator."}