{"ref": "https://www.eurogamer.net/dementium-ii-review", "date": "19 May 2010", "game_name": "Dementium II", "text": "It's been a long time since the Cerberus jumped through the window, but ever since the popularisation of the survival horror genre some 14 years ago, I can honestly say that only a few games have ever made me feel genuine unease. But although my top unsettling moments include the psychological rollercoaster of James Sunderland and fumbling with the Camera Obscura while being chased by an eerie procession of poltergeists, in terms of handheld horror, there isn't a single DS title I'd refuse to play in the dark.One that did come close, however, was Dementium: The Ward, which saw the demented William Redmoor dealing with his internal demons while undergoing brain surgery. The game played out from a first-person perspective in a similar style to Metroid Prime Hunters, as well as sporting some impressive 3D visuals which, although lacking the same psychological chills of Silent Hill, still managed to keep the horror factor a few notches above tepid.But Dementium was still marred by frustrating design, like the lack of a reasonable save system and the respawning of enemies in rooms you'd already cleared - despite the fact you often had to traipse back and forth to solve puzzles. Everything also became far too easy once you found the overpowered Buzz Saw, allowing you to stampede through the limited cast of generic monsters. Nonetheless, this was an accomplished first attempt, and with Dementium II, Renegade Kid has addressed many of Dementium's shortcomings.It kicks off where the last game ended. William awakens from his battle with the Doctor only to find himself incarcerated in the Bright Dawn Treatment Centre, before being bundled into a cell with a man mumbling in Russian. But before we're given enough time to wrongly assume William is now post-operation - and that maybe the nightmare has moved from his subconscious and into reality - Renegade Kid pulls a Silent Hill-style 'dimension shift' as the believable world suddenly warps into a blood-soaked alternative full of chains and meat-hooks. This shift is used extensively as the game progresses.From here it's a case of re-familiarising yourself with the well-designed control system which, for the most part, hasn't changed. The touch screen is used for aiming, the d-pad (or face buttons if you're left-handed) caters for movement while the shoulder buttons are used to fire. New mechanics also include double tapping with the stylus to jump, in addition to duck and reload icons on the lower screen.Once you've settled in and dusted off your first zombie with an improvised shiv, you'll start to notice how Renegade Kid has used its Moon experience to increase the detail of its shambling nightmare creatures - which include the chest maws and wailing banshee heads from Dementium, as well as new additions like the leaping brain crabs and laughing pig demons. And although this collection of cheap scares is more likely to make you grin rather than recoil in shock, the fact they can cause problems when attacking en masse means blasting them apart with a double-barrelled shotgun is still satisfying.If the boomstick isn't your thing, then Dementium II also ups the payload from seven to ten with a selection of new weapons. Some of these are like-for-like switch-outs - with the revolver and assault rifle filling the same roles as Dementium's pistol and machine-gun - but elsewhere we get entirely new additions like the nail-gun and flame-thrower. The latter is the classic Blood aerosol can and lighter combo. Acts of martyrdom can also be achieved by cooking a stick of Dynamite for too long, resulting in an embarrassing reload.That said, the biggest issue with Dementium's combat was the fact you had to wait for the monsters to stand on your toes before you could successfully swipe them with the Night Stick. For Dementium II, the melee range has been significantly increased as both the Shank and Sledgehammer can be swung outside of William's personal-space bubble for moderate damage. Our patient has also developed a knack for multitasking as, rather than using the Doom 3 torch system, William can now illuminate the darkness by holding a flashlight in one hand while simultaneously fending off enemies with a single-handed weapon in the other."}