{"ref": "https://www.eurogamer.net/red-dead-redemption-review", "date": "18 May 2010", "game_name": "Red Dead Redemption", "text": "A few hours after disembarking the dusty train that winds into Red Dead Redemption, reformed bandit John Marston meets a smart young journalist from Manhattan. His assignment? To observe life on America's final frontier and dramatise his findings in an article for the well-to-do ladies of New York. His pressed clothes and clean-shaven jawline contrast with protagonist Marston's facial scrawl of stubble and scarring, but beneath appearances, the men share a common purpose: to find gold in the sun-baked Wild West.The meeting mirrors the wider context of Red Dead Redemption's release. Liberty City with its buffed taxis, resolute skyscrapers and air of affluence may appear a world away from this arid, adverse wilderness, but peel back the skin and the framework is identical. Red Dead Redemption is GTA: Wild West, a sandbox most familiar, albeit one that, for once, is filled with sand.Set 50 years after the events of the more light-hearted Red Dead Revolver, Redemption's frontier has become a cat's cradle of political interests, stretched taut by moneyed men in bed with federalised government. The Wild West has grown mild in its old age, and grizzled gunmen with their brutish ways are growing obsolete.In setting the game in the twilight days of a cliché, Rockstar provides an overarching tension beyond the immediate lives of its inhabitants. Where Grand Theft Auto IV's Nico Bellic was desperate to escape his heritage, Red Dead Redemption's John Marston clings to it, a man in search of purpose and redemption in a world slipping from relevance.Nevertheless, it's a world that Rockstar San Diego paints with flair and an abundant appreciation for the Western in cinema. Parched canyons give way to tousled plains across which steam trains puff their way, heading off into purplish horizons. A hangman's noose swings in the breeze from a giant rock. Carts teeter along thin cliff paths, while drunks are spat from saloon swing doors into the arms of waiting hookers squeezed tight by corsets and puffy knickers. Campfires flicker, coyotes howl and droves of wild horses gallop to a melancholy whistled melody or the splang of a banjo. A buzzard squawks, a shadow in the noon sky. Videogames can offer windows on forgotten vistas; Red Dead Redemption is a vivid rebuilding of a world lost to time and technology.But Red Dead Redemption's world exists for more than mere observation. Marston has a score to settle. A reformed bandit, the stoical gunslinger arrives in the Border States hunting a former gang associate who now terrorises the vicinity. When a bid for reconciliation fails, leaving Marston bloodied and half-dead, you must begin to job of reacclimatising the man to life on the frontier, nursing him back to health and gathering a team of hapless characters to help you take down your enemy. As with GTA, you take on smaller errands and targets en route, building fame, notoriety or honour, raising your status in the world as you gather power, weaponry and a posse in anticipation of the endgame showdown. As ever, Rockstar gives you freedom to roam far and wide from the word go (although you won't be able to cross the border to Mexico until the halfway point), but limits your immediate objectives to a small geography. The borders of your missions expand at a slow pace, hour by hour, ensuring you grow familiar with the dirt paths and settlements and begin to build a memory map of the world and its sights. In the same way, details about Marston's past and mission are drip-fed. As your territory expands, so too does your knowledge of yourself, as the typically reserved, early-20th-century gunman builds trust and slowly confides in those  around him in an incessant stream of cut-scenes, both long and short."}