{"ref": "https://www.eurogamer.net/download-games-roundup-14th-may-2010", "date": "14 May 2010", "game_name": "Reviews", "text": "It's hard to wax lyrical about the plethora of downloadable titles currently available without banging on about the iPad and whether it lives up to the insane levels of hype. But. Must. Resist. Our take on the launch line-up will be explored at length in a special roundup soon.In the meantime, grab some Jaffa Cakes and join us as we skip through four of the most interesting recently released titles on the market. As usual, 'interesting' doesn't always equate to quality or entertainment, but we wouldn't have it any other way.The most interesting iPhone games usually end up being the sort specifically designed for the hardware, and Pinch provides another neat example of that mindset.On the face of it, the concept's hardly the most engaging, but don't let the idea of shepherding coloured blobs through a simple maze put you off. Known as 'Norbs', you have to figure out a way to get the required number of these coloured discs to the elusive goal.Moving them around the maze is as simple as sweeping them around with your finger, while uniting them with nearby Norbs expands their size and affects their colour. Sometimes, though, it's necessary to pull them apart again in a pinch motion, and, as with the excellent de Blob, you have to be mindful of colour-mixing logic. So, for example, if you need to create a purple Norb to get through a door, then clearly you need to find a blue and red Norb first.But colour-mixing is but one of the many challenges that developer Coatsink tests you with. Doors are definitely not your friend in Pinch, and to break on through to the other side will generally involve figuring out a specific sequence to negotiate the various switches, one-way routes, doors that only let a set number of Norbs through at a time, or even doors that you can only go through a limited number of times. As you delve into its more challenging depths and discover its minimalist nuances, Pinch becomes a minor obsession. The only downside is that you'll rip through the 48 levels in no time, but when the price tag is just 59p, complaining about that feels rude.8/10Less of a game and more of a frazzled interactive visualiser, Beat Hazard is something of an anomaly. Conceptually beautiful, it takes the basic mechanics of a twin stick, top-down shooter and then essentially procedurally generates enemies - and therefore entire levels - based on the ebb and flow of any given music track.Unsurprisingly, the hook of being able to import all your favourite tunes into the game is a seductive one. Allowing you to barrel through track-by-track, experiencing entirely new levels each time and setting high scores while enjoying the fractured, scratchy visuals and unpredictable chaos is an inspired idea.The main problem is that the novelty wears off rather too quickly thanks to a somewhat limited variety of enemies to fight against. Once you've had more than a handful of attempts, it all starts to feel a tad samey, and before long you start to yearn for a more structured approach. But once you get over the requirement for Beat Hazard to be a 'game' and treat it more like an addled visualiser you can fiddle around with, Cold Beam's bold audio-visual experiment starts to make a little more sense. 6/10"}