{"ref": "https://www.eurogamer.net/metal-wolf-chaos-xd-review-as-dazzlingly-dumb-as-its-legend-suggests", "date": "6 Aug 2019", "game_name": "Metal Wolf Chaos XD", "text": "Maybe there's some alternate timeline out there where FromSoft earned its global reputation well before Demon's Souls' hard-edged fantasy, where maybe its breakthrough game was another of its many cult classics. Maybe it's one where Metal Wolf Chaos' audience wasn't limited to original Xbox owners in Japan - all twelve of them - and found its way westwards, where its offbeat brand of absurdist humour and mech-fuelled destruction got the widespread recognition it deserved. Actually, maybe it's better that things worked out the way they did, because the circumstances behind Metal Wolf Chaos XD are perfect, a throwaway tweet from publisher Devolver during the fateful US election campaign of 2016 setting in motion this most unlikely of remasters. It can be hard slotting Metal Wolf Chaos into From Software's back catalogue, as diverse as that back catalogue may be - it's got mechs, but it lacks the depth or precision of Armored Core, while its set-up has the same scrappy schlock of Ninja Blade, but there's a gleeful delirium that's all its own. Really, though, Metal Wolf Chaos feels like the ur-Devolver game. It's third-person action with grit, a taste for the outlandish and an irresistible elevator pitch that's then played out with spark and spunk. You're Michael Wilson, US President, facing up to a coup d'etat from your veep who manages to secure control of the country's military. So you take the most rational course of action: strap into your secret mechsuit, commandeer Air Force One and plot a path from San Francisco all the way to the east coast as you fight to win back the grand old US of A. It's a premise ripped straight from the same shelves you'd find all those Troma classics - Surf Nazis Must Die! Killer Condom! Class of Nuke 'Em High - and the very best thing about Metal Wolf Chaos is how it leans into its premise with the same wide-eyed energy of Lloyd Kaufman in his pomp. It's an eminently quotable, outrageously enjoyable romp. ~How's my schedule look for today?~ the US President asks, before being told he's a commitment at the Japanese embassy to talk about wildlife protection. ~Sorry, but I'll have to cancel that. I'm heading out to save America!~It's the kind of thing that demands to be enjoyed with cheap beer and even cheaper weed, so it's small wonder that Metal Wolf Chaos so quickly earned cult status, and this remaster does well to provide only the lightest of touches in the porting process. The voice acting is exactly as it was in the 2004 original - as in, it's brilliantly awful - and if the audio quality has been improved for XD then my ears are deaf to it. Dialogue sounds like it's been delivered through a crumpled paper bag and, judging by the performances, that bag was host to a whole load of glue that has just been enthusiastically huffed. So yeah, Metal Wolf Chaos is every bit as beautifully dumb as its legend, built up over the years via scrappily uploaded YouTube rips, suggests. It's a pissed-up, comically overstated romp that starts off silly and only gets sillier still. Oh, and beneath it all there's a half-decent game too - one with that same giggling energy it can barely contain before collapsing onto the floor in hysterics. So there are rough edges - indeed, there are rough edges aplenty, and it's to its credit XD leaves them almost entirely unvarnished. This isn't an M2 or Bluepoint joint, delivering a constant 60fps with rejigged textures for 4K TVs. Instead, while the resolution has been bumped, the textures themselves have barely been touched, with cities composed from still seas of murky concrete. The framerate, meanwhile, lurches around with the same drunken reverie you find elsewhere in Metal Wolf Chaos - and, quite honestly, you wouldn't want it any other way. It's the mid-noughties double-A experience preserved as it should be. And like other double-A games, there's a spark to the action that makes Metal Wolf Chaos worthwhile. It's thunderingly dumb, in keeping with the general tone, but such sweet thunder does it deliver. Your mech has access to a sizeable arsenal that only gets more sizeable over time, with each of your oversized shoulders host to four weapons that can be selected on the fly to tear through the cannons, tanks or footsoldiers that come your way. Or you could rush through the bastards and then stomp on their base to bring it tumbling down. There's a touch of the EDFs to the action - though honestly it's not even quite that polished - and it's all held together by its enthusiasm and a sense of conviction that makes it so, so enjoyable. It's a wonderful thing, briskly paced and always keen to pile on the spectacle, and by the time you're fighting the White House itself you might well have convinced yourself that Metal Wolf Chaos is the best video game ever made. So maybe there is an alternate timeline out there where Metal Wolf Chaos found its way westwards, and propelled FromSoft to the global stage well before it found wider fame with its dark fantasy epics. We should just be grateful, though, that we've finally been afforded the chance to play this ludicrously enjoyable action romp. Now if only, in this current timeline, the premise of a deranged US president wreaking havoc didn't feel quite so prescient..."}