{"ref": "https://www.eurogamer.net/zeno-clash-ultimate-edition-review", "date": "6 May 2010", "game_name": "Zeno Clash: Ultimate Edition", "text": "Yesterday, I saw a goose reading a newspaper on a train.Okay, maybe I didn't. Maybe yesterday I stayed indoors and played Zeno Clash on Xbox Live Arcade. Whatever. It was almost as peculiar.Yes, Zeno Clash is a self-consciously weird game - and, as is frequently the way with self-consciously weird things, it's often strangely conservative as well - but it's the context that makes it really stand out.Alongside Peggle and Shadow Complex and Final Fight you can now tackle the evil hermaphrodite Father-Mother, explore the deeply horrible world of the wilful and obsessive Corwids of the Free, and blast chicken-people to pieces with exploding skulls.The whole thing kind of fits, though, and not just because the new conversion adds Live standards like co-op challenges and leaderboards. It fits because, even before the shift from breathily deconstructed Steam oddball to Microsoft Release of the Week territory, Zeno Clash was the kind of game where co-op and leaderboards would already make sense - if you were prepared to squint a little.ACE Team's debut offering is a very familiar kind of game dressed in some very, very odd clothes. Look past the driftwood set dressings, the artful hideousness of almost everyone you meet, and the psych class primitivism, and you'll see some pretty traditional ideas at work.It's a reach to call first-person brawlers traditional, perhaps, but Zeno Clash at least makes them feel natural. Punching is handled with the triggers, there is a singular sense of impact as your fists bounce off flesh, and while collision detection isn't perfect all the time - it's particularly wonky whenever you're trying to give a downed enemy a truly terminal shoeing - it's been calibrated with a necessary leniency in mind.Unusual perspective aside, Zeno Clash is a very competent fighter. There's something old-fashioned about the way that the game shuffles you from one closed-off area and into the next between brawls, but the cludgy rhythm of the levels gets under your skin.Combos are basic, yet ripe with simple tactical potential, as you switch between a flurry of light punches and a heavy finisher, or block, dodge, and then retaliate with a swinging kick, and the encounters pit you against multiple enemies in a way that's entertaining rather than irritating.This is one of those games where you'll find yourself getting kicked in the back quite a lot, but only before you learn how to play properly. After that, you'll realise that using space and separating foes from one another is just as important as timing a guard-breaking lunge or knowing when to take a risk on a roundhouse.Weapons add another element to proceedings, but they tend to be the kind of things you'll use for a few minutes before discarding: a palate-cleanser between heavy lampings. Clubs do increased damaged but make you rather sluggish, while guns are useful against the occasional flocks of distant beasts but have shallow clips and lengthy reloads.As with something like Chronicles of Riddick or Mirror's Edge - other first-person games with more on their minds than target reticules - these are tools to make you think about the game's space in different ways, rather than treats to give you a feeling of being lavishly overpowered. They hardly matter anyway, given how worryingly visceral the basic pummelling can be.Combos, weapons, crowd control - that's the traditional aspects of the game out of the way. What makes Zeno Clash more than just a competent brawler, however, is the world to which it transports you. Colourful and oppressive, ACE Team's Zenozoik is grim and brutish in an entirely distinct way.This is a place where everything looks scavenged, abused or partially digested. Bright chunks of pottery glint from the plastered walls of the bottle-shaped houses you pass, and people are dank and riddled with feathers, or blended unpredictably with pigs and ostriches."}