{"ref": "https://www.eurogamer.net/blur-final-hands-on", "date": "2 May 2010", "game_name": "Blur", "text": "As obvious as it is to say so, given its title, the first thing that hits you about Blur is how fast  everything seems. As I hurtle around the first circuit in the opening stages of my hands-on with near-finished code, I'm experiencing sensory overload.My eyes are darting around the HUD in an effort to take it all in: the detail of the cars, the hovering power-ups, the rearview filled with rapidly approaching opponents, the oncoming hairpin bend, my health bar so dangerously low, the mods displayed on my rear-fender - WARNING LIGHT! I click the left bumper on the control pad to cycle through to the Shield power I have stacked - too late! My Nissan Skyline is hit by Shunt from the car behind and goes somersaulting through the air showering bits of itself over the track.Hey, it's my first race. It's bound to get easier right? No time for self-flagellation. In seconds I'm back into the action - only this time, I'm behind the sod that knocked me out of pole position. Revenge will be mine. Revenge will be sweet.Breakneck is a good word to summarise the gameplay in Blur. The speed at which race events unfold in Bizarre Creations' first game for Activision feels almost preternaturally fast. It may be because I'm not used to its blend of semi-realistic racing mechanics and gleefully chaotic kart racer power-ups yet. However, it also might owe something to the fact that, while Blur could easily be pitched as Mario Kart meets Project Gotham, its in-race gameplay puts a premium on timing and tactics.Certainly, that's not new in itself. Mario Kart veterans are aware of the value of knowing when and where to deploy a power-up during a race. The thing is, in Blur, the pace of the game is so ferocious that juggling power mods and tactical considerations on top everything else feels a little strange at first. After a couple of races, however, it becomes a source of maniacal, sadistic fun.It's taken Blur a bit of time to arrive at this stage. When I was first shown this game at Activision's pre-E3 showcase last year it all sounded a little muddled. The game was pitched as a hardcore racer with casual appeal. The menus and career mode seemed to have been pegged to some weird social networking idea. The on-screen action looked right, but the brief made it sound as though Bizarre was trying to shoehorn in too many gimmicks to maximise the game's appeal. I hadn't seen anything of Blur since then, so I didn't know what I was in for at my preview session. I'm happy to report, then, that Blur looks extremely promising from all the important angles.From the moment it boots up it impresses with its flashy, neon-encrusted visuals and smooth, ambient soundtrack. The game's slick menu presentation carries over into the races themselves; there's no lag, the draw distance on the track ahead is very decent and the soundtrack is an exciting mixture of rumbling engines and squealing tyres punctuated by the odd crash of breaking glass and tearing metal. During the more spectacular crashes the action slows down a tad and the visuals take on an a brief off-colour tinge, but it's a quick, cosmetic effect, and in no way feels like the game mocking your incompetence, which I felt was the case in Burnout Paradise.The controls are intuitive and easy to get to grips with; on the Xbox 360 the triggers are mapped to the accelerator and brake, the left bumper cycles through power-ups, A deploys them, B is the handbrake and the right bumper toggles between first and third-person (read: car) view.There are eight power-ups in total. By far the most fun to use is Shunt, which fires out a ball of  energy that homes in on the nearest car ahead of the player and blasts it off the track. The Mine power-up drops a ball of energy behind the player's vehicle and it lies there on the track until some poor soul drives over it.Lightning breaks up the pace of the pack leaders by dropping coils of electricity onto the track up ahead. Nitro provides a short, sharp burst of speed. Bolt fires a parcel of energy straight ahead which nudges cars out of the way. Barge emits a charge of energy from either side of the car. Repair and Shield do what they say on the tin. Players can stack up to three power-ups at any time - they show up on their car's rear fender - although you can't pick up any new ones until you have an empty slot."}