{"ref": "https://www.eurogamer.net/ufc-undisputed-2010-hands-on", "date": "1 May 2010", "game_name": "UFC Undisputed 2010", "text": "Although England has a history of international football tournament failure, here in the UK we're nonetheless renowned for our sporting patriotism - by which token UFC 2010 should make a good impression. Last year's game only had one English fighter, Michael Bisping, but for 2010 we're getting The Ultimate Fighter 9 winners Ross Pearson and James Wilks, as well as Dan ~Dhalsim~ Hardy - a Brit who survived an armbar and kimura submission attempt by legendary Welterweight Champion GSP. Other 2010 British additions include Terry Etim, Mostapha Al-turk and Andre Winner (unconfirmed), as well as James McSweeney for DLC. Get in.Playing 2010 on the Xbox 360 this week at an event in London, it's clear why Yuke's kept the Undisputed tagline, as the ebb and flow of the game will be immediately familiar to those who've played 2009. The control setup has been left mostly unchanged with everything from the right analogue stick counters, to the face button punches and kicks, remaining intact. The ground game transitions are also achieved through the quarter- and third-circle motions which took time and patience to master in the first game.But while there's no escaping a sense of familiarity, it's also clear that 2010 is an evolution of the 2009 template, with its share of mechanical overhauls and improvements. Perhaps the most significant addition is the new Sway system, which allows the player to swiftly dodge oncoming attacks by holding the right bumper (high guard) and flicking the left analogue stick. A flick forward, for instance, will allow your fighter to duck a loaded punch to the head, and by immediately following up with a counter you can land an uppercut which has knockout potential.Another substantial change - which will require 2009 vets to rethink their gameplay strategies - is the new Cage Physics. By catching your opponent in a standing clinch or grapple, you can now pressure them against the Octagon wall and use the increased leverage to bash their body with knee strikes, rendering their blows less effective. From this position you can also attempt a takedown, either going for a safe double-leg, which will put you in a full guard, or instead attempting a riskier single-leg, which will net you a more advantageous half-guard position.Yuke's has also made subtle changes to the existing mechanics, not least of which is the adoption of the ground game transition system to the stand-up clinches and grapples. Effectively this means you can transition from a double underhook to a collar tie with carefully timed motions on the right analogue stick, which, while still hard to master, feels more intuitive. Further additions include doctor stoppages, new flash submissions and a less rigid combo system - effectively allowing players to experiment with their own punch/kick combinations.With only the Heavyweight and Welterweight divisions in the preview build, match-ups like Shane Carwin vs. Frank Mir and Dan Hardy vs. GSP were the obvious choices, and after recreating the UFC thrills of first-round knockouts and five-round baited endurances, 2010's many tweaks and new systems feel relevant and help to make this MMA simulation, and by extension the fighters themselves, more authentic. Both Shane and Dan have an excellent stand-up game, which, in the right situation, has one-hit-KO potential, but once things transition to the ground Frank and GSP tend to dominate. Just like their real-life counterparts.For those who prefer to build their own fighter, rather than fill the 4XL gloves of Brock Lesnar, the revamped Create a Fighter mode looks to improve upon the original. This time there's more choice in crafting your fighter's physical appearance, as you can choose from a broader selection of body types, as well as having full control over facial features. Players can now choose between some 59 different haircuts - including long hippy styles - as well as giving their MMA avatar that extra edge with arrow-shaped sideburns.UK fighters can also pick between seven hometown cities, and while London, Manchester and Liverpool are all obvious additions, the inclusion of Sunderland over Newcastle is a curious choice. That said, I thought the omission of Truro was the more shocking oversight.Less superficial, however, is the way in which creating your own fighting style has changed. In the last game everything revolved around picking one standing style and one ground style. But while this helped to maintain a balanced gameplay experience, it also felt unnaturally restrictive as most UFC fighters are proficient in multiple styles. For 2010 this old system has been knocked out in favour of giving the player creative control."}