{"ref": "https://www.eurogamer.net/dead-to-rights-retribution-review", "date": "23 Apr 2010", "game_name": "Dead to Rights: Retribution", "text": "Jack Slate is a cop on the edge. With a name like that, he probably doesn't have much choice. Early in Dead to Rights: Retribution, which reboots a faintly remembered franchise from 2003, he's investigating a typically grimy locale with his dad, Frank, an equally hard-boiled detective of the old school.The grizzled duo confronts a couple of henchmen, but just as dad is on the verge of talking them into surrender, bullets fly and the perps go down. It's an overly enthusiastic SWAT team, led by Frank's former partner. “This is not how we do things!” Frank barks. “We arrest people. We bring them in and we question them!”Trouble is, to get to this point you'll have carved a bloody swathe through dozens of identical henchmen; snapping necks, kicking heads and putting bullets in faces at point blank range. Quite why it's suddenly important to follow due procedure for these randomly selected bad guys is never explained.Does it matter? Probably not. Action games, much like their direct-to-DVD movie counterparts, rarely operate in the realm of narrative logic. As long as you can get right back to the ol' ultra-violence, it's easy to gloss over such idiocies. Or at least it should be. The fact that I couldn't let go of this daft inconsistency says more about the gameplay's inability to keep me distracted than it does about the lax storytelling.The problems with Dead to Rights can be found neatly encapsulated in its own self-promotional waffle. This is, apparently, a ~hybrid tactical shooter and arcade brawler~, in which you navigate linear urban environments, wiping out the bad guys with melee fighting and slo-mo gunplay. While Heston Blumenthal may produce culinary magic by combining unlikely tastes, here it results in an undercooked oxymoron, the incompatibilities from the ingredients cancelling out whatever tasty strengths they may have offered.When you're trying to shoot tactically, you're forced to trade blows with bludgeoning opponents from all sides. When you're trying to perfect combos to take down a gang of unarmed thugs, you're being shot by gun-toting enemies and off-screen snipers. With one button pressed into service for everything from taking cover to dashing across open ground to disarming an enemy, the opportunities for the context-sensitive controls to leave you in the lurch are awkwardly multiplied. Throw in a fondness for suddenly spawning enemies to catch you in cheap crossfires, and a camera which flicks distractingly from one angle to another as it tries to keep you framed with limited success, and the key elements of both shooter and brawler are poorly served.What ideas Retribution introduces to its dormant heritage can easily be traced back to recent high-profile hits rather than any fresh thinking. Just as the original games cribbed from Max Payne, this time it's hard to ignore the debt owed to Batman: Arkham Asylum.The flow-based fighting aims for the same bullseye as Rocksteady's comic-book smash, but fumbles the execution. Response is stiff, reactions gluey, so rather than grace and speed it's easier to fall back on blunt force to bash your way through. Similarly, the occasional detours into stealth gameplay draw directly from Batman's ~detective vision~. In these sections you control Shadow, Jack's enormous canine companion, and infiltrate enemy areas to find keycards or disable defences.Hunkering close to the ground allows Shadow to not only see enemies though brick walls, but also view their heartbeats. This made sense for the Caped Crusader, but here it feels random, pointless and - let's face it - more than a little silly. Dogs with x-ray vision sit clumsily alongside the gritty noir tone established elsewhere.Shadow almost proves his worth in the normal gameplay, as a prod up on the d-pad sends him into the fray to tackle a stubborn foe or retrieve a discarded weapon. This is squad play at its most basic, but by making the sidekick an attack dog, the simplistic nature of the thing is at least partially excused."}