{"ref": "https://www.eurogamer.net/football-manager-handheld-2010-review", "date": "16 Apr 2010", "game_name": "Football Manager Handheld 2010", "text": "With each passing year the Football Manager series raises the bar, every annual release proving more complex than its predecessor. The ability to micromanage every facet of your team has ultimately been the factor that's made the PC series so compelling. But such impressive depth also runs the risk of making handheld ports feel increasingly watered-down. So while Football Manager Handheld 2010 on iPhone and iPod Touch is undoubtedly an entertaining management experience, it's hard to escape the limitations of the format.The first challenge the game faces is the size of the iPhone's screen. With the game's spreadsheet- and stat-heavy nature, attempting to make on-screen selections is definitely not the domain of stubby-fingered jabbing, making the acquisition of a stylus a necessity. Simple tasks such as team selections can turn into unnecessarily challenging and time-consuming chores, though to the game's credit, an icon-driven navigational system and an ability to scroll between screens with a flick of your finger alleviate the problem somewhat.Developer Sports Interactive has managed to pack in an impressive feature set, such as the ability to manage any team from 34 leagues in 11 countries. Each player possesses comprehensive stats that can be viewed with a single touch, while training schedules can be defined and assigned to each position with consummate ease.Two of Football Manager Handheld's greatest assets are its scouting and player search features. The latter is particularly impressive, allowing you to filter players with detailed, customisable searches. There's an impressively comprehensive player database on show containing around 20,000 players. However, perhaps best of all is the ability to clearly see at a glance which areas of the pitch a player is suited to, as this makes it easier to distinguish a versatile player from an inflexible one.Transfer negotiations possess much of the political and economic wrangling we've come to know and love from the FM series. Agreeing a transfer fee is only the start, and you'll soon be receiving countless reasons why a player cannot or won't join your team. These include a club being reluctant to sell to a rival team or a player having no wish to join your cause, no matter how many truck loads of money you dump on their front porch. It's this level of detail that really brings transfer dealings to life and injects the game with some genuine personality.Scouting is another solid feature. While scouts cannot be sent to individual countries to uncover the next big thing, they can be sent to regions such as Scandinavia, South America or Eastern Europe. Once you've sent out your spies they return with lists of potential targets and a brief overview of each player's abilities. The scout also compares each target to one of your squad members, enabling you to gauge their potential and worth far more easily than having to wade through and manually cross-reference a deluge of stats.Other noteworthy features include player interactions and board confidence. While the former is rather basic (public or private praising or rebuking), the latter is satisfyingly detailed, clearly laying out your employer's thoughts on your progress. There's even an option to approach the board and request higher transfer or wage budgets, or ask for more time to mould your squad. Again, it's basic, but it's a nice touch."}