{"ref": "https://www.eurogamer.net/pokemon-heartgold-soulsilver-review", "date": "6 Apr 2010", "game_name": "Reviews", "text": "Like FireRed and LeafGreen on the GBA, Pokemon HeartGold and SoulSilver are updated remakes of older Pokemon games - in this instance, the original Pokemon sequels, which first arrived in Europe in 2001 on the Game Boy Color. I first played them when I was twelve years old, which, distressingly, was nearly a decade ago. Reaching the stage at which your own childhood classics start getting remade to delight a new generation is a sobering milestone in one's gaming life. I'm probably a sizeable portion of HeartGold and SoulSilver's audience. We're in our twenties, now, the kids who were playing Red and Blue 15 years ago and taking Pikachu lunch boxes to school. A lot of us have probably failed to keep up with the series in the intervening years and find its ever-expanding menagerie of increasingly weird-looking monsters intimidating.HeartGold and SoulSilver are artfully designed to draw us back in with familiar Pokemon in a familiar world, wrapped up in updated graphics and gameplay systems and packaged with a new gadget, the Pokewalker. The question is not so much whether HeartGold and SoulSilver are good games - they're excellent, always were - but whether they're good enough to merit buying again, or to draw in a new, nostalgia-immune audience.Pokemon's innate appeal, certainly, is timeless. Its spirit of adventure and richness of imagination are evident from the second your young trainer sets off into a detailed and vivid world, kept turning by a touchingly symbiotic relationship between the people and the many different creatures that inhabit it.Essentially, it's about hard work and empowerment. You rise from nothing to conquer the world by virtue of your own hard graft, through investing inordinate time and effort into a team of creatures that quickly come to feel like an extension of yourself. The rhythmic process of collecting, training and learning about the Pokemon is irresistibly absorbing; 15 minutes of exploration quickly turns into an hour of battling, or tinkering with your team, or hunting for an elusive catch.Every player's relationship with the game is unique. Pokemon has always understood the importance of personalisation and HeartGold and SoulSilver offer ample opportunity for self-expression, not just in your choice of Pokemon and the way you raise them, but in personalised trainer data cards and Pokegear skins. The games track your investment of time and effort with meticulous detail, and always make you feel that it's worthwhile.There's a lot of necessary repetition in the Pokemon formula in the form of random battles, but the games are structured to minimise the grind. Rival trainers give the entire team a workout, and you find that your squad develops naturally and evenly thanks to the elegant balance of the battle system. The decade's worth of refinement that the Pokemon series has undergone is not lost on HeartGold and SoulSilver. It implements all of the tiny, incremental improvements to the complex and yet inexplicably intuitive type interactions and battle moves that form the core of Pokemon combat. By now, it is a thing of beauty: intelligent, exciting and never unfair.Pokemon Gold and Silver always were especially notable for their sheer amount of content. As well as having more than 250 different Pokemon, the pair were also literally twice the length of Red and Blue. After progressing through Johto's eight Pokemon gyms and the Elite Four, you get to do it all again in Kanto before a final showdown."}