{"ref": "https://www.eurogamer.net/allods-online-review", "date": "4 Apr 2010", "game_name": "Allods Online", "text": "Let me tell you about the digital Vietnam this free-to-play MMORPG put me through. Let me tell you about XAES.XAES is a low-level instanced dungeon, the first one lots of Allods players will get the chance to attack. It's some kind of magical power plant filled with traitorous engineers. Making the decision to do a run of XAES is pretty dramatic, partly because XAES is a level 10 instance sat in the middle of a city containing the game's only quests for levels four to 10. So, the 14 or so hours you spend reaching level 10 are also spent being battered black and blue by 'Looking For Group To Run XAES!!!!!!!' messages in area chat.Deciding it was my time to hit XAES felt like a coming of age. I didn't care that it took 20 minutes camped in front of the portal to get a six-strong group together. This was it!~It~ turned out to be a featureless trudge through the uninspiring grounds around the building for two hours, wrestling plain-looking enemies with ferocious stats. Even for our balanced team of two tanks, a healer and three damage-dealing classes, defeating each one was like tipping a car.There were no set-pieces, no enemies requiring special treatment, no surprises and nothing pretty to look at. There was just eroding hard numbers with the same series of hot-key presses over and over, with each death on our side (there were lots of deaths on our side) acting like a rope wall in a mental obstacle course. If this was a coming of age, it was one of the ones practised by tribes in the middle of nowhere, involving nudity and pain.And you know what our reward was for the two whole hours we spent pressing past enemies in these dismal, building-site surroundings? The discovery that we couldn't beat the instance's final boss. His stats were too high. We took him on three times, got flattened three times, and ran all the way back to him three times like drunks sprinting into a glass door. ~It's not happening,~ I typed from the metal gantry overlooking this horrible mage. My group either fell silent or swore with grubby net illiteracy.XAES exemplifies the only real problem with Allods Online. Outside of moments like this, everything else is pretty, in place and as it should be, designed with intelligence and a touch of charm. Squint, and Allods is perfectly poised to achieve its mission: lure people in by offering them something similar to World of Warcraft, except for free, and then reap their money back with straightforward micro-transactions.In the bottom left corner of your screen in Allods is a tiny, unobtrusive treasure chest, and clicking on it brings up a dirty great item shop of things you can buy with your real-world money. This is actually implemented really well, in that it's perfectly possible to play Allods without ever handing over your credit card details (the item shop's even been disabled for most of the beta), but the fabulous bargains on sale appeal anyway."}