{"ref": "https://www.eurogamer.net/infinite-space-review", "date": "22 Mar 2010", "game_name": "Infinite Space", "text": "You know, if you're going to choose any clearly-defined videogame stereotype to model your life on, you could do much worse than pick the lonely, down-at-heel yet sassy male teenager who heads up about 95 per cent of JRPGs. Granted, you'll probably start your adventures orphaned, abandoned and with serious amnesia. But sooner or later you'll be engaged in a rattling narrative encompassing glittering cities, incredible treasures and dozens of combat-specialist bikini models with scant regard for the personal safety of their improbable lady features. Infinite Space, being a fairly traditional JRPG yarn on DS wearing the fancy narrative costume of a space opera, fits this mould perfectly, and protagonist Yuri's story is compelling, enjoyable and well told. An excellent choice for the vicarious achievement of ambitions. Beginning on a backwater planet on the edge of civilised space, the game sees Yuri enlisting the help of smouldering space junkie Nia to help him escape his parochial existence and discover the truth behind the ~epitaph~ - his dead father's final bequest. A quick tussle with some dastardly space pirates later and our hero is happily committing laser-based space atrocities with the worst of them, gathering information, money and crew members on his way to truth, the universe and everything.What this means for the player is a surprisingly in-depth and refreshing take on the traditional party RPG, an experience whose scope and ambition are sadly marred by some awkward and frustrating design decisions. Despite an extensive, and generally likeable, cast of 150 recruitable characters, it's actually the ships which are analogous to the party members of most RPGs. Humans are transposed to stat-enhancing accessories when assigned to various roles in your fleet.You'll be compulsively tweaking your ships' loadouts in response to new threats. Yuri's burgeoning fleet is selected from a dazzling array of drip-fed models, from modest destroyers to mighty carriers with bellies full of fighter squadrons, each of which is internally customisable with a truly impressive array of modules. The minigame which facilitates this customisation is a sort of static Tetris in which the modules are slotted into limited hold space. Awkward shapes and tight restrictions mean that you'll need to be careful with your selections.Should your flagship bristle with complex sensor arrays and targeting equipment, a pure combat vessel? There are plenty of options for that. Maybe you feel the crew need a bit of comfort, keeping them alert and combat-ready on long interstellar journeys? You'll be wanting the rec-rooms and study halls. Feeling vulnerable? Painfully aware that a fallen flagship means game over? Install some of the myriad shield and defensive enhancements to fortify your light-speed habitations.It's a satisfying process, balancing space, priorities and cost to achieve perfect poise in combat. Often it's best to settle on compromise rather than specialisation, but the resale value of modules and the proliferation of refitting stations mean that repurposing your fleet is always quick and easy. This allows you to specialise effectively if an area's enemies are posing a specific challenge. Crew redeployment is equally straightforward, although a thorough study of either the manual or the excellent online help system is a must for a full understanding of characters' stats and roles. These thirty-five jobs range all the way from captain to assistant chef, and all make subtle yet important differences to the way your fleet operates.Making sure the right person has the right job can often make more difference to your performance than blowing a wad of space cash on a shiny new destroyer, and as such a proper combination of modules and people is absolutely essential to survival. For example, getting the right people on the right bridge will make your combat gauge fill much more quickly, probably the single most important factor in the game's battle system."}