{"ref": "https://www.eurogamer.net/fresh-dead-to-rights-retribution-hands-on", "date": "19 Mar 2010", "game_name": "Dead to Rights: Retribution", "text": "This probably sounds like the usual journalistic embellishment for the sake of a snappy intro, but I swear on my games collection that my family used to have a pet Alsatian dog called Shadow, and that he was a complete and utter psycho. He once took so much exception to being stroked that he decided to savage me in the face, missing my left eye by a quarter of an inch. Check out my scar sometime!That's not to say I have any issues with canine-kind, or the fact that Namco Bandai has elected to make its own sociopathic man-eater the co-star of its latest action-adventure. Just spare a thought for the screaming, bloody tears of the four-year-old me when you're busily commanding the Dead to Rights version of Shadow to rearrange someone's vital organs.Arriving more than four years after the previous visit to the one-man-and-his-psycho-stealth-dog franchise, Dead To Rights: Retribution is probably the most unselfconscious action epic you'll play all year. Combining slick melee combat with brutal gunplay and sneaky-sneaky interludes, it throws pretty much every decent action game mechanic of the past decade into the pot and reboots the franchise in breezily confident style.Kicking off with a flash-forward to a bloodied, beaten Jack Slate, things don't look peachy for the Grant City police officer, with surly gang members taunting him about the non-appearance of his faithful hound. The manic mutt then bounds into the fray in the nick of time to demonstrate his penchant for 'Scrotalities', giving you an early taster of the likeable ridiculousness ahead.Rewinding back to how Jack got in this jam in the first place, you find yourself engaging in what appears to be a routine hostage-rescue mission, as an amped up gaggle of 'Union' thugs take over the city's Temple Tower to make their point. Early encounters switch fluidly between stop-and-pop cover-based blasting and teeth-gritting melee combat mechanics. One of the game's early triumphs is how well the two mechanics work together. Blessed with a slick disarm manoeuvre, you can storm right up to an enemy, snatch their firearm out of their grasp and follow that up with a hot lead sandwich for good measure. You're able to take ludicrous amounts of damage in the process, but you'll be having so much fun that you won't care.That's not to say you'll storm in willy-nilly. Limited ammo ensures you have to keep a steady aim and make good use of the game's satisfying cover system. Taking its cue from iconic third-person action-adventures down the years, the game liberally pinches the best bits of everything from Resident Evil 4 to Gears of War and Yakuza and combines them all to great effect.In terms of mechanics, you push a button to snap to one of many cover points, lean out with the left stick then fire with the right trigger. You can also suppress the enemy from complete safety by blindfiring - especially useful when you're trying to buy some time and recover some health.Another useful trick is the game's slow-motion 'Focus' mode. With a quick press of the left bumper you can go all John Woo for a few seconds and remember the days when every game felt the need to have Bullet Time. Fortunately the designers only allow sparing use, and for the most part you'll be using what ammo you can muster and engaging in risk-taking melee encounters."}