{"ref": "https://www.eurogamer.net/gdc-2010-indie-roundup", "date": "18 Mar 2010", "game_name": "Reviews", "text": "The Independent Games Festival, the Sundance of the gaming world, threw some classics into the mix this year. Of these Limbo, Super Meat Boy! and Joe Danger need less of an introduction - so here are Eurogamer's five other hot tips from the most worthy (and crowded) corner of San Francisco's Moscone Centre.Essentially a collision between Gauntlet and Hitman, Monaco presents top-down maps of various exclusive Monte Carlo residences and hotels for up to four co-operative players to loot, pillage and get shot down by security within. In fact, the best way to describe it is to imagine playing Hitman from the map screen - having scrunched up your eyes to ensure a pleasurable degree of lo-fi scuzziness.The aim is to break into an exclusive area, steal a valuable object that lies hidden somewhere within and then leg it back to your getaway car while armed guards give chase. It's Ocean's Eleven, yet significantly less rubbish; a great game that's more than worthy of its overall IGF victory.Each player can choose a different character with different aptitudes - nuzzle the Locksmith against a door and he can open it quicker than the other players, for example, or shove a Hacker towards a security terminal and you'll push back the darkness of unseen areas and watch the guards on patrol. Should your high-speed heist go terribly wrong, as it no doubt will, there are also smoke bombs that can be dropped and there are cupboards to hide in with a worried expression.Despite its Roguelike-meets-Pac-Man visuals, it somehow manages to conjure up atmospheric locations without breaking a sweat; our favourite being an evening soiree in a mansion that has a front room swarming with countless top-down toffs who are liable to produce a question mark out of the top of their head, and therefore a concerned dash towards the security guard, within in a moment's notice.Best of all, however, are the frantic dashes for safety and the getaway car once alarm bells are ringing and security guards want you dead. In the same way that Left 4 Dead's closing moments are all about throwing yourself back in the fray to save a fellow player or guaranteeing your own survival, you'll watch one of your primary-coloured friends being gunned in the back by pixel-bullets and face the decision of saving him or not.Whether or not there are post-mission sequences in which your getaway vehicle teeters over the edge of a pixellated cliff somewhere up in Alps is as-yet unconfirmed.With Closure and Limbo in competition it seems that all the coolest kids in this year's IGF were monochrome. Unlike Limbo though, Closure makes this balance of light and dark a game mechanic. In the world of Closure anything that isn't lit up simply does not exist - you may well know that a platform stretches out to your helmeted hero's right, for example, but that won't stop you plunging through it into the inky blackness should you stray into the shadows.To traverse anything, then, you either need to adjust the direction of handy light sources on the level - or you need to carry glowing light orbs around the level and leave them in the sorts of areas that you wouldn't mind having some solid ground.As demonstrated by the fact that the game won the Excellence in Audio award at the IGF, the sound effects are pretty special too. Haunting piano chords mix in with sounds of the player's actions and whistling, swirly noises in a pleasantly discordant fashion - giving the entire affair the feel of a particularly on-edge and creepy corner of the Twilight Zone.It takes your brain a while to engage with the contempt Closure has for standard interpretations of 2D scenery. Put an orb in a socket and allow it to be carried around the level and you're able to travel on it like you're standing on a torch beam, for example. But the process of learning and discovery is a great one. Stay out of the darkness and you'll be fine."}