{"ref": "https://www.eurogamer.net/star-wars-the-old-republic-gdc-2010-hands-on", "date": "15 Mar 2010", "game_name": "Star Wars: The Old Republic", "text": "GDC 2010, and LucasArts is bussing journalists from the bedlam of the Moscone conference centre to its plush, tranquil campus on the Presidio, on the other side of San Francisco. We're ushered through a side lobby as spacious as most company's front doors, then past a huge hand-painted mural of Indiana Jones surveying the nearby Golden Gate Bridge while AT-ATs stalk over the San Francisco skyline. Discreet on the outside but for a small Yoda statue, the Lucas offices aren't afraid to revel in their heritage once you're through those hallowed, high-security doors.We're here to see the latest exercise in building on (and profiting from) that heritage - and probably the biggest, most expensive and momentous such exercise since the last Indiana Jones film, or even the Star Wars prequels themselves. With World of Warcraft as its target, EA as its publishing brawn and BioWare as its RPG brain, Star Wars: The Old Republic is easily the most significant MMO launch since WOW's, and potentially nothing less than the biggest game in the world.What we get to play today is a mission demo not dissimilar to the Sith Inquisitor showcase from late last year. This time, however, we're at the controls of a level-six Republic Trooper, an armoured rifleman and grenadier and good-guy precursor to the iconic Stormtrooper.Although the combat basics will be familiar to any player of traditional MMORPGs - hard targeting, skill clicking, cooldowns - it's faster-paced and punchier than most, with the player-character able to take on a mob of enemies at a time and survive.It seems to have been rebalanced somewhat in the last few months - or at least, the Trooper is a little less destructively overpowered than the Inquisitor was. I don't die, but my health bar gets whittled down dangerously low by extended scrums with four or five of the separatists I've been sent to fight. ~We don't want you to have to wait until you hit the level cap to feel powerful,~ Jake Neri, a producer for the game on the LucasArts side, tells me. ~We want you to feel heroic and powerful right from the get-go.~People who were in love with Boba Fett are going to want to play our Bounty Hunter, and we need to make sure that Bounty Hunter feels like that expectation of Boba Fett. The jetpack is there, you've got flame-throwers and stim darts and carbonite and things that are really compelling that you've seen Boba Fett do in the movies.~In this fairly low-level mission, the Trooper has been sent to quell a separatist uprising on the planet of Ord Mantell. Fighting his way through a scattered opposition, he meets an imperious (though not Imperial) female alien double-agent who informs him that the separatists have a powerful bomb that they intend to use in a civilian area.It might sound a bit like BioWare's just dropped a Fallujah allegory into the expanded universe, but although we're blasting our way through militaristic firefights in a desert setting and using cover, it's still unmistakably Star Wars, thanks to those echo-chamber zaps on the soundtrack and the chunky, stylised, faintly retro interpretation of the original trilogy's legendary production design.The Trooper uses earn-and-spend action points rather than the mana-like pool of Force. The basic-but-still-pretty-effective blaster rifle attack builds them up and then his other abilities spend them: a concentrated damage-over-time stream of rifle fire that pins and stun the enemy; a light grenade and a heavier ~sticky~ one; and a rifle-butt melee blow that knocks the Trooper's opponent to the ground. To rest and recharge during fights, hit a button and the Trooper does a Marine-style rifle twirl animation while his health builds. It's a simple selection for a low-level character, but true to Neri's word it feels powerful and fun and a perfect fit for the character class.Like the Inquisitor demo, it's a strictly single-player experience. We all play offline in separate instances of the same mission. As RPG gameplay goes, it's slick, accessible, pacey and enjoyable - but in common with everything LucasArts, EA and BioWare have shown of The Old Republic so far, there's nothing massively-multiplayer about it. They've shown an appealing and obviously high-quality game, but they simply haven't shown us an MMO yet."}