{"ref": "https://www.eurogamer.net/sea-of-solitude-review-a-noble-adventure-washed-out-by-its-own-banalities", "date": "11 Jul 2019", "game_name": "Sea of Solitude", "text": "As the beast folds away its wings and plunges itself into the water, I begin to cry. I've been tracking it for a while now, cutting Kay's narrow boat through the water, but each time I get close it turns its eyes to mine and beats its wings to move away from me. Abandoning the boat - leaping over the silent arms that reach out for Kay from the murky depths - she scrambles across the rooftops, terracotta tiles tinkling in her wake. But it's too late. I know I'm too late. The beast has already disappeared.Meeting this monster and uncovering its harrowing backstory broke me in a way I hadn't quite expected. I felt sick moving through the preceding chapter, piecing together its stark, unornamented message, devastated by the story it was telling but compelled to see it through. It's ugly and it's painful and it's heartbreaking to watch, but it's necessary, too. The events in this twisted parody of a school - if a little contrived - rocked me in a way I'm very rarely rocked, be that via a game or otherwise.If Sea of Solitude had finished here, it could've been a masterpiece. However, this is the game's first encounter with one of the mysterious monsters roaming Kay's watery world, and what could've been a devastating final gut-punch instead set a precedent that the rest of the game couldn't quite match. The impact of each subsequent encounter is instead muddied by the one that preceded it, diluting the potency of the storytelling, and its stunning score and striking visuals are further clouded with clumsy mechanics, uneven voice performances, and inelegant metaphors that strip away the nuance necessary for such potent topics. I'm uncomfortable writing that, by the way. Incredibly so. Sea of Solitude is an intensely personal tale of loneliness and depression, delivered in an intensely personal way, and critiquing it feels like I'm dismissing the creator's own experiences - and who the hell am I to do that? But the trouble with deeply personal stories is that while the context may be universal, the subtext is not. Being stranded in a dark storm on an empty ocean desperately searching for light may feel like an effective visual shorthand for overwhelming loneliness, but other aspects - such as the bastardisation of her watery world and the monstrous caricatures of Kay and those close to her - are less compelling. Add in the awkward dialogue and unambiguous monologues, and you sadly leave little for the player to unpick and ruminate upon themselves. This lack of subtlety is further echoed through Sea of Solitude, too. For instance, following the light in darkness is often - and quite literally - the answer to Kay's troubles. Monstrous manifestations of her self-doubt will - also quite literally - become all-consuming. If she's lost, she can fire a flare to help her orientate herself (a very handy feature given the surprising expanse of this world). If she encounters dark clouds of ~corruption~, she can fire comets of bright light to disperse them. Kay's backpack - often the one splash of colour on an otherwise monochrome screen - is used to capture them, and as the game progresses it'll swell in size, so she's literally and metaphorically carrying the weight of all this darkness around on her shoulders. Mechanically, too, Sea of Solitude is a little uneven. For the most part, Kay is hot-footing it across the rooftops or motoring smoothly over the waves in her small wooden vessel - which is a joy to use, providing you don't inadvertently beach yourself on the roofs and chimneys poking out of the water. Occasionally there'll be more advanced - if not quite challenging - platforming, and gentle puzzling, too. All the while Kay is pursued by a number of dark, desperate beasts, some of which can chomp her up if she dawdles too long in the water, while others will hurl insults her way, trying - often successfully - to weaken her resolve. It's a template firmly established early on and one the game rarely detracts from, making the remainder of the experience disappointingly predictable. The aforementioned school level includes unique enemies that require a little strategic thinking, but the combat is a cumbersome affair that nullifies the tension so ably sculpted by the storytelling (it's to the game's credit, however, that these antagonists can be rebuked with light rather than traditional violence).There are collectables, too, by way of message-in-a-bottles that are secreted around the world, small notes that add welcome flavouring to Kay's story. There's no way to track them, though, so completionists may have a hard time finishing up. You can also ~shoo~ away seagulls, but it's a strangely robotic challenge that feels very ~gamey~ in an experience striving to be so much more than that. And no matter how Kay's feeling, or at what point of the story you encounter your feathered friends, she sounds disconcertingly - even jarringly - perky whenever she encounters one. It's a beautiful place, though, this flooded world. Whilst self-contained, the areas you can explore are exposed or submerged at the mercy of the tide, which means you'll frequently find yourself revisiting areas with a wholly fresh, and welcome, perspective. When the sun shines and the buoys tinkle and the gulls squawk overhead, pottering across the sun-soaked tiles or motoring along the azure sea is just as delightfully tranquil as it sounds. When the sky blackens, however, and the lightning crackles and the thunder rumbles, Kay's intense pain and loneliness are palpable, and the see-sawing transition between the light and darkness - which symbolise Kay's joy and despair - is masterfully done.However, it feels as though these plentiful allegories and metaphors are too explicit. Yes, they deliver a melancholic story of unhappiness in a direct and unambiguous way, but without ambiguity, there's no room for personal interpretation or self-discovery for the player, either, particularly given its truncated run-time. Despite all that, Sea of Solitude's weaknesses are outweighed by its admirable ambition and powerful message that - just about - make it a journey still worth taking."}