{"ref": "https://www.eurogamer.net/silent-hunter-5-review", "date": "10 Mar 2010", "game_name": "Silent Hunter 5", "text": "As usual for this World War II u-boat sim series, your first task in Silent Hunter 5 is going into the options and filling out a long checkbox questionnaire while the game holds a protractor and set square up to your masculinity.~Realistic repair times?~ Check. ~Limited compressed air?~ Check. ~Manual targeting?~ Uh, maybe not. ~No external view?~ Check. Meanwhile the game updates a judgemental ~realism~ percentage at the bottom of the screen. Once again a ~Sexual tension as men rub past one another in corridors~ checkbox is conspicuous by its absence, and once again I ended up with a history-tastic 70 per cent.I also began to get excited. Again. I really do like this series. For anyone who hasn't played them, Silent Hunter games are capable of great things. Riffing off the fact that subs in World War II often acted as independent vessels, Silent Hunter gives you your own ship with your own crew and your own mission, and in simply allowing you to prowl the oceans like some phallic sea monster it ends up providing both incredible freedom and an overwhelmingly atmospheric vision of what life was like for all those sailors in WWII.Which is to say life was basically the worst thing. The only thing more horrible than successfully torpedoing four ships and watching them catch fire and sink out in the freezing, inky wetness a thousand miles from anywhere is being on the other side of that coin, in a hunted sub.The Silent Hunter games have always excelled at this. You get to wield this awesome power and send 20,000 tons of cargo to the bottom of the ocean with each successful torpedo salvo, but there's also the terror of being sighted, of the emergency dive, of your crew whispering to one another so the enemy hydrophones don't pick you up. And then that haunting conclusion: the depth charges, the flickering lighting, the spraying valves, the God-groan of your penile vessel being warped by unknowable pressure.This has always been an unforgiving series. But what I didn't know, clicking through those realism checkboxes in Silent Hunter 5, is that this game comes with way more little difficulties than the ones you can chose. Silent Hunter 3 was a buggy game at release, Silent Hunter 4 more so. But this is something else. I cannot believe they shouldered this game out the door.Let's start with it being a chubby system hog. This is the first game I've seen my 2.4GHz quad-core with 6GB RAM and a Radeon X1900 struggle with, even on reasonable settings. Running the game at the high speeds required to travel large distances, the frame-rate often falls into unbearable choppiness. So, a taxing simulation of the North Sea in more ways than one.Another early problem is the game's tutorial, or lack of one. The way the game starts you off as a First Officer doing a Captain's bidding is the smartest introduction this series has ever had, so it's a bit surprising when your schoolin' ends after the game's done nothing but make you fire some torpedoes at stationary merchant vessels and dock in a port. Nothing on emergency manoeuvres, your deck guns, hunting tactics, logistics or your crew, and don't think you'll learn any of this stuff in the manual, which is a flimsy bare cupboard of a thing."}