{"ref": "https://www.eurogamer.net/yakuza-3-european-review", "date": "9 Mar 2010", "game_name": "Yakuza 3", "text": "Given that it has the lowest petty crime statistics in the civilised world, Japan's portrayal in the Yakuza series, as a thug-infested cesspool of extreme physical violence, certainly provides an amusing contrast from the endlessly polite reality. Perhaps the whole of Japanese society is secretly fantasising about stoving each other's faces in with bicycles. It would explain a lot.Even the gentlest stroll down a local Okinawan highway almost always ends up with lead protagonist Kiryu Kazuma being set upon by puffy-jacketed gang members eager to acquaint him with their fists. Any excuse for aggro is considered fair game, but more often than not it's simply because they want to mess him up. Back on his old Yakuza turf you could understand the incessant hostility, but the life of the former 4th chairman of the Tojo clan has turned around somewhat dramatically. A few years on from the chaotic events of Yakuza 2 we find the sculpted man-machine holed up in the idyllic surrounds of a distant beachside orphanage, chopping onions and dispensing sage-like advice to 10-year-olds.But wearisome problems are never that far away from Kiryu, even when he elects to decamp to the most remote part of Japan. Sure enough, trouble finds him when it transpires that frowning men in suits want to knock down the orphanage and build a military base and holiday resort where it sits.As ever, the game's endlessly convoluted exposition provides a fine and curiously compelling framework upon which to hang accessible beat-'em-up encounters. For more than 20 hours you'll happily smash an endless supply of goons in the mush in increasingly elaborate fashion, gaining new moves and narrative insight into the bargain. It's a compelling formula, despite or perhaps because of its undemanding simplicity.From the publisher that brought us Streets of Rage, Virtua Fighter and Shenmue, Yakuza is essentially a mashup of all three, which is hardly surprising but does mean it's the stuff of SEGAphile fantasies. Liberally sprinkled with their genius, it's the grateful beneficiary of some of their most satisfying elements, in a context which delivers a uniquely Japanese - and uniquely SEGA - flavour.In its latest incarnation, though, most of the changes are peripheral to the ultra-accessible two-button-mashing violence at its core. Perhaps the most striking improvement comes as a result of the series' belated arrival on a high-definition platform, with the already lavish production values benefitting enormously from its graduation to PS3. From the moment Kiryu strides up the beach with his intricately etched dragon tattoo in full view, it's evidently a game with an eye for detail.Wandering idly through downtown Okinawa (and, later, Tokyo), the heady bustle combines with a convincing atmosphere of enigmatic inscrutability that accompanies any Japanese urban exploration. Between the dense and narrow layout, mysterious shops and market stalls routinely offer an expansive and exhaustive array of items whose sole purpose appears to be to cater to the eccentric whims of OCD gamers.Sampling each and every one contributes to the game's exhausting progression requirements, and it quickly becomes apparent that there are no simple shortcuts. Spending an astonishing 295 minutes watching cut-scenes is but one in a long line of extraordinary completion requirements. More than 20 hours, a completed main quest and countless side missions yielded me less than 10 per cent completion.But if the spirit of the game is to waste as much of your time as possible, then it's just as well that you'll revel in this indulgence. Given how many side quests and mini-games the first two Yakuzas boasted, it shouldn't come as any great surprise to discover even more layered on top, but their presence remains utterly integral to the game's appeal.In addition to the bowling, arcade games, gambling and the UFO catchers that you'll be familiar with from previous editions, Yakuza 3 beefs up the distraction quotient no end. There's golf, karaoke, darts, a batting cage, pool, fishing, fighting tournaments, card games and other incidental tasks, all of which are built into the missions themselves, so there's never any shortage of peripheral amusements to get stuck into whenever the incessant brawling loses its lustre."}