{"ref": "https://www.eurogamer.net/borderlands-the-secret-armory-of-general-knoxx-review", "date": "3 Mar 2010", "game_name": "Borderlands: The Secret Armory of General Knoxx", "text": "There are salt flats, twinkling with the bright bones of fish, left behind by a long-dissipated ocean. There are circling hit squads made up of foxy gymnasts, itching to slide a hot pink katana up your nose. And then, at the centre of it all, there is General Knoxx, a suicidal cold warrior, willing you ever onwards, urging you to close the gap and finish the job.They get downloadable content at Gearbox. It's more than a contractual obligation to this team, more than a wearisome way to keep an old disc in everyone's drive. Many said that the original Borderlands was a little sketchy around the edges; the developer seems to agree. The studio's using the post-release vacuum to provide the mission drops and additional modes that everybody expects from an 800-Microsoft-Point care package, naturally, but it's doing something else, too: turning DLC into a kind of second pass, layering in the detail, and sharpening the focus.So you're back on Pandora. What's changed? Someone wants to kill you, for starters. Someone always has in Borderlands, of course, but this time it's personal. Two minutes into the game's first real mission, and you're knee-deep in back-flipping Crimson Assassins, fronted by Vulcana (I killed her super-quick, incidentally, and I didn't have a pen nearby, so I can't be entirely sure that was her actual name). Vulcana: you were, like, totally hot. I dug the shiny black bodysuit, the sultry voice and the nimble moves. It's too bad I had to set you on fire. Worse still that you didn't have any loot worth pinching afterwards. Oh well. XOXO.The Secret Armory of General Knoxx isn't all about raiding sexy corpses, of course - although, frankly, they had me at hello with that one. Borderland's third DLC instalment is the biggest yet: a decent chunk of adventure, continuing the main story arc as it pitches you into a guerilla war between the invading vanguard of the Atlas Corporation who want to take control of the planet and, on the opposite side, Athena, a rather prickly hottie would really rather that didn't happen.Spearheading Atlas' mission is the General himself, a winning combination of weary one liners and hulking mech suit, and there are plenty of cheery cameos too. (Gearbox has clearly been keeping an eye on which members of its oddball cast has gone down well with the fans, so resident grease monkey Scooter is back in an expanded role, and Moxxi, the sad-eyed china-doll psycho from the Underdome expansion, makes a devastating curtain call.)As a very smart acquaintance of mine pointed out quite recently, the setting of Borderlands is actually pretty interesting: a nasty backwoods planet where the population is forced to rely upon the good favour of a handful of villainous megacorps who import everything of value from off-world. Now it seems that, with the Vault business out of the way, Gearbox is starting to experiment with the universe it's created. The boxed game had a habit of making you feel a little irrelevant at times, and as the assassins on your tail suggest, that's all changed here. Because of what you did at the original game's climax, you're Atlas' number one target now. Finally, after months of levelling, you're allowed to take a central role in events."}