{"ref": "https://www.eurogamer.net/omno-review-a-wonderful-series-of-places-to-visit", "date": "16 Aug 2021", "game_name": "Reviews", "text": "Monday morning I went surfing across a rounded hill of snow, threading a series of large stone hoops together. The hoops were set in the ground, so they resembled arches, and as I moved through each one a light on top of it shone the way towards the next in the sequence. Flap of cloth, rush of wind: the world knew I was there. The final arch lit up a magical panel on a piece of rock - a large piece of rock, I would discover, but it seemed a tiny thing in the distance. I squinted at the rock and saw movement. Getting closer I realised that a mechanism had been triggered, and a strange, invisible force was now picking and placing platforms of stone across the empty air of a nearby chasm, a pathway created for me with the lazy ease of a stranger dealing cards.Lots of people I've spoken to about Omno recently have told me it looks a bit like Journey or those sorts of games. Empty spaces, just you and the environment, sweeping soundtracks and the various distant cries of carefully arranged nature. Epiphany and a decent light show as your reward for hitting your marks and moving forward. When I look at that opening anecdote I've just written about, it even sounds a bit like Journey or those sorts of games. You can surf over the ground, angling between arches. Magical panels and ancient rock!Weirdly, as I actually played Omno, I never thought of those kinds of games at all. What did I think about? Omno is a whispering thrill of a game, a dazed afternoon spread out on the soft green grass beneath a tree. The sun is shining, the wind is playful and pleasant, everything feels rich with a gentle sense of potential. You play a friendly sort of character with a staff in your hand and a head that looks a bit like a bulb of garlic. Over the course of the game, you travel across beautiful lands, solving simple puzzles to progress from one area to the next, reading glyphs and learning more of an enigmatic story, and encountering wildlife large and small. There is no combat. There is no story, if you choose not to engage with it. Just spaces and things to do in them. Marry me!It's beautiful - a very soft kind of beauty. As the environments change, swamps to forests to ice to sand, you get a lovely range of colours guiding your eye, silvers and purples and rich golds. Rocks stick through tufts of grass with their smooth grey surfaces - you can almost feel the sunlight radiating off them. Ancient buildings exist in artful dereliction - a spar of tower, a half-buried staircase. And the animals! Small mushroom things that can sprout to a surprising height, little wasps with lights instead of stingers, balloon people, walking spoons made of celery stuff, three-legged giant dinosaurs. Marry me!Nature is fascinating here, but never frightening. It exists to give you the shining pieces of gems that you collect along your journey, but it also exists just to exist. You can check off the names of the creatures you find, but you'd investigate them even if there was no list, no checking, no completion percentage for each area. Some of the creatures help out with puzzles, but the best are gloriously lacking in obvious utility. One of my favourite moments in Omno came when a camel-type thing - aside: do you know that bats are more closely related to camels than mice? I learnt this last week - bowed its noble head so I could pluck a chunk of something bright from its mouth.All of this existing with that whistle of wind, that flap of cloth, and the slap of tiny footsteps as you move forward. Omno's a platformer, in that you jump and quickly learn to do an air-dash to extend your reach. But it's also a gymnastic puzzler and a very soft tug at the problem-solving brain. It all fits together. Each area you visit asks you to find three glowing orbs, each one a gentle puzzle, in order to open up a final, more elaborate puzzle that guards the gate to the next area where the pattern repeats. And these orbs are puzzles in terms of what to do to get to them - a puzzle that involves looking at the environment, an understanding of your skillset, and a growing sense of the way Omno likes to think.By mid-way you have a handful of abilities, including that dash, and the ability to surf, and float down from on high, and teleport, and you can chain these together to reach distant parts of the environment. This is where Omno really comes into its own for me. Each area offers such freedom! You need three orbs to progress - scattered in hard to reach places, perhaps, or hidden behind a series of relatively tricky moves - but there are more than three orbs in each area, so you have choices. Do you want to do the minimum and move on, or do you want everything? Do you want to set aside the orbs for a bit and just explore, take in the view, test out your surfing abilities and spend time with the animals?In its puzzles, which are often great because of their simplicity, Omno slowly builds a personal grammar - you learn new ways to use abilities, and new ways to think about them. How to get to the orb on a distant rock? How to get to the orb on a distant rock that has no nearby rocks to use as steps? How to get to the orb on a distant rock when a roving light will end your chances if it hits you? As the variations creep in, this becomes one of those priceless games that feels like the designer was actively thinking and making choices even as they built the world around you. There's a sense of the designer's notebook to it, a sense that I get from games like Hohokum and Grow Home.To be left to myself and trusted to explore a beautiful natural world - a world where nature itself is a machine of sorts! The sense of space, and the confidence in a player's ability to take what they want from a game mark this out as something very special. I've finished Omno, but now I want to complete it. I want to see everything - all the animals, all the orbs, all the ideas, all the views. I'm headed back in."}