{"ref": "https://www.eurogamer.net/sonic-and-sega-all-stars-racing-review", "date": "26 Feb 2010", "game_name": "Sonic & Sega All Stars Racing", "text": "Is there any other game that has dominated its field so conclusively and with such tenacity? Super Mario Kart is seventeen years old yet it remains the touchstone and the benchmark for its peculiar subset of the racing genre. Crash Bandicoot came tantalisingly close to taking the plumber's crown in 1999 with Crash Team Racing, but its otherwise been a one horse (and kart) race.What's surprising is that it's taken SEGA so long to offer up its take. Less surprising is the fact that, like so many others, it has produced something that lives almost completely in Nintendo's shadow, copying the Mario Kart template, pasting SEGA stuff over the top and doing almost nothing to move the core ideas forwards.For the elements that are new we can thank Sumo Digital, a developer that understands SEGA racing well thanks to its loving work on the recent OutRun games and also has prior form in the ~all-star~ format following SEGA Superstars Tennis. Unfortunately, the bold ideas here begin and end with one word: drifting.It's perhaps understandable that a SEGA racer would draw inspiration from the recent revival of one of the company's most beloved franchises, but what works in a time attack arcade setting doesn't necessarily fit into the specific niche of kart racing. With the game's focus firmly on how well you can curve around bends sideways, tracks are either incredibly easy or frustratingly hard depending on how well they accommodate this feature.The Sonic-themed stages, for example, are a (passing) breeze thanks to the wide banking curves that allow you to build up loads of boost by gliding gracefully around their elliptical lines. Those based on Super Monkey Ball are pure hatred, full of short right-angled corners that jab awkwardly at handling designed to resist the handbrake turn.Everything else is much as you'd expect. Mario's green shell projectiles are replaced with green boxing gloves, the red shells with red missiles. Traffic cones are dropped instead of banana skins, and the lightning bolt power-up is swapped for character-specific special attacks, granted to players lingering at the rear of the pack. Rev your engine at the right point and you get a starting line boost. Hit the speed pads on the track for another forwards shove. It's all warmly familiar, yet uninspiring.Some rather limp tracks don't help matters. Nearly two decades on, I could probably still draw a map of Koopa Beach or Choco Island's sublime simplicity from memory, yet mere minutes after putting down the joypad on Sonic's effort and I can barely distinguish one overly busy course from another. With 24 to choose from, the ideas get spread too thin and the tracks all tend to favour too many random obstacles over truly ingenious design. Fiery boulders crash on top of you, banana skins spawn under your wheels, gun turrets blast you, giant balloons knock you off course, while robots, crabs and crows all wander into your path, ready to knock you out of pole position.Outside of six Grand Prix tournaments, you can choose from time trials and missions. The former are predictable enough; the latter menu option offers 64 challenges based around the bulging SEGA cast and their various abilities. Fun to begin with, repetition sets in with the missions long before you reach the finale. Chases, battles, checkpoint and knockout races - the majority of them are fairly obvious riffs on the kart racer formula. The ones that do deviate from the norm are, sadly, rather unsuccessful.One pits Virtua Fighter stars Jacky and Akira against a giant House of the Dead zombie in a clumsy and ill-conceived boss fight. Another finds Billy Hatcher riding his Giant Egg trying to squash enemies, but the wandering control makes it an imposition rather than a welcome break. Despite the fumbles, it's an incredibly easy marathon of levels that only starts to pose a challenge after a crude difficulty spike right near the end.Multiplayer doesn't offer much, either. You can play against seven other racers online or with up to four in offline split-screen. Options are slim to the point of anorexia, however. Choose a course, tinker with the basics, then race. Afterwards, it's back to the lobby to choose another track. There's no option to create a tournament drawn from a playlist of the best courses, no battle modes or anything else that takes advantage of the unique and varied wacky racers.What the game does excel at is nostalgic indulgence. For SEGA die-hards, there's inevitable appeal in a game that boasts such surreal sights as Shenmue's Ryo racing across a gigantic roulette wheel against Opa-Opa, the Bonanza Bros and Alex Kidd. You'll have unlocked all the characters and wallowed in enough SEGA branding all too soon however, and what's left is merely a pretty good karting game with a few nice flourishes, a couple of clunky design decisions and a whole garage full of Mario's leftovers."}