{"ref": "https://www.eurogamer.net/starcraft-ii-beta-hands-on", "date": "25 Feb 2010", "game_name": "StarCraft II: Wings Of Liberty", "text": "So there, right at the top of this invisible pyramid I'm gesturing at, are the guys who play StarCraft competitively. Then there are the guys who are really, amazingly, incredibly good at it. Then there are those who are very, very good at it. Then the ones who are good at it. Then there are the ones who are competent at it.Below that, somewhere in the giant mass further down this hierarchy, there's a tiny, microscopic dot that is me, and my current howling great lack of skill at StarCraft. Look pretty pathetic, don't I? Yeah, laugh at me, spit on me, say rude things about my mother.But wait! Below that, there's a yawning expanse of people who are even worse at it. People who just can't click that fast. People who don't play strategy games online. People who don't play strategy games.  I know I could, eventually, become at least capable at StarCraft. Those guys, though? It is, as a man once sang to Rambo, a long road. In its current beta form, StarCraft II isn't what you'd call accessible. It's multiplayer only, with the only available AI so stupefying easy that you'd have a better chance of learning how to be good at this real-time strategy game if you played against a heroin-addled baboon.That clearly won't be the case in the full, final game, but if you're thinking of dropping £300-odd on a beta key from eBay, know that's what you'll be getting. (People are doing that, you know. This is one of those games where the idea of missing out on several months of practice time is many players' worst nightmare.) There has also been talk that the full version will include a raft of training to help ease relative newcomers into the very precise, entirely unforgiving world of StarCraft II multiplayer. Even in its current, go-online-and-get-instawhipped beta form, you can tell there's a brewing helpfulness. The lobby/social networking system of the revised Battle.net, which is built into SCII's bones, is an unbelievably slick construct of information, friend profiles and auto-downloading maps as and when you need them.Blizzard's money, experience and perfectionism have built a robust, beefy online gaming shell that, I don't doubt, every other bugger will soon be aping. It's quite clear it will eventually be filled with resources to ease the traumatic passage from absolute beginner to approximate understanding.Phew, frankly. That's probably the only hope for rank newcomers, apart from a particularly bloody-minded select few breaking into the game. If you've not played much StarCraft online before, you really don't know what you're in for, even if you've played a ton of other strategy games.Most of all, if you've looked at any of the released videos and screenshots of StarCraft II and thought, ~I know exactly what that's going to be like,~ you're wrong. Yes, it's an entirely traditional RTS - you build your base and your army, and then you go box the ears of the other guy. In practice, though, it's exhausting brain-athletics."}