{"ref": "https://www.eurogamer.net/white-knight-chronicles-international-edition-review", "date": "24 Feb 2010", "game_name": "White Knight Chronicles", "text": "In recent years the distinctions that once separated videogame genres have blurred and faded. Is Mass Effect 2 an RPG or a third-person shooter? Is Heavy Rain a point-and-click adventure or a QTE thriller? Puzzle Quest is as much a Tolkien-cliché RPG as it is a match-three puzzler, while Peggle is Pachinko meets NBA Jam meets LSD rainbow unicorns. Blockbuster series such as BioShock and Uncharted are slippery in the hands of genre, borrowing as they do elements and ideas from a broad lineage, while WarioWare and Retro Game Challenge boil down gaming's first principles into a hotchpotch stew that defies easy classification. Systems ooze into systems, enriching one another, and so the old videogame terminology becomes obsolete through promiscuous evolution. Nevertheless, this diversification works best through osmosis, not Frankenstein-style stitching. In the case of White Knight Chronicles, the bolting together of a traditional single-payer JRPG with an MMO-lite multiplayer component is somewhat awkward. The first 20 minutes of the experience are spent designing an avatar who takes at most a secondary role in the main bulk of the adventure, only slipping into the protagonist's shoes when taken online to engage in multiplayer side-questing.Of course, RPGs have always expected their players to assume a transient role controlling a group of characters, but the disconnect between the character you create as your likeness for White Knight Chronicles and the character who drives the narrative forward is a little too jarring for comfort. It's best approached as a game of two halves then, despite the fact that your character's weapons, skills and competence carry back and forth between the two modes, and achievements reached in one area are relevant to the other.As a single-player RPG, White Knight Chronicles continues Level 5's breezy, fairytale approach to the form. As with the company's work on Dark Cloud and Dragon Quest VIII, a grand yet bubbly orchestral soundtrack fills the warm air of some of videogaming's most welcoming vistas. Rolling hills seasoned with flowers in full bloom connect the game's expansive, enchanting towns and cities, and you'll often pause to admire the rickety wagons winding their way along sunset-drenched pathways in between clobbering the local hostile wildlife. It's a sentimental rendition of countryside living, for sure, but no less engaging for it and, for a genre that's perhaps grown too po-faced in recent years, White Knight Chronicles provides a breath of fresh air.The story, too, aims to provide a light-hearted counterpoint to the angst and turmoil of so many recent Final Fantasies, but nevertheless ends up settling into a sort of primary-coloured cliché. You start out as a runner for the local wine merchant Rapacci Wines, on an errand to a local town to fetch a clutch of bottles for a royal festival later that day. Sadly, the scriptwriters' ambition extends further than alcohol deliveries and on your return the castle is stormed and the princess kidnapped, laying the stage for a 30-hour quest that takes you down well-worn narrative pathways. It's a story told in simple language without much flair or character and given voice by some mediocre acting. However, the cut-scenes are directed with competence and some drama, although never quite enough to sustain interest.What will carry you through the course of the adventure is the battle system. Your party of fighters is free to engage any foe encountered in the game world, play switching seamlessly from explorative to combative with the unsheathing of a sword. As in an MMO, you control just one member of the team, issuing offensive and defensive commands when an action gauge fills up. Using the d-pad, you can cycle between 21 fully customizable attacks, spells and combos, all selectable via a neat interface at the bottom of the screen. As characters level up you earn points with which to purchase new moves which can then be slotted into one of the 21 spaces that make up your 'live' repertoire."}