{"ref": "https://www.eurogamer.net/broken-sword-shadow-of-the-templars-directors-cut-iphone-review", "date": "23 Feb 2010", "game_name": "Broken Sword: The Director's Cut", "text": "If you've read much about auteur theory recently, you've probably been reading about how it's a load of bollocks. Films, even at the dimmest end of the spectrum, are collaborative affairs, and they present a vision shaped by many hands, right down to the involvement of the Key Grip, Assistant to Mr Spielberg, and that sinister biffer in the shiny overcoat who arranges an unbroken stream of sexy ladies for the leading man after hours. Videogames are collaborative too, for the most part, and Broken Sword, which is a fairly cinematic sort of game, even opens with movie-style credits - it's a pretty long list, too. That said, if any title feels like it has sponged up the personality of one of its key creators, it's this one. Charles Cecil, co-founder of Revolution Software, is a famously polite and charming character. Self-effacing and mild, he looks a little bit like Tintin, boy reporter, all grown up and finally rid of that dog. True to form, he helped to construct an unusually decent sort of adventure, a gentle chunk of derring-do that is friendly if never bloodless; a game that's urbane, quietly witty, and generally well-behaved. It's a bit like a Tintin adventure all grown up, in other words, although these days audiences are more likely to invoke the gentle spirit of noted Harvard symbologist Dr Robert Langdon. It is, after all, a rag-tag race around Paris' secret chambers with plenty of time put aside to ponder the legacy of the Templars and flirt with hot French women, before you're off again, doing the rounds of the world's occult locations. Speaking of doing the rounds, Broken Sword's covered a fair bit of ground since its release on the PC back in 1996. It's been ported quite a lot, and not always wisely. I even played it on the Game Boy Advance, which, with its wonky interface and frequent bugs, required real fondness and reserves of that famous British spirit that got us all through the Blitz. On the iPhone, however, this weary traveller may have finally found its true home. Broken Sword starts with a bang - or at least it used to before the hour or so of new content came along, meaning that it now starts with a doorbell buzzing and then a bang. It's autumn in Paris, and all manner of luminaries are being offed by clowns and mimes. Business as usual for those laissez-faire continental types? Not quite. There's a conspiracy brewing, and it involves Templar Knights, ancient artefacts, and at least one goat, making a surprise cameo quite near the end. Before you know it, hard-working reporter Nicole Collard and American tourist George Stobbart are both knee deep in a fascinating mystery - Nicole got decked by a street performer, George had a nice little bistro explode in his face. The duo, united only by their completely inexplicable haircuts, are soon prodding about in churches, collecting and combining unlikely objects, and definitely not going to Syria before they've visited Montfaucon sewers, just in case nobody fixed that showstopper bug from the GBA version. (I think somebody has, though.)"}