{"ref": "https://www.eurogamer.net/red-steel-2-hands-on-4", "date": "22 Feb 2010", "game_name": "Red Steel 2", "text": "Jason VandenBerghe is telling me about the time he broke his kneecap.Checking in at well over six foot, fingers wrapped in mysterious silver jewellery, and coming off, for all this world, like a three-way split between Jeff Bridges, Lars Ulrich and the Devil Himself, VandenBerghe clearly isn't a man who does things by half measures. Creative director at Ubisoft's Paris studio, he certainly went all in on his knee, shattering the cap itself into a jagged star formation of splintered bone and severing three tendons during a sprightly tumble on the devious cobblestones of Paris.After surgery, VandenBerghe started walking with a cane. After a barnstorming appearance at E3, he kept carrying that cane even though he doesn't really need it any more. The cane, the satanic hillbilly beard, the mysterious silver - something clicked. Lesson learned: appearances are important.VandenBerghe wouldn't have to wait very long before putting the fruits of his painful education into practice. Do you remember Red Steel? As a first-wave Wii game, it suffered from an unconvincing take on Japanese crime culture filled with much hollow chatterings about honour, before swiftly devolving into a succession of tiny rooms, each holding a single man patiently waiting for their turn to do you an injury with a sword.Like a lot of early wagglers, it muddled along with plenty of interesting ideas regarding the potential of Nintendo's tricksy console, but it never threatened to cross over into the realm of genuine entertainment. It sold relatively decently, but back then it was pretty much Red Steel or Fruit Fall after you'd picked up Zelda. Production values aside, there probably wasn't that much in the decision either way.Red Steel 2, however, makes quite the first impression - and not just because it's gone cel-shaded, a move that is fast becoming the ~checking into a sex clinic~ equivalent for any series that has barrelled its debut title into a tree. Ubisoft's sequel has ditched the contemporary crime world entirely, replacing it instead with a fantastical futuristic weirdoland, sticking you into the dusty boots of a taciturn stranger who is so much of a platinum-grade badass that he sports buckles on his face. You heard me.Beyond the buckles, the murky dives and gleaming penthouses of Tokyo have been swapped out for a bizarre collection of cinematic references. VandenBerghe's team pondered their options and returned to Red Steel's core weapon-set for ideas, deciding that if the katana represented the east and the six-shooter represented the old west, perhaps they could just jumble the two cultures together.~It's shaken, not stirred,~ laughs VandenBerghe. ~Pushing these two elements into the same space only really works if you just throw them in but keep the pieces separate: try to blend things together as one cohesive whole at a deeper level and it just doesn't work. Juxtaposing distinct elements is the key, and it's Reese's Pieces, really: Samurai Cowboy? Weird, but I like it!~"}