{"ref": "https://www.eurogamer.net/ace-attorney-investigations-miles-edgeworth-review", "date": "15 Feb 2010", "game_name": "Ace Attorney Investigations: Miles Edgeworth", "text": "I can't decide which quote to open with. It's one of these three:~No one gets away with committing murder in my office! No one!~~It's gonna r0x0rz so many b0x0rz.~~All you have to do is arrest suspicious person after suspicious person. That's how you eliminate crime from the streets.~Things might be different as Edgeworth takes the helm, but this is unmistakably an Ace Attorney game. It bubbles with joy, a simmering pot of gleeful happiness. The ridiculous world of outlandish characters, crazed enthusiasm and peculiar passion continues, despite this latest game being even more heavily focused on the topic of murder.When we were last with the Ace Attorney series, two years ago, it was to introduce a new lead character, Apollo Justice. After three games starring the adorable defence attorney Phoenix Wright, the fourth game looked as though it would be moving onto new ground.That didn't happen. In fact, the entire game was about Phoenix, poor Apollo just a conduit for us to hear more tales of the blue-suited wunder-lawyer. So when it became clear the fifth game would star Wright's long-time nemesis, prosecution attorney Miles Edgeworth, it was hard to believe things would really change.Things have really changed. This is not a game about Phoenix Wright. In fact, he's barely mentioned. This is absolutely about the red-coated anti-hero, telling five stories that through flashbacks span seven years, in the space of three days. And indeed, most significantly, this is not a game about the lunatic court process that formed the bulk of the rest of the series. In fact, you don't even see a courtroom until the fourth of five chapters, and then not as you might think.Perhaps the most obvious feature change is the shift from first to third-person. To an extent. Miles is represented on the top screen as a small character, moved either with the d-pad or touch-screen, accompanied by whoever might be helping out in that story. This could be the erstwhile Detective Dick Gumshoe, a new daft 17-year-old character, Kay Faraday, or various others who tag alone throughout. So in some respects it's like a traditional point and click - you walk near items to interact with them, walk up to characters to talk to them, and so on.However, much is extremely familiar. Edgeworth sports an Organiser, in which he stores all items of evidence, and profiles of characters involved in each incident. Despite not being in court, he'll constantly be demanding witness and defence testimonies from those he encounters, which are cross-examined in the form of Rebuttals. Here, much as you would in the previous games' courtrooms, you go through statements pressing for more detail, looking for contradictions, and presenting evidence that demonstrates lies or mistakes.Edgeworth also marks a departure from the more ludicrous psychic themes. This is about as down-to-Earth as the series has been, its own particular brand of unrealistic magic appearing in the form of some very silly technology that allows holographic presentations of crime scenes to surround the cast.But beyond that Bones-like nonsense, Edgeworth uses cold hard logic to solve mysteries. In fact, there's a Logic button on the screen. As Edgey finds key evidence or questions they form ideas, which are stored in his Logic memory, and can then be combined with other ideas to create clues! Woo!Right, mechanics established. Let's focus on the madness.The formula is very much the same as before. There's a murder, and then it's quickly established that somehow either you, or someone you know, is the number one suspect. In fact, in the space of two days Edgeworth is accused of two murders and kidnapped. The sheer volume of accusations made against this man over the years would start to look suspicious to anyone.In fact, there's a more elaborate worry woven by this game. As Edgeworth you fight valiantly to prove the innocence of the incorrectly accused at crime scenes (in theme parks, on planes, even your own office), and gather all the evidence needed to demonstrate the guilt of the clearly incredibly suspicious person you knew had done it all along. This is all suggested to be a precursor for the court cases, Edgeworth working alongside the police in that peculiar way the Ace Attorney games decided they do. Which begs the question: was Edgey always this thorough? And if so, has Phoenix all these years been framing the innocent? Heavens.Two themes recur throughout, each case eventually weaving itself into the larger story. There's the Great Thief, Yatagarasu, legendary for using his stealthy stealing ways to expose corruption in evil corporations. And there's a smuggling ring, which are being investigated by the phenomenally arrogant staff at Interpol. Edgey is caught between the two, getting knocked unconscious more than can be safe for anyone, shouting ~EUREKA!~ as he Deduces information, and being shouted at in hieroglyphs by the peoples of Borgonia."}