{"ref": "https://www.eurogamer.net/blazblue-calamity-trigger-import-review", "date": "12 Feb 2010", "game_name": "BlazBlue: Calamity Trigger", "text": "Back when Guilty Gear X hit the PS2 in 2002, 2D fighting games like Capcom vs. SNK 2 were being overlooked in favour of flashy 3D numbers such as Dead or Alive 3 and Super Smash Bros. Melee. But those who did pick up this quirky curio discovered a fighter with personality in excess. Guilty Gear X had a rich anime presentation, heavy metal music, instant kill moves and a deranged doctor wielding a giant scalpel - all of which combined to set it apart from the output of Capcom and SNK.However, like Guilty Gear before it, Guilty Gear X was far from perfect. Apart from being notoriously unbalanced many found it difficult to get their heads around the game, as it certainly wasn't short on technical mechanics like Dead Angel Attacks, Roman Cancels and Gatling Combos. Despite this many fighter fans loved the extreme pace and depth and as Arc System pilled on the upgrades and sequels, adding new characters and readdressing the balance, Guilty Gear turned into a respected fighting series with a hardcore following.The more recent Battle Fantasia felt like Arc's attempt to break out of the Guilty Gear rut. It cut back on excessive tech in favour of accessibility. But despite being an excellent fighter it felt a tad soulless - almost as if it were trying too hard to play like a Street Fighter game. With BlazBlue, however, Arc System may have cracked it. Unlike Battle Fantasia, it doesn't remove what makes Guilty Gear excellent in the hope of attracting new players. Instead the formula is tailored to better accommodate the new generation along with the existing diehards.BlazBlue is set in a world where humanity once faced annihilation from a creature called the ~Black Beast~ - presumably some sort of intergalactic panther. But when all hope seemed lost six heroes showed up wielding the ancient power of magic. By combining this new power with their own technology mankind was able to construct new weapons called ~Armagus~, and with the help of the six heroes, the beast was slain in what became known as the ~First War of Magic~.In the aftermath, civil war broke-out as different factions fought for control of the Armagus. The Novus Orbis Librarium eventually prevailed as the dominant power. BlazBlue kicks off with a lone man, known as Ragna the Bloodedge, destroying an entire branch of the Librarium singlehanded. Not wishing to lose face the Librarium react by placing the largest bounty ever recorded on Ragna's head. Many strong fighters go in search of this legendary criminal, each with their own personal agenda - be it wealth, glory, justice or power.With 12 fighters to choose from BlazBlue's roster feels fresh, but at the same time highly reminiscent of Guilty Gear. Like Sol Badguy and Ky Kiske before them, the lead protagonists are Ragna and the Librarium's Jin Kisaragi. Also present are scary cat-girl Taokaka, child vampiress Rachel Alucard, Bang Shishigami - a highly vocal ninja who fights with a giant nail strapped to his back - and the impossibly large Iron Tager. Mai and Morrigan fans will also appreciate the gun toting Noel Vermillion and doctor Litchi Faye Ling. Arakune however is perhaps the most interesting inclusion. A clear homage to the No Face monster from Hayao Miyazaki's Spirited Away, his visage is like a mask attached to a giant blob of Marmite. Players tend to either love or hate him.Graphically BlazBlue is quite the stunner. It forgoes the recent trend for 2.5D nonsense and instead opts for hand-drawn 2D sprites and 3D backgrounds. All the characters are highly detailed and noticeably larger than their Guilty Gear brethren. The animation during and between moves is top notch as fighters seamlessly combo from standard attacks into specials. But if we're being picky, this game doesn't quite reach the lofty animation heights set by Street Fighter III: Third Strike. BlazBlue is a four-button fighter and shares a number of mechanics with Guilty Gear. Players get a choice of weak, medium, strong and drive attacks which in most cases can be chained from light to heavy. Every character also has a selection of specials moves, ranging from command throws to projectiles, which can be pulled off with the classic quarter and half-circle motions. It's also interesting to note that BlazBlue doesn't have a single charge character, with Taokaka's ~Trick Edge~ special being the only charge move in the game. So if you religiously play Guile or Balrog (Boxer), and your shotokan fundamentals suck, this could be a rare dealbreaker."}