{"ref": "https://www.eurogamer.net/excitebike-world-rally-review", "date": "9 Feb 2010", "game_name": "Excitebike World Rally", "text": "There's always been a beautiful simplicity to ExciteBike, and Monster's gentle remake hasn't muddled things up very much. One button means ~go fast~, another button means ~go a bit faster~, and that's about all World Rally has to say on the subject of buttons. The game's casually impossible tracks have laps, but no bends to worry about, and while there are other riders strewn across the course, they're obstacles rather than rivals.In single-player, you race against the clock and the clock alone: you learn the placement of the jumps and mud flats, get to grips with a handful of very simple handling systems, and then you just bring it all together across the space of four different Cup runs.Those systems are very simple, too. Using turbo too much will overheat your bike, forcing you to explode rather politely before returning to the race after a brief but extremely annoying time-out. To combat this, you must keep an eye on your temperature gauge as you fly along the track, while remaining on the lookout for cooldown strips painted onto the course itself, which will allow you to chain together long periods of boost if you're sufficiently skilful to hit them all. And while there's no cornering to concern yourself with, you can use the d-pad to shift between the track's four lanes, avoiding patches of dirt that will slow you down, or skimming around other racers and concrete bollards. If you fancy yourself - and really, that's the attitude that ExciteBike expects from you - you can wheelie over both of the latter, by tilting the remote at the last minute. You can also wheelie to get extra lift on each course's many jumps, and follow it up with a perfectly-angled landing to retain your momentum.Having mastered all of these relatively simple ideas, you may soon realise that you've started to play a different game to the one you started out with. Like its older brother, World Rally is about tactics and memory rather than the simple freestyling buzz of rattling around a track, and - odd as it sounds, given that every course is essentially an uninterrupted straight - this is a game with a real racing line, as you get to grips with the placement of obstacles and slowly gain a sense of when to gamble on the wild cards of other riders.As such, the whole thing really comes alive in the gap between beating a track and acing it - between the grades of B and S, to use the ranking system that Monster has imported from its own lovely ExciteTruck. World Rally is charming enough to look at in a chunky, colourful sort of way, and the smattering of local detail as you zip around courses located everywhere from Mexico to Paris are unfailingly pleasant, but the game's main appeal comes with knocking a millisecond off a lap time rather than waiting to see what graphical marvels the design team have in store for you as you head into the Platinum Cup.Multiplayer (online only, which is weird; largely lag free and packed with racers, which is even weirder) fills out the package, with four-player races available for both friends and strangers.Finally there's a track editor, which comes with options to save and share your work. With no-frills obstacle-selection and placement, it's pretty easy to construct horribly unbalanced chunks of racing villainy, filled with sadistic jumps leading into lengthy gravel pits, topped off with a mile or two of uninterrupted bollards. You can probably piece together something a little kinder, too, if you're feeling more emotionally stable. Make no mistake: World Rally's track editor isn't about to make 2010 a landmark year for anyone, but it's nice to have all the same.That's pretty much applicable to the wider experience, really. Like Nintendo's original, ExciteBike: World Rally is simple fun. This is no Trials HD, but it's still great to play as a chummy pass-the-controller game, and nice to have stuck on an SD card for a rainy Sunday afternoon when there are no Columbo re-runs to watch on television. Nostalgic, colourful and modest, this is retro-gaming at its least self-conscious."}