{"ref": "https://www.eurogamer.net/bioshock-2-review", "date": "8 Feb 2010", "game_name": "BioShock 2", "text": "How do you make a sequel to the illusion of choice? However the developers of BioShock 2 chose to approach the production of their watery follow-up, they were destined to begin just as trapped within the framework of its narrative inheritance as the former citizens of Rapture are within their rusting cage at the bottom of the Atlantic. Such was the power and significance of that defining encounter with Andrew Ryan two thirds of the way through the original BioShock.BioShock was very much about Ryan - a philosophical idealist who built a city at the bottom of the ocean to house people ~for whom work is our wage~, where no god or government could find or tax or spite them. BioShock 2 shifts from one extreme to another, exploring the circumstances that drew psychiatrist Sofia Lamb to the city and the role she then played in Ryan's downfall. The two ideologues don't have much in common, but they do both act as catalysts for the events that befall the rest of the cast, of whom you are one, while another is a little girl named Eleanor.Once upon a time, as Ryan's Rapture fell apart in the hands of mere men and women, opportunists like the first game's Frank Fontaine rose to prominence in search of power. Through their endeavours the population became addicted to genetic modifiers called plasmids, developed with help from a substance called ADAM. As the people needed more ADAM to keep on splicing, so the city gave birth to Little Sisters, fever-dreaming girls escorted by lobotomised bodyguards called Big Daddies, who stalked the corridors of the city collecting the drug from those who perished under its influence.BioShock 2 begins as you take control of one of the first Big Daddies, a prototype called Delta, who must find his way across the Rapture of 10 years later in search of Eleanor, the Little Sister to whom he was bonded. Along the way he is taunted by Lamb, who believes he is nothing less than a threat to the future of humanity, and like his predecessor in the first game the people he meets on the way help to explain his past, while your behaviour towards them has the potential to define the future.Once again you are equipped with plasmids and standard weapons, but now you can use both at once, loosing genetic powers with one hand and regular projectiles with the other. You can cycle between alternatives in each category, or pause the action momentarily to change your loadout through quick-to-use radial menus. As a Big Daddy you have access to new weapons, too, including a drill, a magnificent spear gun that pins enemies to walls by their appendages, and a grenade launcher the size of a filing cabinet.You can also gather gene tonics, which continue to act as status modifiers. Collecting and perfecting an appropriate selection of these becomes a compelling balancing act, where you plot to allow for sufficient offensive and defensive capabilities while also enhancing your stocks of consumables, and increasing the speed and safety with which you can hack into Rapture's security systems and vending machines.While the first game crisscrossed the city's bathysphere network in search of impetus, the sequel follows an old train line through other areas. You tour locations occupied by splicers and other horrors, gather tools as instructed by your contacts on the radio, and use a fairly intuitive map system to make sure you are scraping every level thoroughly for consumables, novelties and tape recordings.And, of course, for Little Sisters. You need ADAM yourself to continue splicing, which means liberating the new Little Sisters from their Big Daddy companions. The Daddies ignore you until you attack, and then they ignore everything else until you are dead. The old archetypes return, rushing and shooting and drilling you, supported by a new recruit, the Rumbler, who attacks with a rocket launcher and deploys pesky mobile turrets. Once the fight is over and a Little Sister is liberated, you can choose to harvest her for ADAM immediately, or you can adopt her instead."}