{"ref": "https://www.eurogamer.net/f1-2019-review", "date": "25 Jun 2019", "game_name": "F1 2019", "text": "Let's get straight to business, shall we? F1 2019 is the most authentic F1 game I've played. And yes, I'm old enough to have been around when Geoff Crammond was still doing his thing (Formula One Grand Prix was such an obsession back in the day I'd write a mini-fanzine reporting on each race in-between the full-length Grand Prix I'd run every Sunday), to have manhandled the Ferrari 312 around the original 8.774 mile Spa-Francorchamps circuit in Grand Prix Legends and to have pumped 20p pieces into Namco's Final Lap. And I've followed all of Codemasters' efforts since it acquired the official licence, from the modest beginnings of stopgap offering F1 2009 through to more convincing fare like F1 2013. There have been more than a few blips along the way, but plenty of high points as well - especially in recent years, as the team really began to find its voice. It's a familiar voice, too; the one of the avid enthusiast that tunes in to watch every test session, the one that revels in the details of new turning vanes and bargeboards and how upgraded rear wing elements might impact v-max down the long back straight. The voice of F1 nerds like myself, basically, and to play F1 2019 is to indulge in a shared passion for the sport. This year's entry makes small strides in some areas and large ones in others, though as with the sport itself it's the small details that make the biggest difference. Visuals have been given the slightest of overhauls, though they have a big impact; there's now a perceptible haze that hangs over Bahrain as the desert night sets in, you can more readily read the state of a set of tires by looking at their texture as well as feeling the car slip under your fingers and new lighting gives the whole package a lift. The human character models still look as dreadful as ever, of course, although F1 2019 does manage to make Ferrari boss Mattia Binotto look even more like Harold Lloyd so I'll take that as a positive. The headline addition this year is the inclusion of F2, the feeder series that follows F1 to a number of races on the calendar to provide support and that has, under its various guises, paved the way for the likes of Lewis Hamilton, Charles Leclerc and Lando Norris to make their way to the top flight. And how. The 2018 season is here in its entirety - with 2019's line-up to follow as a free update - as are all the quirks of the formula, with feature races, sprint races and reverse grids all playing a part. Even better - and again, it's those small details that count - Alex Jacques and the excessively, infectiously energetic Davide Valsecchi take on commentary duties for the series. So now F1 2019 is a step closer to being able to claim it simulates every part of the race weekend bar the two hour tailback form the Silverstone car park as everyone heads home. It's wonderful stuff, and the F2 season does wind its way into the career, even if the implementation isn't quite so impressive. There, you have three short races before you're scooted off to F1, and the short section serves more to introduce the story elements that are also new to this year's entry. Ah yes, the story. You might think it's a lift from FIFA's The Journey which just wrapped up in EA Sport's football series, though if you're a little longer in the tooth you'll spot similarities to Codemasters' own TOCA Race Driver from way back in 2002. It's a cute setup, with two rival drivers joining you on your ascent through the ranks. The cutscenes aren't anyway near as awful as I'd feared, and by the end of the short F2 season I was kind of into this new strand of drama that was being woven into the campaign - so it's a shame that, once you hit F1, it fizzles out and never has the impact initially promised. Something else to work on for the future, perhaps, as it feels undercooked as it is. Still, that such a mode could even exist - and that official drivers can now move between teams - would have been unthinkable a few short years ago, and surely some of that is down to the relative freedom Codemasters now has with the licence. Perhaps you can thank Liberty Media, F1's new owners, who've not only enabled that but also worked to make Codemasters game an integral part of F1. Last year's inaugural F1 esports series felt like an extension of the sport itself, thanks to buy-in from the teams and Sky Sports' talent helping with the production, and all that is felt in F1 2019's strong foundations for what's to come. There's uplift, too, for more mortal online players, with the introduction of leagues and weekly events. Still, it's a shame the penalty decisions online are often as unfathomable as the ones that come out of the stewards office at any given F1 GP weekend. A step too far towards authenticity? Maybe, although that same authenticity feels pretty fantastic when out on-track. F1 2019 is exquisite in this area, with a noticeable advance with the handling. Kerbs have more impact on car's behaviour - grab one too greedily as you take an apex and it'll send the car spilling out more readily, while snatched brakes feel that little bit more common, and there's a greater sensation of the tire wall's impact on handling. The overall result is a more holistic feel to the cars, with attacking corners now a pleasingly analogue process of juggling all those different factors. And the racing is just as fine, if not better. At this point in its lifecycle, the F1 series can boast best-in-class AI that puts up a hugely enjoyable fight. Feeding into that is an attention to detail that's just as exacting as elsewhere. Find yourself amid the field spread and you'll be subject to the dirty air of the car you're tracking down, your front washing out under duress as you manage your ERS and look to eke close enough to deploy your DRS - or maybe push for a super hot in-lap and out-lap and attempt the undercut. All of which might be gibberish to the layman, though if you've not played one of Codemasters' F1 games for some time and don't have a deep affinity for the sport, I'd still recommend it, if only to see what racing games can be. F1 2019 has a feature set other racing games would die for - there's evolving tracks, dynamic time and weather, 21 of the world's finest circuits (and some of its dullest too, mind), a selection of exquisite single-seater machinery from past and present, an involved and engaging single-player career mode and multiplayer that's now the foundation for one of the more interesting arms of racing esports. It's so much fun to play - and I haven't even spoken about the depths to be found in developing your car via the skill-tree in single-player, or the host of classic machinery that's lovingly recreated for one-off heritage events - that if you have even a passing interest in the genre you owe yourself to try it out. As an avid F1 fan, I'm ecstatic. So much so, in fact, that halfway through this Sunday's woeful French Grand Prix, while struggling to stay awake, I cut my losses, switched off Sky Sports and switched on the PS4 for some proper action. Authentic? Honestly, F1 2019 is better than the real thing."}