{"ref": "https://www.eurogamer.net/dantes-inferno-review", "date": "3 Feb 2010", "game_name": "Dante's Inferno", "text": "Basing your game on a 14th century poem set in Hell has certain advantages. For starters, you don't have to pay copyright fees or worry about the author of the source material complaining you've bastardised his work. In fact you don't have to worry about anyone complaining as only 27 people in the world have bothered to read the thing, and half of them are lying. But there are risks too. You can't employ many of the most popular action-adventure staples such as guns, cars, aliens, Nazis, wisecracking sidekicks and love interests with buttocks like two basketballs in a pillowcase. You're limited by the types of enemies you can create and the environments they can inhabit. As is the case with any game set in Hell, you risk ending up with one big lava level. So what's a developer to do? Why, find another game with no guns, cars or aliens and rip it off, or so it would seem in the case of Dante's Inferno. In fact, this game has so many similarities to a certain other series it's hard to believe it wasn't originally called Dante's Infernof War. True, you don't play as a muscular bloke in a loincloth who sports a pair of big blades and some swirly red body art. You play as a muscular bloke in chainmail who sports a single big blade and some cross-shaped red body art. You can jump and press other face buttons to perform light and heavy attacks. There are various combos to learn and new ones to unlock as the game progresses, along with magic attacks. Levels mainly involve hacking Hell's minions into little bits but are punctuated with set-pieces, simple puzzles, boss battles and quick-time events. True, you're not out to avenge the death of your beloved family; you're out to rescue the soul of your beloved Beatrice. She bet the devil that Dante wouldn't betray her while out on one of his Crusades, and lost. So now, as Dante, you must battle through the nine circles of Hell - lust, greed, heresy, Ikea on a bank holiday Monday etc. - in a bid to get her back. Guiding you on this journey is the poet Virgil, who uses the same technology employed by Princess Leia to appear as a ribbly blue hologram. He provides basic exposition at regular intervals and if you want to know more about what's going on, pressing R1 encourages him to explain further. All of Virgil's lines are suitably grave and sound like they were written in the 14th century. They were, in fact; his dialogue was lifted directly from the titular poem. Unfortunately the rest of the script wasn't. It's packed with clichés and colloquialisms, and much of the voice acting is so naff that even the decent lines sound rubbish. Take the game's opening scene, in which you must battle none other than Death himself. This is less exciting than it sounds, partly because Death fights with all the speed and power of a sleepy kitten. But also because he spouts things like, ~You dare to defy me, mortal?~ in an American accent. As you prepare to stove his head in for the final time he confirms himself as an utter weed by begging, ~No, wait - please!~ It doesn't feel like you're defeating the terrifying spectre of grim mortality so much as a baddie out of Thundercats. Bosses do get harder to defeat as the game goes on, but not by much, and their dialogue doesn't improve. A few levels on from the Death episode you end up fighting a giant blue woman. It seems more likely her dialogue was cut and pasted from the Big Book of Videogame Clichés than Dante's epic poem. Highlights include: ~You have given up the keys to the kingdom - and for what? The tits of a slave girl!~Tits abound in Dante's Inferno, and not just in the script. The giant blue woman has giant blue tits, complete with independently animated nipples. At one point the nipples burst open and out comes an army of evil babies with scythes for arms. They crawl across the woman's breasts and she uses a giant blue hand to scoop them up and fling them at Dante. Freud would have not so much had a field day as a four-day music festival with six stages and sponsorship by O2."}