{"ref": "https://www.eurogamer.net/medal-of-honor-airborne-review", "date": "3 Feb 2010", "game_name": "Medal of Honor: Airborne", "text": "Today is a good day. Today is a day we don't have to begin a Medal of Honor review with a tired reflection on how there are too many World War II games, on how many Germans we've shot over the years, or on how the series went downhill as soon as the ranks that make up Infinity Ward jumped original developer 2015's ship. No. Today, we'll just get on with telling you how much we really enjoyed Airborne. We're as surprised as anyone.Presumably it's down to critical violence. That is, if you verbally beat EA around the face and neck often enough, they actually pay attention to the feedback people give them. That's certainly the impression you get from playing Medal of Honor: Airborne, because it systematically addresses so many of the niggly flaws that we've all harboured for years. However hardened your cynicism might be for the series - and WWII games in general - Airborne is refreshingly engaging from start to finish.You play Boyd Travers - Private First Class of the US 82nd Airborne Division - or, in other words, a random young chump who's booted out of aircraft for a living and tasked with parachuting into the heart of enemy strongholds to kill men with different hats. You, as Boyd, fight six distinct real-life battles during the latter stages of the war, from Operation Husky in the Sicilian village of Adanti, through mainland Italy along the Amalfi coast, through to a 'D-Day in reverse' mission on the approach to Utah Beach. From there the game takes in other famous battles, including Operation Market Garden in Nijmegen, the epic Operation Varsity in the heart of a war factory, through to the hugely memorable climax in the concrete behemoth of Der Flakturm (the flak tower) - without doubt one of the most intense World War II missions you'll ever play.One of the much-vaunted features is the apparent freedom to 'engage anywhere' from the point where you leave the aircraft. To a certain extent that's true, but obviously within certain parameters. For example, you might have five different objectives marked on your mini-map, and what the game allows you to do is parachute towards any one of those and tackle the tasks at hand in the order of your choosing. Helpfully, there's green smoke billowing to indicate the 'safe zones' to land in, but if you want you can simply land right in the hot spots and take your chances. If you're feeling really brave, you can even kick a Nazi in the chops on your way down. In fact, you get an Achievement unlock for doing just that.What you'll appreciate from the word go is a remarkable sense of freedom - more so than most shooters full-stop, never mind the linear-to-a-fault World War II game. There's an appreciable next generation leap here, with large, open environments to explore, and no more stupid, narrow corridors and artificial walls to restrain your gameplay creativity. If you want to work your way onto a rooftop and snipe at everyone, that's fine. If you prefer a more up-close-and-personal approach and want to go around pistol-whipping and stabbing everyone to death, again, it's your call. Also gone are the horribly scripted enemies who take up the same cover points and provide no real challenge. In Airborne, you'll soon appreciate that AI behaviour is refreshingly dynamic, and more than capable of running rings around you if you're not smart enough to second-guess their intentions.For example, it's relatively rare to see them just blundering like lemmings out into the open, like so many so-called cinematic WWII games. These guys know how to make good use of cover points, running between them and waiting for the right time to fire back. They certainly have a decent grenade-throwing arm too, and constantly flush you out from your own hidey-holes in a way that's delightfully reminiscent of the AI in the original Half-Life. Thankfully the default normal difficulty doesn't stray too far into the realms of uber-realism, and hits that accessible mid-point between fun and credibility square on the nose. Simply the way the AI is rated in terms of their abilities (visible on the game's loading screen prior to the level) gives you a clue to the kind of challenge you'll face. Needless to say, at the start of the game it's fairly forgiving, but by the time you hit the latter half of the campaign, you'll know you're in for a fight.Another part of the game that has been buffed-up considerably is how Airborne deals with weapons. Rather than just boringly give you a standard load-out of Axis and Allied weaponry to choose from, the game actually tracks how much you're using a specific firearm and automatically rewards you with three tiers of upgrades as you go along. Say, for example, you really wanted to prove your worth with the various pistols in the game, you'd eventually find those weapons becoming more useful. A scope might be added, or you might be able to reload quicker or benefit from reduced recoil. Although you might argue it's not especially realistic, it's not outside the bounds of credibility, yet gives an added incentive to try things differently, and play around with various weapons throughout the game to see what the upgrades are like. In addition, it adds an even greater degree of variety by effectively tripling the amount of weapons available in the game, with the ability to remove upgrades as you see fit. In a sense, EA has massively improved an area that has been neglected ever since it created the sub-genre, and leaves the competition with work to do to improve on this excellent new system."}