{"ref": "https://www.eurogamer.net/bloodstained-ritual-of-the-night-review-a-perfect-blend-of-contemporary-design-with-old-school-mechanics", "date": "24 Jun 2019", "game_name": "Bloodstained: Ritual of the Night", "text": "The term 'spiritual successor' is bandied about a lot. It's a double-edged term, really, one that not only enables a new game to piggyback onto an already-established, popular franchise but also imbues it with palpable - and occasionally unobtainable - expectation. That was my fear, at least initially, with Bloodstained: Ritual of the Night. A Castlevania game in all but name, it burst onto Kickstarter as one of crowdfunding's most notable and successful campaigns, but with every delay and every change, it felt as though the dream of creator Koji Igarashi was fading. Fans began to worry. Is Bloodstained: Ritual of the Night just another Kickstarter failure?Whilst, admittedly, it lacks a last-minute coat of perfecting polish, Bloodstained is a delightful traditional 2D platformer stuffed with charm, humour, and astonishing attention to detail. Offering a meaty campaign, multiple endings and numerous side quests and collectables, Bloodstained is a perfect blend of contemporary design with old-school mechanics. You play as Miriam, a young woman who nodded off into a ten-year nap that fortuitously prevented her grisly sacrifice. On waking up a decade later she finds all but one of her fellow Shardbinders, Gebel, have been slain, and while the crystals embedded into her skin (ouch) permit her to harness the powers of demonic entities, Gebel has seemingly absorbed one too many and gone full rogue, unleashing hell in the process. Literally. It's outlandish and a little nonsensical, granted, but as you might expect from the mind behind Castlevania: Symphony of the Night, Bloodstained: Ritual of the Night is a delicious slice of 'IGA-vania', stuffed with highly creative enemies, thoughtful, satisfying combat, and a host of collectables and secrets set against a stunning score and gorgeous gothic environments.While it's tempting to ignore the backdrops of a 2D-platformer - particularly when your eyes are often focussed on the foreground - Bloodstained offers a wide range of beautiful, creative set-pieces. Matched with an impressive stream of highly unique and memorable enemies, ranging from the truly horrifying to the horrifying hilarious (giant-unicorn-cat-thing, I'm looking at you), each area feels as though it's been crafted with care and precision. The score, visuals, and enemy design complement each other, all painstaking stitches in Bloodstain's engaging tapestry that entices exploration, tempting you to press ever onwards in search of the next enemy, the next chest, the next secret wall, and the next level up reward.For all of Bloodstained's careful combos and weighty weaponry, however, it's the otherworldly shards that wrangle and personalise the combat I enjoy most. Dropped as Miriam defeats a certain number of particular foes, she'll adopt their demonic powers into the colourful crystals peppered across her skin. If you have a tendency to run in all-guns (or swords or whips and so on) blazin', you might find adopting a defensive shard - perhaps one that fortifies Miriam with a protective poltergeist shield - works best. For those preferring long-range tactics, however, you can fire off a bouncing bullet of water towards your foes, send a shock wave to unsteady them, or walk with a sword-bearing familiar who can fight alongside you. While some are ~conjure~ shards which enable you to summon an offensive or defensive support, others can be employed passively, or used directionally, such as the Flame Cannon or True Arrow. They're exceptional devices that add a thrilling layer to an already accomplished combat scheme. The more she carries with her, however, the more Miriam stands to compromise herself as the powers bind to the crystals she, as a Shardbinder, possesses, chipping away at her humanity. As the potency of the shards increases with every duplicate she carries, it's always difficult to decide what to do for the best - keep the shard and amplify her power, or trade them in to keep Miriam safe.There's also a healthy RPG menu system stuffed with tweakable stats, items, clothing, weapons, and loot drops with dizzying abundance to tempt frequent experimentation. Each time you amend Miriam's armour and accessories the changes are reflected on-screen, and Todd - a demon cursed with the power to be a hairdresser, you can frequently update not just her clothing but her hairstyle, skin tone, eye colour, and more.Crafting, too, is available, but the overwhelming options aren't integral to your progress, so if it all looks a little too much of a faff, you can instead sell or trade your crafting items and ingredients; most of what you need should drop organically as you play anyway.Sadly, it's not perfect. Bloodstained: Ritual of the Night is littered with unfortunate typos and mistakes and the odd audio glitch. Occasionally the frenzied on-screen action will slow to a chug, too, and a lack of scripted battle cries means you'll tire pretty early on of the hearing the same exclamations over and over again. Whilst I didn't experience the troublesome bug that prevented progress for some players on console, I did have a number of head-bashing moments courtesy of a couple of opaque puzzles and missing items, but it's to the game's credit that these issues are only made more obvious by its otherwise flawless presentation. And while your base of operations-esque hub lacks meaningful purpose - not to mention variety - thankfully these side quests don't muscle in unacceptably on the action of the main campaign.Though traditional in many respects - including its manual, and occasionally laborious save mechanic - Bloodstained comes with some contemporary twists such as its helpful fast-travel system, and its more forgiving gameplay makes it accessible in ways other present-day Metroidvanias aren't. Admittedly, there's no easy mode for complete beginners, but normal mode is surprisingly forgiving, intimating perhaps that players familiar with this kind of hack 'n' slash combat might prefer to start with the challenge of Nightmare mode from the off. I'll say it again: Bloodstained: Ritual of the Night is a Castlevania game in all but name, and in some ways, it's a little sad it's not an official sequel that sits proudly in Castlevania's long and storied history. Its last major instalment - Lord of Shadows 2 - released way back in 2014, and met a mixed reception chiefly due to a lack of identity and the absence of the very gameplay mechanics we associate with the series today. Bloodstained, on the other hand, embodies everything we love and more. It took more time to get here than we'd originally expected, granted, but Igarashi sure did deliver in the end."}