{"ref": "https://www.eurogamer.net/mass-effect-2-review", "date": "26 Jan 2010", "game_name": "Mass Effect 2", "text": "For games that are so obsessed with their own fake histories that their creators often commission novels to promote them, RPGs are curiously happy to ignore their real-life predecessors. Fable II takes place in the same world as Fable, but only notionally. Fallout 3 was inspired by its ancestors, but made its own radical way. And virtually everything Square has made since 1997 has Final Fantasy stamped on it, but the majority of the games wouldn't recognise one another at a family picnic.Mass Effect 2 is meant to be different. For a start it is neither beginning nor end - it's the second instalment in a trilogy of releases cataloguing the antics of humans and their alien friends in space, in a future dogged by myth, politics and a suspiciously readymade transport network. But more importantly it is designed to allow for choices that may have already been made by the player in the first game, and to bequeath several years' worth of possible decisions to a future sequel.The game begins shortly after its predecessor. Commander Shepard and friends have vanquished Saren and his master, and are rumbling around the galaxy trying to wipe out any remaining Geth robots. All of a sudden a massive, unknown alien ship assaults them. The attack plunges you, as Shepard, into a fiery playable prologue in the heart of a disintegrating spaceship, introducing or reintroducing basic movement and conversation skills in violent and eye-catching circumstances.Within seconds there are moments of beauty and class to match the high tension. Emerging from the fury of flames and collapsing walls of your ship into the eerie peace and quiet of a pocket of vacuum, exposed to the stars through the wrenched struts of the superstructure and watching loosed seats drift away as you brush past them, is a deft and startling juxtaposition. BioWare has criticised Japanese RPGs in recent months for being stuck in their ways, but it's nice to see that the developer has now mastered one of their strengths: the explosive opening.Events then shift to two years later as Shepard is compelled to join with Cerberus, an organisation run by President Bartlett off of the West Wing (who is still smoking). Shepard is to seek out vanishing human colonists, but with his old colleagues now scattered around the galaxy, many with new priorities, first he must assemble a team. This is familiar BioWare territory, of course, expanding out from a linear first hour to send you across the universe in a new ship recruiting new personnel, and as is always the case, almost nobody you seek is as they seem, and circumstances rarely match those described to you by Bartlett - sorry, the Illusive Man. Instead, they become more elaborate and intriguing.For instance, early on you visit a ship called Purgatory to locate a rogue biotic (a wizard of the future, newcomers), and while it begins as a simple prisoner exchange, you get more than you expected by the end, and perhaps more than you can handle. Later on you visit the space station Omega and mislead local mercenaries in order to track down the alien they are gunning for, only to encounter somebody you did not expect along the way. Even later, you recruit a powerful biotic who is on the hunt for a dangerous relative, and must employ a bit of detective work to bring them together, before ultimately being called upon to make a startling choice at the peak of their reunion.While your crew will come to be stocked by mostly new faces, the game isn't coy about thrusting old friends and enemies back to the fore and showing you how the past two years have affected them, nor about allowing some of them to disappoint you. If you played the first game, your decisions will be evident, and those who explored the troubled but adorable fringe worlds of the first Mass Effect thoroughly will spot more than a few familiar names and faces in different roles, almost any of which would be a shame to spoil.Players both old and new will devour the same content with comparable relish, however. For newcomers Mass Effect 2 gently constructs elements of your back-story in one of its initial scenes in order to compensate for the lack of a save-game to import, although the game makes certain decisions for you in a manner that fits the story most naturally, allowing for outcomes that might be deemed more valuable, like potential romantic entanglements. And while old characters inevitably need less introduction than new ones, they are handled in a way that should retain a new player's interest rather than excluding them."}