{"ref": "https://www.eurogamer.net/xbox-indie-games-roundup-review", "date": "22 Jan 2010", "game_name": "Reviews", "text": "The Xbox Live Indie Games channel is now over a year old, and more than 700 games have made their nests amongst its nurturing branches. While it would be nice to say that the service has blossomed over time, that wouldn't be entirely accurate. The good stuff is arguably better than ever, but there's still an awful lot of pointless dross clogging up the shop window with joypad massages and other daft widgets.There's still a lack of the sort of truly innovative games that sum up the homebrew ethos - the Canabalts, Darwinias and Samorosts - with most indie devs still preferring to trial their wares as Flash games on websites rather than making use of Mr Microsoft's indoor market hall. Of course, when even the best-selling Indie Games are apparently only shifting a thousand copies or less, you can hardly blame them.That's not to say that gems can't still be found among the swill, however. Since it's been a long time since Eurogamer cast a critical eye over the Indie Games selection, consider this a roundup not only of the more interesting new additions, but the cream of the crop from last year as well.A mixture of tower defence and fast-paced shooter, at least according to the pre-download teaser text, Abaddon can't be faulted for lack of ambition. The basic aim is to protect your mothership - Abaddon - by flying around it in one of several infinite-spawning clone fighters, blasting incoming enemies. Each enemy destroyed drops green plasma currency, which can then be used to upgrade and repair the armaments on Abaddon itself. There are four game modes, with goals ranging from survival to intercepting enemy transporters.It's an impressive achievement, technically speaking. Control is fast and responsive, and while the visuals still have a homebrew edge, it's far in advance of most of the Indie Games it rubs shoulders with. It even boasts co-op play.It's also packed with ideas, often to the game's detriment. Rather than concentrating on a few key gameplay features and honing them to razor-sharp perfection, it just keeps throwing things at you until it becomes more than a little overwhelming. Simply upgrading the Abaddon while blasting the bad guys and collecting currency is a hectic juggling act, but when you factor in unlockable ships with their own unique abilities plus power orbs that can be collected, combined and swapped, it's just too much info to digest.The problem isn't helped by the fact that new elements are not always intuitively presented. The control map is a little odd and even basic option-navigation feels distractingly obtuse, with menus nested within menus, each selected with a different stick.It all feels like a game where new bits were added as ideas came along, until the original core concept was groaning under the weight. While praise is due for actually managing to implement so many additional concepts while most of its rivals struggle to master the basics, a little more focus would have made the premium price point easier to swallow.6/10"}