{"ref": "https://www.eurogamer.net/napoleon-total-war-hands-on", "date": "15 Jan 2010", "game_name": "Napoleon: Total War", "text": "Empire: Total War was sloppy. Can we reach a consensus here? Even anyone who loved it - and for all its flaws we loved it enough to give it 9/10 - would admit its bugs were ~a shame~, the combat pathfinding ~temperamental~, the AI ~distracted~, the tutorials ~lightweight~ and its manual ~environmentally considerate~. It wasn't quite all style and no substance, but perhaps all style and a gelatinous, gloopy substance that you have to cut out if it gets in your hair.Worse, a lot of people who bought Empire ended up waiting for a heroic patching that took seven months to arrive, though Creative Assembly did manage to release their Elite Units of the West paid DLC in the interim. Anything else? Well, CA originally blamed the delay in Empire's release on implementing the framework for full campaign multiplayer, something that's only recently taken the form of a one-versus-one beta release.At this point, the developer has three options: to pretend nothing's wrong and carry on making Total War games, gradually grinding its series into the ground (c.f. Tony Hawk); to pretend Empire never happened and reboot the licence, this time with more of a mind to quality assurance (c.f. Final Fantasy VIII); or to not pretend anything, but take a good, hard look at what's broke, man up and fix it (c.f. the Halo 2 180).Napoleon: Total War is option three. Befitting the terrifying Frenchman of its name, it's organised, slick and in control. The engine's not just prettier, but smoother. The tutorials flow nicely and leave you more confident and informed. And while there are missing assets in the preview code, I couldn't find a bug. Right now Napoleon plays like the game Empire should have been, and the manic polishing doesn't end at simply fixing Empire's problems. Aside from a tutorial that inexplicably sees a young Napoleon constructing cannon foundries on his way to school, Napoleon: Total War boasts three campaigns. The first has you slipping into the shiny shoes of Napoleon on his first major posting, commanding the French Armée d'Italie in Northern Italy. Though none of your superiors is expecting anything of you, your objective is Napoleon's own: to conquer a 'road' of provinces that will allow the French to invade straight into the heart of hated Austria.The second campaign, which pulls the scale of the map back a bit, follows Napoleon's quest to conquer Egypt in 1798. Then finally you have The Mastery of Europe campaign, where as Emperor Napoleon Bonaparte you get the chance to swing the massive resources of France around Europe like a ball and chain, or you can take the role of a smaller power trying to bring Napoleon down.All this is in addition to 355 new Napoleonic-era units, new buildings and technologies, a selection of scenarios recreating the Emperor's most famous battles and an unspecified range of multiplayer modes, though judging by Creative Assembly's smiling silence it seems online campaigns won't be one of them. (Update: Wrong! Creative Assembly has been in touch to say that online campaigns will be included, with an announcement due soon.)It's a nicer structure than Empire ever had. The Italian campaign informs you about land battles and region management without overwhelming you, the Egyptian campaign (presumably) introduces naval battles and blockades, and once you've mastered all of this you get the trade and complex politics of a full European theatre."}