{"ref": "https://www.eurogamer.net/starship-patrol-review", "date": "14 Jan 2010", "game_name": "Starship Patrol", "text": "Despite serving downloadable content since 1995 with the Satellaview, Nintendo still hasn't got a handle on how to best present and promote games that don't come in boxes. Nowhere is this more apparent than in the curious scrubland of DSiWare, the company's digital distribution platform for the latest iteration of its ubiquitous handheld.In addition to the confusion that comes from the service's region-specific stores (which last week resulted in Q-Games' Dylan Cuthbert finding out his game Reflect Missile had gone on sale in America via Twitter) Nintendo's promotion of titles on the service is negligible, leaving gamers in the dark as to which games are arriving when, or why indeed they should care when they do turn up. Despite this, or rather because of it, there's a thrill to be found in panning for gold amongst the digital dross, one heightened when you do discover treasure.Starship Patrol is treasure, a jewel of a game obscured by the plain rocks that surround it. Q-Games' second title for DSiWare, it forms an excellent companion piece to Reflect Missile, once again trimming away the superfluous fat of its influences while assuming an understated, minimalist aesthetic to deliver an elegant, engaging package. This time the developer takes on the divisive fixed-path Tower Defence form, in which you use funds to place fixed turrets onto a game board and then watch as your arrangement fends off wave after wave of enemy attackers.Despite the intergalactic back-story, the game's visuals are plain and star-less, presenting pencil sketchpad approximations of hulking spaceships as viewed from above, like colouring-in book architectural plans. The utilitarian effect is heightened by the stark backgrounds, which backdrop the action with uniformly gridded rows, like maths paper pulled from an exercise book. The grey and white lines are interrupted by only the most restrained splashes of pastel colour in the HUD and attacking ships, and yet the understated approach manages to be both contemporary and stylish despite its obvious thriftiness.Mechanically, this is a fairly orthodox Tower Defence game. Stages present a number of ships to defend, each with a series of attach points onto which you can bolt weapon turrets using the limited funds you have at your disposal. Enemy attackers then plot Galaxian-esque paths around your ships, taking potshots while being auto-attacked by your gun placements. When defeated, enemy planes explode in confetti of energy tokens, which must be collected to fund further development of your defences. Certain enemies are only susceptible to certain forms of attack, so you must be mindful of what sort of attacker is coming next (viewable on the top screen of the DS) when planning your purchases.Upgrade tokens periodically float down from the top screen and these can be dragged and dropped onto your turrets to improve fire rate, power or range. Which attribute you apply depends entirely on the exact moment at which you drop the power-up onto the turret, as they cycle automatically between the three options, a slightly irritating system as it brings with it some imprecision to the decision making. Additionally, each turret can be angled to focus on a particular area of the screen, ensuring that you have a pleasing amount of control and customisability over your defenses."}