{"ref": "https://www.eurogamer.net/matt-hazard-blood-bath-and-beyond-review", "date": "11 Jan 2010", "game_name": "Matt Hazard: Blood Bath and Beyond", "text": "So much for The Future. It's 2010 and there are still no monorails, not to mention all the other stuff we were promised. Where are the hoverboards? What happened to robot butlers? Why don't we spend our leisure time drinking dry ice cocktails, eating burgers in pill form and playing holographic chess? And why are game developers still making 2D side-scrolling shooters?Perhaps because their attempts at new-fangled third-person shooters fall flat, as did Vicious Cycle's  Eat Lead: The Return of Matt Hazard. You can read our review for the full lowdown but if you can't be bothered here's a summary: ~boring~, ~feeble~, ~horribly low-rent~, ~relentlessly dull and repetitive~, ~a howling misfire~, ~3/10~. The opening cut-scene of Matt Hazard: Blood Bath and Beyond acknowledges that the first game didn't do so well. Except it's not a cut-scene at all but a text conversation between two still images, which takes place at the bottom of a blank black screen. ~Why are we using text? Didn't we have big-name voice actors last time?~ says Matt Hazard. ~Budget cuts, bad reviews...~ replies his boss. Just to emphasise the point, another piece of text informs us this game is set ~six months after the release of Eat Lead (now available in bargain bins near you...)~This sets the tone for the rest of the game, which like its predecessor attempts to parody games and gaming. Matt Hazard is a muscly, shaven-headed action hero who has appeared in dozens of games over the years, we're told. His nemesis, General Neutronov, is attempting to delete Matt's 8-bit iteration from the archives, erasing all future versions in the process. Your mission is to stop Neutronov by playing through eight side-scrolling 2D levels, shooting everyone you meet and defeating some tedious bosses along the way.  There are no new ideas here. You wander along linear paths, shooting enemies, lobbing grenades, dodging bullets and doing the odd jump. Puzzles never get more sophisticated than shooting a flashing red switch to open a door. Taking cover amounts to crouching behind a wooden crate. Enemies randomly drop health packs and various weapon upgrades so you get to play with machine guns, rocket launchers, flamethrowers and the like. When Matt's 'Hazard meter' is full, you can press a button to make him invincible and increase his firepower for a limited time. It's like the last 15 years never happened.BBandB tries to get away with being such a generic, unimaginative game by giving it all ironic. We're supposed to overlook the fact we've played this a thousand times before because we're too busy being entertained by all the hilarious in-jokes and clever references. The problem is, the in-jokes aren't hilarious and the references aren't that clever. Oh look, this rooftop level is all white buildings, yellow beams, blue doors and red railings, just like Mirror's Edge. So what? And why does the level also have a Canadian theme, when Mirror's Edge was neither set nor developed there? Was it just an excuse to make all the enemies camp Mounties? And didn't we all stop laughing at the fact Canadians say ~aboot~ back in 1997?"}