{"ref": "https://www.eurogamer.net/mag-hands-on-1-0", "date": "8 Jan 2010", "game_name": "MAG (Massive Action Game)", "text": "First-party exclusives are polarising beasts by nature, but Zipper Interactive's ambitious MMOFPS will likely prove more divisive than most. Some will dive in and find a game of uncommon depth and freedom, a richly designed long-term commitment that doesn't just recreate the boom-bang-a-bang of large-scale military conflict, but fosters the loyalty and fraternal co-dependence that holds armies together as well. Others, however, may find its epic 256-man battles too hardcore. To paraphrase Obi-Wan, both will be right. From a certain point of view.This isn't to say that the quality of the game is in doubt. On the basis of the open beta, which runs until Monday 11th January, Zipper Interactive has created a muscular and intuitive shooter. Where other serious-minded soldier sims bury their nuances under elitist acronyms and arcane structures, everything about MAG is immediate, obvious and inviting.It not only looks like a mainstream deathmatch-driven FPS, it feels like one too. Maps are varied without feeling artificial, and if you're getting pounded from one direction there are always other routes. Natural cover is abundant, and while it would be useful to be able to enter the decoratively mangled buildings for sniping or defensive purposes, it's not essential.Nor do you feel the absence of vehicles. This is close-quarters troop-based combat - objectives and spawn points are close enough to get back into the fray within seconds - so adding wheels into the equation wouldn't add much (although the retail game will make some use of them). Movement is fast, if a little floaty for a game with such a weighty military style, and control is slick and arcadey. There are some minor balancing issues, with players pulling off instant headshots with heavy machine guns from 300ft or lobbing grenades superhuman distances, but on the whole it has a wonderful pick-up-and-play simplicity. Two modes are available in the beta. Sabotage pits platoons of 32 players, divided into four eight-man squads, against each other in a battle to control two key installations. Domination, unlocked once you acquire enough XP to reach level 10, is the main attraction, throwing the full 256 players into battle with eight targets to fight over at the start.Skirmishes are small and traditional in both scale and structure to start off. You'll be part of a small force focused on one of the targets. Nearby, other members of your faction will be doing the same. Once the battle conditions have been met - usually with the attackers seizing control of all the targets at the same time - then the conflict evolves and the targets are fewer, so more players are pitched in together.The pace of the game does tug the action towards a typical run-and-gun approach in these initial battles, however, as opposed to the methodical militarism of ArmA and its kin, which may lead players astray. As players dash from spawn point to flashpoint, cracking off headshots, lobbing grenades and performing physically unlikely acrobatic leaps, there's little to illustrate the more sober teamwork-driven strategy that the game truly requires. The hype about the number of players in the game also means that the lack of vast, crowded battlefields may be jarring.But if you can make your peace with the game's occasionally ambiguous place on the sliding scale of FPS play, then something genuinely thrilling remains: the speed and action of a Modern Warfare, but with the scope and depth of a SOCOM. It's hard not to be excited by that prospect, and when the pieces fall into place the result is undeniably invigorating.Find yourself within a well-organised squad, with a smart leader, and the game comes alive as you move and strike with purpose beyond your own score. The knowledge that other squads are doing the same is rather abstract to begin with - you may occasionally get a chance to look over at the other objectives and see them scuttling around - but as objectives fall into place and the war escalates, it's brutally seductive. Those aren't just players on the same server, they're members of the same faction, and you start to develop an innate kinship with them that pays off when forces converge."}