{"ref": "https://www.eurogamer.net/final-fantasy-xiii-japanese-retail-hands-on", "date": "7 Jan 2010", "game_name": "Final Fantasy XIII", "text": "The joke, so it goes among Final Fantasy's legions of hecklers, is that aside from some new belts, buckles and hairspray nothing ever really changes in Japan's most misleadingly-titled RPG franchise. Rather, each subsequent release echoes the preceding one in both form and function, the aged, crumbly mechanics that drive each game merely obfuscated by ever more dazzling CGI.Glance behind the curtain of technological wizardry, they say, and you're left with an experience that's only superficially changed from the one its creator laid down over 20 years ago. While the worlds and characters that inhabit them change from Final Fantasy to Final Fantasy, the rest stands resolute; everything changes, it all stays the same.While there are kernels of truth to this scoffing, its greater falsehoods are made plain when comparing Final Fantasy XIII, Japan's great, white RPG hope for the PlayStation 3 (and, later this year, Xbox 360), to its immediate predecessor. Chalk and cheese, the two games have an almost diametrically opposed approach.Final Fantasy XII was a bold pushing of the genre's boundaries, combining a deep and innovative MMO-esque tactical battle system with liberating freedom to explore its rich, European-influenced towns and cities. By contrast, the first five hours of Final Fantasy XIII take the form of a fiercely linear walk, one interrupted by frequent, usually unavoidable battles, even more frequent cut-scenes, and not a single town or city to explore.There are familiar ideas and motifs, such as the Yoshitaka Amano artwork brandished across the start screen, the traditional blip sound effect as you scroll through the menus and the tiny Chocobo that lives in the hapless Satzu's afro (although curiously the fanfare that traditionally closes each successfully completed battle is gone).These touchstones help tether the thirteenth mainline title in the series to its umbrella branding, but it's difficult to consider the wider choices the developer has made as anything but a retreat into JRPG conservatism after the bold creativity of the twelfth.The first section of the game will be familiar to anyone who imported the Japanese Blu-ray release of CGI movie Advent Children, as, bar a few tweaks, it's identical to that bundled demo. Your experience traipsing across the narrow walkways surrounding the suspended underground city of Cocoon is entirely indicative of our experience over the first few hours of the game.You walk in a straight line into the screen, marvelling at the environment around you that stretches off into an eerie distance. Depth-of-field trickery shifts your eye's focus from near to far objects of interest, the camera latching itself on to aircraft as they wheel and dive overhead.Every 30 seconds or so you come to a save point, a treasure chest or a group of enemies, visible in the environment. There's rarely room to squeeze past them without being seen and as soon as you touch them or they touch you the screen dissolves into a battle, separate from the main environment and also a part of it.Then there's a cut-scene. These narrative interludes have always broken up the Final Fantasy experience, but their frequency in FFXIII is like never before. Square-Enix uses these moments to show off the White Engine, with extreme close-ups celebrating every strand of Lightning's hair and breakaway wide-angle shots giving a sense of space and geography to the world immediately around you.The frequency of cut-scenes might lead one to expect the drama to move quickly, but in reality the first few hours of the game are curiously devoid of spectacle. Compare the same section of game to that in Final Fantasy VII, with its train escapes, big-business terrorism and bombs, and Final Fantasy XIII's trudge along suspension bridges, implausibly futuristic hallways and ice caverns is curiously devoid of events."}