{"ref": "https://www.eurogamer.net/sbk-x-hands-on", "date": "5 Jan 2010", "game_name": "SBK X: Superbike World Championship", "text": "Rightly or wrongly - let's assume wrongly - I've always assumed that the simulation end of the racing market is the equivalent of breaking out the many-sided dice and little lead figurines; that it's an intimidating yet intensely rewarding wonderland designed exclusively for the kind of mind that revels in the tweaking of stats and the exploitation of complex details. That would make a superbike sim roughly analogous with a pen-and-paper RPG set within a fictional universe created by Derrida.Previous SBK games seem to have fitted into that (possibly entirely imagined) template: likable and largely accomplished - apart from some occasionally rather oddball physics - they've been a little dry for the more general audience. Why not, eh? They're sims, after all, so crash junctions and blue shells were hardly going to slot in particularly soundlessly, and, besides, Milan-based developer Milestone seems to have a fairly solid understanding of its fans and what they're after.With this year's instalment, SBK X, however, the developer is stretching itself somewhat. With the game's engine finally where the design team wants it to be, they're trying to open the experience up a little, with a full-on sim career campaign for their traditional audience - a first in itself - and an arcade mode that will hopefully bring in a new crowd.Let's look at the simulation side first. In terms of physics, the main tweaks are visible in the suspension and brakes. Brakes are a little hard to judge at the moment, as the current build has a couple of major bugs in this area - I should probably point out that this is hardly unexpected in early preview code, and by no means anything to worry about for when the game is released - but if the suspension is anything to go by, the team's time has been well spent.Even in SBK 09 the bikes could feel a little stiff as they moved around the track, but here there's a real springiness as you shift your weight back and forth. It's hardly the caricatured physics of something like Trials HD, but it adds an extra element of strategy to your race, and helps with the - first time I've ever used this word, and I feel slightly dirty - verisimilitude. (Actually, seeing as my own superbike career was cruelly cut short due to a muddle of drugs allegations and industrial espionage, I'm clearly in no position to say just how real it feels, but it feels like it feels real, and that's the important thing.)Other improvements include what Milestone is referring to as the ~evolving track~: with a new weather system implemented, if it's raining over the course of each event then the well-travelled area around the racing line will gradually dry, giving players able to stick within it much greater purchase between tyre and road. Equally, if it's sunny as the laps mount up then rubber will be laid down on the corners where bikes have been braking, providing extra grip and a neat visual cue to timings if you're racing unaided.The damage modelling has received additional tweaks - as well as impacting braking and handling as your tyres are ground down, it also looks fairly nice, with all manner of dings and scrapes appearing on your bike. But that's a small change compared to the delights of the all-new career mode, which allows you to customise your rider, accept job offers and move between teams as your reputation either improves or plummets."}