{"ref": "https://www.eurogamer.net/pes-2010-pro-evolution-soccer-vs-fifa-10-review", "date": "15 Dec 2009", "game_name": "Reviews", "text": "Over the past couple of months we've been banging on about how FIFA 10 is the undisputed king of footy games on PS3 and Xbox 360, how it's the most realistic and complete virtual rendition of the beautiful game your cash can buy. Pro Evo has remained the more forgiving, free-flowing choice for those with a penchant for pitch-long dribbles and 40-yard scorchers into the top corner, though the series' lack of innovation in recent years has been a concern. But that's the story on PS3 and 360. What we have on Wii is an almost complete role reversal for the two franchises.So let's kick off with Pro Evolution Soccer 2010, a game that siphons all that was best from last year's version and sadly does precious little to build on the series' innovative core. For those of you yet to experience PES on Wii, the key selling point is the ability to direct play by pointing the Wii remote where you want to pass the ball and your team-mates to run. This results in an immersive action experience married with a top-notch strategic centre that allows you to simultaneously control the player in possession while orchestrating the movements of your team. It takes some getting used to, but once you've mastered it you'll soon find yourself enjoying console-based footy action in a completely new way.PES 2010 kicks off with the series' usual collection of veteran and newcomer tutorials, the latter of which introduces you to the game's smattering of nuances. These include the ability to bend a free-kick like a Brazilian maestro. With a little practice you're soon firing shots over the opposition wall with enough curl to make a boomerang feel inadequate. You're also given control of positioning your goalkeeper before set plays, usually resulting in a smug I-told-you-so sense of self satisfaction as he palms away a scorcher or red-cheeked shame as he flaps impotently at a ball. In general, net minders are slightly more dependable than their somewhat butter-fingered counterparts from PES 2009, while pulling off skill moves also feels a little easier. However, a few irritants do rear their heads, such as passes going to the wrong player (again) and defenders going AWOL during key moments.Presentation has never been PES's forte and that's once again the case here, with ugly, blocky, hard-to-navigate menus assaulting your corneas at every turn. The on-pitch visuals are a tad blurry, and only the top players bear any kind of resemblance to their real-life counterparts. The ability to dribble from box to box has been toned down by a new stamina mechanic that regulates how long players can run before bursting a lung. Off the pitch there's the usual Master League, league and cup competitions to take part in while there's also an option to build a team from scratch and improve it and your facilities in a bid for greatness."}