{"ref": "https://www.eurogamer.net/global-agenda-mmo-hands-on", "date": "14 Dec 2009", "game_name": "Global Agenda", "text": "Today we present a double-header on Hi-Rez Studios' independently-produced, sci-fi shooter MMO, Global Agenda. You can watch a video interview over on EGTV and, below, read our hands-on impressions from the beta test.The atmosphere in the dropship is... well, not tense exactly. Nobody's hastily checking their weapons or telling anybody else it'll be okay. Nobody's losing their lunch. The only movement is coming from two dudes in a corner who are jumping up and down and one nobhead who's hitting me in the back with his sword. Friendly fire's off, so I could care less. The dropship's not even moving. We're just waiting for the big transparent door at one end to open.There are 10 of us, we brave, we few, we band of guys in anime-looking robot suits. And by God, when those doors open we're going to prove we're better than those other guys we're fighting, the other ten guys in anime-looking robot suits. And we will do this for... for the glory of, uh... experience points, I guess. And loot!The beta test of Global Agenda I played a few weeks ago wasn't much for lore. The plan is for the first five levels of Global Agenda to be a scripted experience which teach you about the game and its post-apocalyptic, high-tech, mercenary world in a kind of extended tutorial, but I started with a level-30 character. And with NPCs limited to a handful of vendors, there wasn't much of a chance to educate myself.What the beta did have was access to some of the PvE and PvP missions that'll make up the entirety of Global Agenda for its non-subscribers. This game's pricing plan is definitely something that needs clearing up before I can go on.Global Agenda is an odd hybrid of a third-person shooter and an MMO. Buying the game by itself gets you access to a domed, outpost-themed MMO town from which you can manage your character's armour, equipment, skill trees, appearance and implants while shoulder to shoulder with other players. It's from here that you can drop into PvE missions against tyrannical government robots or PvP missions against those other players, and both types of missions get you experience points, credits and loot.Those players who go on to subscribe get access to crafting, which we haven't seen anything of yet, and a persistent world where your Agency (Global Agenda's version of a guild) can battle other Agencies for territory and prestige. Hi-Rez Studios hasn't shown much of that yet either, and the rest of the subscriber content is fairly minor stuff like bonus cosmetic customisation options for your avatar. So let's move on to the combat which all Global Agenda players can look forward to.In short, you're looking at an old-school third-person shooter with a grab bag of MMO elements. As such it plays slower and more tactically than your average online shooter, so don't pay too much attention to the videos Hi-Rez has been releasing which show punchy gun battles with enemies going down in one hit. Unless you're going up against the cannon-fodder AI variants, combat is very much a case of eroding your opponent's health bar over several seconds while strafing like it's going out of style. (Which it is! Pretty sure psychotic strafing in games went out with quicksaving, avian flu, Busted and wristwatches.)Other MMO similarities include the ~energy~ pool, which resembles mana or stamina and powers everything from your guns and grenades to your jetpack, plus the fact that lots of your equipment has cooldown times, and the class system. You can either be Assault (tank/heavy weapons), Recon (sniper/scout/melee damage dealer), Medic (healer/poisoner) or Robotics (guy who builds and destroys turrets, drones and forcefields and tries in vain to pull his weight in PvE).What's a touch weird is that despite these MMO trappings, the only time Global Agenda is ever massively multiplayer is in that hub you revisit between missions. PvP missions max out at 10 players to a side, even in that big ol' persistent world planned for the subscribers. Like I say, weird. But from what I could tell from the beta, it still works pretty well."}