{"ref": "https://www.eurogamer.net/new-super-mario-bros-review", "date": "8 Dec 2009", "game_name": "New Super Mario Bros. Wii", "text": "Shigeru Miyamoto is in the habit of saying he imagined his latest invention years ago, and has been waiting for technology to make it possible. He always wanted Mario to have his dinsosaur companion Yoshi, but it wasn't possible on the NES. Zelda always looked like Ocarina of Time in his head. And, apparently, he'd always envisaged a multiplayer Super Mario Bros., but for some unspecified and difficult-to-imagine reason, it's taken the world 24 years to catch up.It seems unlikely. But fire up New Super Mario Bros. Wii, with four players, and you have to admit: it really does seem like he planned it all along.One of the greatest single-player game series of all time has barely had to change at all to accommodate a wildly brilliant multiplayer mode. The camera zooms in and out to track Mario, Luigi and two Toads as they bound, scramble and bop all over the shop. Question blocks dispense as many power-ups as there are players. The level's over if all of you die, but otherwise losing a life brings you back in a bubble like Baby Mario's in Yoshi's Island, which one of your friends can pop to bring you back into the game. And... that's it. Everything else is exactly as it ever was.The last time Nintendo attempted to inject co-op rivalry into one of its great single-player series - the fantastic but impractical Zelda: Four Swords for the GameCube-GBA link-up - it had to redesign the game so completely that it was a shadow of itself in single-player. But if there's been a change in the philosophy or technique of the level design in New Super Mario Bros. Wii, it's impossible to detect (even if you happen to have spent the previous week playing every Super Mario Bros. game ever made). Fears that the game would be compromised solo vanish in an instant; since nothing has changed, when you take the other players away you're still left with a new Super Mario Bros.Well, to be precise, you're left with a new New Super Mario Bros. This Wii game is a straight follow-up to 2006's retro revival on the DS. It has the same 2D-in-3D graphical style, colourful and impeccably animated, but slightly plain and plasticky next to the hand-drawn delights of old. It has an almost identical structure, a run through eight contained world maps in the style of Super Mario Bros. 3: more rote and rigidly-defined than that game, not to mention the ageless classic Super Mario World, but still strewn with shortcuts, secrets and forks in the road.Toad Houses offer item-gathering mini-games, and the maps also have wandering hazards who'll provoke a short battle for further power-ups if you bump into them, bringing back Super Mario Bros. 3's board-game roll of the dice. Power-ups won in these are kept in an inventory to use at the start of a level, a great help when you're struggling, or hunting secret goals or star coins. As with New Super Mario Bros., each level contains three star coins, often well-hidden or hard to reach - but these are no longer used to unlock pathways on the map.Instead, they buy hint videos, which offer clues to finding secret goals, useful 1up-gathering tips, or simple showing-off in the outrageously entertaining Super Skills movies. Some will be outraged at the idea of a Mario game that reveals its own secrets, but they are optional and in any case, you can trust Nintendo to choose when it lifts its skirts, and how far, with the judicious care of a veteran tease. More controversial is the Super Guide. When you die eight times on a level in single-player, you have the option of starting an automated run through with Luigi. You can assume control of him at any time, but even if you don't, the level completion counts and you move on.A game that plays itself: it's a brave move. It's also one that might have made more sense in a more story- or puzzle-orientated game than this one, a game where the only real impetus for progress is in summoning the skill to surmount its obstacles, surely? Well, yes and no. The fact is, the Super Guide's implementation is sensitive and smart, and it can cut through the worst of the frustration - those horrible, enraging, self-fulfilling failure loops every Mario player has experienced. The Super Guide is completely appropriate to a game that has a broad appeal but is - and hardcore Mario fans should prepare to have their faith restored - actually quite difficult.New Super Mario Bros. Wii is undoubtedly tougher than its DS counterpart. While it sill doesn't pose the same mighty challenge as the NES games or the later stages of Super Mario World, it doesn't waste time packing dense enemy arrangements and tricky jumping into its compact levels. That's entirely welcome, although in 2009 we could have done without the needlessly stern old-school save structure that only allows you to preserve your progress every five levels or so. At least there's a one-shot quick-save for when you absolutely have to turn the Wii off."}