{"ref": "https://www.eurogamer.net/reset-generation-review", "date": "4 Dec 2009", "game_name": "Reset Generation", "text": "At first glance, Reset Generation shares common elements with many other mobile games. The gameplay revolves around falling coloured blocks. The control system is simple, requiring only two buttons and one thumb. The music sounds like it's being banged out on a miniature Commodore 64 by a pixie in a biscuit tin. However, there are two key factors which set Reset Generation apart. Firstly, it hasn't been designed with a casual audience in mind, and secondly, it's not rubbish.Let's start with the demographic issue; the clue is in the name. On booting up Reset Generation, you're greeted by a princess sporting a pretty pink outfit, big blue eyes and a bouffant blonde hairdo. ~We are the Reset Generation,~ she says, all Peaches and cream. ~We grew up with computers and videogames. This is our story.~The opening sequence goes on to introduce some of the game's other characters. These include the Hedgehog (who has blue spikes and a need for speed) and the Plumber (who sports red dungarees and a moustache, but has blonde hair and a thick Russian accent - presumably Nokia's more frightened of Nintendo's lawyers than SEGA's). Other characters include Bomberman clone Dr. Lovebomber, a staff-wielding Level 50 Elf and a woman called Babe Gunner, who boasts twin pistols and giant tits. The parodies aren't all that clever or hilarious, but that's not important. The point is your Mum won't get the joke, no matter how many rounds of Wii Sports tennis or Diner Dash or Carol Vorderman's Sudoku she's played. Reset Generation isn't designed for casual gamers, but for those who started out with Space Invaders, moved on to Sonic and Mario, grew up with Lara Croft and are wasting what's left of their lives on World of Warcraft. This becomes even more apparent once you start playing it. Reset Generation isn't so much pick-up-and-play, more pick-up-and-realise-you-have-to-do-the-tutorial. It's simple enough in principle: matches are played out on a grid, and each character has a base on opposite sides. The objective is to capture the princess holed up in the enemy's base and return her to your own - while preventing your enemy from doing the same to you.But things are complicated by the fact there are three phases to each round of gameplay. First a set of four blocks will drop onto the grid and you must rotate and slot them in, Tetris-style. Five blocks or more in a row form a combo. These increase your attack power and the distance you can move around the grid, and can only be destroyed in special circumstances. In phase two, you move your hero. Movement is more limited on enemy squares, and you're more vulnerable to attack. In phase three, you get to fire two cannon shots. These can destroy regular enemy blocks (but not those which form combos) and special items. In addition, firing two shots at one of your own squares will protect it from enemy fire.So in short: drop blocks, move and fire. But in practice there's a huge amount of strategy and planning involved. This is partly due to the wide variety of special items which appear randomly around the board. There are springs, teleports, doors and pipes to help you get around. There are grenades and guns you can use to blow up your opponent's blocks. There are rings which make you invisible, wands which turn enemies into frogs, brushes which paint blocks your colour, pigs you can command to eat your rival's combos and all manner of other special items and secret weapons - all of which can tip the balance of power in an instant. On top of this, every character has a unique ability that can be triggered when their combo meter is full. The Hedgehog can zoom across the map in any direction, the Level 50 Elf can lay down an entire row of blocks, Babe Runner can travel diagonally and so on. The Story mode is designed to let you try out all the characters and experiment with their different abilities, and doing so is great fun."}