{"ref": "https://www.eurogamer.net/james-camerons-avatar-the-game-review", "date": "2 Dec 2009", "game_name": "James Cameron's Avatar: The Game", "text": "Not to be confused with that game where you can run around and get 1000 gamerpoints in 60 seconds, James Cameron's Avatar is an adaptation of the Titanic director's upcoming and potentially rule-changing 3D adventure film, and the name on the box is more than a marketing ploy: he probably did spend more time selling the game concept in interviews than he spent debugging analogue deadzones in a corner of the Ubisoft Montreal office, but Cameron has put his stamp on this because he sees it as an important part of his Avatar vision. That alone is more promise than anyone typically associates with a game of a film.The game itself is also immediately intriguing. Having picked between various male and female character models, you're thrown into the role of signal specialist ~Able~ Ryder, who is being sent to the planet Pandora to reinforce the RDA, a human military force locked in uneasy coexistence with the 10-foot-tall, indigenous purple Na'vi. The Na'vi live in simple villages, belying the harsh wildlife - harsh enough that the titchy humans have to surround their research camps with huge metal fences - and as you run around being introduced to the mechanics you have to fend off assaults from ~viperwolves~ in the jungle and catch only glimpses of the Na'vi themselves.Before long all that changes, however, as on top of being put in an intriguing place, you're put in an intriguing position. Through the RDA's ~Avatar~ programme, your human consciousness is transported to a Na'vi body, and then you're confronted by a troubling accusation: all the evidence suggests the RDA is exterminating the Na'vi in order to plunder Pandora, and you have to choose between executing a human traitor or helping him to escape and siding with the Na'vi, and accepting all the complications that implies (not least of which is that your human body is stored in a sort of science-fiction coffin while you inhabit your avatar).It's a simple choice, of course, but the difference between Avatar and other action games where you face polar opposites is that a huge volume of content genuinely rests on the decision: Avatar is effectively two entire games, and the path you take defines the next seven or eight hours either as a Na'vi third-person action-adventure or an RDA third-person shooter.There is a lot of common ground between the two, of course. Both are third-person action games in the same mould, where the story moves you around several fairly vast, non-linear but not quite openworld levels, where you meet with key allies and then head out to complete a variety of actions to ingratiate yourselves with them or further your cause. Na'vi and RDA weaponry and abilities are different, but there's functional overlap in terms of controls (weapons are accessed by and remapped across d-pad directions, abilities are on face buttons with a bumper modifier) and the nature of the special skills (the Na'vi may be able to summon a viperwolf buddy, but both have strength buffs and healing spells, effectively)."}