{"ref": "https://www.eurogamer.net/metro-2033-hands-on", "date": "1 Dec 2009", "game_name": "Metro 2033", "text": "If you're going to show off a brand new post-apocalyptic FPS to a bunch of cynical hacks, you might as well get everyone in the mood: jet us off to Moscow, put us in a freezing nuclear bunker 65 metres under the city, kill the lights and then launch a real nuclear attack. Sadly the budget only covered points one and two, although we did get a deafening siren noise via a nearby Alba stereo, along with some tasty Russian canapé.The reason for such elaborate japes is that THQ wants everyone to sit up and take notice of 4A Games' Metro 2033. Created by some of the core people behind acclaimed PC shooter S.T.A.L.K.E.R., it shares that game's obsession with life after nuclear disaster, which has once again given birth to an atmospheric, narrative-rich shooter, this time based on the cult Dmitry Glukhovsky novel of the same name. Taking its cues from BioShock, Half-Life 2 and, inevitably, S.T.A.L.K.E.R., Metro 2033 follows the adventures of Artyom, a young man born in the years leading up to a devastating fictional nuclear holocaust of 2013. 20 years later, the game kicks off with Artyom as part of a ragtag, dystopian generation of underground survivors who can only dream of daylight, blue skies and fresh air. And nibbles.Forced to shelter from the inhospitable poisonous wasteland on the surface, the subterranean society that exists in the metro stations criss-crossing subterranean Moscow is ~gripped in a cycle of conflict and uneasy alliances~. Worse still, a new type of psychic mutant known as 'Dark Ones' has developed, and they can kill their victims with the power of thought.Facing threats from not only these mutated beasts but also fellow survivors, a ~fateful event~ forces Artyom to set off on a ~desperate mission~ to Polis City to warn the populace of the impending encroachment of the dangerous Dark Ones. Armed with little more than basic weaponry, a map and a gas mask, you leave your home station of 'Exhibition' on the first leg of a hazardous journey.Of course, roaming the shattered remains of an underground network is something gamers will be familiar with after the trials of Fallout 3 last year, but the comparisons are superficial. 4A Games' approach is rather more stripped-back and traditional, with a familiar combat system and an evident determination to focus on immersive, narrative-driven, set piece-based gameplay elements and claustrophobic intensity.It's an oppressive experience from the word go, driven by tension and a malevolent atmosphere that has you duking it out with twisted mutants and ruthless mercenaries as you penetrate the gloom. With no HUD to speak of, you have to rely on other cues to determine your status. For example, you have to glance at the magazine cartridge passing through the firing chamber to see how much ammo you've got left, while checking your map actually involves pulling your map case out and illuminating it with a cigarette lighter if it's too dark to see. Health-packs are applied in similarly physical fashion, and using the gas mask necessitates looking at your watch to check on the remaining air supply.Metro 2033's quest for authenticity also extends to how it makes you deal with the precious resources around you. As you might expect, ammo is exceptionally scarce 20 years on from nuclear obliteration, forcing you to ransack every enemy you encounter. And because of the toxic air and challenging climate, the gas mask only lasts for a limited time, frosting up and gradually impairing your view. Even the lighting within this gloomy netherworld is rather hardline, with players able to shoot out each individual light-source, while the torch must be manually charged.The commitment to a believable world is also evident elsewhere. Neither 4A Games nor THQ has attempted to 'westernise' the dialogue, with local voice actors providing a credible Mosovite ambience as you wander through various mini-communities on your journey. As well as providing interesting bits of information about their lives and problems, some will comment on the path ahead or their thoughts on your quest.These sequences show the game in its best light, with excellent attention to detail in every department, whether it's the meticulously crafted environments, advanced lighting techniques or visibly shattered community busily blotting out reality with another Shroom Vodka. It's a game that wants you to play tourist to its subtleties in the way that BioShock managed so successfully."}