{"ref": "https://www.eurogamer.net/lego-indiana-jones-2-the-adventure-continues-review", "date": "23 Nov 2009", "game_name": "LEGO Indiana Jones 2: The Adventure Continues", "text": "I'm a vocal fan of the LEGO games, but even I was a bit sceptical about a second go-round for Indiana Jones. The first LEGO Indy game was something of a runt compared to the brick-based versions of Star Wars and Batman, and the idea of adding just one more film story - the limp Kingdom of the Crystal Skull - to the existing trilogy hardly suggested a gameplay bonanza.The good news, then, is that Traveller's Tales has come up with a package that renders such concerns null and void. This is an absolutely stuffed disc, easily doubling what was on offer last time, and addressing long-running complaints about the LEGO series to boot.Naysayers who claim LEGO games are just the same thing repackaged are finally proven conclusively wrong, even though every game so far has offered its own tweaks and improvements. Of course, you still explore levels, smashing things, melee-bashing enemies, solving puzzles and collecting LEGO studs for currency. That's what the LEGO games do. To suggest otherwise would be like asking Splinter Cell to ditch stealth, or Call of Duty to tone down the shooting.What's changed instead is the entire structure of the game. Each original film now has its own hub world, and Crystal Skull gets three, having been split into three acts, each one the same size as the other movies. These gameplay hubs are now an active part of the gameplay, too, unlike the relatively lifeless Mos Eisley Cantina and Batcave. Each contains 15 smaller challenges, as well as numerous secrets, rather than six long levels.The stories are as silly as ever - particularly for the original three movies. Having told those tales once already, the game opts to offer even dafter abridged versions, with all-new levels that muck around with the narrative in often-delightful ways. The Crystal Skull gets a slightly more faithful adaptation, but at least George Lucas' unwieldy cast list translates to a decent array of characters.Story levels are accessed in linear fashion, with entrances to each one becoming available as you traverse the hub. In Raiders of the Lost Ark, for example, the hub starts up in Nepal. Wander down a mountain, across a bridge and you're in Egypt. Keep going and you'll reach a dock which leads to the island where the Ark is opened. A short boat trip in the other direction is the temple from the movie's iconic opening.Unlocking new characters is no longer a menu-driven affair. You find them in the gameworld, beat them and buy them. The same is true for vehicles. Find it, buy it, drive it. Bonus levels can also be found or opened through exploration, while replaying story levels leads to different challenges for specific character types.Likewise, cheats and bonus items are now earned by hunting down different items in the gameworld, rather than the solitary red Power Bricks of old. Smash 10 scorpions in Temple of Doom's hub, for example, and a crate containing a gameplay perk is immediately airlifted in, ready to be purchased. These are the same traditional extras we've come to expect - score multipliers, fast build or repair skills, as well as silly stuff like poo money and comedy moustaches - but they're now integrated into an active play area rather than tucked away in a menu.It's a radical overhaul to a familiar system, and the change is not without its growing pains. The hubs are poorly signposted, often confusing in layout, and it's easy to miss vital gameplay areas as you roam around. I spent far longer than necessary just trying to find the second story mission in The Last Crusade, trudging through areas that were not yet available, wondering what I should be looking for. With its newfound size, the game is crying out for a map or compass, anything to nudge you in the direction of essential locations - or even just areas of interest.The problem is compounded by some surprisingly unhelpful design decisions. Bonus levels can only be completed by characters with certain skills, but the game only tells you what these are once you've started the challenge. It'd be better to know who you need before entering, especially as you're restricted to two characters at a time.Meanwhile, unlike previous LEGO games where you could cycle through an automatically selected cast that covered all the abilities you might need, auxiliary characters can only be found in their relevant map area and must be manually swapped. Having to jog all the way back through the gameworld, just to collect someone with a spear, is a horrible chore - especially when you've forgotten where they spawn."}