{"ref": "https://www.eurogamer.net/crackdown-2-hands-on", "date": "23 Nov 2009", "game_name": "Crackdown 2", "text": "Perhaps the best way to define your more violent kind of game is by whether it gives you tools or props. Uncharted 2, dynamic and enthralling as it is, gives you props. Even its guns seem to have been designed specifically to get you through the next bottleneck of set-pieces, before the developer flings you in another direction. Crackdown, however, provides tools - items and ideas that are good for all manner of experimentation or chaos. Or perhaps that should be toys rather than tools - its developers, after all, insist on calling Crackdown 2 a toybox, rather than a sandbox.So what should messing around in a toybox feel like? In the original game, it always goes the same way with me. First, rocket out of the Shai Gen underpass in the fully-levelled SUV, hit the ramp truck and narrowly miss that first glowing stunt marker, landing real soft-style, thankfully, in the passing lap of a nice old lady. Then screech to a halt in skyscraper plaza, with the nice old lady now harpooned to the back bumper, kill the engine and decide who to run over. Then it's into the Shai Gen elevator (with the car, obviously) and all the way to the top floor before a run-up, followed by that perfect squishy moon-rover boost jump, carrying me out the window and into the bright blue sky. Then it's back to transcribing some endless interview about Bulgarian middleware.Realtime Worlds' original deranged masterpiece was a testament to idiotic free will, where every 15 minutes was an entire action movie's worth of stunts and explosive mishap - and by ~action movie~ I mean one of the proper, unintentionally hilarious eighties action movies where cameramen still got crushed under lorries and they used real bullets to save on costs. Crackdown was a marvel of mucking about that had very clear rules but almost no restrictions, and with a sequel on the way, it's going to be fascinating - nail biting - to see if Ruffian Games, a studio filled with key personnel from the original development team, can strike the same magical balance.An afternoon in Ruffian's new, rather unfinished office suggests that, yes, they probably can. The first outing was always at its chaotic best played with a friend, of course, but bespoke multiplayer game-types are a considerable focus of Ruffian's sequel. The two the team reveal aren't that inventive - Deathmatch and Rocket Tag, a Halo 3 Ninja Ball variant which tasks you with keeping hold of an elusive orb while everyone else chases you with rocket launchers - but that lack of obvious gimmickry is the point: Ruffian's allowing the game to speak for itself, and the strategy works.Multiplayer divides Crackdown's city into districts to create separate maps. They've got a nice bunch going so far, all of which remind you how subtly the original managed to turn its distinct neighbourhoods into the equivalents of actual game levels, each with its own twist, its own focus. Turnback Lane is a warren of skywalks and narrow balconies set around a rundown motel complex, while High Rise, as the name suggests, is an intensely vertical map with plenty of opportunity to get right up above some fairly nasty street-fighting. Docks is the original game's brilliant shipping container paradise exploded outwards with the addition of some truly gigantic cranes, while Refinery is the old Volk industrial plant, made even more complex, multi-levelled and treacherous than before.As one match turns into two, then five, then a dozen, it becomes obvious that Ruffian has zeroed in on something rather special with multiplayer: while it would be pointless to try and take on the CODs and Halos at their own game, there's simply nothing else like 16-player Crackdown available at the moment. The matches move at a crazy pace akin, perhaps, to Quake III, but they also feature that frightening degree of mobility the Agency has given you - an arm-flailing leap that seems to last forever and terminate just where you want it to, and a targeting system that allows you to pop people's heads off from the other side of an island."}