{"ref": "https://www.eurogamer.net/race-on-review", "date": "20 Nov 2009", "game_name": "Race On", "text": "The latest offering from the safest hands in sim racing turns out to be another reissue of ageing stalwart Race 07. Last year the Swedish dev added Nordschleife and a host of handsome Grand Tourers, and called the result GTR: Evolution. This year they've bolstered it with American muscle cars, Swedish touring action, and WTCC 08 updates, and called the result Race On. Cynical cash-gouging or welcome horizon-broadening? Let's sift the evidence.If you caught Top Gear's recent US road trip you're already familiar with half the American additions. The improbably ugly Cadillac CTS-V that eventually won James May's heart has been sim-ified, as has Hammond's ride, the sixties-styled Dodge Challenger SRTS. A Chevy Camaro and another Dodge - the Charger SRT8 Super Bee - complete a contingent that makes up for what it lacks in style and fuel economy in rogue-elephant-with-spear-in-its-side lairiness.The only thing these bulky V8 brutes have in common with their nimble European touring cars stablemates is number of wheels. The first time I took one for a spin - I think it was the Caddy at Okayama - I went so wide on the first bend I needed to stop and ask directions to find my way back to the track. Frail brakes + low traction control + battleship tonnage  = cantankerous cornering. The standard street versions (there are both road and race variants) are particularly fond of turf and gravel, but put in a few laps and spend a bit of time in the predictably well-equipped tuning garage and you'll almost certainly end up enjoying their wayward ways.Just in case you don't warm to the brash Americana, there are alternatives among the new machines. One of WTCC's warm-up acts, International Formula Masters, make their debut. Between Formula 3000 and Formula BMW in terms of performance, in-game they feel blisteringly fast and remarkably sure-footed. Fun certainly, but for my taste, a little too similar to the game's other open-wheelers.A similar accusation could be levelled at the handful of new 08 touring cars. Vehicles like the Lada 110 2.0 and Seat Leon TDi will doubtless please ardent followers of the sport and fans of the particular marques, but to many users I suspect they're just going to be extra names on an already lengthy list of Hatchbacks That Go Like Stink And Corner Like Jack Russells. Exhilarating drives, yes, but not especially memorable ones.The new tracks, on the other hand, should please all. As part of the Swedish touring car content (previously released in Northern Europe as STCC - The Game) you get seven small but entertaining Scandinavian circuits including 'The Valley Of Speed' Knutsorp and... um, some other places you probably won't have heard of unless your name is Lars, Johan, or Björn."}