{"ref": "https://www.eurogamer.net/fifa-manager-10-review", "date": "19 Nov 2009", "game_name": "FIFA Manager 10", "text": "After Championship Manager 2010 and Football Manager 2010's titanic clash for football management bragging rights, chances are you may have forgotten all about the third contestant in the annual genre superiority playoff. Traditionally, the FIFA Manager series is written off by many as an also-ran, but with the franchise having made steady progress over the past few years, such a dismissive attitude is tinged with myopia.Perhaps the hardest thing for many management fans to get to grips with is that FIFA Manager isn't just a team management game, but one that allows you to take control of every facet of club management, whether it's liaising with architects to draw up new plans for stadium expansions or picking the starting 11 for a key derby game. And let's not forget the often unfairly castigated personal life elements (which this year can be disabled) that help provide the series with its unique feel and spattering of quirkiness. Thanks to the game's exhaustive array of customisation features, you can decide exactly how much or how little of day-to-day club management you want to be in charge of, meaning all the minutiae can be ignored if you so wish.So what's new? Well, the big news this year is the addition of an online multiplayer feature that allows you and up to seven other real people to compete in quick-fire seasons in a host of leagues from across the globe. But we'll come to that in just a moment. When it comes to new single-player features, FIFA Manager 2010 possesses some 400 improvements over its predecessor, though this is a tad misleading as the majority of these are nip-tuck tweaks rather than genuine innovations.Polishes abound in almost every department. Your stadium's infrastructure can now be modified in a myriad ways, ranging from the maintenance of food bars, VIP areas and even public transport to and from your stadium. An annual magazine provides you with a rundown of all the teams in your country's premier division while player guidance has been bolstered with the addition of Help icons that fill you in on what everything does, though never to the detailed extent of Football Manager 2010's revamped player guidance system. Yet for all its spit and polish, you can't help but feel there's little here that can be classed as a major step forward from last year. That is, until you reach the pitch.The first, most striking 3D match engine improvement is the number and variety of player animations. Last year, the game suffered greatly from a lack of unique playing styles. The addition of scores of new animations has certainly alleviated this problem somewhat, and it's now far easier to identify the differences in playing styles between fleet-footed wingers and pug-nosed stoppers. The match action once again proves to be a mix of convincing passages of play and infuriating inconsistency, and while games often do look fairly realistic, they never satisfy like Football Manager's matches and, to a lesser extent, Championship Manager's. As has become traditional with the series, you can also opt to be a player manager, either controlling your player yourself (unwieldy and frustrating) or have them controlled by the AI."}