{"ref": "https://www.eurogamer.net/bayonetta-import-review", "date": "18 Nov 2009", "game_name": "Bayonetta", "text": "The best two Japanese action games of the year are diametrically opposed in approach. Demon's Souls is a brooding traipse through the corridors of purgatory, fair but relentlessly unforgiving. It teaches that modern videogames have made us weak and stupid, that our gaming muscles have atrophied through the efforts of so many mollycoddling developers. Every sword strike must be carefully considered, and button-mashers are not so much ridiculed as downright abused for their lack of sophistication. The result is a tense but ponderous experience, one that demands supreme trepidation before each step taken, careful contemplation before every input made.In Bayonetta, meanwhile, you press a button and your television implodes.Beloved is a celestial giant with the face of a three-year-old cherub and the body of a weightlifting Buddha, who falls from heaven to cobblestone with a squelchy thwack. Standing just 20 feet from this sudden epiphany, Bayonetta smirks to the cameraman, who's angled our viewpoint on the scene from ground level in order to fully celebrate the titular anti-heroine's ninja Barbie physique and secretary-cum-sex-worker attire. Her wink to lens is the starter pistol for interactivity.You rotate the left analogue stick and hit the X button on cue, and Bayonetta cartwheels into a handstand, firing the twin pistols attached to her stilettos into Beloved's rolls of fat by clicking her heels in rapid succession. You break the sequence short with a triple jump through the air, esoteric purple wings momentarily sprouting from her arched back as you do so, before landing on Beloved's shoulders. The camera wheels and dives around, matching the kinetic assault of Bayonetta's body blows with dazzling movements of its own.Finish him: an invitation to execute a Climax Attack on your wearied angelic opponent stamps onto screen. As you make the input, Bayonetta plants her feet square on the ground. Her black latex suit is absorbed into her skin, inexplicably extending the strands of her hair as it's drawn up through her body.Shielding what's left of her modesty with her arms, Bayonetta flings her head backwards and her new 30-foot hair extensions assume the form of a black dragon: follicular shape shifting. It bares shadowy tooth shapes before lurching forward and down onto the cherub's torso. You madly hammer X to fill a Megaton bonus-point gauge, each mash encouraging the beast to chew a little harder. Then, in the final moment of climax, it rips Beloved's torso in two, dropping a crimson waterfall onto the cobblestones below like a dead weight.Bayonetta's hair retracts itself back into her scalp. Her clothes re-envelop her body. She pops a lollipop into her mouth and sucks twice. Lara Croft shivers. Airport massacre levels, be damned. Bayonetta eats angels with her hairdo. Let's have a discussion about that on the Today programme.For director Hideki Kamiya, Bayonetta is the final destination of a stream of flamboyant creative endeavour he first tapped eight years ago. With Devil May Cry, Kamiya invented his own sub-genre: a scrolling beat-'em-up that combined kung-fu wire combat with near endless combo strings and wrapped it all up in a camp gothic aesthetic. Rather than attempting to merely recreate Devil May Cry's successes in Bayonetta, Kamiya's bravely stripped away all of the dead weight from his initial template, ruthlessly streamlining the form and function to deliver something at once fresh and familiar. It's also, unquestionably, the greatest game yet to spill from this niche.Developer Platinum Games' influence is clear from the off. Bayonetta discards the dark and dry anime tone of Kamiya's earlier work for something more tongue-in-cheek and irreverent. The story is delivered in bite-size, snappy cut-scenes, with slightly ropey albeit effective cutaway stylisation and camp voice-acting that soon wins you over. The approach suits the game style well, allowing for humorous quips and wry visual gags to be interspersed with the action, revelling in the silliness of its scenario in a way Devil May Cry never quite dared.While the presentation teeters on the edge of objectification, with long, lingering shots of anatomically perplexing females, the characterisation does much to counterbalance the sexist overtones, and Bayonetta emerges as one of the strongest Japanese leads in recent memory. Discarding a grand gothic soundtrack, the game instead settles upon an incongruous but irresistible mix of J-pop and jazz. The thrill of batting away celestial bodies to a poorly enunciated lounge version of ~Fly Me To the Moon~ is unforgettable."}