{"ref": "https://www.eurogamer.net/f1-2009-review", "date": "17 Nov 2009", "game_name": "F1 2009", "text": "Any Formula 1 fan will tell you that March 2007 feels like a lifetime ago. The season that saw a young Lewis Hamilton - too young - miss out on the championship by a single point was also the last time an F1 game rolled out of a developer's pit. In fairness, by the time Formula 1 Championship Edition showed up on PS3, the sub-genre was already misfiring. A series of mainly monotonous and predictable real-life seasons combined with the restrictions that accompany any official Formula 1 game production resulted in F1 titles that, like the sport they emulated, had lost their spark.Last May's announcement that Codemasters had snapped up the F1 rights got the excitement pistons going again. Much of that enthusiasm rides in the slipstream of next year's Ego-powered PS3 and 360 releases, given what the publisher has accomplished with GRID, but it would be dangerous to dismiss this year's effort on Wii (and PSP) on two counts. For one thing, developer Sumo Digital is no stranger to great racing games itself. And, of course, 2009 has been one of the best F1 seasons of the last 20 years. Even Codemasters, which has shown itself to be uncommonly shrewd when it comes to licensing in the past, must still be pinching itself over the timing.Of course, the official seal on F1 2009 forces the game to follow some very familiar tyre marks, but at least the inclusion of Abu Dhabi's Yas Marina circuit and the Singapore GP track (F1 2009 is first game to feature the night race, which only joined the F1 roster last year) as well as the odd revision to established venues add a touch of diversity. And there are plenty of new faces, with all of the 2009 drivers to choose from. Well, the 20 that started the season, at least - disappointingly, mid-season changes involving Grosjean, Alguersuari, Liuzzi, Kobayashi and poor old Badoer aren't catered for. Fresh, too, are the cars. New aerodynamic rules and a return to slick tyres lends the carbon fibre rockets a more menacing look, which the game's reasonably detailed visuals capture adequately, while real-life internal tinkering such as KERS (boost) is also implemented - although here it's present in all cars, not just a select few.There may be few surprises in terms of what you can do with the machinery, but at least the options are plentiful. In addition to Quick Race, Time Trial and a decent two-player split-screen mode, you find Grand Prix Weekend and Championship alternatives, the latter two offering the opportunity to participate in all on-track sessions over the course of a race meeting, as well as play around with settings. These can be dealt with simplistically - the game includes simple-to-understand aerodynamics, car balance, gears and suspension settings - but anyone wanting to get their hands greasy does get a chance to alter wheel geometry, tyre compound and pressures, suspension spring rates, individual gear ratios, ride height and wing adjustments.You also get to play 'mechanic' in the Career mode, which sees you join the F1 circus as a rookie driver, before going on to complete three seasons while working your way up the hierarchy. An email system communicates the off-track action (test session offers, race p/reviews, team quotes) but mostly fails to add humanity to the proceedings - other than a nicely animated pit crew, F1 2009's world is understandably mostly mechanical and architectural. Still, for some the pressure to meet your team's expectations will feel very real. If that sounds a little too involving, why not kick things off with the Challenge mode? Split into some 70-odd bite-size chunks that, for example, test your ability to overtake as many opponents within a time limit, win a race, take corners as fast as possible, complete a flying lap or pass through checkpoints before you run out of seconds, it's the sort of thing you find yourself returning to in order to improve on past performances. It's hardly revolutionary - and neither are the 'scenario' versions that unlock every time a group of challenges is completed, and involve the likes of wrestling a car on slicks on a rain-soaked track to a points-scoring position or going head-to-head against Hamilton - but it nevertheless bolsters an already comprehensive package."}