{"ref": "https://www.eurogamer.net/iphone-puzzle-roundup", "date": "12 Nov 2009", "game_name": "Reviews", "text": "You'd be forgiven for thinking that iTunes' only genuine brainteaser is how such a magnificent product as the Eurogamer App can retail for the low, low price of £2.39 [good sucking up there - Ed]. Yet in fact, the platform is filled with puzzlers, with venerable ancients like Trism and the perpetual delight factory that is Drop7 rubbing shoulders with new releases such as Lumines (which is currently in desperate need of a new control scheme patch).Puzzle games are a good match for the App Store, given the iPhone development community's habit of iterating furiously on a handful of themes and churning out dozens of very quiet variations on the same idea, and, while falling blocks and matching threes tend to dominate the landscape, there are also a nice range of smart oddities emerging, too. Below I've gathered together a representative mixture: a few older games, a couple of new ones, and at least one in which you help a cow organise his finances. Enjoy.Capybara Games' multi-colour eat-'em-up is a mobile phone classic, and it's already been around on the App Store for quite a while. With a PSN version recently released, however, the cheaper iPhone instalment is still worth a look.Conforming to that old Woody Allen line about nature being a giant restaurant, Critter Crunch casts you in the role of Biggs, a chunky kind of mutant cantaloupe, by the looks of it, whose job is to prod the local food chain into action by feeding small bugs to medium bugs and medium bugs to big bugs in order to make them explode and turn into jewels and money.As such, Critter Crunch is an ideal means for children to learn how tightly the separate worlds of the animal kingdom and the jewellery industry are bound together, and, despite its queasy mixture of swallowing and regurgitating living creatures, Capybara's adventure manages to remain strangely cute.I'm not saying I'd necessarily like to meet Biggs outside my house on a late December evening - although I'm pretty certain that if I reacted quickly enough, I could probably boot him into the kitchens of that slightly obnoxious up-market bakery over the road - but the iPhone port of his game is as colourful, hypnotic and polished as it is on every other platform it's been released on - which is quickly becoming every other platform. With an excellent interface and plenty of addictive chaining, this is brilliant stuff.9/10"}