{"ref": "https://www.eurogamer.net/panzer-general-allied-assault-review", "date": "11 Nov 2009", "game_name": "Panzer General: Allied Assault", "text": "Good hardcore tactical strategy games are difficult to find these days, but one of the best-known series of the last 15 years is SSI's Panzer General, which went on to spawn no less than six sequels, and now it's time for Xbox 360 gamers to get a taste of allies versus axis glory in Petroglyph's new Xbox Live Arcade title, Panzer General: Allied Assault.Gone are the days of intimidating hexagonal game boards. Instead Allied Assault attempts to present its tactical strategy shenanigans through a more friendly card-based approach. You're still looking at some serious strategic depth, but the somewhat-randomised nature of the decks means you never really know what to expect from your own abilities, never mind your wily opponent.Allied Assault sees you take on the World War II German forces during the events that lead up right up to D-Day. Would-be war heroes will be able to push back the encroaching enemy forces in scenarios based on The Battle of the Bulge, Utah Beach and Operation Market Garden. Playing through the single-player campaign sees you assume control of the American allied forces, while taking the action to the Skirmish mode lets you tinker around with both German and American sides.Allied Assault presents itself as a board game comprising of either 6x5 or 7x8 tiled grids depending on the scenario map. Each side must start on its base line and is given a selection of cards drawn from a random deck. More powerful advanced cards are earned by winning scenarios (extra rewards are received for playing and winning on higher difficulty levels) which then leads to the ability to create and use your own custom deck.The game does a great job of tutoring you in the first mission. There are two distinctly different types of cards used: Unit cards and Ability cards. Unit cards represent the game's physical troops, vehicles and support weapons such as Paratroopers, Sherman Tanks and AA guns. Ability cards function in a number of different roles, with some allowing you to deal unstoppable direct damage to enemy units, give health boosts to your own units or cancel combat completely.A typical game round goes something like this: You get your initial hand, place unit cards on your baseline, move units to neutral tiles (perhaps capturing a nearby town or objective tile as you go) and use any Ability cards you want. Next up is the combat round. This lets you engage enemy troops that are adjacent to your units with the hope of rubbing them out of the equation. During combat, a large number of stat-based figures and ability card factors come into play. It plays out like a drawn-out session of rock, paper, scissors; perhaps you boost your attacking unit's damage temporarily, or remove your opponent's supporting fire bonus, or even sacrifice a unit card still in your hand for a valuable defence bonus. Combat is where the strategy element goes deepest, and also, the luck element flies highest."}