{"ref": "https://www.eurogamer.net/rabbids-go-home-review", "date": "9 Nov 2009", "game_name": "Rabbids Go Home", "text": "I'm exhausted. Not just because my fun muscles are still aching after the Eurogamer Expo, but because playing Rabbids Go Home is like being trapped on a bouncy castle full of kids who've skipped their Ritalin and pumped themselves up on Red Bull and Tartrazine all afternoon instead. And you know what? I like it.The first thing is the sheer energy of the experience - every fibre of Go Home vibrates with an incredible intensity, a joie de vivre verging on insanity. There's a constant aural assault of squeaks, clatters and the trademark Rabbid 'BWAAAAAAAA', which reaches right into a very primal part of the brain and flicks that little 'grumpy' switch to 'off'. Graphically it's accomplished without being outstanding, but is full of enough stylised quirkiness to make the experience a visually satisfying one. Bright colours and chunky objects abound, scaling up quite nicely on a 37~ full HD screen.Here's the 'plot'. The Rabbids, for a reason never fully explored, have decided that their true home is Earth's moon and that they need to return there, in order to have a little nap. The best way of making that 240,000-odd mile journey is to collect stuff, put it in a pile and climb it.Let's get the Katamari comparison out of the way. Yes, you basically hare around collecting random items, the bigger the better. Yes, there's a moon involved. Yes, it's a bit mental. But to write this off as the sincerest form of flattery would be unfair. Ubisoft Montpellier, along with Michel Ancel of Beyond Good & Evil fame, has poured a considerable amount of time, effort and talent into this, and the result is a game which feels like a high-quality standalone effort rather than another sour pint drained from the cash cow.Gameplay revolves around a shopping trolley, manned by two customisable Rabbids. Initially a bit fiddly to control, this consumer chariot turns out to be a joy to drive, squealing around corners and over ramps with just the right level of abandon - Go Home feels as much like an arcade racer as a platformer.Rip around in a tight enough curve and soon your wheels start to spark in a very Mario Kart way, hit the trigger once this starts and you'll boost forward, powering the trolley though obstacles and enemies or over ramps. Shaking the Wiimote unleashes a 'BWAAAAAAAA', stunning people, dogs and vending machines. Jumping is a luxury afforded only to the few levels where the Rabbids kidnap a terminally ill man in a portable oxygen tent, whose gaseous life support system allows the duo to float around with a triple jump.The controls, actually, really couldn't be much better. They're forgiving enough to make the fiddly sections of the game engagingly tricky without frustrating players, but maintain the feeling that control is constantly on the brink of slipping from your grasp. All movement is kept to the analogue stick on the nunchuk, while aiming the Wiimote allows you to launch a cannonball Rabbid at anything on-screen, knocking down objects for collection or disorientating commuters, office workers or jobbing Santa Claus impersonators so the Rabbids can run them over, strip them to their underwear and steal their clothes (and, weirdly, the six-pack of two-litre sodas that everyone seems to carry) for the moon-tower.It's delightfully silly. Not in that tedious, ~we're so gosh darn kooky that we need everyone to know it~ way which had begun to plague the Rabbids series, but with a gloriously Gallic, subversive sort of mania which charms rather than grates. Endearing little animated sequences precede each area, drawn in a minimalist style which evokes memories of the odd European cartoon shorts Channel 4 used to show on weekday afternoons when the cricket finished early or budgets ran short."}