{"ref": "https://www.eurogamer.net/skate-3-hands-on", "date": "6 Nov 2009", "game_name": "Skate 3", "text": "Jason DeLong, the extremely polite senior producer from EA Black Box, demos the latest instalment in the company's quietly excellent Skate series with the understated pleasure of a man who knows he doesn't have to convince you to invest in a plastic skateboard with infrared sensors instead of wheels. It's a nice position to be in, I imagine: while it looks very much like Tony Hawk is off to see the wizard, EA's developers are free to focus on something that's potentially a little more exciting.And that's playing with teams. Skate 3 picks up with your character from Skate 2 - let's call him Fabian D'La Peche? - having risen through the ranks of the board culture elite, and emerged as a true titan. Clearly having hit the streets with an MBA from Yale, that can only mean that the time has come for him to start his own company, get his logo out there, and gather a crew together. Go Fabian!This all bodes rather well, seeing as building a brand is obviously something that EA knows a bit about already. Yet, while I'd love to report that Black Box has taken a jaunty suicide swerve into the realms of business sim, the team is focusing on the social aspects of running a company with this game.In Skate 3, your team works on three levels. ~From a story perspective, the game is about you as a legend and your board company,~ explains DeLong. ~The way you get your company out there is to recruit a team to ride your board and show off your brand. So from that perspective, for a single-player, if you're not online at all and you just want to play through the story of the game, that's how teams are integrated: you recruit AI team members as the story progresses, and over the course of the game, you become more famous, and more central to the world.~~But the next level is, if you're playing single-player and you're online when it comes time to recruit team members, you can recruit them through your online friends lists,~ he continues. ~Then you can play the game co-operatively with your friends. We're still juggling player limits for this, but the really cool thing about this from an AI standpoint is, once I've recruited you into my team, you're a real team member: you've created a character in your game, and you've brought it into my game. When you're not online, you're still in my game: the guy looks like you and skates like you, and we know all that stuff about them. And you play the same team-based challenges, the races, the trick challenges, as you would in standard single-player.~This all sounds totally dope, but the real focus of today's unveiling is the pure online team stuff. ~The third use for teams is actually creating a separate team from the single-player team,~ says DeLong, who has now used the word 'team' so much in such a short space of time that everyone else has to avoid it for a few hours while it goes and has a quick lie down out back. ~This is where you can get together as a group of 15 players.~ Confusingly, actually playing together online maxes out at six people at any one time, but, such disappointments aside, the handful of modes we get to see are well-tuned for the smaller group cap.First up is Domination, which flings you into an arena with a number of spots to control by performing the most tricks inside them. It's almost an RTS, really, and at the end of each round, the team that owns the most real estate wins. ~The idea is to think about the space in terms of management,~ says DeLong. ~There's an odd number of spots, so you can never tie a game. You have to really be thinking about what your team is doing, and what the other team's likely to be doing.~"}