{"ref": "https://www.eurogamer.net/james-camerons-avatar-the-game-hands-on", "date": "6 Nov 2009", "game_name": "James Cameron's Avatar: The Game", "text": "Was that a Warthog? I could have sworn... Given Halo seems to have informed Big Mad Jim's upcoming scfi movie more than a little, it's unsurprising to see it making its presence known in the spin-off game. Pandora (confusingly, also the name of the planet in Borderlands) is a lush land of human soldiers in vehicles battling alien humanoids with a tribal bent - it's familiar, if rather more ornate, territory. But this isn't Halo, nor is it yer bog-standard made-in-eight-months movie adaptation. Avatar really wants to be its own world, and its own game.Point Of Importance The First: you very quickly get to pick whether you'll fight for the humans' RDA, a double-whammy of scientific investigators and military suppressors, or for the indigenous Na'vi, a sort of 10 foot tall, spear-wielding Blue Man Group. The game changes dramatically depending on which you swear allegiance to.~It was a challenge to me and my team,~ says lead writer Kevin Shortt, ~because you have one story and suddenly it branches off, not just in terms of you playing a different type of character, but the plot of the story changes, the locations are different... It was a lot to manage.~ The RDA are close to traditional FPS, though it's actually from a third-person perspective - a first-person-with-more-shoulder-shooter, if you will. They have access to jeeps and tanks and boats and mech suits, all in Avatar's angular, industrial-military style, but mostly they'll be shooting the local wildlife in the face.The doe-eyed, wavy-tailed Na'vi are more melee-based, wielding a selection of spears and staffs to decimate their man-shaped opponents at close range. They're also able to use the environment somewhat - triggering explosive plants to splatter the enemy, and using some fairly delineated paths to bound across the forest canopy in the name of speed and tactical advantage. Sadly, they're not the tree-swinging free-runners suggested in Avatar's trailers - you largely go where you're told, rather than scampering up any old trunk.Point Of Importance The Second: you win experience points for every kill. Which lends it a second Borderlands comparison - a shooting game with levelling up. Certainly, it incites a little of the same lizard-brain hunger for ever-bigger numbers. Even in the few hours I had with the preview code, I found myself ignoring the mission goal and gunning down any roaming VIper Wolves (like wolves, but a bit snakey) I could find in the hope of points, points, points. Unlike Borderlands, levelling up doesn't involve any choice - simply, whenever you level you unlock a preset bunch of new weapons, skill and armour. It's possible to customise your character a little by sticking to punier armour because you prefer the look, but it's not entirely advisable.The skills involve an element of preference too - you can assign up to four to your pad's face buttons, which means you play favourites. Do you want stealth, knockback, health recovery, damage boost, what? It ties into the fundamental choice you make, regardless of which side you play  for. Are you a Sneaky Simon or an Angry Andrew? It's not possible to avoid direct confrontation for any real length of time, but the skills you err towards definitely define whether you play defensively or aggressively. So the levelling hinges on wondering what toys you're going to be given next - and as long as Avatar continues to shower you with fun things, that's a good old reason to keep carving up those Viper Wolves."}