{"ref": "https://www.eurogamer.net/saw-review", "date": "5 Nov 2009", "game_name": "SAW", "text": "The twisted misery of a mental asylum has been something of a happy stomping ground for horror gamers in recent years. From the meanderings of Manhunt 2 to practically every Silent Hill game ever, there's no better place to conjure tension as you fumble through the grim darkness armed with a nailbat.Unsurprisingly if you've seen any of the six films, Saw positively revels in such rancid locales, and sticks to the the grisly torture porn formula. The victim, Detective David Tapp, must explore the confines of an abandoned asylum, disarm gruesome devices and solve puzzles to ensure his survival and get closer to the 'truth' behind the Jigsaw Killer. To kick off proceedings, Saw sets up the game like a typical scenario from the movie. Tapp picks up a nearby dictaphone, where the gravel-voiced Jigsaw relays a chilling monologue, giving brief instructions of how to further your progress.In true Saw tradition, nothing is ever straightforward. Finding keys to locked doors involves delving into syringe-filled toilets or vats of acid, while blood-smeared toilet walls offer clues to lock combinations. Death is often a footstep away as you creep barefoot over broken glass avoiding tripwires, or open a door to discover another shotgun trap. En-route, other inhabitants of the asylum will emerge screaming from the darkness of their own crazed survival missions (that, predictably, involve killing you), forcing you into a brutal melee face-off that inadvertently parodies the very worst elements of survival horror combat.18 weapons lie dotted around the environment for you to wield, but each and every one is as as cumbersome as the last. For the most part you've trudged around with a bat, pipe or mop handle, but occasionally will find a Molotov or pistol with which to quickly dispatch your foes. Ridiculously, you can get stuck in a damage loop, unable to inflict a single blow while your opponent hacks away at you. At least you can do the same to them, slugging it out (often unarmed) while blood pours off them. It's as bad a combat system as I've ever seen. The only tactic involved is to simply hammer the button and hope for the best.Despite or perhaps because of this, a suitable panic infuses every single encounter - not least with those enemies fitted with proximity bomb collars. Stray too close and your own collar starts bleeping, leaving you with little choice than to leg it until, eventually, their head explodes. Such panic almost guarantees that you'll occasionally stray into the path of a previously unseen tripwire, one of the cheap but most effective ways of putting you out of your misery. Happily, you can set up your own death traps in which to to lure enemies to their doom, including electrical or gas traps (all in the name of closure, Detective Tapp). Progress is generally 'rewarded' with further opportunities to die horribly - usually involving BioShock-style against-the-clock circuit puzzles, or aligning steam valves to stop you being gassed to death - or sometimes both at the same time if the game's feeling particularly evil, which is often."}