{"ref": "https://www.eurogamer.net/eg-expo-2009-indie-games-arcade", "date": "5 Nov 2009", "game_name": "Reviews", "text": "With the boom in download gaming and the crossover successes of the likes of Braid and Flower, indie showcases like the Eurogamer Expo's Indie Games Arcade have turned into the games industry equivalent of the Sundance film festival. Just as Hollywood power-players go hunting for edgy young talent to suck dry in Utah, Nintendo's been spotted scouring the likes of IndieCade and the Independent Games Festival for titles to add quantity, quality and a touch of arty credibility to WiiWare.It's reassuring, then, that all the attention hasn't gone to the heads of the indie community or of show organisers like Pixel-Lab, who put together this year's line-up for the Expo. It was the classic indie mix, in the classic proportions: pretentious puzzle platformers, eye-melting retro throwbacks, cute puzzle games, aesthetic experiments, and contemporary art installations rubbing shoulders with one or two games with mainstream commercial aspirations.Those in the latter category should be already familiar to you, so I won't spend much time on them here. Darwinia+ is finally heading to Xbox Live Arcade and is but the latest chapter in the long tale of indie champions Introversion.The kamikaze multiplayer Mario Galaxy of Plain Sight from Beatnik Games we previewed back in January, and you can finally expect a release soon.Hello Games' amazingly slick motorcycle stunt game Joe Danger is something we got wind of more recently. It created the biggest buzz on the Indie Arcade and beyond, with some show-goers naming it their game of the whole Expo. A few minutes at the controls and it wasn't hard to see why; it's a tactile riot, as redolent of classic Nintendo as RedLynx's Trials. But now for the real spirit of independence.You might know this soothing minimalist strategy game by its former name Dyson, as it was called when Jim fell in love with it at this year's IGF. The perennial darling of the indie scene, by Rudolf Kremers and Alex May, is now on sale from Steam and similar.It's a perfect example of how independent developers can take an overcooked mainstream genre - in this case, real-time strategy - and not only find an attractive new style for it but reverse-engineer it back to its roots. Growing seedlings from vector trees and sending them in swarms to combat enemies and colonise circular asteroids looks as tastefully refined as Habitat wallpaper, but plays like a primal StarCraft in slow motion."}