{"ref": "https://www.eurogamer.net/tekken-6-review", "date": "2 Nov 2009", "game_name": "Tekken 6", "text": "If you're looking for the current beat-'em-up champion here in the West, look no further than Street Fighter IV. Upon finally reaching G1 earlier this year, after many hours in championship mode, a glance at the leaderboards revealed I was still ranked below 6000 more dedicated players. Eek.But in Japanese arcades the popularity contest has gone a very different way. The latest statistics from Arcadia Magazine suggest that Tekken 6: Bloodline Rebellion has the largest audience, followed by BlazBlue, Melty Blood, Guilty Gear, and then Street Fighter IV. When you consider Tekken 6 has been out in Japan since 2007, the continued devotion is even more impressive.The question is, does the long overdue console port of Tekken 6 have what it takes to wow the West?Graphically, Tekken 6 shows a bit of age but is still attractive. All the characters have been well realised, with a standard of detail comparable to SoulCalibur IV, if not quite beyond Virtua Fighter 5. Animation is also top notch, with each combatant faithfully representing their chosen fighting style - albeit with inhuman strength and reduced gravity. Namco has also furnished Tekken 6 with an optional motion blur, which communicates a greater sense of momentum.Underneath the new textures and added polygons, all your old favourites like Jin, Hwoarang, Nina and Paul have made it into the game along with six new fighters, giving Tekken 6 a 40-strong roster and a new variety benchmark. The new bloods are three new guys and three new girls, with the larger than life Bob my pick of the litter. His flamboyant flips and pirouettes are at odds with his excessive girth, and I can't help smiling at names like ~rolling kebab~ and ~supersize missile~.For those players eager to make the jump from Tekken 5 to Tekken 6, be warned that Namco has made significant changes to a handful of characters. Most noticeable is Yoshimitsu and his new double sword style. One of Yoshimitsu's unique strengths throughout the series has been his crazy stances and unblockable sword attacks, and although he retains many of his classic moves, the ways in which they combo together have been drastically reworked. It's not just Yoshimitsu though - Marshall Law has also received a few tweaks. The JKD Chef is a few moves up from his Tekken 5 outing and looks more Game of Death than ever in his black and yellow tracksuit.Despite these changes there is much about Tekken 6 which feels familiar, and if you're a Hwoarang, Bryan or Eddy player, you'll find the old juggle combos still work as well as they used to do. Indeed, the new fighting system isn't much of an evolution from Tekken 5. The emphasis is still on juggle combos where both players fish for a launcher whilst playing a mental war of low, high, throw and counter.But Tekken 6 also adds the new Bound system, allowing players to bounce their opponent off the ground during a juggle combo for an even more viscous assault. The airtime this creates is the longest in Tekken history, with a high-level ~bouncy castle~ combo doing slightly over a third of full damage on average. However, the damage scaling usually kicks in before things get too silly.The other new mechanic is Rage. This is activated during your last slither of health and increases your damage output. Usually this doesn't change the outcome of a match, but there have been instances where I've suffered a galling defeat at the hands of a Rage-fuelled Bound combo - in some cases going from half health to nothing. Clearly it's designed to give people one last shot at victory, but the problem with it is that the increase in damage is so great that you probably won't get the same opportunity should you find yourself on the receiving end. It doesn't break the game, but the game would arguably have been better without it."}