{"ref": "https://www.eurogamer.net/dantes-inferno-eg-expo-hands-on", "date": "27 Oct 2009", "game_name": "Dante's Inferno", "text": "I've just killed King Minos, the Cretan ruler who, until quite recently, sat at the entrance to the first circle of hell proper, judging the fallen and assigning them to their particular circle of torment according to their sins. A little unfair, you may think, as he was really just doing his job, but the bastard started it. Playing through the first level of EA's adaptation of the legendary epic poem at the Eurogamer Expo this week, it's hard to argue that Hell is rendered with spectacular ferocity, and that nearly every possible detail represents some aspect of eternal woe and torment. In the background, torrents of flailing, screaming damned tumble from the gaping mouths of demons into the fiery pits below as Dante carves his way towards his goal.Walls of shrieking, grasping souls clamour desperately for the succour of the living, providing convenient handholds for Dante to scale the cliffs and precipices of the funnel of damnation leading down to the eternal city of Dis. Even the doors in Hell are personified by the harrowed lost, their barriers only surmountable with a quick thrust of Death's scythe and a jagged upward sawing, rending them asunder with a throaty howl. It is quite the grim experience. And, as mentioned, people keep starting on you.For a game which has you killing Death himself in the opening tutorial, ambition of scale was always going to be high on the agenda. This is Hell by Hollywood, with the howling undead exploding from the ground in plumes of fire and brimstone, Dante's swings and swipes dismembering their cadavers like so many grouse on the Glorious 12th. These common-or-garden condemned are soon dwarfed, however, by spiral-horned fiends who put up much more of a fight with their flaming blades, breaking Dante's blocks with charged attacks and knocking him down for the lesser beasts to pounce upon. These larger enemies can be bested by hammering away with combinations of blows from the scythe and the stunning power of Dante's mystically imbued cross, but a far more satisfying method of dispatch is to weaken them until a helpful button icon appears above their heads. Replying with the correct input slings out the scythe, latching onto the neck of the monster and swinging Dante around to put him on its shoulders, blade at its throat. Then you pummel the circle button to perform a quick decapitation manoeuvre, and revel in the accompanying fountain of diabolical ichor."}