{"ref": "https://www.eurogamer.net/borderlands-final-hands-on", "date": "16 Oct 2009", "game_name": "Borderlands", "text": "Halfway into Borderlands' development, Gearbox Software changed everything. A game that started out a dour shower of browns, greys and post-apocalyptic shadows was fed through the Crackdown filter and came out a blaze of SEGA blues, Mario shine yellows and Jet Set cel-shading. The visual rewrite has done more than merely distinguish the game from its nearest rival, Fallout 3. It also accentuates the Mad Max humour of planet Pandora's inhabitants and scenarios, turning grisly headshots into party-popper exclamations while, to be frank, making the world a far more pleasant place to be. Any tourist of a science-fiction planet overrun by rag-wearing sand-bandits acknowledges the risk of having one's balls torn off by a pet rabid mutant hyena. So why not balance the dark risks with some bright, happy vistas?Twisting graphical conventions isn't Borderlands' only novelty. From its unique concoction of ideas plucked from varied influences, Gearbox is hoping to birth an entirely new sub-genre, the RPS, or ~Role-Playing Shooter~, as they're calling it. In truth, this is really just a catchphrase way of articulating a more general trend in action games that has gained momentum in recent years: combining first-person run-and-gun combat with player-defined character progression. As with Fallout 3, your character earns experience points for every kill and mission completed. At level-up, you earn a single skill point that can be spent on one of 21 ability upgrades, increases to accuracy, fire rate, weapon magazine size and suchlike. As you spend points on those areas that best suit your own play style, so a gently unique character of your own making emerges.Character development is, as with Fallout 3, nested within a more general RPG-style mission structure that, after the first few hours at least, provides a few slightly diverging mission paths to chase down. Agree to take on a mission, either from one of the game's surprisingly un-chatty, archetypal NPCs or one of the bounty boards found in town, and a marker will appear on your radial compass, indicating where to head. While billed as open-world game, the first six hours offer relatively little freedom to roam the planet of Pandora. Instead, the world is gated, different areas opening up gradually; play interrupted by a loading screen interstitial when traversing from one to the next. In this way, Borderlands has more in common with the most recent Red Faction than GTA or Oblivion: the scaling freedom is slow to filter down to the player.The fact the game favours the FPS side of its split personality is revealed in the early missions you are charged with, which are generally thinly-veiled fetch-quests, often for mundane objects: collect eight flowers from this canyon, defeat eight skags (the aforementioned mutant hyenas, whose mouths flap open like lewd flesh envelopes) in that one. Conversely, the combat is furious and exciting, adopting Call of Duty's control set-up and exhibiting all the pace and spectacle of Fallout 3's shootouts, albeit with battle outcomes decided by physics calculations rather than a series of concealed dice throws."}