{"ref": "https://www.eurogamer.net/pixeljunk-shooter-hands-on", "date": "9 Oct 2009", "game_name": "PixelJunk Shooter", "text": "Like Eden, and Monsters and Racers, PixelJunk Shooter is a 2D game that belongs firmly in the 21st century. Its simple, bright environments are rendered in perfect, crisp 1080p. Gameplay-wise it's familiar, inventive and deceptively complex. You fly your little ship through gloriously glooping levels full of magma or water or turgid black gunk, using your gun, missiles or grapple to manipulate them so you can get through. The game plays with physics and magnetism and heat, throwing little alien enemies into the mix as well that skitter around and shoot things in your direction. It's part 2D shooter and part puzzle game, a mixture of sleek, modern visuals and physics and endearingly old-school concepts - just like its successful stablemates. Except hopefully not as uncompromisingly difficult.The game's levels are grouped into three worlds whose levels all have different environmental features. Typically, there are pockets of lava or water or gunk behind destructible rock, and setting them flowing free through the level has all sorts of effects. Lava melts ice, obviously, but lava and water combine to make more rock, and the poisonous black stuff that fills the final world turns into deadly toxic gas when it meets water. Occasionally there are power-ups, like a lava gun, that let you manipulate the elements more directly, but usually you're guiding a lava flow towards an impassable block of ice, or dragging heavy lava or water bombs across a level to blow through an obstacle.If your ship gets too hot, you have to dive into water to cool down before you explode - or, if you're playing co-op, a friend can grapple you to safety. The black stuff in the final world is deadly; you have to either stay the hell away from it or find a magnetic power-up that repels it from your ship. As well as simply getting through the levels, there are little subterranean survivors to collect and rescue with your grapple hook. Figuring out how to rescue them before unleashing a torrent of magma to clear the way to the end of a level adds a little extra strategic depth.Most of the fun in PixelJunk Shooter lies in playing around with the elements. Shooting through magma flows sends disrupted globules of lava splashing over the sides of things. Missiles explode on contact with it, which serves no purpose at all other than making explosions. As you sink your subterranean craft into water or grapple something heavy, you can feel the palpable change in handling. The nasty black gunk, meanwhile, is magnetic - you can feel it pulling your ship in its direction. There's sophisticated code under the hood here.As Q-Games' Dylan Cuthbert explains, Shooter actually taxes the PS3 hardware more than you might expect at first glance. ~It's the way the fluid flows and mixes and blends,~ he says. ~We're actually using the PS3 to quite an extent, because fluid dynamics aren't easy. There aren't many examples of it in any other game. To get that many particles moving on the screen required quite a lot of SPU usage on the PS3. It's come out really nicely, though, and we can do a lot with it - we can have a screen full of water, and it doesn't slow down at all.~Even with two players, several enemies and a lot of dynamic fluid on the screen at once, PixelJunk Shooter doesn't appear to be straining itself at all. It looks lovely, perfectly smooth and stylistically consistent. The end of the second world even hides a screen-filling boss monster with destructible gun-turrets."}