{"ref": "https://www.eurogamer.net/psp-minis-review", "date": "7 Oct 2009", "game_name": "Reviews", "text": "The decision to open up the PSP to smaller snack-sized downloadable games is hard to fault. After all, it's often from these low-risk, high-concept projects that the brightest ideas emerge. Heading off competition from the iPhone is also clearly a factor, which is why the initial 13-strong line-up feels less than convincing - despite some absolutely fantastic titles.Pricing is certainly area where the Minis concept feels poorly developed at launch, especially since gamers can be strangely more sensitive to price differences at the lower end of the scale. None of these games comes in much under the £2.50 / €3 barrier and there's certainly nothing to compete with the pennies-priced lower tier of the iPhone range, where gamers can gamble on an impulse purchase with greater confidence.Meanwhile, with seven of the 13 opting for a top bracket £3.99 / €4.99 price point, many titles are already nudging up against some of the cheaper offerings elsewhere on the PlayStation Store. This makes it hard to determine what, exactly, the point of difference is for the Minis range.Such commercial quibbles will hopefully settle down as the Minis line becomes more established and developers find the ideal balance between profit and price promotion. In the meantime, let's take a look at what sort of first impression the games themselves have made.Bubbling to the top of the list for purely alphabetical reasons, Alien Havoc fails to impress as an introduction to the world of digestible PSP downloadables.You guide an alien around rural locations, kidnapping cows and taking them back to your flying saucer. Farmers will try to stop you, naturally, and must be stunned with thrown objects to ensure safe passage. Each level becomes a question of working out the fastest route to your bovine victims, while minimising human encounters or dodging automated hazards as they follow fixed patrol paths.It's all basic puzzle game stuff, and it both looks and feels like something that would be more at home on a primary-age educational website. The pace is slow enough to make the ~Havoc~ part of the title feel misleading, while fudged collision detection ensures that the split-second dodges required later in the game are frustrating in all the wrong ways.If it were a 59p iPhone app it might be easier to overlook such clumsy and uninspired construction - or at least not feel too aggrieved when you delete it - but by staking a place at the top end of the Minis price list, Alien Havoc draws too much attention to its shortcomings.5/10The first of several iPhone ports making the leap to PSP, Bloons draws fairly obvious inspiration from Peggle. Inviting comparisons to one of the most popular and carefully honed casual games of recent years isn't a particularly smart move, but PSP owners looking for something similar will probably glean enough amusement from the result for its lack of personality to be a secondary concern.You're popping balloons rather than pranging pegs, but the concept is much the same: direct your dart, let fly and try to burst the required number before you run out of shots. Variety comes quickly, as the levels conspire to hide the balloons behind blocks and obstacles that must be either destroyed or circumnavigated through careful aiming.As a concept, it works. The physics is decent enough, but the game itself never finds the tone or hook that elevates its gameplay model into something truly compelling. On the iPhone you at least had the tactile interaction of touch-screen aiming. Using the PSP buttons, the rather ordinary game underneath isn't disguised nearly as well.6/10"}