{"ref": "https://www.eurogamer.net/lucidity-review", "date": "7 Oct 2009", "game_name": "Lucidity", "text": "There's death in videogames, and then there's death in videogames. The way to tell the two apart is enduringly simple. The first kind causes minor - if occasionally stinging - irritation: a brief round trip through the liminal world of the loading screen and back into the thick of it that happens, for the most part, only to you. The second variety is permanent, however, and it generally happens to somebody else. Somebody like Aeris, for example, or the endless waves of chirpy grunts you might chew into during a quick round of Cannon Fodder. With Lucidity, LucasArts' new platform puzzler, it's Nana's turn to meet her maker. Bun-haired, chubby and handy with the knitting needles, she's off to that Werthers' Original wholesalers in the sky. Nana's death sets in motion a journey that will lead her young granddaughter Sofi through a series of bizarre and perilous dream spaces as she struggles to come to terms with the loss.Lucidity is a game about grief, then. It's a game about grief in the way Super Mario Bros. is a game about rescuing princesses - but perhaps in the way that it's a game about jumping on mushrooms, too. In this game, grief breaks free of narrative to take on physical form, and sorrow creates a tangible terrain all of its own. It's a fairly grim journey at times. Within seconds of pressing the start button misery, self-pity and fear begin seeping into Sofi's world, poisoning forests and filling swamps with the rustle and chirp of monsters. The path to gradual acceptance leads from the very bottom of the ocean to the outer reaches of the solar system. Behind all of that stuff, though, Lucidity's sort of like Lemmings - a stripped-down, dour Lemmings that's been knocked about a bit and had most of its toys stolen. Each level pits Sofi against a hazardous landscape that scrolls steadily onwards, marching to the determined stomp of her little feet and swaying arms. The player's job is to baby-sit, helping the tiny adventurer past whichever obstacles present themselves, shepherding her over chasms filled with poisonous thorns, steering her around menacing snails and floating wisps of dangerous vapor. Luckily, you have a decent amount of equipment to help you with all of this: a bottomless toolbox filled with a carefully chosen handful of objects you can drop into Sofi's path. These range from staircases and ledges that allow you to piece together your own platforms to springs, fans and catapults which send Sofi sailing across gorges. There are also bombs to take out wandering nasties and bust through walls. All of this would be straightforward enough, but the twist comes with the realisation that your toolbox aspires to being a fruit machine as well. The gadgets at your disposal are presented to you randomly, one by one, and you quickly have to learn to work with what you're given. As with late-model Tetris games, there's also a hold slot which allows you to keep one of your items in reserve - bringing a little method to your strategy - but you're always taking a risk whatever you pick. Squirreling a bomb away for an unexpected encounter with a nasty squid might seem like a sound idea but then Lucidity will fling a gaping canyon at you, and you're left with nothing to get across with. Luckily the game's smallish arsenal has been pieced together with a thrifty sense of ingenuity, and the levels almost never paint you into a corner you can't get out of if you act quickly enough. It's a world of experimentation, where a well-placed bomb provides just enough lift to double as a staircase if you use it correctly."}