{"ref": "https://www.eurogamer.net/a-boy-and-his-blob-hands-on", "date": "1 Oct 2009", "game_name": "A Boy and His Blob", "text": "Some of you, the ones who still regret the demise of Top of the Pops and Wimbledon FC, will remember the original NES game, A Boy and His Blob, from 1989. You might remember its huge play area, its unique mechanics or its ridiculous final boss. You might remember it fondly. Or you might not. Because most of you who played it won't remember it for its innovation or quirkiness, most of you who played it will remember it because, even by the standards of the time, it was a complete, unremitting bastard of a game.For those who never experienced the original, here's the premise: A boy, unsurprisingly, befriends a blob, and said blob enlists boy on a quest to save his home planet of Blobolonia from an evil dictatorship. Blob, however, turns out to be pretty unenterprising, and needs the boy to shepherd him about in order to get anything done. Progress is only made via the unusual medium of jelly beans, of which the boy carries a number of esoteric flavours. Tossing a bean to the mercurial blob transforms it into a number of different useful objects, depending on the flavour. Ladders let you climb to nearby ledges, holes drop you through floors, trampolines bounce you upward, keys open doors. Well. One door. Right at the end.It was lovely concept in 1989, a delicate synergy between the rudderless yet versatile blob and the helpless but motivated child, like a buddy movie with Jim Carrey and Eddie Murphy. The trouble was, a great deal of the experience was trial and error. Using holes to drop through floors was an experimental process, as any drop of more than a screen would kill you and there was no way to see what lay beneath, so a fair wedge of gameplay involved dropping through holes and hoping that instant death didn't await you. Running out of appropriate beans was also an issue, especially with top-ups few and far between, and no way of knowing when they'd come and what sort of problems lay between you and them. There were five lives, with no top-ups available until more than halfway through the game. Hard times indeed.If it was to succeed as a remake, then, A Boy and His Blob needed more than just the obvious visual update. Some of that toughness had to be mitigated - the random nature of the sudden deaths and exploration ameliorated. But not all of it - the challenge was all part of the process, puzzles the game's core.Luckily, WayForward seems to be doing a stand-up job of filleting the tender meat of the experience from the unwieldy carcass. The premise remains the same, albeit disassociated further from any semblance of reality, with a number of environments to traverse collaboratively on the way to casting the yoke of oppression from Blobolonia's gooey shoulders. Beans remain the fuel of the piece, but are now infinite, albeit limited in the scope available on each stage - focusing the puzzle elements in discrete packages rather than forcing you to plan blindly for the future as in the original.Everything (water, enemies, falling) still destroys the fragile hero at once but lives are also now unrestricted and restart points are never far from your point of expiration, with each short stage divided sensibly into problem sections. Whistling for your amorphous companion reverts him to blob form again, but three whistles in quick succession will transform him into a ghostly balloon, traversing walls and obstructions to return him to your side."}