{"ref": "https://www.eurogamer.net/fallen-earth-hands-on", "date": "22 Sep 2009", "game_name": "Fallen Earth", "text": "The apocalypse has never been more popular. While literary figures such as Cormac McCarthy and Margaret Atwood give us grim, cautionary novels like The Road and The Year of the Flood, movies like John Hillcoat's adaptation of The Road, The Book of Eli (written by erstwhile games journo Gary Whitta) and even 9, the Tim Burton-produced CGI tale of sentient soft toys being hunted by machines, are all coming soon. In games, Bethesda's long-lived Fallout 3 will soon be joined by Valve bringing us more survivalism in Left 4 Dead 2, and both id and Gearbox are honing open-world, RPG-tinged, Mad Max-style first-person shooters.On the MMO side of things, meanwhile, there's the in-development Earthrise from Masthead, and Fallen Earth, from Icarus Studios and Fallen Earth LLC. They will eventually make for an interesting comparison, but in the meantime, the latter's easiest point of reference has to be Fallout 3, which nailed apocalyptic gaming with its unique retro-futuristic world and slick RPG elements. While the long-mooted Fallout MMO remains lost in a maze of Project V13 rumours and legal wrangling between Bethesda and Interplay, Fallen Earth has beaten the other contenders to the punch, arriving to pre-ordering punters recently.In this particular Mad Maxout, the main agent of civilisation's demise was the Shiva virus, a terrible disease that spread aggressively from somewhere in Asia. The resulting chaos led to nukes being used. The virus reached North America in 2056, and civil war ensued. Despite society having some remarkable technology at its disposal, notably cloning techniques controlled by state-like corporation GlobalTech, people either died or scrambled for bunkers.After the character-creation screen - where the many options for tattoos, piercings and body-paint will immediately give you a sense of what you're in for - you start in one such bunker, the Hoover Dam. The opening sets the scene, tutoring you in the game's basic mechanics while benign scientist Elena Winters holds your hand. It's an excellent introduction, packing in the information and establishing the game's strong narrative scenario well.While getting the feel of your new avatar, you learn about the cloning technology, which gets around the tricky issue of in-game death due to something called the LifeNet database of genetic information. ~With LifeNet, death is just a minor setback,~ says one faux ad. You learn about antagonist Alex Masters, a classic scientific genius and megalomaniac. And you learn about the game's faction system.This involves six groups who each have one ally and one arch-enemy. There are the Children of the Apocalypse, a technology-hating, anarchic tribal faction. Their main enemies are the Enforcers, former military and cops who have their own strict version of law and order. The Lightbearers, meanwhile, have a philosophy based around medical aid, martial arts and the belief that mutation leads to enlightenment. Their main enemies are the Travellers, who live for trade and personal profits. The Techs emerged from military and civilian engineers working in the Hoover Dam. Their faith is in science, which puts them at odds with the Vistas, an environmentalist faction originally formed to oppose GlobalTech's exploitative policies.During the tutorial, you meet representatives of all the factions, which is important as the game does not have a class system and instead your experience is strongly influenced by your factional allegiance. Each faction specialises in particular types of crafting, and - as you'll discover when you enter Fallen Earth's vast open-world - crafting is at the core of the experience.The game proper kicks off after the destruction of the Dam and your revival as a new clone. It's 2156, and you find yourself in Grand Canyon Province, 1000 square kilometres of mapped terrain that may well be humanity's last hold-out in the face of extinction. The first major decision you make is which town you want to head to; there are 70 towns in the game, each dominated by a particular faction. It's there that you find quest-givers, but also numerous traders and trainers."}