{"ref": "https://www.eurogamer.net/dungeons-and-dragons-online-re-review", "date": "18 Sep 2009", "game_name": "Dungeons & Dragons Online: Stormreach", "text": "Branding, circumstance and strange luck are all part of Dungeons & Dragons Online's history. Its timing was horrible; it leapt head-first into an MMORPG market that had just realised that it didn't want to be quite as hardcore with a game that, by its very history, was hardcore. While other games were encouraging you to fight on your own, occasionally grouping to high-five and key-tap your way to level 60, DDO told you that you needed to group and you were only getting to, at the highest, 20 - which it didn't even support initially.But while you might expect it to have skidded to an abrupt, bloody-kneed halt, it has, in fact, grown - not least with this month's huge Module 9 update, and the launch of a free-to-play version, Eberron Unlimited, in the US.DDO lies somewhere between World of Warcraft's hotkey-focused fighting and a twitch-based action RPG with functions similar to the dodging and blocking from Fable. The average goal of a DDO session is to romp through an instance, completing sub-objectives to reach the end of the dungeon and usually a narrative of sorts. These are voiced over by the bizarre baritone of the Dungeon Master, who adds a campy flair to proceedings.The thing to remember about DDO is that you don't usually get experience from singular kills. Completing quests, dungeons, and tasks net you your level-ups, rather than the monsters that make up those quests. Content is predominantly instanced, forcing players to socialize only in the public areas. These range from a simple marketplace to the gigantic floating island introduced in Module 9.That's the scene set for DDO; one of slight melodrama and dungeon-crawling that didn't exactly set the world on fire on its release in 2006, due in part to its inaccessibility and quirkiness. For every bit of slick hand-holding that World of Warcraft and EverQuest II offered, DDO threw the player into the midst of demanding encounters and complex statistics that, even to those accustomed, were at best irksome, and at worst bewildering.For the most part, that's changed.DDO has acquired a new look and feel over the last three-and-a-half years. Creating a new character is still as customisable as before, encouraging multi-classing (using the functions of both a Warrior and Wizard, say, is still very much possible) but also giving clear class ~paths~ to those who don't really know what they're getting into. This sounds obvious in the context of generic MMO archetypes of damage-takers, healers and damage-dealers, but DDO and D&D itself were not and never will be built on hard-and-fast roles. However, the game now offers an encouraging level of guidance to new players. Each step of character creation gives clear descriptions of what you're starting as; as you progress, you can effectively change class and choose a more complex path.New players begin on the island of Korthos, which functions as one of the most exhaustive tutorials in MMO history. This isn't to say that it's like EVE's bizarre mishmash of text and monotone, but if you choose to stay there (and I'd advise you do), you're going to be on Korthos some hours. It's packed full of quests, items and dungeons, and serves as an introduction to the wilderness areas of Eberron."}