{"ref": "https://www.eurogamer.net/katamari-forever-review", "date": "17 Sep 2009", "game_name": "Katamari Forever", "text": "The field is empty. It is night. There are no paper clips, tin soldiers, scraps of sushi, teddy bears, bicycles or classical guitars to roll up here. Instead, a lone man sits at a bench, straining through the gloom to read a book. Hills roll off into the distance around him, their shape and form suggested by ten thousand pinpricks of light: lantern fireflies bobbing in a silence unbroken by the flitting of their tiny, spastic wings. Your Katamari rocks in the breeze as YMCK strike up a mournful chiptune ballad. The wind sighs and the reeds bow their heads in sympathy. Then, just as you begin to feel lost in an absurdist joke, the King of all Cosmos pops into frame and, in his stoner/child patois, begins to explain.One week earlier, when showing off how high he could jump, the king bumped his head on an asteroid, in doing so clouding his memories. It's in one of these half-rememberings (first seen in the second game, 'We love Katamari') that you find yourself now. ~Look, someone studying having trouble reading...~ the king says, pointing to the man on the bench. ~We can't remember, so he can't see,~ he ponders before exclaiming, ~Metaphor!~ at his unintentional cleverness. ~Zip the lit crit...~ he rebukes himself, next delivering the mission briefing: ~Make glowing Katamari with fireflies. Help him = help us. Ah! The power of metaphors.~  The task established, you start rolling up the bright insects. Deliver the resulting ball of light to the reader within three minutes and he will be able to see and the King's memory will be restored. Metaphor!The Katamari series is ripe with metaphor. From the almost impossible to please father figure (or is he a god?) of King of All Cosmos to the very act of rolling up humanity's detritus and firing it into space, the game's messages are manifold. But, in this celebration of the series to date (in Japan the game's known as 'Katamari Tribute'), you wonder if the original, clearest message has been broken forever. You see, for all the silliness, Katamari Damacy was at heart a didactic condemnation of the developed world's rampant consumerism. Takahashi never wanted to make another Katamari game. Not only had his point been made elegantly by the first game, but also the core idea had been fully explored, its sequence of levels moving from rolling up the tiniest of objects in a Tokyo bedsit, to finally absorbing countries themselves in the bombastic endgame. So Katamari Forever, by virtue of its existence, is a conflicted product. It's a game that decries consumerism but which is itself riding a consumerist bandwagon alongside spin-off albums, hipster T-shirts and colourful merchandise, all of which clutter yet further the world it came, in its own kooky way, to save. ~Metaphor!~ as the King of All Cosmos might shout before pointing out that the above paragraph is the same size as 46 antelopes and telling us to 'zip it with the lit crit'. And fair enough because, for a great many players, the mixed message is as invisible as it is irrelevant. For these players, answers to questions such as: 'Does the game fix the camera issues of its Xbox 360 predecessor?' and 'How do the six-axis controls integrate with what was already a finely-balanced scheme?' are far more pressing. Moreover, it may be a little unfair to burden Katamari Forever's evidently conscientious creators with philosophical criticism. After all, taken as a raw product, their game is a fulsome celebration of what's gone before, and while it may not surpass its inspiration, it certainly throws a good party in its name.The core stages are divided into two categories. Those issued by the amnesiac king are reimaginings of levels seen in previous titles, albeit presented under a good-looking black and white crayon filter. A new character, RoboKing, sets the other half of the game's challenges that, while reusing series assets and level layouts, are generally new."}