{"ref": "https://www.eurogamer.net/cursed-mountain-review", "date": "17 Sep 2009", "game_name": "Cursed Mountain", "text": "These days you feel obliged to reward any Wii game that's been purpose-built for the console and isn't depressing licensed shovelware - but that's not the sole reason Cursed Mountain looked promising. Survival horror is still relatively unexplored territory on the system, and it's one genre where motion control could really add something to the experience. After all, the Wii remote is just as suited to throwing torchlight into dark corners as it is to pointing and shooting.Cursed Mountain tracks a Scottish mountain climber's ascent up a Himalayan mountain in search of his (strangely non-Scottish, judging by the voice acting) brother, who has stirred up trouble by attempting to scale the mountain without completing the appropriate religious rites. Ghosts have infested every village and monastery on the way up the mountain, leaving them desolate, empty and full of sacred barriers. Protagonist Eric must overcome these using motion controls and the religious door-unlocking trinkets hidden in obscure places. It's linear, old-school survival horror, with all the associated backtracking, key-finding and awkward combat.The setting is easily the best thing about the game. A mountain trail provides the perfect framework for the action, keeping you following the game's intended route without making you feel restricted. It's occasionally well-drawn, too; the deserted clumps of houses, narrow trails and monasteries can be genuinely atmospheric. As you get higher up the mountain there's a constant need to find oxygen canisters - searching for them does build tension, even if it does seem unlikely that they'd be conveniently hidden in smashable pots.Unfortunately, despite the occasional impressive moment when you turn a corner around a summit and catch sight of the village you're heading towards, or walk up some narrow stairs to find they open out onto an impressive Buddhist monastery, Cursed Mountain's visuals are so decidedly low-rent they ruin the atmosphere. Darkness and foggy visual effects are overused to the extent you can't actually see what's going on, which builds irritation rather than suspense. Eric never really inhabits his environment - for all his mountain-climbing prowess, he can't step over tiny bits of scenery or skirt chunks of rubble - and his animation looks incredibly old-fashioned. Ghosts sashay flouncily towards you in a strange sort of dance rather than shambling or scuttling or doing anything else remotely threatening.But the real reason that Cursed Mountain isn't frightening has nothing to do with its visual limitations. It's because you always know exactly what's about to happen. Ghosts never appear from thin air or take you by surprise - they're signposted with in-game cut-scenes showing you exactly how many there are and where they're coming from. The complete lack of enemy variety doesn't help; you have ghosts that walk, ghosts that fly and a couple of bosses. Once you've played through the first hour you've seen pretty much everything the game has to throw at you, and it gets very repetitive. There's rarely a moment where you don't know exactly what's around the corner - which is a shame, because in the two or three instances where it does manage to evoke tension, Cursed Mountain is almost entertaining.It never quite gets there, though, mostly because it's so horrible to control. Any sense of suspense or fear dissipates immediately as soon as you're put back in control of a character who can't decide whether to walk backwards or turn around when you pull back on the control stick. There's a rich precedent of survival horror games with purposefully restrictive controls - done right, it can increase the sense of tension and helplessness - but here, Eric's painfully ponderous jog and inability to turn around on the spot makes everything a chore, especially in a game which involves so much ambling about in search of obscure items to open doors."}