{"ref": "https://www.eurogamer.net/il-2-sturmovik-birds-of-prey-review", "date": "16 Sep 2009", "game_name": "IL-2 Sturmovik: Birds of Prey", "text": "Ah, the console version of the classic PC simulation. What a palaver this always is. The simulation series has built up a devoted and loyal fanbase on the PC, and they'll want reassurance that the unforgiving realism of the game they know and love hasn't been simplified into mush for its console debut. On the other hand, there's an even larger audience of console owners for whom this will be their first exposure. They'll probably be a little bit daunted by the ruthless reputation of the PC original, and looking for reassurance that it isn't too complex.Of course, balancing these seemingly conflicting audiences is what developer Gaijin Entertainment has had to do with IL-2 Sturmovik: Birds of Prey, and perhaps inevitably the studio's taken the middle path, creating a game that can be played at both ends of the spectrum, but defaults to its easiest setting, the fairly self-explanatory Arcade mode. You can't stall the plane, and you also benefit from numerous other assists. Both aiming and flight control get an invisible helping hand, while enemy and allied units are highlighted on your HUD. There's even a floating crosshair that works out the optimum deflection angle for your bullets, making it easy to place your fire where the enemy is going to be.It's a generous game as well, with a single-player campaign that offers 20 missions across six European theatres, from the Battle of Britain through to a climactic assault on Berlin that sees you bombing the Reichstag. Success in these missions unlocks new planes and pilots, as well as additional standalone missions that can be accessed separately at any time. There are 50 of these, and they're a real mixture of objective types. From reconnaissance sorties into enemy territory to testing allied landing strips in a storm, these bonus stages are also more flexible than the story missions, allowing you to alter the amount of fuel and ammo you can carry.There's also a meaty multiplayer component for up to 16 players, boasting four game modes and a raft of user-defined variables. Not only can you set the weather and time of day for your skirmishes, you can even restrict players to planes based on the year of their manufacture. Dogfight and Team Battle modes are much as you'd expect, but Capture Airfields adds an aerial twist to the timeworn base-capture objectives by landing on airstrips. Strike, meanwhile, is a more tactical option. Teams battle to destroy each other's ground units, a task that requires a balance between bombers and fighters, as well as offensive and defensive play. Sadly, the servers for the game weren't active at the time of writing, but unless there's some horrendous netcode calamity this suite of online play should easily extend the game's lifespan.The timid player can enjoy all this content in Arcade mode, the easiest setting, and not once have to worry about realistic physics literally dragging them down. Played this way it's more like Ace Combat: WWII Edition, but that's no bad thing. A button press cycles through enemy targets (hold it down to select the nearest mission objective) and the left trigger can then be used to lock the camera on whatever you're chasing. Rockets and bombs are mapped to the shoulder buttons, when available.The forgiving physics makes it easy to pull off manoeuvres that would be virtually impossible on the higher difficulties. Throwing your plane into a screaming, banking dive, skimming rooftops and then hurtling into a loop while tearing the wings off a Stuka is a genuine thrill. Flying right through the midst of a Messerschmitt squadron, guns blazing, and seeing a hail of fuselage parts roar past your canopy in balls of flame never gets tired. Faced with such cathartic moments, you'd have to be a fairly joyless simulation snob to not see the visceral benefit of more accessible gameplay.The presentation certainly helps in this regard. Jeremy Soule supplies an orchestral soundtrack that equals his rousing score for Oblivion, while Joss Ackland narrates the between-mission snippets with appropriate gravitas. Visually, IL-2 Sturmovik won't be the best-looking game you see all year, but while its occasionally chuggy frame-rate may not sound amazing, the game itself always feels pretty fantastic. Holes can be torn in your wings, allowing you to see the scenery flying by down below and also affecting the plane's stability. Speckles of soot pepper your canopy as you hurtle through the smoke trail belching from a downed enemy. Of course, the plane models are second to none, with fully working cockpit instrumentation and distinctive handling. Being able to look out over the wing and see emergency instructions in Russian - these are the small details that help to sell the flying ace fantasy."}