{"ref": "https://www.eurogamer.net/quake-live-hands-on", "date": "16 Sep 2009", "game_name": "Quake Live", "text": "Quake III - the multiplayer FPS that was arguably Id Software's greatest achievement after Doom -  has been reborn. It's been reincarnated as Quake Live, an online shooter from your web-browser. The game has been in a public testing phase for a while, and currently still bares its ~beta~ moniker. Nevertheless Id inform us that the resurrected Arena is fully launched and primed for action. The advertising-supported project is entirely free to play, and embeds in your browser of choice (on Linux and Mac too) with a simple plug-in. More improvements are apparently planned for future iterations of what has been referred to as a ~service~, but it's not entirely clear what they are. It's certainly an intriguing challenge: take an existing, ageing title and rebuild it for the net generation. It's both modern - being launched inside your browser and having a fairly sophisticated ranking and server selection system - and incredibly nostalgic, harking backing to an era when bunny hops were in and your twitch skills were dependent on whether there was any broadband around for you to use. For a returning Quaker of old, like me, it's a mixed experience.For one thing I was never a great duellist. In those one-on-one games in a small arena - which are something like Kung Fu rocketry with power-ups - I tried ever so hard to hog the red armour, but the process was always slightly beyond me. It remains so. Leaping into a duel has led me to lose, every time, with perhaps one or two lucky frags next to my ticker. Of course that never put me off in the past, and it wouldn't this time. Where I excelled in olden-day Quake III was in the team games: getting the timing right for the quad-damage in team deathmatching, knowing the route that particular flag-carrier would take out of Q3WCP9 in capture the flag. I was ferociously accurate with the railgun and rocket launcher, and - after prolonged bouts of flag defence - I would often enter that twitchy reptilian zone of not actually having a conscious register of my action. There's something special about that.When I began playing Quake Live I was initially concerned about my own status as a deathmatch player. I'm older now, and weaker. Years of slower, more sensible games had, I assumed, enormously reduced my twitch. Worse, the (rather clever) automated tutorial made me think that my pinpoint reticule-plonking skills - earned the hard way in the early part of this decade - had decayed to a hopeless degree. It was only when I was out on the floor of live matches, strafe jumping away, that my rhythm returned and my accuracy bubbled back up to 2002 levels. When I realised I could compete on the higher difficulty levels (Quake Live allows admins to suggest skill levels for servers) I found myself grinning like a fool. Still got it eh, Rossignol? Something like that...It's a testament to how finely-tuned Quake III was that once you're into Quake Live's game it barely wavers a pixel from the original format, although it's been smartened up a great deal in terms of presentation and UI. (Because, well blimey, didn't Quake III just have a bastard ugly menu?) All this means is there are some minor differences with the way settings are made available, and the game content is, of course, largely limited to Id's own Quake releases, with a few third party maps included for good measure. There's also a comprehensive achievements set for you to earn, because, well, that's what the kids seem to want these days.The physics for movement and weapon use, those ever-so precise settings which made Quake III the apex of the fast-paced deathmatch genre, are intact and undisturbed. It still has the kind of pace and arcade-FPS feel that put so many people off, and that very interface seems slightly incongruous in these slower times of cover-systems and regenerating shields."}