{"ref": "https://www.eurogamer.net/metroid-prime-trilogy-review", "date": "8 Sep 2009", "game_name": "Metroid Prime Trilogy", "text": "Looking back, perhaps the most galling aspect of the GameCube's relative failure was that two of the best games of the past decade never reached a wider audience. Anyone who experienced Retro Studios' twin masterpieces, Metroid Prime and Metroid Prime 2: Echoes, will know that both of them deserved to be hailed alongside the very biggest brands in gaming.Simply put, both games excelled at everything they did. The challenge was greater, the design more intelligent and imaginative, with intricate, varied and fully-realised worlds alive with lavish detail and absorbing atmosphere. How these shooter-adventures weren't multi-million-selling worldwide hits has always been a source of personal frustration. Even hardcore gamers seemed reluctant to give them a try.The 2007 release of the series' conclusion, Corruption, provided some comfort but also a few niggles. The revamped Wii controls were tailor-made for the first-person shooting. At the time, we noted that the lock-on free-aiming system ~gives a degree of fluid, accurate control that's far and away the most intuitive, satisfying system anyone's come up with on a console.~The idea that Nintendo and Retro might some day go back and apply these control enhancements to the first two Metroid Prime titles seemed almost too good to be true. The New Play Control reissues we've seen lately gave us hope that it could happen, but to throw all three titles onto a compilation package was beyond our wildest dreams. Not since Super Mario All Stars in the SNES era has Nintendo taken an opportunity to unite one of its great series in such an irresistible way. Better yet, Retro hasn't thrown the package together without love. It has retooled the controls for the two GameCube episodes, added a full 16:9 widescreen mode, improved some of the texturing, and even rebalanced the games to answer the barrage of complaints about some of the howlingly unfair difficulty spikes which many will ruefully recall - especially from the repeatedly spiteful Echoes. As a result, we're presented with a definitive collection which will not only appeal to those who missed out, but offer a tantalising opportunity for fans of the series to experience enhanced versions of some standout, must-own classics.This generously-priced collection also presents a long-overdue opportunity to put the series in some sort of context. Released over a five-year period between the end of 2002 and 2007, the Prime games brought Metroid into that select club of game series which successfully negotiated the notoriously tricky transition from 2D to 3D. Retro not only managed it, but did so with breathtaking style.When Metroid Prime made its debut in October 2002, fans were quick to jump on anyone daring to call it a first-person shooter. That was a little overzealous, looking back, but it's certainly fair to say that it's a multi-faceted title that involves a whole lot more than shooting aliens in the face. By retaining all the elements which made the original Metroids so revered, it fused platforming and puzzling with intense combat, while retaining the intricate game-world design that rewarded patient exploration.It also kept upgrading at its core. Additional weapons and components would gradually allow the power-suited space-heroine Samus to take on new challenges, explore areas previously off-limits, and generally beef up her abilities across the course of the adventure. The Metroid Prime games made fighting boss monsters a major event, and the generous rewards always felt appropriate after such memorable and taxing encounters. Often screen-filling, generally challenging, and imaginative in design, some of the key encounters (especially in the fearsome dark/light world of Echoes) became some of my own personal favourite boss encounters in videogames history. Driven by the chillingly insistent soundtrack, they were the sort of games that forced you, at such frantic moments, to press pause and furiously shake the strain out of your hands."}