{"ref": "https://www.eurogamer.net/katana-zero-review-its-groundhog-day-with-a-sword", "date": "30 Apr 2019", "game_name": "Reviews", "text": "The thing that Katana Zero really shares with Hotline Miami, over and above the publisher, the super-violence, the story of drug-addled killers, the glitchy way reality seems to be a corrupted save file, and the enduring love of lurid, hangover pinks? The thing it really shares is the awareness that a certain kind of punishing and precise action game is always itching to turn into the robbery scene from Groundhog Day. There's Bill Murray stood on the street corner. A bullion van is unloading money. He walks across the road and starts counting. One, two, three. Dog barks. Five. Car passes. Seven. Guard spills quarters. Eight, nine, ten. He grabs the money and disappears. It seems effortless, but it's hard work. Years of practice. He's done it over and over to make it look that easy.Katana Zero gives you a bit more to play with, of course. One, two, three. Open the door and slice two guys to pieces. Five. Jump in minecart. Seven. Hit signal to change tracks. Nine. Out of the mine cart and use it as a shield against the laser grid. Ten, eleven, twelve. Molotov cocktail and knock back incoming bullets. Yet despite the variations - the mine carts, boss fights, bikes-versus-helicopters, armoured baddies and explosive chuckables - for the most part Katana Zero's laboratory of nastiness is built around a few simple tools. You have a sword attack with a decent reach. You can pick things up and throw them. You can jump. You can slow time. You can dodge-roll. And beyond all that, there's the conceit that the game's action is played out in your mind as you try and retry each encounter, looping back through time with each failure and finding the best way to tackle the groups of foes you encounter in this finely-calibrated 2D world. When you finally make it to the end of one of the game's shortish scenarios intact? Then you commit, and you get to watch a polished playthrough of what you've just done - your solution to a bloody temporal puzzle - played out on CCTV. Onwards!There are elaborate justifications for all of this. An antihero veteran navigating PTSD and addiction to a drug that allows them precognition abilities, a grim throwback cyberpunk world of trashed lots and ragged tenements. Creepy conversations with a therapist - they are a therapist, right? - and sad nights alone in an apartment with cable news unspooling the story of your latest atrocity and interesting neighbors through the walls.  Katana Zero has real narrative ambitions, plenty of mysteries and dream sequences, and it's all enlivened by a conversation system that allows you to interrupt, to obfuscate, to shut people down as if chat itself was a rhythm action game. Nice as all this stuff is, though, the game lives in doorways, just as Hotline Miami did. You on one side of the door planning what to do with the people on the other side. And then trying to do it, and then trying to do it again. And again.Variation never seems to weaken the appeal. Smoke canisters are fun, as are stealth sections where you've switched the lights off and slip past shadows, returning with a flamethrower. Boss fights are surprisingly entertaining for a game in which most scraps are over in nanoseconds. There's a lot of fun had with the themes for the various locations you work through, yet the whole thing retains the immediacy of a game built around very simple, and brutish, delights. How do you want to tackle the next five seconds? Well that went badly. How do you want to tackle it knowing what you know now? How do you want to ace it?It's the almost invisible details that make it sing. The lovingly crafted way that bodies collapse to the ground, the weirdly brilliant Chopin pastiche in the therapist's room, the puff of flames as a molotov hits a chain of barrels, the shake of a police van coming to a halt. More than anything I love the process of opening doors. It took me an age to work out how the game actually handles it. There didn't seem to be a button press involved, it was almost like the game was responding to my impulse as I waited for patrols on the other side to synchronise with my own horrible schedule.That's the trick really. When you have the ability to loop back as you work your way forward, the whole thing becomes scheduling. Turn here, strike here, jump here, Molotov. One, two, three. Dog barks. Five..."}