{"ref": "https://www.eurogamer.net/professor-layton-and-pandora-s-box-review", "date": "8 Sep 2009", "game_name": "Professor Layton and Pandora's Box", "text": "Perhaps the first mystery to solve in the sequel to the enormously popular puzzle adventure Professor Layton and The Curious Village is what the game is about. Released in the US as Professor Layton and the Diabolical Box, and later this month in the UK as Professor Layton and Pandora's Box, it is a game about Professor Layton and an artefact known as, er, the Elysian Box.Those more classically educated than wot I is might know of a connection between the fields of the Underworld in which heroes would find their final rest, and the jar nosy-parker Pandora went and opened, causing all the bad things in the world like swine flu and straight-to-DVD American Pie sequels. I do not. However, ignoring all this and focusing on the story of the game itself doesn't exactly make things any clearer.If you played the wonderful Curious Village, you'll know the deal here. Professor Layton is a top-hatted gentleman of refined manners, accompanied by a young boy named Luke. Together they investigate mysteries via the pleasure of solving puzzles. As such, the games are essentially collections of around 150 short puzzles framed by an elaborate story. It would be unrealistic to claim that the stories link the puzzles in any meaningful way, while equally incorrect to suggest the narrative feels like an aside. Each is marvellously imagined and detailed, despite neither quite aligning.The delivery in Pandora's Box is mostly identical. The mystery begins with the rather sudden murder of a friend of Layton's, Dr Andrew Schrader, which appears to be connected to the mysterious Elysian box that was in Schrader's possession until the time of his death. In searching his study, Layton discovers a peculiar ticket for the Molentary Express, a luxury steam train that travels through the English countryside - peculiar because it states no particular destination.Layton and Luke get themselves tickets for the train in order to explore the mystery behind the death and the box. Along the way, everyone they meet and everything they see offers a puzzle for you to solve.The original was mocked for the seeming insanity of its characters, people refusing to give them directions or sell them a room in a hotel unless our heroes could figure out the age of the younger daughter of a family based on some mathematical clues, or complete a maze. Anyone who played the game to the end would understand precisely why this happened, making those who scoffed look appropriately ridiculous. I shall not spoil the ending of the first game, but suffice to say Layton and Luke are rather astonished when they discover that also investigating Schrader's murder is one Inspector Chelmey. Luke pulls at his face just to be sure.But if the original was confusingly convoluted in its logic for a village of puzzle obsessives, Pandora's Box is a tangled madness. There's a train full of them, then one town packed with more, then a further, more mysterious city positively rippling with puzzling fanaticism. The explanation is so mind-boggling you'd not believe me even if I did spoil it, which I clearly shall not.Once again, the presentation is absolutely stunning. It mixes animated sequences that approach the gorgeousness of Hayao Miyazaki films with hand-painted backdrops and more simply animated characters, all beautiful. The dialogue is smartly written, and often very witty, delivered in a somewhat muddled combination of standard bleepity-bleep tones as text appears and brilliant voice acting from a strong cast - with one rather enormous exception. Lani Minella's Luke is still so phenomenally irritating that you want to push him under the rails of the Molentary Express every time the voice pipes up. (This is never worse than when, after completing a puzzle, he smugly declares in his lunatic accent, ~That wos oolmost too oesy~.)Much larger, more interesting locations make for a deeper and definitely weirder game. However, the weirdness tips over into inappropriateness on a couple of occasions.It's very tempting to make jokes about a strange older man hanging out with a ten-year-old boy to whom he is apparently unrelated, but it seems a shame to, since it's clearly so innocuous and innocent. But the game itself starts to poke at that with an early sort-of-joke where their connection is about to be explained to someone when it's rudely interrupted. (Apparently the fourth game in the series – part three is already out in Japan – is to be a prequel explaining how Luke came to be Layton's apprentice.)"}