{"ref": "https://www.eurogamer.net/dark-void-hands-on", "date": "4 Sep 2009", "game_name": "Dark Void", "text": "Never mind trade shows - not being Resident Evil or Street Fighter, poor old Dark Void struggles to make itself heard over the din at Captivate. It - wait, hang on, I've done this intro before. Then again, in its Captivate 09 demo of a playable level from midway through the game, Airtight Studios is in same-again mode too, emphasising the contrast - and cross-polination - between the jetpack dogfighting that draws from the studio's roots in Crimson Skies, and the third-person cover combat that makes up the rest of the game.Not that a little reiteration isn't welcome, because we haven't heard much from the Void since it made its entrance last year. Speaking on the opening evening of Captivate 09, Capcom executive Mark Beaumont said he thought it could be one of the publisher's ~most significant~ games of 2009 by the time it comes out simultaneously on PS3, Xbox 360 and PC. Is it?The demo begins as protagonist Will - stranded in The Void, along with Nikola Tesla (his mechanic!) and others who stumbled through the Bermuda Triangle - approaches a prison installation along with his allies. The prison is run by the game's antagonists - the mysterious Watchers, who generally take the form of bipedal robots, despite Airtight's hints that their occupants are somewhat different to you and I.Initially it's a mixture of dogfighting with UFOs and taking out anti-aircraft guns that are targeting your allies in transport ships. Using the left stick to manoeuvre and turn through the air and the right stick to move the camera, it's a slightly disorientating hybrid of flight combat and third-person action. Will can change to hover mode and use a fairly standard zoomed-in over-the-shoulder third-person attack, or he can zip around like Rocketman firing willy-nilly. There's a radar in the top right to help locate enemies, and a right-bumper ~nearest enemy~ indicator, which spins the camera to lock on so you can steer onto target, although you have to aim manually either way.The AA guns are pretty straightforward to take out, but the UFOs can be fought unconventionally by hitting the hijack button as they pass or you get onto their tail. This swings Will onto the exterior, where he has to dodge laser blasts and try to rip open a panel to expose the pilot, who he then executes after a bit of left-stick quick-time waggling. It's then possible to pilot the UFO - its gyroscopic cockpit rotating in opposition to the outer ring that sweeps this way and that as you tour the sheer geology of the Void, darting between craggy spires amidst unnatural lighting.With the AA guns dispatched, Will descends to the landing pad and engages in God of War-style cover shootery, dodging between and hurdling cover points manually or when prompted, and engaging enemies with left-trigger zoom and right-trigger gunfire from the standard assault rifle. The prison structure embedded in a cliff-face is a mixture of Close Encounters' otherworldly colouring suffused with discomfiting post-Covenant purples, amidst slickly nefarious technology bristling with alien utility, within which you can also toss grenades, and make use of your jetpack's hover function to try and flank if you're that way inclined."}