{"ref": "https://www.eurogamer.net/firemint-real-racing-review", "date": "3 Sep 2009", "game_name": "Firemint Real Racing", "text": "When was the last time Eurogamer praised a game for its lens flare? The visual flourish so beloved of the late 1990s became a cheap trick; once a sign of contemporary graphical frisson, it was fast turned into a cliché through incessant use. But as you clutch your iPhone like a miniature steering wheel, tipping your body left and right to negotiate high-speed chicanes, the flash of Real Racing's lens flare is almost an epiphany.Like the very first time you set eyes on the PlayStation's Gran Turismo, it's a vision of the impossible: evidence that videogames may surpass even the wildest imaginings of our youth, squeezing worlds into pockets. From Nokia's primordial Snake, the mobile phone game's evolutionary trajectory has soared like no other.  In Real Racing's skies it breaks the stratosphere, and the dazzle is blinding. So, Firemint's car game presents a towering technical achievement. A fully 3D racing game with the superstructure of a full-price console release, it packs time trials, global leaderboards, online championships and custom soundtracks into a £5.99 suckerpunch. In-game, racing against the plucky, challenging AI of five other vehicles, it comfortably represents the pinnacle of technological accomplishment on the iPhone and iPod Touch, the driving model much more robust than its immediate competitors.And yet, for these very same reasons, this is a game that sits somewhat awkwardly on Apple's machine. It takes an orthodox, blockbuster console game approach, pushing the boundaries of what's possible on the platform, aping the greats of the racing genre in form and function, demanding that serious gamers take it seriously. But, in the context of a platform that prides and defines itself on low-priced, throwaway entertainment, it seems like too much - a showboating embarrassment of riches that, in its vainglory, almost misses the point.The democratic publishing system of the App Store encourages the sort of low-budget, high-impact productions that defined the bedroom coding days of the 1980s. And these are the games that directly appeal to iPhone's gamers, those in their late twenties and thirties for whom bombastic visuals and technological accomplishments play second fiddle to brevity, efficiency and, dare we say, reheated nostalgia. As such the economic style of Space Invaders: Infinity Gene is far more likely to produce a groundswell of support from iPhone owners than, say, a miniaturised big-hitter such as Resident Evil 4: Mobile Edition. In this universe, the traditional roles are reversed: the 59p arcade-style punts are the headline hits, while the polished blockbusters are the risk-takers.For that reason, Real Racing's ambitious approach shifts the boundaries somewhat. Whereas the average iPhone game can be stacked up favourably against any number of throwaway webgames, Real Racing's rivals are handheld heavyweights such as Ridge Racers and the forthcoming Gran Turismo PSP. Compared to a webgame, Real Racing is the future inpixellate, an experience of such awesome depth and breadth as to render the competition redundant. But set against Sony and Namco's greatest, is it really anything more than a polished but uninspired racer, high on showboating graphical pizzazz, short on innovation and second-tier features?"}