{"ref": "https://www.eurogamer.net/flipnote-studio-hands-on", "date": "2 Sep 2009", "game_name": "Flipnote Studio", "text": "~Why is he screaming?~~He's screaming because his hair's growing so fast. It's frightening. He starts with a crew-cut, and 10 seconds later he's got hair down to his shoulders.~~But what was that red stuff?~~That's his brain exploding. Eventually his skull blows up because of the pressure of all the hair stuck inside his head. It's a tragedy, basically. It's very moving.~Believe it or not, this isn't the transcript of a gruelling late-night interrogation session involving the best minds in the FBI and a singularly disturbed serial killer. Instead, it's the salient details of a conversation that took place between my girlfriend and me, 35,000 feet above the English Channel, when we were reviewing her first jottings on Nintendo's latest DSiWare treat, Flipnote Studio.We were flying over the Channel because I've just come back from a holiday. Barcelona, as it happens. So, how is the city of Miro and Gaudi, home to the narrow and ancient streets once walked by George Orwell and the teenage Picasso? Sadly, I couldn't really tell you. I have a few fragments of memory - the nasty Triffid-style columns of La Sagrada Familia perhaps, Gehry's flimsy golden fish-thing sculpture glinting in the afternoon sun by the Olympic Village, or a few seconds spent watching a staggeringly untalented busker on La Ramblas attempting to mime, by the looks of it, the tricky business of unpacking Ikea furniture - but most of the trip was sacrificed to the joys of rudimentary animation.Flipnote Studio, part memo pad, part lo-fi cartoon production facility, is absolutely riveting, and downloading it the evening before jetting off for a week in a foreign country is possibly the stupidest thing I've done since that time I stapled my maths book to my trousers in primary school and didn't notice for a whole day.It's worth mentioning that Flipnote's a free download, too, although personally it's cost me £150 or thereabouts, since it enforced my upgrade from DS Fat to DSi from the moment I first saw it demoed, earlier this year, by the friend of a friend who works as a game designer in Japan. But more important than the price point is the fact that it's just astonishingly easy to use: a typically beautiful piece of interface design, always simple, generally intuitive, and yet allowing for a surprising degree of overall control.Behind the boldly utilitarian start screen, with its Communist orange - which suggests it could contain the training manual for a 1950s tractor - and windfall of pixelated frogs - this, frankly, spoils the previous illusion somewhat - lies a powerful time-waster, an application that, for me at least, gives the DSi a real sense of its own personality. Don't get me wrong, few will pour their lives into this like they may have done with a Mario 64 or a WipEout, but it serves the same role, as an early(ish) release that helps define the possibilities of the hardware it runs on.The basics are simple. Starting a new animation in Flipnote takes you to a blank page. Draw a brief scribble on it, and press right on the d-pad: this will bring you to your second frame (pushing left will take you back to your first again), leaving your original drawing visible as a light grey ghost in the background if you want to use it as a guide to trace around or alter. Then, it's a simple case of repeat until finished, until your clumsy animated clown has fallen in a bucket of water, your neutron bomb has gone off in a dirty scribble of smoke, or your sketchy Darth Vader has disappeared down an open manhole.Different brushes and colours - not a huge array of choices, but more than Bob Godfrey had for Henry's Cat, and look how that turned out - are available from the game's compact menu, where you can also play through your work in progress, cut and paste frames, and change the speed of the animation. You can even record and then dub your own sound effects - I found this last part quite a fiddly process, personally, but I have fat fingers and no rhythm, so the problem's most likely me rather than the software."}