{"ref": "https://www.eurogamer.net/colin-mcrae-dirt-2-article", "date": "10 Aug 2009", "game_name": "Colin McRae: Dirt 2", "text": "~Rallying as a global sport has changed,~ says Matt Horsman, chief game designer on DiRT 2. Standing as we are in blazing sunshine by the rooftop pool of a hotel in downtown LA, cocktails in hand, it's hard to disagree. It's a world away from the nipple-hardening winds, soggy sandwiches and desolate dawns of a Euro rally.Which is the traditional style of rallying Codemasters first exploited over a decade ago with the endorsement and assistance of a fearless Scottish pro racer called Colin McRae. DiRT 2 is the latest title to bear his name, albeit posthumously now, following his untimely death in a helicopter accident in 2007. It's the final weekend of July and LA's Home Depot Centre is hosting X Games XV, extreme sports' insurance-nightmare Olympics for bikes, boards and bangers. This is the third year rally racing has featured, and the first year Codemasters has included the X Games in its flagship racing series. Which has gone down like a slashed tyre amongst some hardcore McRae fans, if reaction to the announcement in forums is anything to go by, with accusations of dumbing down, Americanisation and such bandied around biliously.But, Horsman maintains, not only does this reflect rally's evolution and growing prominence, particularly in the US, it was also driven in no small part by McRae himself. His astounding roll and recovery in the final of X Games XII gave rally its big box-office moment in the US. On a more mundane level, it's a simple business decision for Codemasters, which wants to make more money Stateside - prior to the original DiRT, sales were declining year-on-year.But in the face of strong criticism - the ferocity of which has taken the developer by surprise - Horsman moves to reassure. ~In the game, the European fans shouldn't worry too much because we've got a lot of traditional rallying,~ he says. ~Staggered starts, eight cars on-track at a time, traditional tracks like Croatia, the Malaysian jungle. DiRT covers all bases. Extreme sports, super special style, traditional stuff - it's five o'clock in the morning and you are racing pretty much alone through a forest.~ How are those nipples looking?This weekend is all about the X Games, however, and the new wave of McRae-inspired stars like Ken Block, Travis Pastrana and Dave Mirra, competing for medals on the real track and in the game. Codemasters is unveiling its X Games content - and multiplayer - with the pro drivers along for the ride (for a full report on the event and the X Games, look out for an EGTV show later today).The rally course at the X Games is predictably built with an ADD-ridden TV audience in mind. The blockbuster moment is a 70ft do-or-die jump across the centre of the Home Depot Centre stadium which each driver tackles once on alternate laps. There's an optimal speed to hit the slope and precious little margin for error: there are no McRae rolls during this year's competition, but body parts are blasted to oblivion and bumpers torn from bodywork with anything less than a perfect landing. It's these make-or-break milliseconds that manufacture most of the drama in the race, and it's captured with flair in DiRT 2's fictional homage, the Estada Del Ray stadium, based in the Marina Del Ray area of Los Angeles."}