{"ref": "https://www.eurogamer.net/fifa-10-hands-on", "date": "9 Aug 2009", "game_name": "FIFA 10", "text": "Transforming any star performer into a true champion can often come down to the minor details: tweaking, polishing and refining an existing set of skills to eke out that extra couple of per cent. It's a challenge that now faces EA Canada, the development team behind the current undisputed king of football simulations, the FIFA franchise. After FIFA 09 cemented the series' dominance over the increasingly identikit Pro Evolution Soccer, EA Canada finds itself faced with the unenviable task of improving its already excellent football formula.One of the most striking aspects of EA's FIFA 10 announcement is its timing, with the code only 45 per cent complete and six months from release. Never in the series' history has a FIFA game been announced, let alone showcased so early in its development. ~There are a few things that we want to tell people about and one of those is just how much we're polishing and refining the game,~ explains producer David Rutter at the game's announcement press conference. ~We spend a huge amount of time on forums trying to make sure we listen to what our fans want. We're also innovating and we wanted people to experience some of those innovations firsthand to find out what they think. That way we can revaluate things as we go along. I'm a big fan of getting feedback.~So what's new? Well if you're expecting an avalanche of grandstand features then you may be a touch disappointed, as much of this year's new content will be incremental rather than revolutionary. If it ain't broke and all that. ~We're focusing on gameplay, refining the game and innovating,~ Rutter divulges. ~About 70 per cent of the development time is being spent on refining the game through feedback and 30 per cent on innovating.~Eradicating all of the irks that occasionally sullied FIFA 09 and caused fits of impetuous fist-slamming - most notably when someone scored against you from the halfway line - is a clear priority. A number of other key features are also being prioritised. Player urgency is to be sharpened to create more realistic player actions. Rutter promises that players will move into position with greater intelligence and realism, and when distant from play, they'll saunter around the pitch like Dimitar Berbatov on a summer stroll - although Berbatov will probably just act like that the whole time.Trapping was another bugbear. ~Last year we used the earliest trapping system, which often led to players failing to control the ball properly as they'd rush towards it to trap it at the earliest possible moment,~ says Rutter. ~Now we have a system based on the easiest trap, so players will back away from the ball to get into the best possible position to control it.~Cross-field passes are also in line for tweaking. Whereas spreading the play in PES has been a great way to stretch the opposition for some time, it's never quite worked in FIFA. This, Rutter believes, is due to his game's overly slow and unrealistic cross-field ball movement, a problem EA Canada is keen to eradicate by halving the length of time it'll take to ping the ball from one wingback to the other."}