{"ref": "https://www.eurogamer.net/super-stardust-hd-review", "date": "7 Aug 2009", "game_name": "Super Stardust HD", "text": "Stardust first materialised on the Commodore Amiga in 1993 and instantly found a dedicated fanbase thanks to its state-of-the-art graphics and glorious playability. Taking the core elements of the ancient arcade classic Asteroids and grafting on power-up weapons and extra enemy spacecraft, it proved beyond doubt that some gameplay concepts are timeless, classic and worthy of resurrection. Fast-forward 14 years and the game is set to do the same all over again, this time in the guise of the all-powerful Super Stardust HD.Let's not beat about the bush - this game is the best fun I've had on the PlayStation 3 since the machine launched. Sure, at its heart, it's still just Asteroids (albeit with multiple operations' worth of Demi Moore-quality cosmetic surgery) but the fact of the matter is that just about everything Super Stardust HD sets out to achieve, it does with absolute style.Take the graphics for example. Every object from the largest asteroid to the smallest piece of space debris is perfectly lit and beautifully animated. The light show and explosive effects you get courtesy of the power-up weaponry would do Treasure proud. Super Stardust HD lives up to the latter part of its name by rendering everything in 1080p with no hint of slowdown - even when the screen is ram-packed with enemy spacecraft, RSX-fuelled gunfire and a meteor storm's worth of unexploded asteroids. Considering the amount of activity on-screen, it's a hugely impressive technical achievement for the PS3 and the best use of 1080p since Ridge Racer 7.A similar level of attention to detail is in the gameplay too. The key objective remains unchanged from the ancient coin-op that is its inspiration - blast vast asteroids into smaller chunks, then reduce them to space dust with further volleys of fire. However, it's in the game's modernisation that Super Stardust HD truly scores. Larger rocks contain green Kryptonite-style crystals that yield points bonuses, smart bombs, shields or weapons power-ups. Additionally, each of your three weapons works best against a certain style of asteroid - choose the right tool for the job and you clear the stage much faster, resulting in a hefty points bonus. Squadrons of enemy spacecraft pop-up throughout the level to add to the challenge, and each has a distinctive attack pattern to learn and exploit. As the game progresses, different types of asteroid and enemy spacecraft combine to attack simultaneously, requiring superhuman reflexes and full mastery of the PlayStation 3's celebrated real-time weapons change system.In terms of depth, the action in Super Stardust HD is set across five different planets, each with five ‘phases'. That amounts to 25 different levels, which isn't exactly vast. Yes, perhaps the game could have benefited from a few more worlds but this is a game where the backgrounds are pretty much incidental to the hardcore blasting taking place before your eyes. Plus, like all good shoot 'em ups, the game simply ,locks' once it's fully complete, allowing you to continue to rack up score by cycling through the levels anew at a ramped-up difficulty level. Super Stardust HD isn't quite perfect though. Like many of the PlayStation Store games, its online options are limited to mere leaderboards - great for a score-based game like this, but still someway off the online multiplayer gameplay we've come to expect - cooperative gameplay with two players on a single console is supported and it's a tantalising glimpse at what could've been. The only other slight disappointment is in the audio. Considering the explosive force the visuals convey, the sound effects could've been a bit more representative of the onscreen Armageddon your eyes are privy to. The music is a little lacklustre too - definitely reminiscent the game's Amiga demo scene roots, to the point where I was expecting a scrolling message with ~greetz~ to appear at some point.In every other respect, Super Stardust HD is an absolute star, the jewel in the crown of the PlayStation Store and quite possibly the best purists' shooter to appear on console since the legendary Geometry Wars."}