{"ref": "https://www.eurogamer.net/fallout-3-mothership-zeta-review", "date": "4 Aug 2009", "game_name": "Fallout 3: Mothership Zeta", "text": "Lavishing a game's community with an unprecedented amount of post-release content can be taken one of two ways: either you're cannily responding to an irrepressible demand with memorable experiences, or just being brazenly cynical by churning out filler that wasn't really good enough for the main game. Now onto its fifth episode downloadable expansion, even Bethesda's staunchest supporters must be wondering whether Fallout 3 really warrants this many extra episodes. After all, the main game was hardly lacking.The law of diminishing returns had to kick in at some stage, and so it has proven with Mothership Zeta. Regardless of whether you view it in isolation, or in the context of the wider Fallout 3 experience, it struggles to justify its existence. It's a shame, because the alien abduction premise offered rich promise for something interesting that operated out of the game's post-apocalyptic comfort zone.As usual, the DLC kicks off after you respond to a radio distress beacon in the wasteland. Approaching the crash site of a wrecked flying saucer, you, as the Lone Wanderer, find yourself beamed aboard an alien mothership orbiting the planet. With blurred vision, and the sight of alien creatures (probably) performing unspeakable experiments upon your person, you come around to find yourself imprisoned in a white room alongside an unimpressed woman called Somah. Quickly hatching a cunning escape plan, you find yourself aided by Sally, a chirpy young girl with an intimate knowledge of the craft's innards and its crawl spaces.Stripped of all your hard-earned equipment (again), your initial encounters with the bug-eyed fiends nevertheless pass without incident - apart from proving a reminder of the game's hilariously poor melee combat. Within minutes, you're reunited with your (by now) ridiculous inventory and can tool up and take the fight to the alien menace in earnest.The first sign of Mothership Zeta's limitations appear rather too early on for comfort. Exploration offers only a modicum of interest, with little in the way of intriguing back-story aside from a clutch of occasionally noteworthy audio logs retrieved from terminals. Probing the craft's sprawling innards, mysterious equipment and abandoned experiments only hint at a broader menace, with extended exploration of the game's periphery locations offering precious little detail on what these extraterrestrial visitors were up to. Perhaps the most disappointing factor about Mothership Zeta is how little subtlety is afforded to the details, and the absence of choice in how you go about completing the game's three missions.More than in possibly any other portion of Fallout, the gameplay is extremely linear. Although certain tasks can be completed in a different order, this apparent freedom is rendered redundant once it dawns on you that the tasks are identical on each occasion. Reduced to a series of trivial button-pressing quests, getting to your objective involves nothing more than trudging from one inconsequential area to the next, wading through the drudge of utterly perfunctory corridor shoot-outs with the same three new enemy types.For completists, there's an initial intrigue about Mothership Zeta. The stark, polished alien spaceship interiors, for a start, are so completely at odds with the wretched destruction of the wasteland that it's impossible not to be initially seduced by the welcome contrast. Sadly it soon wears off, and, if anything, you feel trapped by the tight corridors and inability to roam."}