{"ref": "https://www.eurogamer.net/rocket-riot-xbla-review", "date": "4 Aug 2009", "game_name": "Rocket Riot", "text": "Rocket Riot presents you with a thick sheaf of colourful, pixel-art worlds and one single proviso: that you reduce them all to glittering tatters. A gleefully simple 2D arena shooter, the central appeal of Codeglue's quirky game is the real estate - each wayward shot tears a blocky chunk out of the surroundings before, following a polite pause, the engine obligingly pieces everything back together before your eyes. Not that you'll still be looking at it, mind you, because, for those occasions when you want something trickier to shoot at, the designers have laid on clouds of buzzing enemies, each a study in caricatured weirdness capable of putting a shoulder-mounted Exocet through your wishbone.This is the anti-Braid, in other words: a speedy, lovingly air-headed shooting gallery, which tells its story in a broad sweep of pirates, UFOs and mad scientists rather than melancholy wisps of poetry, and has you reordering space instead of time - generally with the aid of a bazooka. The generous parade of 8-bit worlds, variously depicting laboratories, spooky castles, and even the innards of a computer, is far from an exercise in simple nostalgia.Easy to tear down and itching to rebuild themselves again, the game's pixellated arenas quickly turn into tricksy battlegrounds where your gun is a trowel and the entire layout becomes an unreliable ally. You can tunnel in deep to let your health recharge, but there's every chance an enemy will burrow down to find you, or you can drill yourself a quick escape route for when the going gets tough, but you musn't leave it too long, or it's likely to have closed itself up again before you get to use it. There's no camping in Rocket Riot's universe, no fixed geometry to slow the mayhem down or stop it in its tracks, and the end result is a game where even an innocent blink can be deadly. A bit like that Doctor Who episode.Then there's the control scheme, an oddball reworking of the twin-stick mechanic. While the left stick zips you around the map as you might expect, pushing on the right aims your shots, while holding it in place charges them, and releasing fires. It initially seems unnecessarily fiddly, but very quickly helps to define the kooky charm of the game, allowing you a fair amount of control over the distance and arc of your rocket, while, more importantly, giving the relentless blasting a real visceral appeal and irritating any passing housemates with the constant gentle clicking of plastic on plastic - whenever it rises over the wall-to-wall Eurobeat chip-tunes, that is, which are, already, wonderfully irritating in their own right.Despite the nuanced controls, Rocket Riot is happy to trade precision for speed and exuberance. Although there is a certain pleasure in nailing an enemy from halfway across the map, most of the combat takes place in myopic close-quarters, as you shuffle around in a highly localised cloud of death, splintering the nearby environment and blowing those nearest to you into shiny chunks. A range of game types threaded throughout the generous 80-level campaign force you to alter your basic tactics a little - there's a Rugby challenge which sees you picking your way to the goalposts encumbered by a ball, search-and-destroy missions where you have to uncover special characters hidden within the blocky level furniture or take out particular features, and regular boss fights to name a few - but underneath the variety, it's the basic deathmatch premise that powers the fun.It hardly matters most of the time: the bots are just smart enough to be challenging, and the game's always eager to raise the ante, pitching you against 50 of them, then 60, then 70, varying basic arena layouts from large warrens to claustrophobic death-closets where the blizzard of pixels blasting through the air can make it look like you're studying the simulated effects of confetti in a wind tunnel.In a final twist, there are colour-coded power-ups of varying degrees of helpfulness. Revealed by chipping away at walls, the best of them alter your arsenal, giving you giant missiles or enabling homing, while some merely turn your explosions into Technicolor firework displays or see you shooting pumpkins and footballs instead of rockets. A few - the red ones - are actively harmful, sending you pinballing around the level, or causing a distinctly useless flag to drop limply from the mouth of your bazooka whenever you pull the trigger."}