{"ref": "https://www.eurogamer.net/fat-princess-review", "date": "3 Aug 2009", "game_name": "Fat Princess", "text": "It's probably bad form to start a review with a cultural reference that is alienating to anyone who didn't grow up in England in the 1970s, but you're going to have to bear with me.Back in the time of polyester and oven chips, there was a show on Children's BBC called We Are The Champions. Essentially a televised schools sports day, it pitted provincial comprehensives against each other in a frankly bewildering range of beanbag and quoits challenges. The finale always took place in a swimming pool filled with inflatables, and thus the only bit anyone was ever interested in was the very end, when gruff presenter Ron Pickering would bellow ~Away you go!~ and all the kids would hurl themselves into the water for a few blissful minutes of anarchic arsing about while the end credits played.Fat Princess often feels a lot like that - a giddy, noisy catharsis that makes a big splash, but to no great lasting effect.It's a cartoony multiplayer game that combines the game modes of an FPS with the character classes of an RPG and the resource-gathering of an RTS. Up to 32 players can take part in four game modes, plus a bizarre and not entirely successful Soccer option, spread across eight maps. Ellie already did a sterling job of describing the gameplay in detail in her hands-on preview but, to recap, it's a big old battle in which you can put on one of five hats at any time and change your role in the action.Workers can harvest wood and metal to improve and fix castle fixtures, Warriors are your standard melee fighters, Rangers shoot arrows, Priests can heal while Mages use fire magic. Once the relevant hat machines are upgraded, each class also offers advanced functions. Workers can lob bombs, Warriors gain a dash attack, Rangers use slow but powerful muskets, Priests can leech health from enemies and Mages add ice to their repertoire of spells.There are also lots of environmental benefits that can be accessed, such as gates that block enemy advances, ladders that let you scale castle walls and a catapult that can fire you and your friends directly into the enemy stronghold. There are shortcuts around the map, magic potions that turn people into chickens, and torches that can add fire damage to weapons.There's also cake. Lots and lots of cake, growing from the ground. And this is where the Fat Princess concept comes in. In two of the game modes - Rescue the Princess and Smash & Grab - the aim is to snatch these confection-loving royals and bring them back to your base, while preventing the other team from doing the same to you. In the first mode it's your princess you're saving from the dungeon, in the latter the situation is reversed and you must swipe their princess and throw her in your cells three times. To make life harder, you can take the cake off the ground and feed it to whichever princess you're defending. The fatter she gets, the slower the enemy will have to move if they seize her.It's Capture the Flag with a calorie-rich twist, in other words, and it's ironic that despite giving the game it's title, these are the weakest elements of the game. There are no time limits, and the task of getting these chubby lasses across the map without losing your meagre health so unlikely, that matches can drag on for upwards of 45 minutes. With only one upgrade level to attain for each character class, each side soon reaches maximum strength and then it too often becomes a tiresome stalemate. Princesses will be snatched, lugged a short distance, and then hordes of enemies smash the kidnappers to bits and it all starts over."}