{"ref": "https://www.eurogamer.net/psn-roundup-pc-engine-special-review", "date": "2 Aug 2009", "game_name": "Reviews", "text": "The first time I ever heard of the PC Engine was when a friend whose Chinese mate's uncle had imported one told me about it. Without having seen it, I just assumed it was some kind of Japanese computer for word processing's sake - not a console the size of a good sarnie, and certainly not one that ran cutting-edge games stored on credit cards. Any which way you sliced it, the PC Engine was something special. From five-player games and the eight-way d-pad sported by its controller to what was at the time easily the best console version of R-Type, NEC's machine was a little marvel. Shame, then, that hardly anybody in the UK had one (though, for some reason, everyone in France did).Beam forward a couple of decades and the advent of completely legit online libraries of old games has been a great leveller, at once making rare consoles of the eighties and nineties accessible to an audience that otherwise might never have experienced their curious charms, and at the same time providing relatively cheap access to official versions of games whose exaggerated prices and/or genuine scarcity had made them the preserve of collector-mentalists with big wallets; the best example of this being the presence of Neo-Geo and PC Engine titles on the Wii's Virtual Console.Now the Japanese branch of the PS Store is starting to explore the pre-PlayStation generation, stocking its Game Archives with a selection of PC Engine relics playable on both PS3 and PSP. There are four titles to begin with, each of which is an 8MB download. Since the Largest HuCard Ever held a piffling 2.5MB - that was Street Fighter II Dash, trivia fans - these files are likely bloated by their inclusion of digital instruction manuals, neatly abridged but ultimately pointless documents spanning three or four screens.These PSN versions also feature Save and Load State options, which are handy if your skills have rusted to the extent that you can no longer play 2D turn-of-the-nineties fare without resorting to shameless cheating - or, more forgivably, if you can't be bothered remembering four-digit passwords in Bomberman (other games, including Devil Crash, benefit from simulated battery back-up). The Vaseline Vision(TM) of the ~screen smoothing~ mode available when playing PS/PS2 games on the PS3 is absent, as are any artificial scanline options, all of which means LCD/plasma viewers will get that purified, crispy-pixel look. Screen ratio is stuck at 4:3, too, so you can expect big borders of nothingness down the left and right flanks of your widescreen.All PSN PC Engine titles can be played with either the d-pad or the Dual Shock's analogue sticks, though I believe they can only be enjoyed with the d-pad. PCE downloads are playable on the PSP in the same fashion as downloaded PS games are (i.e. accurately, but with their multiplayer features rather lopped off). Those are the details of this operation. Now let's surf the first wave of games.Saturn loyalists and fans of Super Bomberman 5 may disagree, but I think Bomberman '94 is the cute little terrorist's career best. It's not overdone with ludicrous power-ups, yet it's neither underdone with a lack of stages or options: it's just about perfectly baked.Rooie the Kangaroo provides a convenient transport service and, crucially, serves as a buffer zone between Bomberman and instant death - and you tend to feel more confident about taking risks when it's poor old Rooie (~Louie~, in the rubbish translation suggested by Mega Bomberman, '94's poor cousin) who's going to be sacrificed. Depending on the colour of the Rooie that appears when you crack open an egg, these funky characters also bring their own powers into play, including the ability to kick and jump over bombs. Bomberman without Rooie is like Mario without Yoshi or Jeff Minter without a llama: just a touch lonely.While you can access Bomberman '94's five-player battle mode on the Virtual Console through the combination of four remotes and a GameCube pad, the PS3 version utilises its host hardware optimally to allow for multiplayer with five controllers via Bluetooth. It feels a bit more practical and less clunky like this, particularly because you need four Classic Controllers wired into four Remotes, and then perhaps a Wireless Wavebird for Player 5, to get the most out of the VC release.Either way, the paucity of good local multiplayer offerings on PSN (we need more games with the party appeal of seven-player PixelJunk Racers) helps Bomberman '94 to stand out as one of the best options available. Not that it needs that help - it's an unputdownable creation that plays as perfectly here and now as it did there and then. While the PSP is good for spending time with '94's sock-charming single-player adventure, battle mode on the PS3 is where you will end up pitching your tent. Just make sure you have enough joypads to hand - and other essentials, because no one will want to nip out for supplies - before inviting friends to a '94 session.9/10"}