{"ref": "https://www.eurogamer.net/zombies-and-me-review", "date": "29 Jul 2009", "game_name": "Zombies & Me", "text": "The iTunes App Store may be big business, but big businesses haven't always been its biggest success stories. EA has pumped out a good few scaled-down versions of games like Need for Speed and Spore, but it is former EA man Neil Young whose ngmoco start-up is more widely celebrated, while the tiny likes of Firemint are winning plaudits for their technology, and particularly advances made with the new iPhone 3GS. Meanwhile, games like Mass Effect Galaxy get kicked in the face for trying (among other things).But if there's one thing you can say about EA under silver-haired John Riccitiello (apart from ~Did you say a billion dollar loss?~) it's that it does things a bit differently, and so, in self-consciously hip fashion, the publisher has given birth to splinter studio 8lb Gorilla, whose job it is to pump out 59p iPhone games at the rate of one a month. The first is called Zombies & Me. Is it proof that EA's figured out this iPhone games lark?It's a good enough concept, certainly. You're a little man running around defending grandma's house from a zombie invasion, the goal being to take as many of the undead with you as possible. You do this by luring them into the path of incoming army missiles, which land on targets that appear at random spots dotted around the play area. Each circular target lingers for three seconds - the countdown illustrated by the shrinking of the highlighted area within - and zombies are helpful enough to pause in the danger zone if you lead them directly across it. This is particularly handy because, while they may resemble balding septuagenarians covered in Saturday morning TV gunge, they actually hustle around quickly.Control is simple: drag your finger across the screen and your little man follows. There's a pause button in the top-right. That's it. Survival is a matter of canny movement. Obviously you need to avoid being blown up by the missiles, and it's preferable not to be eaten by zombies, who can quickly overwhelm you as they swarm in greater volume. You can tap the screen rapidly or shake the iPhone to fight your way clear, but if this happens too often you're torn apart. But the main threat to your kill counter is grandma's well-being, indicated by a grandma bar at the foot of the screen, which gradually diminishes as the zombies assault her house."}