{"ref": "https://www.eurogamer.net/section-8-multiplayer-hands-on", "date": "27 Jul 2009", "game_name": "Section 8", "text": "Ever since TimeGate Studios first unveiled its science-fiction first-person shooter Section 8 early last year, it has stressed the need to do things differently. Its goals are noble: to eliminate spawn-camping, one-shot kills and team-killing for vehicles, and to speed up the return to action after you die. It also wants to create a more tactical experience which plays out differently each time, and isn't simply a case of memorising the map and the godforsaken spawn-points. Although designed as both a story-based single-player campaign and as a pure multiplayer experience, it's the latter portion of Section 8 which is being given all the focus in the run-up to its release on PC and Xbox 360 later this year. Currently undergoing beta trials in the US and Canada, last week we got a chance to join in the fun ahead on live servers, ahead of the European beta's kick-off date of 10th August.Set in the far-flung future, you play as a member of the 8th Armoured 1st Recon unit, a squad asked to pull off particularly dangerous missions. Today's mission is about wrestling control of a planet called New Madrid, which has been occupied by a pesky rebel faction called the Galacticos (or possibly the ARM of Orion). Either way, it's a reasonable excuse for TimeGate to dish out jetpacks and power armour and liberally cherry-pick its favourite bits from Tribes, Unreal Tournament, Team Fortress, Battlefield, and, hell, Medal of Honor Airborne. And why not?The first thing which hits you is the depth of the character-customisation. When you start out, you get to choose from six different classes, which effectively amount to various preset weapon/equipment loadouts. You've got the standard 'Assault' option, with a machine gun and assault rifle, plus Recon, Engineer, Infiltrator, Artillery and Guardian. If you prefer, you can simply mix and match whatever equipment you want, and dive into battle with a sniper rifle and a missile launcher, or a pistol and assault rifle, or machine gun and shotgun, and so on. Usefully, Section 8 also breaks the convention of only letting you have one big gun and one small, and lets you have whatever combination you want.Alongside your weapons is your equipment, and this is comprised of grenades, repair tool, micro sensor and the like, giving the game welcome Team Fortress elements. In the same way as Valve's standard-bearer, you can run around being the medic, or run around with the repair tool fixing turrets and vehicles. Adding a final layer of character-customisation are the Passive Modules, and these grant you special abilities and powers which help define your role within your team. You're given 10 slots to play with as you see fit, and these can be filled with helpful things like Armour Plating, Anvil Rounds, Shield Booster, Lock-on booster, Stealth Matrix, Gyro Stabiliser, Repair Field and Deceptor Plates.It's perhaps a lot to get your head around at first, but once you start figuring out the practical applications of each element - particularly the Passive Modules - it lets you shape the way you want to play the game. You might initially select the Recon class and try your hand at being the sniper, only to discover that it take three shots to take someone down. By fiddling with Passive Modules, though, you can reduce that to two shots by turning up Anvil Rounds all the way to full. The implications for team play are many. For instance, one guy could be the big tank who runs in ahead of everyone while someone else is on the sidelines with the sniper rifle.Once all that's out of the way, Section 8 takes a neat approach to spawning you onto the battlefield, and it's not a million miles away from the parachuting system you might recall seeing in Medal of Honor: Airborne a couple of years back. Essentially you 'burn-in' from 15,000 feet, and can either 'Free Spawn' anywhere you choose on the map, or simply 'Squad Spawn' to guarantee you'll resume the action near where the majority of your team-mates are fighting it out. Designed to wipe out the spawn-camping nonsense which infects other multiplayer shooters, it offers a degree of complete unpredictability to proceedings.However, there are some restrictions to bear in mind before you suit up and plummet to the ground in your sexy power armour. When you're deciding where to spawn, the overhead map displays red zones, and these show which areas are under control by your opponent. Trying to spawn into these areas is basically instant death, as they're protected by anti-aircraft fire. You could, as a squad, try and blaze into a restricted area en-masse to gain a quick advantage, but only a few would survive.To add an extra element of strategy to the spawn mechanic, Section 8 also allows you to apply the brakes during your descent to allow for a greater degree of control over where you land. A sniper, for example, might wish to land on a particular vantage point, or you might even spy an opportunity to take out a stationary target by landing on their head. On the downside, slowly descending makes it easier for your opponents to get a bead on you and possibly take you out before you've even had a chance to land. Landing quickly, though, also leaves you momentarily disorientated."}