{"ref": "https://www.eurogamer.net/halo-3-odst-hands-on", "date": "24 Jul 2009", "game_name": "Halo 3: ODST", "text": "If there's one thing Bungie and Microsoft want to get across about Halo 3: ODST, is that this is a full Halo experience that justifies its full-price status.~[Bungie] tend to over-deliver on just about everything that they do,~ says Microsoft Game Studios' Ryan Crosby, ~and when we first sat down and started to do playtesting and really got a good look at [Halo 3: ODST], we came to realise it was a heck of a lot bigger than we planned for.~The plan, as you might recall was for a cheaper standalone expansion release, then called Halo 3: Recon. But as Bungie's senior designer Lars Bakken notes, over the course of development it ~basically kept growing in scope~. (For more from our interviews, check out the Eurogamer TV Show that accompanies this preview.)Quickly renamed Halo 3: ODST, it became apparent internally that this was a product that could stand alongside other Halo products for scope and ambition. ~[Multiplayer mode] Firefight came online, more levels came online, the hub became this massive thing,~ says Bakken. Indeed, the game's single-player campaign city in New Mombassa is ~the biggest Halo level we've ever made~.~And every time we got a look at it, it was a little bit bigger,~ nods Crosby. ~And eventually it was like, 'this is a huge deal.' I think also, as Lars said, once we got a look at [Firefight] the co-operative mode of play, and how much replay it adds to the game as well, it was shocking. It was so much fun.~In terms of gameplay length of the ODST single-player campaign, it's not exactly clear what we're dealing with. During the gameplay presentation, Microsoft said it will be ~massive...probably bigger than the campaigns in other FPS titles available today~, but later, Crosby admits: ~it won't be, in my mind as long [as Halo 3] to play through. If you play through and go really quickly, it won't be as long as Halo 3 in terms of hours, but it is big and it's full. There's a full story told in there.~Bakken reckons: ~It's hard to quantify - mostly because, the way the Halo games have been handled in the past, they're all about replayability. Each time you played the level, it'll play a little bit differently each time. You've also got New Mombassa, the hub, the city at night, which is huge... Players are going to be able to spend a lot of time in there.~So why go for an openworld style in the first place? ~I think the reason we chose it was to really go hand-in-hand with the storytelling style that we chose,~ Bakken explains. ~Joseph Staten, who was the writer on ODST, he really wanted to try something different, and breaking up the story and kind of placing it in pieces around this big open world was like a cool new way to tell it.~So, it's non-linear, you're basically picking out these pieces and playing from these people's perspectives and putting those story bits together yourself. That was really a cool way for us to tell a different kind of story in a different way,~ adds Bakken.~[Halo 3: ODST] really is a mystery story too, right?~ says Crosby. ~And the nice thing about telling the story in that way is that it can remain a mystery, and people can have different experiences, and you can figure it out for yourself. I think the idea is that you get all these clues, you're piecing the mystery together in your own way, and the storyline converges, and that's kind of where the climax of the game is, and I think that it works really well for telling this kind of story.~And that's not the whole picture, either. Tantalisingly, Bakken also says ~there's going to be a lot of things in there that we aren't talking about yet, and that certain kinds of players are going to be attracted to.~ The big tease. As you'd expect, you've got the ability to play co-operatively offline or online, and multiple difficulty levels. Players will also have the ability to turn on skulls from the beginning. ~It's actually just a full game option now. You don't have to find them anymore,~ reveals Bakken.One thing Bungie and Microsoft are willing to expand on right now are the basic tweaks and changes we'll be seeing in ODST. Given that you initially play as 'The Rookie', a nameless Orbital Drop Shock Trooper, instead of the iconic Master Chief, the developer has been able to fiddle with a few gameplay elements to make ODST feel distinct from previous entries in the series."}