{"ref": "https://www.eurogamer.net/wiiware-roundup-review-3", "date": "24 Jul 2009", "game_name": "Reviews", "text": "Those who once held out hope for Nintendo’s WiiWare service as an outlet for charming, offbeat and innovative games might well be sobbing into their lacy handkerchiefs. While there’s no shortage of games available now, the prices remain prohibitively high and quality is an often secondary concern. There are, however, some notable titles loitering in amongst the incomprehensible brawlers and bafflingly simplistic Wii Sports rip-offs. Here’s our pick of the more interesting efforts from the last few months.A loosely related spin-off from a spin-off, this companion piece to WiiWare debut title My Life as a King at least earns some credit for mixing things up. Unlike the RPG series that spawned it, and unlike the resource management game that preceded it, this is yet another entry in the increasingly crowded tower defence genre.In this case you play as Mira, the cutesy evil offspring of the Darklord. Eager to make a name for herself as a wicked force in her own right, she sets off to lure worthy foes into her magic tower (not a euphemism) so that their defeat might increase her infamy.This being a Final Fantasy game, albeit several times removed from the source, the plot is nowhere near that simple. By the end the requisite secrets and conspiracies have been painstakingly laid out in a procession of between-level speech bubbles.The core of the game, however, remains the same throughout. Adventurers invade your tower, and you have to stop them reaching the top. You do this by first placing floors and then populating them with monsters. Each floor has an artefact which must be protected from damage. These artefacts can boost the stats of any monsters on the floor, cause additional damage to adventurers or provide other area effects. Should the artefact be destroyed, the floor collapses taking its inhabitants with it.Adventurers advance floor by floor, trading blows with whatever lies on each until a small timer runs out. They then ascend to the next level. Only one adventurer can occupy each floor and they’ll keep climbing until they find a vacant spot, so as the numbers increase you need to keep an eye of where each incoming foe is going to end up.Two currencies govern the action. Negative Points are your spending money, used in each stage to add floors and monsters. You earn more NP for each enemy defeated, and items can boost your initial stock to give you a head start. Karma, on the other hand, is earned for victory and can only be spent in the menu. This is what you use to expand your tower’s available size – allowing up to five additional floors for 300 Karma points – and to boost the stats of your creatures. Once levelled up, you can then use NP in-game to raise individual monsters to the required level.As the bedrock for a fast-paced strategy game it’s functional enough, and the game quickly starts adding more wrinkles to the cloth. Enemies come in different classes – melee, ranged and magic being most common – and a rigid rock, paper, scissors framework dictates the most effective response. An invading mage will be cut down swiftly by ranged attacks, but melee fighters will struggle to inflict damage.It’s here that Darklord’s limitations start to become evident. The class boundaries are so inflexible that the wrong match of monster and invader is essentially useless. Since there’s no way to change your set up to suit a changing situation, it’s too easy to be left with an unworkable arrangement that leads to inevitable defeat. Before each level you’re told how many enemies to expect, and what classes they’ll be drawn from. What you don’t know is in what order they’ll arrive, how many there will be in each raiding party or what level they’ll be.What works for four Level 3 Black Mages is a waste of time against the three Level 5 Gladiators that might theoretically follow. Always leaving yourself some empty slots and spare NP to react to such situations goes some way to solving the problem, but by the midpoint of the game you’ll still only have unlocked a couple of floor types, a few monsters and a handful of optional items. With extremely limited reserves of NP to play with, and a finite number of ways to replenish your stock, it always feels like the game is holding back - the miserly units at your command giving you little room to really dig deep into the tempting tactical depths that the concept so clearly offers.There’s a reason for this: DLC. Right from launch there were 14 packages of downloadable additions to the game, boosting your floors, monsters and items to more flexible levels for a cumulative price of 4700 points. That’s not including the extra stages, which clock in at another 1000 points. While it’s possible to complete the game without dipping into this expensive array of additional resources, the structure is such that the game blatantly nudges you towards more spending at every opportunity.My Life as a Darklord has the foundations of a decent tower defence game, and there will surely be those devotees who see its claustrophobic restrictions as a plus rather than a minus. There is depth here, especially for patient or committed fans, but the mercenary way that the game dangles this potentially richer gameplay as bait for overpriced DLC purchases sticks in the throat.7/10"}