{"ref": "https://www.eurogamer.net/alien-breed-evolution-hands-on", "date": "20 Jul 2009", "game_name": "Reviews", "text": "Aside from Duke Nukem Forever, there can't be a lot games that have endured as many false starts as Alien Breed Evolution. Initially envisaged as a PC RPG in the late nineties, the game crashed and burned after 18 months in development when publisher Microprose was swallowed up by the acquisitive Hasbro Interactive. Undeterred, Team17 then re-envisioned the game as a Snowblind engine-powered title on PS2, but met with frustrating indifference as a slew of publishers passed on backing it. Fortunately, times have changed. Boosted by the success of Worms on Xbox Live Arcade, the Wakefield-based studio has decided to self-publish Alien Breed Evolution, presumably waving two fingers in the direction of all the publishers who shot it down the first time around.~It's a complete no-brainer,~ admits Team17's studio director Martyn Brown. ~Even selling it at a much lower price, we're making twice as much money than if we put it out as a boxed product and charged three times as much. There's no stupidly expensive marketing campaign to pay for, no distribution fees, no retail margin, no pre-owned resale losses, and no publisher slice. We've cut them all out entirely.~ With the success of numerous Worms ports swelling the coffers, it's a risk the veteran company can afford to take.Despite the brand lying dormant since the release of Alien Breed 3D on the Amiga back in 1996, Brown observes that a lot of people still have very fond memories of the series, and so they should. During its heyday between 1991 and 94, the Amiga classic scooped numerous awards, and was considered one of the best co-op shooters of the decade, rich with the kind of atmospheric tension that later became characteristic of the survival horror genre.This particular remake is taking shape via an interesting route, in three separate downloadable episodes, each with five chapters. The plan is to offer around five hours' worth of single-player content in each, with a separate campaign of online/local co-op fun offering another few hours on top. Although leading on Xbox 360 for an unspecified period of exclusivity with each instalment, PC and PS3 versions will also be released. Brown wouldn't be drawn on price, but my guess would be somewhere around the GBP 10 mark per episode. If it turns out to be as good as early impressions suggest, it promises to be good value.Stylishly side-stepping the need for disk space-hogging cut-scenes, the game's narrative is relayed via a black and white comic strip and the usual gravel-voiced delivery that we all love and mock frequently. After a spaceship becomes crippled by a mysterious collision with an unknown entity, the game tasks you with exploring the stricken craft and unravelling the mysteries of the crash. Viewed from a semi-overhead perspective, you control the ship's engineer, Conrad.Watching Brown play the opening portion of the game, the first thing that strikes you is how lavish it looks. This is no quick-and-dirty retro revamp that will only be of interest to a veteran hardcore audience. Developed by a 30-strong team over the past year, Evolution benefits from strong production values and an artistic flair that manages to bring the look and feel of the series up to date without straying too far from the source material. In no way do the gloomy screenshots released to date do the game justice; in motion, the dark, forbidding interior of the environments is the perfect modern interpretation of the original vision.Aided by Team17's experience of the Unreal 3 Engine, the attention to detail is impressive. Wandering the darkened corridors of the damaged spaceship is an eerie experience, your torch beam penetrating the gloom in the expectation of the next alien onslaught. Smoke, fire and steam billows out of ruptured pipes, and gigantic technology spins, throwing shapes as you patter over gantries in the relentless search for keycards and extra ammo.The sparse and menacing audio was always a key facet of Alien Breed's appeal, even back in 1991, and Team17 has been careful to apply the same detail in this department as well. Alistair Brimble's original score has been brought up to date by the man himself, and a full soundtrack accompanies proceedings as you explore. Sadly, the iconic sound effects have been completely changed - understandably perhaps, but I couldn't help feel a pang of regret that the death sound of aliens is no longer akin to a terrified elephant."}