{"ref": "https://www.eurogamer.net/tropico-6-review-a-gentle-revolution", "date": "29 Mar 2019", "game_name": "Tropico 6", "text": "Here's my gaming metaphor of the day: Tropico is like that one friend you have - you know the one - who you see at regularly reoccurring events and don't speak much outside of that. Whenever you do manage to catch up with them, though, it's like you've never been apart. Tropico used to come around every 2 to 3 years with a few new features, the core idea always intact. You take control of a dictator tasked with leading their island nation - and their own wallet - to glory. How things play out is dictated less by you and more by the demands of the factions that represent the different interests of your people. Ignore their demands for too long and you risk a rebellion. Under new developer Limbic Entertainment factions are the main feature the sixth instalment introduces. Rather than gentle nudges from one or two factions to keep up with things, you now eventually deal with all eight available factions simultaneously. It's impossible to make everyone happy, as every demand you fill for one group will cost you standing with another. To turn Tropico into a thriving paradise you need to keep things in balance, traditionally the last thing you expect from a despot.Of course you have some ways to bend the populace to your will. You can always put overly demanding faction leaders in jail or arrange accidents. Elections are optional at best, and if your farmers work around the clock for a few months or years in a bid to raise productivity, who's really counting? Such actions will naturally lead to dissent in the long run and are thus more of a last-minute hat trick for getting out of a bind. Tropico 6 ditches its predecessor's dynasty system, which let El Presidente gain attributes through members of his clan. Instead, you can now assign your dictator an attribute during the initial character creation. The options are not expansive, but  helpful without making things overly easy: a particularly charming Presidente will for example immediately have a slightly increased standing with all factions. Money you've siphoned off to your Swiss bank account now goes to a broker instead, who offers you a number of much more useful in-game perks in exchange. Here I've finally found a worthwhile incentive to manage my Swiss bank account on top of everything else to use it as my personal savings account for indulgences such as amending the constitution.Limbic acknowledges lack of space as a routine endgame woe and now gives you an archipelago of at least 3 islands. You can experience  the different infrastructural challenges this presents through 30 sandbox maps or 15 individual missions. The missions, while certainly a good opportunity to experience gameplay during different eras, didn't give me much. The idea to adjust your strategy to fulfil the mission objective is sound, but in practice this means next to nothing since Tropico 6 is fundamentally a game where someone threatens to revolt while you fill the demands of another.  Everything is ultimately down to balance, as precarious as it might be, whether you're trying to avoid war while clearly prioritising one country's demands over all others or trying to find alternate sources of happiness for a population that lives  solely in shacks.The central point of criticism regarding Tropico 6 is the same it's ever been: the setup makes it seem like you have the power to be as evil as you want to be, but it's never a sustainable approach.Having several islands to work with is a major factor in what makes the game so busy, especially since the efficiency of your buildings and ultimately your whole operation depends on people and wares getting from A to B as quickly as possible. Opening a mine on a remote island effectively means setting up a tiny mining colony since people need to live close to their workplace or have the means to commute there as quickly as possible. If you cluster most of your job and entertainment opportunities in one place, you quickly run out of space, risk high pollution and essentially end up with London, and we can all agree that really no one wants that. Starting with the World Wars era, you can build bus hubs and bridges to ferry people where they need to go once you run out of living space right on capitalism's front lawn, an important step in growing your island empire.The raid system makes a return all the way from Tropico 2. It's a mere resource gathering tool at first, allowing you to send a band of pirates fish for loot and  ~rescue~ people to gain immigrants, raids take a more political nature once you use your operatives to spy on the general populace. It's by far the most interesting new feature, as it doesn't solely exist to make things easier for you. You can sabotage a country and risk a war in the process. Similarly, the new option to steal one of the world wonders to boost one of your population's stats is generally frowned upon. Tropico 6 feels a little more difficult than its predecessors, simply because between all the demands, there are plenty of stats to juggle and perhaps sometimes even build a city. For some reason, the pacing always seems off however, as I alternate heavily between normal game speed whenever I have to micromanage an aspect of my islands and full speed as I wait for resources to trickle in.Tropico may never truly fulfil its potential as political satire sim, but the new options in the series' latest instalment bring it a step closer to that ideal. I've enjoyed my time with plenty of new buildings and the reliable hook that the game provides by giving you a set of new tasks just as you've gotten ahead of everything. Always a joy to come back to, Tropico 6 is no revolución, but offers the gentle stirrings of change."}