{"ref": "https://www.eurogamer.net/aion-the-tower-of-eternity-hands-on", "date": "7 Jul 2009", "game_name": "Aion", "text": "It's hard to remember such a carefully controlled, ruthlessly organised, painstakingly cautious, generally locked-down and sewn-up MMO launch preparation as that currently being undertaken by NCsoft West for the US and European launch of Aion: The Tower of Eternity. That's because there's probably never been one.As it picks its way through a series of short closed beta previews ahead of its late-September launch, Aion is looking slick and confident and playing as smooth as silk. But the servers are never up long enough for it to truly get under our skin, or for us to properly penetrate its mysteries. Is NCsoft discreetly drawing a veil over its Korean beauty-queen's blemishes, or simply playing the PR tease? After a couple of weekends with the game, my money's on the latter.That's partly because Aion's been rocking the Asian PC cafés and subsidising bubble-tea sales since late last year, and has had plenty of time for its kinks to be ironed out ahead of what NCsoft likes to call its Western ~culturalisation~. The benefits of taking one's time and using a solid technology base - CryEngine, in this case - are immediately apparent when you install the game. The Aion client is excellent. Being stable, scalable, reliable and fuss-free is far from a given in MMOs, but Aion is all those things, and can already stand alongside the genre's usability kings, EVE Online and World of Warcraft. Its expansive, zone-free open-world environments look terrific and run smoothly on a wide variety of systems. It just works.That's not just true of the game's technical side. Aion has evidently been put together - and localised - with tremendous care and attention to detail. It's hardly surprising. This could not be a more critical game for NCsoft, which hasn't had a successful launch since 2005's Guild Wars, has suffered a couple of high-profile flops (Auto Assault and Tabula Rasa), and hasn't previously managed to convert huge Asian hits like Lineage and Lineage II into magnets for Western players. Aion needs to change that, and NCsoft certainly isn't going to leave it to chance.The result is a highly polished and deeply conservative MMORPG that blends what NCsoft does best - ornate Eastern fantasy-lands peopled by weird creatures and gorgeous, matinee-idol characters - with what a post-WOW world expects, and hardly puts a foot wrong in its early stages. Solid, solo-able questing, finely-judged difficulty, tangible and steady advancement, generous rewards, and punchy, well-tuned combat are all present and manifestly correct - not to mention a full and functional suite of community features and a seemingly well-rounded crafting system.You start out as a mere human on either the Elyos or Asmodian side of Aion's ruptured world. It's composed of two hemispheres, the Elyos' bathed in light, the Asmodians' in darkness, with the latter's crepuscular habitat granting them edgy, wild-looking manes and claws but losing them nothing in classical cheekbone structure or fashionable coiffure. (Here we must make mention of Aion's remarkable character editor, which somehow combines huge flexibility and a vast range of options with almost always good-looking results. You don't have to look like a Eurasian underwear model if you don't want to, although it does seem impossible to be ugly.)"}