{"ref": "https://www.eurogamer.net/anno-1404-review", "date": "6 Jul 2009", "game_name": "Anno 1404", "text": "Those of you not living in the South East of England might not have noticed, but recently it's been real hot. Even living amongst the fresh sea breezes of Brighton I've been gradually sublimating into a rarefied cloud of grease over the last few days, so shuffling back into the airless Eurogamer offices after lunch on the beach, even when all I have to do when I get there is play games and write about them, has been pretty difficult. (Yeah, I know. Tough life.)The point is that normally it's not that bad. With a desk fan running full blast in my face and Bertie's eternally sunny disposition warming my right flank, it's almost like being outside anyway. During my time with Anno 1404, however, these office-bound hours have proven especially difficult. Don't get me wrong, it's not because I haven't enjoyed the game, it's because of the water.See, as pretty much everyone who's wandered past my desk this week will tell you, Anno's water is very, very pretty indeed. It looks cool, refreshing and thoroughly inviting - lapping gently upon the beautifully rendered beaches and cliffs of Anno's islands, swirling around my fleets of trade ships and sloshing against abandoned cargo and shipwrecked unfortunates. Considering that all of the game's territory consists of picturesque islands, surrounded by this tantalising liquid, playing it in the heat is absolute torture.In keeping with the beautiful ocean, the rest of Anno is quite the looker too, with deliciously detailed 3D building models giving a solidity and genial rurality to your settlements, whilst well-animated citizens bustle from place to place. Trees sway in tropical breezes, sea birds wheel overhead, crops sprout and are harvested. It's soothing, pleasant and absorbing. I'll be surprised if a better-looking RTS comes along this year.In accordance with this laid-back, tropical experience, Anno generally makes very few time-sensitive demands upon you as you amble towards particular mission objectives, all of which involve settling islands and carving civilisation's name into their unspoilt trees and fields. If you've not played any of the series before, Anno is fundamentally a game of trade and production, with a little exploration and a soupçon of combat adding a delicate frill to the edges of the sensible economic tablecloth. The player's role is to populate and exploit land, gathering resources and refining them to produce mercantile or military wares, and to stockpile or distribute these end products as they see fit according to need and priority.For example, building peasant huts near to a marketplace will ensure that your little hamlet is soon teeming with the great unwashed, going about their stinking and polluted business as long as they're fed and watered. Add a little spiritual sustenance in the form of a chapel or, later, a church, grow a few acres of hemp (for clothing and rope, actually) and they'll quickly mature into slightly less foul-smelling individuals, expanding your range of available buildings and, more importantly, pumping out more tax money. Turns out that all you really need to run a relatively idyllic island hideaway is a chapel, plenty of dope and a place to hang out. Someone tell Brown.Keep on improving the amenities available to your citizens and they'll shimmy on up the social ladder, becoming increasingly profitable and demanding as they go. Before you know it, you'll have complex chains of production churning out luxuries like books, carpets, brass and cannons to grease the social axles and turn enemies into pink smears on the beaches."}