{"ref": "https://www.eurogamer.net/resident-evil-archives-review", "date": "3 Jul 2009", "game_name": "Resident Evil Archives", "text": "One of the more heartening aspects of the continuing spate of GameCube re-issues on Wii is that it has given developers the chance to tweak games for the better. However mercenary Nintendo's New Play Control range initially appeared, there's no question that it's been an outright success, with the Pikmin games and Donkey Kong Jungle Beat given the thumbs up, while, shortly, the Metroid Prime titles will also benefit from an overhauled control system. Go Nintendo!Another GameCube classic that we're definitely happy to have back is Resident Evil. Already a remake when it came out in 2002, Capcom was lauded for the way it brought its survival horror masterpiece up to date, with stunning visuals that enhanced the already creepy atmosphere no end. There are few better examples of the original old-school survival horror template in the genre, and hopes were that Capcom would perhaps go back and make an already great game even better with this second update. Enhanced controls? Surround sound? Widescreen? Having tweaked Resident Evil 4 to great effect for its Wii release two years ago, was it too much to ask for similar treatment?Apparently so. Sadly, this mid-price offering is simply the old GameCube version in almost completely unaltered form. So, widescreen TV owners, that means playing in bordered 4:3, with stereo sound, and Wii remote support as opposed to enhancement.The choices are as follows: play the game with the nunchuk plugged in to the Wii remote, unplug the nunchuk and turn the Wii remote on its side, or dig out either a Classic Controller or an original GameCube controller and play it that way. Other than that, it's exactly the same in every sense as the GameCube version that you could easily pick up for around half the price that Archives is currently retailing for (SRP is GBP 19.99, but online for under GBP 15).Once you get over the numbing disappointment of this shovelware approach though, there's much to admire. For recent converts to the series, the first thing to point out is that this bears only superficial resemblance to the more focused, linear shooter that the series has gradually morphed into - for this is survival horror in the truest sense. Back in 2002, Capcom had barely budged an inch from the gameplay template laid out six years before when the series made its debut on PlayStation. That meant players had to deal with idiosyncratic design decisions which were at odds with other action games, but somehow combined to make it one of the most tense, rewarding and genuinely scary experiences around.Resident Evil's original control system has always been a fertile source of discussion, and no wonder. You press forward to move forward, and back to move back, but pressing left and right rotates you in that direction, meaning that you move around with all the mobility of a tank. It was a problem then, and it still takes a fair bit of getting used to now, but once you master the quick 180-degree turn, you spend far less time running into enemies (and walls).To add to the sense of haplessness, the game's use of static camera angles was (and still is) enormously disorientating. It afforded Capcom the opportunity to produce lavish pre-rendered backdrops that were otherwise generally beyond the 3D engines of the era, but although every incidental location was atmospheric and pleasing to the eye, it came at the price of rarely giving the player the best view of the action. In certain situations you could find yourself completely unable to even see the enemy you were shooting at, while sudden changes in camera perspective would create bizarre control contradictions where you would find yourself pressing the opposite direction to the one you were running in. All that remains.Similarly hard to come to terms with is the limited inventory system, where someone thought it would be fun to let you carry just six items at once if you play as Chris, or eight if you play as Jill. In a game where there's an unholy amount of tat scattered to collect, this forces you to continually trot around dumping stuff at the nearest item box, and second-guessing what items you may or may not need. Unlike 2003's Resident Evil Zero, you can't simply drop things anywhere and come back for them later, it's a case of either using the storage box or bashing your head against the nearest joypad."}