{"ref": "https://www.eurogamer.net/call-of-juarez-bound-blood-review", "date": "30 Jun 2009", "game_name": "Call of Juarez: Bound in Blood", "text": "Once again - at least until Rockstar San Diego tries to bring the cows home with Red Dead Redemption - it falls to Europeans to keep the fine traditions of the Wild West squarely in the crosshairs of popular culture. Just as Italy and Spain did in the spaghetti western films of the sixties and seventies, now an unlikely collaboration between Poland and France - in the form of developer Techland and publisher Ubisoft - is turning out videogames that capture the grit, machismo and melancholy lyricism of the USA's creation myth better than any American studio seems able.A couple of years ago, Call of Juarez delivered its mix of stealth, six-shooting and pioneer melodrama with bible-bashing, fire-and-brimstone fervour. Of its two leads, vigilante preacher Reverend Ray undoubtedly stole the show, with his ~concentration mode~ quick-draw skills and crazed, throaty admonishments from the scriptures. It was an uneven game, but had the authentic tang of frontier madness that made it a great western.The sequel is more confident, but perhaps more conservative. Techland understands that Ray was the most interesting thing about Call of Juarez, but misunderstands what made him so, in a slightly worthy attempt to trace his roots and tell his origin story as a fighter in the civil war and then a bandit on the run with his two brothers. The majority of Bound in Blood is thus a straight-shooting tale of outlaw anti-heroes chasing after treasure and fighting over a woman, and although it's still a well-spun yarn with a fantastic sense of place and time, it doesn't quite have the same fire in its belly.It also irons out most of the first game's quirks, and railroads the action straight into a set-piece-studded shooting gallery in the Call of Duty style. Rarely in recent memory has a game been so relentlessly focused on Shooting The Men Who Are Quite Far Away And Difficult To See. A few skilful gun-slinging flourishes aside, Bound in Blood is a supremely old-fashioned FPS, but that's not necessarily a problem, because this is old-fashioned country. Rifling enemies' bodies for ammo, squinting down your sights and grimacing at reload times while you hide behind a rock suits the weaponry and wild gunfights of the era, and goes with the untamed territory.Bound in Blood still has two leads, and Ray's younger and smoother brother Thomas inherits some of the athleticism, stealthiness and sniping skill Billy Candle had in the first game - the ability to use bow and arrow, and a lasso to climb to hard-to-reach places, for example. Ray is still a close-range force of nature with his dual pistols and love of dynamite.But both men now enjoy a Concentration Mode: Ray's is a slow-mo moment of multiple-target selection before he releases a flurry of shots, while Thomas's is more automatic and cathartic, the game picking targets for you while you hold the trigger down and flick the right thumb-stick like you're fanning the hammer of a revolver. You can also select either brother at the start of most chapters, not that it will make much difference beyond the odd detour. Whichever you choose, opportunities for genuine stealth will be few, and you'll be putting a dozen no-good sumbitches in their graves every 60 seconds. Bang! Bang! You're dead.None of which should suggest for a second that Techland has lost its knack for Wild West wish-fulfilment. Bound in Blood canters unapologetically through every western cliché in the book, and does so with enough vigour and sense of style that you'll enjoy the ride. The first chapter tips the nod to Call of Duty with its depiction of a battle in the Civil War, but then the brothers promptly become deserters and outlaws; they burst into saloons both guns blazing, pull bars off a jail window with a horse, steal a stagecoach, fall in love with a Mexican bandita, recognise the honour and pride of the Native American, and shoot lots of other Native Americans - as well as lots of Mexicans, lawmen, outlaws, Yankees, rebels and prospectors. They shoot lots of everybody.As well as the on-demand Concentration Mode, which you earn the right to through rapid and skilful killing, Techland drops in a few scripted moments of superhuman gun-slinging when everything goes slow-motion. In these, twin crosshairs converge on the centre of the screen and you squeeze off shots on left and right as they pass over enemies. It's a lot more effective than it sounds, especially when it's used in tandem with both brothers storming a wide doorway from either side."}