{"ref": "https://www.eurogamer.net/wii-sports-resort-hands-on-0", "date": "24 Jun 2009", "game_name": "Wii Sports Resort", "text": "With global sales approaching 50 million units, Wii Sports has comfortably overtaken Super Mario Bros. as the best-selling videogame of all time. Of course a great deal of that success can, as with the previous record-holder, be ascribed to the fact that the game comes bundled with the console upon which it plays in every country outside of Japan. But the link between Nintendo's Wii and its number one sports game runs far deeper than a physical tie at the point of sale.Just as Super Mario Bros. defined the NES so Wii Sports exemplifies the Wii's functionality and appeal, along with its maker's current vision and ambition, better than any other. Arguably the principle success of this immediately irresistible sport-themed mini-game collection has been in revealing to non-gamers why gamers play videogames. With a barrier to entry as low as swinging the controller like a racket or bowling ball, anyone can experience for themselves the joy of digital cause and effect. In this way Wii Sports has broadened gaming's boundaries and improved the mainstream cultural standing of the medium more significantly than almost any other title.But who cares, right? The record-breaking stats and industry-redefining influence are irrelevant to players who felt let down by the brevity and shallowness of the Wii Sports experience. After extended play anyone can see that Nintendo's digital puppetry makes us believe we have more control than we really do; the subtlety of our shots during a tennis match, for example, is simplified almost beyond relevance in the short journey from Wii remote to sensor bar. Without a fun or thoughtful context for the mini-games, which were instead plonked within an abstract hub as if they were dry options in an extended tech demo, it was easy to feel shortchanged. Even though the game had come for free, the Wii Sports promise cost our expectations dearly.On almost every one of these counts, Wii Sports Resort seeks to answer its critics. Without doubt it's the flagship title for the Wii Motion Plus, the controller attachment that promises to upgrade the sensitivity of player movements on screen, allowing true nuance of hand movements to be replicated with an accuracy that's been maddeningly out of reach thus far. Then there's the island resort itself, a context that's valuable for both providing an overarching theme to the activities on offer and a sense that the new Wii Sports offers a true gaming destination - not just another menu screen's worth of Wii Fit-style workouts. Indeed, as you skydive in formation with your Mii buddies from 10,000 feet, a never-ending SEGA-blue sky stretching off into a watery horizon while chick-yellow beaches and bean-green forests jostle far below, there's a sense of being on holiday. A new summer of gaming has arrived and there's no need to bring a book."}