{"ref": "https://www.eurogamer.net/ea-sports-grand-slam-tennis-review", "date": "22 Jun 2009", "game_name": "EA Sports Grand Slam Tennis", "text": "This review has been withdrawn by the editor due to errors in the review process. Please see the Editor's blog for an explanation, and our re-review for a revised and, we hope, fair judgment of the game.In a month that's seen motion-sensing controls rocket to the top of the agenda across the spectrum of consoles, Wii MotionPlus's timing surely couldn't be better: Microsoft and Sony talk about the future in aspirational terms at the start of the month, and a fortnight later Nintendo's dream is reality. On the other hand, the dream isn't really reality until 24th July, when Wii Sports Resort, the first Nintendo game for the new accessory, comes out. In the meantime, it's up to Electronic Arts to shoulder expectations with the first WMP game, and the publisher's first tennis game in 15 years, Grand Slam Tennis.But not to worry, right? Because tennis should be an ideal way to demonstrate the precision accuracy of Wii MotionPlus - swinging the Wii Remote around like an imaginary racquet, delighting as the new upgraded technology senses our shot-selection with a fair degree of accuracy, strawberries all round, etc. Combined with EA's pedigree in releasing glossy, accessible sports titles, it should be a winning combination.On a basic level, the game works almost identically to Wii Sports' tennis offering, with running taken care of for you (although you can position your player with the d-pad or nunchuk if you prefer), flat shots pulled off with a short swing, a slice performed by going high to low and top-spin by going low to high. The game says that the harder you hit the shot, the shallower it will land. In addition, pressing A along with your swing produces a lob, while pressing B delivers a drop shot.Sounds simple, and so does aiming, where timing is all-important regardless of whether you have the Wii MotionPlus attached or not. According to the basic instructions (hidden away in a sub-menu), you swing early to make the ball travel left, and swing late to make it travel right, while the WMP tab recommends ~smooth and easy motions~ with ~follow-through to aim/place the ball~. In addition, backswing is said to determine your position for the actual swing. It all sounds pretty intuitive, and the little animated diagrams make it look simple and logical.Sadly though it isn't. In fact, the harsh reality is that shot-selection is unreliable, and as Tom pointed out in his recent hands-on, the game's system of shot-selection and direction makes you wonder out loud if WMP is even functioning correctly.Perhaps the best way of determining this is in front of the game's ball machine on the practice court, where the type of shot you produce is displayed on-screen. This gives you a fairly basic means of determining cause and effect, but it also serves to display the narrow margin of difference between shot types. And while it might be possible to nail down your shot-selection reasonably early on, getting the game to behave itself during shot-placement is a dark art that makes Grand Slam Tennis feel disproportionately difficult on even the easiest setting.Usually in console tennis games, one of the most effective means of ensuring players get used to a new control system is to encourage them to enter a Tennis Academy and learn all about shot-placement and which shots are the best for any given situation. Sadly, Grand Slam Tennis has nothing of the sort, save for the ability to slug it out against the aforementioned ball machine. You can either play a four-tournament Grand Slam (encompassing Wimbledon, as well as the French, Australian and US Opens), or play against friends offline or online. To get better, you just have to get better. Eventually. Or you might not."}