{"ref": "https://www.eurogamer.net/overlord-ii-review", "date": "21 Jun 2009", "game_name": "Overlord II", "text": "Mayhem-mongering has rarely been as fun as it was in Triumph's gleeful action-strategy title Overlord. Released a couple of years back, it was but a few tweaks away from classic status, combining elements of Pikmin, Dungeon Keeper and Fable to satisfying and comic effect. Dispensing cackling evil at every turn, it made us want to play the bad guy more often - and obviously you lot felt the same way. Sales of more than a million worldwide across PC, Xbox 360 and latterly PS3 turned Overlord into Codemasters' biggest new IP in years.So, apart from perhaps requiring Brian Blessed's inimitable input, what else should go in the follow-up? More evil, obviously. More comedy headgear. Less suicidally dumb minions. A better-behaved camera system. At least some of these kinks (such as the absent mini-map) were ironed out in the belated PS3 release, Overlord: Raising Hell, but it still felt a little shy of the finished article. With numerous preview showings of the sequel demonstrating a ton of interesting new features, confidence was riding high that Dutch studio Triumph could go all-out and deliver not only a worthy follow-up, but, dare we say it, one of the highlights of the entire year.To begin with, the basic plunder-and-conquer premise remains, with roughly the same amount of puzzling interspersed with action. The main difference is that you're playing the offspring of the armour-suited mischief-maker, and we pick up the thread with the new Overlord firstly proving his evil credentials, and then being initiated by the ever-humble minion master, Gnarl. Acting as your tutor and fawning servant, the sequel follows a familiar pattern with a seamless introduction of your basic powers and the abilities of your ever-willing band of evil helpers. You kick-off with five brown 'minions' - sharp-toothed, giggling little wretches who take great pleasure in smashing up anyone or anything that gets in their way. As the melee specialists of your gang, these are the guys you want spearheading attacks, although they prove vulnerable to water, fire and toxic gas - something the blue, red and green minions are resistant to, respectively, once they're added to your growing army of miscreants. The standard two-stick third-person controls are once again the order of the day, with movement assigned to the left stick and the right stick sharing the camera controls for the Overlord with the 'sweep' controls for the minions. Selecting, switching between and manipulating minions remains a simple yet flexible process which is introduced steadily during the early portion of the game. Whether you're sweeping, sending minions to specific targets, setting up 'guard markers' or calling them back, it becomes second nature in a short while. Those who played the original will be at an initial advantage, but the steady way the game is structured ensures that even newcomers will be pleasantly surprised at how straightforward it is to pull off seemingly complex commands using button and trigger combinations.From the top down, it's clear that the Dutch studio listened to the community. The first thing that old hands might notice is that the minion AI is a little sharper, and less inclined to just follow the Overlord to their doom if the way ahead is dangerous. Path finding, too, is more reliable, and as a consequence you don't lose too many minions in inexplicable circumstances. If they do become trapped, after a time they'll invisibly return to their respective minion gates rather than dying in droves as was often the case before. The new mini-map is another crucial addition - it ensures that you know when you're on the right track, and removes all the time-consuming wandering of the original.Another new feature is the ability for your minions (blues excepted) to become extra powerful by mounting other creatures, such as wolves, salamanders and giant spiders. Otherwise insurmountable problems - such as a tightly meshed unit of shielded soldiers - can be barrelled apart by sweeping a pack of mounted wolves into them, while making friends with spiders allows your greens to sidle up walls, activate pressure plates and reach otherwise off-limits areas. There's also the ability to disguise your happy band of evildoers in enemy garb on a few occasions, with nearby changing tents allowing you to dupe guards into letting you pass. On both counts, Triumph gets around the need to add further control commands by making certain new features context-sensitive, with the player only required to, for example, sweep minions into the tent or onto the mount to activate them.Elsewhere, firing magic into Possession Stones allows the Overlord to possess a single minion and wander off with a limited number of his chums to investigate part of the level too locked-down, or simply too small, to barge into in standard form. These stealth-lite interludes are an enjoyable change of pace, and because of the small size of the minions, the game zooms down to their level and you end up with a real sense of scale and vulnerability as you sneak past lumbering sentries. As a concession to the omnipresent danger, Triumph doesn't overly punish failure during these sections, and if you happen to screw up and lose all of your minions, you get to start over at the Possession Stone once more, with all the minions replaced. Better still, any sentries you've dispatched, or doors you've unlocked remain that way on your next attempt, so you're not simply expected to repeat all your meticulous good work over and over again.Other new 'War Machine' gameplay elements enter the mix too, such as catapult and ballista emplacements that give you the chance to launch boulders or fire wooden stakes to rip apart massed shield-wielding soldiers. In addition, you can also occasionally board ships and rafts in watery sections and chase after opponents while trying to ram their craft and set alight to their sails. And if that wasn't enough, the Overlord's magical abilities have also been expanded and made more useful in a variety of situations. As well as being able to zap or slow targeted enemies from a distance, you can power up individual minions and turn them into a missile, or destroy them and devour their energy to give you a health boost. Later, you can even use a Halo spell to temporarily boost all of your minions' powers, or as a powerful shockwave. And as part of the game's central 'domination or destruction' premise, you can also now choose whether to enslave innocents and get them to fight alongside your minions, or just destroy them for the hell of it. Mwahaha."}