{"ref": "https://www.eurogamer.net/sega-vintage-collection-review", "date": "17 Jun 2009", "game_name": "Reviews", "text": "Following a drip-drip accumulation of classic SEGA titles on Xbox Live Arcade, the venerable publisher finally splurged itself big-style last Wednesday, with a whopping six titles in one beefy update. Priced at just 400 Microsoft Points (GBP 3.40 / EUR 4.80 in actual pennies) they're already roughly half the price of the same games on Nintendo's Virtual Console, and come with online doohickies to boot. It's a great price point for this sort of game - it makes the true classics an absolute steal, yet also makes the pretty good titles much more appealing.All but one of these games are, of course, already available on the SEGA Megadrive Ultimate Collection, in almost the exact same emulated form. This generous package of over 40 old games can be picked up for silly cheap prices, but for those who just want to cherry-pick the cream of the crop, this is an excellent update, with a solid line-up of good-to-great SEGA titles spread across various genres. And Altered Beast.While his games may not showcase the sort of startling evolution that arch rival Super Mario Bros. enjoyed, the original Sonic titles are too often undervalued when great 2D game design is discussed.Case in point, this third outing for the blue wonder is superficially similar to the first two games, but contains enough gentle evolutions of the core design to make it pretty irresistible. Size is one of the major changes, with stages that now sprawl in many directions. The space is wisely used as well. Those who prefer the speed-run approach can still hammer through the scenery and make straight for the exit, but there are so many secrets and obscure areas hidden behind rocks, at the top of trees or accessible only by top-notch platforming that more, thorough players can spend blissful hours mining the game for every last ring.Sonic himself is much as he was in the second game, although he's now able to pick up elemental power-ups that not only act as a shield, good for one hit, but also provide new attacks such as water bubble bounces and fire blasts. There's also a shift to co-op play (offline only, sadly) as Tails can help Sonic by airlifting him to remote areas. The versus mode returns, and is playable online as well.It's not Sonic & Knuckles, but that's about the only serious criticism that can be levelled at such a confident and polished sequel. Not quite a stone-cold classic, but close enough to make the low asking price a no-brainer.8/10One of the finest action games of the 16-bit era, Gunstar Heroes is the evolutionary link between the ruthless design of Mega Man and the goofy carnage of Metal Slug. A relentless side-scrolling shooter, it also represents all that is great about offbeat developer Treasure's output.Like Mega Man, you can mix and match from a variety of elemental-themed weapon sets. You can also choose which order to tackle the game's stages. While Capcom's armoured hero was always more about precision platforming than frantic blasting, however, Gunstar Heroes is deliriously paced, its outrageous crescendos beautifully conducted for maximum ~daft grin~ effect.Bullets fly, everything explodes and you keep on moving. Enemies that get too close are judo-flipped into their comrades, and the layered platforms ultimately feel like an adventure playground of trigger-mashing destruction rather than any nuanced obstacle course to be navigated.True to the Treasure house style, the humour is broad, the ideas wacky and the gameplay subtly tweaked every few minutes to keep you engaged. One minute you're sliding down an incline, blasting enemies as they skid past, the next you might be battling a runaway train. Treasure's love of the boss battle is also front and centre, with a rapid procession of fantastically designed and animated foes to wear down through pattern recall and fire-button abuse.A glaring omission from the disc-based Megadrive Collection, Gunstar Heroes is a great choice for the SEGA Vintage series. The hardcore will lap it up, but anyone who still remembers what it's like to grin like an idiot while blasting hundreds of enemies will more than get their money's worth as well.8/10One of the unsung gems of the Megadrive, Comix Zone mashes up the pugilism of Streets of Rage with some rudimentary inventory-based adventure game mechanics and comes up with a distinct flavour all of its own.The story finds a comic artist - a very 1990s comic artist, complete with ponytail, Bermuda shorts and sleeveless leather jacket - sucked into the panels of his own creation. You're able to punch enemies from one panel to the next, or rip through the page border and drop down into scenes below. Combat is satisfying, if unoriginal, but this conceptual twist makes the framework seem fresh.Given its comic book back-story, it's also a game that could only work in a world made from 2D sprites, and the graphics do a fine job of capturing the little details that mark the difference between an OK game and one with that extra polish.The game is arguably a little too tough, with plenty of ways to lose health but few to top it back up again, and there are a couple of precision do-or-die leaps that act as stark reminders of the game's unforgiving vintage. Those caveats aside, Comix Zone still impresses with its ideas and execution and is a definite highlight of SEGA's retro line-up.8/10"}