{"ref": "https://www.eurogamer.net/rock-band-unplugged-review", "date": "11 Jun 2009", "game_name": "Rock Band Unplugged", "text": "Now that rhythm-action gaming is synonymous with peripherals, it's easy to forget that for ages all we had was buttons. Ordinary buttons, on an ordinary, non-amusingly-shaped controller. Going back feels terribly strange, as your fingers struggle to work their way around the PSP at speed, but after a while you get used to the controls, a fuzzy nostalgia sets in, and Rock Band Unplugged starts to become a quiet obsession.That nostalgia is largely down to how closely Rock Band Unplugged echoes Harmonix's first titles, FreQuency and Amplitude, in terms of the way it's played. It's not just a straight transposition of the grown-up Rock Bands to a portable format, which would probably have been the easier option - instead it's a different gameplay concept, one that's a bit more old-fashioned and decidedly single-player, demanding concentration and precision as opposed to bluffing through solos and band camaraderie. In its way, though, it's no less entertaining.Notes scroll towards you on the screen on a vertical plane, as will be familiar to anyone who's played a rhythm-action game since 2005. But instead of playing along to one instrument and matching as many notes as you can, like in Rock Band proper, you switch between all the instruments in a track with the L and R buttons, hitting all of the notes in a phrase with d-pad left, up, triangle and circle buttons before moving on to the next.Usually the notes come one at a time, but as you work your way up the difficulty levels the game introduces three and four-button chords as well. It works perfectly well once you get your fingers around it - the only button combination that's undeniably awkward is trying to press up and right at the same time on the fiddly PSP d-pad, but the developer seems to know this - you're only asked to pull off that chord on two of the high-difficulty songs on Expert.If you don't hit a sequence of notes perfectly, you fail the phrase and that instrument drops further and further into the red. Complete a phrase, and that track turns off for a little while, leaving you to move on to another instrument. It's about balancing all of the tracks, taking care of the easier instruments so that you have enough time for a few goes at a complicated drum track without some other instrument dropping into the red and failing.When a solo happens, you're snapped automatically to that track, so there's no avoiding Offspring drum solos or the endless minutes of guitar-squealing in the middle of Judas Priest, and the rest of the song goes on hold for a while until it's finished. In solo sections things revert to the ordinary Rock Band system, where you just try to hit as many notes as you can. It gives the tracks a bit of structure, and consistency too - you're rarely struggling with a stupidly hard part of the song whilst easier tracks slip slowly into the red.In place of FreQuency and Amplitude's helpful items, we get Overdrive power as a reward for hitting tricky sequences. It's easily activated with a press of the X button and serves the dual purpose of more than doubling your score-multiplier if you're doing well (from 5x to 11x), or rescuing a failed track if you're struggling. And, naturally, it makes the notes and tracks go all shiny and bright and the music that bit louder, which feeds addictively into a classic rhythm-action sensory feedback loop of light and sound that can keep you locked into the game for hours, eyes an inch from the screen.Score-chasing is a much more essential aspect of Unplugged than its bigger brothers - you build up a streak by hitting consecutive notes and get a bonus for every successful phrase you complete on top, and you've no hope of getting four or five stars on a track without clever use of Overdrive to maximise your score on a long streak, no matter how well you play. The added franticness of switching between tracks at the end of a phrase in time to continue your multiplier makes it more of a zone game than most modern rhythm-action - you barely get a second to catch your breath between phrases and constantly have to think ahead."}