{"ref": "https://www.eurogamer.net/prototype-review", "date": "10 Jun 2009", "game_name": "Prototype", "text": "As Uncle Ben once said, with great power comes great responsibility. However, according to videogames, with great power comes 10 minutes of action and then some sort of flashback or plot device that takes the great power away again, followed by 10 hours of getting it back. Prototype is that sort of game.But hey, those 10 minutes are mental. Hopping into the trainers, jeans and hoodie/leathers ensemble of a grumpy-looking Alex Mercer, you set about ripping through Manhattan, running up sheer skyscrapers to launch into tank-destroying elbow slams, throwing yellow cabs into helicopters, and ultimately taking out an entire city block by crouching into a sort of organic explosion, which pierces just about everything in the vicinity with black, otherworldly tendrils of death.And hey again, even without your powers, you're still powerful, and by the time you reach the same stage of Mercer's evolution a couple of game-weeks later, you will not only feel like you've earned it, but you will have a greater understanding of every little thing, forged through exciting, brutal experiences that always emphasise your ridiculous, superheroic abilities.Admittedly though, you still won't behave very responsibly, and fans of serious hero fiction will find Prototype a bit of a turn-off. You're infected with some sort of virus, which allows you to grow spikes and other things out of your arm, withstand enormous damage, and do superhuman things, and the story of why, told through snatches of video obtained by absorbing key characters (basically, weakening and eating them) and in moody cut-scenes, is basic and yet difficult to follow.But the greater shame is it never accounts for the fact that your primary source of health is eating civilians, who you also run over in tanks, and murder by running through them with your shield out or armour on. It's not really collateral damage: you're on a self-serving quest to find out where you came from, and nobody's getting in the way, even if they're terrified and clearly not infected.Still, ignore that and there are a lot of infected monsters and fascistic soldiers to vanquish in enterprising style. Although an openworld game with Ang Lee's Incredible Hulk-style superjumps and the requisite hover and air dash moves to increase your range, Prototype's primarily a brawler, offering an increasingly ferocious range of offensive mutations to morph between. There's also an experience-points currency used to unlock a tsunami of overlapping powers covering combat, infiltration and manoeuvrability, which splashes across the upgrade menus as though someone's popped Marvel Comics in a blender with some trenchcoats and Marmite and forgot to put the top on.Targeting enemies with the left trigger, every button on the pad has to sing for its supper to allow for regular and heavy attacks, area-effect attacks, uppercuts, grabs, slams, throws, flying kicks, stealth kills, consuming enemies, and ultimately the aptly named slow-motion Devastators, which you can access at the peak of your powers or with your last sliver of health. And that's before you consider more menial things like dashes, sprinting, switching to a disguise for evasion (the last body you consumed, cunningly), and using the radial menu to switch buffs and weapon-sets.Developer Radical is also happy to let you play with the military hardware sent after you, if you can overcome a storm of lead and missiles to obtain it. By consuming certain enemies (usually highlighted in a story mission), you gain the ability to hijack APCs, tanks, and eventually helicopters, which have a Grand Theft Auto-style thrill to them after so many hours running, jumping and hovering to get around."}