{"ref": "https://www.eurogamer.net/uncharted-2-multiplayer-beta-hands-on", "date": "9 Jun 2009", "game_name": "Uncharted 2: Among Thieves", "text": "Once upon a time, the beta stage of software development was kept firmly behind the velvet curtain of industry secrecy. Then some cunning soul realised you could get the customers to help test the game, and build some early marketing buzz at the same time. Now it seems like no multiplayer game with any sort of profile can make it through development without throwing beta keys around like candy.The downside to this welcoming gesture is that it can build expectations a little too high, turning something into an event that would otherwise pass without comment until review time comes around. So it is for Uncharted 2, still several months from release, but already sharing a slice of its multiplayer component.This isn't to say that Uncharted's dip into online waters is a bad idea, just that the result seems to be the sort of multiplayer experience that might extend your entertainment for another week or so, but nothing to make you gasp in astonishment.The beta seems to be the exact demo build that we reported on back in April, boasting the same bite-sized chunks of both competitive and co-operative play, with two maps and modes for competitive, and one truncated co-op chapter. All benefit from Naughty Dog's fondness for cinematic polish and top-notch presentation, but there are still some quirks to be ironed out, mostly to do with balance and the transition from single-player action-adventure to multiplayer mayhem.For those who just want traditional communal slaughter, we have Team Deathmatch and Plunder. Both feature teams of five - heroes and villains, drawn from the game's smallish cast - pitted against each other, either in the nocturnal ruins of The Plaza or the rain-sodden Village. There are few surprises in the modes themselves, with Plunder being a repainted Capture The Flag mode where the most notable change is the chance to throw the stolen treasure - either to a teammate or into the scoring zone. Other than that admittedly clever twist, there's nothing in the competitive play that won't already be familiar from Gears of War, Metal Gear Online or most other third-person multiplayer bouts. Perks, or ~boosters~, are available to increase your accuracy with certain weapons, and improve your ammo capacity, but it remains to be seen which ones will be available to all at the start, and how many will be added to those who rank up.The two maps are small but varied, and cram a lot of tactical opportunities into a compact space. Ground level rat-runs cross into deadly open spaces, with plenty of interiors and elevated areas for those who like to play a stalking game. There's limited use of Uncharted's acrobatic platforming mechanic, but the ability to scramble and clamber certainly loosens up the gameplay, at least initially. Neither map is exactly awash with vertical options though, with ladders and handholds generally leading to a small sniper-friendly rooftop but not much else. For these two maps, at least, it's very much a two-storey world.When last we saw the game, Naughty Dog was insistent that the ability to shoot, even when climbing or dangling, would be a point of difference, and provide a thematic bridge to the environmental traversing of the solo game, but nobody seems to be making use of this feature at the moment. When the bullets are flying, the game simply moves too fast, and is too unforgiving, for such showboating."}