{"ref": "https://www.eurogamer.net/forza-motorsport-3-hands-on", "date": "4 Jun 2009", "game_name": "Forza Motorsport 3", "text": "Microsoft's racing studio Turn 10 wants to make the ~best simulator on any console~, and one that a child of six could play. It wants to get 65-year-old classic car restoration enthusiasts playing videogames. It wants to make the biggest racing game the world has ever seen. It wants to be the first to bring you tyre flex and deformation at 60 frames per second. It wants to foster the most vibrant user-generated-content community in all gaming.There's not a lot that Turn 10 doesn't want, and going by a confident presentation to UK press after-hours at E3 yesterday, Turn 10 is pretty sure that it's going to get it all. It reckons it's creating ~the definitive racing game of this generation~, a phrase used so often in its Microsoft press conference debut that the meaning was worn out of it like the tread on a set of tyres. Forza Motorsport 3 has so much definitiveness that it can't fit on a single DVD.That's right, this will be a two-disc release when it appears in October, hardly a surprise when you consider the 400 cars spread across 50 manufacturers and the even more astonishing 100 tracks. We're asked to consider it like getting a year's worth of DLC for free on release, which seems fair enough; the first disc will present a ~complete game~, and the rest can be installed to hard drive so there's no need for disc-swapping.No matter the quantity of content, getting granddad and grandson involved in a simulation racer like Forza - historically a very good but rather dry one - isn't going to be easy. Many people, seasoned gamers among them, have a deep aversion to braking in racing games, but a realistic game like Forza demands it.Turn 10's solution is what it likes to call ~one-button racing~ - in other words, the latest addition to Forza's suite of driver aids, the auto-brake. This manages your speed through corners so you don't have to, and can concentrate on following Forza's signature racing line indicator instead. An assist too far? Certainly I found it a little disconcerting when I tried the game on easy, after I'd got over being disconcerted by the terrifying triple-screen set-up on Microsoft's stand, with force-feedback wheel and pneumatic racing seat.Taking braking out of the equation seems very odd in a game that, even with stability, ABS and traction control turned on, feels true-to-life in its handling. Forza isn't a hell-for-leather arcade game and it's no use pretending it is, and the result, once you get over the sound and fury, is a rather uninvolving ride. Although you can turn it off of course, and it's certainly worth trying to make the game more accessible to more people, we wonder if this will give them the right idea. Regardless, there's nothing to suggest that Forza 3 won't have best-in-class handling at launch.A much more successful bid for usability is the inclusion of the rewind feature pioneered by Codemasters' Race Driver GRID. Accessed at any point, taking you back as far you like, and with no penalty whatsoever for use, it works perfectly in the context of a game where glancing contact with a barrier can ruin lap upon lap of dedicated driving."}