{"ref": "https://www.eurogamer.net/gran-turismo-psp-hands-on", "date": "4 Jun 2009", "game_name": "Gran Turismo", "text": "You can read far too much into an E3 demo, and we'd be wrong to assume that the finished Gran Turismo PSP won't feature much, much more than the version we've played in Sony's suite. But the early signs are that this will be a slenderer game than its home console counterparts - hardly surprising, given it will be a flagship launch title for the download-only, UMD-free PSPgo.The main menu options are single-player, multiplayer, Mission Challenge, Car Dealer and Trade. Mission Challenge is a combination of the traditional GT Licence Tests that guide players through the basics of simulation racing, and GT4's more advanced Driving Mission scenarios. Trade and multiplayer weren't available to test, while the car dealer was a shop, pure and simple.What you'll be shopping for will be instantly familiar to any Gran Turismo fan. Polyphony head Kazunori Yamauchi has his own particular taste when it comes to cars, and it's not the most up-to-date, but it is a real connoisseur's selection of eighties, nineties and early 2000s Le Mans racers, rally cars, Japanese tuner coupés, plush Euro production cars and esoteric classics. We spot the latest BMW M5 and Skyline, an '85 Lancia Delta rally car, a 2002 Lotus Esprit, a DeLorean and classic Mustangs and E-types as well as some unlikelier candidates, notably the Dodge Ram pickup and a vintage Citroen 2CV. There are 100 cars in this demo and we'd be surprised if that was all of them.Single-player offered single race, time trial and the new drift trial modes, but none of the more substantial race events that we're used to from Gran Turismo. Drift trial puts markers around the corners of the selection of classic Gran Turismo tracks - the likes of Trial Mountain, Deep Forest, Laguna Seca and the Nordschleife Nurburgring - and scores you for the longest drift around the corner. Standard racing has adopted the racing line guide introduced by series rival Forza Motorsport.There's no car modification or tuning on show at all in this build, although Yamauchi promises this GT staple will appear in some reduced form in the finished game. You can however set traction control, stability management, steering assists, change car and tyre settings, save replays and download time trial and drift ghosts.The on-track experience is pure Gran Turismo - well, almost. The combination of the iconic tracks and cars means you couldn't mistake it for any other racing game, but the feel is a little way off simulation, especially in rear-wheel-drive cars which tend to oversteer and drift with extreme ease. It almost feels like Project Gotham in places - but the sense of weight, suspensions travel and road surface is still amazingly strong for a handheld game.Read on for an interview with Kazunori Yamauchi (conducted by Christian Donlan).It's going to have a Quick Tune mode. You won't be able to replace parts or anything, but you'll be able to adjust your spring rate, ride height, and camber alignment.That's the main reason. One thing that we were careful about when we designed the PSP version is that Gran Turismo provides a really wide field of options and things that you can do in the world and on the PSP version we have such a small screen, if we provide that kind of options it will confuse the user, so we're very careful to make sure that the player would clearly know what to do next in incremental steps rather than have the same kind of system as Gran Turismo has provided before.In the traditional Gran Turismo you're too free to do anything you want, and to have the player focus in on the small screen it has to be very clear what you have to do next, and it's that kind of presentation within the system. So the depth of the game hasn't changed, just how we present is different.We're still working very hard on that, and we're actually working to get it down to around a gigabyte.Not really, because it's actually just a matter of coincidence that the release of our software and PSPgo coincided.We first made the announcement in E3 of 2004, so [laughs] it's been five years. Since then we've released GT4, Tourist Trophy, GTHD and GT5 Prologue. Of course we were always working on the PSP version a little bit at a time, but every time we have one of those releases it's affected by that new title. So this is a software that was born in between GT5 Prologue and GT5, and it's affected by both of those titles."}