{"ref": "https://www.eurogamer.net/e3-wolfenstein-hands-on", "date": "4 Jun 2009", "game_name": "Wolfenstein", "text": "~Everybody hates Nazis so they're just more fun to kill,~ beams Peter Sokal, id's community manager. That notion has, in essence, been at the pumping heart of the WWII shooter genre's popularity since Wolfenstein 3D took aim at the Führer in 1992. The palsied debate over 'WWII fatigue' in gaming is mind-numbingly dull - a great WWII game is a great game, blah-di-blah - but Wolfenstein, the great-granddaddy of FPS games, always had the 'zombie Nazis' trick up its sleeve. (One which Treyarch most recently borrowed for the game-completion bonus in Call of Duty: World at War).The more pertinent debate, particularly during E3 week, is how any shooter commands attention when all scopes are zoomed in on the Halo 3: ODSTs, Modern Warfare 2s, and BioShock 2s. This is a question Raven Software will feel more acutely than most, at the helm not just of Wolfenstein, in id's stead, but also its own original IP, the time-warping Singularity.What Wolfenstein has in its favour, of course - other than the gleeful slaughter of Team Swastika - is heritage. ~We obviously know how there's a huge fanbase there for Wolfenstein,~ says Sokal. ~We love it, and we know the old school fans and what they enjoy in the franchise, so it's a matter of keeping those things intact but also evolving the franchise.~The rhetoric may be as old as the series itself, but the ~pillars of the franchise~, as Sokal refers to them, entrusted to Raven are as carefully constructed as Hitler's 'tash. ~Fast-paced first-person shooter combat, that is the most important thing about the Wolfenstein franchise. Then you also have the dark occult, the supernatural, the unexpected stuff.~Wolfenstein is a franchise where there's something unexpected around every corner. But for every one of those unexpected things we give you a badass gun to shoot it with.~As we've observed before, after a while the endless grey walls and brown crates of first-person formality have a tendency to blur in the mind into one long shotgun-wielding corridor-run to anonymity. So a stiff dose of the unexpected helps enormously. And in Wolfenstein, Raven hopes Veil powers - afforded via the supernatural conceit of an appropriately ridiculous plot involving the occult power of something called the Black Sun - are it. We've already been teased with a couple of Veil powers. Time-slowing Mire's useful if you're running head-on towards a manned turret. And Sight can highlight enemies in dark areas, give you a visual grenade trail to assist aiming, and - crucially - provide the ability to see through walls, and identify alternate paths.Raven's now discussing the full set. ~Then you've got Shield,~ Sokal explains, ~which initially is like a bubble in front of BJ that absorbs damage. But you can also upgrade your Veil powers so when you get your Shield upgraded, it can bounce bullets back at enemies and hit them in the throat. And it also serves as a battering ram when it's fully upgraded, so you can just charge into a group of guys and they'll just fly back and disintegrate.~ The fourth and final Veil power is Empowerment, which basically lets you shoot through stuff. The more upgraded, the stronger the material you can penetrate: so you may start by being able to pierce boxes (wow!) to take down enemies in cover. At full power, you can blast through solid stone. Moreover, you can chain powers together. The example Sokal offers is of BJ armed with fully upgraded Sight and Empowerment. Using Sight he can look through a pillar to spot an enemy; then by switching to Empowerment (all accessed via the d-pad), he can blast the clueless drone to smithereens without exposing himself."}