{"ref": "https://www.eurogamer.net/bionic-commando-review", "date": "20 May 2009", "game_name": "bionic commando", "text": "What with videogame worlds getting bigger and bigger, it's no surprise that we get correspondingly excited whenever someone comes up with a new way to lob ourselves across them - whether it's jumping between rooftops in Crackdown, zooming along Halo in a Banshee, or swinging around the crumbling remains of Ascension City like Tarzan meets Robocop in Bionic Commando. If we're going to commute between the fun, better to do it in style.And although it takes a while to comprehend, Bionic Commando's swing mechanic is very stylish. As you fall from the rooftops you make a grab for lampposts, jutting girders and carved-up monorail by compressing the left trigger as they flash past, firing out a grappling hook from your bionic arm and slingshotting smoothly beneath at a matching pace, before releasing to send yourself in a preferred direction. Maximum respect goes to the programmers behind the context-sensitive icon that shows where you can hook on, because the distances are intuitively consistent, and with a bit of application the learning curve flattens out and you're able to manoeuvre swiftly and impressively, and catch yourself when you brush up against the limitations of your own dexterity.But then, of course, Crackdown wasn't really about jumping between rooftops, and Halo wasn't about zooming around in a Banshee, so Bionic Commando can't afford to be about protagonist Nathan Spencer's impressive Spider-Man antics alone. Instead it's most frequently about a succession of fights that call upon different areas of Spencer's expansive arsenal.On the basic end, he has a pistol and grenades, which you can apply with typical if not particularly great effect. More elaborate weapons, like a multi-firing rocket launcher that locks onto multiple enemies as you tag them with the probing reticule before release, and grenade launchers and sniper rifles, are provided by support pods fired into the city, but the enormity of their influence is mediated by a shortage of ammunition. Handily though, Spencer gradually recalls other things he can do with his bionic arm, like whipping or punching wreckage across the landscape, and latching onto enemies with his hook before reeling in to deliver a kick to the face - the latter even more handily rebounding you into the air for a follow-up.There's enough of a toolbox there to enforce experimentation, and the menagerie of beastly biomechanical monsters often has you rummaging around. Gorilla-like berserkers are susceptible at the rear and if you can penetrate their facial armour, but close the gap to the player at dangerous pace, forcing you to work quickly if you're limited to smacking them with the scenery, and to reach for stun moves like 'death from above', which allows you to clatter to ground with dizzying force. The aerial polycraft flyers keep their distance, wary of damaging zip-kicks, and the less animalistic but no less predatory human snipers have you dancing between their visible sighting lasers as you struggle for cover and tactics. A range of mini challenges (with corresponding Achievements) gives you new ideas, too.But it's when the more interesting battles are brought together with the swing that Bionic Commando stands out, as when you're dodging snipers in the industrial district (and later as you work through the park), trying to maintain aerial momentum to evade the beams. My favourite though was a battle with a Buraq helicopter on top of a skyscraper, where the exposed steel framework creates a jungle-gym or potential manoeuvres and the threat of the chopper's machineguns and backup polycraft compel you to make use of it. By the time you have secured enough rocket launcher rounds to outdo your hawk-like aggressors, you know you've been in a fight."}