{"ref": "https://www.eurogamer.net/ape-out-review-a-meditation-on-jazz-violence-and-escapee-monkeys", "date": "1 Mar 2019", "game_name": "Ape Out", "text": "From the moment you first smash your way out of your cell, pulping a guard against the opposite wall, it's clear Ape Out is going to be a lot of fun. The next thing you realise is that you're actually playing a kind of rhythm game. One where all you know is murder. Ape Out has a very simple conceit and is very easy to pick up. You, that is to say a honking great gorilla, want to escape. Lots of armed guards stand in your way, so it's probably best to brutally murder them on your way out the door. You have only two buttons to contend with - one to grab and one to smash. Hurling your enemies into the nearest wall or grabbing them for use as a meat shield makes you feel tremendously powerful, and the weird shuffling movements of the gorilla have been so well realised that movement is a delight - as long as you're playing with a controller, that is. Playing Ape Out with a keyboard and mouse is perfectly doable, it just lacks the same flow afforded by twin analogue sticks. Really though, as captivating as its murderous gorilla is, the true star of Ape Out is the music. Each level pulses or ticks or rattles or quakes along with its jazz soundtrack - the music ebbing and flowing depending on how well your rampage is going - and each enemy kill is punctuated by a noise, whether that be a cymbal hit or the shriek of a trumpet. At first, these noises feel like a punchline - a bit of slapstick to round off the vibrant, bloody visuals. The more you play, however, the more you open yourself up to the music and realise just how integral that soundtrack is. Suddenly those cymbal crashes and bits of brass don't seem like throwaway jokes any more - killing enemies almost feels like improvising. I really didn't expect a game about an ape dashing people's skulls against the wall to turn out to be a meditation on jazz as a medium yet here we are, and the effect is quite brilliant. The music does more than punctuate your actions as you gambol your way through each level, mind you - while the soundtrack provides a tremendous sense of momentum, it also gives you an idea of what's to be expected from each level. The first few tracks clatter wantonly as you get to grips with being 150 kilograms of murderous ape, but I had a tremendous moment in one of the later levels when the music kicked in and thought 'ok, I need to be careful here' because that's the mood I was getting from the soundtrack. It had a slower tempo with more minimalist, brooding instrumentation and, true enough, that level was hard. The concept of 'having music wot goes well with the level' is by no means new to games, of course, but there's something about the interactive layer here that makes it feel special, somehow. Of course it's very tempting to compare Ape Out to Hotline Miami but, for all their shared DNA, the two are about as similar as a man wielding a baseball bat is to a gorilla - both are capable of tremendous violence, but there are several key differences to be observed. Most significantly, Ape Out has a very different cadence to its synthwave-driven cousin. Speed is less of a constant here, allowing for some tremendous quiet moments in which you really feel like an animal stalking its prey. Sometimes the music dies down enough that, on grabbing an enemy, you can hear the gorilla breathing softly down the poor victim's neck, which is so brilliant as to be genuinely unsettling. This is a game that wants you to go on the rampage, but it also invites you to take your time and pick your moment carefully. Part of that cadence, of course, is down to the fact each level is procedurally generated, meaning you can't memorise an optimal route as you can in Hotline Miami. Much like jazz itself, it's not something you learn by rote - it's something you feel your way through. The levels also have a tremendous amount of variety that really impacts on your approach - the tight corridors of the opening levels' science facility couldn't be more different to the open, heavily exposed office building of later sections. Navigating these spaces demands a drastically different playstyle, giving Ape Out a range in tempo that's truly refreshing. The only downside to these procedurally generated levels is that it takes a few seconds to restart, which can be a mild irritant when you're desperate to get back in there for just one more go. The differing environments add a tremendous sense of atmosphere to Ape Out because for all the raw power at your disposal, it's underpinned by a tremendous sense of vulnerability throughout. Because your enemies have guns and you, being a gorilla, do not, timing is everything if you want to make it out alive. Making a big play at the wrong time can easily get you shot to bits so while Ape Out is about momentum, it's also about this weird, ragged kind of precision, much like jazz itself. In short, Ape Out is tremendous fun, but it wouldn't be anywhere near as enjoyable if it weren't for the soundtrack. Thankfully the music is one of a number of smart decisions made in designing this game, making it a treat well worth recommending."}