{"ref": "https://www.eurogamer.net/microsoft-flight-simulator-console-review-occasionally-clunky-port-cant-dull-the-magic", "date": "27 Jul 2021", "game_name": "Microsoft Flight Simulator (2020)", "text": "11 months since it first wowed the world with its depiction of nothing less than the Earth in its entirety, Microsoft Flight Simulator makes its debut on Xbox Series S and X. Does the magic that Asobo and Microsoft Game Studios conjured out of photogrammetry, cloud streaming and plain old elbow grease survive intact on console? Absolutely. Does it work as a console experience? Well, that's a trickier one to unpack. First, that magic. Microsoft Flight Simulator arrives on console as very much the full-fledged PC experience, with the same features, the same planes, the same whole planet and the exact same sense of wonder as you spin the map and figure out where to explore next. It looks absolutely splendid, too - just browse the screenshots here if you've any lingering doubts, all of them captured on a Series X where the framerate sticks to 30fps for the most part (don't worry, Digital Foundry will be along with a proper analysis in due course), and where the fidelity is just extraordinary. Playing in 4K and HDR, having come from my own modest PC with its 1080p screen, I'm being wowed all over again.After a few days solid flying - and after dozens of hours with the PC version over the past year - I'm still catching my breath at regular intervals, staring wistfully out at the sun setting over the mouth of the Thames estuary, or that glorious moment when you break through thick, stormy cloud cover into the heavens above in a smooth, controlled airliner ascent. Microsoft Flight Simulator on console is every bit as impressive as its PC counterpart, so consider that part of Asobo's mission in porting this a success. As one of the few true next-gen games available on Microsoft's new machines, this more than does the trick. If you want to check all that for yourself there's no better first port of call than the new Discovery Flights that arrive in tandem with the console version of Microsoft Flight Simulator. They're short, easy-going and utterly breathtaking curated experiences that get you straight to some of the very best of the sim's wonders - a tour of Everest, or Tokyo at dusk, or even a double rainbow spanning New Haven to Stamford as you glide over Manhattan, all accompanied by the soothing ambient music that's become Microsoft Flight Simulator's calling card. This is a chance to play those jaw-dropping trailers, essentially, and get to see all that splendour first-hand. It's a smart new introduction to the world of Microsoft Flight Simulator.Elsewhere the Flight School that acts as a broad tutorial for everything from controlling basic flight surfaces to getting intimate with the intricacies of an airliner cockpit has received some welcome nips and tucks, providing a firm foundation for hundreds of hours of virtual aviation. There's no escaping the fact, though, that putting a sim on console - even a sim as casual and open-armed as Microsoft Flight Simulator - will always be a slightly awkward endeavour, and while efforts have been made to force the fit, the elegance you find in the heavens can sometimes be lacking when it comes to the more earthly concerns of a half-decent interface. Microsoft Flight Simulator remains a PC game first and foremost, something you're constantly reminded of by the cursor that pops up as you fumble your way through the front-end. There is mouse and keyboard support, and support for peripherals, though sadly not many peripherals that currently support this console version (at least none I have to hand in the small pile of plastic I've acquired this past year). I've done all my flying these past few days on a controller - for science, but also for convenience and necessity - and there are regular frustrations when looking to poke deeper than the very basics of flight control, or even just attempting basic menu navigation. It's a very PC experience in other ways, too, asking for some arcane menu diving when working with the content manager, for example, where you'll go to manually download some of the more recent world updates so that you can see Microsoft Flight Simulator at its very best. It's awkward and, for newcomers to the sim I'm sure, off-putting. The basic structure that console players crave is also largely absent in this port, with not much by way of a traditional game beyond the Flight School or Landing Challenges with their global leaderboards. As is the case on PC, of course, although there's always the option of plugging into third-party add-ons - something that will be possible with the full and final release but sadly wasn't an option in the pre-release version we've been playing through these past few days. I'm sadly fairly certain it'll be a fiddly affair when the support does arrive. And Microsoft Flight Simulator on console will likely always remain a fiddly thing. This is a proper, full-fledged sim on a console, and you're often reminded why that's an endeavour that's rarely been attempted in the past - sims by their essence demand a nerdish amount of poking and patience, and the fiddliness of Asobo's own is occasionally only exacerbated by this console version (attempting a fully manual Dreamliner take-off with nothing more than a controller is probably one of the most hardcore challenges you could set yourself in Microsoft Flight Simulator, PC or otherwise). This isn't the version for the hardcore, either, with too much fussiness and not quite the same amount of freedom you'll find on PC. And yet in its new context of the living room, something else comes to life in Microsoft Flight Simulator. For casual sightseers like myself who treat this as the ultimate screensaver, picking a point on the map before loading in and switching on a suite of the generous assists on offer - or even handing over complete control to the more than able AI co-pilot - this might just be the ideal version. I've lost whole evenings this past weekend starting softly out of the window of a 747, watching the clouds float by and chasing the sun past the horizon, getting caught up in the magic and wonder of Asobo and Microsoft Game Studio's staggering creation all over again. There's work to be done - and thanks to this version receiving future updates alongside the PC version, work that's already well underway - and you might want to temper expectations before heading in. Perhaps most importantly, though, this is Microsoft Flight Simulator on console in all its glory and occasional clunkiness, and with that sense of splendour and wonder unsullied by the small imperfections along the way. It remains one of the most breathtaking videogame achievements in recent years, and on console one of the most incredible next-gen experiences to date."}