{"ref": "https://www.eurogamer.net/devil-engine-review-an-assured-satisfying-shmup-for-switch", "date": "28 Feb 2019", "game_name": "Reviews", "text": "Chunk. It's a hard quality to nail down, though it's something imperative to the best action games. It's also something you've either got or you haven't - and Devil Engine, the new horizontal 2D shmup that's just come to the Switch, has it in spades.How to define that, exactly? There's chunk in the explosions, mostly, quick-sprouting cauliflowers that fizz and boom with grace. Shooting things feels just great in Devil Engine, a small but significant thing when playing a game like this, of course. Being shot feels pretty grand too - the best explosion in Devil Engine is saved for when your own ship is downed, which is quite the generous touch considering how often that will happen. There's chunk in the artwork too, boldly realised and brilliantly brought to life; this is a 2D shmup that finds a medium between the more stately compose of older classics such as Gradius and R-Type and the more modern bustle of bullet hell games such as DoDonPachi, so it seems apt that its art-style feels like a powered-up version of those vintage 80s vistas, its starfields and spaceships brought to life with a muscular fidelity. As a devotee of the classics, I wouldn't go as far as to say Devil Engine looks better than them - just that it feels like they share that vision, and have been ushered to life with the help of a little more grunt. It's as if someone just discovered an unreleased Saturn shooter, developed by some of the finest minds at Irem and Konami in the 90s, and just ported it to Switch.  There's serious chunk in the soundtrack, too, composed with the right amount of reverence for the greats by Joseph Bailey with just enough spunk of its own to really resonate. It's helped along by a couple of cameos from composer Tsukumo Hyakutaro, formerly of Techno Soft and much loved for his Thunder Force 5 soundtrack. Most importantly, Devil Engine is a game that understands if you're going to have a level set against a neon pink cityscape, you damn well better have some sexy saxophones to score it, and boy does this deliver. Oh, and there's some serious chunk in how Devil Engine plays. Here's a shmup that knows its onions, and plays an assured game of you and your solitary ship against an entire galactic empire. Your ship Andraste is a nimble little thing, complete with three variable speeds from the off and a selection of three weapons, picked up as power-ups that occasionally litter the field of play. It makes for a solid, relatively simple shmup - and given the complexity of many modern takes on the form, that simplicity is something of a virtue. There's an easy to parse combo system that's all about you piling on the pressure to rack up multipliers, with a burst system - a small, momentary deflector shield - that can help keep the combo going if deployed when you're under extreme fire, or can reset the combo if it's deployed against a single bullet. It gives Devil Engine a neat rhythm, and one that recalls - in its intensity and tone - classic Thunder Force, a feeling backed up, of course, by the soundtrack. This isn't some mindless cover act, though, and Devil Engine ultimately ends up feeling like its own game, with its own wit and spark. There's a veneer of knowing humour layered on top of the action, whether that's in its offering of either a very easy mode and a very hard mode with nothing in-between or the brief flash of 'insert disc 2' that blinks up before you register your high score. And there's a throughline through Devil Engine that ensures it's always gently tugging you back, even after it's just spat you out after flinging a cloak of bullets your way. New modes and features unlock as you bank more score, and there's an abundance of the stuff - challenge modes that place particular restraints on you, or even just filters that give everything a VHS edge or the blunt blur of a demake. And through all that you've got a game that delivers its action with a pleasing amount of conviction and heft. I wouldn't go as far to say Devil Engine is the very best shmup out there at the moment - it's a little scratchy in places, and the Switch version is certainly a patch or two away from me being able to unreservedly recommend it - but I'd say, for sure, that it's the chunkiest thing I've played in a while."}