{"ref": "https://www.eurogamer.net/zeno-clash-review", "date": "22 Apr 2009", "game_name": "Zeno Clash", "text": "Picture this. Gaudi's breathtaking Barcelona Cathedral, the Sagrada Familia. Exquisite carvings cover every surface, depicting creatures beyond comprehension. The baking sun streams through rainbow-hued stained glass, suffusing everything with shimmering colour. But there's no Mass being held. No blessing, priest or sacrament. There's some incense burning, but its perfume is the acridity of hallucinogens rather than salvation.On the floor of the nave, where an altar should stand, is a wrestling ring. The ropes are spun gold, the mat is woven from Dalis, the turnbuckles are jewel-encrusted gargoyles. In the centre stands a six-foot mouse -  four flapping breasts loosely held by a leather harness - and a horrifying bird-man, munching on the eyes of a violently coloured pheasant. In the midst of all this beauty and elegance, the two begin to fight. Screaming, they kick, punch, elbow and knee each other with incredible violence, viciously and unrelentingly. This is Zeno Clash. Now that your hyperbole filters are fully engaged, let's skip back to the basics. Zeno Clash is a PC only, independently produced first person brawler. Released on Steam and Direct 2 Drive yesterday, it's a product of Chilean developer ACE Team. It's beautiful, brutal and, in many ways, brilliant. It's been on my horizon, dressed in a big, colourful 'watch-me' hat, for some time now, alternately dancing like a loon and kicking me in the chest. As anyone who's been following the game will tell you, it looks incredibly distinctive.  Created using the relatively long-in-the-tooth Source engine, Zeno Clash swerves away from the spectre of visual realism, straight into the oncoming traffic of fever-dream imagery: Hieronymous Bosch, Neil Gaiman and the Muppets which live in David Cronenberg's head. Environments are lushly crafted and massively colourful, while enemies range from the queasily quasi-familiar to the outright sexually grotesque. Ghat's hermaphroditic 'parent' FatherMother, a key character, is a ten foot-tall half-chicken with a dirty mac full of babies and shadow.For every image that disturbs, however, there's one which takes your breath away with its beauty. The open vista of the purple desert sky, peppered by planets and the curmudgeonly heads of  four storey high giraffe-beasts, plays host to an excellent boss battle, familiar to those who've played the preview. The town of Halstedom, which you escape from at the start of the game, is a hodge-podge of vibrant architectural styles, Star Wars markets and eerie Gothic towers. As the storyline takes Ghat on a whistle-stop tour of Zenozoik, environments change rapidly and completely. Areas rarely bear any resemblance to the preceding or following location. Vivid, arresting and unconventional, the visual style somehow remains chaotically coherent. It feels like a place. A place where your brother is a sociopathic retard macaw.Gameplay is violent and straightforward. Make the other 'people' fall over and bleed. When they do, kick them violently in the spine so they stay there. Combat is involving and complex. An array of punches, kicks, blocks and combos connect with hugely emotive thwacks, squeals and squelches. It feels violent. It makes me feel pretty violent. I'm easily immersed in games, yet I'm a pacifist on the whole. Often I found my jaw clenched with vicarious aggression, a feeling in my hind-brain which I usually associate with too much cider and the wayward form of Gabriel Agbonlahor. The immediacy is surprising - even given the outlandish nature of the world I found myself drawn in, feeling every blow dealt and taken.The first fight pits you against a few of your siblings: a bipedal parrot, a half-pig and a relatively normal female in a lovely hat. I started out with some fairly middle-of-the-road beatings. Quick one-twos to the chops. A hefty charge punch when the beasts were briefly dazed. Occasionally I'd step in and grab their dizzy heads, pistoning a knee into their faces before tossing them from the bridge-based bazaar into the gulch below. Once, I got subtle and used timed blocks to put them off balance, shifting sideways and countering with haymaking hooks. However you do it, the chances are that when you're finished, your heart will be racing and the surly sneer of victory will be creeping across your lip. Rarely have I experienced a game with so much raw kinetic energy.Each 'round' takes place in a small arena, from city back-alleys to metallic wastelands. Player character Ghat will turn up and be assaulted by various members of the insane menagerie - sometimes singly, usually in groups. Occasionally he'll be assisted by the charming Deadra, a buffalo-hatted chum whose human appearance and willingness to help mark her out as a potential love interest. Fights begin with a flashed up 'announcement' of the roster of combatants but reinforcements will often pile in, invariably on the AI's side, part-way through the scrap."}