{"ref": "https://www.eurogamer.net/devotion-review", "date": "27 Feb 2019", "game_name": "Devotion", "text": "Devotion is about coming home, time and again, and never quite arriving. A perfectly insidious horror game from Detention developer Red Candle, it follows the plight of a troubled young family - mother, father, daughter - over seven years in a single, cramped apartment in 1980s Taiwan. Beyond the prologue, in which your character awakens from a daze on the living room sofa, you'll be able to explore three incarnations of the apartment side by side - three intricate studies of domestic life, feeding off from a hall where photos slowly cover noticeboards like multiplying lichen. Your task for much of the game is to make the connections between these spaces and timeframes, restoring the patchy memories linked to those photos and (so you hope) entering into a ~flawless present~. The problem, of course, is that few of those memories are pleasant, and many of them are out to get you in turn.Playing in the first-person, you tip-toe about with a lighter shivering in your fist, picking up objects and applying them to other objects according to simple clues scribbled in the margins of journals or photos. As in Konami's PT, a short-form masterpiece that continues to bedevil designers years after it was removed from sale, you must reckon with both a nasty abundance of blindspots and the apartment's habit of shape-shifting when out of view. The interior design lacks PT's relentless focus, following its corridor around and around as though rewinding a cassette until the tape disintegrates, but there are moments of unease here to equal anything in a horror game north of 2000. The best horror is about doing a lot with a little - a viscous exhalation on the edge of hearing, a skewing of perspective that chases all warmth from a room - and Devotion's deceptively small layout is a mass of stiletto touches that gradually take you apart. Consider the hall between the living room and the master bedroom. Sometimes it appears unremarkable save for a faulty light that flickers far too rhythmically, taunting with the thought of what might stutter into motion during each metronomic slice of darkness. Sometimes the plaster is crowded with crayon doodles: sausage-string children waving trophies, cats with crimson lamprey jaws. In each case, the scariest prospect is simply rounding the corner beneath that flickering light to see what has become of the bedroom. Elsewhere, the problem is seeing too much at once, not being able to compartmentalise your dread. It's perilously easy, for instance, to glance through from the living room into one of the bedrooms and spot something you're not quite ready to deal with, not just yet. There's no combat in Devotion, and no player death as such, but there are plenty of creatures and objects you'll want to stay away from. A red umbrella ripening in mid-air, as playfully incongruous as one of Pennywise's balloons. A wooden mannequin stooped over a kitchen counter, vegetable knife in hand.What's most impressive about these apparitions is how sparingly they're wielded. Far from aiming merely to shock, Devotion is a sorrowful account of a family broken on the wheels of history in which every jolt or gruesome object sheds more light upon the cast. It is about an uptight man's inability to play provider to a more talented woman who is obliged to play housewife, and a precocious, sickly daughter who becomes the focus of their insecurities - the keyhole through which they both, in different ways, hope to squeeze into that flawless present. You could call these ~universal~ themes, and they are certainly familiar touchstones for horror, but Devotion (whose creators have given us some fascinating dialogue with European developers) is as much about a particular time and place as it is a traversing of common ground. It reserves particular space and hostility for the practice of faith healing versus the nascent science of mental health, but also investigates the grooming of child stars and the emancipatory possibilities of TV celebrity for women who might otherwise be chained to a stove.In the course of investigating these topics, the game treats each character as a warped and soiled lens for the other two. You spend a lot of time in the father's head, from whose perspective the mother becomes a staccato, glitching phantasm, a creature of eyes and right angles, and the daughter a squat and recalcitrant doll.  But you'll also play the daughter, struggling not to overhear an argument that blots the view with shrieking, disembodied mouths. You'll embody her as she is literally bowed by the weight of expectation, crawling towards a stage overlooking an auditorium where a single figure sits in shadow, equal parts Slenderman and Simon Cowell. Lest all this seem too theatrical, next to the timeless delights of a blind corner, Devotion also strews your exploration with backstory texts that provide the necessary undertone of mundanity. There are limp reassurances in letters from in-laws, taped conversations with a calculating spiritual mentor, and balled-up excerpts from a script in which concepts of family are splayed and pinned like butterflies.It's a psychic pressure cooker, a screwing-down of years of bitterness and resentment to the point that the architecture buckles under the stress and bursts into the realm of metaphor. Sometimes the living room is a hospital ward. Sometimes the daughter's bedroom is a meadow. Sometimes the whole apartment is a wind-up puppet show witnessed through glass and water. The tragedy is that for every dozen moments of malice there's a moment of tenderness, a seed that never quite took root. Not all the architectural contortions or changes of perspective are malign: there's a graceful bit of genre-splicing in which father and daughter read a storybook that blossoms into a 2D platform game, altering the plot as they go with a crayon. It's a grace note that echoes the fairytales of What Remains of Edith Finch, but which also, like the fairytales of Edith Finch, speaks to the perils of escaping reality too avidly. There are times when it is healthy to rewrite the story, and times when it's better to work with what you're given.At the time of review, Devotion itself is undergoing something of a rewrite. As you may have read, the game has been found to contain insulting references to China's ~core president~ Xi Jinping, which prompted a deluge of negative Steam reviews and much outcry on Chinese social media. It has since been removed from sale in all territories to check for technical errors and leftover ~offensive~ material. It's sad to think that a horror story as crafty as this one might be remembered only for tripping the insecurities of the Chinese regime. Red Candle's second game is a genre landmark, a carefully spun social critique and a haunted house ride that is as compact and deadly as a switchblade. For better and for worse, there's no place like home."}