{"ref": "https://www.eurogamer.net/virtua-tennis-2009-hands-on", "date": "16 Apr 2009", "game_name": "Virtua Tennis 2009", "text": "~I understand our competitors are using... buttons?~ The SEGA producer demoing Virtua Tennis 2009 to us on Wii (also PS3, of which more later) allows surprise and a hint of scorn into his voice. This, his tone implies, is the brave new world of MotionPlus. Buttons are so last year.With this week's MotionPlus announcement from Nintendo out of the way, SEGA is finally able to own up to supporting the enhanced motion-control add-on with Virtua Tennis 2009. It is also able to step out on to the court and face its ~competitor~, EA Sports Grand Slam Tennis. This is set to be an almighty grudge match: SEGA has a near-impeccable pedigree in tennis games which EA, having largely steered clear of the sport, lacks; but the US giant is bringing its mighty Sports brand, better licensing, and the explicit support of Nintendo to bear. In the end it might just come down to the buttons. The EA game uses A and B to modify your swings into lobs and drop shots. This, reckons SEGA, is weak. ~To do a lob, you just... do a lob,~ says my coach, as he generously allows me to be the first journalist to try the game's MotionPlus controls.It takes a little getting used to, especially immediately after using the regular Wii controls which, like Wii Sports Tennis, use timing accuracy within a fairly generous range to determine the positional accuracy of your shot. Now, timing is just that - timing - meaning the window for nailing each ball is a little narrower. Positional accuracy is determined entirely on your swing.Holding yourself ready for a forehand or backhand swing becomes much more important, since now the on-court player's movement is working around your shots, rather than the other way around. You can add topspin or slice by rotating your wrist through the shot, but before you get that far, you'll just want to get the hang of aiming the shots properly by concentrating on the direction your arm follows through.I found I was naturally sending balls down the right of the court, which became a particular problem when serving to the deuce court; double faults galore. In the end I learned that really quite definite, to the point of exaggerated, swings to left or right would send the ball where I wanted it. As soon as you've made the subtle shift in perspective - as soon as you've understood that the machine is no longer reading sign-language in your gestures, it's actually following your movements from one microsecond to the next - it clicks. And it's extraordinarily natural. As with the unassisted Wii controls, you can play MotionPlus Virtua Tennis 2009 with or without the nunchuk. With it, you'll have full control of your player's movement. Without, there's a degree of automation, but you can still use the d-pad for more general movement commands, such as rushing the net.Lobs and slams or drop shots are easily executed with, again, slightly exaggerated scooping and slamming motions. You need to point at your player to re-calibrate the controller between points, but aside from that, it's entirely transparent. It would be going too far to say that the veil between player and machine has been lifted - with the player's automated movement, you still feel like you're issuing commands rather than playing the shots yourself - but it's definitely a huge step forward. The subtlety and skill in each stroke ushers in a new era for tennis videogames. Sadly, I can't compare it to personal experience of EA Sports Grand Slam Tennis, but going by Martin's impressions, this will be a close contest.Virtua Tennis 2009 handles very well without MotionPlus too, thanks to its willingness to wear its mechanics on its sleeve. In fact, it's the most precise and predictable Wii tennis game I've played. Dissatisfied with their efforts on SEGA Superstars Tennis, SEGA and developer Sumo reverse-engineered Nintendo's shot-accuracy system from Wii Sports Tennis - and then put it on the screen."}