{"ref": "https://www.eurogamer.net/commander-europe-at-war-review", "date": "15 Apr 2009", "game_name": "Military History Commander - Europe at War", "text": "'A serious World War II grand strategy game on the DS' is right up there with 'Peace in the Middle-East', 'Duke Nukem Forever' and 'A badger at the helm of a Premier League football club' in my Things I Didn't Expect To See In My Lifetime list. The PC is awash with them (serious WW2 grand strategy games, not badger managers) but none have made the scary leap to handheld. None until now.Trail-blazing Commander: Europe at War is grand strategy not because its panzers have walnut dashboards or its generals swan around in mink pants (though with Goering, who can tell), but because its units represent entire army divisions, fleets, and airforce groups, and its one seamless map encompasses a whole continent. It's serious because it digs deep into the history, and works hard to deliver plausible scenarios and outcomes.The premise of the game is as simple as the premise of the conflict it seeks to simulate. You either take the role of the goose-stepping fascists and endeavour to enslave Europe, or play as the Allies and struggle to 'free' it (obviously Stalin's version of freedom came with provisos). The first of a string of mild disappointments is the realisation that there's no option to fight the war as an individual nation. Want to be the pudgy-faced cigar-sucking Winston Churchill? Hard Cheddar, you have to be the pudgy-faced cigar-sucking moustache-stroking walking-stick-wielding composite of all three Allied premiers.Play is chunked into month-long turns and unit movement is prescribed by that staple of wargame and beehive, the hex-grid. A few succinct text pop-ups help you through your first few turns, introducing mechanics you'll know by heart inside an hour. By genre standards this is a sleek and straightforward wargame. There's no elaborate turn phases, no fiddly unit stacking or baffling combined attack rules. To assault you simply move a unit into a hex adjacent to an enemy, tap to target, study the battle odds, then tap to confirm. The little time spent away from the map is spent on the research and unit purchasing screens. Cities generate industrial production points which can be frittered away on twelve different force types (assuming you've got enough manpower) or labs in six different fields. R&D isn't as colourful or deep as it is in rivals like Hearts of Iron, but it is a nice foil to all the military manoeuvring.Sadly, what you don't get to indulge in is diplomacy. CEAW inherits from its PC incarnation rigid geopolitical scripts that after a few days' play can start to grate. Countries like the USSR, Italy and America are programmed to enter the war at roughly historical dates. There's a dash of randomness, but you never get to see what would happen if, say, the Molotov-Ribbentrop Pact had held or Franco had thrown his lot in with the Axis. Minor countries such as Turkey and Sweden are there to be invaded, not schmoozed or bullied. The thinking behind this approach has merit: the more chance you give the player to mess with the history the less believable endgames are likely to be. Personally though, I would have appreciated a bit more freedom.Especially with the AI as it is. Whether you're playing as Axis or Allies, you're guaranteed a good tough war. Robot Rommel blitzes into the Low Countries and France like he's got a Channel ferry to catch, and ersatz Eisenhower will storm into Fortress Europe at the drop of a hat if he thinks he's got a chance of gaining a foothold. The problem is the AI never seems to vary its strategies or consider clever circuitous routes to its goals. The southern half of the map - the Med - and the Northern portion - Scandinavia - rarely if ever seem to figure prominently in its plans."}