{"ref": "https://www.eurogamer.net/flock-review", "date": "7 Apr 2009", "game_name": "flock", "text": "In terms of reviewers qualified to take on a game that involves the herding of cartoon farm animals, there are none that come more highly decorated than I. In 1986, my Dad was named Sheep Farmer of the Year. If you can think of a farm animal - any farm animal - then the chances are that he's chased it around a field waving a stick. With these shared rustic genes in mind, allow me to lean over a metaphorical fence and explain just why Flock isn't particularly good - and then add a couple of reasons why you townie types aren't welcome in my gateway either.Flock sees you control a UFO hovering over sixty patchwork quilt rural scenes, with the quaint extra-terrestrial intention of hoovering up a shopping list of sheep, cows, chickens and pigs. It's a game that's very much of a Lemmings mentality and, for that matter, World of Goo to boot. You must spook your furry charges across each level, herding them around pits, through gates and past various obstacles before finally manoeuvring them into the tractor beam of your waiting mothership. Or, as the game insists on calling it, the Mother Flocker. Because, yes, if you've been waiting for a game to finally make that brave tangential leap between the words 'flock' and 'f***' then you're about to have a field day.The deal is that sheep shrink when wet, cows knock physics objects over and will stampede if herded too closely, chickens adopt Zelda-esque flapping behaviours when chased off ledges and pigs are spherical and roll around like marbles - which, the pedant in me wants to underline, is most certainly not canon.The abilities of each different animal play into each other: a cow can release a pen of sheep by blundering into its poorly constructed fencing, for example, and much puzzling ensues. As the game trundles along, your craft gets upgraded with tractor beams and suppression beams that pop your farmyard charges should you get any wise ideas and attempt to meddle with their personal gravity fields, but comes in useful for clearing stampede-strewn field furniture, flattening herd-bamboozling croppage or carrying boulders around the level to drop Black & White-style atop hill and dale to flatten whatever lies below.To begin with, when you're just dealing with the animals dashing away from your spinning lights, all is well and good. Levels never outstay their welcome - a successful runthrough on each only takes a couple of minutes. Yet as the game grinds on affairs become more and more samey. To its credit, Flock does try to keep things fresh - but everything added as the game trudges laboriously onwards just feels like a bolt-on features. Ewes that chains of randy sheep will follow in a slut-hungry conga, lamb-providing love patches where your ovine friends sexually congregate behind a barrage of hearts, crop circles that can be drawn for bonuses, light shining obelisks... They all change the game, but never truly develop it. Only the introduction of predators that hide in nighttime hedges that must be warded off by your UFO truly raise eyebrows above the standard gradient."}