{"ref": "https://www.eurogamer.net/grand-slam-tennis-and-tiger-woods-pga-tour-10-hands-on", "date": "1 Apr 2009", "game_name": "Reviews", "text": "With the footy season racing towards a climactic finale and the first shoots of spring poking out of the frosty soil like a puppy peeking through a letterbox, it won't be long before we're dusting off grandpa's old wooden tennis racket and golf clubs and heading out to thwack a few balls around (badly), then retreating home to nurse chapped hands and tennis elbow. This year, however, we're going to have a couple of home-based alternatives to choose from thanks to EA's Tiger Woods PGA Tour 10 and the publisher's first foray into the world of Henman Hill, Grand Slam Tennis. With both games employing MotionPlus for extra control, we could be in for the most realistic sporting experiences ever witnessed on Wii.First up is Grand Slam Tennis. Featuring all the Grand Slams replete with faithfully recreated courts and a wealth of pros both current (e.g. Federer) and legendary (e.g. Sampras), Grand Slam Tennis attempts to faithfully emulate its real-life counterpart while remaining accessible to everyone. Courts and players have received the now-obligatory Wii cartoon-style makeover, with courts considerably narrower than in real life and players more squat than the finely tuned athletes they're based on. Each pro has been lovingly recreated and possesses many of the mannerisms of his or her real-world counterpart, such as Nadal yanking his pants out of his arse crack and pumping his fist victoriously. [Is this right? - Ed]While the presentation may be looking solid, the true test comes on court, and in this department, Grand Slam Tennis teems with promise. Using the new MotionPlus mode the action is certainly realistic. With the Wiimote representing your racket you must accurately time shots to make the best possible connection with the ball. Swing too early or late and the shot is weak or misplaced, while missing the ball is all too easy if you flap the Wiimote like you're trying to swat a pigeon that's mistaken your head for a giant breadcrumb.The key innovation here is the ability to rotate the Wiimote in order to pull off different shot types. Twist the controller forward and you'll apply topspin, while rotating backwards enables you to slice. Keeping the remote central executes a flat shot. The strength with which you swing and how far you pull the controller sideways also influences the flight of the ball, allowing you to genuinely aim for the court's corners and pull your opponent out of position. With your thumb over the A button and your index finger poised above B, you can further mix up your shot types, with A allowing you to lob and B executing a drop-shot. Your player's movements are either automatically controlled or, if you're feeling brave, there's an option to navigate your player with the nunchuk control stick. And for advanced players, the d-pad can be used to rush the net - a particularly useful trick on grass."}