{"ref": "https://www.eurogamer.net/final-fantasy-crystal-chronicles-echoes-of-time-review", "date": "27 Mar 2009", "game_name": "Final Fantasy Crystal Chronicles: Echoes of Time", "text": "Despite being one of the most recognisable names in gaming, there's a sense in which the Final Fantasy moniker can do as much harm as good to a new game. The words call to mind images of interminable, winding adventures, capricious random battles, protracted cut-scenes, juvenile philosophising and hermaphrodite heroes. As a result, Square-Enix's increasingly regular habit of slapping the brand on products that have little resemblance to their flagship series risks seeing these games dismissed by swathes of gamers. How many readers chose not to click on this review simply because it bears the words ~final~ and ~fantasy~ and so couldn't possibly be relevant to them, for example?In the case of Echoes of Time this is something of a minor tragedy, as the game represents a great many things that Final Fantasy does not. This is a snappy action-RPG in which storytelling plays second fiddle to Zelda-style puzzling and Diablo-esque dungeon exploration. Its USP - that Wii and Nintendo DS owners can adventure together simultaneously - is executed robustly and the finer details of the experience are crammed with creativity and sensible implementation. On that basis one can't help but feel that the Final Fantasy branding might cost Echoes of Time sales it would otherwise have attracted.As the latest member of the Crystal Chronicles suite of Final Fantasy spin-offs, this is closer in style to the mediocre Ring of Fates than the WiiWare release of mixed success, My Life as a King. It's a fully 3D dungeon-exploring adventure with a heavy emphasis on item collection and equipment customisation. These systems are then tied together by a straightforward, childish story that's mercifully light enough not to get in the way. Conversations are never drawn out and the cut-scenes are brief, as indeed are many of the missions, ensuring the game's suitability for portable play. Your quality of experience is going to be somewhat influenced by the platform on which you play (more on that later) but the game within is sound.You begin by choosing a character from one of four races - the sword-wielding Clavats, the spell-casting Yukes, the high-jumping Seklies or the long-range fighting Lilties. Whoever you choose, your hero begins the game on the eve of their sixteenth birthday, setting off into the forest that borders their village for a coming-of-age fetch quest. It's here you learn combat basics, which, to begin with at least, are basic. You've a stock attack move, the range of which is dictated by your weapon type and, in general, simply hammering this in the direction of any antagonistic woodland creature bold enough to attack you is enough to get through the first couple of dungeons.Later you'll need to start combining attacks with the jump and lift commands to execute dive-in and lift attacks, during which you hoist a poor squirrel into the air and slash at its underbelly. These physical attacks are augmented by magical attacks, and, unusually, the seven basic spell types in the game are available from the off. Spells are represented by coloured symbols on the bottom screen: Fire, Blizzard, Thunder, Cure, Rise and Clear. To use one you need only click on the appropriate symbol (with your thumb on the DS or with the pointer on the Wii) and aim the attack on-screen for a few seconds to trigger it. Spells can even be combined, either by multiple players releasing magic on the same spot simultaneously, or by a single player stacking spells together to create powerful hybrids. This mechanic is designed to inspire co-operation during multiplayer adventuring, as combination spells are far more powerful than single casts and in this aim it works reasonably well.Enemies release copious amounts of coins and items when defeated. The majority of drops are the raw materials needed to build new equipment in towns. Indeed, if you want a new spear, helmet or piece of body armour you'll need to buy the instruction scroll on how to build it and gather the raw materials yourself rather than purchasing one off-the-shelf. Both weapons and armour can be augmented with performance-enhancing crystals ala Fable 2, and, as your character's appearance changes dramatically with new equipment, much of the game's appeal comes from finding and perfecting different outfits."}