{"ref": "https://www.eurogamer.net/fear-2-project-origin-review", "date": "18 Mar 2009", "game_name": "F.E.A.R. 2: Project Origin", "text": "A robot suit and quick-time events.If you grabbed me in a bar and asked me what was memorably new in FEAR 2 (I'm not using the bloody full stops), that's all I'd be able to come up with. While it's a rock-solid corridor shooter, the lasting impression is one of a woeful lack of inspiration. There's plenty of stuff to talk about but nothing that demands to be discussed over a drink with friends. The most interesting thing about FEAR 2 is the history of its development - Monolith's split with Vivendi, leaving the former without the name, working on a game with the key cast, propagating another title (~Project Origin~), buying the name back when it seemed Vivendi didn't want to make a sequel after all and... Oh, it's quite the epic, exciting saga. Unlike this.With the two semi-sequels to the first game, made by other developers, removed from continuity, FEAR 2 itself picks up slightly before Monolith left off. You explore an alternate part of the world as another FEAR team, and see the conclusion of the first (a big old explosion) from a distance. In theory, it's a clever method of setting up the devastated city and getting the new gamer up to speed. In practice, it's not totally effective. FEAR 2 is guilty of the arrogance of videogame sequels which do little to reintroduce their plots - the sort of thing that tarnished Halo 3's experience for anyone who didn't read the tie-in novels. Who are these corporate groups? What's a FEAR team? None of this is explained, which makes it difficult to care too much about what's going on - at least initially. It's been four years since that first game. Pretty much all I remember is the spooky little girl and a lot of slow-mo fighting in corridors. Give me a clue, guys.While you start out as a normal chap, the plot finds a way to give you the game's signature slow-down abilities quickly. Things then continue in FEAR's recognisable quick-quick-slow rhythm. Most of the time you're involved in fire-fights against human soldiers (with the occasional monster to deal with). These are interspersed with psychological horror sections where you start experiencing psionic interference, odd visions and visual distortions that make it difficult to locate the exit. It's an easy structure to dissect critically. The hyper-violence and the psychology make odd bedfellows, but in practice both are executed so solidly that the whole thing just about holds together. Especially with regard to the latter, there are moments of flair reminiscent of Monolith's flourishes in games like No One Lives Forever and TRON 2.0. While most of the game is in tunnels (though no longer always grey), doing things like, say, fighting your way around a school and using bits of stage-production for cover is quite witty. The visions, for their length, are well performed too - in fact, you wish Monolith had pursued that side of the game more.But this seems to put even more emphasis on the combat, and at its core it's an oddly old-fashioned approach. For example, the game features health-packs and armour-vests, like grandma used to program. You can carry up to three of the former, which makes it a question of resource expenditure - deciding when to top up your bar at the risk of dying because you waited too long. Elements of the kinetic combat have been removed, oddly. The close-combat flying kicks have been excised, reduced to the standard weapon-bash. You are able to flip furniture and take cover behind it- which your opposition will do too, showing the generally robust AI. Cute, but fundamentally it's not that relevant. (CORRECTION: Since this review was published, it's been pointed out the information in the above paragraph is incorrect. Kieron writes: ~Well, the flying kicks weren't excised - just my ability to notice 'em, either through them not being introduced in the training sequence or me simply missing them. In practice, FEAR 2 seemed to keep the enemy at the range most of the time, with the close-combat being primarily defensive. Returning to discover my error, I realise I *did* actually set off the kick a couple of times, but since it was at the end of the jump, it looked more like a slide along the floor than a dramatic boot-in-face and I presumed it was some kind of slide-to-cover thing.~ We apologise for the error. After discussion we feel the score below still fits the game.)This isn't a game like Gears of War where cover-hopping is paramount, because the slow-motion ability tops anything as passive as hiding (except to recharge your slow-motion ability). Get the angle, go into slow-motion, headshot, take cover, repeat. You often feel like you're being a little mean to the poor old bad guys, but this adds a dramatic flair to almost every takedown. I may be belabouring the point, but it's the core mechanic's solidness which makes FEAR 2 impossible to condemn."}