{"ref": "https://www.eurogamer.net/sonic-and-the-black-knight-review", "date": "17 Mar 2009", "game_name": "Sonic and the Black Knight", "text": "A rarity amongst videogame characters, it's now perfectly possible to love Sonic and wish he was dead at the same time: a testament to recent games, which have made it their mission to kick your cheery childhood memories of the Greenhill Zone into tiny fragments, and stamp out any lingering enthusiasm you may have for SEGA's aging mascot.Well, the blue hedgehog's back again, this time wedged into the role of an Arthurian knight. This would normally sound ridiculous, if it wasn't for the increasingly desperate variety of Sonic's latest escapades. If his penultimate incarnation - as a werewolf - is a fair statement of intent, subsequent games can take the series absolutely anywhere: Darfur, a sinister Victorian insane asylum, or into the dry heat of the Tex-Mex border, casting the blue streak as a would-be economic immigrant bent on sprinting to freedom.At least that would involve running, something the series has struggled with lately. The truth is that, despite healthy sales, when it comes to making decent games, Sonic's recent history is a tale of steady decline: Sonic Heroes saw him looking rather unwell, Sonic the Hedgehog was a desperate attempt at last-minute defibrillation, while Unleashed, sadly, had the grief-crazed morticians losing their minds and painting funny faces on the corpse.Sonic and the Black Knight, however, has a real sense of attempted reanimation to it: whatever its faults, however it irritates, this is not a lazy or cynical game - it's a frantic attempt to get Sonic working properly in three dimensions again. So while it alternates between periods of pretty boredom where it appears to be playing itself, and bursts of rage-inducing frustration when it's disastrously misinterpreting your every input, it's worth remembering that Black Knight isn't terrible, just awkward, and it's not broken, just misjudged.Following on from the rather good Arabian-themed game, Sonic and the Secret Rings, Black Knight is the next instalment in the series' Storybook offshoot, with the hedgehog dropped into the medieval world of King Arthur. This time, the game is built around swordplay, which doesn't sound particularly promising. And not just swordplay, but swordplay with a snooty talking blade, who constantly criticises everything you do.At least Black Knight looks beautiful. At its best, SEGA's game is flinging you through a world that, while linear, is detailed and imaginative, sending you off to ride on the spine of a lightning bolt, blast through glimmering chunks of pink crystal, and coast past new-age landmarks, over whispering green grass. Other than Mario Galaxy, nothing else on the Wii can really match this, and the quality of the visual design extends right down to the menus and first-rate FMV, while elegant watercolour cut-scenes pop up to offload the story.But there are problems. Firstly, those beautiful environments are reused a lot, with the plot wasting no opportunity to send you racing down the same track you just explored, with very minor variations. Often there's a new objective - kill enemies, give rings to villagers (a fiddly QTE distraction), or avoid taking any damage - but you can't escape a lingering sense that the developers are struggling to give you something to do in their pretty, but constricted, playground. Mario 64 could get away with this kind of structure, with clever goals and worlds created as open sandboxes, but Black Knight is no Mario 64, and its levels tend to be extremely narrow corridors which, once beaten, have little else to offer.Handling and combat are both weak, too. Despite a variety of evolving attacks, including a decent lock-on rush and a nice focus on chaining, fighting remains a simple matter of endlessly jiggling the Wii remote. Elsewhere, with the game taking all the corners for you, movement never really rises above the taxing business of pushing forward on the nunchuk. Occasionally you'll have to hop from side to side across the three feet that make up your usable play area, only to find that doing so feels weirdly sluggish, as if Sonic is tethered to an invisible fridge, or battling Scoliosis. Sometimes, you'll even need to turn around, to go back for a treasure chest you missed, or fight an enemy who's accidentally spawned behind you, whereupon you'll discover that you can't: there's no animation for it, so Sonic has to resort to a cludgy Moonwalk with the camera facing the wrong way."}