{"ref": "https://www.eurogamer.net/world-in-conflict-complete-edition-review", "date": "17 Mar 2009", "game_name": "World In Conflict: Complete Edition", "text": "Occasionally I just forget how impressive certain games look. Perhaps it's information overload and I just have to delete the brain-file, but coming back to them I am appalled by what I've been missing. World in Conflict is a case in point. My screenshot-memory pegged it looking okay, but when I went back in last week and started to watch tank battles across the distant sunlit farmlands of North America, I was taken aback. This is a game that that doesn't even seem to be showing off. It's faultlessly, effortlessly beautiful. It was a little like meeting an old flame years later and thinking: ~Oh. Damn.~ Memories revised.Fortunately, perhaps, former romances don't tend to be relaunched by a new publisher, but that's what's happening with World in Conflict. All this Soviet Assault or ~World in Conflict: Complete Edition~ jazz is about the game coming out under Ubisoft rather than under original publisher Sierra. Thanks Ubisoft, because you've picked up and produced something that really deserves a second chance. World in Conflict's rebirth is a fine thing.However, as the game's lead designer Magnus Jensen is keen to point out, this version of the game is more like a director's cut than an expansion pack. This is less of a full-on new campaign and more like The Witcher: Enhanced Edition, where the whole thing has had a going-over, and some new stuff has been dropped in: new multiplayer and single-player maps, with all the old ones tweaked, but no new units.Unlike The Witcher, however, owners of the original World in Conflict are going to have to pay for the six new Soviet Assault maps and the revised single-player campaign. It's GBP 9.99 on Steam, and a similar price for Americans and Europeans, and it's rather hard to recommend that upgrade on its own. It's probably worthwhile if you definitely intended to play through the original campaign again, but if that didn't grab you, then this will be okay to miss out on. As we continue this review bear in mind that this is a verdict for World in Conflict: Complete Edition - the relaunch of game with expansion included - rather simply Soviet Assault itself. The number attached to the end of these words is for the entire bundle - already impressively discounted - not just this add-on, which is definitely optional for people who already own World in Conflict.(And as a quick aside, the entire multiplayer element of the game is going to be overhauled to bring all WIC players up to the same bar as Complete and Soviet Assault owners, for free. If you're a multiplayer WIC person, which I suspect some of you must be, it's worth bearing that in mind before you bother forking out any greenbacks.)Anyway, with all that context and back-story out the way, let's talk game. World in Conflict is the virile son of Ground Control series: free of base-building and all about the tactical action. It pours tanks, helicopters and infantry into lavishly detailed real-world environments and supplements the blitzkrieg with some of the finest artillery and air support options gaming has ever seen. This is a game that could well serve as a kind of Church to the explosion: never have detonations been so exulted. They start out with tiny impacts of light artillery bombardment and scale all the way up to a nuclear bomb, via detours to napalm strikes and the splendid crump-thump of heavy barrages.In fact, all this ordnance is the focus of the game: it's as much of a shooter as any RTS had been (up to and including Dawn of War II) with the various power-ups and abilities of the vehicles - smoke screens, missiles - and the incredible adaptability of the infantry, all coming together to create a rock-paper-scissors that never asks too much apart from that you kill the enemy real good. Bring choppers in to take on the tanks, make sure armour kills anti-aircraft, fortify the capture points, watch your flanks - it's never particularly complex, but it's action-packed."}