{"ref": "https://www.eurogamer.net/grand-theft-auto-chinatown-wars-review", "date": "16 Mar 2009", "game_name": "Reviews", "text": "Coming so soon after Grand Theft Auto IV took an imperious bow in the middle of last year, Rockstar's announcement that GTA would be heading to DS, and within a matter of months, was met with justified excitement but also surprise and scepticism. The PSP had done a fine job with Liberty City Stories - still the best-selling game on Sony's handheld - but Nintendo's innovative hardware would surely be hard-pressed to bring Grand Theft Auto to life in the way its fans have come to expect.Well, if Chinatown Wars does nothing else, it presses the DS harder than virtually anything else you can buy for it. This is GTA on a smaller screen, but by no means a smaller scale. GTAIV's Liberty City may have been cut back to two islands (the best ones), but they're massive, diverse playgrounds, teeming with cars, pedestrians, the series' trademark missions and side-games, wonderfully rendered in surprising detail by an engine that ranks among the best on the platform. And with the addition of touch-screen gimmicks and a significant new drug-dealing component, the loss of things like the comedy voiceovers and talkshows are hardly felt.Although this is the same Liberty City we all ripped apart last year, Rockstar has thrown out the cast in order to tell a new story. You play as Huang Lee, the spoiled son of a murdered gangster arriving back in town to pick up the pieces, quickly and conveniently thrown in at the deep end of a typical tale of turf wars, bent cops and the dark comedy of Rockstar's cock-eyed criminal underworld.The set-up's familiar, then, but the delivery's understandably closer to the top-down GTAs of old. You target enemies with the right shoulder and fire with the A button, and whenever you get behind the wheel the camera zooms back to show you more of the road ahead (you can also adjust this, which is a nice touch). Unable to use 3D in-engine cut-scenes, the developers have gone for comic stills with text dialogue.Despite cutbacks, however, much of what made GTAIV comprehensively playable is retained. Your new PDA, which occupies the touch-screen, includes the mini-map, which clicks through to a GPS that allows you to lay down waypoints, and plot courses to missions, drug dealers, safehouses and points of interest you've saved as favourites. You can also toggle various top-screen features that save you having to glance down all the time: GPS chevrons that point the way down the road, icons at the edges to help point out key locations, and of course your health and armour meters.But it's the touch-screen that completes Chinatown Wars. You can use it to plot a throwing arc for Molotov cocktails and grenades, and when you get into a parked car you're given a few seconds to hotwire it. Older cars can be fired up with a screwdriver or a couple of twisted wires, while smarter rides have you sweating on rotating numbers to crack the immobiliser. It's the missions that benefit the most. An assassination involves assembling a rifle and then using the d-pad to target through the scope, bombs need to be defused in trucks, rookie bangers need to be tattooed, and there are numerous other smart little ideas, all of which are brief and pleasantly unexpected.Mission design is more imaginative than before. There are still plenty of fetch-and-carry missions, and quite a few drive-here-to-shoot-these-guys affairs, but they usually play out in interesting ways. Blowing up a rival's gambling den with a tanker involves keeping up speed because a petrol leak at the rear has ignited and threatens to catch up to you, while rescuing a downed contact requires you to stay in cover and toss grenades to avoid a probing mini-gun. When a seemingly typical race mission first arrives, it turns out that you're not taking part; you're helping your contact cheat his way to victory by sabotaging the other cars and, later, interfering with the race itself by knocking people off course.Driving takes a little while to adapt to thanks to an auto-correct that puts you on a straight course, but in time this more than earns its place in GTA's catalogue of clever features, allowing you to bypass columns of traffic without loss of speed, and swing fast into sharp turns without smashing yourself to pieces. GTA's love of screeching handbrake powerslides is diminished considerably, but the alternative is pacey and intuitive enough to compensate, and individual cars are caricatured with a likeable severity that means a plodding delivery truck is no less engaging than a sports car or one of the game's suicidally exhilarating motorbikes."}