{"ref": "https://www.eurogamer.net/socom-confrontation-review", "date": "16 Mar 2009", "game_name": "SOCOM: Confrontation", "text": "Usually when the European release of a game is delayed, it causes gnashing of teeth and curses spat at whichever fiendish publisher has so callously disregarded our proud continent. In the case of SOCOM's PS3 debut, we should probably be grateful. When it launched in the US last October, the internet was set aflame by furious players who found themselves stuck with something that was pretty much broken. Game-breaking freezes, constant network disconnections, and a multitude of other annoyances all conspired to leave faithful fans brimming with vocal and very legitimate grievances.There are no such technical problems for SOCOM's arrival on European shores; the fatal bugs having been ironed out in the withering heat of American fandom's baleful glare over the last five months or so. This doesn't mean that the game is cause for celebration however. SOCOM Confrontation is hopelessly out of time, an entry in a series that last made an appearance in the dying days of the previous console generation, and which arrived last Friday with most of its unique selling points long since co-opted by dozens of alternatives. Many things have changed since SOCOM 3 in 2005. Unfortunately, SOCOM isn't one of them.Curiously, the game has gone multiplayer-only and it's from this decision that most of the problems stem. Back in the day, the SOCOM brand pioneered online console gaming, bringing a taste of what the PC boys had been sampling to the PlayStation crowd. When a title with that sort of heritage announces that it's ditching the single-player aspect to concentrate on multiplayer, you'd be forgiven for expecting something ambitious, something that really takes advantage of today's always-connected HD consoles to kick the console online experience up to the next level.What we actually get is a game that feels depressingly like the multiplayer component of any third-person shooter, with it's solo half crudely lopped off and nothing to replace it. In fact, it's hard to find a single aspect of Confrontation that PS3 owners can't already enjoy in other, often better alternatives.Matches take place between a variety of elite military units and the crude but effective mercenary forces ranged against them. You have one of each character type to play with, and the customisation options are broad and generous. Not only can you edit your weapons and equipment, from a wide selection that is thankfully available to all from the start, but you can also customise your character's appearance and uniform from a selection of presets. It's not the most flexible tool - certainly nothing to compare to the sort of face-making features found in EA Sports titles - but in a genre where such personalisation is rarely offered, it's deserving of praise.The effect your choice of beard has on gameplay is minimal, but you do need to pay attention to your combinations of weapons and armour. Strap your guy into the strongest body armour, give him a kickass M60, and he'll be one hell of an opponent. He'll also move like a snail. Strip back the armour, swap to a submachine gun, and you're able to nip about much more nimbly, but will die much quicker under fire.In fact, there's a good chance you'll die quickly anyway. SOCOM's hardcore user-base ensures that headshots are standard practice, and since three of the game's seven maps are drawn from previous games (Crossroads, Frostfire and Desert Glory, since you ask) the odds are already stacked against the newbies.Not that the software itself seems terribly bothered about attracting new players. Confrontation is often a fussily obtuse game, with a stark 1990s PC-style lobby system, key features hidden behind unintuitive menu options and a penchant for tangling your fingers in a needlessly complex default control layout. The on-screen info offers precious little guidance as to what game modes actually entail or where mission objectives can be found, meaning that matches with veterans are a closed shop of ruthless efficiency while new players run around asking for directions over the headset. There's hardcore and there's just plain impenetrable, and Confrontation too often opts for the latter."}