{"ref": "https://www.eurogamer.net/peggle-review", "date": "11 Mar 2009", "game_name": "Peggle", "text": "The most unusual thing about this Live Arcade iteration of PopCap's acclaimed and beloved Pachinko-style puzzler is how long it's taken to cross over onto consoles. Casual games tend to be viral in their spread, and once one has captured the public imagination, there's little you can do to stop it being ported to anything with buttons and a screen.Of course, even though it's accessible to players of all ages and abilities, Peggle is no more a casual game than heroin is a casual drug. Once it gets its cheery whimsical hooks into you, there's not much point resisting. Better to sit back and succumb to the obsession. Peggle, it must be pointed out, also has the advantage of not leaving you unconscious and covered in sick in a Glasgow pub toilet.For those who have yet to experience Peggle, you fire a ball into a screen full of pegs. Whichever pegs you hit are removed at the end of the turn. The orange ones are your primary concern, since getting rid of those is how you progress to the next level. Blue pegs will notch up small scores, but will also obscure the path to those essential oranges. There's also a pink peg, randomised each turn, which boosts your score.At the bottom of the screen is a bucket, forever gliding from side to side. If your shot lands in the bucket, the ball goes back into your stash and can be used again. If it falls off the bottom of the screen, it's gone. Extra balls can be earned through a variety of means, most commonly racking up a score of over 25,000 in one shot, but the disparity between the number of orange pegs you need to hit (at least 25) and the available balls with which to get the job done (10) is what keeps you on your toes.Each board also has two green pegs, and it's here that things start to get really interesting. Hitting these will activate the special power of whichever character you're playing as. There are ten such characters, all the same on 360 as on the PC. Hitting a green peg as Bjorn Unicorn, for example, allows you to predict the trajectory of your shots for a few turns. Tula the sunflower removes one fifth of the remaining orange pegs, starting with the ones closest to the green peg you struck. Lord Cinderbottom the dragon lets you shoot a fireball through the board, clearing swathes of pegs in one go, while Master Hu the owl gives you a zen-ball which automatically adjusts your next shot for maximum results.Each character must first be unlocked by beating their section in the Adventure mode, which features 55 levels in sequence. Once unlocked, you can choose which character to use in any level, and any game mode. There are tactical advantages to each, but the game is broad enough in its design that no single power is more useful than the others. For those with boisterous competitive streaks, there's an inherent high-score appeal - just check YouTube  for some outrageously high-scoring shots - but the beauty of it is that anyone can muddle along, rack up impressive numbers and have a bloody good time without being sucked into a twitchy hardcore mindset.The tipping point for many people is Peggle's random factor. Unless you're Rain Man, there's a limit to how far ahead you can plot your moves, and sooner or later you'll resort to just firing a ball into a load of pins and hoping for the best. Some can't get past this element of luck, but the magic of Peggle is how it makes each gamble feel fresh and exciting. The escalating plink-plink-plink as you clock up pegs is shamelessly uplifting, and for every shot that goes just wide of the mark there's one that somehow bounces its way to some seemingly impossible orange pegs before landing safely in the bucket.It's so simple, yet so damnably addictive. There's immediate and primal sensory pleasure in the way the ball bounces around the pegs, and the game knows well enough that victory is something to be celebrated. Each level is cleared in a flurry of rainbows and fireworks, while Beethoven's Ode to Joy soars from your speakers. It's joyous, unashamedly whimsical and all the better for its utter lack of cynicism. Anyone with a soul should own at least one copy, so why not this one?Well, if you don't already have Peggle in its PC incarnation then you might as well get the Live Arcade version, because they're pretty much identical. It's a bit stupid that the offline, turn-based, two-player duel mode won't let you play with just one joypad, but you're still getting all the Adventure levels, all the 70-plus Challenge levels, and all the loveliness that the keyboard-and-mouse contingent have been enjoying for two years.What sets Peggle's Live Arcade outing apart from its PC sibling is Peg Party Mode, which pits you against up to three other players in a simultaneous Peggle-off. The host can set the number of rounds, and impose a time limit on taking each shot, but the aim is simply to score more than the other players before the balls run out. Trouble is, you're each playing on your own boards, and only really get a sense of competition by prodding the Y button to see how your opponents are faring. It's a curiously remote approach to what could have been a defining development in the game's evolution, and it's certainly not enough to justify a download if you already own it on PC.While it's a shame that the Xbox 360 experience doesn't do more to move the established template forwards on the multiplayer front, it would also be fairly nit-picky to allow such concerns to detract from the fact that Peggle was, and still is, a wonderful, maddeningly moreish gem of fuss-free game design. Every home should have one."}