{"ref": "https://www.eurogamer.net/eat-lead-the-return-of-matt-hazard-review", "date": "11 Mar 2009", "game_name": "Eat Lead: The Return of Matt Hazard", "text": "Hey! Aren't videogames silly? Eat Lead says so. It's an attempted parody of everything from Final Fantasy and Super Mario to SOCOM and Wolfenstein, repeating EA's trick of using The Simpsons Game to poke fun at the opposition.Unfortunately for developer Vicious Cycle, it lacks the recognisable characters, catchphrases and writers pool that helped propel the former to passable mediocrity in 2007. It's not even all that obvious what it's poking fun at half the time. There's an Austrian man who says silly things and sounds a bit like Arnold Schwarzenegger, for instance. Was that really the best idea on the whiteboard at the end of the brainstorm? What's it got to do with anything?The joke is that the titular Matt Hazard is a washed-up videogame character whose career has gone south, back for one last cock of the shotgun, only to discover that the game he's in has been designed to kill him off after the first level. Matt's new corporate overlords would prefer to replace him with the aforementioned Austrian interloper who, frankly, is at least likeably naive and silly. Matt's just a cynical, badly written Crimewatch e-fit who greets everything with a mixture of brash condescension and witless taunts.At its heart, the game he's in is a third person, cover-based shooter in the same vein as Gears of War, but with controls and mechanics disfigured by inexperience or incompetence. Movement is slow and cumbersome, popping out of cover seems to readjust the aiming reticule to minute but devastating degrees, and when you pop back in you've sometimes been arbitrarily repositioned. You're also worryingly vulnerable to bullets fired from the front even when you should be protected, which is the worst thing a cover-based shooter can get wrong, with the possible exception of not including cover (in case you get to the end of the page and wonder where the remaining points on the score came from).There's one bolt-on to the otherwise standard over-the-shoulder run-and-gun, and that's the ability to move directly to another cover point adjacent or ahead, but this isn't all that different to Gears of War anyway. It's slightly more automation, but in reality you seldom want to take advantage of it because the people shooting at you are accurate, numerous and capable of teleporting into existence in flanking positions. A more typical approach is to edge forward until you trigger the next influx and then back off and make the best of it. And then get killed and retreat even more, since regular headshots are the only way to survive.Enemies spawning all over the place is one of many things in Eat Lead that may well be intended as a joke, but functions as a massive pain the arse. Other things are more clearly just regular pains in the arse: enemies, for example, are more, or less susceptible to specific weapons depending on their place in the Matt Hazard canon, so water pistols struggle to convince Nazi stormtroopers to fall over. Since all the weapons are feeble and boring, however, this is needless, unintuitive complexity. It's easier to understand the system of saving up for fire and ice d-pad weapon power-ups, which allow you to freeze or enflame enemies for a limited period, but the advantage conferred isn't so much empowering as less enfeebling.Level design is worse. Almost relentlessly dull and repetitive, it's been contrived to act as a good foil for cover, but in light of Gears of War 2's immaculate sense of pace, and the imagination with which it engineered new tactical situations, walking through a room with some crates in it and then going along a walkway with some metal patches on it over and over again isn't exactly on the same plane. There are factories, warehouses, casinos and weapon silos, but there's no evolution in gameplay. When your babbling headset helper-woman reduces the complex objectives list to ~kill anything that moves~, it's a joke, but it's also true, and doing it isn't any fun.Or visually appealing. In fact, Eat Lead is a dog only barely fit to bark at last month's abysmal Shellshock 2, with horribly low-rent textures and models set amongst ghastly, poorly lit environments. Enemies are diverse in theory, ranging from 2D soldier sprites to multicoloured SOCOM troopers, scientists, builders in hard hats and cowboys, but they're all Playmobil-basic and move about unrealistically, and boast all the tactical ingenuity of a drunken metronome. The overall aesthetic would embarrass the majority of PlayStation 2 shooters, in spite of which our PS3 review copy slows to a terrible crawl on any number of occasions, apparently unable to render a sea of crude, angular objects unless they are viewed from specific angles.Videogames should be allowed to take the piss out of one another, especially with gentle affection (the princess always is in another castle, after all). But Eat Lead is far from a compelling parody, taking weak, ambiguous pot shots at other games. Even though these attacks are often hard to trace to their intended target, it's fair to say that Eat Lead isn't worthy to mock them, because whatever else it's trying to be this is a howling misfire of a cover shooter, neither funny or enjoyable, and guilty of worse crimes than the ones it's attempting to mock."}