{"ref": "https://www.eurogamer.net/watchmen-the-end-is-nigh-review", "date": "9 Mar 2009", "game_name": "Watchmen: The End is Nigh", "text": "It misses the point, of course. That much was evident from the moment it was announced that the movie adaptation of Alan Moore and Dave Gibbons' masterful rumination on superheroes would be supported by a beat-'em-up from Deadline Games, the makers of tongue-in-cheek romps Total Overdose and Chili Con Carnage.The disconnect between source material and videogame may not be quite as extreme as that conjured up by the execrable Fight Club or the ill-fated Taxi Driver game, but there's still plenty of reason to wonder just who thought this was a good idea. Clearly aimed at movie fans who think that the psychologically broken sociopath Rorschach is totally fuggin' awesome, dude, the game delves into Watchmen's rich depths but emerges clutching only a mindless brawling template, peppered with ludicrous gore and swearing.The dialogue deserves particular scorn, as Rorschach and erstwhile partner Nite Owl trade mealy-mouthed arguments about society and vigilantism. ~What causes beings such as these to deviate so far from society's status quo? Broken home probably,~ growls Rorschach. ~What is missing from these boys' lives that gang affiliation becomes their most prized possession?~ mewls Nite Owl, like an appalled social worker. It's horrible, horrible writing, especially considering it comes from Len Wein, a long-established comic writer with far better work to his name.These fumbles are especially disappointing, given that there are glimmers that suggest a more faithful Watchmen game could have been possible. The defiantly non-superheroey yellow and purple palette of the comic page is captured well, the enemies are often drawn directly from the comic - including the hapless topknot gang members - and there's even a throwaway reference to Charlton Comics, whose characters Alan Moore reworked as the basis for his cast of flawed vigilantes.For all the stabs at authenticity, however, at its heart this is a short and stupid game struggling under the weight of its inflated price-tag. You choose from either Rorschach or Nite Owl, and pummel your way through six stages of relentless combat. It's a 3D version of the Double Dragon template, but not only did those retro beat-'em-ups have more style and grace than this lumbering effort, the movie marketing department already used the same frame of reference for an online game  that actually fits into the Watchmen's alternate history far more neatly.You can play solo, or offline co-op with a friend, but whichever you choose the game remains broadly the same. Rorschach can pick locks to find power-ups in one of the most annoying mini-games ever, and can also use weapons taken from defeated enemies, while Nite Owl relies on his electrically-charged suit and night vision. There are sporadic moments where the two separate and take slightly different routes, but this generally involves traipsing through a couple of empty areas before reuniting, so it's not clear what the point is, other than to give the illusion that you're playing a game optimised for co-op play.It's certainly not enough to compensate for the game's crippling lack of ambition. While each level brings different foes to the table, from rioting prisoners to bikers, cops and mercenaries, they all fight in the exact same way, and use the same attack animations and voice samples."}