{"ref": "https://www.eurogamer.net/the-great-ace-attorney-chronicles-review-more-history-lesson-than-comedy", "date": "26 Jul 2021", "game_name": "The Great Ace Attorney Chronicles", "text": "Offering a more serious approach to Ace Attorney's courtroom battles, The Great Ace Attorney Chronicles still offers a host of colourful characters and unlikely methodologies, but comes across as a very different game overall, for both good and bad. Thanks to Ace Attorney's brilliant localisation, The Great Ace Attorney's setup feels like a joke you have to explain to people: your protagonist Ryunosuke Naruhodo is supposed to be an ancestor of Phoenix Wright, who's originally named Ryuichi Naruhodo. The rename exemplifies a problem that up until very recently wasn't uncommon for Japanese media; the belief that a Japanese work's cultural connotations could confuse or overwhelm western audiences unless adopted as something else. It's a reason that's been used for not localising certain Shin Megami Tensei or Yakuza games, too.The localisation made Ace Attorney in the west its own cultural product, amping up the silliness with punny names and references to western culture, but The Great Ace Attorney is a decidedly Japanese duology (some characters have still been renamed for that extra bit of punny goodness). It's set in the Japanese Meiji period, or the British Victorian era, a time of pivotal importance to both countries, and I see both games as comment on that time in history, rather than a collection of increasingly dramatic court cases. Circumstances of the first case thrust the hapless Ryunosuke into the limelight, suddenly required to defend himself in court. You learn all the mechanics of previous Ace Attorney games - you listen to witness testimonies, followed by a cross-examination. During the cross-examination, you can ask witnesses to elaborate on a statement by pressing them on it, potentially gleaning new information in the process. Your court record holds all your current evidence, and once you spot a statement that's inconsistent with the evidence, you present it with the famous shout of ~Objection!~ At the beginning, Ryunosuke objects very little - he begins his career as a lawyer by shouting ~yes!~ and awkwardly raising his hand, growing more confident over time. Following a tragic event, he ends up completing a highspeed education as a lawyer while on a steam boat to England, where he meets the great consulting detective Herlock Sholmes. In England, things work a little differently - courts use a jury system, which means Ryunosuke has to convince the jury as well as the judge. Gameplay-wise, this idea doesn't add much. There will be a point in every trial where the jury unanimously decides the defendant is guilty, triggering a Summation Examination.  In it, every jury member has to give a reason for the decision, and you're asked to pit opposing statements against each other so the jury is no longer in agreement and the trial can continue. It's a nice idea on paper, but it always plays out the same, and basically only serves to make each very long case only longer. The same goes for the cross-examination of multiple witnesses on the stand, an idea taken over from Professor Layton vs. Phoenix Wright. As you press one witness, the other may startle or loudly go ~aha!~ giving an inconsistency away in the most obvious manner possible, a pretty hamfisted way to gather new information.I'm a bit in love with the third new element however, Herlock Sholmes' Dance of Deduction. You see, apart from historical pastiche, The Great Ace Attorney games are also unabashed Sherlock Holmes fanfic. Several characters from Arthur Conan Doyle's stories make an appearance, and there are plenty of small nods to the original otherwise. The greatest of them has to be this version of Sherlock Holmes, who is renamed in the localised version along with a few other characters because the Doyle Estate still holds the rights to a few remaining Sherlock Holmes stories.Herlock is a fop who appears out of thin air to declare he's cracked the case wide open, but unlike the real Sherlock Holmes, he often gets things amazingly wrong. This is where you come in - after Herlock has performed his deduction, you have to correct him. The correction itself is rather simple stuff, as you look around a small part of the scene and decide between a very limited number of alternatives to a previous piece of evidence Herlock used in his deduction. But the presentation! It is sort of a dance, brilliantly animated, adding some great camera work to an previously rather static series and imbuing the scene with a genuine sense of euphoria at cracking the case, rather than the desperation of the courtroom.I think it's fundamentally important that while in many aspects The Great Ace Attorney games play like Ace Attorney, their narrative goal is different, which may be disappointing for long-time series fans, while also offering an alternative for those who think of Ace Attorney as too goofy. The original Ace Attorney wasn't so much about being at court as it was about showing comically overwrought villains what's what - as soon as you clapped eyes on certain characters, you knew they'd done it. Ace Attorney was about ~how~, not ~if~, and the how had to be spectacular to the point that actually playing the game could be frustrating - solutions that are hard to guess are fun for a passive audience, but not so much for active players. The Great Ace Attorney is a lot more helpful, and a lot more focused on court procedure and the finer points of justice. Judicial Assistant Susato Mikotoba is at your side at all times, and whether it's during investigation or in the courtroom, she offers advice about where to look for clues. Then again, I hardly ever got stuck in, because my options were naturally curtailed. Crimes are much less ridiculous, and even when they are a little overstated, you progress very naturally in your reasoning, which I think is great writing. If you eliminate the impossible, whatever remains must be the truth, as (S)Holmes would say.This is not a game about courtroom bombings at the eleventh hour, it's a game about the relationship between Japan and Great Britain, easier to enjoy with a bit of background knowledge, so... here's some background knowledge: GAA is set during the Meiji period, a few years after Commodore Perry negotiated the opening of Japan, which opened the way for diplomatic relations between Japan and several western countries. The constitution of the Empire of Japan, which is no longer in force, was modelled in part after the British monarchy. Basically, the Japanese thought Great Britain was dope, and even tried to adopt its model of colonisation, whereas Britain was one of the countries who saw Japan largely as inferior due to their insistence of upholding some of their own traditions and their apathy towards Christianity. The game depicts a lot of the casual, smarmy racism of the time, and the central conflict, which you don't hear much about until the very last few cases, depicts a group of Japanese people torn between wanting to fit into this new idea of Japaneseness and violently rejecting it for the sake of their own cultural identity. It's a different balancing act, one that could lead to misreading the game as imperialist, but it's surprisingly pertinent even today, in a Japan beset by the idea that certain things are just too Japanese for Westerners to understand and that Japan lost its honour by dealing with the West and losing to Western powers during the Second World War.It's all very interesting, though it's a lot to unevenly spread across two games, especially two games that depict that conflict mostly through a bunch of not particularly likeable characters. Several cases feature renowned author Natsume Soseki, whose addition is interesting when you look at the game from a historical perspective, but who just isn't an Ace Attorney character I care for. Whereas Ace Attorney had you defend friends and told you a little about each of its cast members with every case, here a lot of it feels unrelated. You don't learn a lot about Ryunosuke, because he only has Herlock and Susato play off of, and he does feel rather passive - the game's great twist doesn't even involve him. Ace Attorney is beloved for its characters, and I just wished its spinoff had stronger ones.The Great Ace Attorney chronicles is a lovely bundle which, like many a spinoff, suffers from not being quite as great as the original you immediately compare it to. Regardless, there is so much to love here: it tries some new things setting- and gameplay-wise, it makes enjoyable references and I just consistently enjoy Shu Takumi's writing no matter what he puts out. The historical setting could prove to be a bit of niche interest to many, but rather than contort myself and tell you that this is just like the Ace Attorney you know and love, or call it a prequel, or a great way to start with the series, which it isn't, I'd rather give it to you straight and say - do you love a good period drama? Have at it."}