{"ref": "https://www.eurogamer.net/resident-evil-5-review", "date": "9 Mar 2009", "game_name": "Resident Evil 5", "text": "There's something grudgingly admirable about Capcom's determination to make Resident Evil games feel like no other. And yet - even as a long-term fan - when you first pick up Resident Evil 5 it's almost impossible not to find yourself bitching about the way you can't move and fire. Or the glacial turning speed. Or the unwieldy inventory system. Just like you did with Resident Evil 4, in fact - and Resident Evil Zero before it, and all the others. It comes with the territory. These fundamental design decisions are illogical in a modern context, and part of me wishes Capcom would wake up to the present.But the tradition of survival horror games has its place too. Make it tense. Place just enough ammo and health. Make it a struggle to get by. To enjoy them, you have to be prepared to put to one side the default annoyances. Once you adapt to the way this game plays compared to all the other third-person action-adventures out there, it all rather clicks into place. Perhaps the question to consider from the outset is whether you really want Resident Evil to feel like every other action game or not? Because if the answer's no, then you're halfway to getting the most out of it.In many respects, Resident Evil 5 is content to follow the path of its much-loved predecessor and tweak a few things along the way. It's still very much a series of abrasive set-pieces strung together by camp hilarity. The main addition is the presence of a fully-controllable camera for the first time. Assigned to the right stick, you finally have the option to sweep the viewpoint around as you wish, and as a result the game is more fluid. Although four control configurations are available, the default works just fine, with a squeeze of the left trigger zooming the camera to the trademark over-the-shoulder view (which so many games aped in the wake of Resi 4, remember). The laser pointer remains, and a customisable level of sensitivity allows you to tweak to your own satisfaction.Possibly the most jarring initial impression is how little has changed in the core game mechanics. While the prospect of split-screen or co-op online play tantalises, there's an inescapable feeling of deja vu and frustration as you play with an AI partner. To all intents and purposes, this looks and feels like a reskinned, high-def Resi 4, and what was hugely impressive back then often struggles to repeat the trick this far down the line.As you'll probably know from the numerous previews, the game kicks off with returning former STARS hero Chris Redfield (from the original 1996 Resident Evil) meeting up with local BSAA operative Sheva Alomar in a dusty African shantytown. Tipped off about a bioterrorist named Irving, it quickly becomes apparent that the hostile natives' attitude problem has more to do with viral shenanigans than a distaste for foreigners. As they are called to arms by a megaphone-wielding leader, Chris and Sheva find themselves running the gauntlet from a feral mob, forced to scale buildings, hop between rooftops and shoot fuel barrels in a desperate fight for survival, occasionally splitting up using co-op moves like the assist jump and then covering one another.The setting might have changed a little, but everything else is inescapably reminiscent of the village sequence of the previous game, right down to the chainsaw-wielding giant, and the need to scale buildings to get some distance from the onslaught. Even the lurching enemies with their side-stepping attack evasion are the same. The weapons they wield are largely identical, as is their physics-defying animation, where foes reel back in familiar exaggerated fashion. From sound effects to graphical style to core gameplay and AI, there has been little or no change apart from an admittedly arresting visual upgrade. It's a different setting, with different character models, but the game you're playing has, for the most part, essentially the exact same template repeated in a different setting.And if that doesn't strike you as mildly disappointing, then the almost complete absence of puzzles and exploration may come as a hammer blow. Where puzzles do exist, they're so crushingly basic as to be insulting, rarely amounting to more than simple, pointless object hunts that take place right next to their intended target. Far from the promised return to the adventurous exploration of old, you simply work your way through six extremely linear chapters where straying off the obvious beaten track is not an option. In addition, the presence of a new mini-map allows you to see exactly where you should be heading if there's any lingering doubt. The dumbing-down of almost every aspect of the gameplay is depressing, if not unexpected. There are even turret gun sections.With so much of the gameplay distilled to a sequence of set-pieces, a significant part of what made Resident Evil appealing has been removed, and what remains is the shooting portion. Pushed front and centre, it morphs what was a survival horror adventure into a survival horror shooter, and many will find Capcom's transparent desire to appeal to the action gaming audience a little troubling. Whereas Resi 4 skillfully straddled a happy middle ground between old and new, Resi 5 embraces the action element without concession. Whether it goes too far, of course, will be a matter of serious discourse."}