{"ref": "https://www.eurogamer.net/need-for-speed-shift-hands-on", "date": "4 Mar 2009", "game_name": "Need for Speed: Shift", "text": "Following a mid-life crisis presumably brought about when the last few games in the series sold a mere billion copies each rather than the forecasted gajillion, Need for Speed is changing. In fact, it's developed full-blown schizophrenia, with its '09 offerings split into three distinct strands covering the core, casual and free-to-play audiences in turn. According to EA's VP of marketing, Keith Munro, offering three games rather than one represents ~the inverse of milking~, an unfortunate turn of phrase which conjures farmyard imagery of such a bizarrely disgusting nature, that we can probably leave it at that.While such big budget soul-searching is mildly interesting, the more important question is how the games themselves will hold up. Luckily, if any franchise could handle such a fundamental change of gear, it's probably this one. Despite persistent themes like urban racing, car-collecting, and unintentionally creepy CGI/live action interludes, Need for Speed has always seemed defined by its reliance on one-shot gimmickry rather than the prolonged exploration of core ideas that has given Burnout's frantic evolution a sense of rock-steady inevitability. The series may flit between temporary pre-occupations with cop chases or finding the perfect shade of neon orange alloys, but, deep down, all Need for Speed's really about is selling a lot of games at Christmas.Shift, at least, is looking like it can keep that theme on track, with a recent chance to play a pre-alpha build suggesting the core offering is shaping up to be a serious racing title, already sufficiently tuned to be putting on the second coat of polish. Slightly Mad, the title's UK-based developer, has a decent lineage in car games, its staff having started as modders before working on the GTR series and GT Legends with SimBin - although the extent of the team's involvement is a matter SimBin itself has suggested it may be willing to sue over. However the legal side of things turns out, Shift's brand new engine has been in development for two years, with a cross-platform emphasis from the start. Given such a solid chunk of hard work is behind it, it's hardly surprising that the game is already looking lovely.As promised, most of the series' more familiar elements are AWOL: there's no police, no open-world environments, and no distracting character nonsense. The focus here is not on stocking up your garage so much as building your own career as a driver, with the game playing out as a very straight racing sim set against a variety of iconic tracks (some real, some imagined) from around the world.Taking to the corners of Brands Hatch in a Zonda sees the developers striving to create a race-day atmosphere at the roadside, with crowds milling in the stands, bunting rippling in the breeze, and the sun bouncing off the metal walls of nearby buildings. The cars are pretty too, with large, shiny models, and bold primary colour liveries. The audio is throaty and fierce, and the much-teased in-cockpit view is equally excellent, with real-time reflections, elaborate gear-stick animations and a detailed expanse of dashboard visible. Outside cameras are still available, of course, including a stomach-churning bumper view, but it's in-cockpit that the game's focus lies, and where Slightly Mad's attempts to create a convincing sense of g-force are most vividly displayed."}