{"ref": "https://www.eurogamer.net/afro-samurai-review", "date": "3 Mar 2009", "game_name": "Afro Samurai", "text": "~With no multiplayer modes at all, no elaborate systems and nothing cluttering up the screen, Afro Samurai is a minimal game, as sparse and hypnotically repetitive as RZA's beats,~ we wrote when we previewed it back in December. ~It puts what it does best front and centre: easy, moreish slaughter, spectacular graphics, and a strongly individual licence supported by some top-drawer voice-work.~Afro Samurai has the gratifying shallowness of many licensed games - but unlike those others, it also boasts a perfect marriage of form and function,~ we ventured.Be careful what you wish for.Re-playing the first half-hour of this spin-off from the Samuel Jackson-voiced genre-clash anime series, the same happy thoughts occurred to us. First, it's a stunningly good-looking game, put together with a care and sense of style quite foreign to your average production-line brawler. The cel-shading is sharp, the colour palette warm and refined, Afro and the other characters drip cool and charisma (their stoic, squinting faces wisely untroubled by any attempt at lip-syncing).The animation isn't top-drawer but it's only one or two down, and boy is it fast and fluid, the titular swordsman pirouetting through combos and darting between enemies with an easy grace matched by the effortless dramatic cuts, crash-zooms, and slow-mo transitions of the camera. The environments aren't huge and they can be plain, but their simple style works perfectly with the cel-shading and the dynamic characters.Second, it initially offers the good kind of button-mashing, rewarding mindless, repetitive input with spectacular and varied output. Afro Samurai is a simple hackandslash in which you tap out kick, light attack and heavy attack combos to keep enemies at bay - usually at least three at a time - and then bloodily dismember them. You also get a jump, a pretty inviolable block, and Focus, which is charged up by executing combos. Focus can be spent in quick bursts of slow-mo that allow precisely-targeted slashes for chopping bits off people. Alternatively, you can save it and blow it all on Over-Focus - a period of fantastically gory one-shot kills, great for mowing down large crowds.We weren't expecting more than this from Afro Samurai. To be quite honest, we didn't actually want more than this; the world already has its fair share of Devil May Cries and Ninja Gaidens, and in any case, this is a game not for gamers but for anime fans, hip-hop heads and pulp aesthetes who'll get off on its stylistic mix of Sergio Leone, Zatoichi, Cowboy Bebop, Shaft and the Wu Tang Clan. With Afro Samurai, the problem isn't in the concept, and it certainly isn't in the presentation. It's in the execution.It might have the marriage of form and function (and an amount of upfront polish) that most other licensed games lack, but unfortunately Afro Samurai shares one of their most common flaws - an obvious lack of time, money, and attention to detail in the design. It's not that it's too short; it will provide the average gamer with 10 hours or so, and plenty more if you engage the harder Number One mode unlocked with completion. But what there is wears itself thin very quickly indeed.There's an inordinate amount of back-tracking and reuse of locations. There's a complete lack of pacing, too. Every few minutes of gameplay are punctuated by a mini-cut-scene of some ronin in straw hats leaping out at Afro from somewhere unexpected, and it doesn't matter how stylish the split-screen cut or well-judged the stop-frame, mid-leap pause, it gets old fast. Puzzles and environmental interactions are amazingly perfunctory, and although the button-mashing splatter remains a simple pleasure throughout, it could really do with being thrown into relief by... something else. Anything at all."}