{"ref": "https://www.eurogamer.net/tomb-raider-underworld-beneath-the-ashes-review", "date": "24 Feb 2009", "game_name": "Tomb Raider: Underworld - Beneath the Ashes", "text": "With Tomb Raider, it's always been the moments that matter: those brief stabs of clarity when the towering clockwork starts to turn, when a dense tunnel of jungle gives way to an unexpected view of something massive and mossy, and when the last nagging part of a puzzle finally slots into place. These fleeting instants ground you in the game in a way few other titles manage: you understand, you act, and for a single second, you're not just moving through carefully choreographed spectacle - you're a part of it.So, while one random trinket is exchanged for another, the exotic locations get a quick shuffle, and the thin back-story slowly bloats into a deranged yet forgettable soap opera, each subsequent game is measured not by its plot - Tomb Raider's never been brilliant with plots - but by the handful of vivid snapshots it adds to the scrapbook. Previous instalments have set the bar high, leaving you quaking before a T-Rex, scrambling up the forehead of a sphinx before leaping from its placid brow, and swinging through the neon latticework of a Tokyo skyscraper. Last year's Underworld provided its own handful of additions too: plunging you deep into the roaring flames of Croft Manor, and letting you move huge hefts of ancient stone with a single swipe of your hand.So perhaps that's the best way to examine Beneath the Ashes, Underworld's first DLC episode. Forget the pricing and the length - at least for a moment. The most important question is this: does this new chunk of adventure have anything to add? Are there any moments that will make you gasp, wince, or gawp as the best entries in the series have?Things don't, initially, seem terribly promising. In a stunning master-stroke, this is a game that's already been deftly undermined not once but three times since its announcement: first with the muttered admission that the whole thing might be cutting room scraps from Underworld itself; then by the unfortunate dismissal of many of Crystal Dynamics' core team, including stoical Eric Lindstrom, the creative director; and finally with the recent announcement that it's not this episode but the next one which contains the really sexy stuff. Not till then will you be allowed to swap sensible Goretex for flashy leather waders (these are strange times), and play the role of Lara's homicidal doppleganger.The setting never sounded that exciting either, to be honest. Forget jetting around the world to distant jungles and ancient temples: how about spending a few hours rooting through Croft Manor's basement? This being Tomb Raider, of course, things aren't quite as drab as that suggests - the basement's massive, and filled with huge vaults, crumbling statues and pointy death traps. If there's anything as ordinary in there as an old mountain bike or tubs of ant-killer, I didn't see it, but fans of domestic stereotyping can at least take pleasure from the fact the place is half-flooded.Lara's been lured back to the ruins of Croft Manor after uncovering a note from her father which suggests there's a handy ornament down there somewhere: an artefact with the power to create and control Thralls. Once inside the catacombs, of course, she discovers that Dad didn't think to leave this gadget in a convenient filing cabinet or tucked behind a clock. Instead it's buried at the heart of a dense network of tunnels and traps, kept from thieving hands by ramshackle patrols of spooky undead knights and giant bugs, all of which confirms my suspicion that, when the aristocracy aren't making life hard for everyone else, they're making it hard for themselves.The ideal Tomb Raider environment is the kind of place a decade of home-ownership programming on Channel 4 has taught you to avoid: rundown and sprawling, and stuffed with rickety floorboards, collapsing bridges, and shambling zombies. But while you'd struggle to get a mortgage for it, Beneath the Ashes actually delivers one of the better playgrounds Lara's had in recent years: a mildewed realm of forgotten treasures, where cobwebs hang in musty tumbledown arches, and piles of skulls are stacked tidily in corners.More important than the soft furnishings, however, is the overall structure. This is a return to the large multi-room puzzles of the series' best locations, with giant machinery you have to successfully scale before setting in motion, and the game's single level threads elegantly through the creepy environment, stopping now and then to deviously double-back on itself while exploring every space from a variety of angles."}