{"ref": "https://www.eurogamer.net/prototype-hands-on", "date": "23 Feb 2009", "game_name": "Prototype", "text": "What's your idea of a fun day out in New York? Strolling down Fifth Avenue? Taking a carriage ride through Central Park? Visiting all the places you've seen in the movies? Or running up the side of a skyscraper, elbow-dropping a giant mutant from 50 storeys up, consuming the DNA of a helicopter pilot and punching a tank?There's a lot of tank-punching in Prototype. There's also a lot of skyscraper-scaling, elbow-dropping, DNA-consuming, sprinting, leaping, climbing, gliding, grabbing, throwing, smashing, punching, stabbing, strangling, shooting, slicing people in half and using corpses as surfboards. At no point do you get to visit the Seinfeld diner or Ross's apartment.But you do get to see New York as you've never seen it before, or at least since you last saw I Am Legend. ~It's a really interesting and unique story,~ says Activision brand manager Steve Fuller. No it isn't. It's about a young male protagonist who wakes up in a research institute with no idea how he got there, who he is or why he has loads of nutty powers all of a sudden.He sets about exploring a post-apocalyptic American city which has become infected by a mysterious virus, overrun with homicidal mutants and ruled by ruthless military operatives. As our hero battles to discover the truth about his origins, he begins to uncover a mysterious consipiracy about the mysterious figure who holds the mysterious key to the mystery of the mysterious virus. This story will need a really big twist to make it interesting and unique. Like, it turns out the virus can be cured by eating Soleros, or the mysterious mastermind is Greg Evigan from My Two Dads. We'll have to wait for the finished game to see if Radical Entertainment has managed to work in either of those twists. In the meantime, the nice man from Activision who can't have seen many films or played a lot of videogames is here to guide us through a playable demo of Prototype.The excerpt we're about to play, he explains, is taken from a point about three-quarters of the way through the story. At this point there are a huge number of mutants, or ~infected~ as they're officially known, causing havoc in the city. There are also plenty of Black Watch operatives knocking about. Luckily our hero, Alex Mercer, has by now developed his mysterious powers to a significant degree.From the moment the demo begins, the scene is one of absolute chaos. Dozens of civilians stream across Times Square, running, screaming and frequently bleeding. Big fleshy monsters roar and bellow as they attempt to smash up, tear down, rip apart and/or eat everything in the immediate vicinity. Soldiers clad in black uniforms blast away with massive guns, failing to show concern for who gets caught in the crossfire. Tanks rumble, helicopters whirr, smoke billows, fire rages and great scarlet jets of blood spray in every direction.In the midst of all this disarray and devastation, you can just make out the spot where Carrie and Mr Big had the fight about the hat. But more importantly, there stands Alex Mercer. Controlling him takes a little getting used to - not because it's fiddly, but because Alex is able to move around with more speed, ease and freedom you might be used to from your average most third-person action-adventure hero. Much has already been made of the fact Prototype takes inspiration from parkour. It's not the first game to do so, but that inspiration is manifested here in quite a different way. There's no worrying about the environmental context or trying to judge precisely how much of a run-up you need or ensuring you get the timing of jumps exactly right. Press the right trigger and Alex runs. The longer you hold it down, the faster he runs. He runs over cars. He runs along walls. He runs over houses, across roofs and right the way up the sides of ginormous skyscrapers. Whatever direction you send him in, whatever obstacles he comes up against, he just keeps on running."}