{"ref": "https://www.eurogamer.net/deadly-creatures-review", "date": "18 Feb 2009", "game_name": "Deadly Creatures", "text": "It doesn't speak too highly of the innovative thinking in the games industry that a simple cosmetic makeover can spark talk of originality and freshness. Deadly Creatures is a third-person action-adventure, with a heavy emphasis on melee fighting. It just happens to have a tarantula and a scorpion as its heroes, instead of a cyborg space marine ninja avenging the murder of his twin brother who was also a wizard.To begin with, at least, the change in perspective is compelling enough to make up for the rather threadbare construction. Alternating between the tarantula and scorpion, you explore your desert environment, occasionally fighting against each other as well as local predators, munching on crickets and grubs to top up your health afterwards. Each objective met, and each enemy slain, earns you points which unlock new moves when your total hits certain preset points.The scorpion is able to dig through cracked earth and slash through dry weeds. The spider can jump over lower obstacles and travel from one web to another in a bungee-cord fashion. Both are able to stick to walls, provided there's a gentle slope up to them, and this freedom from the horizontal makes exploration an entertaining prospect during the early stages.The mo-capped animation on both lead creatures is appropriately creepy and realistic, and scuttling them through the well-rendered, dusty micro-universe they inhabit throws up plenty of grim surprises. A family of spiders skitters from a crack in the belly of a forlorn garden gnome. A subterranean insect lair is illuminated by the glow from a lost mobile phone. In one particularly memorable scene you realise that you've crawled into a coffin, and must travel up, over and through the desiccated bones of the poor wretch whose final resting place you've accidentally invaded.The game even boasts an unusual, and rather effective, approach to storytelling. As you're scurrying about around this small patch of desert, you sporadically encounter a pair of humans voiced by Billy Bob Thornton and Dennis Hopper. They're clearly up to no good, and while you're often encountering their story from afar - and almost entirely through audio rather than visuals - it spins into a fairly clever yarn with some great moments of humour. There's more than a touch of the classic Tales From The Crypt comics to the way their grisly saga unfolds, and you'll look soon be looking forward to each new eavesdropped snippet of dialogue.Sadly, by the time the game reaches the halfway point of its ten short stages, the quirky concept is no longer enough to make up for some fairly grievous problems with the game engine. The camera is a wayward thing, making the game's topsy-turvy levels a chore to navigate, especially in close quarters, while the free-look system feels sticky and awkward. The way ahead is often obscured just beyond the limitations of your view, and you're frequently reduced to holding down the 2 button to call up a giant arrow directing you through the game. On more than one occasion, both spider and scorpion dropped through the scenery and became trapped, forcing a restart.Collision detection is also inconsistent, and with enemies that flicker, lurch and break through the solid geometry of the level with worrying frequency, the core fighting elements only become more frustrating as your foes become tougher. Reactions to your motion commands feel sluggish, and many of the later combat moves are practically worthless, requiring charge-up periods or combinations of buttons and movements that the game rarely gives you time to employ.As the combat breaks down, the game starts taking cheap shots wherever possible. Enemies unleash block-breaking attacks that take off huge chunks of health, or use combo strings that leave little room for retaliation. Played on anything more than the easiest setting, the combat soon becomes incredibly annoying as the simple bugs of the early stages give way to rats, lizards and hornets that hover out of reach, only offering themselves up for damage for short periods of time. Helplessly flailing as your health is whittled down yet again by attacks you're seemingly unable to avoid or repel, the novelty of the setting soon wears thin. Boss battles, on the other hand, are simplistic affairs based around flashing weak spots and QTE sequences.This brief and clunky Adventure Mode is all the game has to offer. There are no multiplayer options, no additional entertainments to unlock. Gobbling up the squirming grubs that litter the stages will grant you six galleries of concept art - ooh, thanks - but that's not nearly enough incentive to justify the exploration required to find all 405 of the squirmy blighters.Deadly Creatures has an intriguing premise, and makes a strong first impression with its shudder-inducing animation and cute environmental details. That may be enough to curry favour with Wii owners starved of action games, but over the long haul the scariest thing about these critters is how shoddily constructed they are."}