{"ref": "https://www.eurogamer.net/mystery-p-i-portrait-of-a-thief-amazing-adventures-the-lost-tomb-review", "date": "17 Feb 2009", "game_name": "Reviews", "text": "Casual games used to fall into three camps: the Bejeweled clone, the Diner Dash clone, and the Mystery Case File clone. It was and still is a clone-based market, and few are better at producing successful incarnations than PopCap. Its version of the Mystery Case File games began with Mystery P.I. - a hidden object game in which you're tasked with finding particular objects in an extremely cluttered scene. That sort of thing seems perfect for the DS, and it's surprising there haven't been hundreds already. Now PopCap has released two at once.PopCap has previously done a couple of Mystery P.I. games on PC, The Lottery Ticket and The Vegas Heist, and Portrait of a Thief borrows very heavily from the former. Indeed, many of the same screens are used, this time to ~tell the story~ of an art theft that you're ~investigating~.Such laborious use of quotation marks is pretty necessary here, since all you ever do throughout is hunt busy images for items on the list, then solve a simple puzzle, and repeat, forever. Which is not necessarily a bad thing. Against all reason, this most simplistic and ridiculous of notions is oddly gratifying. Think Where's Wally, but with dozens of things to find and none of them wearing stupid hats. It's that constant hammering on the satisfaction button as you tap on the third frog, and then spot the umbrella along the top bar of the lamppost. Ding! Each object vanishes from the scene and is crossed out on your list.Importantly, things aren't hidden logically. Instead they've been placed onto the background image in devious ways to help them vanish from your eye. This might be through camouflage, or through ludicrous scale. You'd be amazed how hard it can be to spot a telephone when it's the size of a tree.Once everything has been found - perhaps along with each level's optional key and brush, which unlock mini-games - you reach the puzzle screen where you'll be asked to do something ridiculously simple like a 25-piece jigsaw, or moving tiles to match the background, picture pairs, and even a peculiar (by which I mean wrong) version of Mah-jongg.As you progress through the nonsensical story about suspects, thieves, and leads (all told through dull text onscreen), you're given access to a number of locations at once. There's a certain number of objects total that must be found, with completists given the option to hunt them all down if so desired. And all within a generous time limit. The advantage of multiple locations is taking a break from staring at one screen and starting afresh on another. It saves you from going too mad, as you somehow fail to spot a hummingbird in a café. (You can always use the hints, but they're for wimps.)The DS version's most distinct difference from its PC origin is the scrolling screen. As things would be too tiny to see if the whole location were visible at once, things zoom right in letting you swish around with the stylus. And this is done well. Randomly tapping on the screen is considered cheating, so the game will penalise your score if you do, but there's never any confusion between scrolling and tapping, so you never get an unfair punishment for looking around. It changes how you approach the game, of course, and slows you down slightly, but soon it feels right enough.The huge disadvantage, however, is the quality of the backgrounds. If only they could have been a much higher resolution. While everything is clear enough, it also looks grainy and slightly cheap. Which is not a great atmosphere to have in a game that's going to have you repeat everything five million times. As you play, you'll encounter each of the seventeen screens a great many times, and find yourself solving the same puzzles far too often. It really is a casual game, designed to be played for a short burst. It's definitely not worth approaching as something to beat, and for goodness sakes don't consider trying to engage with the story.It's a good fit for the DS, the top screen showing your list and time, the bottom the interactive scene. But it's a shame it's rehashed PC backgrounds, and low-res images. I'd love to see more originality applied, but there's no denying this is idiotically absorbing.7/10Rinse and repeat. Almost everything said for Mystery P.I. stands true of Amazing Adventures, including its being a rehash of a previous PC game, this time Amazing Adventures: The Lost Tomb. And since the rest of this review will be moaning, bear in mind all the positives for PI stand too.Once again you're given cluttered screens and a shopping list of items to pick out, across eighteen locations. This time you're on the hunt for a Mayan ruin or something... Remember at school when you'd be given a block of text to read from a textbook, and your eyes would glaze over by the end of the first sentence each time you tried to read it? You'd reach the end of the paragraph and realise you hadn't taken a single word of it in, and each time you tried, the same thing would happen. So I know there's some rival guy who is stealing your research, and there's some local who helps you, and apparently the baddy guy smashes up valuable artefacts. But how this has anything to do with finding five balls and a guitar in a swamp, I'm really not sure.The difference in The Forgotten Ruins is the way the locations are arranged. Here you get one at a time, with about five in each chapter. There's no respite by shopping around this time. There are twenty chapters, which sounds like great value for money. That's around 100 levels. Except you have to remember there are only 17 locations, and the balance is not evenly spread. Out of sheer, bloody-minded determination, I completed the game, and must have played the River Bank level ten times. I can tell you where all four tortoises are hidden without looking.By the time you've finished, you'll have played the same mini-games so many times they'll be burned into your brain. For reasons unknown, they appear after every screen, rather than at the end of each chapter. And because only four backgrounds have been made into jigsaws, for instance, you'll solve those jigsaws a lot.However, for the same casual hunting, it all works fine. Don't play it in one giant go, but rather as something you pick up for a bus ride, and it'll do its job. The lack of grouping levels does it a real disservice, and once again that it's a remix of an old PC game with a new title isn't enamouring. But the same hypnotic power is present here, and even now, having played the stupid thing to death, I've a horrible suspicion that if I loaded it again I'd end up playing all over again.6/10"}