{"ref": "https://www.eurogamer.net/burnout-paradise-the-ultimate-box-review", "date": "17 Feb 2009", "game_name": "Burnout Paradise: The Ultimate Box", "text": "Just over a year on from its initial release, Electronic Arts has re-issued Burnout Paradise in the form of The Ultimate Box. This combines the original game with all of its download add-ons, a brand new Party mode and a range of other less headline-grabbing but equally welcome updates.And yes, that includes a restart option. Some might argue that Criterion has finally bowed under the pressure of its critics. But the truth of the matter is the inclusion of the much sought-after feature isn't just about appeasing The Internet; it is just one of an array of tweaks, upgrades and changes designed to make the whole game more appealing to a less hardcore audience.In fact, most of the toolings under the hood are about expanding the game's reach. The initial stages of the game have been completely rebalanced, with an all-new, less punishing handling model dished out to the first few cars and the difficulty level lowered to accommodate less experienced gamers. Other changes include less strenuous target times on events such as the Burning Routes and a relaxing of the tight time limits on maintaining combos in the Stunt Runs. Billboards, Smashes and Super Jumps now benefit from additional highlighting, making them easier to track down. The end result of these tweaks is that single-player Burnout is undoubtedly easier, but the difficulty level still ramps up acceptably the further you progress into the game.Moving into the multiplayer realm, the new Party Pack is further proof of Criterion's desire to attract a more 'pick up and play' audience. It offers pass-the-controller style multiplayer gameplay for two to eight players, and a range of new challenges grouped into three different categories: stunt, skill and speed. You can design your own menu of events for each session, or you can just let the CPU decide for you. Then the games begin: landing difficult jumps, dodging traffic, smashing billboards - it's all here, and it's pretty good fun. Also impressive is the way that key points of Paradise City are expertly utilised for the challenges; if you're a newcomer to the game, it's a great way to get acquainted with the local landmarks.While the events are short, sweet and entertaining enough in the party context, the appeal is limited to Burnout veterans. The overall impression is that the tasks on offer aren't actually that taxing: certainly, little skill and ingenuity are required compared to Criterion's previous party-based masterpiece, Crash Mode (surely due a return as a Party Pack in its own right). Moreover, it's possible for the same event to crop up twice in subsequent party sessions with alarming frequency. This gives the impression - rightly or wrongly - that there's not much actual content in there. As an introduction to a different spin on the traditional Burnout gameplay, and as a new way to bring less hardcore gamers to the series, the Party Pack works, but the series' traditional audience isn't going to expend a huge amount of time on it.Ultimate Box purchasers get the Party Pack for free as part of the new package. Existing owners of the original launch version need to cough up 7.99 GBP on PSN or 800 Microsoft Points (GBP 6.80 / EUR 9.60) to catch up. That's undoubtedly pricey in the context of PSN and Live Arcade games and indeed Criterion's own free updates."}