{"ref": "https://www.eurogamer.net/grand-theft-auto-iv-the-lost-and-damned-review", "date": "16 Feb 2009", "game_name": "Reviews", "text": "Although Rockstar may not be adding much to the footprint of Liberty City with The Lost and Damned - conjuring a fresh island out of the muddy rivers, or laying down a fine spray of new skyscrapers, flyovers, and dockyards - the company has been hard at work building stories; sculpting new characters, fabricating dense relationship networks of cause and effect, and plumbing in a buried system of deadly motives and smouldering resentment. The Lost and Damned's narrative sees the developer on top form, creating an unnerving pressure-cooker tale that draws on the familiar GTA themes of hierarchy, revenge, and going for a drive with a passenger who doesn't mind it when you flip the car at an intersection and plant it upside down in a bakery.This time it's the bikers who hog the spotlight. Johnny Klebitz has been in charge of The Lost Motorcycle Club while the President, Billy Grey, has been in rehab. Billy's out now, and somewhat perturbed to see his rowdy fightin' and fumin' street gang turned into a (relatively) smooth-running corporation, a truce in place with long-time rivals The Angels of Death, and a new strategy based on lying low and allowing the flourishing narcotics business to bring in the money. It's old versus new, then, and within the space of one mission, dangerous tensions are simmering away between Johnny and Billy, with the stage set for a conflict that could tear the gang apart.While the tale is simple enough, the telling is brilliant and often devilishly subtle. Johnny and Billy are entirely empathetic leads - the former gruff yet care-worn, the latter gently terrifying, but somehow touching - and their performances set new standards for videogame naturalism. The story's topical themes find time to take in elections, the recession, and the knotty question of good governance, and while there are shoot-outs, explosions, chases, and car-jackings, Rockstar's greatest talent is for restraint - refusing again and again to let the main characters' feud spill over into actual violence, until the sense of impending doom is almost unbearable. The game may revel in an open world, but, once more, Liberty City's citizens are thoroughly trapped: hemmed in by financial imperatives, pathetic addictions, and outdated thinking. Videogames don't often ask you to think of their characters in this way.Yet The Lost and Damned is also a love story, as an unlikely romance blossoms between the player and the game's rebalanced bikes. Insubstantial and often prone to bursts of bizarre behaviour in most GTA games, they're transformed here into road-hugging monsters, lithe and powerful: a brutal mixture of low-riding menace and chugging, thrumming audio. You'll feel part of the gang, too, with lengthy convoy drives spiced up by a mini-game that encourages you to ride in formation in order to unlock extra dialogue, while each mission ends with any surviving team-members levelling up in terms of toughness and experience. While it's hard to say exactly how much help your leather-waistcoated brothers provide during the game's regular shoot-outs, at the very least they create a constant stream of chummy chatter, and are blessedly skilled at staying alive at critical moments.What Rockstar hasn't been building, however, is a fresh approach for the missions. It's hardly fair to expect the developers would do something so fundamental for an expansion pack, but while the game is never less than a joy to play, with the thrill of exploring a new city gone, the rate at which the company's story skills are evolving while their missions remain largely unchanged is becoming increasingly apparent."}