{"ref": "https://www.eurogamer.net/grand-theft-auto-iv-the-lost-and-damned-hands-on", "date": "16 Feb 2009", "game_name": "Reviews", "text": "If you think DLC is sometimes a little overpriced, spare a thought for Microsoft: they've dropped an alleged fifty million dollars on exclusive episodes for GTAIV. I don't know about you, but that certainly puts that drunken Mr Driller purchase into context for me.Then again, this is GTAIV we're talking about, so Microsoft's investment is probably something of a sure thing. With The Lost and Damned, the first of two downloadable mission packs, available on 17th February, DLC will be getting another landmark moment: yet one more star to stick on the timeline along with the price fumble over horse armour, the inexplicable generosity of Burnout Paradise, and that time they broke Lumines down into little pieces and sold us each glittering fragment separately.But there might be some wider significance to The Lost and Damned too. Because, despite the brilliance of the execution, despite the massive sales and endless plaudits, more than a few people felt that GTAIV was a game that was being (enjoyably) tugged in two directions. On one side was the dazzling parade of empathetic characters and gut-churning decisions, and on the other side were the traditional impromptu crime sprees, the rampages, and the inevitable comical mishap that erupted whenever I, at least, got behind the wheel of a motor. GTA was always designed to let you misbehave, but with the fourth game a lot of people found themselves reluctant to do so.Part of this may be down to the character of Niko himself, a leading man troubled, at times, by his own integrity. With The Lost and Damned, he's almost entirely absent, and with a new main character, there's the chance that the more excessive San Andreas side of the GTA that some felt was missing from IV may mesh more naturally with the series' increasing desire to tell stories.That new character, rather brilliantly, is that most unrepresented of videogame demographics, a Jewish biker. Johnny Klebitz will be recognisable to anyone who played through a good chunk of Bellic's story, and with a Hell's Angels type behind the handlebars, Rockstar has potentially found a lead more suited to unloading ballistic disaster onto the population of Liberty City. He's hardly about to strap on a rocketpack, but you suspect he probably has friends who might own one, at least.Yet Lost and Damned isn't about to ditch the intimate character drama that made GTAIV so memorable - it remains a story-driven experience, and the story is the tense, ever-ticking time bomb kind of affair. Johnny is vice president of The Lost, one of Liberty City's two main biker gangs, and he's been running the show while Billy, the boss, has been stuck in rehab. With Johnny in charge, The Lost have tempered their approach somewhat, easing up on a turf war with rival gang Angels of Darkness, in order to focus on more peaceful activities, like keeping a roaring drugs business going.The game kicks off with the boss's return. Billy resembles a shaven-headed Santa Claus emerging from a prolonged stay in a concentration camp where he picked up a major thing for leather waistcoats: he's got an excellent line in crazy stares, and can't wait to get the gang back to its all-shooting, all-head-stomping roots. Conflict's inevitably brewing, then, and Lost and Damned's set-up feels a bit like a redneck version of The Apprentice, but with shotgun fire-fights instead of boardroom showdowns.In gameplay terms, the biggest change is that, while Niko was often a lonely figure on missions, Johnny is regularly surrounded by his gang, who provide backup in battles, and company on the road. Thankfully, they take care of themselves pretty well, with no need for Tom Clancy-style squad controls. Instead, there's a subtle incentive to keep them alive by watching their backs during shoot-outs: any gang members who survives a mission will gradually level up, becoming harder to kill, and sharper of shot. If they're offed, however, they'll be replaced by less useful newcomers, and the process begins anew."}