{"ref": "https://www.eurogamer.net/the-house-of-the-dead-overkill-review", "date": "9 Feb 2009", "game_name": "The House of Dead: Overkill", "text": "The House of the Dead: Overkill, SEGA's Wii-exclusive reboot of its undead shooting gallery, has a score combo system. Provided you don't miss the ~mutants~, or the pickups, or the panes of glass, or the conveniently-placed giant candelabras, you'll progress through a series of score-enhancing states called ~extreme violence~, ~ultra violence~, ~psychotic~ and finally - worth a delicious extra 1000 points per kill - ~Goregasm~. When you attain the latter splatter nirvana, the combo meter disappears and is replaced by a huge, fluttering, resplendent Stars and Stripes.But you can't call Overkill subversive, really. Its blend of explosive gore, mindless profanity and puerile gross-out barely manages irony, despite being wrapped in quote marks borrowed from Quentin Tarantino's Grindhouse. The developers at Headstrong Games - formerly Kuju London, the Nintendo specialists responsible for Battalion Wars - are having way too much fun to be ironic. They are the Brits let loose on a pulpy mash of American and Japanese pop-culture and told to do whatever the hell they like with it, and they're loving every second. Yes we can take the piss. And we will.And despite the fact that Overkill isn't quite as funny as it thinks it is - and falls a few points short of entering its name on the scoreboard of arcade perfection - you will laugh along with them, and happily blast the cannonade of rotting flesh they fling at you into bloodied chunks again and again, for hour after hour. Because Overkill is that rarest of things, a brilliant ~light-gun~ game for the home.That realisation comes later on, though. At first, you'll just be swept up in the game's stylistic twist and stunning production values. Pimping the pulp angle as hard as it can, Overkill transplants House of the Dead to a timeless trash-fiction freakshow, equal parts fifties horror, seventies exploitation and knowing nineties cool. Framed as a prequel, it trades in ripe cliché, turning Agent G into a stuck-up white boy and teaming him, inevitably, with a hot-tempered Samuel L Jackson type with an excessive fondness for the Oedipal adjective. And adverb. And noun. If Headstrong was after the world record for cussing in games, well, it'll have to get someone else to count, but it has probably claimed it.Each of the game's seven episodes - running at twenty minutes to half an hour each - is framed as a B-movie feature, interspersed with hammy cut-scenes. The pastiche is at its best at the start, when neckerchiefed, coiffed villain Papa Caesar is introduced in the deliberately and hilariously awful trailer jump-cuts of Papa's Palace of Pain. Sadly, as the game's conveyor belt of zombie extermination rolls on, the writing gets more self-indulgent and the scenes of aimless swearing and buddy-cop banter start to drag. But the enthusiasm can't be faulted, and the best gag - a variation on the ~missing reel~ tease that tops Tarantino's in Death Proof - is wisely saved for the end. There's a sprinkling of smart quotes from elsewhere in genre cinema too, notably The Birds and Ring.Besides, the idea was surely to capture Grindhouse's visual and aural mood - specifically that of Robert Rodriguez's Planet Terror - and it's an inspired one. The scratched-up film effects all over the screen, the lurid colour scheme, the pop and crackle in the speakers mesh perfectly with the seedy subject matter. And the music is fabulous, surely a soundtrack of the year candidate; note-perfect parodies of vintage funk and rockabilly, with thumping, dirty electro remixes for the boss battles.It's not like there's a multitude of sins hiding under the clever overlays, either. House of the Dead: Overkill is a stunningly good-looking game, using the scripted limitations of the on-rails shooter (and Headstrong's experience with the hardware) to squeeze superlative performance from the Wii. Much-touted beauty-queen FPS The Conduit has plenty to live up to. Depth-of-field and motion-blur add thrilling dynamism, the lighting is faultless, the animation fluid, the textures rich, the bloody explosions are impressively... liquid. There's some slowdown in particularly busy moments, but as with a Treasure shmup, this just adds to the sense of glorious sensory overload.It's not just a matter of technical prowess, either. Since this is a strictly on-rails target-shooter - ~free look~ allows very slight adjustment of the angle if you take your cursor to the edge of the screen - the game's good looks and high excitement are equally down to the level design, pacing and camera direction. All are superb, mixing stand-and-defend moments with run-and-gun, potshots at range, and brief flashes of bonus monsters to gun down before racing on. Every level has one or two memorable, iconic set-pieces like the ghost-train ride in Carny (a sly, self-aware dig at Overkill's own genre, surely).Most of the levels are dense and interesting enough to survive plenty of replays. And they'll have to - Overkill is maybe three hours long, an epic in light-gun terms, but small beer in anyone else's. Headstrong is well aware that this isn't an arcade cab, however, and it has made a plethora of clever concessions aimed at extending the game's longevity and accessibility, turning in the ultimate smart-casual console blaster in the process."}