{"ref": "https://www.eurogamer.net/pikuniku-review-a-brilliantly-breezy-genuinely-funny-puzzle-platformer", "date": "22 Jan 2019", "game_name": "Pikuniku", "text": "Kid's TV shows, you've no doubt discussed with friends while waiting for someone to come back from the all-night garage with a packet of french fancies and a fresh packet of skins, can be kind of sinister. Not just your straight-up, in your face Chocky sinister either; beneath the primary colours and blunt language of many a show there's the feeling that something's not quite right. Which is part of the thrill - the weird, messy thrill - of Don't Hug Me, I'm Scared, the YouTube phenomenon that starts off BBC and then goes full Current 93, a nursery rhyme whose occult roots crack through all the sweetness. It is amazing, and if Pikuniku - a puzzle platformer for PC and Switch that's being published by Devolver - never goes quite as dark, it's definitely drinking from the same well. And it, too, is amazing, a joyous, smart and imaginative adventure that's the rarest of things: a genuinely funny video game. There's the strong influence of Keita Takahashi's work in its aesthetic, though Pikuniku has a voice all of its own. There's warmth and wit in the characters that you come across - you play The Beast, a blob on two legs that emerges from a cave at the outset of Pikuniku and stumbles upon a cartoon world beholden to an awful conspiracy as it suffers at the hands of the corporation Sunshine Inc.Its send-up of late capitalism is hardly Chomsky, but it does give Pikuniku's world a delightful edge; it's a world of magic toasters and scheming acorns where you can sense the slight crack in the edge of the mile-wide smiles on the faces of forest folk, or spot the CCTV camera that pokes its head around the side of a grand old oak. Pikuniku's humour is mostly in what you do; it's a puzzle platform that's blessed with the softest of physics, and it presents a world that's always got something for you to poke at. Plant a boot in an NPC (an outstretched leg is your most effective method of interaction here) and they'll have a reaction or a single line retort, and elsewhere there are tinkling piano platforms, lampshades that ring like a bell when you hit them. Tying all that together is your own character, a gangly, gamboling little thing that can roll up into a ball and blitz down slopes. The running animation is everything, clumsy and playful and enough on its own to make me chuckle. It's all gentle, almost slight stuff in what's an agreeably breezy game - about three to four hours, all told. There's not much offered by way of resistance, the puzzles that present themselves as you go about helping various NPCs all solvable within seconds (apart from one egregious example very early on - let me just save you a fair bit of pain and suggest seeking out a spider), but still Pikuniku manages to pack a fair few surprises in its short running time. There's a decent basketball mini-game, a rhythm action diversion and a handful of boss encounters complete with their own punchlines, and the pacing of it all is pretty much perfect. There's more to return to once the credits have rolled - a bevvy of secrets to be found, or a standalone co-op mode which presents its own bespoke levels that lean more heavily on the physics of it all, while still maintaining that breezy style of the main campaign. It's slight but not exactly insubstantial, a perfect little sweetener to kick off the year with. The only slight downside is that Pikuniku leaves you wanting more - but how often can you say that of a video game?"}