{"ref": "https://www.eurogamer.net/kingdom-under-fire-circle-of-doom-review", "date": "18 Jan 2019", "game_name": "Kingdom Under Fire: Circle of Doom", "text": "I made a mistake while reviewing Kingdom Under Fire: Circle of Doom. I made the mistake of playing its single-player campaign for 12 hours before venturing online. That's a mistake because the single-player game is terrible, reaching new heights of energy-sapping tedium and ennui-inducing boredom. The story is rudimentary, fragmented, bizarre, and pointless, the game is an unconcealed level-grind, and that level-grind is monotonous and tedious. So for those 12 hours, the score at the bottom of this review ticked inexorably down in inverse proportion to the levels that my character was monotonously clocking up.As with every review, I started out with doe-eyed optimism, the game's fancy graphics giving me a surge of confidence that remained undimmed by the insanely inappropriate repetitive metal guitar noodlings that make up the soundtrack. Visually it's the sort of impressive that's now standard for next-gen games - the opening woodland level is all bloom lighting and fancy particle effects, and lots of stunning scenic cliff-top views. The five starting characters all look pretty enough, and offer a well-balanced spectrum between slow and strong and quick and light, and the action is immediate - wandering down what are essentially corridors, meeting a crowd of monsters and then meting out massive violence by hammering your face buttons.That's pretty much it: the game laid bare inside the first ten minutes. Except that as it goes on, the stunning sylvan idyll gives way to boring clichés like snow and lava levels, populated by one of the most irritating bestiaries in videogame history, full of monsters that are capable of freezing you solid, knocking you over, or bringing their allies back to life. And as the unceasingly simplistic action becomes more and more tiresome, punctuated only by an insipid array of camera-breaking, attritional boss battles, the micromanagement of your inventory becomes increasingly intrusive. That's because it costs something called SP to equip items and weapons. It also costs SP to attack with an item or weapon, and if you run out of SP in the middle of a battle you just have to wait till they charge back up, which means that you also have to equip items that recover your SP. But that means that every time you try to equip a new item you'll also have to come to a new balance of SP consumption/recovery. Micromanagment aside, Circle of Doom is, in case you hadn't noticed by now, essentially a third-person Diablo clone, eschewing the RTS elements found in previous Kingdom Under Fire games. Heck, even the flaming-lettered game logo is reminiscent of the Diablo II box. There's nothing inherently wrong with Diablo clones, or with level-grind games in general. There is, after all, something satisfying about dispatching wave after relentless wave of baddies. But that satisfaction can quickly turn into tedium unless a game keeps throwing new things at the player. Each new character level needs to bring with it new items, or weapons, or experiences, to inspire further level grinding; each new item needs to be more wondrous than the one before. The problem with Circle of Doom is that mostly the new weapons are pretty rubbish, useful only for fusing to your existing weapon using a half-baked weapon synthesis system, providing barely incremental advances where paradigmatic ones are needed.Or so I thought. Then I ventured online and it all began to make some kind of sense. Not perfect sense: while the online experience enhances the game immeasurably, it's still not quite enough to mask its fundamental inadequacies. But yes, sense of a sort. As with any action-RPG, collaboration with a decent party of fellow adventurers makes the experience more enjoyable. In Circle of Doom's case, it also reveals the hidden depths of the weapon synthesis system, as you encounter players who have created super-powerful weapons by canny trading or teaming up with more powerful parties, developing their characters in all sorts of different directions and playing styles.And so the score at the bottom of this review ticked slowly back up. It had to stop, of course, because, even though the game comes to life online, it is still, essentially, a slightly empty experience. The problem really is that, even online, the only incentive to carry on braving Circle of Doom's tedious environments and simplistic action is to obtain a high-powered character, or a monstrous weapon. Except once you've done that, it renders the game even more tedious and simplistic as you one-hit-kill your way around the same stultifying environments that you've been grinding through. Which, online or offline, eventually gets a bit boring."}