{"ref": "https://www.eurogamer.net/rock-band-wiireview", "date": "22 Jan 2009", "game_name": "Rock Band", "text": "It's about time Rock Band made it to the Wii. After all, Nintendo's little white box is the ultimate social gaming machine, and Harmonix's big expensive box is the most fun you can have with friends you don't want to sleep with. The perfect match, in theory. In practice, the core gameplay is present and correct, making for a highly enjoyable experience. But if you've played Rock Band on the PS3 or 360, you can't help noticing that something's missing. Quite a few things, in fact. At least the instruments are up to scratch. The full kit retails for GBP 129.99 (though it's easy enough to find if for under a hundred quid online). For that you get a USB hub, wired microphone and wired drum kit, plus a wireless guitar and receiver. The game must be purchased separately, as with Rock Band for other consoles. Side-by-side, the Wii peripherals look almost identical to the Xbox 360 ones - the most obvious exception being the drum kit is white instead of black. The pads are identical and make just as much noise. The spring on the Wii kit's foot pedal feels like it has slightly more recoil, meaning a little more effort is required but less accidental presses are likely. The microphones are the same, except the chunk of plastic near the USB end of the Wii mic's cable is much smaller and neater. The guitars are indistinguishable, apart from the fact the Wii one is wireless. So if you're one of those people who complained about the 360's guitar for having spongy fret buttons and a click-free strum bar, you won't get on any better with the Wii version. Once again, basic gameplay involves watching coloured notes scroll down the screen and hitting the relevant buttons or pads, or singing the right notes. It's instantly familiar to anyone who's played a music game before, and easily accessible to anyone who hasn't. The gameplay works just as well on the Wii as it does on other consoles, and the arrangements for the songs are just the same. The list of songs you have to choose from, however, is slightly different. There are 63 in total, which includes five bonus tracks not featured on the PS3 or Xbox 360 discs - ~Dirty Little Secret~ by The All-American Rejects, ~Roam~ by The B-52s, ~Rockaway Beach~ by The Ramones, ~Roxanne~ from The Police and Oasis' ~Don't Look Back in Anger~ - although all are available as downloadable content for the bulkier consoles.The remaining tracklist will be familiar to anyone who's played Rock Band on another machine. Expect contemporary hits (~Are You Gonna Be My Girl~ by Jet, The Killers' ~When You Were Young~) alongside nineties classics (Nirvana's ~In Bloom~, ~Sabotage~ by the Beastie Boys) and golden oldies (~Gimme Shelter~ by The Rolling Stones, ~CSI: Miami theme tune~ by The Who).  Not a bad selection of songs, then. But you'd hope so, because you're stuck with it. Unlike the PS3 and Xbox 360 versions of the game, Rock Band for Wii has no online functionality. Obviously, this means you can't play with other people over the internet - not a massive deal, considering the large number of Wii owners who couldn't give a fig about Friend Codes. However, being able to build your own library of tracks is a key highlight of Rock Band on other consoles, and it's a real shame there's no option to do so in the Wii game. (At least it makes a change from waking up with a hangover to realise your friends spent all your Microsoft Points on No Doubt records and the Jimmy Buffett track pack, though of course ~Cheeseburger in Paradise~ is worth every penny.)"}