{"ref": "https://www.eurogamer.net/football-manager-live-review", "date": "20 Jan 2009", "game_name": "Football Manager Live", "text": "After what's felt like the longest beta test in history, Sports Interactive's MMO management game finally kicks off in earnest this week. For the uninitiated, here's the deal: Football Manager Live is a simplified and more accessible online version of the Football Manager series. Much of the detailed micromanagement has been stripped out, and replaced with fun community features that aim to add momentum to the series' legendary addictive qualities. Oh, and there's a monthly subscription, which is paid in advance for three (GBP 22.99), six (GBP 43.99) or twelve (GBP 72.99) months as part of the purchase price from the Football Manager Live website.One of the most striking differences between FM Live and the series to date is in how squads are formed and players purchased. Once you've signed up, submitted your team name and picked the kit that you think will make your players look imposing, you're given the opportunity to manually select a squad from a gargantuan pool of real-life players. As we've come to expect from Football Manager games, the selection is exhaustive, so if you're feeling a little overawed, you can have the game automatically pick a squad for you. However, there's a catch. A minuscule wage budget prevents you from stocking up on marquee superstars, meaning you'll start out with a bunch of grafters you've probably never heard of.To bolster your squad, you're going to have to start wheeling and dealing. You do this via an auction system that's a bit like eBay. When a player is put up for sale, you and your fellow managers have a predefined time limit to lodge bids. When the deadline arrives, the highest bidder gets to stand next to the player while holding aloft the club's flag and waving vacantly at the cameras. Battling it out in the transfer market is surprisingly addictive, and you'll even find yourself logging on at 3am to check that no one has gazumped your bids. But the transfer list isn't the only way to bolster your squad. Any player not already signed to a team is subject to wage auctions: a 24-hour bidding period during which any manager can offer the player the weekly wage they deem appropriate (or necessary) to sign them.Once your squad is ready, you can use an intuitive match-finding tool to track down an opponent. Depending on how many players are online (and how anal your match requirements are), this can take anything from two seconds to ten minutes. When an opponent has been found, you're given five minutes to submit your team sheet and tactics.Diehard Football Manager fans may want to look away now. FM Live starts out as a pretty threadbare tactical experience, as you must first learn new skills to unlock tactical options. Want to use a playmaker and target man? Then you'll have to learn both skills by selecting them in the Skills menu, and waiting until they're unlocked.Learning a new skill can take anywhere between twenty minutes and several days. You can choose to specialise in a specific skill category (Fast Learner, Club Doctor, Blackboard Manager, Tracksuit Manager, Talent Spotter or Strictly Business) or opt to become a jack-of-all-trades. While the need to unlock new tactical options and bonuses is initially more irritating than a scrotal rash in summer, this RPG-style system does slowly make a case for itself, adding depth and longevity while allowing newcomers to slowly learn the finer points of match-day tactics.Once you and your opponent have finished setting up your teams, you get to watch a series of match highlights. Unlike Football Manager 2009, Football Manager Live doesn't use Sports Interactive's new 3D match engine, instead sticking to the more traditional 2D view. Again, this is a minor disappointment, but the truth is that this return to 2D does nothing to hinder matches, thanks to the engine's stunningly realistic depiction of football. Match highlights often strike the perfect balance between excitement and tension while always providing you with enough information to discern where your team is struggling, and what changes need to be made.Each match typically lasts between ten and fifteen minutes, depending on which of the three match speeds you and your opponent agree to use. This means you can play several games in a very short space of time, allowing you to dip in and out of FM Live for a quick match, rather than having to spend hours endangering your marriage to play a single, protracted game."}