{"ref": "https://www.eurogamer.net/air-traffic-chaos-review", "date": "12 Jan 2009", "game_name": "Air Traffic Chaos", "text": "~A little light reviewing.~ That's how Tom characterised a chance to write about this quirky DS game, released in the US last year and adapted from a Japanese original. He proposed it as an easygoing respite from all those time-consuming, high-pressure blockbuster jobs, and I couldn't turn down anything with that title. Little did I realise that Air Traffic Chaos would come close to ruining Christmas and present me with one of the toughest critical conundrums I've faced in years of reviewing.Here is a game that you can barely call fun - insofar as it's very much like work - but that is so mercilessly addictive it can consume days, so intense it can render you incapable of speech. Here is a game that looks and sounds novel but is, in fact, a conversion of a ten-year-old Japanese PC series. Here is a game so basic and simple - it consists of five screens, three difficulty settings and a rule set - it can barely be called a game at all, but so rigorous and pure and unbreakable it's impossible to criticise.But I don't really have time to consider such niceties. I'm certainly not here to enjoy myself. I'm above fripperies like depth and reward and presentation. This is a serious business; there are airports to run, planes to get on the ground, skies to keep safe. Because - as the manga poppet on the box says, in tribute to the original Japanese title - I Am An Air Traffic Controller!Of the tide of job-related carts that's turning the DS into a portable career fair - tiny plastic invitations to be a defence lawyer, a wedding planner, a short-order cook - the experience of playing Air Traffic Chaos is probably closest to the real-life world it simulates. You sit at a console, stacking aircraft in holding patterns, keeping them apart from each other, managing runway time and delays and gate allocations and communication channels. You sweat, and try not to have a heart attack.There are no outlandish events or spurious videogamey challenges to respond to - although managing rush hour at Tokyo Haneda airport as is quite enough of a challenge, thanks, like performing an uninterrupted 30-minute combo juggle or live choreography of all the bullets in a Treasure shmup. There's no climax or payoff or sense of closure - just the sudden, abrupt end to your shift in the middle of the madness.If there hasn't been a horrific collision in the air or on the ground, and you haven't driven pilots' stress levels through the roof, you get to keep your job, have a rest and be able to live with yourself. The important difference, of course, is that if you fail a shift you can attempt to undo your mistakes by playing the shift again. And again. And again. It's not unusual to restart ten or fifteen times in one sitting - and some shifts are fifteen or twenty minutes long. Failing at the very end of one is enough to make you weep. It's the last game you'd think of playing to while away the time at the airport, but in fact, Air Traffic Chaos is a great weapon against air rage. You'll gain an acute appreciation of how mind-bendingly difficult, fast-paced and pressured it is to run an airport - like spinning thousand-ton metal plates. You're guaranteed to have more patience with delays after playing.It works like this. Little pixellated aircraft appear in the skies over tidy, isometric, toytown representations of Japanese airports: Fukuoka, Osaka's Kansai International on its man-made island, Chubu, the hateful Tokyo Haneda (half the gates are inaccessible from runways 16L and 34R, if you can believe it) and Hokkaido's Neew Chitose. Each is available in three difficulty settings, which vary the length of your shift and the frequency of arrivals and departures, as well as sometimes introducing weather conditions, although these only really affect your own ability to see what's going on.As soon as a plane hits the holding pattern (a squared circle) it appears in one of the four ~arrivals~ slots on the touch-screen. Here you can select it and radio the pilot, telling him to speed up or slow down to avoid crashing into other circling or arriving aircraft, hold, or assign him a runway to land. You need to keep an eye on the windsock to make sure there's not a tail-wind in the direction you're asking him to land, which could lead the plane to come in too fast and need to abort and return to the holding pattern.Once assigned a runway, you'll need to confirm the plane is clear to land, or it will automatically abort. Then, once it's touched down, assign it a gate to taxi to, giving permission to cross runways and making sure it won't bump into anything along the way. Sounds pretty simple, doesn't it? But what goes in must come out."}