{"ref": "https://www.eurogamer.net/super-stardust-portable-review", "date": "8 Jan 2009", "game_name": "Super Stardust Portable", "text": "Super Stardust is one of the most concentrated shoot-'em-ups ever made. There are no breaks in the action, no cut-scenes, never a moment to pause, to marvel at the firework display of particle effects exploding around you, or even to pay much attention to your current score. Your tiny ship, caught in a maelstrom of asteroids and alien attackers, weaves through a constantly shifting maze, firing one of three different bullet types in all directions, collecting pick-ups, deploying smart bombs and dashing through the ever-encroaching clusters of obstacles. The result is a breathtaking flurry of twitch-gaming, a scramble to steady your disorientation amongst the hubbub, and a constant prayer that the sum of your skill and luck will be enough to overcome the odds that are so overtly stacked against you.Originally released on PlayStation Network for PS3, Super Stardust HD is the closest Sony's console has to a Geometry Wars. While the game lacks some of its rival's finesse, not to mention its narrow but deep design, perfectly pitched difficulty and always on-screen high-score challenge, it nevertheless holds its own, maintaining its position as the strongest shooter on PSN even 18 months later. But the move to PSP hardware, with its different control configuration, demanded tweaks: changes that will upset the muscle memory that fans have spent so long developing.The handheld's analogue stick still controls the movement of the ship, but 360-degree fire has been reduced to eight directions. Each face button, pressed on its own, directs your stream of fire toward that side of a compass. Used in conjunction with another button you can fire across the diagonals, but whichever way you look at it this is a noticeable limitation of the original's analogue precision. To help recreate the wobbly feel of 360-degree control, the developer's introduced a double-tap function that momentarily spreads the fire arc, while holding a button down will cause one of the three weapons to spin in a circle around your ship, and together these are neat concessions that reduce the sense of interactive devolution. There's certainly been a loss of aiming precision, but it would be a stretch for any player to blame death on the imprecision of the new control scheme, which is perfectly serviceable.The game's overarching structure is straightforward. Five levels represented by planets are each broken down into five stages, offering play 25 areas, which must be cleared in a set order. To begin with, only the first planet is open for play: you must clear all of its challenges before the next one in sequence unlocks. There is no opportunity to save your progress - the game follows orthodox shoot-'em-up rules requiring players to restart from the beginning each time - so progress is hard won, which turns out to be a good thing in an otherwise-slight experience. Almost all of the game's longevity comes from trying to inch your way deeper into its levels and the high difficulty throughout demands a perfected technique. If you manage to complete all five worlds in one sitting then the game, in the Raiden tradition, will loop back to the start at an even higher difficulty level."}