{"ref": "https://www.eurogamer.net/f1-2021-review-old-dog-new-tricks", "date": "26 Jul 2021", "game_name": "F1 2021", "text": "The headline news, really, is what hasn't changed. Having gained momentum over the years until it's become, for my money, one of the most complete racing game packages around, the most striking thing about this year's F1 game is that EA Sports logo when you boot it up, Codemasters having sold up to the mega-corporation earlier this year. Which is, of course, too recent for any real impact on F1 2021 (not that Codemasters needed any help with the more nefarious plans people commonly associate with new overlords EA - the podium pass and various pre-order bonuses of earlier years are present and correct here, and once again are thankfully completely ignorable). Indeed, the moving target of an F1 circus that's still weaving its way around the pandemic sees three tracks - Imola, Portimao and the all-new street circuit in Jeddah - coming as free post launch DLC. What's here, then, is familiar stuff.Then you have to factor in the fact this is a transitional year, both for the sport itself as it introduces the budget cap and braces itself for 2022's radical new cars, and for the series as it makes its debut on PlayStation 5 and Xbox Series S and X. Given all that, it's remarkable that Codemasters has managed to get the game out while the season remains in balance; even more remarkable still that they've done so while adding one of the more enjoyable new features in recent years. The Braking Point story mode leads the way when it comes to new features in F1 2021, and after some early misgivings and a few small bumps along the way it ends up landing rather well. This isn't the series' first attempt at a story mode (or Codemasters, as those old enough to remember Race Driver Grid will know) though after F1 2019 introduced a few of the key characters such as the dastardly Devon Butler in what felt like a throwaway effort this is a much more fulsome affair. Spanning two seasons, its many story beats told in handsome CGI cutscenes interspersed with cameos from familiar faces and voices, it's almost enough to justify the price of admission alone. What makes it work so well? To delve too much into the details would be to spoil it - and the fact there's a story I reckon is worth experiencing for yourself first-hand should probably tell you something  - but in the broadest terms possible what starts as a hokey tale of a sparky upstart works well to upend expectations, and it's helped by being a story grounded in the gossip and politics of the paddocks. The end result is more believable than the increasingly overstated Drive to Survive Netflix series, and I'm left hoping the follow-up that's gently teed-up comes to fruition. There are limitations, of course, and your agency is strictly limited. You pick which team you want to start young Aiden Jackson off with, then it's simply a case of hitting objectives - finish in the top five to help the team secure a better spot in the constructor's championship, or beat a certain someone by a certain lap - before kicking off the next cutscene. For all that you're a passenger for this particular ride, you're given a tour of the various features of the F1 series through the scenarios - having to read the skies for incoming weather when judging which tires to be on, dealing with the radio chatter of your engineer as they step in and handle one of the modern F1 car's many complex systems, or the simple thrill of going wheel to wheel with the superstars of the sport with an experience that's becoming harder and harder to distinguish from the real-life broadcast. If it's agency you're after you're more than amply served by the career's My Team mode, returning after its debut last season with a few welcome tweaks and tucks. They are minor tweaks and tucks, mind - a bit more busywork when you're managing your team's calendar, the ability to earn development points without having to drive through all the practice programmes yourself - but enough to ensure I was pulled through another full season at the helm of my own Team Lotus, weaving a compelling narrative of my own as I juggled spreadsheets, sponsors and dense development trees as well as the more serious business of ragging around a very fast racing car.There are problems here and there. One other new feature lets you pick up this year's championship at any point - great, I thought, as I wanted to take on the Mercedes fightback myself and see if I could get Sir Lewis his eighth title, but unfortunately that's just not possible. Instead, you sub out any particular driver with your own avatar, Quantum Leap style, rather than getting to play as your hero. Oh boy indeed. Elsewhere there are clunky bugs, some legacy features that should have perhaps been excised some years ago (can we please do away with the Telltale-esque dialogue choices at the end of each race?), and an inconsistent approach to track limits that, while faithful to the real-life FIA's wonkiness, makes me want to steer clear of any more serious minded online multiplayer. The classic cars of previous years are entirely absent this year, while once more there's no VR support - something of an oversight in a genre that lends itself so well to the medium. As in previous years, though, I find myself not that fussed as I find myself in the midst of another full career campaign, because F1 2021's not where I go to strap myself into a sim seat for hours on end. It's a couch game I've always enjoyed with controller in hand, the kind of flashy console racer we don't see so much of these days. It's a flashy thing on new consoles, too - I've been predominantly on PlayStation 5, repeatedly dipping in and out of photo mode to enjoy the ray-traced cars and admire the finer detail of Codemasters' work. The DualSense acquits itself well too, the right trigger amply communicating when you're about to break traction when gunning it out of a corner, the left trigger similarly letting you know when the front tires are beginning to lock. It's a pleasure to have a racing game so fully featured arrive on the new crop of hardware. There are faults that'll be familiar to long-time fans, and indeed the question whether series stalwarts will find enough new here to warrant the outlay. This is a modest update, then, but a mostly successful one. How exactly EA's influence shows itself in the future remains to be seen, but for now let's enjoy another dependably enjoyable, brilliantly authentic official F1 game."}