{"ref": "https://www.eurogamer.net/alice-madness-returns-review", "date": "17 Jan 2019", "game_name": "Alice: Madness Returns", "text": "All is not right in Wonderland. The Mad Hatter's domain has become a Communist industrial complex, where giant, living, unblinking teapots have been repurposed as parts of a rickety production line. The Walrus and the Carpenter have taken to performing in a slutty undersea cabaret that hides a gory secret. Worst of all, a massive train shaped like a cathedral on wheels is thundering through the world, leaving destruction and lakes of leathery tar in its wake.No, sorry, I got that wrong. Worst of all is that exploring Wonderland is, in practice, about as full of wonder as watching paint dry. Paint the colour of blood and dreams, but paint nonetheless.The first American McGee's Alice, released all the way back in the year 2000, was a passable platformer that was hoisted up and carried by its twisted Wonderland setting. The game asked, if Wonderland represents Alice's imagination and psyche, what would happen if Alice went mad?And so it told the grim story of Alice's family dying in a fire, and the poor girl continuing to hallucinate from inside a Victorian mental asylum. At the end, Alice quite literally hunted down and murdered her own madness and was released from the real-world asylum.Alice: Madness Returns sees Alice wandering through the streets of London and continuing to hallucinate, and a terrible evil arising in her mind once again. It's an evil that makes a little less sense this time around, but to say any more would be to spoil some of what little there is to be spoiled in this game. Madness Returns has a lot of problems, but they can all be summarised in a suitably nonsensical way: this game is nowhere near mad enough, and it's also not quite sane enough.Let's start with the latter: it not being sane and sensible enough.Simply put, this is just not a great example of ordinary, tried-and-tested game design. Each level of Madness Returns is broadly split into platforming segments, puzzles and combat. The level design of the platforming sections is fine, in the sense that you can and will jump from one floating platform to another without clipping through the floor, but it's mostly uninspired. Similarly, the puzzles are of that sad breed where they don't involve any actual brainpower - you'll find a lever or button, use it, and it will open up a new path through the level that will speed you onwards.There are plenty of tiny, hidden side paths throughout each level that reward curious players, but the rewards often aren't worth the time spent traipsing to get them. You might find a 'Memory', representing a tiny scrap of dialogue from Alice's history, and you'll probably find an arbitrary number of the teeth used to pay for weapon upgrades that may or may not justify your time spent getting to them. Weirdest of all, you might find one of the game's hundreds of bottles. I collected these with the eagerness of a boy scout until I realised that they served no purpose at all.Where Madness Returns does shine is in its combat, which offers polished, weighty action that can be tremendously rewarding on those occasions when you emerge from a crowd of enemies without a scratch.Each of Alice's weapons, which range from a Pepper Pot gatling gun to a deflective umbrella, is mapped to a different button. And while each fight is only ever as complicated as using the right weapon on the right enemy at the right time, things can get tense once you've got several different enemies all circling you. In what is either an homage to or a blatant theft from Bayonetta, Alice actually dodges by morphing into a cloud of butterflies, accompanied by a bit of slo-mo if you dodge at the last second."}