{"ref": "https://www.eurogamer.net/street-fighter-iv-hands-on-1", "date": "5 Jan 2009", "game_name": "Street Fighter IV", "text": "Playing Street Fighter IV on Xbox 360, we're trying to recall the last time we were so hyped about the release of a fighter. Enthusiasm grew during the build-up to Soul Calibur IV, as did our anticipation for Virtua Fighter 5 a year prior, but it's an age since a fighter has been so prevalent in actual office banter. With the console release of Street Fighter IV weeks away, the trash talk about who's going to rush down who has started to turn nasty. How we've missed it.Street Fighter IV is in some ways a step back to the basics of Street Fighter II - i.e. no air blocking and a single Super. But it also takes many aspects that made the latter games so exceptional in their own right, including the return of EX Specials. If anything, it has the potential to be the superlative Street Fighter experience, whether you're a Third Strike diehard or long-since Alpha 3 deserter. We're also impressed by how Capcom has taken its iconic Street Fighter roster and revamped it into the third dimension. All the characters retain the personality and edge that made them a hit in the early 90s, but are done in such a way that you forget Street Fighter EX ever happened. Street Fighter IV is for everyone - it just needs to finally Dragon Punch into everyone's living room.Visually, the near-complete Xbox 360 port we've played is seamless from the arcade original, and on a worthy setup impresses in equal measure with its unique cel-shaded styling as Hadokens and Flash Kicks are all executed with flair and fluidity. It's hard to see how Capcom could have done this better. As for controls, Capcom and Dimps have wisely kept the classic six-button setup rather than opt for Tatsunoko vs. Capcom's four-button approach. The 360 pad isn't the most intuitive interface for a 2D fighter, but with decent sticks already available this isn't a huge issue, and if you're not partial to sticks you can always look into a Street Fighter IV FightPad from Mad Catz, set to coincide with the release of the game. The closer this is to the Saturn Pad the better.Handling wise, Street Fighter IV will be immediately familiar to anyone who's ever pulled off a Shoryuken. Virtually all the Special moves are executed as you'd expect, with the staple charge and half-circle motions and everything in-between, and each character has access to a single, stock Super, and EX Specials, all accessed via the four-tiered Super gauge. Capcom also has a stab at a Rage gauge, here in the guise of the new Revenge gauge. Taking damage fills this meter and when it's over half full it can be used to execute an Ultra. These uber-Specials are usually accessed with the character's standard Super motion, but with three button presses rather than one. As both combatants often have a stocked Ultra as even bouts climax, things remain gritty and intense right to the finish - exactly as they should be in a good mind-games fighter.Anyone who's been following the build-up will also know that the console version retains all the playable characters from the arcade version: all eight original World Warriors, all four Street Fighter II bosses and the new bloods; Abel, Crimson Viper, El Fuerte and Rufus. Our build also gave us access to fan-favourite Akuma (unlockable in the arcade), Ryu and Ken's master Gouken, school-girl Sakura and boss Seth - the metallic CEO of Shadaloo's weapons division, apparently.Akuma, master of the Dark Hadou, has always been about pure Shotokan rush down. In Street Fighter IV he plays similarly to his Third Strike self, complete with his rolling jump attack and juggle-heavy Specials. He can now change the trajectory of his air fireballs depending on which punch is pressed and unlike Third Strike, he now has the ability to EX some of his Specials. He can still teleport out of danger in the normal manner but perhaps his most interesting change is the dual Raging Demons.A full Super gauge allows the mix-up master to use his signature death move the usual way, but should you fill the Revenge gauge enough, he now has access to a more deadly Demon. By pressing back instead of forward during the classic Shun Goku Satsu combination, Akuma teleports more swiftly and across nearly the entire screen. Should he catch his opponent off-guard, he drags them to hell for nearly double the standard Demon's hits. The problem is that the Raging Demon, even with effective Kara Cancelling, has always been a nightmare to connect against a pro, so initially it seems odd that Capcom's given players two versions of Akuma's trickiest Super - but with the Demon now executable in a fraction of a second and with a pair of options, players may have to consider that evasive jump or counter Super more carefully.When we first picked Gouken, we were concerned he'd just be another Ryu clone (we're aware of the irony) in an already overcrowded character style. Fortunately this isn't the case. As the polar opposite and brother of Akuma, following a non-lethal form of Ansatsuken, Gouken's fighting style looks like true mastery of a martial art compared to his students'. Whereas Ryu and Ken's fireballs look like an effort in chi manipulation, Gouken's come out in an effortless one-handed motion. Depending upon the button pressed, he can throw them straight ahead or vertically upwards - catching out a jumping opponent - while his EX version throws out forward and horizontal fireballs simultaneously, which is harder to evade."}