{"ref": "https://www.eurogamer.net/guinness-world-records-the-videogame-review", "date": "19 Dec 2008", "game_name": "Guinness World Records: The Videogame", "text": "Mini-games haven't so much fallen out of favour with contemporary gamers as plummeted to a grisly death on the spikes of their cynicism. WarioWare was a machinegun volley of microcosmic creativity (where we picked the snot from a wincing nostril or jumped a fast-approaching sausage on wheels), but since those magnificent beginnings, our overexposure to vapid copycats has made a dirty word out of mini-games. [If not two - Ed].It's also a dirty word that's synonymous with Nintendo's Wii. While WarioWare distilled gaming's first principles into five-second interactive sitcoms, other developers used the format to make a quick buck. Steal a few simple mechanics, skin them in a wacky theme, pour into a paper-thin metagame and bake for six months. It's a recipe for fast money. Hence Wii is now the poster-child for all that's cheap, insipid and misleading about casual gaming. Mini-game collections are scorned and shunned, just as, increasingly amongst hobbyists, is the Wii itself.The danger, as with all black and white views, is that we throw the baby out with the bathwater. Good games are good games no matter what their length, and short-form gaming can be a hundred times more compelling than the long-form epic that requires weeks and months of investment to fully reveal itself and its treats. Nowhere is this more apparent than with Traveler's Tales' Guinness World Records, a mini-game collection that's been bypassed by gamers at large (and the BAFTA review panel in small) even though it's home to one of the strongest ideas in gaming this year.Fittingly for a licence about finding the world's top scores, the triumph lies in its leaderboards. During every mini-game, your current score is displayed in the top left-hand corner of the screen, and below that sits the top score registered on the console so far. Pass that marker while playing, and the game displays the best score recorded in your region. Now you're fighting to beat Brian from East Sussex, or Bernice from Lancashire for the accolade of county champion. Pass them and you'll be gunning for national champion and beyond that, you're up against the world record holder.The genius is in the constant relevance. In most games the top spots on the global leaderboard are so out of reach that it renders the competitive element meaningless. What's the point in striving to record the fastest time at Nurburgring when your best efforts put you in sixteen-thousandth place? Guinness World Records makes every single high-score attempt matter, regardless of whether you're trying to beat your mum or the reigning world record holder Troy_Wondercluck from Illinois. Like Geometry Wars 2, which had the next-highest scorer on your Friends list on-screen at all times, beating your next rival is the only thing that matters.With such a compelling competitive element dominating the experience and inspiring repeat play, shortcomings in the mini-games themselves are diminished. Seeing how many cockroaches you can eat in a minute is stupid, but do it in front of cameras and a cheering crowd for a place in the record books and, for that moment, it's the most important thing you can do. Context trumps content."}