{"ref": "https://www.eurogamer.net/onimusha-warlords-review-samurai-royalty-returns", "date": "16 Jan 2019", "game_name": "Onimusha: Warlords", "text": "I'm only going to say this once, just to experience what typing these words feels like:People who were born when I played Onimusha Warlords for the first time are now old enough to drive. Or have they already been driving for a year now? See, I don't even know anymore.This feels necessary to point out, not to sound uppity, but because any look at a remaster is inevitably going to be coloured by the memories you have of the original. Simultaneously I want to acknowledge that some may not have these memories. For me personally, 2001 was a magical year in gaming. Maybe it simply was magical, crammed with releases that people talk about to this day, even if it's not always with love. 2001 was the year that the people in games started to look like people, long before SEGA and Quantic Dream made it a substantial part of their business to have well-known actors fight against the uncanny valley.It was always slightly more interesting to me to make pretend in video games with realistic surroundings, rather than journeying through bubblegum-coloured landscapes as a dragon or bear or what-have-you. This is why Onimusha grew on me immediately. It looked similar to Resident Evil 2, another Capcom game I definitely wasn't supposed to play at my age, with its pre-rendered backgrounds and a fixed camera that only shifts angles whenever you turn a corner. More importantly, Onimusha gave me Samanosuke Akechi. Samanosuke is modelled after and voiced by Taiwanese-Japanese actor Takeshi Kaneshiro, whose popularity was at its height in the mid-2000s. As a fan, being able to control what I thought was his spitting image was wondrous. And as a samurai no less, one that participated in the famous Battle of Okehazama! Look, I don't know what you were interested in when you were a teen, but a game built on the assumption that the famous feudal lord Oda Nobunaga wasn't actually killed at the battle at Honno-ji, but replaced by a powerful demon? It was the most enthralling concept to me.It is also a concept that you may entirely ignore, as the plot of Onimusha Warlords comes down to a curt ~save the princess~. Still, you get to save the princess from a horde of literally bloodthirsty demons in a Japanese keep, which is exciting. There is a high chance Onimusha's gameplay will feel familiar even if you haven't played it before. Capcom borrowed slightly more from Resident Evil than just the fixed camera angles and how they purposefully make it difficult to see what awaits you. Even with the new screen scroll feature, that much hasn't changed, but a bit of mystery keeps the game interesting. It's not a bug, it's a feature, especially now that analogue stick support makes it easier to turn back and prepare if you run into an unforeseen enemy mid-corridor. There are also a fair number of puzzles to break up the hack-and-slash combat. Some of them amount to finding documents with hints you can then use to open locked treasure chests with, but now and again you come across the odd pressure plate, lever, and machine you need to activate using one of your special skills. At some points you control Samanosuke's friend Kaede, a female ninja. Onimusha also works with limited resources. You need to search the keep for arrows for your bow, and healing herbs are as precious as they are rare.In order to defeat the horrors that have taken over every inch of Inabayama Castle, Samanosuke is bestowed with the power of oni, Japanese demons, which allows him to absorb the souls of successfully defeated enemies and use them to upgrade his weapons and the magical crystals that grant him special element-based abilities. Looking at it now, it's disappointing that Onimusha never took the time to explore the paradox of a human choosing to become one of his enemies in order to defeat them. The way it is, Samanosuke's special powers remain a gameplay gimmick, one that can feel a little stale now that different weapons and the accompanying powers are such a hack-and-slash mainstay.Even today, the combat and movement animation in Onimusha is fairly astounding to me, as this combat style is the grandfather, brother and cousin of many great games. The combination of a quick attack, blocking and parrying, all while keeping your enemy's specific set of movements in mind makes Dark Souls, Devil May Cry and others like them such fun, and it worked well in Onimusha, too. The blades all feel slightly different, another thing you now might simply take for granted. There is a real fighting style behind Samanosuke's movement. It's not simply hacking, but a set of precise, economic moves  to counter monsters that swing and slash wildly, the very definition of fighting dirty.Over time, Onimusha Warlords has simply been superseded by better games and better technology, which becomes especially apparent when you compare it to a game from its own ranks - Devil May Cry, released just a few months later. It's still a fun game, but one that I appreciate differently to when it was first released. For one, I find it incredibly appealing that at 5 hours, you can play Onimusha in one sitting. It's now out on Switch, too, which makes it the perfect little game for a set of flights within Europe or a standard train journey using Southern Rail. Having played more difficult games in the meantime, it's also become one of few games of this genre that doesn't feel as punishing as it used to.Onimusha could have used  a complete remake rather than what comes down to a slightly enhanced remaster. Not every game ages equally well, and Onimusha simply looks and feels slightly old. With Sekiro on the horizon, I'm not as disappointed my favourite samurai adventure doesn't get the second lease of life it deserves, but Onimusha Warlords now feels more like an appetiser for other games of 2019 and a nostalgic trip back to 2001 than the title I considered unmissable all those years ago."}