{"ref": "https://www.eurogamer.net/city-of-heroes-issue-13-hands-on", "date": "11 Dec 2008", "game_name": "Reviews", "text": "As updates to fading MMOs go, a feature that rewards you for not playing stands as one of the odder ones. City of Heroes' European servers are already the wrong side of desolate -  so exactly how is encouraging players  to stay offline going to help? Cuts down on server costs, maybe.Day Jobs are the headline feature of the 13th major update, or Issue, for City of Heroes, subtitled Power and Responsibility. Thematically, they're a splendid idea - the perfectly comic-book concept of a secret identity for your beefcake powerhouse, and the idea that he/she/heshe/it is doing something useful with all the time you're offline, other than wilfully  ignoring his sworn duty to Paragon City. Call it Clark Kent mode. Pick the location where you log off carefully. If it's one of several hotspots - for instance, a hospital or metro station - you'll be deemed to have adopted a career. As you spend time offline in that location, you'll build up a bonus of some sort. For instance, ducking out at a metro station adds every hour until you next log on to your Commuter job - which rewards you with a movement speed boost. Presumably the more accurate 'gradual loss of will to live' wasn't considered the cheeriest reflection of commuting. Essentially, it's like WOW's rest system, but far more playful and a lot more use to people who aren't chasing XP any more.Clock up enough offline hours in a Career and you earn one of the many badges that have made City of Heroes a faintly absurd achievement-fest for the last couple of years. As well as granting you yet another option for the tiny title floating above your gloriously garish character, this further increases the buff earned by those offline hours. Given City of Heroes' need for an influx of new players, Day Jobs end up being a particularly odd feature, reflective of both City of Heroes' continuing shift towards the statistical over the fantastical, and of NCsoft's apparent unwillingness to make sweeping changes to the structure of an MMO that's never managed to break out of its combat-only mould. Day Jobs are something that fits neatly and easily into a pop-up textbox and a glowing icon; there's nothing more to them than that. It was an opportunity to insert new personality into the game - whether that was by designing a specific secret identity outfit (though there are some new civilian costume pieces in the character creator if you want to manually go with the fiction), animations of offline heroes wandering around their logout areas in unconvincing disguises, some sort of odd mini-game... Instead, it's just an icon.That's characteristic of this update. It's not like it's filler, but it's tidying up the old house rather than redecorating it. The next one, Issue 14, promises to be far more profound - its major shtick is a mission-building tool, which will hopefully reinforce City of Heroes' status as the king of self-expression in MMOs. For now, the other big change is dual-speccing.As City of Heroes players will know, every character chooses a core class with its own abilities, which they can optionally augment with Pool Powers, which are available to everyone.  The powers most useful in groups and in PVP are the least interesting, so only the most steely-jawed team player opts for them. With the new dual builds system, a visit to any trainer can immediately switch your guy over to a secondary set of powers and enhancements."}