{"ref": "https://www.eurogamer.net/the-king-of-fighters-the-orochi-saga-review", "date": "11 Dec 2008", "game_name": "The King of Fighters Collection: The Orochi Saga", "text": "The King of Fighters series was once staple fare for hardcore 2D fighter fanatics. During the mid to late nineties, Capcom's CPS-2 arcade board was far more popular in the arcades than SNK's own Neo Geo MVS board. Anyone who could afford the Neo Geo AES home console, let alone the GBP 100+ price tag of each new game, had to have a real passion and a high disposable income. But for all those gamers who looked for choices beyond the sublime Street Fighter Alpha and Marvel vs. Capcom series, The King of Fighters games offered something familiar - with a fresh twist all their own. SNK Playmore has already released the King of Fighters: 2000 & 2001, 2002, 2003, XI, Neowave and both Maximum Impacts in the UK. With The King of Fighters: The Orochi Saga, the publisher seems determined to port the bulk of its long running King of Fighters series to the humble PS2. For those who've never experienced one of the many updates to the original KOF formula, imagine a fighter with similar fundamentals to Street Fighter, but without the medium attacks, and with a three-on-three tag system thrown in. This last difference changes the dynamic most as you have to master three fighters rather than just the one. Fights can last as little as three rounds or as many as five. The first game in the series, The King of Fighters '94, was a crossover fighting game borrowing characters from SNK's rich history. The player could choose from eight pre-determined teams of fighters and faced off against boss Rugal Bernstein. Rugal started a trend in the KOF series of notoriously overpowered bosses who are hard to take down.KOF '95 and '96 followed, but there were no radical changes. King of Fighters '97 introduced the first major step in KOF mechanics; the player had to choose between an Advanced or Extra play system. Advanced catered for a faster rush-down style, whereas Extra was intended for players who liked to fight defensively, relying on lots of specials. KOF '97 also marked the end of The Orochi Saga. When SNK released The King of Fighters '98 The Slugfest, they created a non-canon game which brought back virtually all the characters from the previous titles. They also introduced a new Advantage system to help out players who lost one of their three fighters. It was this King of Fighters title that that really made people stand up and take an interest in the series. Many fans would also say it's the best one. We'd disagree in favour of some of the later games, but for its time KOF '98 a reasonably well balanced for a 2D fighter. And there's no denying it was a blast. Much like Street Fighter Alpha Anthology, The Orochi Saga uses ports of the original games. The game automatically sets the display to 50 Hertz upon boot up, cutting off the bottom of the screen when fighting. As most of today's tellies can handle a full 60 hertz single, we strongly urge you to change this in the options straight away. In 50 Hertz mode, not only is the game slower, but the input times for quarter circle motions in KOF '96, '97 and '98 are painfully unforgiving.Colours are vibrant but there's a screen filter that doesn't seem to be removable. It's certainly no where near the graphical atrocity that was the PAL PS2 port of Samurai Shodown V, though. In 60 Hertz we found the controls to be responsive when playing the KOF games with a PS2 pad, and were able to pull off Super Cancels and Combos with relative ease.To add some variation, SNK Playmore has also included Challenges Mode. Here the player can choose between 20 challenges all set in KOF '98, ranging from easy to medium and hard. These are a mostly superfluous distraction and can be completed without too much trouble, but success does unlock some interesting Artwork and Soundtracks in the Media section.The main problem with The Orochi Saga is that most people who buy and appreciate it will probably spend most of their time with KOF ‘98, as it is by far the superlative fighter in this compilation. We'd have preferred a compilation that gives classic 2D fighter fans some real choice. After all, the PS2 NeoGeo Collection has done very well in Japan - the 12th edition is now on the way, complete with excellent ports of Garou: Mark of the Wolves and Waku Waku 7. Or why not take KOF '98 alone and give it an update, as has been done with Super Street Fighter II Turbo: HD Remix? In fact, SNK has already done this - but The King of Fighters '98 Ultimate Match, as it's titled, is only available in Japan. Come on, SNK, stop churning out ports of stuff we've seen a million times, and give European fighter fans the game they really deserve."}