{"ref": "https://www.eurogamer.net/the-legend-of-spyro-dawn-of-the-dragon-6-2", "date": "9 Dec 2008", "game_name": "The Legend of Spyro: Dawn of The Dragon", "text": "So then. Spyro. If you've got even this far, chances are your mind recalls the golden days of Spyro's reign on the original PlayStation. Days spent in a colourful platform world of gliding dragons, cutesy combat and endless collection. Well, shame on you for living in the past, you Luddite. Spyro has moved on. All that childish fun, charm and enjoyment have been replaced by A-list voice talent, a set of brawling moves and a shiny new suit. But at least he has indeed moved on. This is the first Spyro title to let you to fly around freely, so you can forget the hamstrung flapping of previous titles. And it's enjoyable, it really is. When you first emerge from the caverns of the early game into an open valley hub-world, you'll find it hard to resist wheeling through the SEGA-blue sky and diving amongst the insects, spores and seeds floating about. There's a real sense of freedom, especially as you've just escaped the confines of fiery catacombs; in fact, it's a genuine 'ooh' moment akin to taking in the first vista of Cyrodil or Washington in Oblivion and Fallout. There's not quite the same sense of epic scale - after all, the valley is only the size of your average settlement or catacomb. But for a moment, it feels as though what you might have been expecting to be a medicocre title could turn out to be something truly beautiful. For a moment. Up to this point - which occurs about 30 minutes in - we'd been pleasantly surprised by elements such as the depth of the combat system. It's a sort of low-fat Devil May Cry affair with an unnecessary amount of moves and combos, and you can grapple, juggle and spin your foes to death in a pleasing variety  of ways. Of particular note are the grabs, pulled off with a quick stab of the B button, where Spyro or nemesis-turned-ally Cynder grab a nasty in their jaws and shake it to death like a kitten in a tumble-drier. These moves are accompanied by a sudden drop in game-speed which we're still not certain is 100 per cent intentional. The frame-rate fluctuates so wildly at times that it could simply be a product of overcrowding.  The slowdown gripe is compounded by the sheer complexity of many of the battles. Often you'll be facing seven or eight brightly coloured enemies who all have attacks accompanied by some form of flashy effect. Throw in your own slickly animated rolls, slashes and bursts of flame, plus contact flashes and death animations, and the battlefield quickly becomes an uninterpretable mess. When you're up against a particularly fancy gang of foes the whole thing becomes a juddering free-for-all; it's like Jackson Pollock has just eaten the soft toy section at Hamleys and is vomiting into your eyes. This is a real shame, because otherwise combat is tremendously satisfying. Combos are instinctive and solid, blows really seem to carry weight and the elemental fury attacks are excellent. Combat is something you'll be doing a lot of, so it's nice to see that the effort's been put in, but technical difficulties make it much more of a grind than it ought to have been."}