{"ref": "https://www.eurogamer.net/killlzone-2", "date": "4 Dec 2008", "game_name": "Killzone 2", "text": "It's hard making the sequel to a classic, but it's probably harder making the sequel to a game that everybody expected to be a classic. Guerrilla's Killzone had distinctive World War I-inspired art, authentically creepy enemies, and pre-release claims of revolutionary squad AI, yet the game never delivered on its obvious promise. Its grey trenches brought heavy-handed railroading along with their stylish claustrophobia, and the designer baddies combined a conspicuous lack of street smarts with annoyingly long health bars, which saw them absorb a wearying number of bullets to the chest before eventually collapsing.As a basis for a sequel, the best you can say is that it leaves the developer with plenty of areas to work on. Add to that the high-profile ~target render~ trailer shown at E3 2005, Guerrilla's relatively new first-party status, and some heavily-entrenched competition, and you can see why the Amsterdam-based developer is currently rushed off its feet, working around the clock to make Killzone 2 perfect.But right now, no-one's rushing around. Frozen in time on a developer's monitor, one of the game's grim cityscapes is a picture of calm. A lone figure hangs in mid-air, ducking incoming bullets that are paused in the act of chipping away concrete, while behind him, oppressive high-rises stand out against a darkened sky. Like most sci-fi, Killzone 2's future is heavily in debt to Blade Runner's sodium-lit Los Angeles, but there's a hint of the sheerness of Robocop's Detroit too, simultaneously sleek and filthy.A closer look reveals a wealth of finer details: the concrete's cracked and scarred, and the buildings are wedged haphazardly against one another, covered with tin bandages and broken windows. There's time to notice a few more niceties - how good the textures look close-up, or the sad puddle of water in the middle of the street - and then the developer presses the pause button again, and the quiet city turns into a brutal hell, filled with shouting, gunfire, and distant lightning.Textures, effects, lighting: Guerrilla is eager to start our tour of its Amsterdam HQ with an exhaustive look at the company's technology. This, after all, is where this team feels most comfortable, and as a result the studio almost hums with electrical energy. All day long, people have been telling us that just to give ten journalists hands-on time without fusing the entire neighbourhood, a dozen members of staff have been sent home early. It sounds like a witty piece of PR nonsense, until the Killzone 2 presentation kicks off with slides showing massive petrol-powered generators being craned into Guerrilla's back garden during pre-production. After that, nobody's so sure they're being joked around anymore.One thing you can be sure of is that Killzone 2 is a very pretty game. Guerrilla's in-house engine uses deferred rendering, separating its various filters such as motion blur, film grain and bloom onto six of the PS3's SPUs, to create a cinematic blend of visual effects without damaging the frame-rate, while the art department is focusing in on the design details that will help tell the story. Weapons and vehicles both play their parts in differentiating the two warring factions, from the nasty, wooden-stocked, rusting guns and predatory aircraft of the Helghast, hinting at a society that's both brutal and stagnant, to the slicker, cleaner rifles of the ISA, whose tanks and planes resemble existing military technology that's just been nudged forward a few years.By and large though, the real polish is being applied to the environments. Guerrilla's first game played out in a muddy warren of swamps and corridors, but the sequel takes the fight back to the Helghast's home planet. Killzone 2 tells an unusual war story, then: you're not the underdog anymore. In fact, the ISA are now all but victorious, zeroing in on the last enclave of a weakened enemy.~We knew the Helghast are fascist and wanted that to be reflected in their world, but we didn't want it to be too big and rich, so we made it cramped and dirty: China or Moscow rather than Berlin,~ says art director Jan-Bart Van Beek. The results are a cobbled-together futuristic slum, a decaying urban sprawl that threatens to spill apart. Rather than streets, the levels flow through empty concrete riverbeds, and there are signs of oppression and neglect everywhere.But the game's in no danger of becoming samey - the city we've seen already isn't the only environment, and the rest display a surprising range of styles. A later visit to a forgotten Helghast outpost features carcasses of industrial buildings constructed from the bones of the spaceships that first landed there. The inspiration lies with Pakistani ship-breaking wharfs where boats are stripped for parts, and while it means yet more factories to plod through in a first-person shooter, these have a haunting, mysterious quality that makes them different: a mixture of the sad, the brutal, and the gently exotic. And in every location, the toxic variety of Helghan is always present. In the game's fiction, the planet's polluted atmosphere is itself a Class III toxin, and the ravaged weather system's lightning flashes and dust storms seem likely to have an influence on the level construction."}