{"ref": "https://www.eurogamer.net/bury-me-my-love-review-strength-spirit-and-life-as-a-syrian-refugee", "date": "10 Jan 2019", "game_name": "Bury Me My Love", "text": "When we are invited to punch reporter Khalisah al-Jilani in Mass Effect, BioWare's messaging is not subtle as a crimson renegade symbol flashes at the bottom of the screen. While undoubtedly a choice - and one entirely at our own discretion, at that - it's clear: this action will have detrimental consequences. Things are not so black and white in Bury Me, My Love. A text-based interactive novel - named after the Syrian farewell phrase that translates roughly into ~take care, and don't even think about dying before I do~ - Bury Me doesn't offer such polarising choices, which means - at least to begin with, anyway - it all feels a little bit arbitrary. I agree with my wife, Nour, and suggest she pick option A, not B, whilst preparing for her journey. I disagree later on, though, insisting she buys item C and not D from the market stall. Later still, I insist she follow fellow refugee E and unceremoniously leave character F to fend for themselves. The choices initially make me uncomfortable, because I know as only a gamer can they may come back and bite me on the arse - we've all played Telltale's The Walking Dead, right? - but I'm not getting the faintest glimmer of foreshadowing here. I later learn there isn't a right or wrong way to play this. There aren't any explicitly 'Good' or 'Bad' endings (although some are harrowing enough to be categorised as the latter, believe me). And half the time Nour doesn't even bloody listen to me, anyway. Initially, however, I click through choices a little lazily. I absently wonder if the game automatically routes your story so that whatever choice you make, it'll be the wrong one. Choose a lifejacket instead of extra bottles of water, and there'll be no fresh source on the boat. Spend precious resource - and backpack space - purchasing a lifejacket, though, and perhaps you'll get to the boat and realise they have several spares. I also have no life experience on which to draw from to make these decisions, either. I don't know how much money is needed to smuggle oneself illegally into another country, or the kinds of things a refugee should be squirrelling away in their luggage. I have no idea what to do if I was illegally detained somewhere. Which is the whole point, of course.Told purely through exchanges via a What's App-esque message app, you ~play~ as Majd, a husband stuck working two jobs, while his wife, Nour, attempts the treacherous journey from Syria to her preferred place of refuge, Germany. It's subtle storytelling at its very finest, and while it's tempting to assume a mechanic such as this could become tedious, the game's truncated length means it sincerely doesn't outstay its welcome. It's also stuffed with warmth and genuine charm, complete with emojis, autocorrects, and the occasional selfie, too. Most of the time you're merely an observer, but occasionally you'll step into Majd's shoes and decide how best to advise Nour, boost her spirits, or sometimes do as little as just send an encouraging emoji. It's a testament to Bury Me's thoughtful writing that my own gut-reactions to Nour's quandaries were often available to me on the screen, a feat that only served to strengthen my connection to Nour... and devastate me when, all too late, I realise how wrong my advice had been.It's a curious thing, though. On one hand, Bury Me expertly retells the harrowing plight real refugees face every day, unravelling this story via warm, relatable characters so that it truly - if only briefly - puts us in the shoes of those directly affected by conflict. On the other, it gamifies this heartbreaking experience, wrapping it up in a game with 19 different endings, tempting you to undertake multiple replays.I don't know why this troubles me so. While refugee experience has been undoubtedly been hijacked by some politicians to demonise desperate people in devastating need, Bury Me, My Love reminds us that each one of the faces our 24-hour news channel pans over is someone's child. Someone loved. A real person. They sacrificed so much to get here; made tough decisions, and left loved ones behind. I know delivering a one-time-only gaming experience with no chance to replay or explore alternate routes is itself problematic - not to mention grossly anti-consumer - but to offer multiple endings (which each require a full replay, incidentally, as there's no opportunity to save-scum)... it makes me uneasy, I guess. After all; the real-life Nours that sit at the heart of this story don't get the chance for a do-over. Why should we? Translating Bury Me's achingly good premise onto the Nintendo Switch hasn't been faultless, either. Whilst the mobile version plays out in real time - sometimes leaving you without resolution for several agonising hours - these real-time cliffhangers have been removed for the Switch and PC. This takes away one of Bury's Me strongest and most effective storytelling techniques, wholly to its detriment. On Switch sometimes you'll see the time cut-scene move on by only a couple of minutes... leaving you to wonder why they even bothered with the cut-scene in the first place.The text is tiny - painfully so - and whilst you are able to enlarge it, and even rotate the screen so your Switch essentially becomes a Plus-sized mobile device, I often found the touch-screen options flakey, or sometimes missing completely, forcing me into using a Joy-Con at a 90 degree instead. Twice, my game crashed and shut completely, forcing me to select an alternate dialogue option. Not ideal, particularly as I have no idea if that decision would've led to an altogether different outcome. It's an incredible experience, though - incredible, and incredibly difficult, too. Difficult to watch, difficult to choose, difficult to know what the hell to say when Nour's funds are depleted and you know she's running out of options. Your story will end with one of 19 voicemails, some of which are heartbreaking. It's astonishing, really, how much developers The Pixel Hunt and Fig have made me care about Majd and Nour in such a ridiculously short space of time. Knowing this is based on the real struggles of refugees only makes it worse. The strength it takes to up and leave your entire family - your entire world - behind in the hope of securing a safer, happier future elsewhere when there are so many variables... well, before Bury Me, I wasn't sure I had such strength. Now I'm certain I don't."}