{"ref": "https://www.eurogamer.net/crash-bandicoot-mind-over-mutant-9-7", "date": "1 Dec 2008", "game_name": "Crash Bandicoot: Mind over Mutant", "text": "You know that aunty? The one who hands you your Christmas present with an earnest smile, so you can't help feel she's tried, and then it's almost like she's gone back in time and got you what was cutting edge ten years ago, like a Global Hypercolour Power Ranger, or a Pikachu yo-yo? Well, Radical is your aunty, and Mind over Mutant is an S-Club Seven polyphonic ringtone.Following on from Crash of the Titans, the big idea is 'jacking' the titular mutants, hulking brutes of various flavours under the control of serial antagonists Cortex and N Brio. Each Titan has a special ability, and once jacked these allow you to progress along previously obstructed paths toward your goal, upgrading them with Mojo collected along the way - found in the rubble of objects and enemies - in a process sped along by building a multiplier via consecutive hits, reset when you die.Initially there's a sense of reassurance - the brightly coloured glowing orbs are there to be obsessively collected, the rickety looking platforms fall away after a few seconds' resistance, and the switches beg to be switched. Radical has presumably been told to produce an accessible, by-the-numbers colourful platformer with broad appeal, so that's no surprise, but it is nice to see this much character and humour on top, like the delightful, stylised cut-scenes - pastiches of everything from South Park to Japanese noh theatre.Then of course familiarity becomes contempt and all the cut-scenes in the world can't stave it off.At its best, Mind over Mutant is a sort of Tomb Raider lite. Crash has enough attacks and abilities at his disposal to keep the combat and ledge-grabbing fresh, but once you're more than a couple of hours in the facade crumbles to reveal a game we've all played before, probably some time ago. There's an ice level. A desert level. A spooky level. An industrial wasteland. There are fiddly, multi-stage boss battles that put you back to the beginning when you die. There are even invisible walls.It feels like a rebranding of so many conventions that there's no compulsion to see it through. Despite the other nice touches, like the levelling up and the quirky, amusing voice samples, Crash fails to innovate where it matters, and given the leaps and bounds platforming has taken in the last five or ten years, it's inexcusable.Not far into the game, for instance, you're asked to retrace your steps to a previously explored area to clear an immovable obstruction. Fine, you might think, backtracking and repetition are common, except here it's taken to extremes. Often levels feature one-way branching paths, so if you go the wrong way you'll have to grind your way through a section you've already completed to return and take the right branch, and there are sections where simply falling off a ledge forces ten minutes of replay.The mission log doesn't help either, offering a one-line description of where to head next with no real indication of how. Miss a line of dialogue and you can be left wandering up and down the same stretch with no real idea of what's expected of you, or going round in ten-minute circles.Worse than that, though, is the camera. It's fixed behind Crash like a shadow, except it doesn't turn like one. Or at all. Plenty of times you reach for the right stick to peek over a precipice, or around a corner, only to remember this isn't a grace the game deigns to allow. You're stuck with a single perspective, which makes the prominent trudge back and forth a nightmare of leaps of faith toward unseen platforms and enemies, as jumping toward anything not conveniently aligned to a cardinal direction is tiresome and speculative.If you've missed out on a decade of new ideas and developments, or you really need to blow away the greying cobwebs of a dozen gritty shooters, then Crash is four or five hours of enjoyable, low intensity fun - the colourful, ill-fitting Hear'Say pullover of the platform stable. But with so many better alternatives on offer, it's not an experience we'd recommend."}