{"ref": "https://www.eurogamer.net/gti-club-hands-on", "date": "30 Nov 2008", "game_name": "GTI Club+", "text": "It's a double dose of nostalgia, this: GTI Club + is a retooling of the 1996 Konami arcade cab, and doesn't shy away from the electric blues, burbling jazz-funk and reedy voiceover exclamations that will send you straight back to somewhere sticky-carpeted on the seafront. But GTI Club was hardly aggressively contemporary back in its day. The racer had a selection of classic hot hatches scrambling around the back streets of a breezy Cote d'Azur resort, in a throwback to The Italian Job and the 1960s heyday of the Monte Carlo rally.It's also remembered for something a little more forward-thinking. In place of standard circuit or point-to-point racing, GTI Club's checkpoint system offered relative freedom to duck, dive and shortcut around the streets of its compact open-plan town. The handbrake was critical to throwing its cars into sudden, tight corners, and the light, sharp handling of the cars just as crucial to dodging the resort town's smattering of traffic. Frantic and unpredictable, GTI Club was a minor classic of its day, but it never got a home version.So it was with some interest that we learned it was coming to PSN courtesy of Konami Europe and Sheffield's Sumo Digital. Sumo was responsible for the brilliant home versions of SEGA's OutRun 2, which not only treated Yu Suzuki's freewheeling masterpiece to a perfect conversion, but fleshed it out with a creative and expertly judged suite of extra modes and a mercilessly addictive, spoonfed stream of fan-service unlocks. Can they repeat the trick for an older, lesser-known game - and for GBP 9.99?Understandably, GTI Club + isn't quite on the same scale. The biggest change in the last 12 years is naturally the graphical upgrade from the cheerfully blocky original to a pin-sharp 720p presentation running at 60 frames a second. The car models have been completely overhauled, and are nicely detailed, with a slightly plasticky Matchbox look that isn't out of keeping. The town itself hasn't had the same treatment and shows its plain low-poly roots more clearly, but again, that's not really a problem: Sumo has kept a careful balance between modern standards and an excitingly brash, retro look.You get a choice of five cars, expanding the original's line-up of timeless pocket rockets: the Mini Cooper (the proper one), the Fiat Abarth, the Mk1 Golf GTI and the Renault 5. They come in standard rally colours, but Sumo's added some basic customisation - you can change paint jobs and take your pick from a choice of decals, as well as choosing your horn sound. They all drive much the same, but that's beside the point - it's all about picking your own particular flavour of old-school tearabout cool. We're promised more ~vintage and modern~ cars, but it's unclear what they'll be, or how they'll be unlocked, from the preview version.We were also unable to test the game online, but we know that you'll get standard race modes for eight players, plus the self-explanatory Bomb Tag which will give all players full freedom to roam the town. There's no split-screen. In single-player mode you get easy, medium and hard races, which progressively increase the strength of opposition, amount of traffic, complexity of the course and your freedom to take short cuts or more outrageous diversions, balancing your race position against the need to top up time remaining at checkpoints. A ~Sat Nav~ system (a map and some on-screen hints, basically) has been added to help you keep track. There's also a free roam mode, and replays.For those who really miss the arcade cab, you can even make believe you're using a wheel with by enabling the Sixaxis motion sensors for steering. This works well enough, but doesn't really suit the game's tight handbrake twists and hard turns. You won't stick with it for long, but it's nice to have the option. Another PS3 twist is PlayStation Eye support, allowing players to see each other online.Bells and whistles aplenty, then, but in terms of game modes, GTI Club + just barely merits the +. It's a fun game in short bursts, and the tight town layout remains an interesting, one-of-a-kind racing challenge. But the lightweight handling really misses the extra verve of the arcade cab controls, and the collision detection in particular hasn't stood the test of time - fixing this might have been more important than adding piles of tyres and boxes you can knock over.There's not much here to hold you in single-player as it stands, although Konami is promising to expand the game with downloads in future. We'd certainly hope to see some creative new game modes designed around the original game's basic elements, something OutRun 2 showed Sumo to be more than capable of. In the meantime, GTI Club + will live or die by its online multiplayer; eight-player races must have been an extreme rarity in the days of the original arcade game, and they ought, by rights, to be a hectic hoot. To find out how this side of the game shapes up, you'll have to wait for our review."}