{"ref": "https://www.eurogamer.net/far-cry-2-1-6-9", "date": "28 Nov 2008", "game_name": "Far Cry 2", "text": "~The enemy team has something I want,~ booms the thick, African accent. ~Bring it to me.~ And with that the match begins. My whole team sprints out of our headquarters and into the courtyard, and I clamber into the driver's seat of the huge, factory-fresh Jeep waiting for us. I take a glance at my map of the town as the engine turns over, and... and watch as everyone else on my side jogs off down a dusty street towards the enemy HQ, oblivious to the dirty great cars parked outside our base. Some things never change.Having had the chance to fool around with Far Cry 2's multiplayer for a few hours, a couple of things are immediately obvious. First of all, it's about as solid an online FPS as you could hope for. It's slow enough to require a nice mix of cunning and reflexes, the weapons are fairly tactile and there's a good balance between guns, knives, grenades, vehicles and fire that'll have you using all five depending on the situation. The other impression I got is that it really is kind of conservative.For those unawares, here's a rundown of the options available to you: up to 16 players can go head to head playing either Deathmatch, Team Deathmatch, Capture the Diamond or Uprising. Capture the Diamond is capture the flag with, well, diamonds, and Uprising is sort of like if a Battlefield game got VIP mode pregnant on a holiday in Africa. One player on each team is designated captain, a position that comes with a little beret and a stern expression, and only they can capture the points scattered around the map. Once one team holds all the points the other team stops respawning, allowing you to kill their captain permanently and win the match if he can't nick a point back first.It's a nice idea, and it coughs up some interesting options. Do you protect your captain or go hunting for theirs? What about defending points you've taken? And since each team can obviously only ever try and capture one point at a time (only one captain, see), you get this sub-game of trying to figure out where the enemy captain will try for next. If you can figure that out and take him out in a suicide attack, that'll set the whole enemy team back a minute or two. Even more if someone's gone round and blown up all the vehicles at their base, or better yet left them one car and stuck an IED underneath it.But beyond Uprising mode the main thing that's going to catch a jaded multiplayer gamer's eye are some of the same features that make Far Cry 2 an interesting offline shooter. Specifically, the need to hit a button after you take damage to pull out a bullet, smother a fire or fix a finger that's somehow ended up pointing backwards, and also the chance to help up downed allies, Gears of War style.It did seem a lot less forgiving than Gears though, since everyone was always calmly executing downed opponents who weren't instantly killed by a rocket or high-calibre bullet anyway. And then finally you've got the ability to set things on fire, which is both less and more useful than you might think. It can be really tricky actually finding something you can burn, for instance, and even then a lot of stuff can take a while to actually catch fire, but despite all that the ability to wall off entire chunks of the map shouldn't be underestimated."}