{"ref": "https://www.eurogamer.net/gris-review-an-evocative-ethereal-experience-you-dont-want-to-miss", "date": "10 Jan 2019", "game_name": "Gris", "text": "I've been staring at the cursor flashing on my screen for a while now, silently aggrieved by its cheerless, eyeless blink. I'm perilously close to my deadline, but I'm trapped in a mindless cycle of typing, hesitating, reading, grimacing, deleting, and starting over. What I want to say about Gris isn't coming to me in fully formed sentences; it's just snatches of sentiment coming in dreamy, ethereal wisps, a warm, gloopy mess of incomplete sensations and emotions. There are disparate words I can use - soft, delicate, fragile, beguiling, soothing, melancholic, hypnotising - but strung together like that, I know they're unhelpful. I know I'm not making much sense. Which I guess is kind of fitting because, on paper, Gris doesn't make much sense, either. My god, it's beautiful, though; beautiful to look at, beautiful to listen to, beautiful to play, although in truth, Gris isn't played as much as it's experienced. I know; I don't like it when people say that in reviews, either. But for every hundred words I type here, I can show you a screenshot that'll instantly convey so much more. It's a truly masterful blend of form, flair, and function pinned in place with languid visuals, an evocative journey that sends you spinning through a story that never says a word. Gris is a barely-there tale balanced on delicate mechanics that should, in essence, be dull to play but somehow isn't. Initially, this world is cold and inhospitable, bereft of life and colour, hence its name ('gris' is Spanish for 'grey', Google kindly informs me). Sadly, so is our titular protagonist, too. Each step is sluggish, her pain physically and spiritually weighing her down. As she explores, however, she'll grow, unleashing life and colour in her wake and learning how to embrace twists and turns that ultimately lighten her steps and set her free. Her dress - apparently a manifestation of her sorrow - is the core mechanism at play here, able to transform into a solid, meaty block to keep her grounded in high winds, or perhaps send her hurtling skyward when the right wind is behind her. Like Bayonetta's hair-suit-thing it's an odd conceit, and admittedly not one I fully understand, but to be fair, you don't need to understand it to know how it works.And, no, I didn't know who artist Conrad Roset was before Gris, and what I know about expressionism extends only to the Wikipedia page I skimmed half an hour before I sat down to write this. But my fear that Gris would be another terminally dull experiment that fused stunning design with half-arsed gameplay is entirely unwarranted. Nothing in it feels unpolished or unfinished, and yet it's entirely accessible, too. Gris is a complete game in all senses of the word, and whilst its three-ish hour run time is admittedly a tad short, it's satisfying in a way few games really are, packed with traditional gaming mechanics - platforming, puzzles, boss fights, special abilities - that are presented in a fresh yet familiar way.It's ostensibly a puzzle platformer, but it feels wrong saying that, as though I'm holding an orchid next to a petal-shaped cookie-cutter and insisting they're one and the same thing. While it does have elements of platforming - climbing and ascending and timed jumps, your ascent becoming increasingly more complex as the game progresses - Gris never feels like it's about the destination. There are puzzles, yes - and at times, towards the end of your journey, some of them require fairly complex finger gymnastics - but they strike a careful, clever balance of being neither boring nor frustrating. Like everything else Gris offers, the puzzles and platforming are carefully polished parts that somehow contribute to a greater, softer, inviting whole, and knowing that this watercolour world won't kill me frees me to experiment and explore in ways I'm not typically used to. Even the boss fights - traditionally scenarios that flood me with adrenalin - are careful encounters designed to support and guide you rather than punish your missteps. I'm a curious completionist by nature, often compelled to turn against a throbbing waypoint to ensure I'm not missing a cheeky, secret collectible tucked in behind me, and Gris is one of the only games I've ever played that's properly cauterised that behaviour in me. Whether by accident or design - and I'm inclined to think it's the latter - it doesn't matter where you go or how you get there. You'll uncover new areas, skills, and even companions without conscious effort. There are no cheap deaths or immersion-breaking frustrations. Besides one almost irritating puzzle near the end of your adventure, you'll most likely bounce smoothly from area to area, adjusting intuitively as you explore the world around you, layering your new experiences onto the old as you encounter new challenges. And right up until the end, it'll be introducing you to new ideas and puzzles that keep your progression feeling fresh.I don't habitually spend a lot of time with games like Gris. I've grown accustomed to games that entertain me in brash, bombastic ways, and if you take nothing else away from this review, know that Gris is the very antonym to every shooty-bang-bang blockbuster you've ever clapped eyes on. I know everyone loves Journey - a game, in fact, said to have influenced Gris developer Nomada - but without a companion in tow, that's a game I find agonisingly slow. Not Gris, though. Gris is an experience I suspect I'll return to again and again. And while the gameplay is achingly well suited to Nintendo's hybrid Switch system - no commuting jostles or bumps will send you plummeting to your death here - you owe it to yourself to see its majesty on a big screen if you can. To hear it's soaring soundtrack loud and unfettered. There are more words I could drop in here - gentle, whimsical, evocative, emotional, magical, ethereal, therapeutic - but if I've learned nothing else from Gris, it's the truth in that old adage, ~a picture paints a thousand words~. Do not miss it."}