{"ref": "https://www.eurogamer.net/bioshock-challenge-rooms-7-3", "date": "26 Nov 2008", "game_name": "BioShock Challenge Rooms", "text": "It says something about the impact of a game when downloadable content for it comes prefaced with a plot continuity disclaimer. BioShock's Challenge Rooms, which was released exclusively for the PlayStation 3 last week for GBP 6.29, does just that.These three self-contained arenas - one focused on combat, the other two on puzzles and exploration - do not, we are explicitly told, form part of the BioShock storyline. They are a ~BioShock product~, intended to be enjoyed entirely on their own merits. It seems obvious, but it's probably worth saying all the same. The antique beauty, melancholy atmosphere and dark philosophising of 2K Boston's game have so enraptured some players that they could get lost looking for meaning in the simplest non-sequitur.In fact, they needn't have worried. Despite their odd rules, these three scenarios could quite easily have slotted into the main game's grand narrative as interludes. Atmospherically, they're perfect. A sinister ~Chamber of Thrills~ theme neatly ties the Challenge Rooms into BioShock's world. A ruined, malfunctioning carnival fairground, where a deranged ringmaster sets twisted and tortuous tests of cunning, makes sense and strikes a chord with Rapture's fallen utopia.Surprisingly, it's in their mechanics that the Challenge Rooms, some of them at any rate, sound a bum note. They're clever, memorable, carefully designed and visually lavish - but sometimes, they're not very BioShock.This is most evident in the first room, The 'I' in Team. This tasks you with rescuing a Little Sister from a Big Daddy without using weapons or damage-dealing plasmids. It's set in a malfunctioning shooting gallery, which probably gives you some clue to the answer to the riddle of how to take down a lumbering, moaning, heavily-armoured lunk without any offensive abilities.But here's the thing - the room doesn't exactly ask you to solve that riddle yourself. It doesn't allow you to experiment with Plasmids and invented items, even within its tight restrictions, before you arrive at a solution - which would be the BioShock way of doing things. Instead, it gives you only the precise tools you need to solve the puzzle in exactly the way the designers have imagined and leaves a small but intricate trail of causes and effects - partially-disguised locks and keys - for you to follow to the letter. It plays more like the descendant of Metroid and Zelda than System Shock.It's satisfying in its own way, but once it's done - which won't take long at all - it's done. When it comes to aiming for the Expert Trophy (completing the room in less than three minutes), you'll be looking to shave seconds off the required route rather than extemporise shortcuts or more daredevil solutions. Similarly, earning the Collector Trophy (find a number of hidden red roses) on this and the other two rooms is a matter of dogged, nook-and-cranny legwork - although the roses are hidden with more devious skill than most Easter Eggs.The next puzzle room, A Shocking Turn of Events, is at least less linear. Here you're required to save a Little Sister from the top of a malfunctioning Ferris wheel by electrifying its controls six times. You're ultimately given more ways of doing this than you need, and after your second success, they're available to you in any order."}