{"ref": "https://www.eurogamer.net/monster-boy-and-the-cursed-kingdom-review-a-vital-updating-of-a-classic-series", "date": "13 Dec 2018", "game_name": "Monster Boy And The Cursed Kingdom", "text": "Back when I was eleven, Wonder Boy 3: The Dragon's Trap contained a lot of firsts for me. It was the first game I ever played on a console. It was, as far as I can remember, the first game I played in which you pressed up to go through a door. Most importantly, it was the first game that made me feel wonderfully lost in the sheer breadth and richness of the world that it created. I understand, now, that this was probably the result of genre confusion. Wonder Boy 3 is kind of an RPG and kind of a Metroidvania. You collect coins and learn spells and buy increasingly better gear as the enemies around you get tougher. And you also change between a series of different animal forms, and the abilities that come with these animals open up new parts of the map and provide fresh opportunities to explore places that you've already been to. But I didn't really know about RPGs when I was eleven, and Metroidvanias probably weren't even called Metroidvanias back then. Instead, what I knew was that this was a game that looked like a platform game and behaved like a platform game most of the time. But in platform games you travelled left to right, and when you fell off the screen you died. In Wonder Boy 3 you could travel left or right. And when you fell off the screen you landed in another screen. Every exit was an entrance somewhere else, Guildenstern. Its world was vast and filled with secrets, and it seemed to unspool in every conceivable direction. See those mountains in the distance? You'll be able to climb them. Wonder Boy 3 is the game that made this as-yet-unminted cliche live for me.A few years back, Wonder Boy 3 got a truly wonderful remake. I'm still playing it off and on, overwhelmed by nostalgia and admiration. And now, Wonder Boy 3 suddenly has a spiritual successor. It still seems odd to type that. It's made by a French team rather than a Japanese team, but Ryuichi Nishizawa, the creator of Wonder Boy was involved, and while the name has changed - we're now playing as Monster Boy - and while the pixelly sprites and backdrops have been replaced by wonderfully characterful hand-drawn animation, the sense of continuity is absolutely dazzling. All of which could be dangerous. This is the sequel to the game that blew my eleven-year-old mind, the first game that taught me that you press up to go through a door. How can it possibly compare, not just with an ancient classic, but with thirty years of glitching memories? Do not fret: Monster Boy and the Cursed Kingdom is an absolute marvel.Brilliantly, Monster Boy doesn't merely copy the Wonder Boy 3 template. It advances the design in crucial ways, while still feeling deeply rooted in the original. Once again there's a simple fairy tale story unfolding - this one kicks off with an uncle who's behaving strangely and turning everyone into animals - and once again you move from a central village hub to explore the wild ranges of a huge world, each new area accessed by the new abilities you pick up as you're transformed, every few hours or so, into a new animal. Even the animals often have links to the previous game. The pig, your first new form, has the eyepatch - but not the dangling cigarette - of the old shopkeeping pig from Wonder Boy 3. He can't use a sword or a shield, but he can sniff out secrets in the landscape, poke people with a sharp trotter, use a variety of very familiar magical attacks, and bottom-bounce for fun and profit. Next up is a snake that can access small areas and stick to special surfaces, just like the good old Mouse from Wonder Boy 3. He can also spit acid, however, and smash through certain kinds of blocks. And swallow cogs. Just like a real snake!Next up is the frog, and let's pause for a moment, because the frog is the absolute freaking greatest and I just want to marvel at his glory. Suddenly, after the snake and the pig, you can equip swords and armour again, which means abilities that are gained by different items come into play. Ice sword that freezes lava flows and enemies? No problem. Shoes that allow you to double-jump? Shoes that allow you to walk on magma, or on clouds? You got it. But the frog can also grab things with his tongue and cart handy stuff like bombs and whatnot around in his mouth. And he can swing from grapple points and loft himself high into the air. More importantly, he's just so rakish and dashing. He's so inscrutable! Think about it: have you ever really been able to work out what a frog is thinking? This guy gives the game a jolt of speed and elegance and class. God, I will never tire of this frog. (Or any frog, but I suspect that's just me.)Beyond the frog lies the lion, the closest thing to a direct lift from Wonder Boy 3, which also had a lion of its own. But this guy has an amazing dash move that allows him to chug through blocks, and a thrusting jab that gets him into the sky or deep into the earth. Each character's movesets are always slowly expanding throughout the game as you get to know them and as you equip new loot, so there's probably stuff about the lion that I've already forgotten. And anyway, beyond the lion comes a dragon, who can fly and shoot flame out of his mouth, and the game is suddenly branching out into shoot-'em-up territory, and into stealth.What elevates all this, though, is a vital distinction between this game and Wonder Boy 3. In Wonder Boy 3, you could change back into a previous form, but only if you found a special room with a magical platform. Changing forms was a stately affair and not to be taken lightly. In Monster Boy, you can switch between all the forms you've currently unlocked on the fly, and the game makes the absolute most of this, encouraging you to zap from snake to frog, from frog to lion, in the course of a few seconds.Because this is the other big change. Wonder Boy 3 took you to all these different places - a desert, an underground pagoda, a weird forest - but generally just gave you different enemy types to tackle as you raced to the area's boss. Monster Boy doesn't just have more inventive bosses, it absolutely transforms the things you have to do to get to them. There are puzzle sections, real headscratchers. There are temples with rooms that spin around and have to be aligned in unexpected ways. There's a sunken ship - another nod to Wonder Boy 3 - but with a properly ingenious barrel puzzle. There's a snake-maze deep underwater where you slither from one air bubble to the next. There's a volcano filled with endless lava-rich chambers where you have to chain moves and transformations together at real speed: use the lion to crash through a collapsing wall, then the snake to sneak through a tiny gap before the roof comes down, then the frog to zip you across a ravine, then the frog's lava shoes to cool a magma flow, which only the pig can then bottom-bounce down into the ground. This stuff goes on and on, ramping up in challenge and in sheer, dazzling invention. This is a hard game, but it's so exhilarating, and its sense of imagination is so rich that you feel you have to see what's around the next corner.There's depth, too: secret chests to hunt down and open, a vast map filled with optional stuff, NPCs to talk to and a neat weapon-and-item upgrade system that allows you to trick out your expanding arsenal. It's all handled with such care, too: every ability is a delight to use, every backdrop makes the world richer and more evocative, every new tune manages to find a way to riff on an old classic you suddenly discover that you semi-remember.And even if you don't remember, it all stands up. If you're eleven right now and coming to this game with no understanding of its strange lineage, it's still an absolute treat, a good-natured adventure filled with glittering challenge. But if you do remember, it's so much more. It's an old song popping up unexpectedly on the car radio, and then, as the traffic quiets itself all around you, you're gloriously lost again - utterly transported."}