{"ref": "https://www.eurogamer.net/arma-2-hands-on", "date": "20 Nov 2008", "game_name": "Arma II", "text": "In the moments when they're not busy fabricating the follow-up to the world's most realistic soldier sim the staff of Bohemia Interactive Studio like nothing better than stroking kittens. It's true, I've seen it with my own eyes. Bohemia's surprisingly rural base of operations is home to a couple of cute black felines called Lock and Load (okay, I didn't actually get round to finding out their names, but it's probably something along those lines). On the day of my visit, these two moggies are stroked at least three times an hour.What can we conclude from all this cat coddling? Is the team that brought us gritty war recreations Operation Flashpoint and ArmA going soft in their middle age? At first glance the answer appears to be 'yes'.One of the unlikeliest new features in the upcoming ArmA sequel is that traditional crutch of the namby-pamby FPS, first aid. No longer is a bullet in the guts a one-way ticket to Golgotha. No longer do wounded soldiers have to crawl about the countryside like pythons that have eaten one too many pygmy hippos at an all-you-can-eat jungle buffet. Players can now carry or drag injured comrades to safety before reviving them with life-saving medk... err, 'wound dressings'. Studio head Marek Spanel acknowledges the gameiness: ~It's not totally realistic, but we needed something like this. Co-op is really important in ArmA 2. In our previous games, teams were often just a bunch of individuals running and shooting. Now, they have to work together because if you get hit you can bleed to death within a minute.~A little later something else is said that suggests softy backsliding. Marek again: ~ArmA 2 isn't just about fighting. There are dynamic conversations with NPCs and a lot of narrative in the game. We want it to be cinematic.~ Conversations, narrative, cinema? Treachery, surely. Should hardcore fans be worried?In a word, no. While it's obvious Bohemia is trying to broaden the appeal of the series with the help of a more interesting/unpredictable campaign (set in the fictional Caucasian country of Cernarus) and more characterful comrades (your three brothers-in-arms are a Queen's Gambit-style USMC Special Forces group) there's plenty of evidence ArmA 2 is going to be as honest and uncompromising as ever.Take the dynamic conversations for example. There's even a realism angle to those. Lose the linguist on your team, and communicating with Russian or Cernarussian-speaking locals will be hard if not impossible. It's a similar story with road-signs. Some poor intern has spent weeks hand-placing 1900 of the things at appropriate locations on the 225 km2 map. If you're looking for a particular town or village you just follow the signs. Well, you do if you can understand the Cyrillic alphabet they're written in."}