{"ref": "https://www.eurogamer.net/love-hands-on", "date": "14 Nov 2008", "game_name": "Reviews", "text": "It must be a kind of developmental karma: for every few dozen generic, predictable games that are created, there's always an oddity that crops up. Like a strange pixel in the sky, these esoteric instances snatch our attention and make the world of gaming just a little bit more interesting. In the MMO world this weird singularity is Love, a small-scale MMO being developed by a single person: graphics guru Eskil Steenberg. What's most striking about this project is its distinctly stylised, abstract visual theme. This isn't about realism or even functionality, but rather about artistic endeavour. Steenberg's talent is in both technology and artistic vision, and Love is an MMO that folds into both an intriguing package of graphical innovation, and unusual game design.The Swedish savant has spent the past two years developing a series of tools and graphical systems that have allowed him to create an absolutely spectacular world for his game. Unlike so many other world-builders out there, he's not relying on map-making cleverness or architectural savvy for his content - he's relying on mathematics. Everything in Love is procedurally generated. That means Steenberg types a few numbers into his tools and they build the world for him. And look at the results speak for themselves (in a smoky, evocative voice).The game itself is a moderately-multiplayer city-building endeavour, with Quake-like shooting elements. Steenberg describes it has a kind of ~multiplayer action adventure~, with the focus of players' activities being a communal city which they raise from the earth themselves. Again, Steenberg is relying on forces outside of himself to generate much of the content and activity within the game world.The couple of hundred players on a Love server will be the ones building the cities that they inhabit. All players will be able to raise walls and columns, or tunnel into rock to create rooms and corridors. The city will, Steenberg explains, be like a communal inventory system, where players will store their collective loot and the tools that the discover out in the world. As the needs of the community grow, so does the city itself. It's a game where co-operation between players will be very much at the forefront of play. What you get up to in Love might entertain you personally, but it'll really be about making your city bigger and better for everyone who shares it.It's that discovery of things out in the world that will drive the game. Thanks to the procedural-generation system, Steenberg is able to create vast swathes of beautiful, impressionistic world for us to explore. While we're out there in the wilds we'll be fighting monsters and collecting loot. The loot is usually something that might be useful in the city - often in defence of the city, which will come under attack by the world's enemy forces. One of Steenberg's key concepts is a radio system, which will allow players both to communicate with each other at range, but also communicate with devices in the world. A radio-keyed bomb, for example, could be set off by tuning to the appropriate frequency and sending it a pre-set ~explode~ command. The same could be true of remotely opening a door, or intercepting enemy communications.Seemingly at odds with all this creativity, exploration and communal building is Steenberg's take on combat. He's taking a back-to-basics approach, saying that he feels things like the early Quake games and 2D shooters are closer to the kind of combat he'd like to see in a multiplayer game. Leaping around blasting stuff is definitely on the cards for Love, making this an oddity not simply in its creation and conception, but also in its particular blend of game mechanisms within a persistent world.Steenberg even has some big ideas about how quests and stories will generate themselves within a game world. He's been examining some of our favourite classic stories, such as Star Wars, and looking at how they unfold. It's possible, he reckons, to create systems to deliver these stories within a game world, without cut-scenes or any of the other baggage we're used to seeing in a story-driven game.Of course, like all independent, esoteric projects, there's much that may or may not find itself into the final build of this game. Love is very much an experiment for Steenberg, who named the game after ~for the love of game design~ - the reason he is undertaking this tough project, rather than bagging a high-paid job at a development house. Steenberg is keen to stress that the game is evolving constantly, and might look and play quite differently when he finally gets around to letting the rest of us get our hands on it.In fact, Eskil isn't anticipating making a fortune from his wondrous creation. He's thinking of getting just a couple of hundred people in to play his game when it finally launches (which will be  when it's done), as that's all he'll need to pay for himself and his continued development of the game world. He's even giving away his amazing-looking (although reportedly tricky-to-use) tool systems as open-source code, if you want to see how he does it. Even in 2008, a year of fascinating, intriguing developments in gaming - not least in the indie scene of PC gaming - Love stands out like a magnesium fire in a haystack. Let's just hope that Steenberg's energies and inspirations last enough to set the world on fire when he does reach that vital beta."}