{"ref": "https://www.eurogamer.net/shaun-white-snowboarding-review", "date": "14 Nov 2008", "game_name": "Shaun White Snowboarding", "text": "The internet is amazing. Look, here's what Wikipedia can tell you about Shaun White: ~Shaun Roger White has been a notable competitor in professional snowboarding since he was fourteen... White was born with Tetralogy of Fallot, a congenital heart defect for which he endured two open-heart operations.~Wow! Now let's see what Shaun White can tell us about Shaun White, thanks to this interview on Heckler.com: ~My perfect day would just be learning a new trick. That just makes the day. You know how it is, you skate a lot, if you try that trick all day and you finally make it then everything is sunshine after that.~Amazing! And hey, look at what I can tell you about Shaun White: turns out Ubisoft's Shaun White Snowboarding - hereafter referred to as Shaun White Waterboarding - completely blows. You might have been interested in it as a sort of snowbound Skate: a more weighty, precise alternative to Amped or SSX. It's totally not. It just blows.Mostly this comes down to the control scheme and handling, two crucial parts of any boarding game. I can't speak for the Wii version (and Tom says it's a little better) but on 360 you're never given the level of control you want, and your snowboarder is alternately weightless and too heavy. When it comes to gaining serious momentum on slopes you seem too light, but when you're cruising along flats you decelerate far too quickly.Similarly, when it comes to tricking, all it takes is a moderately steep downward slope for any player on the cheapest board to be able to ollie high enough to backflip- yet trying to maintain speed on a halfpipe is one of the hardest things in the game.But by far the most irritating aspect of the handling is the inability to simply make your board go where you want it to. It's something may not notice at first when you're simply cruising down one of the game's four mountains, just chilling and doing tricks as they come to you, but eventually the time will come where you try one of the events scattered across the piste. This is where things go wrong. When you only have a limited amount of time or space and you need to hit every ramp and every turn and avoid every obstacle, you'll see just how fiddly and frustrating the game is capable of being.(Incidentally, there's a fifth mountain in the game if you buy the game from Target. As in, the American retail store. This exclusive content nonsense really has to stop.)The handling is probably worst in the one event which isn't about tricking or racing, known as Collectibles. This has you thundering down the mountain trying to hit rotating guitars which are placed in a simple curving line, so you wouldn't think it would be that hard to hit them all, right?"}