{"ref": "https://www.eurogamer.net/parkitect-review-the-finest-theme-park-sim-for-years", "date": "7 Dec 2018", "game_name": "Parkitect", "text": "A significant chunk of my formative years can be defined by the heave and splat of hundreds of tiny computer people retching violently onto the floor. Maybe not the most melodious sound, but for me it's a noise tinged with nostalgia, conjuring memories of wonder as I, new to the world of PC sims, unleashed my newfound powers on the denizens of Bullfrog's Theme Park for the very first time.Theme Park is, of course, rightly considered a classic, a masterfully implemented, joyous game of pure wish fulfilment - after all, what child hasn't dreamed of running their own amusement park? Five years later, RollerCoaster Tycoon refined, and some might argue, perfected the formula, proving no less delightful for its added depth and rather more serious, business-minded outlook. Since then, we've had sequels in both franchises, but as they've continued to evolve, most recently with Atari's execrable RollerCoaster Tycoon World, and Frontier's impressive, but ultimately rather hollow, Planet Coaster, a spiritual successor to RollerCoaster Tycoon 3, some of that early magic has dissipated. With developer Texel Raptor's Parkitect, however, the ageing formula has regained something of its heart.Parkitect's candy-floss-scented, vomit-encrusted blend of design and business management will, of course, be immediately familiar to anyone that's dabbled in the genre over the years. Your basic goal is simple: build a theme park so ceaselessly delightful, so perfectly in tune with your guests' needs, that they're all too willing to dig into their pockets to keep the cash coming in. As usual though, it's the countless variables, and the capacity for obsessive, experimental tinkering that proves so consistently compelling. Indeed, if you've ever enjoyed a theme park sim prior, the fundamentals of Parkitect will feel like second nature. You'll place down paths and construct new attractions, ranging from simple flat rides to thrilling, fully customisable coasters; you'll build shops to generate income and stave off hunger and thirst, benches to keep guests rested, cover to keep them dry in bad weather, and scenery to keep them immersed. You'll also want to hire janitors, engineers, entertainers, and security guards to ensure everything runs efficiently behind the scenes.Pretty much every feature that long-time fans of the genre might hope for is present and correct in Parkitect, right down to RollerCoater Tycoon's isometric perspective - although the fully-3D world means that this is adjustable for non-traditionalists. What sets Parkitect apart, however, are the subtle but meaningful innovations, which expand, deepen, and refine the theme park formula enough to give it an identity of its own.For instance, while Parkitect's isometric perspective and low-poly aesthetic might suggest a game of restrictive simplicity, the truth is very different. Poke around, and you'll unearth a construction toolset that offers tremendous scope for creativity - and those drawn to the genre through their love of design are unlikely to feel short changed.Parkitect features hundreds of pre-baked props and scenery items - all rendered in the game's adorable, toy box art-style - alongside a wealth of free-form building pieces. Almost everything can be snapped to an adjustable grid, shifted on a vertical plane, and can exist within or on top of each other. That makes it wonderfully easy to layer different elements, and to produce some extravagantly detailed creations from very simple foundations. Sure, Parkitect doesn't offer the near-photo-realism of Frontier's design-focussed Planet Coaster, but there's very little that its flexible tools and a little bit of ingenuity won't permit. And while we're drawing comparisons with Planet Coaster, those that bounced off that game's anaemic management core should be pleased to hear that Parkitect works hard to ensure its strategic possibilities are as meaningful as its building options. Some of this will be familiar, of course; you can adjust prices and salaries, consult spreadsheets, peruse visitor feedback, splurge on marketing, scrutinise weather cover, ride intensity, or immersion, and even trace the precise route every single guest has followed during their time in your park.Parkitect's most interesting decisions, however, are borne of the way it so elegantly intertwines unglamorous backstage management with front-of-house design. Here, there's a constant need to balance your aesthetic fancies with more practical infrastructure considerations in order to keep your behind-the-scenes operation efficient and your visitors happy. That lends a sense of cohesion to the genre's often disparate halves and additional depth to the experience as a whole.All this begins with the warehouse sitting at the gates of every park. New stock is delivered here on a regular basis (assuming you have the funds), and this, in turn, must be transported to your money-generating shops so that they remain operational. Unlike other theme parks sims, however, deliveries don't happen via magical teleportation, and you'll need to provide the infrastructure to move stock around your park manually. Underground delivery pipes and smaller satellite depots can eventually be deployed to ease the flow, but you'll still need to hire haulers to physically carry stock to its final destination.As your park grows and more of these critical facilities - alongside the likes of staff-only paths, rubbish chutes, and training rooms - are introduced to maintain the efficient running of your enterprise, backstage areas can become almost as elaborate as the front-of-house experience. Crucially, guests won't be at all happy if any drab backstage facilities fall into their line of sight and break your park's immersive spell, so there's a constant tension between park efficiency and beautification, adding richer planning requirements to Parkitect's familiar underlying formula. Outside of core experience too, there's plenty to impress. A configurable sandbox mode is complemented by an extensive, and enormously entertaining, scenario mode. Here's you've 26 parks to rejuvenate through your business smarts, each delightfully distinctive - not only in terms of layout and goals for success, but in the way they force new strategies and imaginative uses of tools. And for those that really want to get stuck in, Parkitect offers a terrain generator, a scenario editor, creation sharing, and mod support via Steam Workshop.Parkitect's only real blemish comes via its UI which, despite a lengthy early access period, still has more than its fair share of idiosyncrasies and inconsistencies. Most of these quirks of interface design are at least grudgingly tolerable, even if they do force players through some unnecessary hoops. A few, however, continue to irk me, even after dozens upon dozens of hours in the game.How much these bother you is likely to depend on your play-style, but my personal bugbears include the fact that Parkitect's object picker - one of the most useful tools available - can only be accessed by first opening the construction menu, despite working for the vast majority of items in-game. More frustrating still is the lack of an undo button; it's extremely easy to erroneously misplace or delete items thanks to Parkitect's isometric perspective, especially underground, and, often, your only solution is to remove and then rebuild everything around it.It's testament to Parkitect's other successes, however, that these nuisances ultimately melt into the background. Even the moments of unwelcome abrasiveness brought on by the UI can't quell Parkitect's delightful charms, or detract from the fact that it's a wonderfully designed experience, full of small details, thoughtful additions, and keenly observed refinements that build meaningfully on a well-worn formula.But the thing I love most about Parkitect is a little harder to define. Like Theme Park and RollerCoaster Tycoon before it, Parkitect manages to capture the essence, the sense of wonder and exuberance, inherent in the best amusement parks. The sound, the music, the vibrant hues and twinkling lights, the screams and laughter of your appreciative guests, and the delightfully intricate machinations of every ride - all working to create little vignettes of warmth and life that make your toils to please your tiny digital guests so much more rewarding. Until one of them pukes in a dustbin and chaos ensues, at least."}