{"ref": "https://www.eurogamer.net/locoroco-2-review", "date": "13 Nov 2008", "game_name": "LocoRoco 2", "text": "Not unlike Mario Kart Wii and its boost mechanics, LocoRoco 2 appears to be after a record for the most collectibles in a platform game ever. There are berries and pickories scattered around like Mario's coins and Sonic's rings. There are musical notes hidden in plants and awarded for clearing out dark clouds, and when you've gathered a hundred these level-up the stage you're on so that you can gather berries and pickories with greater ease.There are stamps, which can be arranged into pretty patterns or matched against silhouettes. There are the cheerful little Mui Mui silhouette men, who, once collected, disappear to the Mui Mui House, which you can play with in a mini-game. There are Mui Mui House parts, so you can make some furniture, and sometimes there are Mui Mui weapon parts, so you can defend the house from the evil Bui Bui bombers. And of course there are the red flowers, each of which adds another smiling LocoRoco blob to your seamless, ball-shaped mass of heroes.None of which will make any sense if you haven't bounced merrily through the 2006 original, but you needn't have if you want to enjoy LocoRoco 2. If the events portrayed by the new, infrequent cut-scenes are related to those in the first game, it's lost on us. You can't even really have plot spoilers: halfway through the game, one of the four blobs is puffed up by a trumpet-mouthed bipedal ladybird thing and then the rest locate him amongst a crowd of the same and they're tossed about laughing. What?Don't worry though, because LocoRoco is an easy game to understand. You're responsible for a little smiling blob, who moves around the 2D platform level whenever you tilt the level itself left and right using the triggers, and jumps when you hit them both together. Whenever you find a red flower (some of which now float around), you gain another LocoRoco blob, and you can mesh them together into a large blob by holding the circle button (they all shout ~jooooin!~) and disassemble them by tapping it again. There are obstacles to avoid, like stamping stick-insect men, so most of the time you keep the group joined, and the sequel is more aware that you'll want to do that than the first game, with levels that mainly split you up as punishment or part of a display.It's also slightly more difficult. Individual levels are built around familiar conceits, with a main path that takes in a mixture of jumping, boffing Moja enemies, bouncing off trampolines and riding loop-the-loop rollercoasters along air currents or beneath the ground in Sonic the Hedgehog tunnels, while scratching around for the false walls and other hidden areas that house the bulk of the record-breaking collectibles. But there are more spikes, and more aggressive enemies - like a Half-Life barnacle descendent with a prehensile tongue that lashes at you - and it's also harder to accumulate all the treasures, with moving bounce-pads and other tricky-but-forgiving conveyances to master before the treats tumble into your blobby core.LocoRoco 2 also does more with individual levels. There's another one set in someone's guts, but this time along with the stringy cartoon entrails and cushioned surfaces there are a few changes to the gravity as the guts' owner goes from lying down to standing and back down again. You also get to swim in someone's fluids, with underwater control similar to Mario: a gentle descent propped up a bit with each stab of the triggers."}