{"ref": "https://www.eurogamer.net/grand-theft-auto-iv-hands-on", "date": "10 Nov 2008", "game_name": "Reviews", "text": "For many gamers, GTA was born on the PC in 2D. We've all got our memories of racing through the time-limited demo, the squeaky phone gibberish playing over mission instructions, trying to work out the lyrics to Four-Letter Love, and doing the bomb-on-a-bus mission. But that was a while ago, back when Speed starring Keanu Reeves was a cultural touchstone. These days, GTA is synonymous with consoles, having bossed the last PlayStation for Sony and given Microsoft something to shout about for the last 18 months. Did you know they have some exclusive DLC coming up? Did you?Well never mind that, because the 360 version may be due hours of new content, but the PC version brings the series home with significantly more features. Everything you'd expect from a port is here - the story-driven single-player game, with visuals buffed to take advantage of the PC's superior components (there's even a benchmark mode, if you're one of those), and Games for Windows Live-backed multiplayer, using the TrueSkill ranking system for matchmaking - along with a new video-editing suite that allows you to capture your antics and then play around with them using a drag-and-drop interface, before exporting the high-definition results and sharing them.GTA IV hardly needs summarising, but here goes: you play as Nico Bellic, a recent immigrant to New York facsimile Liberty City, and having set yourself up in your dimwit cousin's apartment, and on the books at his mob-backed cab firm, you head out into the game's openworld in search of the means to stabilise your family and carve off a bit of your own American Dream. As with past GTAs, this involves driving cars and completing third-person action missions, and the hilly, tonally varied and visually spectacular Liberty City is an interesting canvas onto which Rockstar paints an impressive array of scenarios, which take advantage of new cover-based shooter mechanics and the series' trademark hotwire-and-go racing, strung together with clever additions like a mobile phone for keeping up with contacts.As ever though, it's the incidental humour and gameplay - some of it intended, some of it emergent - that helps sustain the 30 or so hours it takes to wring the city of all it has to offer, and having built an empire on letting players muck about and make their own fun, PC developer Rockstar Toronto acknowledges that by harnessing modern PCs to deliver the video editor, which allows you to capture clips of gameplay (everything except cut-scenes and mini-games, like ten-pin bowling) and then insert custom camera behaviour, apply visual filters, pick your own music, and save off the results.Capturing gameplay is simple. All the while you're playing, the game is caching the last 30-60 seconds (depending on what's going on) of action, and at any time you can hit the F2 key (or the Back button if you're using a 360 pad) to save that chunk as a clip. You don't have to do anything with it immediately - indeed, you could hit F2 every so often throughout the game without ever visiting the video editor, and then simply dive in there once the credits have rolled - but should you want to try it out, you can access the suite through a new option on your mobile phone.Once loaded, you choose saved clips and then drag and drop them into the editing window. Each takes a few seconds to load full-screen when you double-click, and you can watch through them while a timeline at the top of the screen keeps track of where you are. Tracking controls respond instantly, and if you want to play around you can start adding markers to the timeline."}