{"ref": "https://www.eurogamer.net/bioshock-challenge-rooms-hands-on", "date": "4 Nov 2008", "game_name": "BioShock", "text": "Whatever you think of BioShock - and we're fans, as you may have gathered from our 10/10 BioShock PS3 review a few weeks ago - the prospect of Portal-style canned challenges designed to take advantage of the game's genetic powers and guns is a new and interesting proposition. BioShock encouraged, but seldom commanded players to combine their abilities, but the PS3's Challenge Rooms - due out on 20th November - use their discretion as a licence to impose the kinds of restrictions players would never have tolerated in the campaign, but which make perfect sense removed to one-shot levels built around speed and MacGuyver-style ingenuity.In ~Worlds of Hurt~, one of three Challenge Rooms included in the GBP 6.29 bundle, the goal is to free one of BioShock's Little Sisters from a central chamber surrounded by eight doors, each of which leads to a battle with specific enemies. The first is a single splicer, and you're given six bullets and a wrench. Before long though, you're faced with Big Daddies, Houdini splicers and others in increasingly elaborate configurations of ammo and foe. Each room is buried beneath a glass floor, allowing you to observe your enemies before diving down a tube to engage, and individual battlegrounds vary dramatically in shape and hazards. With use of the camera, every conceivable vending machine and limited money and Adam, Worlds of Hurt gives you a range of options, but forces you to be cautious, frugal and inventive.For example, the first Big Daddy is preoccupied banging around in the corner, giving you plenty of time to photograph him and develop certain tonics, which enhance your fighting ability, but the room is small enough that simply pumping him with pistol rounds is insufficient. A few good buys in the hub area, however, and clever use of some water and electricity, preserves your health and resources, leaving enough over to deal with the Houdinis later on, who occupy a much taller room rounded by rickety walkways and staircases. With each cleared room, there's a bit more Adam and money to spend; hacking the dispensaries, gathering film canisters, concocting ammo and facing up to the next threat: spider splicers, sentry bots...As discussed in our last preview, each Challenge Room is set against the clock, and speedy completion (practice will be necessary) feeds into leaderboards. Each Room also offers four unlockable PS3 Trophies. Heading back to the fairground level (~A Shocking Turn of Events~) first used to illustrate the concept when it was announced at E3, this time with the pad in our hands, we also get a sense of the personality the developers have instilled into each of the new playgrounds. This one involves freeing a Little Sister stranded in a Ferris wheel by jolting it with six lots of electricity - gathered by scrounging electric shotgun rounds, trap-bolts and a new weapon - but scratch at the seams and there's more to uncover. There are ten red roses concealed throughout, for instance and the ones we remember were so nicely secreted we won't spoil the surprise - and we feel the same way about the one-shot gene tonic joke we hope nobody else spoils for you. The third Challenge Room - ~The I in Team~ - is an unknown at this point, except for the description: ~Using limited resources, and an even more limited arsenal, players must negotiate traps and find a way to defeat a Big Daddy using their wits instead of raw firepower.~Away from the Challenge Rooms themselves, the bundle of content due on the 20th ought to introduce a ~New Game Plus~ option to the main game menu as well, which is for people who have completed the single-player and allows you to restart the game after the introduction with all of your weapons and abilities intact. Our 2K guardians weren't able to tell us exactly where it picks up, but we suspect it's just before you meet the first Big Daddies. Our guide nodded thoughtfully.As expected, the Challenge Rooms twist BioShock's toolset to fit scenarios the original game's open design precluded, and it's little surprise that the same developers have been able to channel the huge range of possibilities they represent into puzzles and combat that live up to the concept. What's promising, though, is the little flourishes in the two levels we've seen, which aren't just cold knots of movement to untangle with Swiss Army plasmids, but interesting and often amusing ideas that fit the original game's temperament and polish even though they would have struggled to sit with the campaign. It's BioShock skewed to be impactful on this new, piecemeal scale, and unless we're being shown things very selectively, and the GBP 6.29 asking price turns out to be as contentious as Andrew Ryan's demise, this will be worth checking out later in the month, and an exercise worth repeating.BioShock's Challenge Rooms are due out on 20th November for GBP 6.29 / USD 9.99."}