{"ref": "https://www.eurogamer.net/lost-judgment-review-all-out-action-hampered-by-ill-judged-story", "date": "15 Oct 2021", "game_name": "Lost Judgment", "text": "15 years in and the streets of Kamurocho and beyond have played host to so many different systems and stories. If last year's new and giddily entertaining turn-based RPG direction for Yakuza Like a Dragon proved anything, it was how flexible this series could be, and how drastic changes could breathe fresh purpose into it all. Following a first entry that sometimes struggled to find its own space in the series, the Judgment spin-off returns, this time with a greater sense of purpose. With the mainline series now seemingly staying on its turn-based RPG path, Lost Judgment carries the action torch alone, its backbone provided by back-breaking real-time combat, complemented by a dazzling selection of the series' ever-expanding side activities. And at this point in the series' lifespan, an expansive thing it is indeed. If you judge an open world game by its distractions and this is easily Ryu Ga Gotoku Studio's best, its take on Kamurocho and the Isezaki Ijincho stuffed with things to do. Like Yakuza: Like a Dragon before it, it's the sprawling bustle of the Yokohama district that serves as the predominant backdrop, and once again it's a peerless piece of digital tourism - something that feels more necessary now than ever before. It's possible to lose entire evenings to strolling the city, popping into late night bars for a tipple or two before spilling out onto the streets for a scrap or two with the delinquents that patrol the area, then stepping into a Yoshinoya for a quick beef bowl. Before you head home, why not step through the sliding doors of the local arcade, where you'll find convincingly yellowed candy cabinets playing host to Model 2 classics such as Fighting Vipers, curios like Sonic the Fighters or overlooked gems like Motor Raid. There's even the all-new Hama of the Dead, a schlocky shooter that's substantial and slick enough to sit alongside existing entries of Sega's beloved lightgun series. Head home and there's a Master System with pack-in title Alex Kidd, or you could pick up the likes of satisfying action puzzler Penguin Land. Or you might just want to play Lost Judgment itself. Takayuki Yagami returns in the starring role, once again voiced and with the likeness of Takuya Kimura, and once again playing a private detective dancing on the fringes of law, order and enforcement. Perhaps most pertinently for the player, he's pretty handy with his fists, and like earlier Yakuza games before it this can be a fine brawler, Kimura kitted out this time with a third fighting style that lends the overstated combat even more flexibility with its counters and throws. There's even a fourth fighting style - sort of - by way of a boxing mini-game that offers up its own upgrade path and just another way to while away half a dozen hours or so. It's one of several new, deep and engaging diversions offered up in School Stories, new side cases presented in the Seyiro School that's at the heart of Kimura's investigation. They're rich and generous side missions, though it's in that school - and in Lost Judgment's central investigation - that things begin to unfurl. While the extra-curricular activities and real-time combat are familiar from Yakuza of old, Kimura's profession as a private detective again defines much of the core of Lost Judgment, and not always for the better. Stealth and tailing missions return, and while they're not quite so common and have had a nip and tuck here and there they still end up falling entirely flat, while isolated detective scenes are nothing more than dumb object hunts. Some additions work better than others - there's a cute shiba inu that can lead you to cases, and to bring the sprawl of Yokohama together there's now a skateboard Kimura can pull out, Poppins-style, from his back pocket - but in a game where so many of the elements are familiar from past entries it's disappointing that the new stuff isn't all that. It's another of Lost Judgment's disctinctive elements - the darker themes that are placed as a cornerstone of this spin-off's identity - that are perhaps its biggest failing. It's a tale of sexual assault, suicide and bullying that centres around a school where much of your investigation takes place. Indeed, if you've been aching for that Bully remake, well here it is - only this time it's from the perspective of a 40-year-old man sniffing around the school gate. That awkward combo is sometimes played for laughs, until those bleaker moments that touch on suicide and sexual assault - often through lingering, looping shots that seem to revel a bit too much in the horror of it all that can make it all seem like nothing more than ghoulish window dressing. Video games can and should tackle serious issues - I'm just not sure the video game with the skateboarding detective who spends his spare time getting drunk, playing arcade games and tracking down underwear thieves is the one to be juggling themes of suicide, bullying and sexual assault. Given the lurching from madcap comedy to melodrama and the subsequent fumbling that unfolds, I'm fairly certain that Lost Judgment is not that game. It's a small shame, as just as often Lost Judgment is a brilliant, generous and hugely entertaining game. Maybe that's why that friction grates - I struggle to square the thrill of skateboarding around town, grinding railings and only pausing to roundhouse a mob of drunks before dropping a few hundred yen on Sonic the Fighters with the gravity that's implied elsewhere, and if ever a game didn't need a dark and dour tale dragging it down it's this absurd carnival of a thing. Away from the stilted melodrama, Lost Judgment still has that special spark - there are nerdy tales about the second hand game market, missing game directors, held together by elastic combat and skateboarding with a soundtrack that lets you know RGG misses Jet Set Radio as much as anyone. And this remains a fascinating series, as close to video games have got to the golden age of studio cinema - the same sets being redressed with different actors, different characters and directors and then different mechanics, genres and then all those other silly little details that make a video game. Like its predecessors, Lost Judgment offers a sense of place and atmosphere that begs to be drunk in - plus a story that too often leaves a nasty taste."}