{"ref": "https://www.eurogamer.net/quantum-of-solace-the-game-review", "date": "3 Nov 2008", "game_name": "Quantum of Solace: The Game", "text": "It's Bond! With Gears of War cover mechanics and the Call of Duty 4 engine! How can it possibly fail? As it turns out, by being dull, repetitive, unchallenging, ruinously linear, and one of the shortest full-priced games ever. Quantum of Solace: The Game (in case we got confused with, I dunno, Quantum of Solace: The Hamper) starts off with solid fundamentals, only to undermine them in depressingly swift fashion. The controls are pleasingly refined and well-implemented, with an intuitive cover system that does a fine job of giving 007 the ability to switch between walls, boxes and cover points with the minimum of fuss. But it's nowhere near enough. All too quickly, the game settles into a tired FPS routine that plays itself.The chief culprits are that twin FPS menace of linearity and predictability. Right from the very start, there's rarely an opportunity to improvise or think for yourself. Just point Mr. Broody in the direction you're told to, crouch behind cover, wait until the obliging enemies pop their heads out and repeat until the area is clear. It would be nice if all the people copying Gears of War actually paid attention to what it was doing, rather than phoning in superficial explanations.Initially, there's a sense that the enemies aren't as clueless as the usual drones that populate mass-market shooters, but it really is just window dressing. Destructible cover allows you to send enemies fleeing in panic, and occasionally it even looks like they're working as a team trying to outflank you and pressure you into making mistakes - but it's little more than a scripted illusion, so the core gameplay degenerates into stop-and-pop. With the now-standard recharging health mechanic reducing the challenge almost to zero, it's actually harder to screw up than not. Assuming you've got motor function, finding cover when you're shot at will be enough to get you through most situations unscathed.What with the boring shooting, it's almost a relief when Treyarch introduces elements to remind you 007 is a spy, and not just a sour-faced chap with a nice suit and a selection of big guns, but this is cocked up as well. It's almost a given that we get to perform some silent takedowns on unsuspecting enemies, but they're so poorly implemented that you wonder why they bothered. On several occasions during any level, you'll get a chance to creep up behind enemies and incapacitate them with a single button press. Despite presumably being on high alert, these idiotic goons never see you coming as long as you're crouched down on approach. With faintly embarrassing predictability, they follow strict, basic patrol paths, and stand around staring at walls for no apparent reason.And despite the obvious noise, no-one in the vicinity turns a hair if their back's to you (which, thanks to pathetically generous level design, means they will generally always have their backs turned on the source of any potential noise), meaning you can rack up one ridiculously easy stealth takedown after another. Even if you screw up, armed combat is so generous and unthreatening that it's never much of a problem. Sometimes you'll also find yourself battling enemies in Quick-Time Events, but, again, the game gives you such a large window of opportunity to succeed you could steal Mr. White's mansion through it without grazing the sill. The AI's antics are as predictable as the explosives stashed all over every level, waiting to cue the 'mousetrap' moments that blow up any neighbouring henchmen not already dead by stupid.With solid but uninspired stop-and-pop combat, and an excruciatingly bad attempt at incorporating melee combat, it's not surprising the rest of the game's similarly disappointing. There's more stealth-lite in the form of security cameras that sweep specific points of the level for intruders. Rather than introduce interesting evasion tactics, or give the player any sense of achievement for hacking the system, the designers cop out completely and reduce the task to a single button press on a nearby panel in a manner we haven't seen since the worst of PS2. Elsewhere, unlocking supposedly super-secure doors involves pressing d-pad directions when prompted at glacial pace.A couple of times you get to shimmy along ledges and jump between windows, with a cutaway view giving the player a chance to see the action from a suitably useful perspective. But, yet again, there's almost no tension, because the AI is so completely dense. Almost every step of the way you feel like the game has been designed for complete idiots with zero attention span."}