{"ref": "https://www.eurogamer.net/gears-of-war-2-hands-on", "date": "3 Nov 2008", "game_name": "Gears of War 2", "text": "If it's any consolation to Cliff Bleszinski, we're forever picking on developers at E3, so he shouldn't feel bad that our first question is whether he was actually playing Gears of War 2 at Microsoft's conference. For those who missed it, the demo began and Marcus advanced towards a smoke-drowned Jacinto skyline before the video feed stopped and reloaded, giving the impression we were actually watching a recording.~We went to ghost cam,~ Bleszinski says. ~What happened was that everything was working fine at rehearsal, and then when I went on stage and did my presentation and went to use my controller it timed out, and then I'm like 'Mother f***er!' So they went to the backup feed where they were playing in the back, and I had to act like I was playing it, even though I wasn't. I'm not going to lie.~Regardless, what we saw stuck in the mind. Whether you care about Gears' fiction or not, Jacinto in flames was an impressive canvas, and the refined Gears 2 cover-based gameplay mechanics and density of ~water-cooler moments~, in Bleszinski's phrase, sketched a compelling game across them. ~We switch up the gameplay,~ he acknowledges, adding that the level we saw him play through (or not play through) was set three-quarters of the way through the campaign. ~We'll have a new creature, a new weapon, a story scene, a new environment, something falls down and explodes... That's the game we wanted to make: something memorable moment to moment.~Gears 2 sees Marcus Fenix - liberated from prison to deliver a bomb into the heart of the subterranean Locust horde in the first game - and his buddy Dominic Santiago taking the fight to a resurgent adversary at the behest of humanity's ruler-by-default, military chief Chairman Prescott. Bleszinski promises we'll learn more about the characters' backgrounds - and the world's at large. ~That was the big mistake with Gears 1,~ he points out. ~People wanted to know more, they were thirsty for more of the universe. That's a good problem to have.~Gamers get to do this with some new weaponry - there's a flamethrower this time, and a mortar that allows you to fire projectiles in a parabolic arc similar to the grenade - and combat techniques. The meat-shield's the one we've all seen: Marcus grabs a Locust enemy and uses him as a mobile cover point. ~You get a get-out-of-jail-free card with a grenade or a Torque Bow shot or a Boom shot,~ Bleszinski says of the meat-shield. ~If you face the guy he'll absorb the shot and you'll hardly take any damage, and you just kind of cringe a bit and his body will explode into itty-bitty bits.~Complementary elements like chainsaw bayonet kills (now with button-mashing sub-game if you're up against an enemy armed with the same kit) and Active Reload (the timing-based reload mechanic that boosts ammo strength and combat tempo) also return, but there are other refinements to note. Campaign co-op is still two-player (they felt it was the right number, says Bleszinski), but checkpointing is more considered and the action branches a bit more - or less if you prefer. ~We have informal splits where players can choose to go either way or they can stick together and goof around,~ we're told. ~A little bit more open-ended environments.~ And if you were in the latter camp with the fiction, you can skip it. ~Dom will chime in like 'Marcus, what was the--' and you're like 'Shut uuuup'.~But you're fighting a strengthened enemy, too. We've already seen that you'll face epic battlefields of many multiple adversaries, but there are new faces among them. The Flamethrower Boomer (surely Flaming Boomer) is a hefty enemy it's no fun getting caught next to, while the knee-biting Ticker enemies (dogs with time-bombs strapped to their backs) will threaten as the Wretches did in Gears 1, and other enemies toss grenades and sling grappling hooks up to your elevated positions to try and bring the fight to you. The Locust can even undermine your position, dragging your building refuge into the ground, presumably at set-piece moments - and one of the game's narrative preoccupations is whether Jacinto, humanity's last stand, is vulnerable to the Locust ~sinkholes~.As we detailed in our Gears of War 2 preview earlier this year, there's a grander scale at work - the moving battles shown at Microsoft's San Francisco event in May supported by toppled buildings, epic draw distances and the tantalising prospect of riding the Brumak. As Marcus pointed out at the end of Bleszinski's conference demo, ~If they can do it, why can't we?~Sadly though, Bleszinski wasn't the only one who wasn't playing the single-player Gears of War 2 at E3, because despite hiring out the whole of the Ciudad restaurant in downtown LA for a Monday night showcase event, Microsoft only had multiplayer on hand unless you happened to be on the E3 awards judging panel. Fortunately, one of the key demos was the new five-player co-operative Horde mode - an alternative to four-player campaign co-op, which would have ~messed with the storytelling~ among other things, according to Bleszinski."}