{"ref": "https://www.eurogamer.net/far-cry-2-4", "date": "21 Oct 2008", "game_name": "Far Cry 2", "text": "Spare a thought for beleaguered developers at this time of year. Getting a major project out on time, on budget and up to scratch typically entails a superhuman commitment to the cause, marriage-wrecking long hours, and a sworn renunciation of selfish luxuries like sleep and personal hygiene. Were it that simple. Take the Far Cry 2 team over at Ubisoft Montreal. Having busted balls to ready a playable build for UbiDays barely six weeks ago, like many other developers it has had to produce yet another version for E3 next week. And before you can say ~why can't we have an extra nine months like you gave that Haze crap?~ there's Games Convention in Leipzig to prepare for. It's a rum business.For a game as complex and as ambitious as Far Cry 2, then, you can hardly blame them for drawing the line at providing a pre-release consumer demo.~No, no demo,~ creative director Clint Hocking responds abruptly to our probing. ~One reason is, even if we were to give out what you played today - even if we put invisible walls around it and said, here's the demo, you can go anywhere you like inside these walls and play it how you want - that's potentially right there eight-to-ten hours of gameplay. I don't know too many people who are willing to give away a 12-hour game for free.~Surprisingly, however, and notwithstanding the drain on resources, Hocking sees genuine benefits in the gruelling process of choreographing endless new routines for the media circus. ~Without milestones to show the game you get irresponsible and end up with a giant broken code-base and nothing works,~ he opines. ~Sometimes you have to put a lot more polish on than you need to. You have to branch out a build for a couple of weeks and put a couple of guys on it debugging just for that. But it gives you a better view of where you're going to be a month or two from now. It gives us a good idea of the level of quality we're going to have [in the finished article].~The E3 build we're taking an early peek at here in Ubisoft's massive, 1,600 staff-strong Canadian HQ focuses on the same mission Rob has already waxed lyrically on from Ubidays. Time contraints, no doubt, prevented any wild departures, but that's not to say improvements haven't been made in just a month and a half. ~We were feature-complete this Friday just past,~ reveals Hocking. ~There's now really only one or two guys pushing in last-minute things while everyone else is transitioned over to debugging. Once you push 100 guys onto debugging for a week, things can get stable really fast.~But despite ~really positive~ feedback from Ubidays - the on-stage demo was certainly a highlight of the press conference - the team has doubled the available ammunition and tightened up the AI, which is now ~a lot more mobile, a lot smarter, which makes it a lot harder to deal with them.~ This is borne out by Hocking's repeated yelps of ~S***!~ and frantic running for cover as best laid plans go awry during the initial demo. Regardless of the extra tweaking, we'd usually be inclined to grumble about being airlifted into North America to play what is essentially the same demo we've been acquainted with so recently. But in the case of Far Cry 2, it makes perfect sense. As you probably know, Far Cry 2 operates under the guiding principle of freedom, its narrative of factional warfare buried in a 50-kilometre-square sandbox for the player to dig up largely as and when he sees fit. Freedom of movement around the world is one thing; but it's in the freedom of expression during combat that the greatest potential lies.A single play-through by definition offers a single approach, a single perspective. Ubisoft wants us to revel in the multitude; and the way your individual experience pans out will depend on any number of variables, including playing style, time of day, choice of weaponry, and relationship with NPCs and, of course, nerve."}