{"ref": "https://www.eurogamer.net/bioshock-7", "date": "16 Oct 2008", "game_name": "BioShock", "text": "It feels a bit strange to be reviewing BioShock almost exactly a year since everyone was last talking about it. Even before it launched on the 360 and PC, it was one of the most widely and thoroughly dissected games of 2007. Riding the hype and backlash seesaw like few games before or since, it attracted reams of praise, (fevered) debate, and impassioned defence along the way.In other words, so much has been said and written about BioShock that I fear there's little I can say about the long awaited PS3 version that won't taste like refried beans. But then, having been reunited with Rapture, BioShock is a game still magnificently capable of inspiring torrents of thoughts and ideas.There's the story, one of the most highly lauded in recent gaming history, but then most of the things I'd want to discuss are precisely the sort of things that patient PS3 gamers probably won't want spoiled. I know I'd have been really annoyed if I'd learned that your character is actually a sexy female cyborg with Hitler's brain right before I started playing last year. Oops.What is safe to learn is that you play as a mysterious man, left splashing about in the ocean after a plane crash in 1960. Swimming for the safety of a mysterious structure, you discover the entrance to Rapture, a secret undersea utopia built by Objectivist demagogue Andrew Ryan fourteen years earlier. Descending into the decaying ruins of this failed social experiment, battling the insane former inhabitants as you go, you slowly uncover the truth behind Rapture's fall. It's a world of faded art deco glamour where Ayn Rand's dream of brilliance unfettered by morality and charity has turned sour, rotted by human nature and encroaching sea water. A nightmare where young girls harvest corpses, protected in their work by lumbering behemoths in heavy diving suits; where doctors mutilate patients in defiance of accepted aesthetics; where poets slaughter for inspiration.But to say any more would be grossly unfair to those who've managed to stay spoiler-free for a whole year. A huge part of what made - and still makes - BioShock a uniquely compelling experience is the sense of discovery as you creep around the varied environments. At a time when so many designers still seem in love with grey and brown tunnels, it's a joy to return to a game built around period detail, bold architecture and a very deliberate, specific and unique sense of place. This holds true of your enemies as well. Find a hiding place and you listen to them, talking manically to themselves as they hunt for you. In one memorable moment, having been done in by a Thuggish Splicer, I lay dying on the floor and was amazed to see them walk up to me and apologise, in their own lunatic manner, for having to kill me.So, the story is still great and still worth experiencing fresh. I could, of course, talk about the technical differences between PS3 and 360...except there really aren't any. Or at least none that my human eyes can detect. I'm sure that a future comparison article will tear the frames apart to lay bare exactly how the PS3 code stands up to the 360, but for the vast majority of players it'll be a moot point. It plays at a steady 30 frames-per-second, with no screen tearing that I could see. Should such nefarious factors appear in the boxed retail version, the options menu contains video toggles that should put things right.As before, the Unreal Engine is put to fine use, conjuring up gruesomely misused medical facilities, decrepit industrial areas and the twisted whimsy of Fort Frolic without a flicker. BioShock is a great looking game, as much for the imagination of what it shows you as for the technical detail, and the PS3 rises to the occasion every bit as successfully as the 360. Perhaps even more so, since this version is free from the annoying - though eventually patched - cache bug that made the 360 version stutter in the later levels. On the other hand, it's another PS3 game that comes with an obligatory install, taking upwards of ten minutes and gobbling up another 5GB of your drive."}