{"ref": "https://www.eurogamer.net/locoroco-2-hands-on", "date": "9 Oct 2008", "game_name": "LocoRoco 2", "text": "It's a strange experience, being applauded for the simplest gaming feats. We're here at the Sony booth at Tokyo Game Show - ~booth~ being an entirely inappropriate word for this magnificent modernist palace of acute angles and pastel lighting, and an entirely appropriate one for the small glassed-off enclosure where we're playing LocoRoco 2. We share the space with a willowy girl in a white uniform and hat that makes her look like a 1950s comic artist's idea of a spaceplane hostess. She natters away in Japanese and hops up and down and claps softly when we do anything right. Anything at all. Managing one jump merits an excited squeal and a standing ovation.But then, that's LocoRoco. This easygoing 2D platformer for PSP never asked much of you (unless you count finding the last few fruit), and gave back out of all proportion, showering the player in colourful, bouncing, babbling, singing, nonsensical beauty and joy. LocoRoco 2 won't be much different, giving even more in the form of a suite of mini-games, a multiplayer mode, and a hugely expanded Mui Mui house. All it will ask of you in return is the ability to manage a couple more actions in addition to left, right and jump - and you won't even need to press new buttons for those.The core of the game is still to guide the rocking and rolling circular Locos through cutaway levels by tilting the level left and right with the shoulder buttons, and clicking both buttons together to jump. You can still gather crowds of little Locos into one gelatinous monster by holding down circle, and split them up to fit through smaller gaps with a tap of the same button.Additionally, Locos can now bite down on certain objects, giving them the ability to hang from little vines and jump from one to the next, catch a floaty ride on a falling dandelion seed, or bite other objects and creatures to pull them out of the ground. You can tip Locos into holes in the ground to hide them or make things happen. You won't know what will happen until it does: it might be the sprouting of a whole new tribe of jolly blobs, or an unexpected rocket launch.Sony's Japan Studio is careful not to overwhelm you with such intimidating depth, so the new actions are introduced in stages by the king of the Mui Muis, those little, limbed purple men who scamper around the screen offering advice and encouragement. As before, if you reach an insurmountable obstacle, it can be worth just waiting a while and seeing what happens.Faced with a pile of rocks, we let the Locos be for a moment and they burst into song, triggering a simple, circular note-matching mini-game. We tap out the rhythm with circle and the song explodes the barrier. Roll on. This mini-game also allows you to collect notes, which unlock new features for the stage you're in.LocoRoco 2 has 25 stages, fewer than the original game, but loaded, Sony claims, with more complexity and replay value. Some of them are just plain harder, something the many who felt the first game was sweet but a little too short will welcome. There's also a lot more physical variety, with underwater stages, airborne dandelion-seed epics, and stages that turn Locos into hyperactive rubber balls, rebounding around complexes of pipes and even Arkanoid-style block walls.There are a few new layers of collectables (notably stamps - more on those in a second), and a ~quest~ system that kicks in after a stage is cleared under certain conditions, and that might challenge you to win a race against Mui Muis, collect five butterflies, or look for the lost Mui Mui King in a level you've already played."}