{"ref": "https://www.eurogamer.net/command-and-conquer-red-alert-3-hands-on", "date": "9 Oct 2008", "game_name": "Command & Conquer: Red Alert 3", "text": "If it does nothing else, Command & Conquer: Red Alert 3 will at least provide conclusive proof that, were it not for the Second World War, the Soviet Union would have developed the technology to make their own hotpants by the 1950s. If you're worried that the success of Company of Heroes may have tempted Red Alert to take itself a bit more seriously this time around, the sight of Russian troops marching into battle decked out in military-themed club-wear confirms that the series has lost none of its sense of humour.This remains a world of cleverly crafted silliness, then, where Einstein has laid a smackdown on Hitler before being clotheslined by the Russians himself, and the battlefields are flush with combat-hardened dolphins and armoured bears. More than any other RTS, Red Alert's chunky units and vivid designs conjure memories of playing with Matchbox cars on the carpet, and a quick glance at one of the new game's maps reveals familiar landscapes filled with colour and sprightly detail. Everywhere you look there are Green Hill Zone-styled palm trees to be flattened under your tank treads, and glossy tin-toy cruisers to be torn up with missiles. This is far removed from the mud and sweat of most war games - even the campy pseudo-seriousness of Command & Conquer itself - and the cartoony playfulness permeates every level.Red Alert 3 is due out on PC and 360 this October (the PS3 version has been shelved due to technical problems, but EA aren't ruling out a later appearance), and while a recent hands on demo had us working with mouse and keyboard, the developers were more than happy to take time out to explain how the game will eventually map to a console controller.Given that we've landed robots on Mars, found proof for Fermat's last theorem, and even managed to develop a product called Pizzaghetti, it seems safe to assume that it's a question of 'how' rather than 'if' the human race will manage to successfully get RTS games to work on consoles. Nobody's cracked it just yet, but everyone's working on their own solution: EndWar's betting on voice commands, Halo Wars has a famous brand and a great deal of friendly purple metal, and Red Alert 3 chooses to build on the experience of a development team who have already done this three times before.  This time out, they've settled on a radial wheel for single-stop item selection, and an expandable paintbrush-style tool for highlighting multiple units (a more conventional drag and drop box is used for the latter on PC). It's a system they've tested out in rougher form on the recent C&C expansion, Kane's Wrath, and the results seemed promising - a few last tweaks as Red Alert 3 heads towards release may turn it into a classic.A chance to play about on Kabana Republic, a smallish Caribbean map from early in the game, reveals that, controls aside, the presence of the 360 hasn't given the series much of an identity crisis. Seasoned players will be immediately at home: as ever, vehicles move with real character, individual fights are explosive and quick, and there's always a chance to make good on defeat with your next unit selection. Even the pace of the battles is the same, with the right unit at the right time capable of crazy glory runs as it cuts a swathe across the map inflicting kill after kill before abruptly coming to a sticky end. And, most promisingly, the ridiculous storyline and crazy designs are still placed on top of maps which have been exhaustively fine-tuned to create fiendish tactical puzzles.But EA Los Angeles isn't playing it entirely safe. For the first time in a Red Alert title, there's a fully realised third faction available, turning the game into a messy struggle between the Soviets, the Allies, and the new Empire of the Rising Sun.Rising Sun's chief differentiator is that they're not constrained by build radiuses, and can therefore create structures anywhere on the map, no matter how far they are from their base. Even with Red Alert's mobile construction vehicles, this is a huge gamble in terms of design. While we haven't had time yet to get a real sense of how this change affects the overall balance, the Rising Sun didn't immediately seem dangerously over-powered. Success or failure, this new freedom will certainly make for some interesting new tactics, as the new faction are far more adaptable than the Soviets or the Allies, as well as being considerably easier to micro-manage."}