{"ref": "https://www.eurogamer.net/overkills-the-walking-dead-review-a-limp-left-4-dead-a-like", "date": "15 Nov 2018", "game_name": "Overkill's The Walking Dead", "text": "It was the environmental storytelling that hooked me first; a thousand tiny, inconsequential props that told me a story that the characters alone could not. Broken glasses. Discarded teddy bears. Solitary shoes. Barbed wire. Crimson stains. Suitcases spilling their disintegrating guts along empty highways. An early teaser promised all this; Overkill was painting a rich, abandoned world, one split wide open and now slowly being reclaimed by the undead. Its developers talked of its exploratory work, its research into what happens to an urban landscape when society splinters. When does paint blister and peel, they asked. When does metal start to rust? I was ready for this world. I know, I know: so many of us are tired of these post-apocalyptic places - especially the ones stuffed with zombies - and I truly do appreciate that weariness. But for all its beautiful brutality and sophisticated storytelling, Telltale's take on The Walking Dead's universe was a little too restrictive for me. I wanted more than that. I wanted a fight. To walk along those empty highways, see those discarded suitcases, step between the rusting cars, see the rotting remains of those still belted up in the vehicles they'd thought would take them to safety. I was ready for a The Walking Dead game that delivered Telltale's stories with The Last of Us's world-building, and from that incredible teaser, it really did look like Overkill was going to do it. It didn't, though.Overkill's The Walking Dead is just another flat, uninspired The Walking Dead game to add to the pile of other flat, uninspired games based upon Robert Kirkman's acclaimed graphic novel series. It's almost impressive, actually, how ably the game transforms such a rich franchise into such a bland game. And it's upsetting to write that, by the way. There's no satisfaction here. Regardless of its controversies and shockingly brutal violence, the TV series understands how to paint these broken worlds, and knowing Kirkman was involved and seeing those early teasers filled me with hope. Sadly, it was false hope, it seems; for as gorgeous as Overkill's offering is, it's essentially empty; empty of content, empty of ideas, and empty of ambition.There's so much we take for granted in the TV show; the environmental design, the dichotomy of good people doing bad things to survive; the constant battle to outlive not just the next walker horde, but the next band of survivors, too. Overkill's The Walking Dead intentionally side-steps existing characters to weave a new story, but while ostensibly this original tale takes place in the same universe as Rick Grimes and co, there's little that tangibly links the two. While, yes, a fan-servicey nod to Rick or Clem would've evoked a smile, no doubt, I'm not salty about it; I was on-board to meet and love a fresh batch of weary-wounded survivors. Instead, I'm introduced to a selection of cookie-cutter characters - the usual tank, support, tactics and scout classes we're oh-so-used to - that lack depth and relatability. They have individual proficiencies, but their weapons are interchangeable, so who you pick has little bearing, really. They're pretty forgettable, too.And unlike Left 4 Dead - which involved a first-on-the-buzzer scramble to grab the character you liked best (read: Nick) - in Overkill's The Walking Dead, there's always the chance of being matched with three other Aidens, all wearing identikit outfits, all recycling the same identikit phrases. On its own, this problem is wholly forgivable, but heaped onto the pile of other issues, it's impossible to overlook. It's as though the game goes out of its way to prevent you from ever truly feeling immersed.Well, I say that you run the risk of being matched with three other Aidens, but actually being matched with anyone at all is something of a lottery. It's unclear to me if it's just technical woes or a worrying lack of fellow players, but filling a lobby is astonishingly difficult. This means at best you'll jump into a mission with an incomplete squad, and at worst, you'll be forced to fight solo - which I sincerely do not recommend.The world Overkill has so carefully crafted - this bruised and battered reality - is chiefly off-limits. We don't get to explore much, only revisit the same old fortify this, fetch that, uh-oh-there's-another-horde-coming missions that lack flavour and finesse. The story vignettes are enticing, yes, but vignettes are pretty much all you get. And yes, there are different ways to complete a mission, and I'm thrilled they're challenging pretty much from the off, but measly checkpoints and that broken matchmaking system rub the shine off those strengths. It's fine to make us work for those rewards, but the minuscule room for error sits at odds with rubberbanding that'll accidentally send you careering head-first into a horde of walkers, and a lack of in-game chat that makes it impossible to work collaboratively with your squadmates.There's a sprinkling of RPG elements - skill-trees, camp upgrades and so on - but they bring little to the experience, and mostly feel a little hollow, just tacked-on time-wasters designed to keep us glued into that loot/reward cycle. Mid-mission you'll find a dearth of ammo and medical supplies, and Aiden mysteriously loses his bat if he temporarily switches to his handgun. This lack of ammunition means you'll likely as not default to melee weapons, but even that's peculiarly unbalanced given there's an inexplicable cooldown system for melee weapons. The game freezes and crashes often, too, taking your hard-earned progression with it. I'm quietly sympathetic to it - well, it's a rare event indeed for a new game to release without a stability hiccup or two - but as even getting into a match is nightmarish, the forced and unforced reboots add an unnecessary layer of frustration to an already frustrating experience. I am agonisingly familiar with the ~lost connection to server~ message.You're also left to work out most of the mechanics yourself. Not a crime in and of itself, no, but given the menu system isn't particularly intuitive, it takes deliberate experimentation to ascertain the systems, rather than have them organically reveal themselves to you through gameplay. You can't skip cut-scenes either, which means fail a chapter, and you'll be forced to sit through the entire sequences - while cinematic and well-crafted - again and again. Most frustratingly of all, there are some real flashes of brilliance here, a heady hint at what could've been. A sound ~alarm~ forces you to slow down and keep it stealthy, or else you'll advertise yourself to the walkers; limited-life silencers ask you to think before you shoot. Each level has a linear pathway, yes, but there are plenty of rewarding shortcuts if you're prepared to explore. With a full team of pals and in-game chat, this could be a riotous way to while away an evening. As it stands, though, those numerous freezes, crashes, and lack of variety just leave me frustrated. Everything about The Walking Dead universe, from the armoury and environments to the stories themselves, seems so achingly well suited to a meaty, mature FPS. And while there's hope that some of these issues can be ironed out with patches and ~seasons~ of content, right now Overkill's The Walking Dead is sadly as sluggish and forgettable as the walkers themselves."}