{"ref": "https://www.eurogamer.net/psp-3000-hands-on", "date": "6 Oct 2008", "game_name": "Reviews", "text": "The first time David Reeves got up on stage and took a new PSP out of his pocket, it was easy to see why he looked so pleased with himself. The PSP-2000 - or Slim & Lite to you and me and the shops - was considerably smaller and lighter, and upon further investigation was clearly a big step forward, introducing USB charging, external video output, and more onboard memory to improve load times.When he did it again in August 2008 though, we all wondered if he'd brought the wrong one. The PSP-3000 - another unofficial name - looked identical to the Slim & Lite, and Reeves' declaration that the screen was much better and that it now had a microphone built in didn't exactly cradle our nethers the way a built-in hard drive or Keeley Hawes might have done. In fact, we wondered what Sony was thinking.The clue, we realised about ten seconds later, was in the name change - or rather the absence of one. ~PSP-3000~ may be the working title, but when it hits the shelves it will still be called the PSP Slim & Lite, because it's not a sequel to the PSP-2000 - it's a hardware revision that also happens to allow Sony to maintain the existing price point, and generate renewed buzz for the platform. Still, we'd never fall for that.So, we've been playing with the PSP-3000 since it turned up on Saturday morning, and apart from a red bar mentioning the ~enhanced screen and built-in microphone~ and a discreet ~PSP-3003 PB~ designation in the bottom-right corner, the box doesn't make much of a song and dance about its brand new occupant.Nor, initially, does the unit itself. The old ~Home~ button has been replaced with a brand-unifying PS-logo button, and the tiny microphone hole is located between the volume controls and the PSP logo itself on the front of the unit at the bottom. The promised curvier edges are so similar that we honestly forgot about them until most of this feature was written and we noticed some shadow gradient on a photograph, and went back and checked.Switching on, the experience is much the same too, with the traditional set-up procedure - picking out a nickname and setting the date - before being plonked on the XMB and left to explore. There's something different about the screen though. In Sony's rather cold words, the colour range has been increased, the contrast ratio is five times that of the old model, the pixel response time has been halved to reduce ghosting, and it should be much easier to play outdoors thanks to anti-reflective gubbins. The ~Color space~ option on the system menu of the new 4.20 firmware installed on our retail unit is more poetic: ~If you set to [Wide], the system's display will appear more vivid.~And it does. The usual four brightness settings are here (three when using the battery, and a fourth super-brightness level when you're plugged into the mains), but the colours at any level are much richer, warmer and deeper than the PSP-2000. As a result, the new PSP's battery-powered third brightness level outshines the mains-powered fourth on its predecessor. If you flick the ~Color space~ option back to Normal, meanwhile, the colouring reverts to something closer to, though still brighter than, the PSP-2000.The difference in visual quality between games running on the PSP-2000 and PSP-3000 isn't as dramatic as the difference between games on the original DS and the DS Lite - the last time we found ourselves considering something of this nature, and a good frame of reference - but it's very noticeable when you return to a PSP-2000 running the same game. Lumines II and God of War: Chains of Olympus on the old hardware look pale and sickly after five minutes playing on the updated hardware."}