{"ref": "https://www.eurogamer.net/pc-roundup-7", "date": "30 Sep 2008", "game_name": "Reviews", "text": "A rather belated sequel to Frozenbyte's 2006 sci-fi shooter, Survivor still does little to mask the debt to Aliens and the many similar titles inspired by James Cameron's militaristic bug hunt over the years. Most notably, it's almost a dead ringer for Team 17's beloved Alien Breed, updated with a slinky graphical makeover and a light underlay of RPG levelling. This alone should make it of interest to many gamers of a certain age.Set in the aftermath of an alien infestation at a human colony on Ganymede, you work your way through a streamlined story mode which sees you trekking from point to point in linear fashion, pausing only to grab as much ammo as you can carry before the next onslaught of snarling extra-terrestrial beasties appears.It may not be intellectual, but it is ferociously satisfying thanks to a small but effective arsenal, which feels meaty and powerful as you bam-bam-bam shots into the advancing monsters, sending them staggering into bloody heaps. There's a tangible physicality to the combat which is more visceral than the top-down viewpoint might suggest. The physics are solid and dependable, giving each item of debris in your path its own sense of weight and momentum. It also gives you a small element of strategy, since short alternate paths can sometimes be found by wading through the lighter piles of trash. The lighting is great as well, resulting in a game that's atmospheric, especially when you bust out the flashlight to poke around in dark corners.The upgrade system is simple, but just enough to make it more than a mindless fragfest. Each kill inches your EXP bar slightly higher, and each new level achieved gives you the option to spend your points on new skills or items - a motion tracker, for instance, or the ability to grapple with the larger boss aliens and try your luck at putting a bullet straight into the brain. Similar progression is applied your weapons, which can be improved by spending the tokens occasionally dropped by dead aliens. The skill tree is nicely paced, offering enough in the early stages to hook you, but ensuring that the really good stuff will always require some careful saving to attain.The trouble is that Shadowgrounds was a game bursting with unrealised potential, and this sequel still leaves too much of that potential untouched. The continual lack of online play leaves a particularly obvious hole in the game's score sheet, since with some larger maps and more complex campaign objectives it has all the makings of a major cult hit. There are new features here - three characters to play as, some additional weapons - but despite marginal improvements the game is essentially the same as two years ago. Instead of taking things up a notch, it seems the developer seems happy to tread water. Shame.7/10"}