{"ref": "https://www.eurogamer.net/resistance-2-hands-on", "date": "27 Sep 2008", "game_name": "Resistance 2", "text": "There are plenty of clichés being bandied about at this latest press event for Resistance 2. Insomniac boss Ted Price claims it's ~the biggest and the best game we've ever made~, following up with the classic ~it's ultimately up to the players to decide~. There's been a lot of talk about how extra-specially powerful the PS3 is, and the chap in charge of the eight-player co-op mode has used the word ~revolutionary~ at least twice. And on top of all that, Price proclaims Resistance 2 is ~offering more than any shooter in 2008, and at the same time being the best~. It's a bold claim when you consider just how many shooters have been and will be released in 2008 - including Gears of War 2, which is going head-to-head with Resistance 2 this November. ~I think we can hold our own against Gears, no problem,~ says Price. ~Our intent with this game is to create a shooter that offers something for both hardcore and casual players, and fans of single-player campaigns that are story-driven, and co-op players and competitive players... It's a big game with a lot going for it.~ With so many shooters on the shelves, though, it's going to take more than a plot, a Deathmatch mode and a bit of Capture the Flag to make Resistance 2 stand out. In any case, you'd need a more distinctive plot than this one; it's not exactly the only game around that involves shooting monsters in the face in a post-apocalyptic America. But with the multiplayer modes - which today's event is focusing on showing off - Insomniac is certainly trying to do something different. Perhaps even revolutionary. Let's begin with the competitive multiplayer mode, which this time round supports 60 players, instead of the first game's 40. According to Price, this created significant design challenges the team has worked hard to overcome. ~When you have 60 players in a game, things can become very chaotic,~ he observes. ~We had to go back to the drawing board with our designs, and figure out how we could mitigate chaos and create some order. That's why we started splitting players into squads. But what really makes the skirmish mode unique is the dynamic objective system. You're not doing the same thing over and over, and you're spread out over the map.~ The dynamic objective system works like this: you're put in a squad of five-to-eight people and your squad is assigned a mission, such as laying claim to a specific area. Completing missions unlocks new areas and you're awarded experience points, which are used to obtain Berserks. These are power-ups, essentially. You might win an ammo upgrade for all your team-mates, or a temporary damage bonus. You can also combine Berserks with weapons to suit your playing style. Choose the Ironheart armour Berserk to go with your mini-gun and shield combo, for example, and you'll become very tough to take down. Other Berserks give you adrenaline bursts, increased melee attack power, even the power of invisibility. ~There's nothing like it on PS3,~ says Price. The Berserk system ties in with one of Insomniac's main aims for Resistance 2 - to encourage creative player decisions by presenting them with more creative weapons. Price's personal favourite is the splicer; rev up the spinning blade to full speed before firing it at an enemy and the blade will continue to whir even after it's hit the target, sending chunks of flesh flying into the air. ~It's a great damage-over-time weapon, especially if you are fighting a larger enemy,~ explains Price. ~You can stick several saw blades in them that are all doing damage while you use another weapon to take them down.~To create weapons like these, Insomniac has taken inspiration from its own games - specifically, in the case of the splicer, Ratchet and Clank: Up Your Arsenal. But isn't Price worried about alienating serious FPS fans with this wackier approach to weapons? ~That's where the gore comes in, to tell you the truth,~ he says. ~You can do some really creative weapons, but as long as you keep it visceral and believable, that's where the hardcore fans will nod and say, 'Okay, that makes sense.'~"}