{"ref": "https://www.eurogamer.net/gtr-evolution-review", "date": "27 Sep 2008", "game_name": "GTR Evolution", "text": "Poor old SimBin. They really don't have a clue when it comes to making race sims. Look at this one: no quad bikes, no supertrucks, no dune buggies, no karts. No nitrous bottles or touge battles, no skill stats or slo-mo crashes. Hell, you don't even get to negotiate your own sponsorship deals (sorry Anusol) or floor your arch-nemesis/cyborg half-brother in a pit lane punch-up.It's almost as if the studio considered such things unimportant. It's almost as if they consciously decided to channel all their skill and industry into trivialities like physics, track modelling and AI.Baffling.Oh well, at least they're consistent. GTR, GTR2, GT Legends and now this, an expanded version of last year's excellent RACE 07 have all had SimBin's input and have all put realism firmly before razzamatazz. The closest thing to a populist feature in GTR: Evo is the crammed garage; RACE's 20-strong field of touring cars and open-wheelers have had to shove over and make room for two dozen additions. Most of the newbies are the kind of alarmingly well-endowed automotive porn stars that go through life without ever visiting a Tesco car park or attending a boot sale. Cars like the Aston Martin DBR9, the Lister Storm and the Gillet Vertigo Streiff would be rubbish at a boot sale - what with having boots the size of actual boots - but on the track, they're in their element (Zoomium. Find it next to Crashium and Pleaseslowdowndearium on the Periodic Table).Hurtle them round any of the 40-plus circuit configurations and any misgivings about spartan presentation and fusty graphics soon evaporate. The Wagnerian clamour of the V8s, the palpable sense of mass in motion, the furious tyre versus road judo...  It's all so perfect, so utterly convincing, the fact you don't know the name of your chief mechanic, or didn't get to ogle the cleavage of a polygonal grid girl before the start, doesn't seem to matter in the slightest. This is racing pure and simple. When a sim dev gets the science right, the poetry usually follows.Four badges you won't find in GTR: Evo's eerily people-free pit lanes are those of Porsche, Ferrari, Lamborghini and Maserati. Carbon-fibre cheetahs like the Gumpert Apollo, Koenigsegg CCGT and Saleen S7 do a sterling job of filling the glamour gap, but there's an air of absence all the same. With SimBin-buddies Blimey currently coding a Ferrari-focussed sim you would have thought the odd Fezza might have sneaked in. Oh well, there's always mods (they're starting to appear already) or old friend GTR2.The closest you get to an official Lambo in the game is the new Gallardo-based Audi R8. Simbin's first AWD recreation, this predictably grippy super-coupe is the ideal foil for GTR: Evo's awesome centrepiece, an incredibly credible depiction of the 24km-long Nordschleife. It's taken them years to get round to it, but it's been worth the wait. I don't care if you've driven the Ring a thousand times before in other sims; this version will leave you sweatier, happier and more exhilarated than you've ever been before.Readers who drive: picture your favourite bend, that corner on the way to work or town, that warms your cockles like no other. Now picture a hundred curves of a similarly satisfying character strung together into one mad, marvellous route. That's Nordschleife. Swooping, snaking, tree-lined, endless, this is the kind of track you could drive exclusively for a year and never get bored of. It has a bit of everything: kinks, dips, humps, banked corners, ridiculously long straights, railway crossings, broken bridges, police checkpoints, underground sections in lava-lit caves... Okay, not everything, but it is shockingly huge and fabulously varied.I'll leave others to testify to the accuracy of the topography. Race sim forums are currently full of folk who have driven the real thing and claim this is as close as you're going to get on a desktop. Yes, they might all be fantasists or SimBin stooges, but it's hard to argue against the evidence.Take out Nordschleife and the Grand Tourers, and GTR: Evo is basically RACE 07 in a new box - which is no bad thing. AI routines are possibly a fraction sharper - computer-controlled drivers seem slightly quicker and more dogged now - and handling characteristics a smidgen friendlier, but there's been no root-and-branch reform. As in previous SimBin offerings, the experience can be shaped to suit all abilities/states of inebriation. With driving aids disabled, a bit of rain on the track, and AI driver skill maxed-out, you will probably get eaten alive. On a bone-dry circuit with a gentler set-up, even the greenest drivers are going to get to spray the Mumm now and again.Not that winning is all that important in GTR: Evo. The reason this game and its predecessors perch atop their genre is they make every sweet passing move, crisply negotiated corner and shaved second feel like a podium finish. When correcting a slide at Druids or coming in ninth in the rain at Anderstorp makes you smile like a driver that's just beaten his arch-nemesis/cyborg half-brother to win the World Championship and heard his chief engineer/father-substitute has survived a risky heart op, you know you're in the presence of class."}