{"ref": "https://www.eurogamer.net/multiwinia-survival-of-the-flattest-review", "date": "27 Sep 2008", "game_name": "Multiwinia: Survival of the Flattest", "text": "We're living in the age of blockbuster bloat. Enormous lumbering AAA franchises gobble up multi-million dollar budgets so they can woo us with talk of sequels and spin-offs that are bigger, shinier, more, more, more. ~Come and play Grumpy Space Marine Guy 4!~ they beckon. ~Not only can you shoot an enemy's limbs off, but the new Surgi-Cam feature lets you zoom into individual spurting veins and control miniature nuclear nanobots directly into their heart for the ultimate finishing move!~~That's nothing!~ counter the people behind Urban Ruffian VI: Crime Of Your Life. ~Our gameworld is larger than Brazil, and features PiddleX technology. Your character has a fully working 9000 polygon bladder, and if you fail to wash your hands after going wee-wee virtual germs will stay on your fingers and make you sick next time you eat something, which you bought from our real-time microtransaction online snack bars, owned by a character who is voiced by Spike from Buffy even though he's only in the game for ten seconds.~~Excuse us,~ pipes up a quiet voice at the back. ~But we've made a sequel to our cult hit Darwinia and it's actually even more simplified than the already stripped-down original. And the characters are flat pixel stick men. And they can't speak because they don't have faces.~Oh, Introversion. Gaming needs you now, more than ever.When it arrived in 2005 Darwinia became beloved by indie PC homebrew enthusiasts, prancing away with the top prize at the Independent Games Festival. Brimming with affectionate tributes to the ephemera of gaming history, from fake scrolling pirate intros to Clive Sinclair avatars, it was mostly a strategy game, albeit one with a post-modern fizz. Sort of like Syndicate crossed with an artificial life program, and then beamed through the prism of early Atari arcade games. You could throw a little of Durell's Fat Worm Blows A Sparky in there too, if you wanted to get all conceptual and obscure.For this multiplayer follow-up, the back-to-basics approach has become even more basic. The gameplay skews a lot closer to the traditional RTS formula this time, with the linear explorative action of old replaced with something far more direct and aggressive. No longer striving to free their computerised realm from the grips of a corrupting virus, the Darwinians are now locked in mortal combat with each other. The change in tone is necessitated by the demands of hot multiplayer action, but I can't help missing the earnest underdog charm that these stiff little creatures displayed in 2005. Seeing them as hordes of bloodthirsty warriors feels odd. Of course, the fact that I've formed an emotional attachment to a virtual species that looks like the Blair Witch logo drawn on the ZX81 says a lot for just how good Introversion are at this sort of thing.There are six game modes, playable across 50 maps. Domination is a straight deathmatch, where victory involves wiping out the enemy. King of the Hill and Blitzkrieg are hold and defend missions, with points awarded for possession of key zones on the map."}