{"ref": "https://www.eurogamer.net/banjo-kazooie-nuts-bolts-5-7", "date": "11 Sep 2008", "game_name": "Banjo-Kazooie: Nuts & Bolts", "text": "With only weeks to go before Rare's venerable Banjo-Kazooie franchise emerges from its decade-long slumber, the game is seriously taking shape. This week, at Microsoft's UK headquarters in Reading, we were able to go hands-on with almost finished (albeit not yet bug-free) code.You can tell a game is approaching its final state when the small touches start appearing - like loading screens bearing helpful hints, tips and suggestions. One of those tips in particular caught our eye - suggesting that if you aren't getting along with vehicle-based gaming, perhaps you might like to try out the Xbox Live Arcade download of Banjo-Kazooie instead.It's a bit of a throwaway comment (and we suspect it might not make it to the final version), but it sums up our primary misgiving about Banjo-Kazooie: Nuts & Bolts rather well. A lot of players, we suspect, are going to find that this game has rather too much emphasis on Nuts & Bolts, and not quite enough Banjo-Kazooie to go around. It's going to be a controversial one, and right now, that could be Good Controversial or Bad Controversial. It's tough to call. It could go either way.In essence, then, this is a game about vehicles. Its nod to its platforming roots lies in the progression system, which is a fairly pure example of Nintendo's well-worn Mario 64 system in action. The idea is that a chap called Log has decided to settle the battle between Banjo and Grunty for once and for all. In order to achieve this, he has created a number of game worlds and populated them with challenges - Banjo has to complete them, Grunty has to stop him.This gives us our hub world - Showdown Town, a city environment dominated by Log's Castle. Showdown Town has a large number of districts, only one of which (the Central Square) is accessible at the outset. There's also one challenge world available to begin with, Nutty Acres. As you progress, Log will give you new worlds to play with - these come in the form of crystal balls which need to be transported across town (progressively further away from Central Square) and placed on pedastals to activate dormant gateways.Each world is accessed by several different doorways - and depending on which doorway you enter via, there'll be a number of different challenges on offer. Some doorways open as soon as you place the game sphere on the pedestal - others will only open when you achieve a certain Jiggy Score, indicated by the number above the doorframe.Jiggys, of course, remain the currency you're awarded for each challenge you complete - the direct analogue of Mario's Stars. One interesting tweak, however, is that you have an opportunity to earn a TT Trophy for completing challenges in excellent time - win the trophy, and you'll earn a quarter-Jiggy, so four trophies add up to an extra Jiggy in the bank.Each game world is uniquely themed, and is introduced by a retro-TV style video when you first unlock the world. In a nice twist, all of the standard characters from Showdown Town appear in each gameworld in different guises - Rare has deliberately given this an amateur dramatics society feel, with rather weak costumes and some bad character acting thrown in for laughs. Similarly, each world has been crafted to look like it's been stitched together imperfectly by Log himself. ~The design was that Log had created these worlds, and we wanted them to look like they'd been created,~ lead technical artist Neil Harrison explains. ~Our idea was that he's done quite a good job of creating these worlds, but not perfect. There are holes in the floor which have been patched up, and sometimes you can see the workings of the levels, big cogs under the floor and that sort of thing.~ It's one of the nicest aspects of the game's unique visuals and was, Harrison claims, a fun challenge for the art team. ~It's almost like you're trying to deliberately make things look bad sometimes, and that's quite risky.~It would be quite easy to make a level with grass, put next-gen grass effects on it all blowing in the wind, and that looks great - that's what people expect. If you want to make it look constructed, though, you have to ask how you make it look as good as that, but without doing that - making this patchwork of fabric instead.~"}