{"ref": "https://www.eurogamer.net/wiiware-and-virtual-console-roundup-review", "date": "3 Sep 2008", "game_name": "Reviews", "text": "It's always nice to be surprised (unless the surprise involves a clown shining a torch in your face in the middle of the night) and MaBoShi is a very surprising game. It's a quiet, unassuming little thing, sitting there on the Wii Shop shelf and doing very little to alert you to the evil genius lurking behind its obscure title. It's a compound word, you see, made up of the abbreviated Japanese words for Ball (maru), Stick (bou) and Square (shikaku), and these are the geometric shapes around which the three mini-games within revolve. Often literally. As the suffix suggests, this is a game made up of three parts - one game for each shape, all using minimal controls. The Ball game involves a constantly rotating sphere trapped in a wooden circle. Pressing the A button reverses the direction of the rotation, and you must use this basic Newtonian concept to manoeuvre the ball around the play area, hitting tiny enemies before they can escape.The Stick game uses concepts of movement familiar from the hammer event in countless track and field games. There's a constantly spinning stick, with a vulnerable ~core~ at one end. This core is the centre of the stick's rotation, and pressing and holding A launches the stick using the momentum of its swing. Destroying blocks and enemies is the goal, but only the stick can strike these objects. If the core takes a hit, it's game over.Finally, the Square game is a little like Snake, or the light-cycles from Tron, but with a twist. You move a tiny square around a vertical grid using the d-pad, leaving a trail of fire in your wake. However, the screen only scrolls every time you move. Green blocks can be destroyed by touching them with your fiery trail, but all blocks must be burned up by the time they reach the bottom of the screen.That's just the basics, but already you've got a fantastic trio of physics-based arcade puzzle games. MaBoShi goes one further though. You play your chosen game in one of three parallel windows. After a short time, AI players will start playing in the other windows - or human players can join in and do the same. Here's where it crosses over into the realms of genius: although the playfields are separate, they can affect each other. Swing the Stick off the edge of its box, and it can destroy blocks in the Square game or wallop the Ball. Destroyed enemies from Ball will arc across the three boards, as will burning blocks from Square.It's a multi-tiered gameplay system that demands not only fast reactions, but also mind-bogglingly complex mental agility to take account of all the factors in play. Your actions can help, or hinder, the other players, by accident or design. It's deceptively simple, yet incredibly rich the more you think about it. A million points is your goal, as dictated by the sporadic appearances of Mr MaBoShi, but with only one life per game it's a goal you'll really have to work at.Judged purely on its ideas and gameplay, MaBoShi comes highly recommended to anyone with a taste for Japan's oddball puzzle games. And yet there's still more to unearth through dedicated play, including replays of your best runs that you can send to your Wii Friends, as well as the ability to download a smaller version of the game to your DS - completely free. And all this for just 800 Points. Such thought and generosity puts most of the WiiWare line-up to shame.9/10"}