{"ref": "https://www.eurogamer.net/viva-pinata-pocket-paradise-review", "date": "2 Sep 2008", "game_name": "Viva Piñata: Pocket Paradise", "text": "It's not often that the DS gets to stomp all over the Xbox 360 (unless you live in Japan, in which case it's all day every day that the DS gets to stomp all over the Xbox 360), but when it comes to Rare's lovable gardening strategy game Viva Piñata, Microsoft's multi-core lounge-dweller can definitely count itself muddied by the Wellington-shaped boot-prints of its dual-screen contemporary. Viva Piñata: Pocket Paradise lives up to its name, although it certainly hasn't spent much time in my pocket.First, and most important, is that Rare has been able to recreate the Xbox 360 game on DS almost entirely. Beginning with a patch of rubble-strewn land, you're given a spade, a watering can and brief instruction, and left to clear and turf the place over. But no sooner have you begun to clear up the mess than small animals start to take an interest, and within an hour the compelling conflict of interests is established: whenever you think you're getting the garden looking nice, another piñata animal pops up and charms you into re-sculpting and cultivating your land to fulfill its requirements for residency and then breeding. And then another. For hours.On Xbox 360, Viva Piñata relied on cute animations and a wealth of things to do in order to keep the player occupied, and while the garden area is smaller on DS, there are actually a few more creatures, and the pace and mechanics of gameplay are intact and finessed thanks to the second best thing about Pocket Paradise: the new touch-based controls. Simple actions, like moving apples and crates around the garden, or planting seeds, are as simple as dragging and dropping with the stylus. Grass is simply drawn on the screen, and to direct animals you just tap them and drag the stylus tip to a suitable location. Basic tools and their actions - like the spade's tap, smack, plough and pond-digging - are all within your control after a couple of super-quick stylus' taps on logically-positioned icons, and while your stylus hand taps away your thumb uses the d-pad or face buttons to move the camera.Subtler actions - like renaming an animal or digging out the residency requirements for a piñata currently tiptoeing apprehensively around the borders of your plot - are more elaborate, but still easily remembered. Like the upcoming Viva Piñata 360 sequel, you can tap on and examine animals slightly outside the chalk outline of your garden, too, which makes it easy to see what they need in order to step inside. The encyclopedia, awards and other resources that help you to make the most of your seeds, buildings and tools can be accessed by pressing the right shoulder button to swap the garden and information screens around and then tapping the relevant button.What's more, it's all quick. Xbox 360 owners had to spend hours staring at the cumulative loading screens in order to visit the shop where you buy seeds, garden furniture and other items, or the doctor, or the tinker-man who transforms bread into sandwiches and milk into cheese. But DS owners either hit these screens instantly and get what they need just as quickly, or don't even have to visit them; the doctor and tinker-man, for example, can be deployed by tapping two icons on the garden screen and then selecting the piñata or object to be cured or tinkered. There's also less clutter; there are still a great many messages alerting you to sightings, illnesses, fights and so on, but they appear above the hinge rather than piling up along the bottom of the garden screen.After the content and interface, the rosiest apple in the Pocket Paradise bushel is the game's graphics: another smashing adaptation of the 360 source material. The original animals were paper-tasselled, processor-smashing perfection (we called them Rare's sexiest effect since Donkey Kong Country, from memory), but even without the benefit of that high-definition effect, the chunkifying implication of the reduced resolution delivers much the same. Whether it's the doe-eyed charm of the sparrowmints, the gentle bumbling of the fizzlybear or the stumpy tottering of the sherbats (and the uniformly excellent names, clearly), the game's personality shines past the DS' graphical restrictions, and the decision to back the animals up with rendered 2D sprites for more complex objects like trees and buildings was a sensible one."}