{"ref": "https://www.eurogamer.net/killzone-2-8-6-5", "date": "29 Aug 2008", "game_name": "Killzone 2", "text": "Heavy Rain may have been the cover star of the Games Convention, with LittleBigPlanet jumping around in the background, but Killzone 2 was there as well, hidden away, much as it was at E3, with Guerrilla's Eric Boltjes and others keen to talk to the press about the multiplayer ahead of the game's increasingly close February 2009 release.For this latest airing of the multiplayer, Boltjes wants to get across how accessible the game will be. ~For us it meant that everybody, regardless of whether they're a new player to the FPS genre or if they're an experienced online player should be able to go online, join games and start playing the game as quickly as possible,~ he says. But getting seamlessly into the action isn't the only concern. It's how to keep people there once they're in, and get them used to the game's features without overwhelming them.~We really want to introduce new features gradually, so as you play, as you score points you unlock new things,~ he adds. ~You get new features and then still have enough scope left for the more advanced features for our hardcore audience to still be interested over the longer term.~To help get players used to all this, Killzone 2 will include computer-controlled enemy bots in both offline and online multiplayer - firstly as a means of giving players an offline safe haven to learn the ropes, and secondly to give the option of fleshing out matches where you might want a few more players and can't be bothered to wait around for the lobbies to fill up. Boltjes says the bots ~mimic human behaviour~ (hopefully not singing inanely) and will ~pretty much do anything that a player can do online as well, including play all the missions, use all the abilities and use all the weapons~, although we're not given the chance to see them in action.Continuing with the 'everyone can play' mantra, Boltjes adds that this emphasis on accessibility runs throughout every design decision. ~We want to make sure that players aren't just thrown into the deep end, so almost every feature in Killzone 2 multiplayer unlocks as you score points and as you join games. This system allows for a very natural learning curve throughout because the player is introduced more slowly to every feature, one by one.~As we noted at length in our huge Killzone 2 multiplayer preview last month, Killzone 2's online feature list is absolutely exhaustive. There's five game types (assassinations, body-count, capture and hold, search and destroy, and CTF variant search and retrieve) and eight maps, with each map capable of supporting every game type. Some of the maps will be better suited for 2-16 players, while others support up to 32 players. That said, if you want to cram 32 players into a smaller map, you can do just that.Cunningly, players will also be able to create a session that allows them to play through each game type on the same map - with a massive amount of customisation possible. ~We want you to play the game just the way you like it - you can create any type of game and change almost every aspect of it,~ says Boltjes. So, if the host so desires, they can specify the exact weapon types present, bomb defusal times, revival time, the skill level of players that can join the game, and even password the session if you really want to keep the great unwashed out.Game progression is a big deal, too, with Guerrilla keen to make it ~as transparent as possible~. ~At the end of every game, you see how many points you've scored,~ Boltjes points out, although we probably guessed that one. ~You can see if you've ranked up, you see what you've unlocked, how you can use it and how it benefits you. The game features 12 military ranks, each unlocking new features. In addition we have 46 different medals which you earn by doing special things in the game, such as doing ten headshots or reviving ten people."}