{"ref": "https://www.eurogamer.net/champions-online-hands-on", "date": "29 Aug 2008", "game_name": "Champions Online", "text": "Champions Online is a bit of a button-masher. That's not always meant as a compliment; but to the sizeable contingent of gamers out there waiting for a true action-MMO - yearning for a departure from the slow, formal mouse-click waltzes of traditional MMORPG combat - it should be music to their ears. Button-mashing implies speed. Button-mashing implies physicality. Most important of all, button-mashing implies buttons.As we explained when we saw it at E3, Champions Online is a massively multiplayer superhero RPG being developed from the ground up for both PC and Xbox 360, and is scheduled to be released on both formats in the spring of 2009. It was demoed then on PC hardware, but controlled using 360 game pads; and that's exactly how we played it ourselves when we scored some hands-on time at last week's Games Convention.Before you even get to the action, however, there's one button in Champions Online that you may never be able to stop mashing: the ~randomise~ button on the character-creation screen. Cryptic made its name with a character-creation system of unparalleled flexibility and depth on its first superhero MMO, City of Heroes (so much so that Alec wrote us a love letter to it). We expected Champions' equivalent to be powerful, but nonetheless, what we saw blew us away.You start by picking your gender and some basic variables - height, body mass, muscle size. Then there's the more unusual ~stance~ - a set of poses and animations, from Heroic to Beast, that gives your character some personality and defines how it moves. We pick the crouched, lolloping Beast.Then you segue into a bewilderingly vast set of options for tweaking details of appearance and costume design. We're short on time, so go straight for the randomise button - and something truly magical happens. Every press generates a unique and startlingly cool hero: an impish, horned demon; an alien being with a skin of reflective mercury and fireball for a head; a cybernetic warrior with skeletal robotic limbs. Champions Online is a simply inexhaustible factory for charismatic super-beings. It's with regret that we have to give up and plump for one, but we do, settling on a black-masked and clawed character with glowing eyes and a ridiculous turned-up collar on his catsuit, part Nightcrawler, part Deadman.Selecting your super-powers isn't quite as free-form - or at least, not yet. There are eight groups of powers - Darkness, Ego, Electricity, Force Fields, Mesmerism, Might, Power Armour and Sorcery. At the moment, you're required to pick primary and secondary groups (Darkness and Force Fields please thank you), but content designer Aaron Saffronoff tells us that the finished game should afford more liberty.~It's still changing, as we keep opening up the system and breaking down the walls,~ he says. ~For testing and implementation purposes, they start out in groups - it's natural for us to test them in groups. Our expectation is that you'll be able to choose any powers at any intervals, with some exceptions. You might have to drill a little bit farther into a particular group in order to access its most powerful ability.~Each power has three levels, at the cost of one skill point apiece. Skill points will be awarded every level for the first 50 levels, so there's a constant choice between levelling up your skills and expanding your repertoire. We suspect many players - 360 players, at any rate - will go for the former, just to limit the amount of hot-swapping they have to do.As it stands, skills are quickly allocated from your tray (this PC version has a standard skill-bar along the bottom of the screen) to the top three face buttons, with a trigger being used to switch between sets of three. Other buttons take care of blocking - an important part of combat - and jumping - which also acts as a modifier on your attacks, changing their animation and damage output.To keep things from getting cumbersome, you won't want more than 6 or 9 skills allocated to face buttons at any one time. Saffronoff explains that areas of the game are being designed around certain skill sets, with the idea that players will tailor their control setup according to where, and what, they're fighting. It's an interesting notion, although we're concerned that it might lead to some sameiness and pigeonholing in the skill design - and there still needs to be a decent system for quickly accessing skills you haven't assigned. On top of this, Cryptic is looking into a system of button shortcuts for text-based party chat on 360, to supplement voice chat.Skills picked, we jump into battle. At Leipzig, Cryptic is demonstrating a Stronghold for the first time - Strongholds are funny-book dungeons, instanced encounters designed for five-man groups. With the aid of some cheats, we find ourselves soloing the clinical white corridors of Teleios' Tower, a super-villain's lair in the Canadian Wilderness region. Teleios is a mad scientist whose headquarters is overrun with clones of himself, mind-controlled dinosaurs and radioactive gloop, and the Tower ends in a boss fight with a giant floating brain. Cryptic's talent for cooking up gleefully unrestrained silver-age nonsense shows no sign of dimming."}