{"ref": "https://www.eurogamer.net/football-manager-2019-review-rare-blip-in-form-for-a-sim-with-permanent-class", "date": "30 Oct 2018", "game_name": "Football Manager 2019", "text": "Sometimes - and I promise it's never for very long - I wonder why I like Football Manager. It's tempting to draw the easy comparison with football itself, to liken the highs and the lows to the perpetual undulations of your side's form out here in reality. But that's not it. Catch me at a moment of managerial despair and it'll rarely be after a loss, as much as those 40-shot, 80-per-cent-possession slumps at home can hurt. No, if I'm wondering why I do it to myself and what it's all for, it'll be because I've encountered a puzzle I cannot solve.Football Manager is a puzzle game, after all. It's a lot of games really - and that, if you were wondering, is part of why I love it - but it's a puzzle game first, I reckon. Because it's about fixing things - solving things - and getting them back up and running. It's an engineering sim as much as a management one, where it's your job to find a creaking, groaning, vintage locomotive and restore it to rightful, righteous condition. I know a lot of people are different, but that's why the cycle of despair is worth it for me: when you crack it. When you find the solution, be it a stubborn transfer negotiation or a huffing and puffing attack that just needs a goal to let the weight off. To get moving, so the old leviathan croaks and churns and rumbles into life. That too is why it's so frustrating when Football Manager 2019 teases you with a whole new way of solving your problems, a new toolbox for tinkering, only to force you away with an astonishing, extraordinarily impenetrable way of actually using it.In Football Manager 2019 that big, frustrating addition is a totally reworked way of handling training. I appreciate that sounds like it's not that big a deal but the training ground, when you think about it, is where a lot of any professional football club's time and effort is actually spent. Pundits call the midfield the engine room and that might be true, at least on the pitch, but the engine room of a club, the thing you're looking after, gaffer, is where you train. Put it like that and it makes sense Sports Interactive would look to expand on it in FM19. Training has often felt pretty neglected in Football Manager, given the sheer number of days you'd spend out there barking feedback and planning sessions if you were the real deal, with previous games in the series boiling it down to the essence of hiring your staff well and distributing their time efficiently. Get a five star coach in each discipline and hire enough of them to keep the workload light, and job done.Not so in Football Manager 2019. The 'Coaches' panel that was previously the focus of your brief but pleasant pre-season tinkering in years gone by is now just the sub-page of a sub-page.On the face of it this is welcome. Depth is good, we like depth; more to figure out and optimise and lovingly caress into efficiency. The problem is that in chasing the dream of realistic day-to-day simulation of the life of a real manager Sports Interactive has created a monster. In FM19 you're no longer just in charge of hiring good coaches, setting a few extra rest days or assigning some additional focus for Rashford on his Finishing. You now have three sessions a day, seven days a week, 365 days - minus a couple weeks' summer holiday - a year to plan out. Or at least I think you do; it's not really clear, even after quite some time playing, which in a way is the problem. FM19's training section is in dire need of an overview that provides an overview of the information that actually matters when setting up your coaches' approach: who is training what attributes, and are they training them too little, too much, or just the right amount. Instead, I can bore down into the some near-50 training sessions to choose from - nearly 50! - and try to assign three per day ad infinitum, in such a way that perfectly blends every tactic, player, position, and unit's wants and needs, and lose myself forever in the subscreen-subscreen's vortex of opacity, or I can ignore it - which, in a management simulator, is perhaps the ultimate sin.Actually, I think perhaps it's the ultimate sin to put me in that position in the first place. Add depth, sure. Make it complicated. Make it hellishly convoluted if you like. Just present me with the information that I need to know, once I've figured out what the information that I need to know is, and a system that lets me easily put it into practice. In other parts of the game this will ring true: even when I do want to take a break from the more grating sides of management and, say, leave my Assistant Manager to talk to the press, I'm in control even as I relinquish it. I know my Assistant Manager's personality, and their tactical preferences, and their attributes, and I know that if they aren't right I can either hire a new Assistant Manager or handle the task myself. Training, by contrast, is automatically populated even when I'm in charge of it, but it's not clear who or what decides how its populated, or if it's basically fine as it is anyway.It's worth mentioning that the version of Football Manager 2019 that I played for review was the beta build, meaning that, naturally, there were some bugs. These included certain players not having a 'Natural' role and duty in any position and instead being stuck at Accomplished, set-piece takers being auto-populated with random players that weren't at my club, and the match engine radar map staying on-screen, like a kind of burn-in effect, when the sidebar I had it pinned to was minimised.All that said, they were the only bugs I encountered in the beta, and I've never found anything close to that in the final version of a Football Manager game. I've more than enough faith in Sports Interactive's record of ironing them out in time.Other impacts and systems are now obfuscated or just plain hidden altogether, when previously they were well known. Players now have a Training Rating score, for instance, which is great, and very welcome, but there are issues: previously your way of knowing how a player worked in training was to see a drop in their stats after the fact. Chastise their work rate and they'd promise to do better, maybe see an increase in their Determination, and work harder next time.In FM19 that was no longer the case: at Manchester United I had David De Gea get a high Training Rating, a good write up from the coaching staff, be in great form and condition and high spirits, and see a drop in attributes across the board. I tried the old method of criticising his effort only for him to politely and, quite rightfully, protest that he'd been training perfectly well thank-you-very-much. So what gives? Presented with moments like this, you're left with two unpalatable options: it's not supposed to happen, and you've found a bug; or it's supposed to happen, but there's no way to know why, or how to prevent it, or how to respond. It's disempowering, in a game about being in charge; asking you to solve a puzzle - or better yet, play a game - without first knowing the rules.I appreciate this is an enormous amount of time to spend on one aspect of an already broad game, but it is an enormous aspect - I've covered about two of the seven tabs in the game's training section, and I've more to say about just them - and the vast ineffability of it kind of speaks to the point: that FM19's training overhaul is huge but hugely overambitious, like a promoted side spending its freshly minted Premier League cash on 23 new players, who are all probably quite good, but not thinking about how they might gel together. It is a genuine shame, because Football Manager 2019 is a lot more than one new system, and almost everything else works to perfection. Outside of the anomaly of training for instance, clarity, and more importantly feedback on your many decisions' impact, has improved across the board. You can now see players' reactions to your touchline shouts mid-match, getting a sense of who's overwhelmed by the instruction and who's responded with a new sense of focus. It's one of feels-like-millions of the little changes for the better, that are now expected from and consistently delivered by Sports Interactive each year. Others include a display of your scouting team's priorities, so you can better understand and control the order in which they'll generate reports on scouted players, and the many improvements to animation in the match engine, ball movement in particular. I can tell you now that Football Manager 2019 has objectively the most swaz of any Football Manager so far.Tactically, Football Manager is the best it's ever been in 2019. The new presets, like the now famous Gegenpress of Jurgen Klopp, classic Catenaccio, or not one but two types of Tiki-Taka lend newer players a simple jumping-on point for tactical setups, or a starting template from which to tune and experiment and examples for how to build from scratch for the more experienced who want to make their own. There's no sense of requirement to conform to them, but having the pre-made tactics there gives you a good measure of what your Guardiolan ideal is supposed to look like in the textbook, so you have context for just how avant garde you then want to get with your own. An unintended downside, though, is that it also only worsens the perception of the game's spaghetti-bowl approach to the training system, when you compare them side-by-side.More important still, tactical instructions are now far more intuitively laid out - and in far closer fashion to the terminology of the real thing, too. You can drag your 'line of engagement' up and down to dictate where exactly on the pitch your side will let your opponents reach before they begin to press, and do the same with your backline, so you have a proper visualisation of where you've closed up the space and where you'll need to think about the spaces you've left in behind. Breaking instructions down into In Possession, In Transition, and Out Possession, too - and, to cycle back more positively for training, the Defending: Engaged and Defending: Disengaged for that matter - is an approach far more in line with modern day analyst chatter about how zeitgeist sides like Liverpool move from one 'phase' to another.Much of this has a direct impact on what you can ask your teams to do, allowing you to push your side more towards the Gegenpress extremes of the game than ever before, but some of it is more about adding to the illusion of control. It's just as important, and it brings me back to the original point. Football Manager is about feeling empowered, only in the opposite sense to usual video game empowerment. It's about being properly stumped, but feeling like you, the Boss, the Tinkerer, Le Professeur can crack it, if you're given the time. Where Football Manager 2019 understands that, it understands it better than anyone else, management sim or not. Where it's failed, its sky-high potential makes it all the more frustrating."}