{"ref": "https://www.eurogamer.net/too-human-review", "date": "19 Aug 2008", "game_name": "Too Human", "text": "I think it's only fair to warn you. These are first words I'm typing, but I can already tell from my notes that this is going to be a laundry list of complaints, gripes and grumbles. And that's a shame, because Too Human isn't a terrible game. It's just one of those ~could've been~ games where potential is squandered in so many areas that it's hard to know where to begin. Suffice to say, most of the game's good points can be summed in one simple sentence: it's a pretty good action game. Not a very good one, and certainly not a great one, but a slightly-above-average entry in the hack'n'slash genre that provides amusement amidst annoyances.The core concept won't be new to anyone who watched Ulysses 31 in the 1980s. It's ancient mythology rewritten as science fiction, with Norse legends retold as an advanced civilisation where cybernetically-enhanced humans are considered protective gods by the general population. Our hero is Baldur, favoured creation of the AI program ODIN and popular people's champion of Asgard. You can rename him (although everyone still calls him Baldur) and choose one of five classes for him, and each will be familiar to regular RPG players. Berserker is your meaty melee combat specialist while Commando is your choice for firearms and ranged weapons. Champion is the piggy in the middle, averagely proficient at both forms of fighting. Defender is the heavily armoured tank option, with Bio Engineer the surrogate Mage, able to heal himself and others.Your choice made, you're dropped into the game at the head of Baldur's ~wolf pack~, a squad of space marine types, and you're set on the trail of the monstrous robot GRNDL-1 (Cyber-Beowulf was too busy). As you stroll through the ruined Hall of Heroes, robot goblins attack and you're introduced to Too Human's curious combat system. Rather than use the face buttons, you direct your melee attacks with the right stick. Move the stick in the direction of an enemy, and Baldur lunges at them. This basic template can be modified by using the left stick in the same direction, making Baldur launch energy projectiles or fly towards enemies depending on how far away they are, while a double directional twitch juggles foes into the air. Successful attacks fill a combo meter, which can be used to deploy Ruiners - radial smart-bomb attacks that vary from weapon to weapon. Ballistic attacks, meanwhile, are carried out by holding down the right trigger, which starts you shooting with your equipped firearm, and then the right stick is once more used to direct your fire. It takes some getting used to, but when it works the results can be impressive, as Baldur effortlessly flies from enemy to enemy racking up the kills. When it doesn't work, it's a mess. Shooting is especially problematic, with a skittish automatic lock-on that often does the opposite of what you want. Targeting a specific enemy in the middle of a battle is often impossible, and that's a problem when the game introduces exploding enemies that need to be killed from afar in order to avoid splash damage. The game spams you with different enemy types, some requiring firearms attacks to remove their shields, but as they swarm around you there's little room for any tactical play. Depth comes simply from choosing the best attack to clear some space - and trying to target the pounding arms of a giant robot troll even as the game insists that, no, you want to be shooting at the less dangerous goblins at its feet, is never fun.The melee attacks are easier to master, but it's not a system with much flexibility or depth. The difficulty in lining up two sticks in the same direction means that the ~advanced moves~ can be unreliable, and the game sometimes has weird ideas as to when enemies are far away or nearby. You have three weapon options to choose from - sword, staff or hammer - but apart from variations in speed, the results are almost always the same. Mindless stick-twizzling (it's the new button-mashing!) won't get you to the end of the game very quickly, but nor will you find yourself being stunned by the tactical scope of this new control system. It pales alongside the precision offered by the likes of Ninja Gaiden, or even Samurai Warriors.The control issues, which persist long after you've mastered the basics, are compounded by a wilfully unhelpful camera. With the right stick pulling duty in combat, keeping everything in view falls to a roving AI viewpoint that, like the aiming, makes the wrong assumptions about what you want to be looking at. A tap on the left shoulder bumper centres the camera between Baldur, at least for a while, but you find yourself having to do this more and more because the camera ties itself in knots whenever you do something besides ploughing forwards. It's most problematic in the boss battles, where the need to keep the monstrous enemy in view apparently overrides the need to see where you're going, leading to some horribly confusing - and often fatal - moments."}