{"ref": "https://www.eurogamer.net/summer-athletics-review", "date": "14 Aug 2008", "game_name": "Summer Athletics", "text": "You might recall we thought SEGA's official Olympic 'Game of the Games' wasn't up to much. Too many counter-intuitive mechanics and far too much padding. A clear opportunity remains for someone to come along and snatch the torch, then. Perhaps dtp and 49 Games will do better?Summer Athletics packs in most of the key events you expect (or care about) in a track and field-based title. All the usual suspects make an appearance, with every major running (100m, 200m, 400m, 800m, 1500m), throwing (javelin, discus, hammer, shot put), and jumping (high, long, triple, pole vault) event present for a total of 26. Alongside the obvious candidates, the devs throw in swimming and diving events and even cycling and archery.Sadly, first impressions are desperately poor. From the moment you glance at the horrendous box art, the whole package comes across as a cheap, soulless, sub-budget cash-in. On the cheapest, blandest front-end since Earth Defence Force, an irritating gymnastic monkey mascot giddily somersaults about the place, and there's no obvious entry point; you're just presented with a sea of menus and a choice of a series of preset competitions (such as Decathlon, Short Competition or 'Higher, Faster, Farther'). You can, if you like, create your own, or succumb to the lure of the god-awful career mode.The so-called career is back-of-a-beermat stuff. The character-creation is laughably primitive - you can tweak a few sliders, but what you end up with looks bizarre. Once you've done that you leap into a championship and run through a series of events, but this is just a procession with a progression layer tacked between events, allowing you to distribute experience points across five areas of growth. Every time you play an event, you're rewarded with 100 of these training points, regardless of how well you performed, and you're hard-pressed to notice any effects after doling them out. Ultimately the process is mechanical and pointless, and you soon realise the game works better when it's divorced from the half-baked character development.Far more enjoyable is to simply play the events you most enjoy, either via customisable competitions or by selecting single events. In that sense, Summer Athletics isn't as bad as it appears to be. As with the good/awful Beijing 2008, if you stick to the more enjoyable efforts it's engaging in small doses - especially if you have a few willing subjects on hand to compete against. And they have to be on hand, because criminally it's offline-only.Basic track events such as the sprint races are handled more sensibly than some of the teeth-grindingly awful equivalents in SEGA's Beijing effort. Timing your burst off the blocks involves holding the left trigger to build up power, and releasing once the starter gun goes off. The difference is that Summer Athletics gives you more time to react, because it charges up the meter at a slower pace. It's a subtle difference, but a crucial one."}