{"ref": "https://www.eurogamer.net/xbox-360-roundup-review", "date": "14 Aug 2008", "game_name": "Reviews", "text": "Those who follow my internet ramblings (my mum and the FBI, basically) will probably know by now that one thing guaranteed to make my blood boil is crap games for kids. More specifically, crap licensed games for kids. I'm not just talking about generic design or uninspired construction, but games that have no concept of how to entertain a child. The result inevitably leaves children frustrated and parents out of pocket. And that makes me fume.Those of you with the gift of precognition may have already guessed that this intro does not bode well for poor old WALL·E.This latest Pixar spin-off has once again been developed by Heavy Iron Studios, the developer responsible for Ratatouille, arguably the worst children's game in living memory. WALL·E isn't quite as cruelly frustrating as that horror show, but it's still a depressingly sub-par product that will irritate experienced adult gamers, let alone the intended audience of youngsters who are still mastering the peculiarities of game control.Alternating between WALL·E and Eve, the game roughly follows the plot of the movie [a cute thing that learns a valuable lesson - Ed], padding matters out with horrible checkpoint races, timed fetch quests and a hideously paced shoot-'em-up level that drags on and on. If you can think of a game design sin, chances are this game commits it. Let's tick them off.Awkward camera. Poorly signposted objectives. Twitchy aiming. Frustrating checkpoints. Instant death obstacles. Pointlessly restrictive time limits. Long-winded puzzles. Confusing level design. Countless graphical glitches. Constant scenery snags. Ugly graphics ported from a less powerful system. There are even frequent game-crashing bugs, in which WALL·E gets stuck in doors, ceilings or simply falls into an inky black abyss and falls forever, forcing children to face the Nietzschean void that dwells within us all.It's a textbook example of how not to make an enjoyable game, made all the more infuriating because it'll doubtless be snapped up by naïve parents and suffered by despondent kids who'll doggedly bang their little heads against this brick wall of lazy design in the vain hope of recapturing some of that big-screen magic. It never ceases to amaze me that Pixar clearly lavishes huge amounts of care and attention on its movies, yet apparently exerts almost no quality control over the interactive entertainments that bear the Pixar name. That the game offers Achievements for mindlessly crushing hundreds of trash cubes suggests that the inspirational spirit of the movie has been spectacularly missed.With games like LEGO Indiana Jones and Kung Fu Panda readily available - games that actually seem to care about entertaining youngsters with proper gameplay, not just servicing a lucrative licensing agreement - there's absolutely no reason to put up with half-arsed dross like this. 3/10"}