{"ref": "https://www.eurogamer.net/super-monkey-ball-review", "date": "13 Aug 2008", "game_name": "Reviews", "text": "If you want to be taken seriously as a gaming platform, you need monkeys and you need them fast. Fortunately for Apple, SEGA's first game on the newly-launched iTunes App Store is a conversion of GameCube classic Super Monkey Ball, where you roll capsule-clad simians around mazes in the sky dodging obstacles, collecting bananas and trying to reach a bright blue finish line before the time runs out.Compatible with the iPhone and the iPod touch (providing you've forked out for the 2.0 firmware upgrade), SMB is played holding the device sideways in landscape orientation and uses the system's built-in tilt sensor for control. You pitch it forward to propel your monkey, tilt it toward you to brake and twist left or right to turn.In this manner you gradually explore the 100-plus levels that populate five game worlds. Level design borrows from the game's outings on various other formats (chances are you'll recognise quite a few layouts), relying on narrow platforms, dangerous pinball bumpers and moving ledges to throw you off-balance and into the abyss below - prompting a restart and using up one of your stock of lives. If you fail to reach the end-of-level goal hoop before 60 seconds run out, you're also booted back to the start.Visually SMB sets down an early marker for other App Store developers, dragging as much graphical fidelity out of the infant system as some of the best PSP action games have managed in four years. The devs cheat a bit - blurring the background skybox and using a comically old-fashioned cartoon sprite for the monkey in the ball - but the 3D world itself is bright, well-textured and fast-moving, despite the occasional, momentary dip in frame-rate. The music is also rich and charming, backed by the series' signature sound effects and echoey voice-overs.Individual worlds, which take in desert, lava and space themes among others, offer 'Easy' and 'Hard' levels, but the labelling is deceptive, as you have to complete the Easy levels to unlock the Hard ones in each world, and in any case the difficulty curves steadily upward across the game as a whole, rather than yoyo-ing. Those seeking a greater challenge can try and top the game's built-in leaderboards by setting fast times (you can practice on individual stages away from the main single-player mode), or try and collect all the bananas in each stage.Whether anyone will grow to love the game that much is another matter. The controls are overly sensitive, and the camera - so often the bane of Monkey Ballers - is too quick to spin when you overcook a turn or braking manoeuvre by accident. There's no deadzone around the neutral control position, either, which is itself hard to find, so it's almost impossible to right yourself when you get in a spin. Navigating narrow walkways and tricky turns is fine as long as you're moving slowly forwards, but as soon as you have to turn back on yourself or deal with slopes you lose control. Whether it's the absence of tactile, analogue-stick feedback that's to blame, or a misapplication of the iPhone's impressive tilt sensor, is something I'll leave you to debate - but the bottom line is it doesn't work.The other thing worth noting is how voraciously those monkeys chew on your battery. Our brand new iPod touch - on its first full charge - survived around three hours of Super Monkey Ball. The absence of internet leaderboards is disappointing, too, and those hoping for a last-minute reprieve from some clever new mini-games - brilliant on the GameCube and elsewhere - will be upset to discover there are none whatsoever.It's still not bad, though. At GBP 5.99, there's quite a lot of gameplay here, and while there's a fair amount of frustration to endure, the game's better moments - navigating a perilous series of platforms and traps, or taking advantage of some subtly placed platforms to shortcut huge sections of a level and complete it in seconds - are in decent supply. Otherwise, this is a good advert for the system's graphics hardware and tilt sensor, but the latter proves to be so effective that it seals the game's fate rather than propelling it to a high score."}