{"ref": "https://www.eurogamer.net/pure-hands-on", "date": "4 Aug 2008", "game_name": "Pure", "text": "Pure is keen to impress. Due for release at a time when most of the heavyweight racing brands are having a little nap on the hard shoulder, the game developed about 300 metres from our office in Brighton hopes to turn a few heads with a monstrously hectic brand of vertiginous, trick-focused off-road racing.It's a game that demands your attention with fast pace, high jumps, massive air, the obligatory 'sick' tricks, huge boosts and, of course, high scores. It's an excitable formula that makes it tough to talk about Pure without sounding like a tartrazonic teenager. But in the hands of a studio as evidently capable as Black Rock, initial reservations melt away in a blur of technical prowess, improbable stunts and riotous action. Treated to a near-finished build of the blistering 360 version, we motored through some of the early highlights, trying out the three game modes and taking in the diverse locations.Pure features three single-player modes: Race, Sprint and Freestyle. Blessed with the chance to get a hands-on with all of them for the first time, we got stuck straight into the Race mode, roaring over the rugged, dusty New Mexico terrain. As you might have seen from the gameplay clips, the vertigo-inducing jumps are a point of difference for Pure. The rush of launching your rider skywards, the ludicrous mid-air gymnastics, the bone-crunching landings, the argy-bargy on the track, the plumes of dust and gravel you leave in your wake...With 15 other riders competing for first place over three laps, there's aggravation all over as riders jostle for position, and no sooner have you built up speed and muscled your way around the first few corners than the Sandy Mountain track gives way to the first big jump opportunity. With assistance from natural inclines, you can lean your rider forward with the right stick and pull back at the last possible moment to launch your bike and gain extra lift at the crucial point of ascension.Sent skyward, Pure wastes no time in enhancing the sense of height by blurring the edges, changing the colour saturation and muting the angry soundtrack to a whistling bomb drop. It's the game's Burnout moment - only the rush comes not just from speed, but the feel of gravity's pull as the blood drains from your body. An ideal time, then, to pull off life-threatening stunts as you plummet to certain doom. Three tiers of progressively elaborate tricks are available to you, although at the beginning of a race you can only use the 'A' tricks. You pull them off by pushing the A button and combining it with one of eight directions on the left stick, with a further shoulder-button modifier available, effectively doubling the number of tricks. As soon as one trick has completed, you can attempt another, and another, until it's time to land. The drawback of attempting tricks while you're busy accelerating ground-wards at 10 metres-per-second per second, is, of course, that you'll run out of air and end up in a heap (and more importantly slip down the race order). Thankfully, such moments of gory disaster aren't dwelt upon for long and you quickly respawn.As you continue on your perilous journey, you soon get into a rhythm of pushing the right stick forward and back as you approach the many ramps, and begin to build up enough of your boost bar to access the flashier 'B' and 'Y' tricks. The better the trick, the longer it takes, but the more points you score the more boost you gain. The more boost you have, the quicker you can approach the ramps, the higher you can jump, and the more tricks you can pull off. Success is a fine risk-reward balance, and the more you get to know the intricacies of the tracks, the easier it is to anticipate which of many forks in the road to take. Some are narrow paths that offer a shortcut or more spectacular jump opportunity, while others offer a safer passage but less chance of wiping out. Pure also rewards trick variety, punishing repetition by lessening the boost reward."}