{"ref": "https://www.eurogamer.net/pc-roundup-3", "date": "4 Aug 2008", "game_name": "Reviews", "text": "Not, sadly, an adventure game starring Godzilla's infamous avian foe, but that's not to say that this Rhodan can't satisfy the urge for pulp sci-fi fun. It's based on a massively popular series of German SF novels following Perry Rhodan, a Buck Rogers/Flash Gordon/John Carter of Mars figure whose encounter with aliens on the moon fast-forwards the human race into the space age and leaves him with a ~cell activator~ which makes him pretty much immortal.By the time we meet him, he's 3000 years old and the ruler of the Terran empire. No rest for the regal though, as he's also under attack from forces unknown and sealed into his office building for security. Being a hands-on sort of guy, his first order of business is finding a way past the lockdown, and then investigating the source of the attack. It's a saga of arcane political intrigue rather than a fantasy quest, making the experience more Dune than Star Wars.The point-and-click interface feels a little cumbersome compared to other recent entries in the genre, as you can't double-click on exits to automatically load the next area and skipping dialogue requires the keyboard rather than the mouse, but the game compensates with a useful inventory system. Always on-screen, it not only gives you constant access to items, but clues and people of interest are also recorded here, and can be dragged onto characters and computers to trigger relevant conversations or data searches.What really makes Rhodan stand out, however, is the construction and pace. The puzzles actually stem from the plot and situations, so while none of them are particularly innovative you probably won't notice since they're introduced so organically into the game. There's logic and relevance to the way the brainwork is woven in that keeps you immersed in the story, rather than moving it along just to get to the next head-scratcher.Speaking of the plot, the game benefits hugely in this area from the enormous amount of back-story established by four decades of published stories. You don't need to be a fan to get into the game (I'd never heard of him before) but you'll immediately recognise that this is a universe that is more coherent and populated than most adventures get to play with. There's a sense of history and character that is very difficult to manufacture artificially. It's also nice to see a point-and-clicker that doesn't follow the period horror or modern conspiracy templates, with Rhodan's epic SF tone helping to summon memories of Space Quest or Beneath A Steel Sky.There seem to be two types of adventure fans. Those who favour puzzles, and those who favour plot. Rhodan definitely skews towards the latter, which pleases me greatly, but offers plenty for the former as well. It's one of the richest, most cohesive entries in the point-and-click genre I've seen for a long time, and I'm a little sad that it didn't come out fifteen years ago. Just think of all the sequels we could've had by now...8/10"}