{"ref": "https://www.eurogamer.net/soulcalibur-6-review-a-return-to-form-for-an-old-great", "date": "19 Oct 2018", "game_name": "Soulcalibur 6", "text": "My fondest memories of Soulcalibur, the long-running 3D fighting game from Bandai Namco, are playing on Sega's Dreamcast and Nintendo's GameCube, parrying until I felt like I could parry blindfolded. I've always loved Soulcalibur's parry - a clash of weapons, a spark, a cling! Predict your opponent's move, time the parry to perfection and counter. Soulcalibur is at its most satisfying when you get in your opponent's head and expose the chink in their armour. Parry, parry, parry, slice and dice. Done.Yet in recent years Soulcalibur had lost its spark - a funny thing to say about a series that's all about sparks flying all over the place. 2012's Soulcalibur 5 washed over me, and the less said about Soulcalibur: Lost Swords, the free-to-play, single-player-only spin-off released in 2014, the better. Soulcalibur 6, then, which arrives six years after the last mainline game in the series, rediscovers that spark, and it achieves this by taking stock of what made Soulcalibur great and focusing on those fundamentals.First up, Soulcalibur 6 is super responsive. The characters feel snappy as they dart inside and out of the series' trademark eight-way run. So much of Soulcalibur is about spacing and punishing whiffed attacks, so it's fantastic to feel the game respond - at the double - to your commands. Sophitia, for example, has a wonderful forward dash stab move that's fantastic for punishing missed attacks. It's blisteringly fast on-screen, a flick of your thumb for the input command and a flash of a button press all it takes for Soulcalibur 6 to spark into life.The move to Unreal Engine helps Soulcalibur bristle with excitement, although it can at times look a little rough around the edges. Most of the stages are bland, but there a few that catch the eye, a sunset here, a few rays bleeding through brickwork there. In truth, Soulcalibur 6 is no looker, but the focus with the 21 launch characters is fluidity of movement and animation, rather than detail. Sword swipes and stabs and kicks and thrusts all blend beautifully into one another, and some of the character movement is a work of art. Just don't study the faces too closely, or fuss too much about this cloak or that haircut clipping through the floor - things can and do get ugly.Soulcalibur has always been an accessible, button-mash friendly fighting game, and Soulcalibur 6 doubles down on this. I love the simplicity of its fighting system - one button for a horizontal attack, another for a vertical attack, and one other for a kick, leaving the fourth and final button for guard. Each attack has a clear counter, each strike a risk and a reward. Tap these buttons over and over again and you'll see your character do some impressive stuff. Start to hit a couple of buttons at the same time and you'll trigger even more elaborate attacks.Extending the accessible feel, new mechanics feel designed to give people a fighting chance against more expert players. The new Reversal Edge symbolises this design philosophy. Here, a press of a single button (R1 on PlayStation 4) lets your character absorb multiple attacks then retaliate with a quick strike that triggers a slow-motion fighting stance-off. Then, Soulcalibur 6 turns into a rock, paper scissors mini-game. One button beats another button beats another button, or you can try to avoid your opponent's attack altogether. I won't over-egg the Reversal Edge mini-game by saying it's the greatest example of mind games in a fighting game ever. In fact it can often feel a bit like a random roll. But there is some subtlety to it. One attack opens up your opponent to a damaging combo. Another could trigger a guard break. What do you go for? And what will your opponent go for?Reversal Edge is most useful in helping you get out of trouble. Hold down the button and you can absorb a surprising number of attacks before launching a potentially damaging comeback. When you nail it, it's pretty cool on-screen (using Reversal Edge against some of Ivy's multi-hit whip attacks is particularly satisfying). The trick is to know when to use it. As with so much in Soulcalibur, mistime the Reversal Edge and you leave yourself open. It's one button, so it's easy to learn, but it's hard to master.Speaking of slow motion, there's a lot of it in Soulcalibur 6, and, frankly, I love it. The developers, clearly, want the game to be as dramatic to watch as it is to play. Lethal Hits, another new system, are a case in point. These advanced techniques are triggered by using certain moves in certain situations. If you want to dig into the detail of the game, find out which of your characters moves you already like using can also become Lethal Hits, and try to use them in the right situations. The move might only become a Lethal Hit if it hits your opponent's back, or is a counter hit, or hits after your opponent has missed a strike of their own. It can be hard to pull off, but it's worth it, as nailing one slows down your opponent's movements and gives you a soul gauge bonus. Lethal Hits are another dramatic comeback mechanic in a game packed with them.The soul gauge, by the way, is Soulcalibur 6's super meter. You can burn one level of it to infuse your character with special power, which is another great comeback option (it helps that triggering this breaks you free from enemy attacks, too). Get to level two and you can do your character's Critical Edge, a flashy combination of over-the-top attacks for high damage. Soulcalibur 6's supers are fantastic. Sophitia sees her launch her enemy into the air, chuck her sword into their gut then protect herself with her shield from the explosion of energy. Zasalamel freezes his opponent in time before clicking his fingers for a big hit. Geralt, who joins the game as a guest character from CD Projekt's The Witcher series, uses his magic signs to force his opponent to their feet before setting them on fire - all fused with big sword strikes. Again, reinforcing the accessibility of the game, Critical Edge attacks are just one button (R2 on PS4), but you need to be smart in their use. They're best saved for extending combos for extra damage or punishing whiffed attacks. It's a brave player indeed who does a super on a wing and a prayer.One of the best things about Soulcalibur 6 is all the characters look and feel distinct, with some pretty unique mechanics to get to grips with. And a lot of thought has been put into the new characters. Villain sorcerer Azwel, for example, creates three different weapon sets out of thin air, and each has its own idiosyncrasies. The tough to learn Azwel even has multiple stances from which different attacks can be triggered. Grøh, who wields a dual blade, is easier to get to grips with, but his complexity comes from his ability to split his weapon in two, opening up new options. And Geralt has his magic signs fans of The Witcher will know well, as well as some signature moves from the CD Projekt games. His silver sword is particularly effective against opponents who have activated soul charge, which is a nice touch. There aren't a huge number of characters at launch, but the good news is they all have something unique to offer, and my sense is the roster is well-balanced.I've had a lot of fun digging into Soulcalibur 6's combat system, but there's a lot more to the game than lab work. Soulcalibur 6 comes with two story modes, one of which is a role-playing-esque create-your-own character adventure, the other a more traditional fighting game character story mode. Soulcalibur has always been one of those fighting games that makes an effort for the single-player fan, and this version is no exception.The first story mode, called Libra of Soul, asks you to create your own character who you then level up as you travel around the world. I have quite a few issues with this mode. While the character creator is fun to tinker with, it doesn't have as many eye-catching options as, say, Bandai Namco's other in-house fighting game, Tekken 7. But the biggest issue I have with Libra of Soul is it's, well, all a bit soulless.Here's how it works: you travel the world doing missions, levelling up and earning better weapons along the way. The story, which revolves around you having to absorb evil portals to stay alive while making a few rudimentary light side / dark side dialogue choices, is told through text only. There's no voice acting here save a couple of cutscenes. There's a lot of text to read - and it's not particularly well-written. I read as much as I could until, after about the five hour mark, I just couldn't be bothered to read any more and started mashing skip. The story itself is uninteresting waffle with characters who I didn't find particularly interesting. New character Grøh (pronounced ~grow~) is a moody emo-type who's on a mission to defeat new baddie Azwel, who is a villain so one-note I couldn't help but laugh at his maniacal dialogue. It's all super boring and, towards the end, a real trudge to get through. I just wanted it to be over.Libra of Soul doesn't work well, either. There's too much loading (I reviewed the game on PS4 Pro) and it occurs too often. There's loading for quick-fire one-round fights against no-name mutant enemies who are a depressing pushover. There's loading for brief dialogue exchanges. There's even loading in-between rounds.Worse of all, there's a distinct lack of variety to the missions. Only occasionally are there interesting modifiers, such as super slidey arena floors and their inevitably hilarious ring outs. Most of the fights in the first half of the mode are incredibly easy, so it feels mind-numbing to bash your way through them, suffering interminable loading as you do. I soldiered through to the end of Libra of Soul more out of some morbid curiosity than a genuine fascination. It wasn't worth it.The second story mode, called Chronicle of Souls, is better. This includes a fun and breezy voice-acted main quest that puts Kilik, Soulcalibur's staff-wielding hero, front and centre as a gaggle of goodies gang together to defeat the evil Soul Edge. Kilik fans will get a kick out of seeing the annoying pokey stick boy finally get his 15 minutes of fame, but none of this Soulcalibur story stuff is well delivered. What I do like about Chronicle of Souls, though, is it presents the main story and individual character stories on a timeline, which grounds the events. And I enjoyed how Chronicle of Souls at points crossed over with Libra of Souls, presenting the same events from a different perspective. Geralt from The Witcher gets stuck in, here, as he finds himself transported to the Soulcalibur world and fighting to return home.Elsewhere, Soulcalibur 6 is guilty of repeating fighting game's age-old issue of failing to teach players how to actually play. There's a training section you work through at the beginning of Libra of Soul, but all that does is give you a brief overview of attacking and defending. There's nothing in the game that does a decent job of teaching you how to improve your game, which is a real shame. Text-heavy guides are buried within the main menu and are easy to miss. The training mode itself is bare bones. There aren't even any combo challenges.Online play, too, is pretty bare bones. You can play casual matches in rooms of up to eight players (complete with chat and spectate), and there's ranked play and that's it. At launch it all works, which I guess is a positive, and of course pure Soulcalibur 6 is a blast, but there are no bells and whistles here.Soulcalibur 6, then, is a largely successful soft reboot of a series most had forgotten about, with a back-to-basics approach to fighting that newcomers and series veterans should enjoy. Outside the actual fighting, though, there are some problems that let the overall package down. I don't expect Soulcalibur 6 to rekindle the series' glory days, nor do I expect it to all of a sudden rise to the top of the fighting game charts, supplanting the likes of Street Fighter 5, Dragon Ball FighterZ and Tekken 7 at tournaments or on streams, but it's good to see Soulcalibur celebrate its 20th anniversary with the best game the series has seen in years."}