{"ref": "https://www.eurogamer.net/geometry-wars-retro-evolved-2-review", "date": "31 Jul 2008", "game_name": "Geometry Wars: Retro Evolved 2", "text": "The success of Geometry Wars has been something of a happy accident. Originally a fun little extra tucked away inside Project Gotham Racing 2, it was the perfect bite-sized burst of fun to showcase Xbox Live Arcade when 360 hit the shelves. After it was reworked as a standalone release, the mixture of dazzling visuals and moreish gameplay swiftly established it as the standard bearer for downloadable console gaming.I'm going to go out on a limb and assume that most people will know what Geometry Wars entails, but for the sake of the unfortunate few here's the nutshell version. You are a little crab-shaped spaceship in an oblong black playfield. Enemies, represented by coloured geometric shapes, spawn and exhibit different behaviour depending on their form. You must blast them all, and you do this by moving with the left stick, and guiding your fire with the right. Every movement, every explosion sends ripples of colour and light echoing across the playfield. As more and more enemies spawn in ever-increasing numbers, the pace of play is matched only by the dazzling visual overdose swamping your eyeballs. In both gameplay and design, it's a template that has been copied far too many times by lesser Live Arcade games - all of which seem to favour of mayhem and noise, missing the subtleties that make Geometry Wars so great.Now, three years on, Geometry Wars 2 is easily one of the most anticipated titles on Microsoft's nascent digital delivery service. That doesn't say much for the competition, but it has put pressure on Bizarre Creations. What was once a throwaway unlockable in a driving game is now a beloved series in its own right. The shift from cool extra to triple-A status was remarkably organic, and there's always the fear that, in attempting to recapture lightning in the same bottle, mistakes can be made, ambitions can overrun, delicate balances can be lost.Bizarre Creations knows what they're doing, however. Geometry Wars 2 is as carefully improved a sequel as you could hope to find. For those waiting in the wings to scoff, ~It's just the same, innit?~ - yes, it is the same as Geometry Wars. It's also completely different, in numerous ways. The Evolved mode, familiar from the first game, returns. So too does Waves, the variation that graced PGR4, bringing with it the orange rockets that travel back and forth in fixed lines across the screen. The gates from Waves are here as well - able to reflect your shots, or act as a localised smart bomb when flown through, their yellow tips are nonetheless deadly to your ship.The notion of ~geoms~, familiar from Waves and Geometry Wars: Galaxies, has also been worked into the mix. These little green sparks, left behind by destroyed enemies, act as the new score multiplier rather than the old chains of successful kills. This subtly changes the gameplay, forcing you to put yourself in harm's way if you want to increase your score, and fundamentally alters the score multiplier, since racking up your score no longer relies on avoiding death. Purists may be dismayed at the notion of a multiplier that stays high, even after death, but it isn't quite the benefit you'd expect since most of the new game modes only give you one life to work with anyway.Speaking of game modes, there are six in total but when you first play only one is unlocked: Deadline. This gives you unlimited lives and three minutes to score as many points as possible. Continued success in this mode unlocks the next, which then unlocks the next and so on. It's not really a long-winded process - even the lousiest player will be able to access all the modes within half an hour - but it does make you try everything at least once, which is a shrewd move on Bizarre's part.King is the second mode you'll unlock, and the first to really shake up the formula. This time you can only shoot when inside circular safe zones, where the enemies cannot reach you. Of course, each zone begins to break down as soon as you enter, so play becomes a tactical game of leapfrog, planning your next unarmed dash across open space, hovering up as many geoms as you can, and making sure that you don't leave yourself out on a limb as homing enemies swarm around your vanishing sanctuary."}