{"ref": "https://www.eurogamer.net/go-go-break-steady-review", "date": "29 Jul 2008", "game_name": "Go! Go! Break Steady", "text": "Games that attempt something new should always receive some small measure of praise, even if their innovation involves nothing more ambitious than squashing and stitching two genres together by the flappy bits. So it is with Go! Go! Break Steady, a game that's amusements are often overshadowed by the feeling that the developer is simply trying too hard to manufacture something new from old material.On one hand, it's a rhythm game. You're controlling Hydro and his All-City Crew as they compete in a funky hip-hop dance-off competition with DJ Scruffy and the Beatniks. It's that safe version of old school hip-hop that you might expect to find in The Lenny Henry Show, but the music isn't bad provided you're not too demanding. Icons representing the face buttons swoop onto the screen in time to the music and, yes, you hit them as they pass through a circle in the centre. The better you do, the better you dance.However, after each wave of button-matching, the game switches genres rather crudely and becomes a Zuma-style colour-matching puzzler. You have to clear a line of beatniks by matching three of a kind. The better you are at the rhythm section, the more beatniks you'll have at your disposal in this part of the game. Then it's back to dancing, then puzzling, then dancing and so on until you clear the line or time runs out.The All City Tournament is the meat of the game, with five levels for each of the six characters, rising in difficulty as you move through the list. Here you can earn prizes by clearing gold coins in the puzzle sections. As far as other game modes go, you've got an endurance option where you last for as long as possible, and a freestyle mode where you can select the music. Online you can opt to play against an opponent, or join forces in a co-op game to show how funky fresh fly you can both be. It's a rather blunt Frankenstein job, frankly, lurching from one genre to another and not really bothering to disguise the debt to previous games or advance their designs in any real way. It's sporadically fun, but also often frustrating as the game seemingly goes out of its way to distract you with peripheral visual effects and lumpy timing. There were plenty of moments where I was sure I'd nailed a sequence, only to find I'd earned a solitary beatnik, while at other times I could see and hear that I was off-beat only to be blessed with a full three beatniks with which to attack the puzzle section.It's all reasonably diverting, but the mix of genres never really gels and when things get frustrating the game lacks that basic addictive lure to keep you playing. The temptation to quit back to the dashboard and load up Boom Boom Rocket or Luxor instead is simply too strong."}