{"ref": "https://www.eurogamer.net/guild-wars-re-review", "date": "28 Jul 2008", "game_name": "Reviews", "text": "Three years and three months ago (to the day, at time of writing), Guild Wars proved itself a real charmer. Good looks, flexibility and an eagerness to please helped it to find favour with an unusually broad spectrum of players, with hugely disparate experience with MMOs. The complete absence of a subscription fee seemed baffling at the time, but combined with the accessibility of Guild Wars' interface and structure, it opened up the genre to a new category of casual players, while beguiling the more experienced by dispensing with a swathe of genre conventions that suddenly seemed embarrassingly outdated.Since then, the Guild Wars universe has been fleshed out with two new campaigns and one expansion pack, and some five million of these boxes have been sold at that one-time GBP 20 purchase price. Guild Wars' strengths have proven enduring, and the game still enjoys a huge player community. It's still well-presented, obscenely beautiful on the right equipment, and nonetheless runs well on pretty much any PC purchased since 2005. But last year's Eye of the North was the last planned expansion before the sequel arrives sometime late in 2009; now that the Guild Wars trilogy is complete, has it lived up to its promise?It's worth explaining how the trilogy functions nowadays, and how its constituent parts fit together  - because it really is confusing for returning players. Each of the three Guild Wars campaigns (Prophecies, Factions and Nightfall, from oldest to youngest) is a standalone, extremely lengthy role-playing campaign, taking place on a concurrent timeline. In this sense they are distinct games, with distinct features.Prophecies, the original, is the simplest; Factions beefs up the guild system, introducing guild alliances, better guild halls and better inter-guild competitive options; Nightfall introduces fully-customisable NPCs into the storyline. They all share the same one, madly gorgeous race (humans) and the same six character classes, although Factions and Nightfall also have two exclusive classes each to play around with.Owning just one of the Guild Wars campaigns is no disadvantage; purchasing another campaign simply offers up a few hundred hours of new story on a new continent. Characters can be transferred between worlds if you fancy a Nightfall set of armour for your original Prophecies elementalist, or would rather take a powerful character into a new campaign storyline than start a new one from scratch.Skills - the thousand-odd spells, special attacks and techniques with which Guild Wars players really customise their characters - are transferable between all three.  Owning all of them is only advisable in the player-versus-player portion of the game, where hardcore Guild Wars players fight for guild honour and occasional cash prizes with intricate combinations of skills and equipment from all three games.Eye of the North, meanwhile, is essentially a pack of extra skills and quests across all of the three continents, designed for experienced players as a sort of Guild Wars 2 teaser. It introduces the sequel's new races into the storyline and converts your Guild Wars achievements into trophies that will carry over as rare items, pets and equipment in Guild Wars 2. It's not really worth bothering with unless you're a devoted player gearing up for the sequel; the storytelling and quest design of the three main campaigns are much better.Sadly it's rather difficult to find any company at all for the Prophecies story quests these days - everyone completed them all three years ago - but Nightfall and Factions still seem to be getting a decent enough influx of new players experimenting their way through the introductory quests.Now is as good a time to jump into Guild Wars as any - it is unique among MMOs, and there are  more things than ever to like about it. The freedom and flexibility that it gives its players - in stark contrast to subscription-based games, which often give you far less control over your character despite charging you for the privilege of having one - is enduringly fantastic."}