{"ref": "https://www.eurogamer.net/arkanoid-ds-review", "date": "26 Jul 2008", "game_name": "Arkanoid DS", "text": "Well now. The original Arkanoid was (and far more blatantly than Space Invaders) inspired by the original Breakout, only in this case the difference was - to put it charitably - ~subtle~. That's not to say that the things that Arkanoid added aren't appreciable - moving enemies, power-ups and even bosses were all added to the original design to spice up what was otherwise a clone - but the series hasn't stuck in our minds the way Space Invaders has. I'm pretty sure, for example, that the only people who still bother to play any form of Breakout are people stuck on public transport with nothing to entertain them but a Blackberry (which comes with a version installed as standard). Unless you're so thrilled by WiiWare that you downloaded Block Breaker Deluxe (given a surprisingly positive review by our very own Dan Whitehead).In fact, I'm so sure of that, I can only imagine people buying this to get hold of the paddle controller that came with the Japanese version. Taito must have thought the paddle was compensation enough for however many yen it wanted, too, because the game attached to it isn't competent in any way whatsoever. And just to add insult, it isn't even attached to the paddle any more. It's just a game in a box.Indeed, Taito's gone as far as removing some of the very few things that make Arkanoid distinct (in this case, enemies and bosses) and instead put together a bare-bones Breakout title that looks and sounds like the games you'd play on a disreputable ad-ware infested web-portal - which means this release, without the paddle, is hardly worth looking at.In fact, it's so gob-smackingly inept that Taito's actually made the blocks square rather than rectangular. Never the case in the original titles, where the designers obviously understood that wider blocks made them easier to aim for (while still requiring skill to work the angles) it's teeth-grindingly easy to sit and miss the single remaining block on any level over and over again.And thanks to poor ball physics, the ball can quickly get stuck in a ~loop~ of identical bounces against indestructible blocks if you're unlucky.So what does Arkanoid DS have going for it? Well, there are a lot of levels, and some of them have amusing layouts. They're laid out as branching stages, but for some reason here it grates in a way it didn't for Space Invaders Extreme - perhaps because I find playing the same Breakout levels over and over again unbearably tedious (and if you want to see all the levels, you'll be playing the first five a lot).There are a ton of customisation options to unlock, though. For example, you can change the blocks to look like Space Invaders or make the background feature Bub and Bob from Bubble Bobble amongst other cute references, but it doesn't help make the game any more pleasant to play. Particularly as each of the customisation options require you play the game extensively to unlock, but also because each stage must be customised individually. You can't make the entire game feature Space Invader blocks by navigating any less than about seven hundred menus, so even just making the game look nice (or at least ~not hideous~) is as tedious as anything else.There is Wi-Fi and single-card local multiplayer, which is probably the most fun you can have with the game. Racing to clear your board before your opponents fill it up with junk blocks adds an urgency that's sorely missing from the rest of the game, but it's not enough to make it essential under by any measure.I'll be charitable here and call Arkanoid DS a missed opportunity. After all, Breakout isn't a completely horrible concept (as proven by Block Breaker Deluxe) and Space Invaders Extreme shows that you can keep a core design and be very clever with the embellishments (such as the graphics and sound or scoring mechanics) to create a worthy update to a classic. But I won't be charitable with the score."}