{"ref": "https://www.eurogamer.net/1942-joint-strike-review", "date": "25 Jul 2008", "game_name": "1942: Joint Strike", "text": "When dealing with the legacy of the classic arcade shoot-em-ups, the terms ~remake~ and ~sequel~ are pretty much interchangeable. Sequels were really just revisions of the previous version, introducing new ideas which could then be woven into the DNA of future instalments. That's certainly the approach Capcom seems to be taking with its latest forays into the back catalogue. Technically, it's a remake but since it changes most of the elements from the original 1942, it works just as well as a modern sequel.This, then, is most definitely a 1942 game. There's no jarring switch to full 3D (although the backgrounds now boast a lovely illusion of depth) and no attempt to over-complicate a simple recipe. In some vaguely established alternate Second World War you have a fighter plane and a sky full of bad guys to destroy. Tapping the fire button fires as normal, while holding it down charges up a more powerful shot. Your weapons can be improved by scooping up the power-up icons left behind by squadrons of red planes, offering the usual array of quad-shot, three-way or focused laser upgrades. More powerful missile attacks can be earned and stockpiled depending on how many foes you blast apart. Very rare power-ups grant you extremely destructive attacks for a few precious seconds. The signature move of the series, the loop-the-loop dodge, also doubles as a limited smart-bomb special attack, momentarily clearing the screen of enemies and bullets.The game has been completely redesigned to take advantage of modern widescreen displays, rather than trying to cram a vertical screen template into the available space. At a time when lots of old games are getting fairly slapdash graphical makeovers in the hope of scraping some cyber-coins from Xbox Live Arcade and PlayStation Store customers, it's commendable that Capcom has actually gone to the effort of creating a new game from the old cloth, rather than following the far easier ~clean 'em up and shovel 'em out~ routine. That said, Xbox owners should probably be aware that their version of the game suffers from some noticeable slowdown during the more hectic moments, while the PS3 version runs at a silky smooth 60fps at all times.From Norihiko ~Metal Gear~ Hibino's urgent music to the bombastic wartime presentation, Joint Strike looks modern but feels classic in its construction. Level transitions send you swooping through war-torn cities in crackly sepia before bleeding back into HD colour for the action, and famous landmarks such as Big Ben explode spectacularly as you battle past them, but the game really doesn't deviate much from the timeworn vertical shoot-'em-up formula. There are lots of baddies, shooting lots of bullets, and it's up to you to find the tiny spaces in between to stay alive.Of course, it's this point that will either guarantee your interest or send you foraging off for something else. It's a Marmite kind of genre, you love it or hate it, and Joint Strike isn't in the mood to try and win over anyone still sitting on the fence. You get a health bar, but refills are few and far between. There are no Continues so even on the easiest setting, which starts you off with a generously feline nine lives, this is a tough nut to crack. At the hardest setting, with just two lives to see you through to the end, it's strictly for the hardcore.There's co-op play for two players, both local and online, which throws even more enemies at the screen for a truly frantic experience. Instead of the missile attacks from solo play, you can now use special Joint Strike attacks in conjunction with your companion. Each player gets to choose their own plane (from the standard selection of three) along with their preferred attack. Shot Link allows you to ricochet a powerful attack off your partner, and requires careful team timing for its effect. Clash Blast pulls up a crosshair between the two planes and destroys anything in that area. Chain Lightning is perhaps the most familiar from the gameplay videos, creating an arc of electricity between you that, with some nifty flying, can then be used to trap and kill enemies.That's about it for new (or new-ish) features, and the game's appeal ultimately rests on the residual affection for the original 1984 arcade machine. While the name has undoubtedly endured, it doesn't seem to be a cabinet held in terribly high esteem by aficionados. It hits all the right spots for a vertical blast, but doesn't throw in backrubs along the way.There are certainly shoot-'em-ups out there, both classic and modern, that do more interesting things with the framework. I won't pretend that Joint Strike is the most thrilling shoot-'em-up to be revived and relaunched as a digital download, but it's a damn solid effort and if all classic arcade titles received this sort of careful updating before being shunted into our cyber-pipes the world would be a better place."}