{"ref": "https://www.eurogamer.net/warhammer-online-age-of-reckoning-hands-on", "date": "24 Jul 2008", "game_name": "Warhammer Online: Age of Reckoning", "text": "When we last played Warhammer Online: Age of Reckoning a few months back, we came away impressed by the Mythic MMO's ideas, but concerned about its look, its basic combat mechanics and its feel. Like it or not, this is a game aimed at World of Warcraft's heartlands - a colourful, traditional, grind-happy, high-fantasy RPG romp. That means it's bound to be judged by the highest standards of quality and polish in the MMO world. If it's found wanting, the battle could be over before it's begun, and the announcement of feature cuts didn't do anything to assuage fears.Back then, producer Jeff Hickman promised us that the game's delay to autumn this year would be used to address those areas. After a hands-on bash at E3 in the company of Hickman and his colleague Josh Drescher - playing the game on a busy live beta server - we've got to admit that Mythic's developers are getting there. In fact, they're nailing it.There's a gorgeously slick new interface for character selection and creation, with a camera that glides between character line-ups - of race, and faction, and your own roster - that recall the Warhammer licence's roots in table-top miniatures. It's as inviting and pretty as an MMO front-end could be. The only disappointment is the basic character-customisation options - they're no more limited than WOW's in theory, but the identikit hordes charging around the game world suggest it's unduly hard to imbue characters with individuality.Where WAR will offer you a bit more freedom for self-expression is in its dye system. This will allow you choose the colour scheme of your armour set (of which there are some 400 in the game, unique to each career). Dyes are handed out as quest or achievement rewards or can be bought from vendors.Having already seen the Dark Elf starting area, and being a diehard bad guy, we go Greenskin - a goblin Squig Herder, which is a pet-wrangling class with ranged attacks - and are dumped in the world at Mount Bloodhorn. The difference from the last time we played is immediately and startlingly apparent.With much-improved effects, animation and (if we're not mistaken) lighting in place, WAR has stepped over the line from bland to the beginnings of beautiful. Sparing with the polys and generous with scale and colour, it will likely scale much better to low-end machines than Age of Conan or Lord of the Rings Online do, too.Also impressive is the sense of life and bustle. Even without the outpourings of new players on this server, the surroundings would be very busy, with dozens of wandering NPC patrols, and AI-driven running battles taking place with the opposing Dwarf faction. There's drama here that MMO humble-beginnings don't usually muster.There's character too - but in this case, we might just have been lucky in our choice of army. Both Elven races start on the Blighted Isle, a very classical and gloomy zone, and the quest plots and writing seemed dour and po-faced back in the spring. Here on Mount Bloodhorn, the orcs' purposely illiterate ramblings, and the Dwarves' cries of ~Bollocks!~ when they fall, capture the exuberant, bloodthirsty irreverence of Warhammer to a tee.There's been a top-notch overhaul of the user interface as well. It's perhaps a shade too busy - even though the starting combat options are minimal, WAR bombards you with information, buttons and progress bars - but the layout is logical, the finish superb, and the implementation fast and intuitive. The Tome of Knowledge - Mythic's brilliant combination of quest log, achievement system and encyclopaedia - is a joy to behold and navigate.All of this is nice to see. A relief, even. Months from release, Warhammer Online can already confidently stand alongside WOW and LOTRO in an MMO beauty pageant, and impress the judges with its grace and deportment. But what is there that sets it apart?That's easy. In fact, after a scant three levels and thirty minutes of play, it's blindingly obvious. It's public quests.These rolling multiplayer scenarios take place in the open world. When you get near, live objectives pop up on the screen telling you what needs to be done to get to the next of the public quest's three stages. You can join in at any time, and at the end, a combination of contribution and blind luck will determine whether you get any loot. Participating in public quests also adds to your ~influence~ within that zone, which in turn grants access to three tiers of rewards, from potions to fine armour."}