{"ref": "https://www.eurogamer.net/call-of-duty-black-ops-4-review-a-polished-pulsating-battle-royale", "date": "17 Oct 2018", "game_name": "Call of Duty: Black Ops IIII", "text": "One of my favourite things to do in Blackout, Call of Duty's take on battle royale, is to crash through windows. I know it makes a lot of noise, I know it alerts nearby enemies to my position and I know there's a door right next to the window. But I just can't help myself. Sprint, vault, smash! I'm inside, glass on the floor, loot to pick up or - hopefully - an enemy player who dies at my hand while marvelling at the grandeur of my entrance.Vaulting through windows is so much fun because it's so slick. It just works, with great audio and feedback. And it's symptomatic of the Call of Duty battle royale experience. This is a triumph of execution over inspiration. Blackout does not rewrite the battle royale rulebook, but it stands out because it works really, really well.When it first emerged developer Treyarch was jumping on the battle royale bandwagon, it was hard to imagine how the traditional Call of Duty experience, with its blistering, 60 frames per second gunplay and speedy first-person action would translate into a massive map and a genre where tactics are as important as an accurate trigger finger. Now, having ploughed hours in Blackout, in solos, duos and quads, on my own, with strangers and with a team of friends, I find it hard to imagine a Call of Duty game without a battle royale mode, so successful is this new way to play the series. With battle royale, Call of Duty is at its most compelling in years - and there are good number of reasons why Blackout could be the best battle royale of the bunch.Blackout nestles snugly into a sweet spot somewhere between Fortnite's stylised silliness and PlayerUnknown's Battleground's aspirations towards survival simulation. Call of Duty is, obviously, a military shooter, with relatable weapons, vehicles and soldier get-up, but Treyarch - the fun one out of Activision's gaggle of Call of Duty developers - has sprinkled some silliness into the mix. Parts of the map - Asylum, most notably - are home to zombies (zombies mode was Treyarch's influential invention back with 2008's World at War). In a deserted diner, turn on the jukebox and you'll summon a wave of zombies. Kill them and you'll unlock a coveted treasure box of powerful gubbins to give you the edge - to the soundtrack of nu-metal.Blackout is, on the one hand, accessible, because it's all about the shooting and, despite this being the biggest map Treyarch has ever created, you're never too far away from the action. Fortnite looks like a cartoon but, with the building mechanic, is proper hard to get to grips with. PUBG is more devastating at a distance with a slower, more pondering pace that builds up slowly to incredibly stressful, intense bouts of action. Blackout has an easy to learn but hard to master flow about it, an almost Blizzard-esque quality lent to battle royale. Land, hopefully somewhere quiet (although that's not always possible, especially in the 100-player quads mode), hunt for weapons, body armour, health items and useful attachments, then... quick! We'd better hot foot it to the safe circle because the gas is already closing in. And soon enough you run up against enemy players. You might spot some holed up in a building and take a few pot shots. Or you might hole yourself up in a building if you were lucky enough to land where it looks like the endgame will take place, and try to cover the windows as best you can. Either way, there's not much room to breathe in Blackout. It's a fast-paced battle royale. The map isn't massive for the genre, so can feel claustrophobic. The gas starts its journey soon after you land and closes in quickly. There's no time or room to mess about for long. Matches usually don't last longer than half an hour.The shooting, as expected, is enormously satisfying. The weapons crack and thud, the feedback significant, the snap of a headshot and the crunch of a devastating body shot reassuringly transposed from Call of Duty's brilliant standard competitive multiplayer into the open. It's grim to say it, but I get a real kick out of killing someone in Blackout. It feels great to outsmart your opponent, smoke them out with a concussion grenade, storm a building and then nail a couple of disorientated enemies. Best of all, use the grapple hook to crash through a window before shotgunning a couple of people in the back. Blackout makes you feel like Rambo, up against it but capable of devastation.Blackout benefits greatly from Call of Duty's trademark responsive controls, and the high frame-rate gives everything from sliding backwards after a jump to aiming down sights a buttery smoothness. There is a tradeoff. Blackout is no looker. In fact, at times it looks distinctly last gen - as if you're playing Call of Duty on an Xbox 360. But Treyarch made the right call here - performance over detail, quality of experience over looks. For Blackout to endure - and I believe it will - it had to feel like Call of Duty despite playing out on a much grander scale than the series has ever seen before. The developers have nailed this. It's a really impressive effort in what I suspect was a quick turnaround.As with all battle royale games, the true star is the map. I have mixed feelings about Blackout's battlefield. Yes, it's massive for Call of Duty, but it's not massive for battle royale. In solo and duos, where there is an 88-player cap, it feels just about big enough. But it feels pretty claustrophobic in squads, where 100 players knock lumps out of each other. There's little time or room for quieter, more ponderous moments. This isn't always bad - part of Blackout's appeal is the quick-fire feel - but every now and then I wish I had more time and room to hunker down, to make a last stand, to defend rather than attack. As Black Ops 4 settles down into its inevitable games as a service status, I'd love to see the map changed, added to, evolved and perhaps even extended.However, Treyarch's decision to take popular Call of Duty multiplayer maps, such as Nuketown and Firing Range, and use those as Blackout's versions of the likes of Tilted Towers and Salty Springs is wonderful fan service. But while these main, named areas are well designed, with plenty of cool secrets and areas to explore, the spaces in between are uninteresting. There's a whole section of the map, in the bottom right hand corner, that's basically one big sand dune. Hardly anyone goes there because it's just a wide open space.Blackout is at its best, though, when the game ends in one of the map's more interesting areas. In one game, my squad ended up facing another for first place in Construction Site, with its lifts and metal beams and nooks and crannies. Looking up was as important as looking dead ahead. It all ended with one person on our team skulking around below the enemy. It all felt a bit Die Hard!All this - the gunplay, the movement, the fast-paced action, the quick matches, the fun - makes Blackout the most moreish battle royale out there. It's so easy to have one more go because you know it won't last long and it's a lot of fun and then - whoops! - you're stuck in a vortex. And it's definitely a good thing that I'm playing over and over again for the fun of it, rather than to watch numbers go up in some arbitrary progression bar. Progression in Blackout is brutal. Unless you finish high up, or you get a kill, or you complete a challenge, you get nothing for your trouble. I'd be annoyed if there was something worth unlocking, but, at launch anyway, there isn't. Blackout wants you to get stuck in, clearly, but I'm not doing it for new characters to play as, which, ultimately, don't matter much. I'm doing it because Blackout is a thrilling ride.I've spent most of this review talking about Blackout because it really is the star of the show. It overshadows everything, from standard competitive multiplayer to zombies (the latter of which, by the way, offers more this time by having two storylines and three maps at launch). But it's worth digging into standard competitive multiplayer because it's superb in its own right despite some spawn issues I expect Treyarch to iron out. Black Ops 4 is, overall, a familiar experience here, with Treyarch's 'ain't broke so don't fix it Pick 10 system and specialists and their supers lifted from Black Ops 3. But the addition of a healing mechanic, boots on the ground gameplay and a longer time to kill than the series has had before gives you a bit more time to breathe in competitive multiplayer - and I like that. Don't get me wrong, Black Ops 4 is still a fast, lethal, quick to die and quick to respawn rinse and repeat run and gun game, but it's now not always the case that getting shot in the back means instant death. Here, of course, the progression Call of Duty is known for is very much present and correct, and I'm already feeling the pull of prestige. I'm much more likely to play Blackout, but when I'm not in the mood for some stressful battle royale, a few games of easygoing Control is a lovely option to have.Speaking of Control, it's my favourite new game mode. It plays well on most of the maps, with two teams of five taking turns in capturing and defending a couple of points. In Control, you're limited in that each player per team must pick a different specialist, but this plays up to their abilities and roles. It's a showcase for Ruin's Grav Slam, Recon's Vision Pulse, Torque's Barricade and - an early favourite - Nomad's trusty dog. Control can be unbridled chaos, with explosions going off all over the place, grenade launchers popping and ballistic shields clunking. I've found myself losing hours to the mode, switching between specialists in-between games that roll, inevitably, into one another.I haven't missed the campaign, either, although I acknowledge there is a portion of the playerbase who will be disinterested in Black Ops 4 because it doesn't have one. Instead, Black Ops 4 has these weird specialist training missions, which see a sweary Woods bark orders at you on multiplayer maps filled with bots. Spliced into these specialist training missions are truly awful character backstory cutscenes that combine to tell what I guess is supposed to be the Black Ops 4 story. These backstory cutscenes are so, so weird, with awful dialogue and jarring subject matter. One is about child abuse. Another is about post-traumatic stress disorder. Knotting them all together is a nonsensical plot that revolves around an oligarch who has summoned the world's greatest soldiers for some mysterious mission. This is fighting game story bad, and I wonder whether Treyarch would have been better off binning the whole lot. I mean, if you don't have a campaign, you're playing to competitive multiplayer Call of Duty fans only. Most know their way around a gun grip and don't care why Firebreak has a chip on his broad shoulders.So back to Blackout, and even as I'm writing this I'm craving wingsuiting, once again, into the fray. The more I think about it the more impressed I am with Treyarch's execution: there's a polish here that PUBG can't cope with and shooting Fortnite can't hope to emulate. But gone are the days when Call of Duty set the agenda. I remember the series' water-cooler zeitgeist, when the Modern Warfare campaigns were redefining the video game set-piece and competitive multiplayer rewrote the FPS rulebook with perks and scorestreaks. There was a time when shooters copied Call of Duty. Now, Call of Duty looks to other games for inspiration. I'm not sure there's much to be done about this, but I do know this: when Call of Duty puts its mind to something, it knocks it out the park.Now, where was I? Ah yes. Those windows won't smash themselves!"}