{"ref": "https://www.eurogamer.net/spogs-racing-review", "date": "22 Jul 2008", "game_name": "SPOGS Racing", "text": "I'm rather disappointed that the top-tier 1000-Point price-tag seems to have become the default for WiiWare games. It's hardly a surprise - human nature being what it is - but even so, with each new batch that arrives, the fond memories of LostWinds and My Life as a King drift further and further away. I thought the 1000-Point screensaver that was My Pokémon Ranch was bad, but little did I know that SPOGS Racing was waiting in the wings.This is, without question, the worst racing game I've played in - ooh - at least a decade. Seriously. I know that hyperbole is the internet's best friend, and there's an unwritten rule that anything that vaguely disappoints must be colourfully compared to the experience of watching Hitler's ghost sodomising a beloved childhood pet, but SPOGS Racing really is that bad.The concept is that you race these things called SPOGS - essentially giant tyres with a low resolution avatar in the middle. These things lumber around twelve uninspired tracks. And that's it.The sole feature of interest in SPOGS is the Crash N' Grab mode in which you can swipe parts from rival racers by hitting them with the regulation comedy weapons (none of which are particularly obvious or hilarious in intent or effect) and then crashing into them. In theory this allows you to upgrade your ~vehicle~ during the race, but the overwhelmingly shoddy construction of almost every aspect of the game renders this minor innovation all but redundant.The handling alone would be bad enough for most bad racing games, conveying as it does virtually no sense of speed or inertia or physics of any kind. Your SPOG simply sits in the middle of a bland, scrolling track, sometimes rolling around corners as if on rails, other times skidding and striking the side for no apparent reason. If you use your imagination you can pretend it's actually travelling at the speed described.That all pales into nothingness once you contemplate the baffling behaviour of the other racers. You can pretty much race around each track by keeping your finger on the accelerator all the time, but even when you travel at top speed the other racers can rocket past you. Then they'll inexplicably slow down, and you'll pass them effortlessly. Then they'll overtake again. In Season Mode there are turbo boosts littered on the track, but these have no impact on this bizarre ballet. You can overtake another racer even when they're boosting and you're not. You can be using a turbo boost on a straight and be overtaken by another racer with no boost. It all feels completely random, utterly disconnected from anything resembling common sense and ultimately futile. Why bother trying to win when you can be pipped at the finish line for no logical reason?SPOGS Racing at least gets the honour of being the worst game on WiiWare. It looks awful and it plays even worse. It's the most inept game I've played on any format, in any genre, in recent memory. You'd have to rewind to the SNES era to find games that are even comparable as far as visuals go, and even then I think we'd all be much happier with, say, Stunt Race FX on the Virtual Console. 1000 Wii Points for this is an absolute joke. But not a funny one."}