{"ref": "https://www.eurogamer.net/littlebigplanet-hands-on", "date": "21 Jul 2008", "game_name": "LittleBigPlanet", "text": "Soft-spoken Media Molecule co-founder Alex Evans is showing off LittleBigPlanet to a roomful of press, and we're stood behind him blowing raspberries and wailing. Obviously. He doesn't seem to mind. Five minutes in, he asked if anyone wanted to play along, and inexplicably we were the only people to put our hands up (both of them, while hopping up and down). So now we're cycling the Sackboy emotes with the d-pad and using the DualShock 3 tilt function to angle our puppet avatar's head so he's watching his dad.But before we continue, LittleBigPlanet has a problem at shows like E3: nobody goes away and explains it properly, even though devs like Evans always frontload the key pitch. It's a quasi-2D platform game with physics, and you can play it with a mixture of local and online friends, but all the levels in the game were built with the game, which doubles up as a creation and sharing package. We're at E3 to check out the Create and Share bits today, with an emphasis on PlayStation Network features.So we're dancing around the pod screen, which serves as an interactive home and level hub, while Evans explains how things work. We jump Sackboy - a little game character stitched out of sackcloth, obviously - onto a PS3 pad that sits in the middle of the pod, and stare up at the little big planet visible outside the window beyond. It's an access point for content - levels on the Blu-ray and downloadables - and as we stare the game receives levels from the online cloud. They're beta tester efforts with their own names, details and stats (how many times they've been favourited, completed, etc) and at 20-30KB they take no time to download.We jump into one, and we're shown how they're connected to the LBP online hive by stats tracked in the top-left. ~We track your best friend and any of your friends who have done better than you, we show the score that they've achieved on the level,~ says Evans. ~You have to understand that this isn't just for the levels we've published, this is the levels anyone's published. You can create a level with a score and a world ranking and the game will try and prompt you and encourage you to replay that level. We try and treat user-generated content as we would treat our own.~As we play, Evans explains that voice-over-IP - ~headset voice-chat~ in human - recently went into the game, and Sackboy (or Sackgirl, of course) will now lip-synch to your blathering or laughter. As you play, you can also snap screenshots. These, along with any levels you make, can be uploaded to the LBP nexus, and the devs have assembled RSS feeds of levels, photos and other content accessible through a unifying ~Me~ page, which helpfully won't load when Evans tries to boot it up on our E3 test machine. ~Whoever set up this room did a cracking job.~So instead we dive back into the game in Create mode. Levels are assembled (or simply modified from existing designs if you'd rather not start with a blank canvas) using the square-button Pop-It tool, which brings up columns of items to customise your Sackboy and the world with. A bit of stick-waggling draws platforms across the screen, and a few more buttons hooks up cogs, wheels, hooks suspended in the air and glued to the walls, and so on. Sackboy can be floated around the screen and then popped into the game world at the touch of a button for playtesting.~When you play through the pre-made levels, you collect items to customise your character and build your own levels,~ says Evans, explaining where it all comes from, ~so rather than just collecting points and stars you collect the items.~ (Although you do still collect things that go towards your score - this is a platform game after all). You can also write story text, build your own characters, and even fairly complex machinery. The level designers have managed to create basic counting machines - so, a computer - and pirate ships."}