{"ref": "https://www.eurogamer.net/playstation-home-hands-on", "date": "19 Jul 2008", "game_name": "PlayStation Home", "text": "Charity may begin at Home, but if you listen to certain vocal sections of the PS3 community the promise of Sony's shared virtual space is starting to sound a lot like an old collection tin with a few coins rattling around inside. Release dates shift, functions and features remain vague, and there's a persistent assumption from the conspiracy-minded that the whole enterprise may yet prove to be nothing but vapourware. Across the wild frontier of the internet, the same question rings out from doubters and wide-eyed hopefuls alike: Does PlayStation Home even exist in a workable form?Well, yes, of course it does. For one thing, David Reeves has once again promised that you grubby lot will be able to try the open beta trial ~this autumn~ and your ever-loving Eurogamer can now confirm Home's existence with the cocksure certainty of first hand experience, having spent the best part of a day freely wandering around Home in its current beta state. The occasion, of course, is E3 and Sony decided to allow us lowly writers left behind in Europe, with our stale cheese sandwiches and umbrellas, to share some of the LA glitz and glamour by attending a special press event with developers from Insomniac and Sucker Punch, all inside the virtual cocoon of Home.Things didn't quite work out that way for this humble reporter, although the fault for that lies with a flaky internet service provider and not Sony. While this means that you'll have to rely on Tom and Ellie's missives from the frontline to learn more about Resistance 2, Ratchet & Clank and Infamous, it does mean that I got to put Home through its paces under extremely testing circumstances and the result was...impressive.The current Home client clocks in as a 200MB download, and you're prompted to download each new area the first time you visit, in chunks of around 20 to 30MB. There's then a short loading time whenever you walk, or warp, from one place to another but nothing beyond a few seconds.The first thing you do is create your avatar, choosing from a selection of preset models or tweaking your character using the thumb-sticks to align and alter the different face and body features. As everything is still in beta testing, and changing radically with each update if the latest release notes are any indication, it's hard to pin down just how flexible these tools will end up being. At the moment it's decent, but not quite as comprehensive as the character-creation elements found in, say, Tiger Woods or The Sims. Once you're happy with your virtual appearance, you can finally move into your Home away from home.You appear in your swanky Harbour Studio, an achingly lifestyle living space made up of one large room with a balcony overlooking a Mediterranean seafront. You can tell it's been designed to death, with the sort of sweeping lines and carefully measured spaces that would make Sarah Beeny blush. Wandering out onto the balcony to admire the view, you're assailed with a symphony of relaxing sounds - waves gently crashing, seagulls crowing high above. The effect is slightly marred by the fact that these sounds instantly stop the second you step through the open patio door back into your apartment, but there's an undeniable appeal to the place.Pressing the Start button calls up your in-game PSP, which acts as your menu hub within Home. From here you can alter your appearance or wardrobe at any time, and decorate your Home space - or spaces plural, should you invest in additional living areas. Everything is free in the Beta, so I was able to add a rustic summer house to my property portfolio as well. Larger in size than the studio apartment, with a roaring log fire and a two-tier layout, it's another impressively attractive place to hang your virtual hat.Decorating and arranging furniture is done in a style that calls to mind a simplified Sims. Select the item you want to place from the menu - broken down into self-explanatory sub-sections like chairs, ornaments and appliances - and then simply move it into position with the left stick, rotate it with the top shoulder buttons, and plonk it down. Items have a certain amount of physics, so if you drop a lamp on a table from a great height, chances are it'll fall over. Wallpaper can be cycled through various options with a single button press. There was even a bubble machine tucked away as a special surprise in the PSP inventory."}