{"ref": "https://www.eurogamer.net/battlestations-pacific-hands-on", "date": "16 Jul 2008", "game_name": "Battlestations: Pacific", "text": "~Fifteen men on a dead man's chest! Yo ho ho and a bottle of rum!~ No wait, that's pirates isn't it? Well, it's all seaman related and all equally safe harbour away from bald space marines and World War II shooters. Except of course it's not, but despite being set in an era of history that has so far sustained 50 percent of the world's first person shooter output and at least five different satellite TV channels, Battlestations: Midway still managed to seem fresh and innovative.Then again you so rarely get to play as a jolly jack tar in videogames, even though boats are really cool and boats with house-sized guns on them even cooler. But the almost-excellent original was always much more than simply a ship simulator, with developer Eidos Hungary sensibly realising that the reaction speeds of the average battleship don't necessarily make for the ideal action game.The best way to think of the Battlestations series is as Battlefield games, but where you can be anything but a soldier. There's no first person gun-gripping mode but you do get to flit at will between all manner of differently-sized ships, submarines, fixed-gun turrets and aeroplanes. On top of this there's a strategic map view which works almost like a mini real-time strategy game, as you direct your various vehicles around in 2D.All of that could have described the first game though, so right about now you're probably wondering just what it is Eidos has done to the sequel to save it from another 7/10 almost-recommendation. The most obvious thing is that you no longer have to play only as the Yanks, with a whole new campaign as the US and A and another one of equal size as the Japanese. (Sadly hopes of ever getting to control the Royal Navy in this sort of thing are once again sunk - after all it's not as if Eidos is a British company or anything.)The US campaign starts right after the end of the last game and ends up with the invasion of the Japanese home islands. Within sensible bounds it's all historically accurate and all the featured battles actually did take place. In the Japanese campaign though only the first battle is real, with all the subsequent ones based on the plans of what Japan would have done if things had gone its way. Apparently this doesn't end with the invasion of America though, so there's no Man in the High Castle tie-in at the end.With the multiplayer mode out of bounds until somewhere around August what we got to see here was one mission as the US and one as the Japanese. The latter was played at us by the developers and started with an obligatory real-time cut-scene that showed off just how spiffing the graphics are looking now. The semi-transparent waves show your ships cutting through the briny both above and beneath the water and the highly detailed models even have little sailors scuttling about on deck.The developer's ominous mention of HDR lighting caused a bit of shoulder-sagging initially but combined with the wonderfully fluffy clouds there's a slight abstraction to the graphics that reminded us of those paintings you get of Spitfires and whatnot in old men's clubs. Upon voicing this observation much umming and ahhing travelled between the various Eidos boffins present, as they all came around to our way of thinking and started to peer at and compare the various naval paintings that stood nearby.In any case, the graphics are good - excellent even, given the amount of shipping and aircraft flitting about on-screen. Their best party trick though is the damage modelling that sees aircraft wings and tails fly off, radio towers collapse and bulkheads explode and rupture. Sometimes a ship will split in half as it goes down, sometime it'll just slowly take on water before exploding or sinking into the deep blue."}