{"ref": "https://www.eurogamer.net/banjo-kazooie-nuts-and-bolts-hands-on", "date": "16 Jul 2008", "game_name": "Banjo-Kazooie: Nuts & Bolts", "text": "The first thing you need to know about Banjo-Kazooie's expansive E3 demo is the one that's going to get the traditionalists shaking and sputtering with rage: you don't do very much platforming in it. The second thing you need to know, following close on the heels of the first, is that that's fine, because it's still great fun.The demo level has, the developers tell us, been adapted especially for E3 and won't be like this at all in the final game, but is nevertheless a perfect example of the game's new focus. Less running and jumping, more driving, flying, hovering, sailing. Rare's previous pleas that this is not a racing game are entirely valid, but the extent to which vehicles play a role can't be underestimated. They're the absolute core, the beating heart of the game.The E3 demo takes place in a huge indoor environment, one of five major worlds in the game - not including the hub world, Showdown Town, which may be the largest world of the whole lot. For the purposes of the demo, Rare has filled the world with a number of pre-built vehicles for players to discover and investigate. A variety of land vehicles, ranging from a simple buggy through to several more complex, gadget-filled types, give way as you explore to several air vehicles - helicopters, aeroplanes and even a bizarre lifting craft, with two helicopter rotors and a giant ~sticky ball~ dangling from the bottom.Each of these vehicles handles in a different way, thanks to a fairly heavy-duty physics engine which takes into account the weight, balance and even aerodynamics of each craft - before slapping on a layer of common-sense handling limits that ensure everything is functional and fun to drive around. Many of them also feature a number of ~gadgets~, which are activated using the face buttons on the 360 pad and range from springs to bounce you off the ground, via gyroscopes to flip you around in mid-air, to folding wings that snap open and allow ground vehicles to take off.In the E3 version of the game, there are a number of challenges scattered around the environment - accessed by talking to the various weird and wonderful characters who inhabit Banjo's world. These include a challenge designed to introduce you to the spring and gyroscope gadget combo, in which you have to flip your buggy through a number of targets, and an amphibian race in which you use a pre-designed vehicle - one of a limited number of challenges in Banjo where you'll use a set vehicle rather than designing your own.We suspect that most people who get their hands on the E3 code, however, will spend the bulk of their time simply exploring. There are quite a few vehicles to be found, especially once you get your hands on the first aerial craft and the full scope of the environment opens up to you.That's quite an impressive scope, too. While the final game is designed around the idea of entering each world in order to complete a specific task (think of Mario 64, for instance, where each world is pretty expansive but in general you only travel there with a specific objective in mind), that hasn't stopped the team at Rare from creating some impressively huge levels with the power the Xbox 360 places at its disposal.The E3 demo is no exception, being designed and laid out somewhat like a large church or cathedral - in which Banjo and his pals are about the size of children's toys, running around in the naves. It's an epic, cavernous space, and the true scope only becomes apparent when you start flying around it. It's not even the biggest of the levels - the developers estimate that it's roughly the third largest of the five major worlds - and it's already far too big to sensibly navigate on foot. Those vehicles aren't just a quirk of the gameplay, they're a necessity for navigating Banjo's new environments."}