{"ref": "https://www.eurogamer.net/fable-2-hands-on", "date": "15 Jul 2008", "game_name": "Fable II", "text": "~I'm not a planner,~ Peter Molyneux is telling us. ~I don't plan my life more than a few seconds into the future.~ We're sitting in a demo room in Lionhead's Guildford offices. There are timelines on the walls, and spreadsheets littered about the table. Controller in hand, Molyneux isn't admitting why most of his games show up late, he's explaining why his team decided to reinvent the wheel when it comes to co-op gaming. ~Planning to play co-op for a few hours is not part of my experience,~ he sighs. ~To me, co-op should be dynamic. If there is an opportunity, I should be able to take it, but it shouldn't interrupt my normal game.~So you won't be exiting to lobbies or pre-arranging to meet your pals in Fable 2. Rather, in couch co-op, you'll simply throw a spare controller to your friend and they'll pop in, LEGO Star Wars-style. Online, things get a little more interesting.It's all to do with orbs. These look a little like pearls, and move politely about the world of Fable 2 as if minding their own business. And they are minding their own business: every orb you encounter is somebody on your friends list who's independently playing through the game. The orb shows their position, allows you to chat, gift them items, compare stats, and even boot them out of your world. It also allows you to invite them in to join you properly.Co-op in Fable 2 is a bit like inviting a friend to see your Animal Crossing village: players come to your world to look around as much as anything else. ~This works for us because your character and world will be so different from theirs,~ explains Molyneux. ~It's shaped in part by the decisions you've made in the story, and then there are all the little additional choices: 'Jesus, you bought that house? You have three kids?' These simple things that change the world can make showing off your version of Albion very special.~A focus on showing off isn't the only innovation. Guests join your game not as an equal adventurer, but as your henchman, a role that is actually classified as a job within Fable 2's career structure. This means the game will pay them an hourly wage for working for you, and you can negotiate an additional split of gold and experience gained, using a set of bargaining sliders on the invite screen. Anything your guest earns will travel back with them to their own game when the co-op is finished; it's a bit like temping.This sounds a little complicated at first, yet the more we saw of it, the more it impressed. Lionhead's system acknowledges the social context of co-op that other games ignore, and the bargaining over who gets to be the hero and how much the henchman is paid is a crucial part of the fun. ~Your friend might say, 'I can't work out how to open this door,'~ suggests Molyneux. ~You can say, 'I'll give you a hint, but you'll have to pay me.'~In practice, the process of agreeing fees and pulling someone in is as seamless as promised. But you'll have to be careful: although it is possible to turn off friendly fire, anything the henchman chooses to do in the world will have real effects, as proved by the now-famous GDC demo, in which Molyneux's own henchman killed his husband and sent his child to the orphanage. If this all sounds like the kind of needless reinvention Molyneux is famous for, he argues that it's aimed at creating a different kind of co-op experience, one focused on impromptu get-togethers rather than pre-planned marathons. ~Seeing that little shiny orb in the distance and thinking, 'That's Peter! I haven't spoken to him in ages!' and walking over, saying, 'Let's do ten minutes together': that's wonderful, and very different from planning to go to a lobby, pulling someone in you may not know, or phoning somebody up saying, 'Hey, are you playing Fable?' It's a psychological thing. It feels like a bridge between full online and single-player.~And if you don't want to wait for an orb to roll up, you can get the status and location of friends by switching to the map screen, which also allows you to jump right to them. Equally, Lionhead is currently exploring ways of letting you decide which kind of orbs you see outside of your friends: everyone in the same location as you, for example, or anyone with a similar gamerscore.The orbs are a neat idea, but there's a nagging concern that Fable 2 may turn out to be nothing but neat ideas, with no core game to tie all the interesting elements together. Molyneux admits it's a trap he's fallen into before. ~I've learnt more about actually being a designer doing Fable 2 than on any other game. A gameplay mechanic can be very exciting and make you go all funny inside, but it's only as good as the ability for people to play with it, and it's useless if it doesn't aid the drama.~This time he's convinced that Lionhead has cracked the drama as well. To prove it, he boots up the opening tutorial and lets us wander around. Following a wintry cut-scene (one of only five minutes' worth in the entire game) featuring the most elegiac treatment of having a bird poo on somebody that we've ever seen, we're transported to the village of Bowerstone, a Victorian Christmas card come to life, and the place where the story of Fable 2 begins. It's simple, but effective: a mysterious market stall purchase leads to a midnight encounter at a nearby castle, where events quickly take a turn for the worst. Before you know it, there are destinies to be discovered and crimes to avenge: it's a swift and confident kick-off, heavy with potential, and it's all done in under ten minutes of playing, while still finding time to introduce a few of the game's more important mechanics."}