{"ref": "https://www.eurogamer.net/buzz-quiz-tv-review", "date": "3 Jul 2008", "game_name": "Buzz! QuizTV", "text": "The PS3 debut of venerable and award-winning quiz series Buzz will not surprise you. In terms of presentation and content, very little has changed. It's hard to avoid a slight twinge of disappointment when you realise this, since our usual expectation when any series jumps console generations is to expect a showcase; something bigger, bolder, familiar yet beefed up in all the ways that were never possible before.That's not happened here, but that twinge of disappointment soon fades. Buzz doesn't really need a makeover, since it's already a superbly refined quiz machine. Relentless has therefore opted for the safer, more sensible, path of not fixing something that isn't broken. The categories are the same - Lifestyle, Sports, Knowledge, Movies & TV, Music - and they break down into sub-categories such as Food and Drink, Toons and Oldie Hits.The rounds available are also familiar, bar one new addition and one tweaked entry. Play a local multiplayer game and you'll get Point Builder, Pass The Bomb, Fastest Finger, Pie Fight, Point Stealer, High Stakes and Final Countdown. High Stakes is the new round, and requires players to bet some of their points based on their confidence regarding the subject matter. Final Countdown, meanwhile, now places each contestant on a raised podium, the height of which is dictated by your score. Being the first with the correct answers raises you higher, wrong answers drop you lower. Should you drop to the bottom, you plummet into a hole and are out of the game.You still have no control over which rounds you get, or in what order, which seems a bit of a shame, especially with the new emphasis on handing creative control over to the user. Obviously the fixed order has been carefully chosen to offer the best flow of scoring opportunities, keeping the game interesting even when the players are hopelessly imbalanced. And I also understand the urge to keep the game simple and accessible. Yet I can't help feeling that an extra layer of user control, offering access to all the round types from previous games and allowing players to create their own ~greatest hits~ quiz compilation, would have been a nice gesture.User control is, of course, still on the menu in the form of MyBuzzQuiz, the website that lets you create your own quizzes and share them with fellow players, who can then rate your work. The most popular quizzes rise up the ranks, until you're crowned Big Chief Quizlord of whatever region you happen to be playing in. We already went into the nuts and bolts of this addition in our hands-on preview but suffice to say that while the more creative players may find the eight text question format rather limiting, this is an area of the game that can only grow and grow. It's fun just seeing if anybody has created a quiz for your own niche interests, and making one up if there are none to be found.And then there's the online Sofa vs Sofa mode, which is shorter than the offline multiplayer mode with a different line-up of rounds. Stop The Clock, Fastest Finger and High Stakes are joined by All That Apply, in which you can select multiple answers to the same question. You can see what other people are selecting, which is either an outrageous cheat or a good way to make you paranoid about the one that you've not selected but everyone else has. Points are allocated for each correct answer you choose, and deducted for any you get wrong."}