{"ref": "https://www.eurogamer.net/xbla-happy-tree-friends-and-ticket-to-ride-review", "date": "30 Jun 2008", "game_name": "Reviews", "text": "The idea of an ultra-violent twist on Lemmings is undeniably appealing. Tie it in with Happy Tree Friends, the gory web animation in which cheery cartoon characters get horribly dismembered, and you should have a recipe for a sick treat. Should. False Alarm, in fact, often seems to go out of its way to squander its potential, blighted as it is by sluggish controls, bland presentation and - it must be said - nothing terribly outrageous in the gore department.You have five of the Happy Tree Friends to look after, and they start to roam inexorably from left to right (or occasionally right to left) through hazard filled environments. Sawmills. Nuclear reactors. Ramshackle funfairs. That sort of thing. You have four abilities at your disposal, conveniently mapped to the face buttons, with which to guide them to safety.You can freeze the Happy Tree Friends to keep them still while you deal with a trap, or use your icy blast to put out fires or block vents. Explosives can be used to clear a path, remove debris or blow open doors. Fire has obvious uses, but also makes the Happy Tree Friends run away - handy for speeding them up past timed hazards. Finally there's an action button, used for activating switches, levers and valves. Should you fail to deactivate or provide a detour past perils, the Tree Friends take damage and if all five should die then you flunk the level.The most immediately apparent problem with the game is the plodding cursor, which drags painfully slowly around the screen, coupled with some very clunky scrolling. The triggers shuttle your view left and right, but the game follows a strictly linear path and the scrolling follows this with no room to roam. You can't zoom in or out, or control the camera in anything other than horizontal motions. If the level moves upwards, then you're view automatically follows the trail. The top of the screen is cluttered with health gauges and a mostly useless power gauge with a large animated picture of Lumpy the moose, all of which can obscure the things you need to be clicking.Even the Tree Friends can get in the way, both of each other and your cursor. Freeze a character and you'll be unable to click on whatever is behind them - including other wandering characters. Any kind of rapid reaction to an imminent disaster is pretty much impossible, so what should be an effortless celestial viewpoint becomes a constant battle against the game engine, filled with frustration and fussy accuracy issues.These gripes are only made worse by the game's flat-line construction. There are 30 levels in all, each of which takes a few minutes to play. So, realistically, you're looking at maybe two hours' play, at the most. There's no apparent difficulty gradient, with levels following much the same formula from the start of the game to the end. Often, the only challenge comes from the aforementioned gameplay issues and sudden and unfair difficulty spikes, such as instant-death obstacles or levels that rely on guiding the characters across moving platforms - a horrible chore using the clumsy freeze/thaw method of controlling their movements. An annoyingly tricky level can be followed by an incredibly simple one, regardless of whether you're on Level 1 or Level 20."}