{"ref": "https://www.eurogamer.net/wiiware-block-breaker-deluxe-and-cocoto-fishing-master-review", "date": "26 Jun 2008", "game_name": "Reviews", "text": "Breakout? Really? Yes, that was my first impression as well, but then I thought, well, why not? The ol' bat-and-ball concept has endured because it's inherently fun - for whatever evolutionary reason, we humans like to bounce spherical objects off things, and if the things smash in the process then all the better.It doesn't take long to realise that Block Breaker Deluxe, a beefed-up remake of the mobile phone game, has paid as much attention to the ~deluxe~ part of its name as the ~block breaker~ bit. For one thing, the whole game is dolled up like a flier for the sort of garish 1983 nightclub that would be called Coconutz.Secondly, the reason you're playing Breakout (sorry, Block Breaker) is because you're saving up to buy a yacht to impress lots of hip characters who pay you money for playing Breakout (sorry, Block Breaker) in their swanky nightspots. Now, I've seen King of Kong and these are not the sort of people who take part in arcade tournaments. It's all utterly inexplicable and, frankly, makes Arkanoid: Revenge of Doh look like the greatest story ever told.Luckily, the game itself is enough fun that such conceptual unusualness soon fades into the background. Most familiar elements are here - blocks that take several hits to destroy, metal blocks that must be removed by hitting switch blocks, power-ups that extend your bat, turn it into a magnet or let you shoot lasers. But there are also some cool new ideas - like the yo-yo that lets you drag the ball back towards you in a straight line, and casino-themed game modes. There are even boss battles, which work better than they sound. In these rounds, you use your ball-bouncing skills to take down UFOs of varying abilities. You get an addictive two-player mode as well, which is well worth trying if you have a spare remote.Control is by the remote only, which is a minor annoyance. For one thing, it's actually incredibly uncomfortable. This is a game where things get faster and faster within a very limited playfield, and there's very little downtime to relax your wrist. You're also making tiny, constant movements and, while I'm open to the idea that it may just be my creaky joints at fault, it does seem to turn long play sessions into an exercise in carpal tunnel syndrome. You can opt for the slightly fiddly alternative of using the remote's dinky d-pad, but given that the game only really requires left and right for 99 percent of the time, it seems odd not to at least offer nunchuk support for those of us with enormous, muscular man-fingers.Block Breaker Deluxe is as predictable as it sounds, and yet slightly surprising at the same time. It's surprising how much fun the simple joys of bat and ball remain, and it's surprising how nothing more than a varied selection of power-ups, some cunning level design and uncluttered gameplay can still produce something so enjoyable. I downloaded it out of duty, but have kept returning to it for fun. That's the true test of any arcade game, as far as I'm concerned.7/10Cocoto is one of those poor wannabe videogame characters, popular in pockets of Europe but forever pressing his adorable little face up against the thick bulletproof glass window of the Gaming Hall of Fame. He watches the Marios and Sonics and Crashes and Ratchets and Jaks swanning around inside, and lets out a heartfelt sigh. Then Blinx takes his hand, and leads him back to the shelter for another night of anguished sobbing and hollow, rumbling stomachs.This is a port of the 2005 PS2 and GameCube original in which the cuddly little demon took up his fishing rod in a desperate attempt to get our attention. There are adventurey RPG overtones, as he rows (painfully slowly) from an old turtle who gives him orders to the local shop that sells him new equipment, but the bulk of the game is spent catching specific fish to satisfy the demands of that sodding turtle. Catch enough and he gives you the bait you need to go after the boss fish.The fish swim at different depths, and you have different bait to match. There's very little skill involved in actually luring the fish, but landing the bastards still proves to be a real pain in the fins. First you must play a small mini-game in which you keep the bait bobbing along in front of the fish as it races towards you. Once it lunges, you need to flick the remote to hook the fish. Simple, except the timing required for this is so annoyingly fussy that you'll spend most of your time doing it over and over and over. Finally get one on the hook and you reel it in with the nunchuk but - again - muff up the timing even slightly and the fish gets away.Since this is really all there is to it, such tediously precise timing will pretty much kill the game for all but the most devoted (and therefore demented) fan. It looks cute, it has a couple of nice ideas, but it's just not fun. SEGA Bass Fishing may cost four times as much, but it's also four times the game. Pick that up instead.4/10"}