{"ref": "https://www.eurogamer.net/spore-creature-creator-review", "date": "25 Jun 2008", "game_name": "Spore", "text": "It's an unusual situation, to say the least. The Spore Creature Creator is one small part of the full game of Spore, due out on 5th September. Specifically, it's the bit - and smart, title-reading readers will spot this - about creating the creature. You stick bits together, in the manner of a 21st Century Mr. Potato Head, and watch it animate. There's no game. Of course, since one of Spore's main selling features is that your in-game universe will be populated with everyone else's creatures, they'll turn up in a game eventually, but right now there's nothing more than making a creature out of computer clay and marveling as Maxis' magic brings it to life. Maybe put it in front of a different background. Make it dance. Make it play with kids.But to review or not to review? That is the question. The 'nay' argument: this is only one part of a much larger project, and in the UK it's basically a pre-order thing so you can get your money back. The 'yay' argument: whenever a company charges money for something, you bloody well review it. Like, obviously, you blithering idiots. Review!If you've any interest in videogames, you should at least play the demo. While it's going to be disappointing to some people - and I'll explain why in a bit - this is absolutely one of the cutting edges of videogames at the moment. That it does what it does so naturally almost undersells its achievement: it just works. The difference between the demo and the full version is that you simply get a lot more parts out of which to construct your creature. Which, when written down, makes you wonder why anyone would pay for it. It'll all be in the game eventually, and you can have a crack at a fair chunk of it now... why pay?Well, firstly, it's dirt cheap. But a better reason is to imagine a palette of paints. They've given you red and yellow for nada. And, sure, you can paint anything beautifully with the two colours. But those other five are awfully tempting if you're liking how these oils are spreading on the canvas. You want to see what you can do with the full spectrum.You can do a lot of nifty things. The flexibility from the start is enormously impressive. When I was reviewing it, I wanted to see how quickly I could make a functional creature, knowing that within half a minute I could pull the spine into shape, lob on some limbs, add eyes and... well, I could have done it in the time. In practice, it was so adorable that I just stopped and carried on tweaking. Sure, it was a ball of legs, but it was my ball of legs.That's the magic of it. I suspect in screenshots some people have been turned off Spore. It's pretty damn cute, and the saccharine may evoke a gag reflex in some. But when it's your creature it changes. It hits the parenting parts of the psyche hard when you see something you've made come to life. And, of course, the second you get involved with the game you discover you don't have to be nearly as cute as the pre-generated shots. And at that point we start talking about Spornography, and this is a family site. Stay away from the mobile phalluses.There are limitations with the tools, despite the flexibility. For a start, the creatures you create basically have to be symmetrical. So while you can have one eye at the front, you couldn't actually have one, alone, on the right. The animation is a second point - while the ability of it to work out how to move with a horrific mass of legs attached to the side is impressive, there are some even simpler formations that lead to something that moves while twitching. It requires some careful tweaks to get beautifully smooth animation. That said, creating a fun gait is absolutely part of the art. And finally, there's a limit to the total complexity of the creature possible, with a maximum number of moving elements allowed. Well, at least without disabling it with one of programs that have spread out online and you can locate with the magic of Google."}