{"ref": "https://www.eurogamer.net/mercenaries-2-world-in-flames-hands-on", "date": "13 Jun 2008", "game_name": "Mercenaries 2: World in Flames", "text": "Although it gave good Korea and featured a muted pallette of CNN greys, deep down, Mercenaries: Playground of Destruction contained all the geopolitical seriousness you could find in a game of knockdown ginger. And rightly so. A brutal - if basic - ball pond filled with loud things to drive and big things to drive them into, Pandemic's noisome openworld private military disco always knew exactly what it wanted to be: dumb and fun in equal proportion. It's a shame, then, that time moves on - a quick session with the forthcoming sequel, World in Flames, suggests that Mercenaries may struggle to find a place for itself in a post-Crackdown world. It's not that the franchise has an out-of-date agenda, it's just that there are other people around now who have shown how to be a bit cleverer when it comes to the serious business of being stupid.Not that Mercenaries 2 isn't trying. As narrative justifications for cutting a swathe of semi-righteous destruction goes, getting a cap popped where the sun will, hopefully, never choose to shine, is arguably up there with having your parents gunned down in front of you in a dark alleyway, and World in Flames' knockabout revenge set-up rigs the stall for the cheery carnage of missile launchers and destructible buildings that will inevitably follow. Equally, the shift to a Latin American setting, though undeniably at least registering a solid four on the Geiger Counter of gently troubling racial stereotyping, certainly promises enough sunshine and colourful foliage to wrap any amount of napalm around.Indeed, when watching the game demoed by a developer, everything seems to be present and correct: there are grenades to lob, buildings to bring down with a single shot, missions to complete, and enough jumps, stunts, boats, bikes, tanks and helicopters to keep you busy until the US finally invades Venezuela for real and Pandemic reveals itself to be the undercover CIA agitprop team we somehow always knew it truly was. And while Mercenaries 2 is visually rather weak (whether it's just the demo build or the worrying prospect of the PS2 version on the release roster, this jungle paradise has polygon leaves that could take your arm off) the game is capable of containing all the carnage you can create without dropping too many frames.But a subsequent hands-on leaves us wanting more. Although there's never that much fun to be wrung from the limp prospect of playing through a game's tutorial, our demo mission - from speedboat to jeep to posh mansion to smoking rubble in under ten minutes - is distinctly underwhelming. Whether it's the invisible walls which surround even the meekest sprouting of foliage, or the way the game not-so-subtly tells you when to get out of your speedboat by suddenly fencing off all available paths with hefty swathes of suspiciously specific anti-speedboat barricades, your options seem a little charmlessly dictated. It's fiddly, too. As in the first game, large gates blocking your route can only be destroyed by calling in an air-strike, but this time, the QTE mini-game that accompanies the action is both awkward and unenjoyable. It's strange that the mini-games should get a brush-up when things like the AI remain primitive: the tutorial's guards clearly attended the prestigious University of Standing Around and Getting Shot, yet missed the crucial, ~But Not When Lurking Next to an Explosive Barrel~ lecture."}