{"ref": "https://www.eurogamer.net/tom-clancys-endwar-hands-on", "date": "11 Jun 2008", "game_name": "Tom Clancy's EndWar", "text": "Eurogamer is stirring. ~That's completely unfair!~ bleats Michael de Plater, with a whiff of the naughty schoolboy, in his unmistakable south Australian drawl. ~I've been really good on cutting stuff!~ pleads the man who is creative director on Tom Clancy's EndWar, the voice-commanded console RTS that embraces Anglo-Saxon accents of all flavours, from Camden to Canberra, with several tongues in-between. We're chatting to de Plater at the end of the long second day of UbiDays 2008 in Paris. He was up with the larks this morning to demo his pride and joy after a long night of fun and games following the Gallic publisher's press conference in the opulent Louvre, narrated in the equally thick northwest English drawl of the terminally-mugging Vernon Kay. We've just shared with de Plater the remarks of Ubisoft Shanghai content director Julian Gerighty, de Plater's on-stage demo brother-in-arms the previous evening, whom we caught up with early doors today. Gerighty insists EndWar is now feature-complete with one caveat, quipping: ~If we can control Mike... The way I see it, we're done. But If you get Michael involved, he'll be taking notes from all the journalists, and going 'that's a great idea, let's get it in!'~Hence the theatrically indignant response from de Plater. He sees it quite differently, of course, and starts telling us about some new feature that Gerighty, the scamp, has apparently already promised a journalist today. ~It wasn't gesture controls, was it?~ we ask, tentatively. ~Oh yeah, that's the one. He totally pulled that out of his hat.~~Er, that was us, Mike. There's already a story on Eurogamer...~A sudden flash of recognition. ~Excellent! We'll have to put it in now. That's the Peter Molyneux approach to game design: you just announce things in the press and the team reads about them. You don't have design documents, you have articles!~ Detention and 1,000 lines for the pair of them, we say. The point of all this light-hearted banter is how relaxed the team is right now. And, curiously enough, it's all thanks to Assassin's Creed. We got our first and only hands-and-mouth-on experience with EndWar in Shanghai last November, which you may have read about already, and even watched in our recent EGTV Show special.Back then it was all hands on deck with a March release approaching and very evidently, despite the huge potential, a lot of work still to be done. Strategy fans should raise un verre de vin rouge, then, to old Altair: thanks to the massive sales of Assassin's Creed, Ubisoft was able to make shareholder-pleasing patterns on its abacus and shift a couple of big titles out of that financial quarter.So EndWar, with a new release target of October, was the lucky recipient of seven extra months of development time. Which, for a game of such invention and complexity, is a massive bonus. ~It was fantastic,~ enthuses de Plater. ~I've never had that experience happen before, to have the extra time to make such a commitment to getting the quality good.~Now, as both we and Ubisoft know, extra time does not always maketh the game. But in EndWar's case, the signs look very, very positive. Gesture controls, all joking aside, are a happy product of this delay. Currently only up-and-running on PS3, since its Eye camera comes with a handy and necessary stand, this feature will allow you to manipulate the tactical map by waving your hands around. The exact effect the team is trying to achieve can be seen at 0:26 in the original EndWar CGI trailer over on EGTV."}