{"ref": "https://www.eurogamer.net/mega-man-11-review-pitch-perfect-revival-for-an-80s-classic", "date": "3 Oct 2018", "game_name": "Mega Man 11", "text": "Want to feel old? Maybe cast a glance over what Mega Man looks like today - or feel how all that muscle memory that held together those older games has atrophied to nothing as you struggle through the almighty challenge posed by this, Capcom's internally-developed revival of its legendary series that arrives a fashionable 12 months late to Mega Man's 30th anniversary. There might be an all-new look to Mega Man, the harsh pixel edges of old buffed out and a dash of cartoon colour injected into its world, but that doesn't mean the challenge has been smoothed off. This is a game that will make your fingers bleed, if you let it, and it takes great pride in doing so. And if you want to feel old maybe you should just count the years since Mega Man's last proper outing. It's been the best part of a decade since Mega Man 10 - part of a pair of 8-bit styled outings courtesy of period specialists Inti Creates that marked the series' first outing for a decade back then, and one that went down wonderfully well. A lot's happened since that particular reinvention - not least of which is Keiji Inafune's own doomed attempt at a Mega Man (a game which, in a curious twist of fate, was also developed by Inti Creates - though that's a story for another time). If Mighty No. 9 proved anything, it's that crafting enjoyable and challenging 2D adventures isn't as straightforward a task as you might imagine. There's so many pitfalls to face - Mighty No. 9, more often than not it fell foul of them. Mega Man 11, for the most part, shows you how to do it right, and sometimes pointedly so. There's a similarity in the art-style between this and Mighty No. 9, both going for 2D games told with 3D graphics delivered with a toon boldness, but whereas one came off flat and drab the other simply pops - playing Mega Man 11 is like seeing the illustrations which Inafune himself would have once penned for the originals come to vivid life. It feels right, too, from the timing of Mega Man's blaster - and that satisfying loop of charge and release - to the hit pause from each stricken enemy. And you'll see that expertise and craft come through in the various bosses that tail-end each level. This is, at its heart, a traditional Mega Man game, with eight bosses with their own distinct levels available to select from the off (and, beyond that, a little more too), and each one granting you a new ability when bested. It's nothing particularly new, though the implementation has enjoyed a few tweaks - it's now possible to choose abilities and their associated suits via a weapon wheel that's accessible via the right stick - and the levels and bosses themselves are often a delight. One mid-boss encounter has you facing up against henchmen in a rollercoaster that speeds around the screen; one particularly brilliant level belongs to Bounce Man, full of balloons that propel you throughout in a muscular game of pinball. And so it's an 8-bit game with a modern makeover, and that extends beyond the visuals. Mega Man 11 - somewhat controversially given how straight previous entries have played it - introduces a new mechanic via the Double Gear system, a resource you can dip into that grants you more firepower, slows down time or, in last-ditch situations when you've only a little life left, gives you access to both. It's a neat wrinkle, though it's not been gracefully woven into the fabric of the design, feeling more like a crutch for struggling players than an essential part of your arsenal. Which is, perhaps, the point. Mega Man 11 is a brutal game, if you want it to be, but it's also one that offers an in for newcomers via its difficulty levels. The challenge is never totally blunted, but should you want there's the option to have infinite lives, or more abundant currency so you can purchase energy tanks, support modules and ability-enhancing parts more readily. It removes a lot of the friction, effectively making Mega Man 11 a two-hour sprint if you want it to be - but to do that seems to be missing the point. Mega Man, at its best, is all about the friction. These are short games designed to be stretched out over long lazy summer holidays, their challenges to be tamed one screen at a time. There's something magical about finally nailing a tricky section in Mega Man - knowing when to jump, when to shoot, when to slide at just the right point - and it's like learning an instrument and finally being able to pull off the lick you've been studying for so long. Mega Man 11 boasts that sense of conquest that's made the series so adored, and it's been smart to open it up a little to newcomers. And in that way Mega Man 11 is faithful to what makes the series special. It can be a gentler, softer game, but this is still action with big snarling teeth, one that will spit you back as quickly as you come back hungry for more - and what's wrong with trying to win a few more fans along the way? For those returning to Mega Man, just know that the essence of this series remains intact. After so long away, you can't really have hoped for much more than that."}