{"ref": "https://www.eurogamer.net/neopets-puzzle-adventure-hands-on", "date": "3 Jun 2008", "game_name": "Neopets Puzzle Adventure", "text": "Never heard of Neopets? Then you're probably not among the more than 11 million unique visitors to Neopets.com each month. It's a Nickelodeon-owned online community of people caring for and raising virtual pets. What might prick up your ears, though, is that Capcom has secured the licence and set Puzzle Quest developer Infinite Interactive to work on a videogame version for Wii, PC and DS, due out this Christmas. The result is Puzzle Quest with cute animals and Reversi/Othello instead of Bejeweled as its puzzle component.Othello is a tile-based game, played on an 10x10 grid, which involves laying counters to annex those of your opponent. If he or she has a line of red counters on-screen with one of your blues at the end of it, placing a blue at the other end will flip all of those in-between to your colour. But in placing the blue counter, you may open yourself up to have some of your own counters flipped from another angle. Keeping a watchful eye on the whole board to avoid being caught out horizontally, vertically or diagonally, and then making the correct placement choices, is what demands skill - and taking advantage of your opponent's mistakes is what generates satisfaction.Like Puzzle Quest, the basic gameplay is supplemented by a range of offensive and defensive attacks and spells that you can use to beat your opponent. Unlike regular Othello, the board has a handful of coloured gems on it, and taking control of the tiles they sit upon banks those gems in the same way that Puzzle Quest allowed you to build up mana by collecting its own different coloured gems (the version we saw at Captivate 08 in Las Vegas had three types of gems to collect). When you want to cast a spell, you click on it on the left side of the screen. The examples we saw would force an opponent to place a counter on a tile of your choice, or absorb some of their points total based on the number of gems you had collected.The winning conditions for each round are based on those points, which are built up by successfully annexing more and more counter spaces as well as by casting spells, and you can also win by clearing the board completely of your opponent's counters. That won't be easy, though, because he or she can use spells against you, too, and you both have access to basic offensive and defensive attacks that allow you to flip a counter of your choice anywhere on the board; this doesn't automatically annex everything adjacent to it in the regular way, but does allow you to stick another counter on the other end of a line in a subsequent turn to do so. And the other reason it won't be easy to win is because, in much the same way Puzzle Quest demanded a core level of competency in its Bejeweled gameplay, Neopets requires basic and latterly advanced Othello skills to succeed.Also like Puzzle Quest, outside the games of Othello there's a world map that your customised Neopet has to explore, taking on quests for residents and advancing the story. Unlike Puzzle Quest, though, there are multiple world maps - deserts, prehistoric realms, oriental environments - that tie in with the fiction. There are three ~Lands of Neopia~ in total, and more than 150 quests in the single-player game. Everything is colourfully designed to match the existing Neopets art style, giving the game a cutesy, almost Japanese appearance."}