{"ref": "https://www.eurogamer.net/astro-bot-rescue-mission-review-genuinely-magical", "date": "3 Oct 2018", "game_name": "Astro Bot Rescue Mission", "text": "Astro Bot Rescue Mission is a pretty wonderful platformer, but VR does something that lifts it to the heady realms of actual magic: it allows you to climb inside its world. As is often the case with third-person VR, something truly astonishing takes place when a character you control is no longer running back and forth across the screen, but is now running up and down and around the position where you are actually sat. Astro Bot is a tiny Aibo-like robot, a cute waddling toddler with a tiny cape flapping behind them. Astro Bot's friends have been scattered across the cosmos, along with pieces of their ship, and it's up to you to follow them down into various fantasy worlds and bring everyone back together. But you sit in those worlds with them, and they often scale structures that see them lofted high above your head, or descend into pits that you have to lean forward to peer down into. At one point, I left Astro Bot to dawdle at a corner of the screen while I headered a football back at a distant foe who had chucked it my way. As is traditional with headering, I used my actual head. It was the only polite thing to do. Later on I used my head again to break through platforms and to nudge fronds of seaweed out of the way. In third-person VR, the player is suddenly a presence in the world in a way that goes far beyond their traditional in-game avatar. It's dazzling.It helps that Astro Bot's worlds are so varied and playful. From gantries and skyscraper building sites to a sequence in which you're swallowed by a giant monster and must work your way through its belly, this is a game that delights in the possibilities offered by each stop on its itinerary. There are temples and lava pits and boss fights that obey the rule of three, but the strong sense of tradition actually helps to drive home just how special Astro Bot is. VR makes everything old new again: I learned to turn behind me when beginning every new stage because the developer likes to tuck collectables behind the camera's starting position - and I am the camera. Elsewhere, climbing a huge oak tree at dusk, the magic hour lighting ceased to be video game lighting and became, what? Actual weather, I guess. It became the climate around me. I was transported.At the heart of all this is an excellent platformer. It knows to offer a soft kind of stall on your movement when you're nearing the rim of a platform so that you have to really push forward and commit if you want to go over the edge. Alongside your jump move and your punch, Astro Bot can also hover in mid-air for a while on a little jetpack, which not only gives you a bit of leeway with jumps but also allows the jets to pinpoint precisely which parts of the environment you're currently moving over - a lovely lift from Mario Sunshine. Also, those jets damage enemies, which means it's perfect for taking out electrical or spiked foes who are otherwise immune to your attacks. It helps link combat and traversal in a game that already delights in flinging them together, with baddies airlifted into the canyon you're exploring in one stage, or emerging from the pools and grottoes of another. In the jungle, the baddies wear leaves on their head as playful camouflage. At the beach, they wear water wings. There is a sense of genuine knockabout joy in the detailing, a sense that every moment of the adventure is a lark.And it's all so tactile. When I wasn't headering balls back at the baddies who had produced them from a convenient body cavity, I was playing around with a series of adaptations that clip onto the floating DualShock 4 that hovers in front of you when you're in the game. A water jet allows you to put out fires, while a shuriken shreds spider-webbing into lovely thick rags. There's a gatling gun and, perhaps best of all, a grappling hook that allows you to pull the plug out of hovering hot air balloons or yank down loose pieces of masonry. In some sequences, you use it to construct tightropes that you can then fling upwards to propel Astro Bot into the sky where trinkets await. These gadgets are used pretty sparingly, and there's a wonderful piece of theatre as you bolt on a new one, pushing the DualShock into the appropriate slot on a giant crate and then watching as the VR controller's touchpad turns translucent, say, and shows the reeling cable of the grapple attachment inside it. It's weirdly convincing.(The DualShock also stores the robot buddies of Astro Bot that you collect on your adventure, each one dislodged from their hard-to-reach perch and swinging through the sky to land on the touchpad with a thump. The sense of connection, of new weight added as they disappear inside the DualShock is wonderful. There is a great VR falconry game to be made with this mechanic, I think - if falconry itself wasn't even more niche than VR.)With plenty of secret challenges and collectibles awaiting, this is a compact game that has been absolutely stuffed with delights. But the simplest delights are all around you throughout, there in the way that Astro Bot comes in close or disappears into the distance as the level furniture demands, in the way that I felt I was brushing aside leaves as I followed the waddling little robot further into the forest world, in the way that a boss truly towered above me, filling my vision. VR already feels a bit like the future of yesterday, sadly. Well, it turns out that the future of yesterday is amazing."}