{"ref": "https://www.eurogamer.net/fracture-hands-on", "date": "2 Jun 2008", "game_name": "Fracture", "text": "A good bluff single word name is what every up and coming new action game needs to properly project its masculinity. Doom, Quake, Rage, Prototype, Fracture, Prey, Crackdown, Condemned, F.E.A.R., err... Turok. You know what you're getting with a name that blunt and muscular and it doesn't involve moving virtual furniture or petting polygonal dogs.The only problem is that as different as the games might be the names are so similar it's hard to tell them apart. When you first clicked this link where you 100 percent sure which game this was? Maybe it was that one by the guys that did Hulk: Ultimate Destruction? Or was it that new one from id Software?It's neither, it's the new LucasArts game that isn't a Star Wars tie-in. Crazy talk we know, but this really has nothing to do with Star Wars at all and, according to the LucasArts producer we got to chatting to over a rather nice roast chicken lunch, the thought of making it yet another Jedi based tie-in was never entertained. Incredible as it may seem LucasArts has turned off the license-printing machine and decided to enter the world of original ideas.Fracture, you may now be beginning to recall, is actually perfectly sensibly named, since the game's plot and gimmicks all revolve around interfering with the Earth's crust in various third-person shoot-'em-up benefiting ways. ~Terrain deformation~ is the term LucasArts has concocted to describe it and which no one but them will ever use without feeling slightly silly.Your adventures in topographical realignment are achieved via two key methods, the most obvious being your trusty Entrencher tool which with a press of the left bumper instantly carves a two metre wide crater in the ground, while pawing the right bumper creates an instant molehill of the same size. (You can also use it to knock back enemies if you run out of ammo, but it doesn't do anything more than that.)The other means of messing with mother Earth is by flinging grenades, of which there are currently four types - two of which simply replicate the raising and lowering of the Entrencher but in an easily-thrown bite-sized form.The Spike grenade is more interesting because it creates an instant vertical shaft of quickly cooling lava, which you can use to poke and melt encamped enemies, knock over objects or even jump upon to use as an impromptu lift. The final Vortex grenade doesn't do much to the terrain at all, but it does create a mini tornado that sucks everything into it and then explodes - which is still terribly useful.LucasArts (developer Day 1 Studios, who did the MechAssault games, didn't seem to be around) was happy to demonstrate all this in the first ever look at the second of the game's three main areas - the slightly dour-sounding Desert South West.At this point all the exciting talk about making the earth move for genetically enhanced bad guys hits the cold hard light of ultra generic art design. If you can imagine every sci-fi movie and game from the last twenty years being put into a giant mixer, turned to gooey pap and then excreted out in the form of the world's least memorable looking enemies, dropships and backdrops then you might get an idea of just how bland this game looks.On a technical level it's often quite impressive, but the production design seems to have been neutered in order to ensure more conservative gamers don't have their minds imploded by the presence of so many new ideas, thus providing a comfort zone of (over)familiarity in case they get scared by it all (or haven't played Magic Carpet before)."}