{"ref": "https://www.eurogamer.net/blood-bowl-hands-on", "date": "28 May 2008", "game_name": "Blood Bowl", "text": "Games Workshop's headquarters in Nottingham is a pleasantly schizophrenic building, thrones and wall-mounted torches competing for space with tile carpets and coffee machines. Stone-cladding on the inside adds that delicate hint of theme pub, while presumably serving as another layer of protection for when the notoriously gun-crazed locals open up on the dice rollers with their automatic weaponry. The building also doubles as the venue for the annual Blood Bowl championship, and this year, Games Workshop has used the competition as an opportunity to reveal the PC version of that venerable tabletop sports game. A brash mix of American Football and impromptu goblin violence, Blood Bowl blends touchdowns with bone-smashing tackles and spell attacks. I actually played the original game for about five minutes back around 1990, until it became apparent that the brain-mangling and vein-rupturing so vividly depicted on the cover of the box translated into a lot of dice-rolling and distance-measuring on the board. Twelve at the time, I remember feeling dimly cheated, as if I'd somehow ended up in a funds management seminar after being promised a trip to see the gory inner-workings of a local sausage factory, culminating in an overview of the matter-smeared tank the workers kick the offal into. Although other, more perceptive types have found Blood Bowl both elegant and exciting as a boardgame, that lingering contradiction between the action-packed subject and the turn-based pacing becomes even more important as the licence shifts to consoles and PC. Can the game deliver the lengthy dice-rolling battles original fans want, while also seeming arcadey and toothsome enough to satisfy new players lured in by the promise of violence?The solution turns out to be a choice of two game modes: the original turn-based play, or a more streamlined real-time version. Both retain the same dice rolls and rule structure of the original game, but real-time shoves all that out of sight, and brings match durations down to about five minutes.In the turn-based game, characters are selected with the left mouse button, and then moved about the grid with the right, which can also assign various contextual actions, such as clicking a team-mate to pass, or an enemy to tackle. Every action in Blood Bowl relies on a dice roll, and if you lose - failing to dodge a lunge or fluffing an attack - it's the end of your turn. This is where tactics come in, as seasoned players know the best order to use to get the least risky moves out of the way early on. Sitting down with the game, it's immediately pretty obvious that the developer, Cyanide, knows what it's doing. The French outfit acquired the licence in an undisclosed out-of-court settlement after Games Workshop felt their original fantasy football title Chaos League wasn't quite as original as it could have been. Everybody's friends now, though, and it's easy to see why: Blood Bowl is coming together nicely. It's not the most lavish-looking game you'll ever see, but the animation brings the various races to life with real swagger, and the environments, ranging from a village green to a Chaos-themed stadium with lava for grid lines, are full of charm."}