{"ref": "https://www.eurogamer.net/mass-effect-5-9", "date": "27 May 2008", "game_name": "Mass Effect", "text": "Given that Kristan wrote a three-page review of the Xbox 360 version back in November, and the PC version is basically identical, I'm left with a whole review to dwell on the important questions about Mass Effect.For instance, why did BioWare model its adorably rubbish Mako ground-attack truck on early-eighties toy Big Trak: the Fully Programmable Electronic Vehicle? Almost everything about Mass Effect can be explained with a little thought (Why is the combat a bit shonky? They haven't had a crack at an action game since MDK2. Why is it so talky? Well, it's a BioWare game, innit. Why do you have to buy stuff from the bloke in the basement of your ship rather than just court-martialling the little dipstick? Because BioWare cannot resist the tropes of the RPG genre). But the Big Trak homage is completely inexplicable. Perhaps Big Trak is worshipped as a totemic creature in Edmonton? Perhaps Greg and Ray were always denied one as kids and decided Mass Effect would be their late Christmas? Perhaps they were aiming for a Halo Warthog clone and just missed?Thankfully the origins of Mako are only a peripheral issue when considering this epic space-action RPG.The easiest way to grasp Mass Effect is to imagine Knights of the Old Republic. Strip out the Star Wars licence and replace it with some serious-but-well-crafted original fiction, then remove all the pause-time strategy-style comba. Replace it with competent but unspectacular third-person shooter tactical action, complete with cover system and team-mate ordering. The RPG skills influence the game, in terms of special powers and improved shooting abilities. So, like Deus Ex, the amount your sniper-sight wobbles is based upon your character's ability and the quality of your weapon. And, like Deus Ex, its worth is less in the individual action sequences, and more in the synergy between the RPG development, the action and the frame of a developing story. The results are splendid. Kristan gave it a strong eight, and that's what I'd give it too, so if you're one of those sort of people you can go and get back to comparing PS3 and Xbox 360 screenshots for errant pixels.The PC version is, as promised, definitely a PC version; a conversion more than a port. Admittedly, that's mainly because of how low the standard for ~conversion~ has sunk, but there's nothing particularly grating, like the appearance of Xbox controllers in the tutorial sequence. The biggest change is a mechanical one - the mouse gives a lot more flexibility both in calling up the variety of powers your Biotic and Tech characters can perform (Biotic = Mage, Tech = er, another sort of Mage, basically), as well as the simplification of aiming (Mass Effect, with the deliberately-imperfect aiming, sidesteps the PC's flaw of superhuman, impossible accuracy). Hotkeys can summon up your characters' abilities. Also, you're able to swap seamlessly between all of your weapons. Oh - and you can order your team-mates to go forward and take up their own positions. These things are all are integrated so well that I was surprised when I discovered they weren't in the original 360 version.In terms of stuff which doesn't actually affect the game that much, there's the graphical upgrade - the game remains gorgeous, in short - and a new hacking mini-game. Instead of the Simon-says of the original, it's a sequence of rotating disks you have to skip through. Think concentric Frogger. It's a mini-game and it manages to reach the heights of a mini-game. It does the job. The job being a mini-game. Yes. A mini-game."}