{"ref": "https://www.eurogamer.net/final-fantasy-crystal-chronicles-my-life-as-a-king-review", "date": "21 May 2008", "game_name": "Final Fantasy Crystal Chronicles: My Life as a King", "text": "It's funny to think that back when Nintendo announced its WiiWare line-up, the 1500-point (GBP 10.50 / EUR 15) price tag for Square's peculiar role-playing city-builder was the cause of much outrage and hand-wringing. Once you're actually playing the thing, you soon realise it's a small price to pay for a game that could easily have been released on disc at three times that amount without anyone crying foul. My Life as a King is not without flaws, but between this and LostWinds perhaps we'd do better to consider WiiWare a console alternative to Steam rather than a rival to Xbox Live Arcade or PSN.The game takes place in Final Fantasy's spin-off Crystal Chronicles world, where a poisonous gas - known as the miasma - has covered everything, unleashing hordes of monsters in the process. As My Life as a King starts, the miasma has lifted and our trio of heroes are returning to their abandoned home town. As well as the boy king under your control, there's also Chime, his teleporting mentor, and Sir Hugh Yurg, a Liltie warrior knight. In the centre of town is a giant blue crystal, which imbues the king with the power of Architek - the ability to conjure buildings out of thin air. Doing so uses up the crystal's supply of elementite, a resource that can only be found beyond the city walls. After some lengthy story scenes, which will charm Final Fantasy fans and annoy the pants off everyone else, you're finally allowed to get down to business.As the king, you're not allowed to go questing, so instead you must build houses and then hire adventurers from the families that live in them. The game is chopped up into daily chunks, and each day allows you to issue behests - or kingly instructions - to your adventurers. Sending them off to explore new areas of the map, or to defeat the boss monsters they discover along the way, is a major component of this and your best way to restock your supply of elementite and unlock new building types. Progress soon settles into a pleasant cycle of exploring the surrounding terrain with your adventurers, while using the spoils of their quests to expand your town, increasing your population and therefore your potential pool of adventurers. Shops can be added to sell food, weapons, armour and potions, while specialised structures like the mage academies and gaming and training halls allow your heroes-by-proxy to change jobs, rounding out the available skill-base to include the obligatory thieves, black mages and white mages. You can make cash donations to increase the quality of a shop's stock, or to add new skills to the trainable options.For all this backstage fiddling, the adventurers pretty much look after themselves - they'll spend their wages on the items they choose, head into the wild for more EXP points without your approval and even spend the day in bed if they feel overworked. Yes, the adventurers can be a headstrong bunch. You can't order them about directly, only post your requests and hope that you've managed your resources in such a way that the right adventurers are available to undertake the task. Each new quest appears on the town notice board (you can add more later, so you can have more than one quest on the go at a time) and interested adventurers queue up for the job. You can then handpick the best ones for the job, suggest the less able need some more experience or just send everyone out and bite the bullet when they all come back looking for a day's wages.Once you unlock the tavern, you can start putting your adventurers into balanced parties, while there are numerous other factors that you can directly - and indirectly - influence to maintain their fighting form. Characters that live close to specific buildings will grow up absorbing the relevant attributes, for instance. An adventurer who lives near the white mage academy, therefore, will be more suited to life as a white mage. Town morale can give them a boost, which you can increase by throwing holidays, making sure everyone has the right amenities and simply by wandering around your domain talking to people. While the game is never overwhelming, there's undeniably a lot of variables to tinker with. Thankfully, it never descends into hellish micro-management, and the prospect of keeping your citizens happy is more of an occasionally fun distraction than a constant chore."}