{"ref": "https://www.eurogamer.net/wiiware-roundup-hands-on", "date": "20 May 2008", "game_name": "Reviews", "text": "The launch of WiiWare - small games that you can download from the Wii Shop - is the fulfilment of part of Nintendo's promise for the system. As the hype was building before the console's launch, Nintendo made much of the idea that the system would encourage creativity and lower the bar for developers - allowing people to experiment with innovation without taking huge financial risks. A year and a half after launch, here we are. WiiWare allows developers to create small games - with small teams and small budgets - and then make them available online, priced at 500 Wii points (GBP 3.50, or EUR 5.00) and upwards. Speaking with us in Frankfurt ahead of the launch, Nintendo's European marketing boss Laurent Fischer confirmed that there was no content approval process - developers can create whatever they want, provided it passes the technical approval process and gets a recognised age rating.For developers, then, it's a platform that offers a remarkable level of freedom - much lower costs and logistical demands than either PlayStation Network or Xbox Live Arcade, most notably. But what about the rest of us? What does the WiiWare launch mean for those of us sitting at home, Wiimote in hand, looking for something to play? Fear not - we've gone forth and played all the WiiWare games currently confirmed for Europe. Six of them are out today, with two more set for release during the ~launch window~, which is secret industry code for ~Next week? Next month? Who knows?~, so look out for them soon.The only one you won't be reading about here, in fact, is LostWinds, because we've already reviewed that, and Kristan really liked it. You can read his full review of it elsewhere on Eurogamer, so there's not much point discussing it again, except to emphasise that he really, really did like it. A lot. Look out for full reviews of the others soon, and in the meantime here are our first impressions.Kicking off the line-up, here's one that everyone will be familiar with - well, most people reading this site, anyway. Dr Mario, for the uninitiated, is an old Nintendo puzzle game in which you need to rid a medicine bottle of a random selection of colourful viruses by lining up pills of the same colour vertically or horizontally next to them. This version of the game is really two games in one - albeit two games that happen to be very, very similar. In Dr Mario, you get a classic version of the puzzle game, controlled using either the Wiimote on its side or the Classic controller. There are a couple of concessions to modernity, however - Mario and the rampaging viruses in the screen decor are 3D, for instance. More importantly, there's a Wi-Fi Connection mode that allows you to play against a friend online, which will probably be the primary appeal for fans of the original.Meanwhile, the Germ Buster segment is broadly the same game again, but this time it utilises the Wiimote pointer as its control method. So you grab the pills as they enter the bottle and then guide them into place with the Wiimote, which feels a little odd at first but quickly becomes rather natural. That said, for getting high scores, we'll stick with the original, classic version of the game - although Germ Buster's side-column animation, depicting your Miis fighting back a rampaging horde of viruses, is quite cute.We suspect that WiiWare will be the home to many puzzle games in the coming months, and Dr Mario may not be one of the best to be launched on the system. It's also certainly not a flag-bearer for the kind of innovation and risk-taking we'd like to see on WiiWare - but in the eyes of many gamers, it's an enduring classic, and this is the best version we can remember.Speaking of innovation and risk-taking, a Final Fantasy game? Seriously? Well, before you roll your eyes back into your head, consider this: My Life as a King is the single most dramatic departure for the Final Fantasy series since Final Fantasy Tactics launched on the PlayStation. In fact, although it carries the Final Fantasy name, there's nothing in that vast pantheon of games like this.The basic concept is that you are the boy-king of a dispossessed tribe of nomads, who arrives at an empty city centred on a vast crystal. This, rather helpfully, is the ~promised land~ your father, the former king, told you to seek - and the crystal grants you the power of Architek, the ability to create buildings and repopulate the city with citizens.In other words, this is a city building and management simulation, rather than a cut-scenes and angst RPG. Using Architek, you can walk around the empty city, placing various buildings on the empty plots of land. As you build homes, you can recruit adventurers to go off and explore the surrounding lands, fighting monsters, defeating bosses and returning with the spoils - and, crucially, with the material needed for more buildings. You don't actually see any of these adventures, or fight any monsters - you just see brief reports of their progress, and can watch their RPG-style stats grow. Your job is to keep the adventurers, and the general population, happy, loyal, well-equipped and well-paid.It's an intriguing game, with graphics reminiscent of The Legend of Zelda: Twilight Princess, combined with the lovely character designs we've come to expect of Crystal Chronicles titles. The freedom and the non-linear nature of the whole thing are totally unlike Final Fantasy games of the past. We'd compare this more closely to the likes of Harvest Moon, but with adventurers rather than cows.Moreover, it's huge - and incredibly detailed - with an entire city to build, and each citizen within it having their own life and routine, which you can follow throughout the day if you like. Compared to every other title on WiiWare, this is an epic, which might easily have justified a release on disc. It sets the bar high for WiiWare and is a good indication of what developers will be able to do on the system down the line."}