{"ref": "https://www.eurogamer.net/grand-theft-auto-iv-review", "date": "13 May 2008", "game_name": "Reviews", "text": "Assuming they're not hiding until Q3, everyone else will be kicking themselves. Ever since GTA III, they've all been standing on Rockstar's shoulders and leaping off in new directions, like war and destruction in Mercenaries, super-heroics in Crackdown, and goblins and Jean-Luc Picard in Oblivion. But Rockstar kept its eye on the zeitgeist, and GTA IV's big innovations aren't amazing physics, spectacular graphics and epic environments - although it has all those - but convenience and multi-tasking. There is no longer any wasted time.There have been hints of this before: listening to Lazlow while you chased down gangsters, using disguised ramps to outrun the mafia; doubling up the entertainment. But GTA IV doubles up the interaction. The mobile phone is central to this, allowing you to make phone calls and text-message people one-handed while you walk or drive; networking, socialising, organising, and listening to that ringtone you downloaded for America's Next Top Hooker. It's a tool for manoeuvring between GTA's activities and gameplay ideas quickly. It feeds you certain missions, and lets you phone in the results. When you hear a song on the radio that you don't recognise, you can dial 948-555-0100 and the game will text you the artist and song name. The phone's well-realised, too; you even hear that interference noise when it's about to ring. When you fail a mission, you can answer a text to teleport yourself back to wherever you spawn after the cut-scene briefing finishes.You also keep your weapons when you die, so as long as you're never taken alive, you can do just that. When you succeed, the game auto-saves. Once you've wined and dined your friends and family, you can use the phone to order supplies - Little Jacob the arms-dealer will pull up in an alley nearby, Brucie will fly his chopper to a nearby heliport, Roman will send a cab. The cabs are very useful. Any cab you see can be whistled for, or leapt in front of, its customers ousted and thrown to the kerb and the driver instructed to take you to a waypoint, social venue, or any of those familiar little initials on the mini-map that initiate missions. Hit a button and you're teleported there via a short loading pause. It's pricier to do, but hey, convenience costs. If you drive yourself, GPS navigation uses the mini-map to guide you to your mission-specific destination or waypoints. However you travel, you can look around with a free-look right-stick camera, and a button for locking the camera onto targeted vehicles and individuals assists with pursuits.Besides the phone, the second-best thing GTA IV does is realign the combat to match the Hollywood driving. A Gears of War-style cover mechanic slams your back up against most surfaces, even cars, so that you can creep up to the edge, hop to adjacent cover points without exposing yourself, and fire on your enemies with a flexible targeting system, which locks on but frees you to drag the reticule to a head, or kneecap, flick to other targets or go completely free, crouch to improve aiming or click to zoom slightly, all without tying your fingers in knots. As you approach an abandoned, rundown hospital packed with drug dealers, or tumble into cop-filled streets to affect a getaway, or jump out of an elevator in a goon-filled hotel corridor, your heart rises, where often it sank.There's also a sense of refinement in areas where GTA has always been strong, like driving and carnage. Now you can lean out of the window and fire in any direction, providing you can direct the right analogue stick at the same time as steering and managing the throttle - slightly awkward, but then it would be - and technical advances improve basic acts of destruction. Along with tumbling lamp-posts, there are fire hydrants to crash over, innumerable variations on smash-object-and-shower-street-in-debris, and some environmental damage; actual structures maintain their integrity, but you can chip away, they hang onto bullet holes, and anything you can see through is no sort of cover. The NPCs know this, too, and rarely stay in the driver's seat for long if you lock onto them with a gun - something else you can do now, with a matching blood-spray effect on the punctured windscreens to announce the truth of your aim.Windscreens also take a battering from heads, because you can be thrown through them on violent impact. Explosions rock you and anything else in the world - try going up to a group of people with a live grenade - and it's possible to entertain yourself by walking into moving cars, or hitting bikes at speed to send their riders into the air. You have to look before you cross the road. The effects are comical at times, but GTA IV reserves the absurd for exceptional circumstances, like a man trying to cling onto his carjacked sedan as you accelerate away. Bodies can't be broken into pieces, despite the blood, so it's never disgusting either."}