{"ref": "https://www.eurogamer.net/motorstorm-pacific-rift-hands-on", "date": "10 May 2008", "game_name": "MotorStorm Pacific Rift", "text": "MotorStorm! It's the bad boy of off-road racing games, and now with monster trucks! And a creative director called Paul Hollywood! Who slags off competitors during David Reeves's PlayStation Day speech! ~This is not Redneck Racing, Baja or rally,~ he told the audience, which sounds like fighting talk to us, and we should know - we start fights all the time. ~It wasn't putting them down,~ Hollywood tells Eurogamer afterwards, as we shove people off a cliff Coyote Revenge-style to get in front of him. ~We exist in a genre all of our own... I have a lot of time for those other racing games - obviously I've played them and I've learned from them - but I just want to say we like to think of ourselves as unique.~So how about that monster truck? It's ~an aggressive vehicle~, says Hollywood, ~which can totally obliterate some of the other vehicle classes~ - everything except the Big Rigs. We get to try the truck out on a racetrack called Beachcomber, and it's speedy off the grid, even with MotorStorm's traditional eight-second delay before you can use its boost mechanic, and bike and buggy riders give it a wide berth as it launches through the start/finish gate down towards the beach. The problem is in turning. Even with relatively firm ground under-wheel, the monster truck skids towards cliff-sides and wooded areas, and is prone to toppling over when provoked by rocks. Like the other MotorStorm classes, then, it takes a bit of effort to master.Evolution hasn't forgotten about the others, either, and each has been updated in a few ways. There are new attack manouevres, allowing you to shove people out of the way when they're alongside you, Road Rash-style, and those on bikes and ATVs will be able to move around a little in the saddle, ducking under branches and vines, or even under vehicles flying in their direction, while a bunny-hop move allows bikers to jump over debris, avoiding previously unavoidable spills.Pacific Rift's location, The Island, is meant to be more oppressive than Monument Valley. ~Monument Valley was a fantastic backdrop for the first game, but it was very passive,~ says Hollywood. ~Now you've got vegetation, water, lava, high-altitude tracks, there's so much more in there.~ Making a meal out of vegetation isn't the tastiest idea ever, but in addition to knots of trees there'll be bushes, shrubs, vines and long grass presenting a tangible threat to smaller racers. Trucks and rigs will shrug it aside to some extent, but unless they follow one of the larger vehicles closely, the nimbler racers will have to take a detour or put their fragile frames at greater risk.With a limited range of tracks to use at launch, MotorStorm 1 was reliant upon the diversity of its vehicle classes to sustain its single-player Festival mode, sometimes using bikes only, or mudpluggers only, or a mixture of two or three classes, and eventually opting for the full field. With Pacific Rift's 16 tracks, there should be healthy expansion there. ~We have a totally unique unlock structure in MotorStorm Pacific Rift,~ Hollywood adds, ~which is based around the Festival experience, so you go into the different zones and you'll be doing races and unlocking different vehicle classes, characters - we've got some really special characters in there - and game modes, liveries for your vehicles.~One big addition in terms of modes is split-screen. We were able to play a game with a two-way vertical split and surprisingly high levels of detail. ~Our main concern is the frame-rate, so it's the same and you still get that same tactile experience racing in multiplayer or in single-player,~ Hollywood says when we ask what's been sacrificed to get it working. ~We will turn a few things off, but it will have no effect on the actual emotive sort of experience you'll get from playing.~ But isn't split-screen a bit 1998? ~If you've got two people in the room, why not play together?~ says Hollywood. ~Yeah it's great competing against brutal AI, but there's nothing better than competing against a brutal mate.~ The end result will support four people, too."}