{"ref": "https://www.eurogamer.net/echochrome-review", "date": "9 May 2008", "game_name": "echochrome", "text": "In echochrome, the solution to every puzzle is that seeing is believing. If you can align a pair of platforms so that they appear to be one, they are. If you can position a hole so that it appears to be above a beam, it is. Although the beams, staircases and pillars that make up each stage are positioned normally in 3D space, gravity bends and distance becomes nothing in accordance with the player's perspective.As a little man walks along these paths suspended in the air, all you have to do is guide him between the holograms scattered across each stage and then return him to the starting point, but like Portal last year, the game's capacity to reduce vast distances to nothing means that doing so requires a mixture of lateral thinking and, as the game progresses, dexterity. Overall, it's an arresting concept.Initially the game sets out its five ~laws~. All you manipulate in echochrome is the camera, which can be rotated, raised and lowered around each of the 56 levels unique to either PS3 or PSP that are hung in white space, and the first law, perspective travelling, is the one where you connect pathways by aligning the edges. The second law, perspective landing, is about aligning a black hole in one beam so that it appears to be above the area you want to reach; if your man passes then over it, he will fall through and land where you want him.Law three, perspective existence, allows you to bridge gaps between pathways by obscuring them with pillars, while the fourth, perspective absence, allows you to avoid the effects of black holes and white spots, the second of which propel you into the air, by obscuring them in the same way. The last law, perspective jump, lets you use those white spots to jump to other ledges, even though they may be very far away and high above, by angling the camera so that the second ledge appears to be close by.Having emerged from a brief tutorial that demonstrates each concept, you have the option of playing through the game's 56 levels at random by selecting the ~freeform~ menu option (with retry and skip-level options when you pause), visiting the ~atelier~ menu to select them directly, or using the same menu to play through them in groups of eight. The game records your best eight-level course and individual stage times for leaderboards.Early progress is satisfying as you start to anticipate solutions and become fluent in the game's language. Anyone walking past the screen will think what you're doing is magical, unable to grasp the concepts at a glance. Within an hour of starting, the initial concepts become more complicated as bumps, additional holes and jump-spots slow your progress, and the canny level designers deploy platforms that won't easily align."}