{"ref": "https://www.eurogamer.net/psn-psone-roundup-review", "date": "2 May 2008", "game_name": "Reviews", "text": "Yeah, thanks for making me look like a big bag of wrong, Sony. The last time we did one of these PSone Roundups, I foolishly declared that the retro content of the PlayStation Store was starting to gather momentum - ~like an enormous bag of anvils sliding down a hill~. Typical, then, that it's been almost two months until there were enough new retro additions to make another roundup worthwhile.Even allowing for the downtime associated with the Store's makeover, it's clear that the potential of the PSone digital download has yet to be truly tapped. Where are the likes of Eidos and Capcom, re-releasing the original Tomb Raiders and Resident Evils? Why was GT 5 Prologue's online debut not commemorated by making the very first Gran Turismo available for a couple of quid? Where, in this age of casual gaming, is PaRappa the Rapper?Of course, grumbling about the lack of big names is as pointless here as it is on the Wii's Virtual Console. It's natural that some of the most desirable games are being held back to better pace the offerings. But with such a sporadic schedule, scattering handfuls of games apparently at random like crumbs for pigeons, it's fair to wonder if the Store will ever really take full advantage of the vast software library available.With that obligatory pontification out of the way, here are the latest ancient artefacts to have wandered into the Store...Oh, how I shrieked in delight when I saw that this overlooked gem had been deemed worthy of a digital download revival. Fond memories of Hyper Pie Throwing, Mechanical Pencil Basher and Perm-Mania came flooding back, delirious mini-games from an era when ~delirious mini-games~ was still a concept as fresh as a summer meadow.An obvious precursor to the likes of WarioWare, and therefore the great grandfather of what we know sniffily call ~casual gaming~, I remembered Bishi Bashi as a seemingly endless parade of bizarre bite-sized challenges that are simple in concept and insane in execution. Propel a dragster using a giant soda can. Trampoline into the air to catch some meat. That sort of thing.Returning to the game eight years later, I'm not disappointed exactly but still...it's not quite the mind-boggling casserole of lunacy I thought it was. The memorable games are still delightfully odd, but the vast majority involve simple colour-matching or number-sorting. Many are hampered by the sometimes obtuse instructions, and some flaky translation. The word ~front~ is often used instead of ~forwards~, for instance, which can lead to frustration given the limited time for each game. You get infinite continues though, and it really comes to life when played with friends since a lot of the games allow you up to three players to play at the same time. There are technically two games in the package as well - Super Bishi Bashi and the faster, tougher Hyper Bishi Bashi.I can never be too hard on Bishi Bashi, because when it works it's still an utterly charming and hilarious dose of random silliness, but it's not quite the perfect mini-gaming experience I'd remembered.8/10"}