{"ref": "https://www.eurogamer.net/warhawk-operation-broken-mirror-review", "date": "21 Apr 2008", "game_name": "Warhawk Operation: Broken Mirror", "text": "Omega Dawn, the previous add-on pack for Warhawk, didn't exactly send us all squiffy with uncontrollable excitement. Earning a copper trophy with 5/10 scribbled on the side in marker pen, the main complaints were that the new map was simply too large and empty to generate exciting skirmishes, and the new dropship vehicle was little more than a glorified bus, useful only for well-disciplined clans capable of plotting forward assaults and consistently rallying their troops into one place. ~Incognito needs to try much harder,~ Richard concluded.With this second nibble at the expansion pack cherry, we're pleased to report that hard work has taken place, and the results are immediately evident. Those rugged warriors at Incog have clearly taken the criticisms onboard and this second expansion benefits enormously from the feedback.Let's start with the new map, Vaporfield Glacier. Simply by switching from the standard dusty brown palette, this new environment automatically feels much fresher and distinctive. The icy terrain won't be a hindrance though - there's no discernable effect on the controls, either on foot or in vehicles. You won't be sent skidding into a ravine should you choose to gun that jeep into enemy positions.Vaporfield Glacier breaks down into ten new arenas, allowing for every style of play from enormous open battlefields to intimate corridor deathmatches. At the top of that list is Tundra Assault, supporting the full 32-player line-up, with acres of virtual space to explore. Unlike Omega Dawn, where large battles felt like too much hiking and not enough shooting, this sizable layout is much more balanced and throws up thrilling combat opportunities wherever you end up, however you're playing.Western Waste, Battleline and Espionage are designed for 24 players or more, and showcase the frostbitten military compounds that face each other over the central snowy ravine. Medium-sized skirmishes are the order of the day in arenas such as Communique and Spearhead, although my personal favourite is Express Lane, which makes excellent use of the elevated highways zig-zagging across the middle of the glacier. Combined with the new vehicle (yes, I'm getting to that part) this is ideal for those who like their combat fast, brutal and on wheels.Finally, for more standard deathmatch fun there's Olasvik Village, an exhilarating rat run set in amongst the skeletal remains of bombed houses; and Grinder, which feels rather generic with its military HQ location, even though the design is nicely balanced. Dogfight, as the name suggests, is the map to choose if your vehicle of choice is airborne. The intricate canyons, frozen archways and tight tunnels littering the landscape will test the most experienced pilot.So, in terms of map design, Broken Mirror is already far better thought-out than its predecessor. There's something for every style of play, and all the separate elements come together to create a large coherent map, sectioned off in a way that feels organic. Expect to spend your first few hours just scurrying, racing and flying around, seeking out the numerous tactical vantage points."}