{"ref": "https://www.eurogamer.net/marvels-spider-man-review", "date": "7 Sep 2018", "game_name": "Reviews", "text": "Can you truly say you have lived until you have lamped someone with a manhole cover in Insomniac's new Spider-Man game? Sure, you may have known happiness to a certain degree. You may have known love, even. You may have rolled the dice, as the saying goes, and landed a few sevens. But lamping someone with a manhole cover? It's top-tier. Top of the shop, as an older generation might put it. Bam!The tension of the thing! It is beautifully done. And it is a risk. To grab the manhole cover with your webs you must first find a highlightable manhole cover and then squeeze R1 and L1. Brilliantly, this takes a bit of time to pull off - you have to wait for a brisk little meter to fill up. While this is happening, whoever was already attacking you is presumably still attacking you. Your spidey-sense will be tingling and warning of an incoming punch or kick or burst of suit-shredding gunfire. But if you intend to lamp someone with a manhole cover, you cannot interrupt the flow of the meter to counter or dodge. You must be bold or reckless. You have to hope that you can get the manhole cover into the air before your enemies can pull a pre-emptive strike together.Yes, it must all take less than a second, but man, that less-than-a-second really counts. It plucks at you. And then you've been successful and the manhole cover is attached to springy, flexing webs. You fling it around in an arc to clear the immediate area, and then you launch it at someone. After hours of playing this game, I still don't know what black magic is involved in the selection here. I suspect the manhole cover receiver has to be somewhere near the middle of the screen, but really, it mostly feels like intuition. The game simply knows who you are aiming for. And then? Oof. A truly Platonic clobbering. Metal against flesh, and hopefully that deep hollow boom, lifted, along with the basics of combat, from the Arkham games, which tells you that this particular baddy is down for good. He will be headed to A&E. The manhole cover will probably be headed to A&E with him, in order to be surgically removed. Hopefully one of them has health insurance.As much of a highlight as this manhole cover business is, my favourite mission in the new Spider-Man game doesn't feature one. It doesn't feature civilians in peril or a big name villain on the rampage, although both these things are well taken care of elsewhere. Nobody is puckishly dangling a school bus off a bridge and no bombs need to be located to have their flickering red countdowns stopped by the cutting of wires. Instead, Peter Parker has been thrown out of his apartment due to late payment of his rent, and he must head off into the glittering, isolating lights of Manhattan to track down the garbage truck that contains his bin-bagged belongings.Listen: how would you even do that? Parker starts by calling the city sanitation department, and the gloriously weary dispatcher leads him to an area where the garbage men like to grab a pizza after work. You know the deal by now: it could be one of a handful of locations in Hell's Kitchen, and maybe - who knows? - there'll be a bit of very gentle fighting involved at some point. What matters, though, is that this task feels desperate and urgent but in an entirely domestic way. It feels daunting, but in the way that navigating traffic when you're late for a train feels daunting. It's more affecting than the big stuff, because it operates on a more human scale. Crucially, by the time I got Parker's trash back, I still felt like I had done something truly superheroic. The occasional oddball mission like this represents the Spider-Man difference, you could say. They take a game that is filled with borrowings and genre conventions and the usual suspect, and they give it a vital sense of real character. This open-world superhero game often feels different to all of the others, then. Not because of the things you do, because these are the things you always do, but because of the reasons you often have for doing them - for the life and character and charm that emerges from the context.The Spider-Man difference is glimpsed in everything. Combat, for example, still takes its lifeblood from the freeflow punch-ups of Arkham, but here it's coursing through the veins of a lither, less substantial hero who needs to dance in and out of confrontations taking as few blows as possible and darting up and away to safety when needed. Traversal, which, alongside fighting makes up the core of the game, is a hodgepodge of everything from the elasticated web-slinging of Spider-Man 2 to the up-the-side-of-a-building dash of Prototype, but it's enlivened with a youthful energy, a twist of the hips at the top of each arc, a distinctive and  adolescent jumble of shoulders and elbows and legs when perched on top of a finial, that way kids have of being naturally graceful and a complete disaster at the exact same time.  Elsewhere, towers unlock the map as in Far Cry, yet it's not a sprawling chunk of wilderness you're exploring but one of the most compact and characterful takes on Manhattan yet seen in a game. There are stealth sequences, QTEs, and boss fights that all take their cues from elsewhere, but the game retains its own personality throughout.Why might this be? Better to ask: just who's Spider-Man is this? The law firm of Maguire and Garfield is behind us and the new guy's not quite Tom Holland. This is an established Spider-Man we have here - living on his own, single, working an entry job in science in the city. Also, he's been Spider-Man long enough by now to chat to most of his super-villain enemies using their first names. The box and the start screen may say Marvel's Spider-Man, and there's all the fan-service you could ask for. But in truth it's Insomniac's Spider-Man. That's the key to this one, I think: it's a near-perfect marriage of developer and intellectual property (ugh). The people who do high-colour, cheery, knockabout fun have landed one of the few superheroes who seems to genuinely love the job - and they totally get that the reason he loves the job is because in his normal life, he's just like we've all been at some point: lonely, broke, awkwardly poised between childhood and the adult world. As a result, the traversal and the combat feel like more than just a bunch of nice systems delivered with lovely gamefeel or whatever you want to call it these days - they both have the genuine thrill of release to them.Both of them make the game's basic structure and challenges sing. The set-up here is pretty simple. In the opening sequence, Spider-Man puts a big New York villain away for a ten-stretch - actually, since this is comic books, it's probably a billion-stretch in a uranium cell that, magically, will still be busted out of in an issue or two - and then has to deal with the power vacuum left behind. The plot that emerges from this is an unusual beast, playing it straight and rather sedately for a while, before erupting into all-out chaos far later than seems feasible. I won't ruin it by revealing too much, but it's pleasantly riddled with cameos and team-ups, and, while the beats are rather heavily foreshadowed in places, there's a lovely sense of zip to the writing and performances. It's classy!In terms of the game itself, you pick through both story missions and side-business across a beautifully realised Manhattan. Head to the river on either side and you're politely turned around, but it hardly matters that you can't get to Brooklyn or New Jersey. The island itself is a compacted version of the real thing, but it has a great sense of character as you barrel down skyscraper canyons, dipping low over theatre-goers and tangles of yellow taxis or scurrying up brownstones in the village. The choices made are pretty interesting: midtown dominates this version of Manhattan, while Harlem and everything above the park is sadly a bit of an afterthought as is far too often the case, but money has been spent on paying for the rights to actual skyscrapers, by the looks of it, so you get to race up the side of the Flatiron and the Chrysler without finding a knock-off waiting for you. God it is energising to spring around a place like this. Spider-Man 2 has long been held up as the perfect game for nailing the web-slinging, but this might be the one that tops it. The core is very familiar - you swing through the streets by squeezing and releasing a trigger to fire webs, letting go at the top of each arc - but around that core a bunch of lovely additional ideas have been grafted on. There's an air-dash that sees you jetting forward without losing altitude - prodding around in the skill trees will allow you to combo this one - and you can wall-run or wall-crawl, and get a boost from springing off the upper edge of a tower. Insomniac's taken the webs themselves wonderfully seriously, by the bye. Each one you fire out could convincingly be attached to a nearby building, even though there's a lot of leeway involved in how you can move when you're hanging onto it. In practice, what this means is that the varying heights of different districts have their own styles of traversal. In midtown, you can get incredible air amongst the mega-structures. In the park, you are pretty much dragging your knees over the ground until you learn to properly leap each time you let go of a web. As with that magical manhole cover, the game seems to intuit what you want to do quite a lot of the time. Insomniac's found a wonderful sweetspot, I think: traversal is far from de-skilled, but it all feels so natural that when I handed over the controller briefly to someone else in the office who wanted to play, I found I couldn't really tell them what any of the buttons did. Only in my hands did the controller make sense.Traversal flows beautifully into combat, which is helpful since most missions, regardless of the story, involve going somewhere and then giving a bunch of people a shoeing. Spider-Man doesn't just take the basics of freeflow fighting from Arkham, it also borrows the way those games like to frame it. All-out punching is fine, but it's nice to start by stealthing around and picking people off with webs, moving from one highlighted zip-point to the next with a squeeze of both triggers, crawling across ceilings to get the perfect drop, and pondering target prioritisation - snipers first, right? Or the heavies?Once you're brawling, though, it doesn't feel as much like the Arkham games as you might expect. Partly this is because, by now, everything from Assassin's to Mordor and Mad Max has gotten into the act, but partly because Spider-Man moves around the environment more than those other heroes anyway. The surroundings play a much bigger part in the action, as you take damage and then swing your way out of trouble for a bit, dancing between grapple points and planning your next move.Fighting is wonderfully crunchy, and as the game progresses the options pile up. I love the web-zip that allows you to highlight a distant enemy and bolt right to them, following up with a launcher and a bit of air-pummelling perhaps. I love the gadgets that slowly unlock, starting with web shots that can bind up enemies (either immobilising them for a brisk kicking or actually sticking them to a wall and putting them out of action for good), before expanding to include a series of web bombs and trip-mines and electrical treats. There's a combo system and a focus meter that builds up over time allowing for instant takedowns. And, as the enemy types multiply, you'll start to explore the muddle of ancillary systems in the game's busy menus and discover different suits, many of which come with their own suit powers - one granting periods of bullet-proof skin, say, while another builds focus more quickly - along with suit mods that allow you to flare your character build in different directions: do you want to be able to take damage without resetting the combo meter, or do you want to snap out of an electrocuted state a bit quicker? Doesn't matter! You can equip both at once - or something else entirely. (In an act of pure kindness, you can wear the suit you want and also equip the suit power you want - you aren't locked into awful clothes with a killer gimmick.) All of this before you get to the skill trees, which are suitably busy with incremental abilities of their own.Moving between combat and traversal - and some other stealthy stuff that is best discovered yourself - allows Insomniac to keep the pleasantly soapy, heartfelt plot speeding along. A background in old school single-player campaigns means that the story missions feel a bit more polished than those in a lot of other open-world games, too. There are standouts, such as the garbage truck business and a wonderful dance up a skyscraper filled with groups of enemies and buzzed by a very twitchy helicopter, but even the most rote moments will be enlivened by a nice bit of dialogue or the sheer thrill of getting from A to B. Boss fights are a slight disappointment - the careful staging means they lack the energising rigour of the standard battles - but the game only starts to grate during a difficulty spike that erupts about three quarters of the way through when the whole thing suddenly gets a touch too hectic. Spider-Man's combat can be button-mashed, but it's actually at its best when there's a sense of fairness to it, and when it encourages precision. A precision manhole cover, say.Good as it is, it's away from the main campaign that I had some of my most memorable moments. The map's filled with distractions: various characters have chains of side-missions, then there are procedurally-generated crimes to tackle and bases to take back in a series of Horde-like gauntlets. But there are also monuments to photograph - surprisingly appealing, this, probably because it's New York - and other collectible delights. My very favourite thing in the game might be dashing around collecting the old bookbags that Parker's webbed up about the city at various stages in his career. Each contains a trinket from his past that Spider-Man fans will love - I loved them, and I'm not even remotely hardcore Marvel - and each glows with that special Crackdown Agility Orb green. Another inspired lift.Meanwhile, all of the side missions and collectables and photo-ops that litter the map give you a range of different tokens that feed into the economy, allowing you to buy new suits and mods. In truth, though, they're so beautifully done that I'd probably do them anyway. It was a real relief to finish the campaign here and discover I was only at 70 per cent completion. Again, this is Insomniac. The spirit of Sunset Overdrive in particular, I think: everything should feel fun to do and everything should be shot through with a distinctly life-in-your-early-twenties energy and sense of colour. What I love more than anything, is that behind the traversal and combat, Insomniac is a wonderfully controlling developer. For the entire length of the campaign they won't hand the city over to a day/night cycle or randomise the weather because they want total command of the atmosphere for the beats big and little to play out in. Just like they want those webs to attach to buildings in a convincing manner, they don't want to leave too many other details to be ground up in the cogs of an open-world. Somebody, in other words, is looking out for Spider-Man, a superhero whose pleasing vulnerability means that he needs looking after now and then - just as he could do with a little help getting his belongings out of the trash.And it's a reminder, then, that while it seems that games of a certain type - and a certain budget - are all converging these days, that all games are in a hurry to become the same game with the same tricks and the same hooks, there are still places, even within the most risk-averse of designs, for genuine character to bloom. Go get 'em, tiger."}