{"ref": "https://www.eurogamer.net/eve-online-re-review", "date": "7 Apr 2008", "game_name": "EVE Online", "text": "The Trinity upgrade for EVE came at exactly the right moment - a moment at which thousands of gamers had started to realise that the seemingly perpetually beautiful space game was looking a bit more like something made out of cardboard. Now, on the other side of a massive visual overhaul, it is once again the most beautiful vision of bleak interstellar warfare that the world has ever seen. Sure, it doesn't quite run so smoothly on all our clunky old PCs, but you can always flick it back to the ~classic~ visual theme if you're having problems.If I'm entirely honest, I'd have to say that EVE has long lost its meaning as a posh graphical experience. It's always looked good, sure, but I've been waging war in the nebulae too long to really notice that stuff any more. These days, it's about numbers: how much money? How many kills? And relationships: How many enemies? How many allies? The game becomes abstract - more about speed and ranges on your overview interface than about piloting a glittering warp-speeding death-tube - to a point at which, when you do notice the visuals, it's a bit of a jolt. Blimey, those ships really do look grand. Of course, for new players, all this fresh splendour seems incredibly alluring. EVE's lavish universe is pretty much unrivalled, and marvelling at the new shadows and bump maps on your ships will eat up hours of your time. Simply sitting in busy space lanes until you've seen every kind of ship will seem like enough for the first couple of days of the game. One thing I have appreciated is the overhaul of the larger ships and the space stations, which, finally, do look like giant pieces of engineering in space. The new lighting and dynamic shadows add something to the perspective of the game, allowing these monsters to seem as immense as they really are.Those first few days are also far smoother than they have been in the past. EVE's learning curve has always been formidable, but the addition of extra tutorials, help screens on every aspect of the interface, and a general trend towards encouraging gamers to work with other EVE players all really help. Putting people in a position where they feel comfortable to ask for help or for mission partners is always tricky. The most difficult thing about PC gaming generally is getting over the hump of accessing the larger community, and CCP have begun to see that they need to do more than rely on player initiative to get people into the habit of asking for help, and applying to corporations.This is a game that is, as its creators occasionally mumble in interviews, about human interaction. It's incredibly easy to overlook that and to try and play it like any other MMO, especially when CCP crank out more and more missions, and make the rewards for solo mission-running more and more valuable. Ultimately, though, the real rewards to be reaped in this game are through play with others: in the alliance game, in piracy, combat, and in trade.Trade is now rather a complex issue for EVE. While everything still hinges on the price of a number of essential minerals, the invention processes now mean that the more advanced technologies are no longer limited by blueprint-holding cartels. Anyone with enough patience (and they're going to need a great deal of that particular ingredient) can now get in on the high-tech angle. Even in a tiny 20-man player corp like the one I run, we're able to come up with some tech 2 production lines, thanks to the hard work of just a couple of players. But why dwell on that tricky money stuff when most people are just interested in what they can buy for their isk? Why indeed.The thing that concerns most pilots is simply what ships they can stock their hangar with. The most recent additions - a range of frigates with special bonuses, and some specialist, ultra-costly battleships - have confirmed what I had said, and CCP had tacitly admitted, a year ago: that the game has basically filled all the essential niches for spaceships. Anything they're adding now is  essentially gloss, and doesn't really do much other than pad out the functionality of the game's gangs with new toys.The one ship that has been making a difference is the heavy interdictor, which was supposedly designed to counter the rise of capital ships in the game. In practice, it has simply become another addition to the already super-versatile range of cruisers that EVE has to offer. No complaints from me: I'd rather bomb about with a bunch of cruisers than anything else, and heavy interdictors make roaming gangs a little tougher and more versatile.EVE's evolution has always been about increasing the detail within the game universe. That has come in incremental layers of NPC content, trade and industrial content, player-vs-player mechanics, new ships, new player-owned structures, and so on. The most recent additions to the game are simply more detail burned into the universe. However, it's the additions that the players make to this single, persistent galaxy that really make a difference.We seem to be in some kind of mature phase now, with the biggest war the game has ever seen finishing up, and dozens of other, smaller conflicts breaking out. We're now benefiting from thousands of experienced combat pilots, and dozens of competent, ambitious leaders, all wanting to carve out a place in the galaxy for their pilots. It's an exciting time to be in the game world, and joining a new alliance and finding new goals for our corporation has utterly rejuvenated my interest in the game.Ultimately, it's worth remembering that EVE isn't like other girls. She has never treated us like other players, and we should never treat like any other MMO. EVE might never stop evolving, but I don't think it's ever going to stop being the outsider, either.Thank God."}