{"ref": "https://www.eurogamer.net/pc-roundup", "date": "7 Apr 2008", "game_name": "Reviews", "text": "Let's talk hexes. Not voodoo curses, or indeed well spoken old flames, but military hexagons. Fantasy Wars is a traditional hex wargame set in a rather retro-looking world of swords, sorcery, orcs, goblins and magic helmets.As you might expect, it's a turn-based strategy affair, and it bears some deeper tactical mechanics. For example, a zone of control (or ZOC as abbreviation fans will know it) is in place here, meaning a unit's movement is halted as soon as it enters a hex next to an enemy. Archers will provide support fire for any adjacent unit that is attacked during the opposition's turn, so the positioning of your army is an important consideration.Troops can be routed, commanders give attack bonuses to nearby units, and while all this is pretty standard wargame trappings, there are a couple of interesting nuances. Charging knights are labelled as impetuous, meaning that they'll attack the first unit they come into contact with regardless of orders, unless there's a commander around to keep them in line.Terrain has a huge bearing on the battles of Fantasy Wars. Crossing a river bogs a unit down completely and leaves it extremely vulnerable to attack, and knights are terrifying when thundering across the plains, but far less effective when plodding through a swamp. It's all common-sense stuff that lends the game a definite flavour of realism without getting overly technical.And while that's commendable, Fantasy Wars still ends up feeling rather dry. The process of planning out a turn is a slow one, as units can't stack, so it's necessary to be extremely careful about who moves where and in what exact order. Then you've also got to remember which units have been upgraded to fight more effectively on certain terrain (scouts trained in forestry get big offensive and defensive bonuses when in the trees). There's quite a lot to deal with.Unit upgrades are facilitated via experience points earned over the persistent campaign, and there's also an element of army management. New troops can be purchased using the gold plundered from captured towns, or the rewards given for achieving optional objectives, and all this adds an extra strategic layer to the game's three campaigns.The missions are fairly varied, with some very challenging goals to achieve, meaning this really isn't one for the faint-hearted gamer. Even on normal difficulty, the scenarios quickly stack the odds up against you, and when you throw in the odd interface quibble - it's easy to mis-click troops and accidentally give out an errant order - it's clear this really is a game of conquest for the patient. Fantasy Wars will be most appreciated by those armchair generals who are thirsty for a dose of meticulous planning, not to mention those with comfy chairs, as it will be a long sitting before the day is done.6/10"}