{"ref": "https://www.eurogamer.net/firewall-zero-hour-review-intense-team-based-gunplay-is-a-highlight-for-playstation-vr", "date": "2 Sep 2018", "game_name": "Firewall Zero Hour", "text": "Firewall Zero Hour is, in more ways than one, a very different type of multiplayer shooter. You only need to unmute the in-game voice chat in games like PUBG and Call of Duty to understand how toxic large, online communities can be. Switch your mic on in the lobbies of a multiplayer PlayStation VR game, though, and you almost always hear people being kind to one another. It's a most welcome surprise. Firewall Zero Hour is a brilliant example of this, and so far the lobbies of First Contact Entertainments' tactical squad-based shooter have been wonderfully pleasant. Not everyone has a mic, but those who do have been up for sharing tips and, most importantly when it comes to a game that relies on teamwork for success, communication in-game has always been spot on. There's an instant feeling of camaraderie amongst strangers here and it's something I've not really experienced since the early days of Xbox Live.While most of the credit can probably be put down to the smaller size of the PSVR community, I can't help but feel that part of this amiableness is also due to just how incredibly good Firewall Zero Hour is. This is a game that VR fans have been buzzing about for ages but unlike the dreadfully dreary Bravo Team, Firewall actually lives up to the hype. It's a thrilling shooter that's perfectly tailored to VR and you can hear the excitement and satisfaction in your teammates' voices as they play.If you haven't guessed already, Firewall Zero Hour is heavily inspired by Rainbow Six Siege. So much so, in fact, that many of the players I spoke to were veteran Rainbow players themselves. This is no bad thing - the slow-paced, tactical nature of Rainbow Six Siege translates incredibly well to VR and it's an infinitely more comfortable experience for newcomers compared to some of the faster-paced shooters like DOOM VFR or Killing Floor.The backbone of the game is an online only, 4 v 4 search and destroy gamemode called Contract which tasks you and your team with either attacking or defending an encrypted laptop. Attacking teams must first locate and destroy one of two firewall access points with a view to uncovering the location of the laptop. That laptop must then be found and hacked in order to complete the mission, all whilst the opposing team tries to stop them.Just like in Rainbow, teamwork and planning is key to success, and the tension is ramped up to the max with a permadeath mechanic. Get shot and you'll fall into a downed state and, if you're not revived in time, you're out for the match. This doesn't mean the fun is over though - dead players can then flick between multiple security cameras in order to spot hostiles and feed intel to their team.There's a generous amount of maps in rotation that take players from the offices of a social media start-up located in The Gherkin in London through to an open plan warehouse in Russia that's full of tanks. Each location looks great and while they're a lot smaller than the maps in Rainbow Six Siege none of them would feel out of place if they were to appear in Ubisoft's game. The comparisons don't end there, either. Just like Rainbow's Operators, each contractor in Firewall has their own unique skills, although they're much more subtle here and have less of a reliance on gadgets. There's also a huge amount of weapons, attachments and skills to unlock and buy so, over time, you can tailor the contractors to your specific playstyle. To Firewall's credit, the customisation is actually incredibly deep and on par with some of the bigger triple-A games like Battlefield 1, although the economy here could do with some balancing. Most items are very expensive, you don't earn too many credits per round and some of the better gadgets and weapons aren't unlocked until you reach level 30 or above.Firewall Zero Hour isn't just a carbon copy of Rainbow Six Siege, though. It offers a sense of immersion that Rainbow players can only dream of and an intensity that you'd find hard to match in traditional 'flat' games. There's nothing quite like the feeling of physically ducking behind or leaning around objects to fire at targets. Holding your arms up over walls and shooting down at advancing attackers is deliciously fun and the way your gun clatters off of walls rather than passing through them like most games just adds to the physicality and believability of your surroundings.None of the above is possible when playing with the DualShock 4, though. That dampens the experience somewhat and I'd heartily recommend that everyone who plays Firewall does so with the Aim controller. This makes for an expensive entry point, but my word is it worth it. Firepoint makes perfect use of the Aim controller and it's definitely its best implementation in a game since Farpoint. There's rarely any of the terrible scope drift that plagued Bravo Team and the twin thumbsticks on the peripheral make traversing each level as effortless as it would be if you were using a standard controller.Speaking of movement, while there are multiple comfort settings, Firewall is best played with them all turned off. I have a pretty sturdy pair of VR legs and I experienced no nausea at all, but even then I spoke to some players who said this was the first time a first-person VR game hadn't make them feel queasy. I have no idea why exactly this is - maybe it's just that people were just having so much fun they forget they were in VR all together.A small community isn't always a good thing though and the PSVR's limited player base negatively impacts the game in a couple of major ways. For instance, Contracts is the only competitive mode available in the game. This was a specific choice made by the developers in order to keep the player base from becoming diluted across multiple game modes and lobbies. It's an understandable design choice but do be warned before heading in.Currently the lobbies are almost always full, which is great and it means the plan is working, but at the same time I wonder how long this one mode will hold people's attention before they start to wander off.This problem isn't helped by the speed at which each match lasts. There's a 5-minute time limit for each mission, but these rounds are often over in less than half that time. Then it's back to the lobby where you risk extended wait times if other players drop out, leaving spaces that need filling before the countdown timer will trigger. Worst of all is that the fact that the servers are peer-to-peer so, if the host drops, you'll be ejected right back to the main menu. All this means you'll often spend more time in hanging around in pre-match lobbies than you do in the actual game. The simplest solution to this would be to add extra rounds to each match. Best of three, or better still, best of five like in Rainbow Six. This would be much more satisfying than the 'one and done and back to the lobby' rotation that is presently on offer and it's something that I hope can be patched in at a later date.The biggest issue with Firewall at launch though is that its party system is completely broken. I tried multiple times to party with a friend in both Contracts and in the co-operative training mode but each time we both got booted from the team. This is such a glaring fault that I'm going to presume the developers are rushing to release a fix as soon as possible, but at the time of writing I found it impossible to play the game with anyone but randoms.It's easily the best multiplayer PSVR game out there, and when coupled with the Aim controller it's one of the most immersive too. The welcoming community is a breath of fresh air and this means you're never short of a good team to play with - something that's especially important at this moment in time when party matchmaking is broken. The lack of game modes and in turn the potential for a dwindling player base is a definite concern for the longevity of the game, but truth be told, the incredible gunplay and nail biting action more than makes up for any faults that this currently has. Firewall Zero Hour is easily one of, if not the finest shooter available for PSVR."}