{"ref": "https://www.eurogamer.net/r-sensisoccer-ps2x", "date": "3 Apr 2008", "game_name": "Sensible Soccer 2006", "text": "It might only take a second to score a goal, but it's taken eight ponderous years for Jon Hare and co to make a new Sensible Soccer game. You might ask: Why now? What's the point? EA and Konami have had the footy market so tightly sewn up for so long it's embarrassing. Cast your mind back over recent years and the list of casualties is staggering: Take-Two's infamous Champions League efforts, Infogrames' deluded Ronaldo V-Football, Sega's unholy trinity of Worldwide Soccer/UEFA Dream Soccer and Virtua Striker releases, Virgin's awful European Super League, Acclaim's brief and pointless attempt to revive the Kick Off brand, and Codemasters' own ill-fated Club Football efforts. Sony has come closest to breaking the FIFA-PES duopoly with This Is Football, but even that hasn't built on a promising start it enjoyed in the early days of the PS2 (World Tour Soccer's PSP bundle success aside). Throw in the frantic five-a-side titles like Sega Soccer Slam, Mario Smash Football and Midway's Red Card and it seems as if every major publisher has had a crack at footy at some time or other - with limited commercial success.So, anyway, why now? Well, the rebirth of Sensible Soccer hasn't happened overnight. You might recall that the mobile version released at the tail end of 2004 got the ball rolling and alerted Codies to the fact that demand for the brand was still strong. Radica's timely decision last summer to issue the Megadrive version of the original Sensible as part of its Arcade Legends plug and plug TV game range gave the brand an even bigger boost. Within weeks, the game's original designer Jon Hare let it slip that he was working on a new Sensible Soccer and here we are playing it and loving it. It really is as good as we hoped it would be.It doesn't even really matter what angle you're coming at it from. The most charming thing about Sensible Soccer 2006 is that it's one of those rare everyman games that casual footy fans and hardcore PES-philes can embrace with equal enthusiasm. Even if you're a died in the wool thirty-something purist fan of the Amiga original you'll be overjoyed and mightily relieved at how Kuju Sheffield and Hare have managed to retain the classic 'feel' of the beloved old-school Sensibles. So what? Haven't we moved on from shonky one-button early '90s play mechanics? What is the point? Well, if you care remotely about how a footy game feels rather than whether the likenesses are spot-on and the kit and stadia are 'authentic' then you'll be as happy as Dawn French at an Easter egg sale. The way passes fizz to feet, the ease with which you can bang in instinctive snapshots, the swirling aftertouch, the deft, drifting lobs over midfield, bullet headers, the warm humour, the crazy sliding tackles, the pace. It's all there. It's like it's never been away. As the brilliant theme tune reminds us: 'You're a goal-scoring superstar hero!'As Hare and co have always known, you can't really 'do' a Sensible game from the touchline cam that FIFA and PES and a gazillion other games favour. The classic Sensible gameplay always relied on the greater viewpoint that the isometric, slightly zoomed-out 'sky cam' vantage point provided. Sticking to those principles in Sensible Soccer 2006 instantly affords the player a much better appreciation of their team's formation than you'll be used to. As such, you'll immediately find yourself knocking the ball about with precision and confidence rather than passing blind. And because of the fast, accurate passing system that the game uses, the pace of the game feels so much more exciting than the glacial approach favoured, for example, by EA's FIFA World Cup title currently hogging the top spot in the charts.Sensible Soccer 2006 gets the basics just right to the extent that everything else falls into place all around it. Take the control system. Rejecting the received wisdom that you have to use every button on the pad (and every combo therein), you'll use just three buttons and the left stick for the entire game. That's one button to pass, one to shoot/slide tackle/head/lunge, and the trigger to sprint (using a genius 'gas tank' approach where you only have a limited stock to last the entire match). What you do from there is down to the context you're in; where to aim your pass/shot, how much power you apply, when you choose to apply your sprint and whether you'll apply after touch. Will you bend your shot left or right, apply dipping top spin (by pushing the left stick in the direction of your kick), or loft the ball high (by pulling in the opposite direction)? You can even use the right stick to manually move the keeper out when you're facing a dreaded one-on-one or tweak your defensive wall when facing a free kick. In all, it's a hugely refined control set-up that works.The fact that there's a directional arrow pointing out of the feet of man you're in control may seem a little weird at first (as in the first ten seconds), but it's actually one of the core reasons why Sensible Soccer 2006 feels so natural and intuitive. You don't just move players in possession, but in effect have a visual indicator of the direction and pace of their passes and shots in way that no other football game has offered. As with any footy game, holding down the shot button increases the power applied to the kick - but rather than have a separate power meter, the length of the arrow extends to reflect the extra weight behind the kick. As such, it's a much more instantly identifiable means of knowing how much welly you're putting in, and it's a real added bonus being able to precisely measure the direction of your shot. Every snatched shot or scuffed side-footer that misses the target is down to you. When you pull the trigger, the AI doesn't just arbitrarily hit or miss the target on your behalf (as seems to be the case in other popular footy games); it's down to where you aimed, the power you applied, and any after-touch. Simple. If the keeper's up to the job in saving it, that's another matter.As brilliant as the classic Sensibles were in approximating an exciting, flowing pass-and-move game, you'd never try and pass it off as a good simulation of football. We all knew this and accepted it because it was like the fast, all-action Roy of the Rovers fantasy football we read about in pre-teen comics, but right there on our screens. The fact that the 2006 vintage is as skewed an interpretation of 'soccer' is to be applauded; there are enough games out there that nail the simulation side just fine, and the market really didn't need another one of those. Sensible is exciting football pinball, where passes ping around at an unlikely velocity and accuracy, where shots rain in on goal, where you really can do sliding tackles. But that doesn't stop this sideways look at the beautiful game from appealing to the football purists. Somehow, as divorced from real football as it is, it still plays to the rules of the real thing. This isn't Mario Smash Football with comical power-ups, nor does it resort to the break dancing sick tricks in FIFA Street to differentiate itself. Sensible Soccer moves the goal posts alright, but nutmegs the opposition by going back to a purer approach where gameplay is the number one objective, where the controls can be understood by everyone and where it's (cliché alert) simple to play but difficult to master.It's perhaps not apparent from the screenshots, but the light-hearted 'giant head' visual style works brilliantly within the context of the game. The artistry itself is actually really impressive, with some amusing 'likenesses' (married to the amusing license-dodging mis-spellings - which, incidentally, you can change back with the included data editor) giving the game a knowing comic touch. Seeing players from a distance doesn't really do the game justice, but during close-ups and action replays it's easy to see just how fluid and detailed the animation really is, and how much subtle attention to detail there is to pick up on. But as amusing as it is to see player's facial expressions during fluffed goal chances, celebrations or when fouled, the most impressive aspect of Kuju Sheffield's efforts is how well the animations connect with the ball. Whether you're tackling, shooting, heading or saving the ball, there's a genuine impact that few footy games ever seem to get right. Even if the big head art style doesn't do it for you, once you see a dipping volley saved by an arching keeper that smacks onto the foot of the post and cannons in off an unfortunate defender, you'll be mightily impressed. Whoever dismisses the game based on its art style should be reminded that Sensible Soccer's always had silly looking players with big heads - just smaller, pixellated ones with hardly any animation. No-one would try and convince you it's the best looking footy game, but the charm far outweighs any technical deficiencies you could level at it.It goes without saying that Sensible is best enjoyed in two-player mode. That was always the case, and it still holds true today, so it's a blow that there's no online play option. Presumably if this version does the business then it's a formality for future incarnation, but it's an entirely understandable omission given that no-one's quite sure whether its comeback will go down in the high street. There is offline support for up to four players co-op if that's your thing, and the usual single-player league, cup and tournament options (preset or user defined) to keep you occupied, but nothing even comes close to the personal battles that ensue between two skilled players."}