{"ref": "https://www.eurogamer.net/portal-review", "date": "3 Apr 2008", "game_name": "Reviews", "text": "The portal gun is the most exciting thing to happen to FPS games since the gravity gun, and it's no surprise to discover that Valve is agonising over whether to give it to Gordon Freeman. Its function is simple: bridging gaps. But, in doing so, it alters the way in which you approach an FPS environment so radically that it's hard to think past it. Give it to Gordon, and Half-Life will never be the same. Better to keep it in the family, but away from the action. That's what Portal does, and the results are interesting.Waking in a small glass room at an unknown location, you're welcomed (~again~) to the Aperture Science Enrichment Centre, a sequence of 19 scenarios designed to test your ability to use portals to bypass concrete walls, transport crates over impossible obstacles, slingshot yourself across chasms and overcome mischievous gun turrets. The first levels serve as a gentle introduction to the various concepts at work, and it's a good few minutes before you gain access to the weapon itself, and even longer before it's fully operational. Once it is, you can fire a blue portal at one surface and an orange portal at another, step through either and exit the other.Levels demand a mixture of skills, all of which make use of portals in some way and your new tool when you acquire it. Some involve transporting crates to red switches in other areas of the test chamber; others, redirecting flying energy pellets to power up doors and platforms. The gun turrets, armoured on the sides and alarmingly powerful, represent a more dangerous obstacle, cutting you down if you stray into their sights for even a second, and need to be knocked over to disable them, or avoided altogether. Framing the gameplay are the portal placement restrictions - grey concrete floors, walls and ceilings can accept a portal, but reflective black sections, moving surfaces, doors, glass partitions and other world-objects cannot - and those springy metal rods tied to your calves, which allow you to fall over vast distances without incurring damage.Most exciting are the sections that rely on momentum, which is conserved as you travel through portals. Place an entrance at ground level and an exit high up on a wall and step through the lower portal so that you're tumbling from a great height, and rather than simply land on the floor again you can reposition the entrance portal to catch you, which has the effect of throwing you out of the elevated portal a second time at terrific velocity. The implications ought to be obvious, and the puzzles that derive from this mechanic are some of the game's best and most spectacular, calling to mind the vehicular acrobatics of TrackMania.Accompanying you on your journey and helping you to understand what's going on is the robotic voice of the AI that governs the test centre, GLaDOS - part instructor, part antagonist, total fruit-loop. While you learn, she keeps you amused, reminding you that any appearance of danger is ~merely a device to enhance your testing experience~, promising not to watch, then promising to stop lying about not watching you, and complimenting you on your intuition. ~You remain resolute and resourceful in an atmosphere of extreme pessimism,~ she intones without emotion, before promising cake if you win.If you've spent as much time analysing the original Portal trailer as we have, you might wish GLaDOS would stop jabbering and let you have your fun, but this would be unwise, as the education you receive is important and cleverly articulated. One of the game's great strengths, if not its greatest, is that concepts are introduced in such a way that players are entertained and informed without exception or confusion, guided by subtle design decisions that emphasise particular elements and concepts by constraining your actions without ever actually seeming to. If another Gordon, Brown, is reading, we'd like to nominate Valve to take charge of Britain's education system. The people there could stand to start thinking with portals.Yet despite a remarkable economy of design, Valve gets more out of the portal gun than it ever did out of gravity. It may only be one weapon, with you for the majority of the game, but it's easier to think of your growing portal expertise as a substitute for your traditional FPS arsenal. In your head, each scenario has you scrolling a mental mousewheel of abilities and tricks. Would this work here? What about that? As you apply their logic to the scenarios playing out in front of you, they slot into increasingly elaborate combination, and new ideas present themselves intuitively.Taken out of context, screenshots of vast rooms, full of networked infrared sentry beams, floating platforms, angled walls and flying energy pellets appear overwhelming; in the context of the game they are simply fascinating challenges that you are well equipped to overcome. It's rewarding, not frustrating, to sit and ponder one, partly because of that economy of design, partly because the pacing is so patiently considered, and partly because it always comes together with such delightful eloquence. And, of course, partly because GLaDOS is always there with something to say.GLaDOS does more than simply guide you, however - she is the heart and soul of Portal's biggest surprise. Know simply that Valve harnesses its strengths in storytelling to drive your fascination with the Enrichment Centre - as wonderfully realised a location as anywhere in Half-Life - and with GlaDOS."}