{"ref": "https://www.eurogamer.net/r-impossiblemission-ds", "date": "3 Apr 2008", "game_name": "Impossible Mission", "text": "Another visitor. Stay awhile... stay forever! No, not Eurogamer's mission goal (although they're perfectly free to ~borrow~ it) but instead the taunting speech of a lunatic scientist, a simple yet perfect introduction to one of the Commodore 64's most enigmatic classics.Born out of the Cold War era and inspired by the film War Games, Dennis Caswell moulded a program that set benchmarks for years to come - though it is oddly remembered as much for the aforementioned in-game speech as any of its other qualities.Professor Elvin Atombender, genius and now deranged megalomaniac, has been tracked accessing America's nuclear missile computers and is in the process of breaking the codes required for launch. Analysts predict he'll successfully crack the encryption in six hours and cause worldwide nuclear devastation. As a result of two previously unsuccessful attempts to stop him, it's now down to you, and you alone, to thwart his plans.Elvin also happens to be incredibly absent-minded and can never properly remember the password to his control room. To this end he's split the code into thirty-six pieces and scattered them about the underground complex, hidden within the catacomb's furniture. Instead of the usual 5p piece or old bus ticket down the back of the sofa, you're now hoping to find a fragment of punch card.Impossible Mission comes from a time when the enemies you faced had to be avoided at all costs - Super Mario Bros has a lot to answer for standardising the ~jump on the head~ play mechanic, and there are no guns or other devices available to destroy them. All you bring to the table are your wits, a pocket computer and an acrobatic somersault; and all three are vital to the success of the mission.Patrolling the many levels of each room are the sentry robots - nasty, vicious, evilly-programmed pieces of metal you'll soon love to hate (though thankfully they exhibit a wide range of different behaviours). Some will just sit there and observe you; others home in on spotting you, while a few may just peek over their shoulder, paranoid-like, in case you're behind them. A few rooms also have a Prisoner inspired ~Rover~ ball following your every movement.All robots are equipped with a high voltage charge gun and being fried by it (along with falling foul of any of the numerous gaps in the layout) results in ten minutes being deducted from the time limit. At your disposal to even the odds are snoozes, which temporarily disable the robots and lift resets if you happen to screw up a jump. Either can be acquired during a routine furniture search or earned in one of two musical checkerboard rooms.Caswell himself once noted that those players who are sufficiently adept at completing the platforming aspect often struggled with the second half of the game - assembling the pass code. Akin to a jigsaw puzzle (although a lot harder to deduce) each of the nine punch cards comprise four particular pieces that have to be manipulated in both directions, changed colour to match and finally stacked so no parts overlap. It's a wonderful concept and a brilliant challenge, and one that's been cruelly overlooked without clone or mimicry ever since. Impossible Mission exhibits superbly balanced and fair gameplay. Each room has a logical way to complete it, but there's also plenty of scope for risk taking and improvisation. It's also a game that rewards repeated play and experimentation - further play results in more skill, more experience, and a better reading of the robot's behaviour patterns to the extent that you can become one with the program. Getting through the entire game without losing any time at all is an achievement in itself."}