{"ref": "https://www.eurogamer.net/kane-and-lynch-dead-men-review", "date": "3 Apr 2008", "game_name": "Kane & Lynch: Dead Men", "text": "As much as the Hitman series has grown into one of the most interesting shooters around, IO Interactive is smart enough to know when Agent 47 needs to stroke his bar-coded bald bonce and take a few years off. We've been here before, of course. A year after Silent Assassin hit, the Danish developer released  the sorely under-rated Freedom Fighters - a game, lest we forget, that Tom reckoned had ~the best team-mate AI ever~. And now, having squeezed out a further two Hitman titles since, the Danish developer has revisited some of the squad-based mechanics of its EA-published title for its latest, Kane & Lynch: Dead Men.As you'll have noticed from the striking artwork currently adorning billboards, the two disturbing looking men at the centre of the game aren't your regular action heroes here to save the day from terrorism plots, impending Armageddon, alien invasions or Jeremy Kyle  - and thank the flaming lord for that. As someone who has fought in the trenches in the war against gaming cliché, IO deserves a big manly slap on the back for coming up with a game concept that's at least trying to do something different.In this case, neither of these death row inmates are the sort you'd want to swap stories over a pint with. While yours would probably meander through thoughts on overpaid, demotivated footballers and wry observations on how your ex-girlfriend's new lover looks like a real-life version of Mr Burns, Adam 'Kane' Marcus' would silence the entire bar, Slaughtered Lamb-style. The death of 25 Venezuelan citizens notwithstanding, the fact that this flawed mercenary's two-year old son shot himself with Kane's casually discarded service gun didn't win him any popularity points with his estranged wife.And what of James Seth Lynch? Looking every bit as easy on the eye as Harold Shipman with an irony-free mullet, this 41-year-old medicated psychopath was even less popular with his wife, having murdered her and all. But far from being remorseful about his crimes, the schizophrenic Lynch is thoroughly matter-of-fact about the whole thing, claiming to not remember doing it, and represented himself in court as a perfect husband.The game kicks off like a rugby team falling down a flight of stairs during an earthquake, with one of the most cinematically arresting introductions to a videogame ever attempted. The pair are sat in the back of a van in their orange boiler suits on the way to death row, when they're suddenly busted out. Turns out that Kane is a former member of ruthless mercenary gang The7, and made off with a big stash of diamonds when he mistakenly assumed the rest of the gang were dead. Well, they're very much alive (for now) and have gone to rather extreme lengths to track him down and get what they're owed. Even more extreme is the fact that the unhinged Lynch has been hired as Kane's minder to make sure he does what he's told, but as you soon find out, it's more like the other way around.So, busted out of a van, you take control of the completely messed-up Kane, with blurred vision, a broken nose and a suspect ability to even walk properly. You stagger haplessly between cover points while determined cops do their best to halt this human heist, dart into warehouses, and quickly find yourself armed and fighting off a frenzied attempt to secure your re-capture. Needless to say, this being a videogame, you're remarkably resistant to flesh wounds, and stumble around quite competently, returning fire with improbable accuracy.It's an all-action introduction to the wild world of Kane & Lynch and easily comparable with other recent cinematic spectaculars like Uncharted, BioShock and Call of Duty 4 for out-and-out technical impressiveness. The standards of the environments and character models are something to behold, with astonishing levels of detail and the kind of attention to detail that we could only dream of a few years ago. The expletive-strewn script, and the intensity of the violence leaves you in no doubt that the 18 rating is fully justified, and definitely not there for show. Some sections are as ugly and harrowing as the grittiest action movies, and it's a testament to the talent and vision at IO to try something so far removed from the sanitised, cop-out attempts at cinematic gaming. Whether it's your cup of Tetley is another matter entirely, but compare this to, say, The Getaway, and you can see just how far gaming narrative techniques and the quality of the presentation have progressed in that time. Perhaps a more fitting comparison in terms of its desperate 'crisis killing' theme is Max Payne, but whereas Remedy relied on cartoon strips, film noir voice-over stylings and bullet time, the most impressive thing about Kane & Lynch is its capacity to integrate 99 per cent of the narrative seamlessly into the gameplay. In that respect, it does that absolutely brilliantly.I just wish I could be as unreservedly positive about the core gameplay."}