{"ref": "https://www.eurogamer.net/devil-may-cry-4-review", "date": "3 Apr 2008", "game_name": "Devil May Cry 4", "text": "It's almost three years since the last Devil May Cry, with its self-consciously angsty Emo shapes. Despite its awful music and dialogue, we were happy to dish out 8/10 for what was one of the best hackandslash fighting systems around. It wasn't a big step up, but it didn't need to be. It just needed better balance, and to make us forget about the awful second instalment. Refining the 2001 original into something truly fleshed out and compelling, it did the job.That said, a lot's happened in the last three years, not least the arrival of next generation consoles with a larger, unforgiving audience, and some serious competition from two God of War games - all of which may have had some bearing on how DMC4 has turned out, whatever Hiroyuki Kobayashi says. The Capcom of old was happy to back a single-platform release, start the game's difficulty on 'hard' and expect players to admire its work, but this one has to retain its loyal following while opening DMC to a wider audience.The first step was the most obvious: make it a multiformat title from launch day - a concept to which Capcom's been strangely resistant. Second sensible decision: make it accessible from the start rather than beating players around the head. It might irk the hardcore to see their beloved series being compromised, but Capcom's decision to offer 'Human' or 'Devil Hunter' difficulty from the off - and, gasp, a tutorial - is the sign of a developer chasing and trying to retain an audience in a mature way. All too aware of shortening attention spans, DMC4 is eminently playable even if you're a self-confessed button-masher, yet pretty challenging for series veterans, with a further four difficulties to unlock for the truly committed.So yeah, times change. It's easier from the off, and the move-set is less convoluted, but the payback is that the learning curve is smoother, and the game allows you to make (and alter) upgrade choices without giving you the impression these are bad decisions. Someone at Capcom has gone through series conventions with a big red pen, and made sure that a whole host of things that patently weren't fun were kicked out. You can't help love them for bits like 'Auto Skill Up', which selects upgrades for you but still gives you the option of tinkering with them if you change your mind. If you want to admit you're a ham-fisted, combo-fearing 'Novice', it'll select the moves best suited to hammering the buttons. If you're rather more proficient with your finger gymnastics, then you can go for a more demanding set of moves. The best thing about this approach is that there's always the option to cash in old upgrades and try something else (check out some combat footage from early on in the game on EGTV).As you'll no doubt be aware from the endless previews and trailers over the past 30-odd months, DMC4 is the real sequel to the 2001 original - in chronological terms, at least. The big news is that surly newcomer Nero is the lead character, although he appears to go to the same barber and tailor as Dante. The game starts with the cocksure Dante bursting into a church and killing the leader of religious group The Order of the Sword. This prompts the incredulous Nero to give chase and seek revenge.Like Dante, Nero is blessed with angst, and a nice line in grumpy quips. Just like all the other DMC games, the result is unbearably, self-consciously serious narrative interludes with chiselled looks, intricate Gothic attire, floppy fringes and frowns as standard-issue. It's still entertaining, but perhaps not for the reasons intended. However, if you've played any of the others, you'll know exactly what you're in for, and there's no denying that the actual quality of the choreography, animation and detail levels are exceptional. But as much as Capcom likes to devote so much effort to creating quality FMV sequences, we're here for DMC's intriguing blend of swords and guns.Strange, then, that Nero's Blue Rose double-barrelled revolver is actually a bit weedy compared with Dante's equivalent firearm. The emphasis here is much more on Nero's Devil Bringer attack, and its ability to project a spectral arm out ahead of him. As well as being able to grab hold of enemies in the air (and smash them down), you can use it to propel Nero around the environment at speed, although this is limited to a few pre-determined areas where you'll be able to grab onto glowing blue blobs. Another new addition is the 'Exceed' system - the ability to 'rev up' your Red Queen sword, charge it up three times and unleash a red-hot powerful blow, except despite much experimentation, frenzied combat reduced charging opportunities too much to get a handle on it. Your mileage may vary.A better idea is switching between slashing with the uncharged Red Queen and using the grapple powers of the Devil Bringer, locking on, and varying attacks depending on the type of enemy. Some aerial enemies have to be grabbed first with the Devil Bringer, then slashed furiously once they're on the ground. Others, you might need to actually jump up first, grab onto the enemy, and then pull off a combo mid-air, perhaps before finishing them off in a flurry of slashing steel on the ground. If you've got enough magic charged up, you'll gain access to the Devil Trigger, which in simple terms makes Nero faster and more powerful for a brief period, and proves a useful way of draining enemy health quickly. As ever, it's satisfying once you become confident with the broader move-set. The greater emphasis on aerial combat, new weapons, a different upgrade system and different enemy types puts a newish spin on the combat, although repetition drags down some of the initial excitement relatively quickly."}