{"ref": "https://www.eurogamer.net/conflict-denied-ops-review", "date": "3 Apr 2008", "game_name": "Conflict: Denied Ops", "text": "In which a burly, gruff black man with a machine gun and a muscly, gruff white man with a sniper rifle run around the world shooting foreigners in the name of justice. Or freedom or revenge or something else entirely; it's hard to tell and impossible to care. Yes, it's another game with the word Ops in the title, so expect lots of guns and grenades, tanks and helicopters, oil barrels to blow up and boxes to hide behind.  And it's another game with the word Conflict in the title, so if you're a fan of the series you might expect to control a four-man squad from a third-person perspective. But no. As designer Terry Watts told us earlier this year, Denied Ops is Pivotal's attempt to bring Conflict to a wider audience.They reckon players were put off by the complexity of the tactics and control system in previous instalments. These elements have been simplified in a bid to create a tactical shooter anyone can pick up and play. The perspective has switched to first-person, and now you have only two men to control. Lang is the one with the machine gun. According to some loading screen text, he ~likes his combat up close and personal~. He says things like ~We clear, bro~ and ~We on it, bro~ all the time. Graves is the sniper. He can move faster than Lang. He says things like, ~Ghost one, Bad Wolf is at the door~ and ~I'm not your damn bro~. Both of them wear ridiculous sunglasses. Graves and Lang have a complex relationship. Well, complex if you have never seen any films and therefore cannot instantly predict the trajectory of their relationship as they realise they have more in common than they might have imagined despite their ostensibly contrasting personalities and come to admit a grudging respect for one another. At first it's all ~You limp-dicked motherf*****~ and so on. A few levels in, one of them says something like, ~I heard about what happened to your partner in Afghanistan,~ and the other one sinks to an all-new level of gruffness, and you want to turn off the game and enjoy something with more emotional depth, like Diagnosis Murder. The rest of the plot is similarly tiresome. Missions take place in South America, Africa and Russia. There are tenuous explanations between them such as ~We need to explore the diamond mine to find a direct link between Atongwe and the Ramirez regime.~ This translates as, ~We need to go and hide behind some more boxes and shoot some more foreigners. Also we might go in a tank.~ But it's not as if Conflict is the first shooter with a clichéd plot and characters, and it certainly won't be the last. To the gameplay, then. You can switch direct control between Graves and Lang at any time and issue commands with a single button press. The commands are things like ~Follow me~ and ~Attack~. Things you'd expect a highly trained special operative to do anyway if their partner was running off or an enemy was shooting at them, in fact. During the preview stage of development, much was made of how you could issue commands to set traps or line-up flanking manoeuvres. In the finished game, this boils down to being able to tell your partner to shoot the men shooting at you - again, something you'd expect him to do anyway. Irritatingly, if you forget to press the button to make your partner follow you, he'll often just stay where he is. Even if he's under heavy fire and without cover. When he inevitably dies you have to backtrack and heal him with a syringe, as if he's allergic to wasps and you have an epi-pen. When you're down, it often takes far too long for your partner to come and heal you. You can switch characters and do it yourself to speed up the process, but this doesn't do much for the flow of the game either.The controls feel sloppy. Aiming is too fiddly and enemies can survive a surprising amount of direct shots to the chest, though their heads do pop open in a satisfying way if you're precise. The vehicles, which include tanks and hovercrafts, seem to float over the terrain and up the steepest of hills. Their weapons are generally tricky to aim and often implausibly ineffective. There is more fun to be had in co-op mode. There are split-screen, System Link and online options, and each works fine. Being able to shout orders at an intelligent partner who won't just stand there if you forget to press the left trigger to make him follow you does improve the experience. However, other problems plaguing the single-player game, such as the loose controls and idiotic enemies, are still present. And the game looks pretty rough however you play it. The textures aren't bad; there are some lovely bits of gravel. But overall it's lurid, blocky and poorly animated, and everyone looks like they're made out of hexagons.To be fair, Pivotal has succeeded in the aim of making Conflict more accessible with Denied Ops. Anyone who's never played a shooter before should be able to pick up the game and progress through the levels without much frustration. If you don't care about clichéd characters, loose controls and repetitive set pieces, you might even have a nice time. However, if you're a fan of Conflict and/or shooters in general, you're likely to find Denied Ops shallow and dull. The two-man control system doesn't work properly. The visuals are ugly. The script is sub-Armageddon. Yes, it's easy to pick up and play. But if you're after an experience with real challenge and depth, you won't want to."}