{"ref": "https://www.eurogamer.net/the-spiderwick-chronicles-review", "date": "3 Apr 2008", "game_name": "The Spiderwick Chronicles", "text": "This interactive adaptation of the movie of the books is one of those games that starts off better than you expect, and then slowly droops to being exactly what you expect. At one point, near the start, I was wondering if I might have to dollop out an 8/10 for a game based on a kids movie. By the end the score had whittled down to...well, you'll see.The setup is standard tween fantasy fare. Three squabbling siblings - twin brothers Jared and Simon, plus older sister Mallory - move with their post-divorce mother to the old family estate. Once the home of their great great uncle Arthur Spiderwick, the trio come to discover that their dotty and reclusive ancestor had spent his life documenting the ~unseen world~, the world of folkloric creatures only visible to human eyes by looking through the Seeing Stone. Having catalogued this world in the Spiderwick Chronicles, the old fella disappears, leaving his life's work in the care of Thimbletack, one of the diminutive creatures that has befriended him. Needless to say, the inquisitive youngsters discover the book and attract the attention of Mulgarath, an ogre living in the forest surrounding the house - and the only thing keeping this ravenous monsters and his goblin hordes at bay is an enchanted toadstool circle.So, the promising start. To begin with, Spiderwick Chronicles is an adventure game. An honest-to-goodness old-fashioned7 adventure game. For kids. In 2008. Controlling one kid at a time, you're sent on a series of bite-sized quests to first investigate their creepy new home, and then to uncover and arm themselves against the invisible beasts around them. It's simplistic, with objects lying in plain sight and only available to be picked up once you've been told what they're for, but it's very much a game where thought is more useful than action. The 3D world is basic, and largely non-interactive, but it soon livens up once you gain the ability to see sprites.These fairy-like things flitter about the gardens, and the other areas of the game. When captured like butterflies, using a special net, you must complete a painting of them in the Spiderwick Field Journal within a time limit. Do this and you get a power-up. Once a sprite has been recorded, you're free to net them as many times as you like without having to do the whole painting thing again.However, as the game progresses through its seven main chapters, it loses its gentle focus and unwelcome elements of generic licensed kid fare start to creep in. Platform sections with Thimbletack inside the walls of the house are bearable enough, despite a couple of poorly-staged jumping sections, but it's the steady incursion of button-mashing combat that starts to drag the main game down. There's a rudimentary combo system in place, and the attacks are surprisingly brutal (mashing a goblin's head with a baseball bat seems more GTA than Harry Potter) but it doesn't take long for the endless onslaught of respawning bad guys to become a chore rather than a thrill."}