{"ref": "https://www.eurogamer.net/universe-at-war-earth-assault", "date": "3 Apr 2008", "game_name": "Universe at War: Earth Assault", "text": "The first-person shooter, once legendary for its inferiority on consoles, is now firmly established as a cross-platform genre to be reckoned with. So much so, in fact, that any claim that mouse and keyboard are better than joypad is now down to personal preference rather than technical truth. Which just leaves real-time strategy as the last bastion of PC snobbery.Shooters may have evolved on the mouse, but all it took was some rethinking for the principles to work on twin sticks. RTS, on the other hand, is designed for the mouse from the ground up, relying on precise clicks, menu navigation and fast map sweeps for its success. Things are starting to change, slowly, but Petroglyph's Universe at War - developed simultaneously for both PC and 360 - was supposed to be the game to really break through and open up the genre to consoles.Sadly, the PC version didn't exactly blow us away - ~simply too flawed to spend too much time on~ trilled Rob, as he signed off with a  disappointed 7/10. Wouldn't it be awesome to report that the 360 version of this game was not only superior to its PC sibling, but represented a strategy experience that finally makes RTS gameplay work on a joypad?It would be awesome...But it's not going to happen, is it? For one thing, Universe at War's 360 version - delayed by several months - has inherited most of the PC version's shortcomings: a weak and linear campaign mode, which does little to explore the potential of the different alien races, and a stiff camera that only allows a limited view of the battlefield, being chief among them. But this version then compounds those complaints with technical issues so severe that the game becomes borderline unplayable at times.The good stuff first, though. Rather than try and copy the PC controls, Petroglyph has radically overhauled the way the game is played for the 360. The shoulder buttons and triggers are used to call up context-sensitive rotating menus, or to magnify the map for rapid movement. So, for instance, with no units selected you can call up a command menu that allows you to send build orders to any of your structures, from anywhere on the map. With a unit selected, these menus become specific, allowing quick access to special attacks and abilities. And there's a clever quick-select system that allows you to scroll through all your unit types and select all the units of a certain type instantly. By pressing the Back button you can assign all the selected units to your own groupings, enabling you to create the sort of mixed platoons that would be a few CTRL-clicks away on the PC. It doesn't take too long for this system to become second nature. It's never as intuitive as the mouse, but it does a pretty fine job of mapping all the important functions to buttons and sticks without becoming bogged down. Hopefully some future game will take the core idea and develop it further."}