{"ref": "https://www.eurogamer.net/r-metroidprime-gc", "date": "3 Apr 2008", "game_name": "Metroid Prime", "text": "March snuck up on us like a second Christmas this year, with a            barrage of new and exciting games across all formats. We must            confess though that much of our excitement was centred on Retro            Studios GameCube debut. Having spent several months labouring over            a US version, we were excited to finally get our hands on the            closely guarded PAL release this week.        Like all top releases, Metroid Prime is very much its own game.            There's no need to be intimidated by the dynasty at work here.            Anybody who reads the first couple of pages of the manual will            understand pretty much the entire history of the series, and by the            time you descend to the surface of planet Tallon IV, you'll have            mastered the mechanisms involved in playing Prime.                    Tallon IV is a bit like a certain ring-shaped world on another            console, with the former occupants long since departed, and the            surface laden with meticulously placed devices to aid progression,            deposited in their wake. And also like said ring, it's a hotly            contested place, with several species of aggressor and plenty of            indigenous mutants, victims of the radioactive Phazon thrown up by            the meteor strike that ousted the ruling Chozo.                    The winged Chozo - sanctimonious, benevolent weirdoes that they            were - prophesied that a great warrior would one day rescue Tallon            IV from its plight. The manual implies that this is where you come            in, as bounty hunter Samus Aran, arriving by spaceship on an            orbital platform above the planet's surface.        This opening section of the game is more of a short, sharp            tutorial, but it's also a microcosm for the rest of the game. By            the end of it you'll have done much exploring; fought through            corridors and concourses, past sentry guns, utilised the various            functions of your suit and arsenal, rolled around in a morph ball,            studied abandoned experiments and admired limp Space Pirate corpses            strewn about the Metroid-plundered laboratories.                    In the grandest of adventure game traditions, you'll come up            against a few puzzles, overcome an early, sight-setting boss            encounter with a giant, Phazon-chundering Parasite Queen, fight to            escape through larva-infested tunnels or by platforming your way            across lab gangways, all against the clock, and crash-land on the            surface of the planet as the platform explodes into a million            pieces. Quite an opening.                    And as if the sights, sounds and tasks ahead of you weren't enough,            there's a whole new control mechanism to contend with. Unlike Halo,            and other console shooters, Metroid uses the left thumb stick for            all movement, while the L trigger locks you onto a target and            allows you to circle-strafe, or strafe normally in the absence of            targets, and the A and B buttons control your beam and missile            weapons. Only by clutching the R trigger can you look up and down.            Is this restrictive, you're probably asking? Not really, because            much of your sightseeing is just that - an exercise in scanning            objects above or below.        Scanning is one of the most crucial elements of Metroid Prime.            Whenever you're faced with a new area, you hit left on the            directional pad, locking Samus' visor into scanning mode. By            holding R and wiggling the stick you manipulate a centred            viewfinder, which casts holographic icons over actionable items.            These then reveal clues about the surrounding area, activate            objects nearby, or decipher Chozo text and shed some light on the            sorry tale of Tallon IV. All the information is stored in a            database which can be accessed at any time - and you'll spend a lot            of time here unravelling the mysteries of Tallon IV.                    What's more, scanning enemies and bosses reveals weak points.            Enemies vary from level to level, but instead of just varying            animations and susceptibility to ammo types, they have different            attack strategies and you'll need to adjust your tactics            accordingly. Flying bugs are best dealt with by lots of alternative            tapping of lock and fire, but when you first meet Pirates with            jetpacks, for example, you'll need to find some cover and return            fire like you're Clint Eastwood.                    It helps later on when you've amassed the various arm cannon            upgrades - the plasma, ice, power and wave beams - which allow you            to open doors of all matching colours, or when you can match them            with items like the rocket launcher, freezing enemies and then            shattering them like panes of glass.                    Likewise, bosses are tricky to defeat, and far more than an            exercise in ammo expenditure. In some cases, you'll have to look to            the environment for ideas, whilst in others your thermal visor or            scanner may provide clues.        It's a very multi-faceted game as you can tell, but there are            two central principles that drive progression. The first of these            is that some new upgrade, a new toy to play with, could lurk around            the next corner, and each of them is increasingly useful and            exciting to use. Find the morph ball, and maybe you can get through            those tiny tunnels to access the rooms your map insists you should            check out. Find the thermal visor, and maybe you can get past that            darkened room with its ghostly enemies. Find the X-ray, and maybe            you'll spot something new to help you past your current dead end.            Or perhaps if the next room yields some missiles, you can go back            and open that 'blast door' outside.                    Levels, if you can call them that, are linked by lifts and            passages, and are labyrinthine and vast, rarely giving up all their            spoils in one pass. The nature of Metroid has you backtracking all            over Tallon IV, fighting the same respawning beasties and gradually            figuring out puzzles, defeating bosses and accumulating enough kit            to open doors or get through chinks to access new areas.                    Often, you're faced with a problem you can't figure out, and you            really have to scour your map - a scalable, rotatable 3D schematic            accessed via the Z button - for unchecked rooms and forgotten            doors. But almost always, a bit of lateral thinking, the            application of a new upgrade or some visor inspection is enough to            assure your progress. And at times, the game just wants you to leap            around a bit! The amount of platforming required is often quite            surprising; as you find yourself advancing up a massive,            Phazon-rooted tree, scrambling round its trunk like a spiral            staircase whilst scouring the adjacent walls for symbols to unlock            the door at the top - another example of how the game keeps you on            your toes, forcing you to multi-task like all good explorers.        Getting            back on track - though the reward structure is balanced and            intelligent, the game's consistently alluring visuals are an            equally important incentive to continue. They've been lavished much            attention by gamers, journalists and even developers the world            over, but it isn't until you experience the game for yourself that            the hype makes sense.                    There are a million and one awe-inspiring moments saturated with            detail waiting to be uncovered in Metroid Prime. Each new area is            like an art exhibit, from the summery, creeper-ensnared temple            ruins, with dusty, crumbling masonry and bubbling Phazon lakes, to            the lava-soaked, hazy Magmoor Caverns, so hot they require suit            upgrades just to access, and the snowy canyons of Phendrana Drifts.                    Everything Metroid tries, it conquers with aplomb. Thermal visors            explode with flare and Samus' face grimaces in the reflection as            rockets rip through a damaged wall, and alien innards splatter your            targeting pane as you get too close to your victims. And the            creatures of Tallon IV, both alien and indigenous, are varyingly            rendered and each unique. Hornet-like buzzing nasties beat their            wings and zip from the sky when clobbered; the mechanised Space            Pirates go berserk when electrified by your Wave Beam, and as for            the bosses…        It really would be a crime to spoil these magnificent            encounters for you. We've already touched on the gameplay            implications of these face-offs, but from a visual standpoint the            payoff is even greater. Even the first real boss, the giant plant            Flaagrha, has multiple attack patterns, and squirms miserably as            you exploit its Achilles' heel, before growing like a sunflower on            speed as it comes back for more.                    On the whole though, it's the incidental detail that provides the            most memorable moments for crusty Metroid veterans like us. The            sight of a dead Space Pirate slumped, bloodily against a wall;            wires and the sparking electrical innards of a level poking through            the ceiling; clumsily piled scrap metal in a corridor; or even just            an ~empty room~, with cracked floors and creepers snaking their way            around to the very top, where blocks have slipped from the masonry,            dousing everything in light from the sky above - a location working            harder to fit in than a thousand prefabricated gnome-ridden grottos            in Halo.                    Perhaps our favourite touches though are those on Samus Aran            herself. Gases billow against her suit's visor; electrical attacks            fizzle and char, as the bounty huntress raises her arm to protect            her face; and the light even reflects off her shiny metallic ball            shape as she rolls through tunnels like a marble chase-cam.                    If there's a more beautiful game on Nintendo's console, then we            haven't seen it, and if there's a better realisation of a sci-fi            fantasy in gaming, we want to hear about it. It's a 3D update that            relishes its 2D, cartoon past, and has had a comparable effect on            us to that of Doom when we first played the shareware version all            those years ago. No exaggeration.        All            in all, there are many, many hours of exploration and fun to be had            in Metroid Prime. It's a game that never stops giving, and you'll            delight in virtually every activity it throws at you. It's a pure            gamer's game, sheathed in the best aspects of everything you've            played before across many genres. The secret is in the arrangement            - the first bite, as they say, is with the eye, and this eases the            process of chewing your way through the increasingly juicy filling.                    Of course, one of the most difficult things about reviewing any            console's best game - and that is what we're dealing with here - is            ascertaining why it keeps your attention, not why it grabs you in            the first place.                    When it comes to Metroid Prime, however, I think it's an easier job            than explaining Soul Calibur's undying attraction, or the magic            behind Ocarina of Time. Simply put, no game has ever been so            complete, adorned with so much beauty, and at the same time            employed familiar aspects of multiple genres with such seamless            belonging. It's a game awash with variety, and yet nothing feels            out of place.                    Almost everything is right and many tastes are indulged. There's a            moody soundtrack, a hyperactive title screen, the Monkey-topping            physics of the morph ball - and it even has GBA connectivity.            Finish both Prime and Metroid Fusion, released in November, and you            can swap Samus' Fusion suit into Prime and unlock the entire NES            Metroid game on the GBA. Easily the best thing we've done with that            cable so far.                    To be honest, we could go on about Metroid Prime all day, but we're            sure you're pretty sick of reading glowing, superlative-bound            reviews of the game you really must buy today. But the thing is,            it's a game so mesmerising that it has stirred emotion in even the            curmudgeonliest of games writers. It's as if every gamer with a            copy of Word and an import Cube has tried to say something new,            inspirational or memorable about a game which came out of nowhere            and hit every single one of the right buttons. It's a game that's            inspiring increasingly breathless masturbation of the world's            vocabulary, and if it's good enough to remind us - the            surly, anal, tempestuous critics - why we got into games writing in            the first place, then that's a pretty flattering compliment, and            should tell you all you need to know.                             You might have heard about Metroid Prime. It's the game that            kept US and import gamers happy over Christmas; the game that - in            all probability - would have saved the machine's arse had it come            out in Europe four months ago. There's little point waiting until            the end of the review to tell you it's a good game, because you'll            have read that already a hundred times.                    What's possibly more useful is for us to try and pinpoint why it's            so good, and maybe throw a few spanners in the works to point out a            few misgivings that others may have glossed over, as excited gamers            tend to when they passionately devote themselves to a game.                    It's hard to know where to start when you're forced to pinpoint the            game's excellence, such is the stunning amount of depth contained            within Retro's classic. There. We said it already. Three paragraphs            in and superlatives are flying around like Morph Bombs.        The easiest, most basic area to lavish praise on Metroid Prime            is the graphics. It just oozes class on every level, and will            consistently have you gasping in admiration at the endless            attention to detail. Seeing the world through the helmet of Samus            is a masterstroke from the off, giving Retro Studios the            opportunity to show off some absolutely delicious effects.            Everything looks incredibly convincing: emerge from underwater and            droplets run off the front of your visor. Walk next to a volcanic            vent, and sweat fogs up the inside. Walk near a cascading            waterfall, and get covered in spray. They may be incidental            touches, but they quickly immerse you into the environment, and            make it all the more convincing.                    On a similar level, there are vast array of creatures, ranging from            scurrying beetles to giant mutated monsters, and everything in            between, all supremely detailed, even at the closest proximity and            a brilliant advert for the capabilities of the Cube. The variety in            the scenery is tackled with aplomb too, and managing to display            even those old fallbacks of Ice, Lava, and Desert with a degree of            polish and detail that puts other games to shame. The overall look            and feel of the game is sufficiently different from the common herd            to make it feel new; which is always a pleasure after 200 Quake            3-based games.                    The controls are also superb too, managing to make the most of the            GameCube's pad, with a configuration that feels natural within            minutes. At first, having to click the R button to look around            feels like an unnecessary annoyance, but Retro has come up with a            system that is not only different from its many peers, but in some            respects is an improvement. The lock on system allows you to engage            in some pretty hardcore fire fights, always giving you the            impression that you're in control; and the ability to circle            strafe, and dash, around your target makes combat entertaining, and            never at any stage a chore. Sure, the boss fights can be a massive            challenge, but you get there in the end, and like the rest of the            game, the learning curve is very well judged.        The sense of awe and wonder in the world of Metroid Prime is a            feeling we've not had since the days of Half Life and the original            Unreal. Scanning artefacts and creatures gradually gives you an            insight into how this planet ended up in this state, and builds a            narrative in an intelligent and almost subliminal way. It won't be            to everyone's taste, and maybe the thought of wading through            endless notes strikes you as a tad dull. Sometimes it is; sometimes            you just long for a cut scene to tell the story in a more            movie-esque, coherent sense, but in other ways the piecing together            of scraps of information makes you feel like it's your discovery -            your reward for looking in every nook and cranny.                    Perhaps the strongest point of Metroid Prime is the way the upgrade            system works. Almost everything you achieve in the game is rewarded            with a new weapon, or upgrade, suddenly offering you the chance to            go back to out of reach areas of old levels to scour for new            sections and even more upgrades. The carrot and stick design works            a treat, and even 15 hours in you'll barely be scratching the            surface, desperate to claim the next unknown upgrade. Once you're            fairly well equipped, it really begins to sink in how cleverly            designed the levels are. However out of reach or inaccessible            certain sections look, you know that you'll have the ability to            reach them at some point. There's a massive amount of satisfaction            for your unflinching efforts, and all the while displayed with a            level of detail bordering on perfection.        But. You were            waiting for the but, and here it is. Despite the slightly            hysterical coverage Metroid Prime has been getting everywhere,            there are some areas that could have been improved and some that            just downright annoy. The first is the game's insistence on            respawning all of its enemies, no matter how many times you've            cleared an area. Up they sprout, again and again, and it's plainly            a tedious mechanic to make the game still feel alive and busy, even            when you've slaughtered every living soul possibly dozens of times.            This, in itself, wouldn't be an issue, were it not for the            necessity to continually backtrack and revisit every part of every            level multiple times, in order to use your latest gadget and reach            some previously unattainable area.                    In addition, the game's intricate level structure can, to begin            with at least, trip you up. This is not a game that you can just            breeze through, partly due to the fact that it's big, but also            thanks to some questionable signposting. The game does, to be fair,            occasionally chip in with hints of where you should be heading            next, but often it merely points to a section of the map that you            can't even access. More often than not, the real goal is to get            your next gadget, thus allowing you to head for the area in            question. It's no exaggeration to note that you can wander            backwards and forwards through the game world for hours - tediously            encountering the same enemies again and again - until the penny            drops as to exactly what the purpose is. After a while you begin to            learn the way the game wants you to play, but it can be a painful            first few hours before a pattern emerges.        You could just as easily argue that the game's lack of            narrative structure and decision to abandon the spoon feed approach            of a check list of mission goals gives the game a distinctly            refreshing slant: one of exploring a strange new world, gradually            understanding what's going on as you search its hidden depths. This            is all true, but in the context of a modern game it also            contributes to making it more frustrating and long-winded than it            would otherwise be. We don't recall anyone berating Rare for giving            clear mission goals in GoldenEye; and somehow it just comes across            as a needless omission. Certainly, the option of having such a            basic facility as a set of mission goals would aid the less patient            gamer enormously - or the less time rich gamer. Focusing the game            on the time rich, patient, persistent hardcore seems bloody-minded            for what is, nevertheless, a classic.                    For many of you, some of you perhaps hardcore Metroid veterans,            none of this will apply - but don't be surprised if you spend your            first few hours with the game wondering what all the fuss is about            - as Tom says, it's a gamer's game, and the wide-eyed noob may be            in for a rude awakening if they're expecting another friendly,            accessible Halo-style romp.                    Despite all the early niggles, the bottom line is Metroid Prime is            a landmark next generation title and builds itself into one of the            best games we've ever seen. The true mark of its genius is that            even when it annoys the hell out of you, the compulsion to keep on            playing never wanes. The punishment-reward relationship is ever            present, (and arguably has too much of the former and not enough of            the latter at times) but the more you play it, the more abilities            you unlock, and the more satisfying the game becomes. Would we buy            a GameCube to play it? At the crazy prices doing the rounds at the            moment it would criminal not to. Patience is a virtue; buy Metroid            Prime and be virtuous.        Metroid Prime                    screenshots (Cube)                Metroid Prime                    screenshots (Cube)                Metroid Prime first                    impressions (Cube)                Metroid Prime first                    impressions (Cube)                                     Shop:Buy            this game for £34.99 from the            Eurogamer Shop."}