{"ref": "https://www.eurogamer.net/r-fm2008-360", "date": "2 Apr 2008", "game_name": "Football Manager 2008", "text": "I know, I know, we say it every year, but that's only because it's true, so here goes: Sports Interactive's Football Manager series is the definitive football management experience there is. No other management series comes close to matching its sheer depth, exhaustive attention to detail and impressive levels of realism.Right, now that we've got that out of the way, let's get down to business. Just like last year's version, FM2008 takes another brisk walk down Evolution Street without ever deviating into Revolution Road. Featuring all of the new features from the PC version - that's well over 100 additions for the number lovers amongst you - the game proves slicker and more detailed than ever before, but sadly lacks any genuinely cutting edge new features such as the excellent player interaction tools that set FM2007 apart from its predecessor. This year's version feels very much like a spit polish of an already gleaming product, with many new additions welcome if not instantly noticeable.The first thing that'll strike you is the natty skin overhaul and the smattering of neat touches at the start of a new season, which see you tweaking the dimensions of your pitch and haggling for extra transfer and wage budgets by promising your board you'll exceed expectations. But be warned, this is a dangerous game to play. While the extra dough may prove invaluable in snaring your dream players, failing to deliver on your lofty promises will see you exiting through the back door more quickly than a burglar who's just triggered an alarm. You also have the option of siphoning your wage budget into your transfer kitty for that all-important extra million (or fiver if you're managing a Conference team).If you're a newcomer to the series, then you'll be pleased to know that there's a highly intuitive (optional) Adviser system on hand, which pops up at key moments throughout the season to help you navigate the game's myriad statistical screens. There are also countless loading screen tips that fill you in on the game's subtleties, though sadly, they often fail to linger on screen long enough for you to read them in their entirety.While many of Football Manager 2008's new additions are little more than tweaks, there are some notable exceptions, such as the match day experience, which now offers a far slicker and more complete tactical experience. As well as providing you with more upfront tactical options before a match, you're also given greater real-time tactical control during games, thanks to an excellent mini match radar view that allows you to monitor the action while tweaking your strategy. International management has also received a minor overhaul, most notably in the player and media interaction departments, though this side of the game still remains infinitely less detailed than its domestic counterpart.A new Confidence screen allows you to access information on what the fans and board think of your progress, which new signings they deem to be successes or failures and whether you met expectations in your most recent matches. The confidence level of each group is denoted by a Confidence bar, which admittedly is hardly groundbreaking, but still proves helpful for keeping tabs on how you're progressing, despite the odd moment of fan doom-mongering when you're actually doing quite well."}