{"ref": "https://www.eurogamer.net/everybodys-golf-world-tour-review", "date": "26 Mar 2008", "game_name": "Everybody's Golf: World Tour", "text": "Is it possible to start a review of a golf game without a reference to a good walk spoiled? Apparently not. But golf's real problem isn't that it spoils a good walk. It's that golfers spoil a potentially good game, with their blazers and ties, and their committees, and their archaic attitude to women and all that sort of thing (although don't tell my dad I said that: he's the captain at his local golf club).Minna no Golf is, in stark contrast, a good game of golf, unspoiled by any of that. From start to finish, it just exudes charm. Like your caddy, who zooms off after each shot to make sure he (or she) is there, panting, to greet your ball when it lands. Or the 'NICE SHOT' that appears in great big multi-coloured letters every time you hit a good shot. Or the sound of cowbells, or the sight of swans as you make your way round the various courses. Or the slightly non sequitur but relaxing and serene images of tranquil vistas, or swimming dolphins, that greet you in pinpoint high definition at the end of every round (a personal favourite is the killer whale).In terms of the actual game design, Minna no Golf is unabashedly old school. Unlike games like Tiger Woods, which have moved into the modern era by featuring a growing roster of licensed names and courses and incorporating a mimetic analog stick waggle, Minna no Golf does pretty much the same thing that previous games in the series have always done. Which means that Minna no Golf, unlike the real thing, and the games that aim to ape it, provides a wonderful invigorating streak of colour and character across the golf course. The structure is the same as before. There are 15 characters, six courses, and seven caddies available to unlock (with just two characters, one caddy and one course open at the start of the game). There's strokeplay, matchplay, multiplayer, and a variety of challenges that allow you to unlock new costumes, clubs and balls, and each set of challenges culminates in a matchplay game against the next unlockable character. There are online tournaments, and cute online lobbies, modelled on Japenese hot springs, or tatami rooms, peopled by Mii-style avatars, decked out in a variety of costumes, from scuba divers to schoolgirls.And there's the same, tried and tested mechanics that have featured in all the previous Minna no Golf games, barring a cosmetic change. The way you used to play Minna no Golf was with a simple three-tap system: one tap to set the power bar going; a second to confirm the power of your shot; and a third to determine the control and accuracy. The new system sees an equally simple three-tap system: one tap to set your swing going; a second to confirm the power of your shot; and a third to determine the control and accuracy. It's the same power bar system that golfing videogames have employed since time immemorial, just without the power bar. So it's just as intuitive - and probably more so - than ever before (and in any case, old-hand die-hards still have the option to use the old system). It does make putting slightly more difficult at first, but only until you suss out the relative power of different putts and learn to read the greens. In the world of mobile phone gaming, they call this sort of design 'one button gaming', and get breathlessly excited about how it appeals to everyone, not just people who play games. That's absolutely true of Minna no Golf, but it's also true that the game sports sufficient depth to satisfy the most ardent wannabe pro golfer. It's got spin, mapped to the d-pad, and it's got boost shots, which you can use a certain number of times each round to gain a few extra yards. It's got a choice of players, clubs and balls, all of which have an impact on your style of play. And ultimately, it's got the infinite variety of a real game of golf, because wherever your ball lands it will create a subtly different challenge every time. And that's why, in spite of all the similarities to previous games in the series, the game never runs into the law of diminishing returns. In spite of the fact that all you're doing is pressing a button three times, over and over again, it never gets boring. It would probably be too controversial to call it the best golf game, or the best PS3 game. But on both counts it's a remarkably close call."}