{"ref": "https://www.eurogamer.net/r-vcroundup-250308-wii", "date": "25 Mar 2008", "game_name": "Reviews", "text": "Another two weeks, and another slim selection of new VC titles seemingly designed to deflate our enthusiasm. Just three games have joined the line-up since last we spoke, two of which will leave many feeling déjà vu, while the other provides a good argument against paying for unadorned ROM emulations.Here we go again...Much like the bizarre doubling up of Dynastic Hero/Wonder Boy III you have to wonder what the point of adding this shoot-'em-up entry is. A console exclusive mish-mash of elements taken from the R-Type and R-Type 2 arcade games, Super R-Type doesn't provide anything not already available in abundance from R-Type III, the highlight of the 16-bit era as far as this series goes, and a resident of the Virtual Console for over a year.Making this effort even less desirable is the rather shonky port job the game received, with some grim slowdown whenever things get hectic. This being R-Type, things get hectic rather a lot, and having the gameplay lurch from treacle pudding to normal speed pretty much destroys the flow needed for any shooter to flourish.The game is also incredibly tough, with no checkpoints whatsoever. Die fighting an end-of-level boss and you can look forward to playing the whole level over again. Such ruthless gameplay mechanics are fine, provided you're a shoot-'em-up fiend, but then that's precisely the audience likely to be turned off by the fact that this is a notoriously wonky adaptation.It's not as if the VC has ever been short of shooters, so there was no need to upload this one, and therefore no need for you to download it either.4/10And here's another weird addition, and your solitary new game for the Easter weekend. It's weird because Factor 5's Super Turrican joined the Virtual Console gang less than a month ago and while the levels are different, this is similar enough to really only appeal to anyone who loved the SNES game enough to have finished it and be fiending to spend another 800 Points on something that looks the same.Except Mega Turrican doesn't look the same. Compared to its SNES cousin it's an ugly effort, rendered even uglier on an HD screen. Sprites are squat and chunky, while the whole screen is sliced asunder by distracting lines that probably have something to do with de-interlacing or something equally technical that I sometimes pretend to understand. It doesn't look nice, is what I'm saying.In gameplay terms this is less shooter and more platform game, with the already obvious debt to Metroid made even more blatant by an increased reliance on swinging and rolling in ~wheel mode~ to progress. The level design isn't a patch on the SNES game and, while its still playable enough as an early '90s game of its type, it's definitely the lesser of the Turricans available here. It is, however, the best game on offer from the past two weeks - a rather depressing state of affairs and no mistake.5/10Operation Wolf was one of those games that I loved as a child, though I'm now old and wise enough to realise that what I really loved was the idea of the game. No home version could hope to match the arcade original, with its black plastic Uzi poking at the screen, but as dragging a cursor around the screen was the closest we could get, we were happy to go along with the illusion.Today, this NES conversion seems a lot less exciting. Aiming is sluggish, while the graphics - which once seemed so vital and colourful - are revealed as a blocky sludge, blighted with an unseemly amount of flicker. Such is the way of 8-bit games in a whatever-bit-age we're in now, but in a game were the visuals are nothing more than vaguely animated targets sliding into view the effect is less easy to ignore.The main problem is one that hobbled the game on its original release though - this is a gun game with no gun. There had been talk of the NES classic Duck Hunt being reworked so the Wii Zapper could replace the light-guns of old, and the same needed to happen to Operation Wolf. It's still sort of playable but without a plastic weapon in your hand the game's big drawing point - unleashing reams of ammo at fiendish baddies like an action movie hero - is transformed from seductive enticement to irritating chore. Playing a light-gun game with a joypad is like playing a platform game with a steering wheel - just about possible, but completely contrary to how it's supposed to work.The core gameplay is still fairly amusing - and the attract sequence still clearly ripped off from the Arnie classic, Commando - but between the low technical quality of this version and a control method that is simply wrong, this is another VC offering best left alone.3/10"}