{"ref": "https://www.eurogamer.net/bad-north-review-doom-laden-strategy-delivered-in-tiny-terrifying-chunks", "date": "23 Aug 2018", "game_name": "Bad North", "text": "The art looks peaceful and almost cheery, but the bleached white of the rocks and cliffs and the overcast grey of the calm waters suggests otherwise. Then there's the soundtrack, muttering and worrying at strings and giving way to deep ominous booms when a dark craft appears on the horizon. And the game is almost all horizon, isn't it? Each level is a tiny Chewit of turf surrounded by ocean. You marshall your forces, send them towards the likely landfall and then you wait, completely adrift and beset on all sides by the potential for invasion.Bad North may look sweet, then. It may occasionally feel sweet, as you use a finger to spin your current island, as if it was a tiny model on a designer's turntable. But this is about as unsweet as games get. A stripped-back real-time strategy - a handful of units to control, no base-building - with all that genre's potential to watch a single mistake blossom into panoramic catastrophe intact. Marry that with the structure of a roguelite: incremental improvements, the strengthening drum-beat of your evolving powers and abilities, all playing out across a procedural campaign and silenced by a single disaster.Each level lands you on a fresh island with the same objective: defend the cluster of buildings huddled around you from the invaders who will arrive on your shores one after the other. It is all so sinister! They stand silent in their longboats, these invaders, masked faces unreadable but murderous intentions entirely clear. You, meanwhile, control that handful of colour-coded armies, moving them from one spot to another, slowly levelling them up over the course of a campaign so you have the likes of specialised archers, pike-men and infantry, all with strengths and weaknesses regarding things like range and the ability to attack when moving to take into account. You take out one landing, and then you scan the horizon for the next one. And then the one after that, and then the landings that occur in two places at once.In between battles you hop from one island to another on the map screen, staying ahead of a wave of destruction, sometimes choosing between different routes, selecting an island that might have a gadget for you to equip, like a bomb or a magical ring, or that might have a new colour-coded army to add to your line-up. You spend the coins you receive from any successfully defended houses to unlock first a class and then a range of simple skills, or a level-up from standard units to veterans or elites. And when you return to the fray, you often discover that your enemies have been learning and levelling too. Sometimes they come with shields, which means that archers will not be able to whittle them down before their boat is on your beach. Sometimes, they come with their own archers, which means that you can't simply plonk your troops in position and wait for the moment of impact.It's simple, stirring stuff. Bad North is initially so simple, in fact, that I worried it would run out of energy and become boring. In truth, there is just enough to think about, by the time a campaign is really flying, to guarantee that you will have slightly too much to think about overall. Getting the most out of your troops requires speedy deployment of specialised forces, with one eye constantly on the horizon. Losing a unit means you may survive this encounter, but the next encounter will be more difficult. On the campaign screen, everything is revealed as a choice, eventually: you read prospective islands for how easy they will be to defend, but also how much they will reward you if you are successful. Mistakes cast very long shadows here.Controls are fine, triggers zooming in or out while bumpers allow you to click between units before moving them with a cursor that, thankfully, slows the action to a crawl. This is the rare Switch game, however, which is best to play with the touchscreen, jabbing your troops around, selecting special attacks, and pinching and swiping to best frame the action. The fiddliness of troop movement is offset by the neat tiles that divide each island up, but I think a degree of lingering fiddliness is part of the fun anyway. The ominous tone is part of the fun too, the overwhelming sense - and it really is overwhelming - of impending doom, that means I often need twenty minutes away from the game after a particularly crushing defeat.That crushing nature of the defeat, incidentally, makes the occasional bug all the more infuriating. Once or twice - it is really a very rare thing - I have all but won an island only to find that the last enemy troop simply won't die. It's not that they're the elites, which can take some time to kill, it's that they just won't succumb to any kind of attack, and I'm left with the option to flee in a boat, if I can make it to one, or simply give up.Such problems hardly define the experience, however, which is generally streamlined and pretty and wonderfully unpleasant. Bad North is the perfect title for a concoction like this: this compact strategy game feels frigid and remote and thrillingly nasty."}