{"ref": "https://www.eurogamer.net/r-xblaroundup-120308", "date": "12 Mar 2008", "game_name": "Reviews", "text": "With that Wii-chasing price drop now confirmed, it's clear that Microsoft is aiming its 360 Arcade package right between the eyes of the family market. No doubt some are already clenching their fists and scowling about casual gamers and how they're ruining games and grumble grumble swear. Personally, I couldn't give a toss about the bane of casual games. Pretty much all the early classics of gaming, the basic templates of which are still in use, were casual by definition. I mean, imagine people wanting to play games just for fun. The fools!With that in mind, this week's Live Arcade update provides two games designed to appeal to this audience. Neither do much to help my pro-casual argument, both being largely inessential, but their flaws lie more with lack of inspiration and make-do design, neither of which are unique to the casual end of the gaming spectrum. So there.Tom already sank his pristine fangs into this one when it surfaced on the PSP and all of his criticisms still stand. Bliss Island is about as uninspired as mini-game compilations get, with a flavourless selection of challenges and a half-hearted attempt at adding charm and character.The concept, for what it's worth, follows fluffy air-puffing creatures called Zwoophs whose job it is to guff the clouds into the sky. There's apparently no Zwooph union, so they only get one day off each week and spend this time playing games. The games you will also play, you see. Trouble is, all of the games seem more like hard work than lying around all day farting into the sky, mired as they are in repetitive drawn-out gameplay, obtuse instructions and a general lack of anything that might endear the game to all but the most attention deficient.Zwoophs are puffed up vertical platform levels, or across horizontal levels, or around Frogger-style courses. Fruit is puffed into monster mouths, balls are puffed into each other, or into descending blocks. While there's variety between the nine games on offer, they all share a common blandness that makes it hard to muster up the enthusiasm to work through them all to unlock the various medals.We gave the PSP version 4/10, and this largely identical Live Arcade version only scores higher because the price is much more agreeable, the multiplayer more workable and some of the irritations - such as having to unlock everything in the laughably titled Adventure Mode - have been removed.5/10"}