{"ref": "https://www.eurogamer.net/r-talkman-psp", "date": "11 Mar 2008", "game_name": "TalkMan", "text": "The idea behind TalkMan is a great one. Imagine if you could carry a translator around with you on holiday, so you didn't have to spend ages flicking through phrase books, working out correct pronunciations, or SHOUTING VERY SLOWLY AT FOR-EIGN-ERS. Your PSP would always be there to help you order a sandwich, chat up a lady/gentleman, or explain to a doctor that your leg doesn't normally bend that way - whatever the situation, you'd never be at a loss for words. Unfortunately things haven't quite worked out that way. TalkMan is like having a translator who's partially deaf and has only completed units 1 to 3.4 of his Tricolore book. True, it works as an electronic phrasebook - but only if you're prepared to faff around switching between screens a lot, and if the person you're talking to is prepared to wait patiently while you do so. Before getting into all that, though, here's how TalkMan works. It comes bundled with a neat little microphone that slots into the top of your PSP, and the European version features more than 3000 phrases in English, French, Italian, German, Spanish and Japanese. On booting up the UMD you're introduced to Max, a big blue bird with a bendy beak and a stupid cockney accent. He acts as your translator in Talk Mode, first inviting you to select the language of the person you're talking to, and then presenting you with a range of 28 different scenarios to choose from depending on your situation - such as Sightseeing, Shopping, Hotel and Airport. The idea is that you pick one of these, and speak the phrase you want to say into the microphone. Max then offers you a selection of phrases according to what he thinks you're on about, you choose one, and he'll say it in the other person's language. Unfortunately, Max isn't very good at picking the right phrases. In the Restaurant scenario, our ~Can I have a table for four, please,~ brought up various useless suggestions including ~Can I just have water, please~, ~Can we have some extra plates for sharing~ and ~Do you have a Japanese menu?~ It's not just the restaurant where Max has trouble. At the hotel, when you say ~What time is breakfast,~ he suggests ~There's no toilet paper.~ In a taxi, ~I want to go to the train station~ throws up ~I'm taking this airline.~ And perhaps most worryingly, in the Emergencies section, Max hears ~I've been taken hostage~ as ~The traffic light was green.~ You're supposed to be able to hand the PSP over to the person you're talking to so they can respond - but this doesn't work too well, either. A French friend, doing his best waiter's voice, tried ~Il n'y a plus de places en ce moment~ (~There are no tables at the moment~); Max told us he was asking, ~Rouge ou blanc?~ In other words, the vocal translation technology just isn't good enough. Frequently hilarious, yes, but probably not quite so funny if you're standing in an A&E department trying to tell a doctor that your husband is having a heart attack and Max thinks you mean ~My wisdom tooth hurts.~ Still, there is a way around this; there are 'Crib Notes' for each section which can be accessed by pressing the right shoulder button. Then you have a range of topics to choose from - in the restaurant, for example, you can look up common phrases to do with reserving a table, placing an order, dealing with problems and so on. But the selection of phrases seems a little bizarre. For example, you can ask, ~Is there a Vietnamese restaurant around here?~ but not ~Can I have a cheese sandwich?~ In fact, there doesn't appear to be any kind of food vocabulary at all, and there's no dictionary function so you can input a single word and find out what it means. It might have been better if they'd opted to release different versions of TalkMan instead of bunging six languages onto one disc - true, that might mean you'd end up having to buy more than one copy, but at least you'd have a fully comprehensive selection of words and phrases at your disposal. So, the Talk Mode isn't exactly everything you might have been hoping for - but what of the Game Mode? Well, there are two types of games you can play, each of which has 25 difficulty levels. In the pronunciation game, Max will read out a sentence in whichever foreign language you've chosen (the English translation is also displayed), you repeat it and receive a grade according to how good your accent. It's sort of fun, but it's not exactly thrilling. And the Japanese version of the game doesn't work too well - the words aren't written out in English, only kanji, so if you're not already fairly familiar with the tones it can be hard to guess what you're supposed to say. The listening game is both dull and irritating. Max reels off five phrases in foreign, and you're forced to wait for the disc to whir round in between each one. He then repeats one of them, and you have to guess the meaning, and then sit through an animation of some birdies holding up cards to find out if you got it right. For your next question, you have to listen to all five phrases again, and wait for them all to load again, and then sit through the animation again - and you must do all this five times to complete the whole test. To ~cheer you up~, as the on-screen text would have it, Max wears different outfits depending on which language you've selected. Look, he's wearing a beret! Now it's a matador's outfit! Lederhosen! Ho ho ho, we haven't laughed this much since 1974. When this sort of thing was made illegal, surely. The bottom line is the games aren't much cop - the pronunciation one is all right, and could be useful, but the listening game takes too long to play out, and once again the Japanese version is extremely tricky unless you have a basic grasp of the language since only kanji is displayed. It's a real shame they couldn't have included some kind of basic language course, or at least a better variety of games. That's basically all there is to TalkMan, with the exception of a few extras such as the Voice Memo feature. This allows you to record someone saying a word in the original language, such as the name of a particular food or hotel they recommend, and then play it back in Talk Mode. Nifty. You can also keep track of the people you meet on your travels by recording their voice, customising an avatar and sticking a flag on a map of the globe to remind you where they're from. There's also a Unit Converter, which can convert measurements of length, weight, temperature and so on as well as currency. And an Alarm, which is just stupid - when it goes off, Max will spew out a foreign phrase, and the alarm won't stop until you've correctly guessed what he's saying. Since when do we want our electronic devices to make us pass tests before we can control them? Imagine if your television demanded an explanation of ox-bow lakes before you could change channels, or if the fridge refused to open until you told it the exact terms of Germany's post-World War I reparations treaty? Nonsense. Still, no one's going to buy TalkMan for the alarm clock function, so we'll overlook that one. People are more likely to buy TalkMan because they're looking for a way to communicate in other languages more quickly, easily effectively than with a phrasebook - and they're likely to be disappointed. TalkMan, sadly, does not work well as a translator or a learning tool or a game. It just about works as an electronic phrasebook, providing you're prepared to put up with constantly having to switch between the different situations and a lot of loading. In other words, it's not much better than a normal phrasebook in terms of the length of time you have to spend mucking about.And then there's Max, who will quickly become a figure of hate for anyone over the age of eight. He frequently interrupts the proceedings with some completely pointless ~joke~ - on one occasion where we selected the Telephone section, for example, he quipped: ~Ooh, thanks for reminding me, I need to call my Grandpa and let him know everything's okay.~ What? Who cares? Go away. But Max isn't the real problem with TalkMan - it's the fact that this is a great idea which the PSP just isn't equipped to pull off. At one point, when Max had failed to work out what we were saying for the third time, he came out with: ~I hate to admit it, but this may be a good time to try a dictionary.~ Couldn't have put it any better, sir."}