{"ref": "https://www.eurogamer.net/bully-scholarship-edition-review", "date": "10 Mar 2008", "game_name": "Bully: Scholarship Edition", "text": "Rockstar Vancouver may have been copying GTA's homework a little when Bully came out on PS2 at the end of 2006, but it still changed enough words to impress teacher. Guns and cars were expelled, compressing the play area and allowing for greater variety and more developed controls, while the school setting and routine gave it a tighter structure. Roaming the halls and the neighbouring town of Bullworth, wise beyond the teenage years of most of the cast, it keyed in cleverly to the sense most of us have that we would like to go back to school because now we'd actually get the joke, and it would be more enjoyable. It was, and even though not much has changed for the 360's Scholarship Edition port by Mad Doc Software (look out for a separate Wii review tomorrow) it still is.Playing as Jimmy Hopkins, a 15-year-old troublemaker given one last chance at Bullworth Academy, you start off racing between mini-game lessons, probing the school boundaries between classes, before heading back to the dorm every night for bed. Like GTA, you're directed to various icons on a mini-map, with stars denoting missions, and through these and Rockstar's traditional, well-written in-game cut-scenes, you're introduced to the world and the people in it, each a measured stereotype or caricature: the various cliques like the Nerds and Preps whose respect you'll be winning and losing; and characters like Petey, the bashful weakling; Russell the thuggish idiot; Galloway the drunken English teacher; Miss Danvers, the headmaster's fawning secretary; Tad the inbred rich kid; and Gary the manipulative bully.There's a fair bit that you can do right from the off, and within a couple of hours you'll have assembled an inventory of neat gizmos - a slingshot, skateboard, stinkbombs - and abilities. Targeting other people with the left trigger, you can taunt or compliment them (the latter, if you follow it up with a gift, can lead to romance), or push them around. The combat is unavoidable, because Bullworth's a bit of a rotten place, but the controls are sound and your arsenal of attacks and grapples grows steadily and naturally as you swap radio parts with a homeless army veteran living just inside the grounds. The game itself is the best teacher in Bullworth, seldom leaving you stuck or unable to progress due to difficulty or poor education.Jimmy's lessons are technically mandatory (prefects will escort you there if you get caught playing truant and can't evade them), and each is a mini-game. English has you racing to make words out of a jumble of letters, Art is about directing a paintbrush to annex areas of a hidden picture without getting smashed by a rubber, Gym goes through wrestling and dodgeball among other things, and Scholarship Edition-specific inclusions like Maths (quick-fire calculations) and Biology (Trauma Centre-influenced animal dissection - forget the anti-bullying lobby, has anyone told the idiots who burn down university boathouses?) are as good if not better than the rest of the curriculum. Successful completion of lessons unlocks new gadgets and skills.But it's Jimmy's extra-curricular activities that dominate and define Bully, putting you on a path to showdown with the school's various faction leaders and chief bullies. Heavily influenced by GTA, there's lots of fighting, pushbike racing, spraypainting, covert photography, rhythm-response, and every conceivable fetch-quest. Success opens up new missions, new save locations, new toys and side missions. Jimmy can also simply mess around, tripping people with marbles, egging cars, booting footballs at thugs, and hunting down hidden rubberbands, gnomes, and G&G cards. Elsewhere there are one-off parlour games, like keepy-uppy, '80s arcade game knock-offs, and carnival target ranges."}