{"ref": "https://www.eurogamer.net/xbox-live-arcade-roundup-review", "date": "13 Feb 2008", "game_name": "Reviews", "text": "Colour-matching puzzle games have always been a regular feature on the videogame release schedules but, in recent times, with the advent of Xbox Live Arcade and the success of the DS, Puzzle Quest and Bejeweled, a perennial trickle's become a torrent. Cheap to make and easy to execute, they require just a couple of tweaks to the formula, a cutesy re-skin and Puzzle Bob's your uncle. Boogie Bunnies is no different in that it boats a couple of headline inventions to mark it out from being a straightforward Puzzle Bobble clone but, perhaps inevitably, these detract from rather than add to the wining formula. The layout of the screen is similar to Taito's classic, albeit it with the upper part filled by a group of variously coloured rabbits rather than bubbles, all neatly divided into rows and columns. Over time they advance toward the lake at the bottom of the screen and it's your job to stop them falling into the water. This is achieved by shooting new rabbits, one by one, into the furry throng. Form a group of three or more like-coloured rabbits (either in a horizontal line, vertical line or L-shape cluster) and they'll explode, slowing the rest of the group's advancement toward the bottom of the screen. As the lines of remaining rabbits rearrange themselves in accordance with reverse gravity, filling in the spaces left by their exploded comrades, any resulting three-or-more colour groupings result in a further chain reaction, ballooning your high-score in step with the rodent explosions.The first and most obvious novelty is that you can move the firing cannon up the sides of the play area as well as along the bottom. By continuing to press left or right your cannon will flip from the bottom onto the side of the screen, allowing you to fire a new rabbit into their number from the sides. This has several ramifications. Now it is possible to destroy groups of three like-coloured animals at the top of the mass (albeit to one side) as well as at the bottom. In a sense this increases the possible number of chains you're able to make at any one point as you're not limited to the X-axis. However it also removes any necessity to carefully aim your missile. Can't make the difficult shot? Simply run it up the sides and slot it into place from close proximity.The second change to the formula is that the rabbits advance towards the bottom of the screen automatically (i.e. their progress isn't tied to the number of shots you've made like it is in Puzzle Bobble) and that on their way they periodically dance, a feature presumably introduced to justify the alliterative title. While the bunnies are boogying they're worth double points. That's all.The biggest problem with the game is that it's simple but devoid of real depth. Without the challenge of precision-aiming, it becomes easy to blunder through levels without much planning and the experience is shallow and repetitive for it. Arcade, Classic, Endless and Co-op modes fail to expand the idea enough to warrant the 800 Microsoft Points price-tag because, put simply, there's an abundance of better examples of the genre.6/10"}