{"ref": "https://www.eurogamer.net/sam-and-max-203-night-of-the-raving-dead-review", "date": "12 Feb 2008", "game_name": "Sam & Max Episode 203: Night of the Raving Dead", "text": "Zombies, much like pirates and ninjas, have been bled dry by the Internet equivalent of the office joker. ~LOL!~ they e-scoff, as they email you a link to that Amazon-for-zombies spoof site for the millionth time. Or they make you regret ever registering at Facebook or MySpace by bombarding you with cutesy nonsense. Nothing has me hitting delete faster than the phrase ~Dengar3425 has sent you a zombie bite!~Poor Dengar3425. So behind the curve on Internet memes.This is why I was more than a little concerned at the news that the third episode of Sam & Max Season 2 would revolve around a zombie invasion. If there's been one constant throughout the surreal duo's recent return it's the stellar writing, and a willingness to venture in surreal directions. Precious few games are genuinely funny, and Sam & Max is a member of that elite club, so a zombie spoof sounded like a major step down in terms of inspiration, particularly following the inspired lunacy of Moai Better Blues.Thankfully, the Telltale writers have managed to harvest fresh material from otherwise barren soil. Yes, the story for this episode is kicked into action by a sudden global zombie infestation, but the walking dead swiftly become background characters in a cheerfully leftfield horror satire with loftier ambitions than the usual brain-munching punchlines. Though there are a few of those as well.Most of the ongoing criticisms of the series still hold water though, notably the miserly range of locations, and puzzles which find you shuttling between them rather too much. The new hint system, added for Season 2, remains a worthwhile addition, inserting nudges into the dialogue without being too blatant. It's most useful for those moments when you're looking for a solution in the wrong place entirely, with Max telling you where he'd rather be. It's less useful when it comes to the puzzles themselves, since it's almost always obvious what needs to be done. It's the ~how~ that tends to slow you down, especially in the instances where the answer is bizarrely oblique or (in one specific instance) on a plot point from Moai Better Blues. For those who missed that chapter, you'll have to click through a lot of in-jokes and background gags to find the clue you need.But with items and locations you can count on your fingers, you're never going to be stuck for long, and this is where Night of the Raving Dead's biggest failing lies. Assuming that most people playing this will be experienced point-and-click fans, and veterans of previous Sam & Max adventures to boot, this episode feels disappointingly predictable, at least as far as puzzles go. I'm no genius, but I'd pretty much guessed the way the game would play out, and which items would be needed when, by the halfway mark. Pertinent dialogue clues seem a touch too blatant, while there are few items that'll have you scratching your head as you figure out what they're for. This is partly due to the horror setting, which automatically has you expecting garlic, holy water and other tools, but reaching the end becomes more a question of watching everything fall into its expected place, rather than a delightful mystery.As always, though, Sam & Max are saved by their funny bones. While the puzzles are a tad thin this time out, the script is a cracker. The finale involves some clever twists on the formula, while the villain, Jurgen, provides plenty of ammunition for jabs at emo kids, Goths, clubbers and Eurotrash hipsters. There are also some wisely chosen appearances from recurring characters, and even a use - finally! - for Jesse James' hand. Resident Evil comes in for some sustained ribbing (have fun with that typewriter ribbon!) while one memorable set-piece finds our heroes taking the stage as goth-rap duo Count Cryptwind Deathgrasp and Baron Bat-Anguish Von Nightmare.Even when you're getting a bit tired of traipsing backwards and forwards for items, there's always something to make you smile.If you've not been won over by Sam & Max yet, this episode certainly won't change your mind. It's better than Ice Station Santa, yet not quite as good as Moai Better Blues. It remains small in both size and scope, while those who have stuck with the series since Season 1 will find that much of the actual gameplay is basic meat-and-potatoes fetch-questing. And yet...it's indecently cheap and, for all its minor flaws, the ongoing saga of Sam & Max is still the funniest game around. I've not laughed this much since Psychonauts, and that's not praise I dish out lightly. Let's just hope that the tricky balance between brain-busting puzzles and gut-busting jokes works itself out for the next chapter, Chariots of the Dogs."}