{"ref": "https://www.eurogamer.net/syphon-filter-dark-mirror-review", "date": "7 Feb 2008", "game_name": "Syphon Filter: Dark Mirror", "text": "It is the late 1990s, and the world is head over heels in love with the bold new world of interactive entertainment opened up by Sony's chunky grey biscuit, the new-fangled ~PlayStation~. Most notably, everyone is frothing at the parts about a Japanese game called Metal Gear Solid, a sequel to some obscure MSX game, in which you don't just run around shooting people, you sneak around. And then shoot people. Or break their neck. You can even hide under cardboard boxes! It is the best game ever and everyone loves it.As for me...yes, I admired Metal Gear as much as anyone, but the game I enjoyed more was Syphon Filter. Many thought me mad. Many probably still do. If Metal Gear was a blockbuster action movie directed by James Cameron, Syphon Filter was a direct-to-video Dolph Lundgren flick. What made it work was that it never felt like Syphon Filter was aiming any higher than that to begin with. It seemed quite comfortable with its B-list status and rather than trying to copy the more acclaimed and popular Metal Gear series (and later Splinter Cell) it was happy to deliver an engagingly corny story and just the right balance of tactical shooting and all-out run-and-gun nonsense.As console generations rolled onwards, I was always worried that Syphon Filter was going to cave in and become a me-too title, abandoning the broad action strokes in favour of yet more creeping and neck-snapping. This worry flared up something rotten when Dark Mirror was announced as a flagship game for the PSP, the series most high profile release yet. Thankfully the stealth elements remained minimal, while instantly gratifying firefights remained high on the agenda. And the same is true of the PS2 port, although rather than being improved by the leap between handheld and joypad the game has actually diminished in key areas.The complete absence of the multiplayer mode is a painful loss, for instance. The PS2 may not be as well equipped for online gaming as its new siblings, but there are still people out there using the old PlayStation Network who would appreciate the show of support. As the online play was one of the most praised aspects of the PSP release, having the whole lot chopped out immediately lessens this version by comparison.Also absent are some of the gorier moments, as well as Gabe's signature weapon - the taser. In the PSP version (and indeed every previous Syphon Filter game) this default defensive option was actually one of the most fun and versatile weapons to use. A quick jolt would be enough to disarm and disable an enemy, while keeping it held down would eventually make them burst into flames. Quite why Sony has suddenly decided that this is A Very Bad Thing is unclear, but the PS2 Dark Mirror features numerous other cuts and edits to scenes involving violence and nudity which suggests a general sanitisation of the game.Graphically it also suffers. What looked gorgeous and state of the art on the smaller PSP screen often looks crude when blown up to telly size, especially if your PS2 is wired up to an HD set. Characters have chunky sausage limbs, with visible joints, and the ragdoll physics - a rarity on the handheld - is nothing special here. More evidence of the make-do nature of the port can be found in things like the aiming, where hits sometimes seem to benefit from the larger damage radius of the PSP, which compensated perfectly for the less precise button controls. On a system with two analogue sticks, it means that often you just need to aim somewhere near the enemy to score a hit. Confusingly, sometimes the game veers the other way, and you'll find an enemy with a bulletproof skull, soaking up three headshots before keeling over.As a conversion of an acclaimed handheld game, Dark Mirror is a touch sloppy. It doesn't feel like much effort has been made to optimise the game for the PS2, either in looks or gameplay, and the omission of online play and crispy-fried taser fun will only annoy fans expecting a full conversion. And yet...I still kind of like it. Objectives are broken down into bite-sized chunks, there's plenty of variety in the things you need to do and the places you do them, and the combat mechanic is robust and blunt enough to keep you plugging away just for a laugh. It's as dumb as a sack of badgers, and noticeably rough around the edges, but that's always been part of the Syphon Filter charm. If you own a PSP, stick with that version. If you own a PS3, download the still-great original from the PlayStation Store. If your only option is the PS2 then this is still adequate entertainment. But only just."}