{"ref": "https://www.eurogamer.net/wipeout-pulse-review", "date": "7 Feb 2008", "game_name": "WipEout Pulse", "text": "According to those splendid websites that go around counting all the review scores, WipEout Pure is the second best game on the PSP. Ever. That's not bad for the seventh game in a clubby racing series that's definitely had its uppers and downers. Lucky number eight, due out for Christmas, remembers to drink lots of water and has a jolly old time too.At its core, it's still the same old WipEout: pilot your fragile ship around very fast courses over and over again until you know where all the boost pads are and you've worked out how to air-brake through the tight corners without scraping the sides. But thanks to a cleverly reworked single-player game, it's a lot easier to get on with.The campaign is split into a series of ~grids~, which are basically Blockbusters boards of hexagons, where each hexagon is an event. Every time you complete one, it unlocks the hexagons adjacent to it, giving you lots of options. Complete most of the events in a grid to a decent standard and you unlock the next grid. Can I have an 'E' please, Bob?Best of all, no two pills are the same [surely ~hexagons~? - Ed]. Some are races or race tournaments, where you tussle with seven AI opponents over a few laps, using power-ups like rockets, the new energy drainer or deadly mines to make things easier. Others are variations on time trials - there's one where you have to beat a cumulative time over several laps, while another is about setting an average lap time over seven.Then there's the old favourite from Pure, called Zone, where the colour scheme switches to a beautifully slick Tron world of whites and greys or reds and oranges and you have to try and stave off damage for as long as possible while your ship steadily accelerates from sub-Venom speeds to super-Phantom. Zone used to have its own specific tracks, but now it's part of the main game, reflecting its popularity.New to the mix is Elimination, which surprisingly isn't the age-old thing of the loser getting bumped off at the end of each lap, but a sort of race deathmatch, where power-ups are abundant but you can no longer use them to heal your ship, and the idea is to obliterate your fellow racers repeatedly until you reach a target number of kills.Initially a bit alarming and frustrating, Elimination actually grows to be rather good, and also serves the useful purpose of teaching you how best to use the power-ups, too. That's typical of WipEout though - a series that has you whimpering in the corner for hours and then snapping out of it and wondering why you were so depressed and nauseous and why is it morning and how did I end up in a police station?It's not shy about having you redo the same tracks over and over, and you shouldn't be shy about it either, because they're all very good. They have new bits too, like the Mag-Strips, which bind you to the track so you can do loops and go upside down (you can still steer), intensifying the feeling of speed and precariousness.After a while the game does clever things with them, too, like only putting a Mag-Strip on one half of the track, so you can either zoom over the top of a hill on strips or make yourself go flying up to a special shortcut route that's harder to race but has more boost arrows.Tracks are also full of tricky hairpins, chicanes and tight corners, forcing you to get on that air-brake, which allows you to pull round dangerous corners without easing off the accelerator. Learning not to scrape the sides is paramount, so it helps that the steering feels tighter than it was in Pure - especially on the elevated sections where they get rid of the guardrails."}