{"ref": "https://www.eurogamer.net/nights-journey-of-dreams-review", "date": "7 Feb 2008", "game_name": "NiGHTS: Journey of Dreams", "text": "Evidently something rather momentous happened in 1996, because despite starring a Ribena-suited flying jester of indiscernible gender orientation on a console struggling by that stage to hold the majority's attention, NiGHTS into Dreams won enough people over that its rebirth on a Nintendo console over a decade later wasn't just greeted with interest but outright jubilation. Even you lot got excited - one reader revealing he'd actually bought the original twice, and another threatening to boycott the medium entirely if SEGA cocked it up. Well, Journey of Dreams certainly isn't a cock-up, and while it's still a bit 1996 in places where it really shouldn't be, it's much too likeable to be cast aside completely.The premise remains simple, despite the attempts of a garrulous owl and a few dozen unremittingly dull cut-scenes to persuade you otherwise: playing as either of a pair of children sucked into a dream world and given the chance to ~dualise~ with the titular jester for a bit of flying around, you float along a predetermined two-dimensional path through bright, colourful 3D worlds, navigating hoops suspended in the air, hoovering up blue orbs to boost your score and chasing down birds with keys, circling various nightmaren creatures to expel them to a friendly dream garden you can visit from the level hub, and outwitting a series of boss characters who seem to be channelling a mixture of Tim Burton and CBeebies.Having brought the game to Wii exclusively, SEGA has inevitably introduced controls that take advantage of the Wiimote's unique magic wand antics, allowing you to manoeuvre NiGHTS by directing a reticule around most of the screen and holding A, but in practice this proves quite fiddly, so it's handy that the game also supports every alternative imaginable. You can hold the Wiimote sideways and use it like an old gamepad, plug in a Nunchuk and move around with the analogue stick (wiggling the remote occasionally to perform special moves and using its face buttons for other functions), or plug in a Classic or GameCube controller and play it much as you'd expect - with the added benefit of camera control on the second analogue stick during sections where you're controlling one of the children away from the purple flying jester lunatic.Whatever your preference, the game quickly establishes a routine of sending you through a three-stage chase sequence around the current dream world with a boss fight tacked on the end, following this up with other stages that involve circling imperilled friendly characters, rounding them up by riding NiGHTS like a boat down a river, or something similarly pattern-breaking, and then a final boss face-off against an enhanced version of the enemy from earlier. Each stage is timed, and ranks you at the end from A to E based on a mixture of speed and collectibles, while cut-scenes that elaborate on NiGHTS' origins, the back-stories of the kiddies and the machinations of the evil nightmaren intersperse the gameplay to give the experience some heft.Despite the repetition, it's surprisingly charming and moreish. Flying around Will or Helen's dreams is colourful and interesting, with basic side-on flight control switching to riding a roller coaster and bending your NiGHTS cart out of the path of rocks and into the rings that fill up the meter that governs when you can dash, or diving underwater for a bit of dolphin-form swimming, or spiralling up the outside of a giant carousel, and many more examples than it would be fair to list. Each transformation is seamless and the controls intuitively apparent, and the lure of secret levels through better grades encourages replay - something that you'd probably do whether you understood the incentive or not, as I didn't until it announced itself. NiGHTS' inherent abilities - drawing a circle in stars to capture items and dispatch enemies, and drill-dashing to bust things apart or gather speed - are certainly basic, but the developer makes the most of them, particularly in boss fights, some of which are actually quite enjoyable.There are dull moments, including some ill-judged third-person platform puzzling with Will and Helen, and the frame-rate is noticeably inconsistent in our review code, but there's a lovable innocence and purity of vision about the game's configuration that echoes SEGA's best arcade experiences. It's similarly slight, though, lasting only several hours for each character, although it does present myriad opportunities to repeat yourself for actual gain - or for the sheer fun of playing. Multiplayer is a bit bland - racing and hurling things at each other - but the inclusion of a dream garden where your circled conquests trot around happily, which integrates (rather cursorily) with the Wii Weather Channel, is another example of the game's warmth and personality. Whether by design or accident, it's hopelessly friendly.Where this is not true is in some of its more archaic rituals - booting you back to the beginning of the stage preceding a boss fight when you fail (and given the obliqueness of certain boss encounters, this is particularly concerning), and the owl's bizarre habit of telling you what to do even though you'd rather work it out yourself. My advice is to ignore him, and to try and ignore the more frustrating elements of its composition. And the wretched dialogue and voice acting, which is best misinterpreted, for giggles, as a mixture of grooming and inappropriate touching.Providing you can overlook a few of the aforementioned quirks, and providing you're not so cynical that a big-hearted game can't win you over, there's a lot to like here. A short run-time and some middling levels used to pad out each of Nightopia's dream environments probably did the most to wear down my goodwill toward it, but there was nothing fatally dispiriting about the experience and ultimately it has more to fuel the player's affection than not, like skyscrapers bursting into balloons. More of that, game developers. Indeed, if SEGA can adopt the principles employed here to reinvigorate a few of its other declining character-driven properties, it won't just be the publisher's increasingly savvy acquisitions and collaborations that drive strength back into its portfolio, it will be the very things that made it such a celebrated name in the first place. A good game, and definitely worth considering."}