{"ref": "https://www.eurogamer.net/pixeljunk-monsters-review", "date": "7 Feb 2008", "game_name": "PixelJunk Monsters", "text": "You might be inclined to take one glance at PixelJunk Monsters and mutter something glib about it looking like it belongs in 1992 and move onto something altogether more alluring. Funnily enough, it also plays a bit like some forgotten 16-bit gem from the same era, based around the simple concept of defending a forest's timid population from a variety of encroaching nasties. Think of it as Space Invaders meets Dune 2.Designed as a direct attempt to get Japanese gamers into real-time strategy games, it all works rather nicely. Set on a single screen and viewed from a fixed isometric viewpoint, a typical level in PixelJunk Monsters tasks you with controlling a nameless little guy whose job it is to defend the base from ten waves of differing enemies. These remorseless foes snake inexorably towards your frightened populace in single file, and the basic plan is to kill them before they can. But because the scurrying little creature you control can't shoot or fight, you must strategically position defence emplacements on any tree on the map and take the fight to them.Intuitively, you run your man over to a tree of your choice, press the X button, cycle through the weapon wheel, and select the one you feel is most appropriate. To begin with you have the option to place basic arrow or cannon units, both of which are good at dealing with ground-based enemies but rather feeble and slow in isolation. The key is always strategic placement and strength in numbers - each weapon has its own radius of fire (itself denoted via an oval outline on the screen), so the best plan is to try and memorise the path the enemy takes and set up your units accordingly.Like a typical RTS, each enemy unit, be it a spider, bird, lumbering giant or angry tribesman, has its own health bar, and as they snake their way towards your base, your defence units will slowly chip away at their energy until they explode in a shower of coins or gems. Predictably, coins act as the currency of the game, and while you often start levels with some currency in reserve, you'll soon realise that you need to build as many defence units as possible before too many of your men get gobbled up. Soon enough, PixelJunk Monsters becomes as much about strategic unit placement as running around frantically gathering up currency...and light-blue-coloured gems. The latter are also vitally important, as they can be spent on unlocking entirely new types of defence unit, or upgrading the ones that you've placed. Bizarrely, if you stand next to a unit, your man starts dancing around, which also has the effect of slowly upgrading any given defence unit. Takes all sorts. Initially the game seems quite sedate, simple, and designed to be accessible and fun without necessarily being too tough. The crisp, SNES-esque character designs and simple environments give the impression of a casual game, dare we say it, for kids. But sure enough, the game shows its teeth and claws sooner rather than later, and the challenge ramps up in no time - to the extent that even the latter levels on Easy took four or five concerted attempts to plough through.The nature of the beast, though, is that PixelJunk Monsters relies very much on trial and error, with the emphasis on error. It's not until you actually know which type of enemy is coming in the next wave, and which direction it's going before you can place your units. Thing is, success largely depends on getting the jump on the bad guys and being able to set things up in advance of them stomping on through - and that's where a certain amount of frustration starts to creep in. It's not until you've played each level a few times that you have any realistic chance of success, and going into each new level knowing you're going to screw up a few times is a little irritating.One of the unexpected charms of the game is the two-player co-op mode, where both of you have your own currency to spend as you see fit, but can share gems/research. If anything, the game works even better as a multiplayer game, with one of you stationed near the entrance point, and the other keeping guard near the base. Played solo, you're often caught out by your inability to reach parts of the map quick enough, so although you could argue that the game's slightly more challenging solo, it's also less frustrating in co-op, so you takes your choices. The added competitive edge of each having your own score is a nice touch, too.That said, PixelJunk Monsters is undoubtedly an engaging addition to the increasingly fertile PSN range when played at a leisurely pace. For the sake of a few quid, you can't really go wrong. 20 levels might not sound like a lot, but this is one that will keep you going for ages, and with a highly entertaining co-op mode thrown in and online high-score tables, it's yet another PSN title worth checking out."}