{"ref": "https://www.eurogamer.net/twisted-metal-head-on-extra-twisted-edition-review", "date": "5 Feb 2008", "game_name": "Twisted Metal: Head On - Extra Twisted Edition", "text": "Believe it or not, the longest-running PlayStation-exclusive franchise is not Gran Turismo, Ape Escape or even Hot Shots Golf. It's Twisted Metal. It debuted when the original PlayStation launched in 1995.For those of you keeping score at home, there were five iterations for the PSone and one for the PS2. Not including the online version supplied to network adaptor purchasers, the series hasn't been seen on consoles since 2001. And even now, Twisted Metal: Head-On: Extra Twisted Edition for the PS2 is not a new game, but a conversion of the PSP title released in 2005.I've never been a fan of PSP-to-PS2 conversions. I understand why they are done from a financial standpoint - development costs are minimal, and the PS2's installed based is a lot larger than that of the PSP - but that doesn't mean I like them as a gamer. It makes little sense to take a portable game, which has been downgraded graphically and restricted in its control scheme, and put it out on a console which is obviously capable of much better. The only possible advantage to gamers - being able to play your favourite handheld games on a larger television set - recently became a moot point with the new slim model PSP's video output.That said, TM: HO: ETE - which, yes, does sound like a particularly avant-garde shampoo - is the first PSP-to-PS2 conversion that I would recommend unconditionally to fans of the series. The fast-paced gameplay is better suited to the PS2 than the PSP, and the new PS2 edition adds a host of extras that make it a better package. It also doesn't hurt that the game is being released at a bargain price (USD 19.99 in the States, where it's released this week).I am aware that we found the PSP game wanting in our 2005 review. The main complaints were poor controls, uninspired weapons and the use of health bars which lessened both the sense of risk and the sense of gain. While I didn't find the controls problematic, and don't see a difference between Twisted Metal and most first-person shooter deathmatches where the use of health and weapons are concerned, I thought the game lacked depth and would have scored it similarly. [Phew - Ed]So anyway, TM: HO: ETE includes the complete Head-On game, with a graphical upgrade and controls that take advantage of the PS2's dual analogue sticks and four shoulder buttons, two of which the PSP obviously lacks. Twisted Metal fans who don't own a PSP will appreciate the game on this basis alone. The ad hoc multiplayer mode has been removed, but in its place is a split-screen deathmatch or co-op mode. Good enough for me.Where TM: HO: ETE gets interesting is in the inclusion of ~lost~ levels from the unreleased Twisted Metal: Black sequel. It seems that Incognito was planning a game in which the battle arenas were interconnected by freeways. Four of those arenas are presented here, albeit without the freeway access. All of them fit the dark style of TM: Black, with environmental weapons, hidden areas, and lots of destructible items - Death Port is a large cargo ship, Suburban Terror is similar to the suburban areas of prior games but with a bowling alley and movie theater, Stadium Slaughter takes place in a monster truck arena and Carnival of Darkness adds thrill rides (but, alas, no Ferris wheel)."}