{"ref": "https://www.eurogamer.net/fire-emblem-radiant-dawn-review", "date": "30 Jan 2008", "game_name": "Fire Emblem: Radiant Dawn", "text": "It's become a bit fashionable in certain circles to make fun of the Wii, to the point where games can't really escape it. Present these people with a game that uses the Wii controls and they'll say it's newfangled, unnecessary nonsense. Present them with one that doesn't really bother, and they'll say that the Wii is just two GameCubes duct-taped together. Radiant Dawn is good news for people that can't get to grips with motion sensing - it doesn't use it at all. Not even one little wave or gesture.So the second criticism it is, then. It's more valid here than it is normally. Radiant Dawn is a direct sequel to the GameCube's Path of Radiance in every conceivable way. It looks and plays exactly the same, and given that Path of Radiance was pretty ropey-looking itself, that's hardly a compliment two years down the line. You can load up your old GameCube saved game on the Wii for character and stat bonuses, and many of Path of Radiance's characters make reappearances. Strategy-wise, it's still wonderful, employing an inspired set of weapons and magic triangles and character support, but story-wise it doesn't quite live up to the standards of its forebears, and the awful presentation is even more dispiriting now that we've seen what the Wii can actually do.You also find yourself taking control of some of your former enemies, the Daien, in a typical Fire Emblem corrupt and war-torn setting, as you assemble fighters for your little team of rebels. There is an enormous amount of content here - the story is split up into quarters, each of which covers the warring countries' efforts to recover and rebuild after the events of Path of Radiance from a different perspective. It's a good narrative structure, and keeps suspense going throughout, as well as splitting up the game's 45 different battles into rather more manageable chunks.As always, each of the game's characters is an individual, and should they fall in battle, they're gone forever, complicated back-story and all. More fastidious Fire Emblem fans will be familiar with restarting battles again and again in order to triumph without any casualties, whereas most players will find themselves making different choices about which characters are going to be sacrificed. Radiant Dawn's most significant addition is the ability to save mid-battle, stopping you from having to do the entire thing multiple times - or, alternatively, accidentally trapping yourself in a position from which there is no hope of victory.In terms of gameplay, tweaks are minor. You'll still control your lamentably fuzzy-looking units on a grid-based system in order to win battles, using swords against axes, axes against lances and lances against swords. You'll still earn experience, and promote your units to more powerful classes, and you'll still watch the story's events unfold in reams of text over still backdrops and cut-out characters.There are slight changes to weapons categories and weapon-forging is now unrestricted (so long as you can pay for it), and there are two magic triangles instead of one. It's as in-depth a fantasy strategy RPG as you could ever hope for, rewarding consideration and attention to detail with tangible bonuses - doggedly forging your warriors and watching their stories develop is as rewarding as ever, and accidentally getting someone trapped in a corner and killed through carelessness is just as affecting, especially as they're never coming back."}