{"ref": "https://www.eurogamer.net/r-psnrounduppt2-ps3", "date": "28 Jan 2008", "game_name": "Reviews", "text": "The PlayStation Network may not have hit the ground running, and the European updates are a sparse affair compared to our American and Asian cousins, but there's still much to praise. Quality over quantity seems to be the mantra, with few games troubling the lower regions of the score table, and the utterly reasonable price structure certainly helps in that regard. Pitched at the perfect ~impulse purchase~ pocket money level, even a forgettable mid-range offering can be bearable for the same price as a Happy Meal.And with that, let's bite into the second part of the dangerously hot apple pie that is our PlayStation Store PSone roundup. Part one lives over there.Popular upon its launch for the concept of actually encouraging you to smash up other racers, Reflections' debut PlayStation offering was an impressive calling card for both console and developer. Then best known for the pretty vacant Shadow of the Beast platform series on the Amiga, Destruction Derby realigned Reflections as the home of physics-based fender-crunching car action, niftily setting the scene for Driver three years later.It's not exactly generous in the options department - only a handful of cars and tracks, with little in the way of unlockables - but with twenty cars roaring around at the same time, battering each other into scrap, it's clear that variety was never going to be the game's main draw. For those who prefer straight racing, you can opt for Stock Car mode in which taking pole position is the key to victory, but most will understandably choose Destruction Derby mode. You still race around the same tracks but now earn points by inflicting damage on other cars. Wreckin' Racing is a combination of the two, with points for both position and damage caused.Much like its descendant, Flatout, the most fun can be had in the free-for-all festival of carnage that is The Bowl, where cars simply speed around an open arena and try to be the last one unwrecked. Making good on the promise of simple, accessible vehicular violence, even the chunky graphics and clunky AI can't take the shine off such an immediately appealing concept.Destruction Derby hasn't aged as well as I'd hoped - shrewd players will soon figure out the exploits to easily beat the CPU racers - but smashing cars never seems to get old. Certainly a game you'll be happy to have on your hard drive for those cathartic ten-minute gaming blasts.8/10Not, as you might think, a theme park game endorsed by briefly-famous posh rock combo Kula Shaker but a puzzle game in the rolling-a-ball-around sub-genre. In fact, it's pretty much a dead ringer for Marble Blast Ultra and Switchball on Xbox Live Arcade, only with less swanky physics to muck about with.My memory tells me (and Wikipedia reassures me) that it was also one of the first games to make use of that quaint old rumble feature. But who cares about Olde Worlde rubbish like that, eh?You roll a beach ball around a series of increasingly mind-bending aerial mazes, balancing along thin blocks, rolling around to the other side in order to reach new power-ups and items, before trundling to the exit. Hazards along the way threaten to burst or otherwise deflate your progress.There's also a two-player option, with a fairly bog standard time trial and the rather amusing Simon Says silliness of Copycat mode. That's pretty much it, but then simplicity in a puzzle game is usually a sign of greatness.Okay, it's not quite greatness in this case, but this is still a fine and oft-overlooked gem from the dustier corners of the PSone cupboard. For the price, it's well worth a look.7/10"}