{"ref": "https://www.eurogamer.net/geometry-wars-galaxies-review", "date": "14 Jan 2008", "game_name": "Geometry Wars: Galaxies", "text": "Like the DS version (and we certainly did like the DS version), Geometry Wars: Galaxies on Wii is a collection of 60 or so levels built around the controls and enemies used in classic Xbox Live Arcade game Geometry Wars: Retro Evolved - which is itself bundled in both the Wii and DS versions. In fact, the content's mostly the same. ~Galaxies~ mode, as it's called, changes things like level shapes, enemy spawn routines, enemy types (and there are lots of new ones), and more to give each of the 60-odd a distinctive feel. Also like the DS version, Galaxies on Wii proposes an alternative to dual analogue stick control - which is just as well because the Wiimote doesn't have any analogue sticks and the Nunchuk only has one.So what's Geometry Wars then? Good point, suspiciously well-informed and photogenic grandma interviewed about Wii in a national newspaper! It's a shoot-'em-up where you move around shooting things that are coming for you until you run out of lives. Your goal is to get a high score - on the Wii, that score may then be worth a bronze, silver or gold medal. You don't even have to stand up to play it, really, which must be a relief after all those photo-calls.If you stick to the Wiimote and Nunchuk scheme, you will be using the latter's single stick to move your little spaceship around, and pointing at the screen with the Wiimote to tell it which way to fire. There you'll see a red line emanating from your ship to wherever you're pointing, with an aiming reticule positioned somewhere along it to illustrate exactly where you're pointing. Hold A to fire, hit Z to smartbomb, clearing the screen for a bit of respite. It takes getting used to (well, holding A doesn't), but then so do computer and videogame control schemes in general. Remember when you were crap at WSAD? Again like the DS version, however, your effectiveness will be diminished if you're a southpaw. Unless you're a twisted mutant southpaw like me who writes with his left hand and plays tennis, points and 'other's with the right. Watch out for that.Or rather, don't, because again there is another option, although this time you will have to invest in a Classic Controller for the privilege of selecting it. If you do, you can resort to the more traditional two-stick control scheme of moving with left and firing with right. And it's here that - not unlike the DS version, in hindsight - Kuju's otherwise-clever adaptation of Bizarre Creations' celebrated original develops a potentially uncomfortable split personality.Problem is, this is a high-scores game. Excellently, both the DS and Wii versions can upload those high scores - for Retro Evolved and any of the individual Galaxies levels - to Nintendo Wi-Fi Connection so you can compare them with people whose 694-digit code you've miraculously managed to write down correctly and then bothered to program in. However, people using the Classic Controller will fare better for the simple reason that they can easily point and move in the same direction. Sorry to keep going on about this in everything I ever write, but it's vitally important - and both of the analogue sticks on the Classic Controller have their movement curtailed by an octagonal boundary that lets you point exactly left, right, up, down and at each diagonal. The only way you'll achieve this with the Wiimote is using a spirit level.Then again, if you're not playing it specifically to rack up high-scores, but just to beat the gold medal score for each level, then you're fine. Galaxies has an excellent system of progression - as you play you collect ~geoms~ which go toward unlocking new levels and new behaviours for your little pet sentry spaceship remora thing (drone, apparently - just looked it up). You collect geoms whether you beat your old high score or not, so progress is tangible for any time investment, providing you don't quit out in anger. What's more, the individual levels - although they're not always brilliant - are varied and numerous enough to keep your interest, and the absence of the DS version's slowdown means that you rarely reach the insurmountable comfort zones you sometimes did in the helpfully sluggish handheld incarnation. It also doesn't slow down despite looking very pretty - indeed, the Wii's little ATI graphics chip can afford to puff out its chest a bit now that the Xbox 360's undulating background graphics have returned.One slight downside is that multiplayer has to happen on the same screen. On the DS, some of the individual modes were outstanding - especially Versus mode, where one player controls enemy deployment while the other tries to survive. On Wii, any measurable difference in skill will mean less success in single-screen competitive and co-operative play, despite the laudable option to play through a few of the Galaxies mode star systems together. It's also a shame that you can't use the GameCube controller, because the Classic Controller is still 15 quid and not everybody has one.Forgive them, though, because Galaxies is still very likable, with tons to do and a well-designed new control system for people who aren't busy forming high-score cults. And if you've never played Geometry Wars before anyway, the inclusion of Retro Evolved - a bit easier thanks to the Classic Controller design, but no less brilliant on account of it - is a splendid extra. With the DS game retailing for GBP 19.99 and the Wii one for a fiver more, you should certainly buy one or other. Having played them both, I'd make it this one, but only just."}