{"ref": "https://www.eurogamer.net/yggdra-union-review", "date": "8 Jan 2008", "game_name": "Reviews", "text": "~War is an ugly thing,~ said some guy off the Internet called John Stuart Mill once. He could have been talking about Yggdra Union (which, you may be interested to know, is apparently pronounced ‘yugudora yunion’ according to the spelling on the Japanese box). The best thing about the best turn-based strategy games is that they reduce the messy chaos of the battlefield to a series of uncomplicated elements; a series of building blocks out of which tactical and strategic complexities emerge, simply and without fuss. Fire Emblem, Advance Wars, Disgaea, Civilization, X-COM, Final Fantasy Tactics - they hook you with their accessibility and then reel you in with their intricacy in a really good way.The worst thing about Yggdra Union is that it is unnecessarily impenetrable, ingesting the messy chaos of the battlefield and then puking it back up with crazy, histrionic graphics and weirdly unintuitive game rules that make very little sense. Ostensibly, the game is quite pretty, with attractive anime-style character art and all that, but actually, once it’s moving, the densely-packed hubbub of stats, gauges, icons, shrieking slashes and scratchy text-balloons end up obscuring the action instead of enhancing it. Meanwhile, the stark, characterless battlefields have none of the austere charms that characterise, say, the Fire Emblem series. More confusing than the pictures, though, are the game rules. Once you’ve made it through the boring bouts of plot-exposition via talking heads (fleeing princess, ragtag band of saviours, evil empire, blah, blah, yawn, yawn, etc.), you choose a number of cards to take into battle. You then choose one of these cards during each turn of the ensuing battle, and it determines how many squares your units can move, how powerful their attacks will be, and if any of them can use any special skills during that turn. That bit’s actually pretty basic (although made more complicated by the over-elaborate menu graphics). It starts hurting your head when you get to the rules of forming ‘unions’, and that’s because these rules turn the game into more of a puzzle game than a strategy game, with the battlefield having become so abstracted that much of what follows feels counter-intuitive. Unions are what happens when you choose to enter combat, which you can do once per turn. Any other units standing around your lead attacker in diagonally adjacent squares (if your lead attacker is male), or vertically and horizontally adjacent squares (if your lead attacker is female) will also join in. And the same rules apply to your opponents. It gets confusing because it’s difficult to track which of your units will end up attacking which enemy units, and it gets boring because the combat is semi-interactive, which means that it can’t be skipped, even though you can potentially have to sit through 18 separate encounters, each with their own outcome screen. It’s also annoying that units are eliminated from the map when their morale has been sapped, but sometimes they’ll still hang around till the end of combat to attack other members of your union (it’s even more annoying that it’s difficult to replenish the morale of your units, even between chapters).Which isn’t to say that the game doesn’t redeem itself at all. What John Stuart Mill actually said is this: ~War is an ugly thing, but not the ugliest of things.~ Again, he could be talking about Yggdra Union. It is a turn-based strategy game, after all, and, by and large, that’s a pretty good thing. It does get some of the basics right, like the paper-scissors-stone-style weapon tree, and a fairly interesting roster of unit types, and while it’s frequently confusing and difficult to work out what’s going on, it’s not actually a terribly challenging game - which means that it’s easy to find yourself zoning out and settling in to an easily-paced distraction.Indeed, if you can get your eyes past the epilepsy-inducing menus, and your head round the aneurism-inducing unions, there is a decent game struggling to break free of its gratuitously obfuscated difficulty curve. It’s just that, with so many other excellent examples of the genre available to play and play again, it’s difficult to know why you’d want to unless you were really desperate for some sort of turn-based strategy fix between busting open all the battle maps in Advance Wars, or replying all the routes in Fire Emblem. So yes, certainly not the ugliest of things. But not entirely worth fighting for, either."}