{"ref": "https://www.eurogamer.net/titan-quest-review-not-all-switch-ports-are-created-equal", "date": "2 Aug 2018", "game_name": "Titan Quest", "text": "Titan Quest is often mentioned in the same breath as Diablo, as though a long but monstrously tough rope binds them together. I'm not sure who this annoys most - Titan Quest's creators Iron Lore or even Diablo creator Blizzard itself - but suffice to say, 12 years after the isometric action role-playing game was originally released, I'm doing it, too. Sorry about that.At the time of its 2006 release, Titan Quest set out to fill the aching ARPG hole left by six years of no-Diablo-3, which arguably it did do, albeit to varying levels of success. Thing is, a Diablo-clone is only ever going to be exactly that: a clone. Whilst it indisputably helped fans of the genre scratch a sorely neglected itch, it couldn't quite deliver the depth nor detail of Blizzard's seminal franchise.That didn't stop it getting the re-release treatment, though. In 2016 - to celebrate its 10th anniversary - we were treated to the snappily-titled Anniversary Edition, then mobile ports, and earlier this year THQ Nordic brought it all to console for the first time, too. Though it released to a chiefly tepid reception, even that didn't stop the publisher doing what the other cool kids are doing: porting to Nintendo Switch.Unravelling across ancient Greece, Asia, and Egypt, your story - the tale of an anonymous, voiceless nobody with nowt but a knife and a pretty choose-your-own-colour tunic to your name - sees you make your way across the world, trying to keep those pesky Titans at bay. Whilst loosely based on those classic Grecian tales your grandparents used to watch on a Sunday afternoon, Titan Quest doesn't quite capitalise on the sweeping majesty of its legacy, but the world it paints is bright and beautiful to this day, with plenty of craggy caverns, stunning shores, and sleepy hamlets to explore. The cast, if a tad forgettable, are fully-voiced and fully-realised, adding an authentic gloss to your encounters.You already know how the thing works though, right? As our original Eurogamer review summarised at the time, ~it's one of those games~. You make your way across the world, either alone or with a pal or two in tow (there's split-screen co-op, and online multiplayer, but empty servers means I was sadly unable to test the latter), and you'll regularly bump into ill-tempered beasts in the shape of recognisable fauna - boars and crows (oh, how I hate those crows) - and others - Centaurs, Satyrs, and Harpies - drawn from the mythos. As their lifeless carcasses fall to the floor, some will drop luscious loot, and all will grant you the crucial XP you need to beef up, level up, and take on the even tougher brutes.It's a cyclical ebb and flow of exploration and combat that's immensely satisfying. While at first you'll frequently feel underpowered and overwhelmed - Titan Quest is a slow burn, and progress is steady and sedate - eventually you'll fall into a natural rhythm that toughens your resolve and entices you into areas you may have previously found too precarious. The constant trickle of XP means you'll be able to regularly revisit your skill tree, and looting is both delightful and dirisory is equal measures. While you'll forever find yourself adoring a breastplate that you won't be able to equip for hours - not to mention endlessly chucking out crude weapons you've already owned, and discarded, six hundred times before - the RPG hook's a deep one, and thanks to several side missions that accompany your main quest, there's plenty of rewards for those prepared to look - and fight - for them.Though the developer insists the game's been refined by ~countless~ patches - including ~ten years' worth of community fixes~, as well as a ~tailor made UI and controls for a perfect ARPG experience using a gamepad~ - many of the complaints that dogged the console port persist here, too. It certainly doesn't feel as though the UI has been redesigned, which means anything that requires precision - from targeting attacks to collecting loot - is clumsy and ineffective. Whilst one-on-one it's never too detrimental, find yourself swarmed by enemies - which will happen all the time, of course - and often the auto-targeting system settles on an enemy 30 feet away without registering the bastard currently hammering at your head. You can design, and quickly switch between, two combat loadouts - a fabulous feature given you'll frequently shift between long- and close-range fights - and knock back potions to speed up your regenerating health, but in the heat of the scrum, it's easy to lose not just your enemy but also your own avatar.And everything's so, so much worse should you attempt to play undocked. Even those kicking back to play on a 42-inch TV are going to struggle to read the text and manage their inventory. Undocked - which squeezes Titan Quest's huge world and dire interface into Switch's 6-inch screen - it's nigh on impossible. Things you take for granted on a big monitor or television - like your health bar, for example - are more difficult to track in battle (and without any visual or haptic feedback beyond the occasional grunt, my wannabe Spartan succumbed to her injuries far more than I'd like to admit). The map - both mini and full - is curiously unhelpful, its markers difficult to discern regardless of what screen you're using.Whilst the Joy-Cons are perfunctory at best, the clumsy control scheme is easier to manage with a Pro Controller, but even then, I found myself accidentally purging the wrong loot, or unnecessarily wasting potions. And the inventory menu is criminally small, not to mention almost entirely unexplained - and there's just too much vying for space in that tiny screen to work it out for yourself in lieu of a basic tutorial.In essence, Titan Quest on Nintendo Switch looks and plays every bit like the 2006 original. While this might be exactly what some fans hope to hear, for others it may feel as though not enough's been done to reimagine this classic ARG for a 2018 audience playing on the go - all of which sadly makes it one of the Switch's more disappointing ports to date."}