{"ref": "https://www.eurogamer.net/mario-party-ds-review", "date": "8 Jan 2008", "game_name": "Mario Party DS", "text": "No one would suggest reviewing games is ever as unpleasant as working in a coal mine or an abattoir or a Wetherspoons, but there are still days you want to have a little cry. Days when you've got to review your fifth mini-game collection in as many weeks. Days when the press release for the game includes the word ~whimsical~ and the phrase ~crazier than ever~ (twice). Days when the game says ~Mario Party~ on the box.Being a Professional, and because you're paid to, you put your misery and prejudice aside. Maybe this one will be different, you think. It's on DS, for starters, so there's plenty of potential for fun new touch-screen-based mini-games. Maybe they'll finally have rejigged the stupid board system. And you'll be able to play against real people via Wi-Fi Connection, more than likely, so for once you won't need friends round to enjoy Mario Party. Wrong, wrong, wrong.For those who aren't familiar, the Mario Party games see up to four players taking it in turns to roll a die and move round a game board. Many of the squares on the board have different effects, such as giving the player who lands on them bonus coins or transporting them to another square. You get the opportunity to earn coins by winning mini-games. When you land on a star square you can buy the star if you have enough coins. The overall winner is the player who has collected the most stars during the course of the game. It's the same set-up in Mario Party DS. This is a shame because it's a flawed and unfair system, particularly if you're playing solo. It's astonishing how often the other characters manage to land on the star squares. Far too frequently, new stars spawn just a few spaces away from them. Meanwhile, you'll often be within a space or two from a star when you're magically transported to the other side of the board. If you do somehow manage to get hold of a star, it's unlikely you'll hold onto it for long before another character gets a power-up which takes it off you. The star system makes it almost impossible to win a single-player game, even if you're victorious in all the mini-games. But of course, Mario Party is not sold on the promise of a fulfilling single-player experience. It's more fun with friends, the more friends the better. So it's surprising to learn there isn't an online mode in Mario Party DS. You'd think it would be an ideal fit. If you can play Mario Kart DS online, why not Mario Party?At least there are plenty of offline multiplayer options. You can set up traditional board-based tournaments with up to four players, go for mini-games only, play puzzle games or choose games specially designed for two players. Best of all, you only need one copy of the game to do all this. Up to four players can share pretty much everything Mario Party DS has to offer by wirelessly downloading from a single game card. Which would be great, except Mario Party DS doesn't offer an awful lot of fun. There are more than 70 mini-games and they use a variety of control systems, from the stylus to the d-pad to the microphone. But too many of them are too simplistic, over too quickly or simply too dull to be enjoyable. If you're playing the board game (necessary to unlock mini-games in Free Play mode), it seems that for every minute of mini-game play you must sit through five minutes of boring turn-taking. Penalty squares, power-ups and the like only serve to slow the pace even further. To be fair the game is nicely presented, with big bold graphics and all our old friends present and correct. The story goes that Bowser has shrunk Mario, Luigi, Peach etc. down in size, so there's a Micro Machines-style theme where everyday objects are huge by comparison and play key roles in the mini-games. There are also some nice extras in the form of six puzzle games. Five of these featured in previous Mario Party games while Triangle Twisters is brand new. All of the puzzle games are entertaining enough to while away half an hour or so. If you're on your own, they're certainly more fun than playing the tedious board game. They're all derivative of other puzzle games, but none are quite as addictive as the originals so their appeal doesn't last too long. Decent visuals and bonus puzzle games aren't enough to make Mario Party DS worth a purchase. It suffers from the same problems as the other games in the series. The mini-games, on the whole, are badly designed and boring. Watching other players take turns round the board is tedious. Even if you win every single mini-game, the stupid star system means you could still lose overall.It would seem there are plenty of gamers who are happy to put up with all this, however - after all, Nintendo wouldn't keep churning out Mario Parties if people didn't keep buying them. If you're one of those who has enjoyed the series on console, you'll enjoy it on DS. Otherwise, steer clear."}