{"ref": "https://www.eurogamer.net/warhammer-40-000-squad-command-review", "date": "8 Jan 2008", "game_name": "Warhammer 40,000: Squad Command", "text": "ONLY WAR. Man, I never get tired of saying that. There's something inherently hilarious about Warhammer 40,000's knowingly twisted take on masculinity. ~In the grim darkness of the future there is only war.~ ONLY WAR. Now that's selling your idea in a single sentence. No love. No talk. No morality. No nice sit down and a cup of tea. ONLY WAR. This strategy title for PSP is the first 40K game in a while to truly approach the purity of that concept. There's no base-building here. No capturing resource points or researching upgrades. ONLY WAR. Turn-based war, happily free of ugly hexes and grids but still based on action points, terrain and distance. The X-COM games on PC are the best reference, and this is one of the better takes on that model in a while. One that's broken in several odd ways, yes, but it works.It's not tabletop Warhammer 40,000, but there's a lot of it in here - and most importantly it nails some of the measured tactical planning that was sorely absent from the go!go!go! real-time action of Dawn of War, the PC RTS that's oft-considered the best 40K videogame yet. With only six units on hand, each one is of colossal importance. You lose even one, and your odds of winning decline sharply. Like snooker, where you're placed at the end of your turn is as important as what you actually achieve in it. So you've got a bead on that Chaos Terminator, and just enough action points to take him down. But if you do, you'll leave your Space Marine standing in the open, easy prey for the bad guys inevitably lurking just beyond your line of sight once their turn begins. Take a risk or play it safe. It always comes down to that. Once in a while you'll need to play chicken, deliberately sending a man into harm's way to lure out an enemy that's sitting and waiting. And it's horrible. You're probably killing him by doing it, but in doing so you earn the little red dot that reveals your foe's location to the rest of your team. Go get him. Vengeance for the fallen.Even playing it safe carries massive risk. Every scrap of scenery (with the exception of the ground) is impressively destructible. Leave one of your squad crouched behind a wall but still within vision range of enemies, and if they've got suitable firepower they'll tear down that wall, rather than spend precious action points ambling around it. Your man will be hit by splash damage - or killed outright if he's stood near anything combustible - and then he'll find himself in plain sight, his final moments spent in an awkward squat, trying pathetically to hide behind something that isn't there. Remember that bit in Jurassic Park where that guy gets eaten by a dino whilst sat on the toilet? Yeah, like that.Of course, you can do the same yourself, which adds an appealing extra layer of strategy. Spend a few action points to run over to the left, and you've got a clear shot at one guy. Alternatively, throw everything you've got at that cluster of explosive barrels nearby, and there's a chance the resulting boomtime will take out three bads at once. If it doesn't, then all you've done is clear their bullets a direct path to your chap's face. Oops. As the campaign wears on, you'll be gifted new units - there's less than ten types in all, but each gets new weapons to play with too. There's a genuine, geeky thrill to getting your hands on the new stuff. And not just for those with half-remembered memories of those million pages of 40K backstory. Each is a new toy, palpably meaner than the last one, and it's hard not be excited about taking it for a test-drive. Upon upgrading from lightly-armoured Scouts to skull-faced Space Marines, it feels like you've graduated. Later, the Dreadnought is a suitably big'n'stompy robot that can smash through buildings. The Land Raider is a tank the size of twenty Marines, and can fire a twin laser beam across the length of the map. The Grey Knight Terminators are introduced in a Gears of War/Armageddon slo-mo cutscene that can't help but make you think ~Goodness. So that's what a real man looks like.~  Speaking of those cinematics, they're surprisingly well-done for such a small-feeling game. They're one of the better realisations of 40K's hilariously excessive darkness that I've seen, all CGI clips of fiery death and pensive man-monsters. An unseen Space Marine narrator intones the (admittedly slight and unfocused) tale of human Imperium versus mutant forces of Chaos with a morally-dubious gravitas Gears of War's Dom and Marcus would surely give up their giant shoulders to have. Unfortunately, though Squad Command gets the concept right, it struggles with the details. There's very little variety - the levels look near-identical, and once you've killed one Chaos Terminator you've killed them all. Give me Orks, give me Tyranids, give me... nothing until the inevitable sequel-come-mission disc, no doubt. Bah. There's a sense that the game's so concentrated on being tight and compact  - portable-friendly, in other words -  that it's thrown a lot of characterful babies out with the otherwise extraneous bathwater. It keeps its challenge up enough for this not to matter hugely in practice, but it rankles all the more because of the harshly limitations on what you can get up to between missions. While you can fanny around with the weapon load-out (one Marine might tote a costly-to-fire rocketlauncher, while another might have a cheap, melee only sidearm) You've no choice of who you take into a mission. I don't want the poxy Dreadnought again. I want another bloody Land Raider. With such little choice between fights, the missions can feel disconnected and purposeless. You're also stuck with the blandly blue-hued Ultramarines throughout the campaign, with a couple more Imperial colourschemes and the option to play as one of three similar, but with more spikes, Chaos forces in multiplayer. Personally, the armypainter was the first place I went to in Dawn of War, so I mourn for the lack of something similar here. There's a hollowness to your squad, too - all the same faces, no names, no sense that any of them are the same guys you waded through the foul blood of warpspawn with in the last three battles. A Cannon Fodder-esque veterancy system would make all the difference - even if there's no actual stat boost, just a rank insignia and a name would help you form an attachment to these guys. Yes, purists, that isn't how it works in tabletop 40K (where there is, after all, ONLY WAR), but you nevertheless know and feel affection for your miniatures. You feel a pang when that one's killed, perhaps because you're proud of the paintwork on his shoes, or it was the one you traded for two Bloodletters with missing tongues that time. The missions themselves aren't quite the tactical joys they could be, as a result of a frustratingly fixed isometric camera. Most of the time you can see what's going on, but once in a while an enemy will be hidden behind opaque scenery, forcing you to randomly wander the D-pad over the rough area he's in until your cursor turns red, letting you know there's a target underneath it. The thumbstick tilts the camera, but by such a pointlessly minute degree that you'll never bother using it. Your enemy doesn't suffer such problems, able to aim through windows you can't even tell are there. They've generally got unnatural prescience (though in fairness, they are demon-warped mutants from beyond space and time) - as soon as they enter sight range, you enter theirs, and they'll from then on know exactly where you are no matter how far you run away. They can disappear from your sight range, but not you from theirs. So long as you're careful to push forward gradually, thus not letting every foe know you're there, you'll generally be OK, but there's a few missions that must be completed within or you have to survive for a set number of turns. Psychic badguys are a problem here, hounding you across the map even though they shouldn't, by rights, know where you are. ONLY WAR. But war can be so mean.So, there's a certain Is This It? to Squad Command. It could and should achieve so much more - but frankly it achieves enough by making a specialist subject matter and a specialist genre as fun and accessible as it does. Its twenty-minute missions and simple controls suit travel gaming well, and the online multiplayer gives it replay value the campaign doesn't bother with. Only war? Yep, and that'll do."}