{"ref": "https://www.eurogamer.net/rayman-raving-rabbids-2-review", "date": "4 Jan 2008", "game_name": "Rayman Raving Rabbids 2", "text": "Earlier this year, Ubisoft threw a special event in Paris to show off its new games. These included Rayman Raving Rabbids 2, the sequel to one of the Wii's more successful launch titles. The Ubidays press conference climaxed with some real live rabbits being thrust onto the stage to mark the game's announcement. Actually thrust, as in you could see human hands pushing the rabbits back if they attempted to crawl off the stage. One bold bunny did venture downstage towards the audience where it proceeded to pop out a series of pellets. Yves Guillemot was still rattling away in the background but all attention was now focused on the rabbit and his home-made Maltesers. It was like watching a best man trying to do a speech while the bride does a wee on the wedding cake.  This was undoubtedly the highlight of Ubidays. (For some of us, anyway. There was that time I came out of a cubicle in the ladies' and realised I'd just urinated in tandem with Jade Raymond, but Tom was more excited about that than anyone. Yes, she does wash her hands.) It was also, unfortunately, funnier and more entertaining than anything in Rayman Raving Rabbids 2. Like the first title, it's a collection of mini-games for up to four players. There's very little sign of Rayman himself - the real stars are the rabbids, crazed bunnies with googly eyes and gap teeth and voices like asthmatic cats being scraped down a blackboard. In this new instalment you can unlock accessories and costumes for them by winning the mini-games, which while not exciting is quite nice. RRR2's other new features include the option to compare your top scores via Wi-Fi Connection. It's not exactly Xbox Live but at least there's a sense of something to aim for if you're playing solo. Which isn't advisable - like all mini-game collections, this game is more fun the more players take part. Playing alone is missing the point. RRR2's solo mode does improve over the previous game by doing away with the tedious colosseum set-up. Now you visit various continents where you play a series of themed mini-games in one go without all the faffing in between. This greatly improves the pace of the single player mode, but it's still unlikely you'll play it more than once.  You won't have to, thankfully. Although you still have to play through lots of the mini-games to unlock them on the main menu, you can now do this with a partner. It's a much more sensible option than being forced to play the whole thing solo and one, you may recall,  we wish SEGA and Nintendo had taken for Mario and Sonic at the Olympics. The real attraction of RRR2 is the new collection of mini-games. Or at least it should be. You always expect to find a few duff ones in collections like this, but Rayman Raving Rabbids 2 has more low points than highs. The highs include the shooting ranges. If you didn't play the first game, think Time Crisis with less terrorists and more bunnies and sink plungers. You use the remote like a light gun to fire the latter at the former. The backgrounds are now real-world environments captured on video, which is weird but works, and the whole thing is fast-paced and fun.  The music-based games have also been developed for the sequel. In a nod to Rock Band, now you can choose to play guitar, keyboard or drums or sing into a microphone. Except whichever you choose you just end up shaking the remote and nunchuk according to the instructions on-screen. Songs are performed by rabbids rather than the original artists. It's entertaining if you can bear their squawking for the entire length of a track, especially if there are four of you playing along. Other highlights include the mini-game where you have to eat chillis and then burp out fire to roast chickens. The American football game, where you have to hang onto the ball for as long as possible without being tackled, is also good. And there are some nice games based around balancing the remote which are brilliant in multiplayer - there's much fun to be had knocking each other over. However, too many of the mini-games are built around the 'shake the remote as hard as you can' mechanic. They're very simplistic and don't require any real skill at all. You'd hope Ubisoft would have come up with some new, innovative ideas for using the remote and nunchuk for RRR2. Instead it feels like you're playing too many of the games from the first title with different graphics slapped on top, and there's far too much remote-shaking in the mix. Some mini-games are just boring, like the ones where you have to play hide-and-seek with an office boss or cinema manager. Scoring points in these is far too mundane. Also dull is the Usual Suspects mini-game, where you watch a short clip of a bunny committing a crime and must then pick him out of a line-up. It's too easy and it goes on too long. There are plenty more mini-games which just don't quite work, either because the control system isn't good enough or they're fundamentally dull to play. Just as with the first RRR, all the mini-games are bursting with wackiness and zaniness. They're preceded with cutscenes which show the rabbids getting up to all kinds of antics and are about as funny and sophisticated as You've Been Framed. When it was presented by Jonathan Wilkes. There are lots of unhilarious references to pop culture - for example, one mini-game parodies the podrace from The Phantom Menace. It is called Fart Wars. If you didn't enjoy or just weren't interested in the first Rayman Raving Rabbids game, the second is not going to change your perspective. Some of the new mini-games are entertaining, but too many are too similar to those in the first title. In addition, too many are based around simply shaking the remote. There are much better mini-game collections out there - such as Mario and Sonic, unlocking nonsense and all. But if you loved the wacky humour, range of mini-games and stupid rabbits in RRR, you'll like this. There's still an argument for considering other mini-game collections with better ratios of good-to-poor games. The ratio in Rayman Raving Rabbids 2 isn't even as good as it was in the first game. And overall the game isn't as entertaining as a rabbit doing a poo on a stage, which should tell you something."}