{"ref": "https://www.eurogamer.net/dancing-stage-universe-review", "date": "21 Dec 2007", "game_name": "Dancing Stage Universe", "text": "As long-time fans of Dancing Stage, we had high hopes for the first next-gen instalment in the series. Some of these might have been a bit too high, like the one about a dance mat that lit up like the floor in Saturday Night Fever. But how about a decent track listing, a solo mode that makes sense, proper online play? Is that too much to ask? Apparently so.  Dancing Stage Universe works on the same principle as all the other Dancing Stage games. It comes bundled with a big plastic mat you plug into your console and spread out on the floor. Arrows pointing in different directions scroll up the screen, and you perform corresponding steps on the mat. Do well and you'll earn points and adulation, do badly and you'll get booed off the stage. Unfortunately, it's not just the principle that's the same. Once again the choice of songs leaves a lot to be desired, unless what you desire is people screeching words like ~reeeeeal~ and ~hiiiiiiiigh~ over super-fast Japanese techno. There are some familiar pop hits here but not enough (12), they're mostly a bit old and too many of them are rubbish. And they don't appear to have been picked with any thought to how suitable they are for frenzied dance mat stomping. Tracks like Rock Steady by All Saints and Lonely at the Top by The Ordinary Boys, for example, aren't exactly pumping disco hits. The Fratellis' Chelsea Dagger is all right, but having played SingStar we can confirm it's a lot more fun going ~Da da da, da da da~ 49 times with your voice than with your feet. The visuals do look better than in previous games. As always the videos of the J-pop songs feature lots of swirling shapes and flashing colours, but they're crisper and there's more going on. The proper pop songs are accompanied by the proper videos, but it's hard to get excited about what the Appleton twins looked like in 2003. So better, but not a great leap forward. The biggest problem that has plagued the home editions of Dancing Stage is still here: the dance mat itself. Hopping around on a nice sturdy steel mat in an arcade is one thing. Trying to repeat those moves on a bit of plastic is another. It slides all over the floor. It sticks to your feet if you're not wearing socks. If you are, it's easy to slip and lose track of where you are on the mat. This means looking down to regain your bearings, rather than at the on-screen steps. Of course cost, size and weight would make bundling a metal mat with home editions of Dancing Stage unfeasible. But it's about time someone designed a better plastic mat, one with a proper non-slip base. Rubber ridges between squares might also be good so you can feel your way around with your feet. They could even go crazy and make it wireless, perhaps. At least the standard arcade game mode is here, as is old favourite Workout Mode, so you can count the calories as you burn them. In Challenge Mode you have to adhere to special rules, such as not stepping on the up or down arrows for an entire song. It all feels rather pointless.However, at least it makes some kind of sense, unlike Quest Mode. You have to play through this to unlock all the content in the game. You won't want to. It involves taking part in various competitions with virtual players across a map of North America. To win contests, you must fill up a meter by performing steps. However, unless you're playing on one of the higher-level difficulty modes (and they are of an extremely high level), it's impossible to do this over the course of one song. Even if you perform all the steps perfectly, there just aren't enough steps within individual songs to fill up the meter. The game does let you play on, dancing to more songs it selects, until the meter is full. But it can take ten minutes or more just to complete a single contest. There's a bit of banter between songs - rival dancers do rubbish trash talking, club owners say things about money - but really it's all just nonsense. Dancing Stage is always more fun with more than one player anyway, but that's previously meant investing in another dance mat. Dancing Stage Universe is supposed to make things easier with the inclusion of an online mode. Unfortunately, it doesn't seem to be working too well. The back of the box says you can download new songs and dance steps, but we couldn't find any evidence of this in-game. It also says you can take part in quick or custom matches, or create your own. There must be other people playing Dancing Stage Universe online, because the leaderboards are full of high scores. However, no matter what time of day we tried, no matter how long we waited after creating a match, we couldn't find anyone to compete against. What you're left with is a Dancing Stage game that suffers from the same problems as the PS2 versions: dodgy songs, a mat that isn't quite adequate, a solo mode that doesn't have long term value, further investment if you want to play with a friend. Perhaps we've been spoiled by wireless guitars, plastic drum kits and the novelty of downloading tracks in the SingStore, but the whole thing looks and feels extremely dated. There's nothing new here for Dancing Stage veterans; it's not worth the investment if you've already got the PS2 games and mats. If you've never played any of the Dancing Stage games, it's well worth a try - but don't buy the Xbox 360 version. For the same money you could pick up one of the old PS2 games and two mats. Or, best of all, spend a very happy afternoon down the Trocadero."}