{"ref": "https://www.eurogamer.net/shrek-n-roll-review", "date": "9 Dec 2007", "game_name": "Shrek 'n Roll", "text": "How long did it take them to come up with that title? Imagine the conversation. ~So, it's a Shrek-themed game where you roll things around. What shall we call it?~ ~Hmm, I know, Roll Ogre Jackpot! No. Shrek, Rattle and Roll! No. Danny Hear'Say's Amazing Rolling Things Around Game! Wait, I've got it...~ There's no rock in Shrek-N-Roll, but there's an awful lot of rolling. And not a lot else. The principle is simple: two characters are positioned at either end of a plank of wood. You control whether they move the plank up or down using the left and right analogue sticks. In the middle of a plank is a ball-shaped piece of food. You must move the plank up the length of a tower, raising and lowering the characters at either end to send the food rolling left or right. The object is to feed the food to the ogre babies who pop out of the tower. You must avoid letting the ball drop into one of the swirling vortexes which are everywhere. Bonuses, such as extra lives or silver coins, are picked up by rolling the ball over them.  The single-player mode is fun for half an hour or so. The controls and the physics work well. The learning curve is well-designed so the difficulty level ramps up as your skills improve. If these elements weren't honed the game would get frustrating quickly, but they're solid. As a result, playing Shrek-N-Roll is a pleasant experience, if not a thrilling one. Things do get dull, however. Each time you lose a ball or successfully feed a baby ogre, you have to start again with the next ball from the bottom of the tower. This means working your way all the way back up. True, some of the vortexes are moving about so you can't just follow the same route, but it gets tiresome. It would have been better to have bigger towers with checkpoints for a bit more variety. The visual design varies every few rounds and the vortexes, babies and bonuses change position for each level - but apart from that, there's no difference between them. As you progress you'll unlock more levels and the odd character, but there's no real sense of reward for all your hard and repetitive work. Co-op mode makes things a bit more interesting. Here you control one end of the plank while your partner controls the other. This means you have to communicate constantly to have any chance of success, and the results can actually be hilarious. As you play you'll find yourselves developing various systems and planning specific routes through levels. You definitely feel like you're working together and not just individually trying to press the right buttons. It's the kind of mode which would be ideal for an adult and a child to play together, but beware - don't leave two children or two grown-ups who've had too much Stella to play unsupervised as it will end in tears and probably vomit. Co-op is more fun than single-player, but once again the novelty does wear off. An online option would have been nice, but you need to communicate with your partner and react so quickly even a slight lag over Xbox Live would have made this unworkable. It's fun offline anyway, if not for awfully long. The other multiplayer mode, Versus, is dreadful. Playing on a split screen, you and your opponent each work on your own tower and race to feed the final ogre baby at the top. There are weapons and power-ups to collect, such as a spell which makes the enemy's plank temporarily invisible. Which would all be fine if you could see what on earth was going on half the time. For some reason the camera is positioned far away from the towers and everything is very tiny as a result. Even if you've got a massive telly, it's hard to instantly distinguish between vortexes, ogre babies, power-ups and the ball itself. It's not impossible, but with a game like this you need to be able to identify objects immediately to react quickly. Because you can't, Versus mode is irritating to play and best left alone. All in all, Shrek-N-Roll isn't a terrible game and there is some value here for Shrek fans. The whole thing is nicely presented and plenty of your favourite characters are here, from Shrek and Fiona to Puss-In-Boots and Dawn-kayyy. But the gameplay is repetitive - not a problem for puzzle games if they also have an addictive quality, but Shrek-N-Roll just doesn't. It's certainly a pleasant diversion, but 800 Microsoft Points (GBP 6.80 / EUR 9.60) is rather a lot to pay for an hour or two of gentle entertainment."}