{"ref": "https://www.eurogamer.net/uncharted-drakes-fortune-review", "date": "5 Dec 2007", "game_name": "Uncharted: Drake's Fortune", "text": "Having released four Jak games in as many years (and four Crash Bandicoot games before that), it's hardly a great shock that Naughty Dog wanted to do something completely different on PS3. But the surprise is just how different Uncharted is compared to anything it has done before. Gone is the Day-Glo cartoon cuteness and coin-collecting kleptomania of old, and in comes an action-adventure which sits somewhere between the architectural beauty of Ico and Prince of Persia: Sands of Time, and the combat intensity of Resident Evil 4 and Gears of War. Far from being just another Tomb Raider, Uncharted, at times, feel like a wish-list of all the best bits of your favourite action games of the past five years. Of course, Naughty Dog's Evan Wells and his friends probably wouldn't admit that, preferring as they do to talk of Uncharted as more of a homage to classic action hero romps, but whatever the 'tributes' this fine game possesses, it all adds up to arguably the finest PlayStation 3 exclusive yet. Starring the improbably athletic treasure hunter Nathan Drake, the game picks up the thread with our chiselled no-nonsense hero on the trail of Sir Francis Drake, the famed 16th Century explorer that he believes is one of his distant ancestors. Sailing just off the Panamanian coast, he manages to locate what he believes to be the coffin of the Elizabethan mariner. The body's missing, but inside is a diary that's believed to hold the secret to an unimaginable treasure - and right on cue, a bunch of gun-toting pirates appear, open fire and eventually sink the dive boat. But fellow treasure hunter Victor Sullivan arrives to whisk both Nathan Drake and cable TV documentary camerawoman/host Elena Fisher to safety.And so your adventuring truly begins. After a bit of greedy skulduggery, Nathan and Victor spirit off to the dense Amazonian jungle, leaving a disgruntled Ms Fisher behind - but not for long. After an initial struggle to adapt to the rather loose feeling controls and wobbly aiming mechanics (no tutorial, see), the game soon starts to come into its own with a satisfying mix of palm-sweating acrobatics and exciting duck n' cover combat that proves to be instantly and enduringly engaging.The first thing that Naughty Dog absolutely nails is the way Drake moves. Thanks to some revelatory motion capture techniques, every physical interaction with the world feels fluid, satisfying and as natural as anything I've played. This assured sense of physical presence breeds confidence in your ability to pull off quite complex and daring manoeuvres - whether the gameplay is focused on combat situations or pure adventuring aspects. That ability to leap around from behind a pillar and roll between cover points is handled brilliantly, with all of the flexibility of something like Gears of War, but a far far greater degree of intuitiveness.In a game where the split between combat and platforming is about 50-50, you don't want one aspect of the game to be any less fun than the other. Such imbalances nearly always cause you to resent the disparity, and it's evidently something that Naughty Dog has worked extremely hard to avoid. Rather than the game's ongoing narrative and action feeling like a sequence of vaguely connected set-pieces, most of the chapters in the game flow expertly into one another. At times, this carefully 'directed', orchestrated approach lets the action and adventure ebb and flow in pace, drama and atmosphere. It feels like a journey, albeit a particularly fraught and dangerous one where imminent death lurks around every crumbling corner.When Nathan slips into Tomb Raider mode, the game almost delights in making your palms sweat, never missing a trick to give you a hairy series of leaps and climbs to pull off - usually with a hefty dose of vertigo and crumbling scenery awaiting should you falter for a moment. But unlike the unforgiving games of old, it's not a game that relies on pixel-perfect stupidity to make the leaps of faith required to continue. If you're teetering on the edge, the game will give you time to react, and, likewise, the autograb feature means that when you make any kind of jump, there's an automatic assumption that you'll want to grab on the nearest or most likely item of scenery.It probably sounds a bit dumbed down, but it just makes the whole thing so much more playable and far less of a frustrating ol' heap of trial and error. Another nice touch during your leaping and climbing is the way the camera often tilts towards an appropriate angle on your behalf to help steer you in the right direction. So many games in the past would frustrate the hell out of you by giving no clear clue on where you were supposed to be heading, whereas Uncharted seems to actively want to keep you immersed and entertained instead of wandering around cluelessly clicking or jumping on everything in the vain hope of it being the right path.And if, even after all that, you're still a bit stuck, the game's in-built hint system gives you the option of being prodded in a particular direction, or, simply, what to do (~shoot the barrels, moron,~ it might as well say at one point) by hitting L2 after a few minutes of wandering. Fortunately, such tips aren't always complete give-aways, more in a gentle 'stop faffing around and get your arse over here' kind of way - again, similar to Gears of War with its 'press Y to look at this' approach. Very much a good move, I reckon."}