{"ref": "https://www.eurogamer.net/asteroids-and-asteroids-deluxe-review", "date": "28 Nov 2007", "game_name": "Asteroids", "text": "I was in my local off-licence one morning at the end of October buying a few bottles of... breakfast, and there on the counter was a DVD of the original Halloween film. It was £2.49, and I thought to myself ~Ah what the hell. Saves me downloading it, and a bit of classic blood and mayhem at this time of year is always nice.~ I bought the DVD knowing full well I'd probably only watch it that once. I did, and it was great. Simple, available and briefly entertaining.Well, one month on and Asteroids appears on XBLA for three and a half quid. I seem to remember enjoying this classic piece of vector driven history so I thought to myself, ~Ah what the hell. Saves me loading it up on MAME, and I can play it while liggin' out on the sofa drinking my... breakfast.~ So I did, and it was pretty good. Simple, available and briefly entertaining.But now I have to haul myself off the sofa and take to the laborious toil of slaving over a review (it's an easy life, but someone's got to do it), and I'm forced to question whether Stainless Games has actually achieved anything with this latest re-issue of another classic arcade game. The short answer is a shrugging of indifferent shoulders and a jauntiness of the head, but you're here for the long answer, so let me grab my thesaurus and get waxing.As with all ~retro evolved~ titles on Xbox Live Arcade, we're given the magnanimous gift of the ~classic~ version alongside the revamped, inevitably explosion-heavy makeover. Like all ageing gamers, these classic versions are my first port of call; primarily because we subconsciously want to debunk any refurbished renderings and prove, once again, irrefutably, that games used to be better when the graphics were rubbish (sing along, retro heads). Where this classic version malarkey backfires on the developer is in reminding us that, actually, a lot of old games were only fun in the arcades and only then for the length of a credit. Asteroids was a great game, don't get me wrong, but five minutes playing the original version is a harsh reminder that the gameplay is ultimately as empty as the space you're clearing of cosmic debris.While the game was downloading, I studied the metallic, circular top of my... breakfast can, and mused on the notion that surely any adaptation of Asteroids will suffer from the loss of dedicated controls. I'm pleased to report that the thumb sticks of a modern joypad are a suitable alternative, however, and the gameplay is hindered very little by this alternate method of spinning your little spaceship on the spot. The thrust, fire and hyperspace buttons are equally to hand, so your fingers quickly remember their old duties.While it's hardly a taxing effort for a machine like the X360 to whittle up a few pseudo-vector graphics, this latest re-engineering of Ed Logg's immortal machine provides the razor-cut white lines effortlessly and accurately. So everything about the original is present, correct and fully functional, although I'm reluctant to shower praise on Atari for meeting such expected and easily achieved requirements. I've already got Asteroids in a bunch of different formats, and not being a geek-o-matic code-collector, I never really felt like my Xbox 360 was incomplete without it.Hyper-jumping to the evolved version, we see the obligatory graphical improvements setting the screen on fire and haphazardly splashing special effects about the place like the sweepings of Michael Bay's editing room floor. The background consists of a static spacescape filled with swirling purple galaxies, candy floss nebulae and undulating pin pricks of distant suns. Not a bad addition in principle, except the vivid contrast between these celestial bodies and the unfathomable blackness of space is such that the foreground graphics are regularly camouflaged against them. Finding your own ship is often a case of waiting to see the unnecessarily gaudy explosion as an invisible meteor sidles straight through it.There are some nice effects in the evolved game, such as the garish hyperjump function setting the asteroids off spinning feverishly as you leap though sub-space into the path of a different rock, but the showy firework display that fills the screen with every successful shot simply exacerbates the visibility issue. The high definition graphics help clean things up a little (although I personally enjoyed testing out the classic version in SDTV, as the muddy lines instilled a little extra nostalgic love), though quite why we're still not granted a widescreen remodelling of a retro game is anyone's guess. ~Evolved~ apparently doesn't mean extended.The Asteroids concept is understandably difficult to add a variety of gameplay modes to, but the so called ~Throttle Monkey~ mode (also present in Stainless' Centipede and Missile Command remakes) is the gaming equivalent of someone running up to you in a busy crowd and giving you a savage, double nipple twister. It's painful, embarrassing and the perpetrator's disappeared before you get a chance to break anything. Tripling the game speed and calling it an extra is nothing short of an unfunny joke, and serves absolutely no purpose. Boo, hiss.Asteroids Deluxe is precisely the same as the ordinary Asteroids game, presented in exactly the same way. It features the same gameplay tweaks that were originally made in 1980; the hyperjump is replaced by a shield, the aliens do their best to stop you lurking in one spot and picking off the cosmic rubble in relative safety and the Borg Collective appear onscreen toward the end and advance on your ship. All nice adjustments to the gameplay, but ones that can only be considered an update rather than a sequel, or alternative game. The evolved mode, at least, mimics the original Deluxe version's alternate colour scheme (blue, instead of white) so a lot of the graphics stand out a little more against the hackneyed backdrops.The sound effects of the original machines have been delightfully reproduced (the bleeps, squeaks and guttural thrust noises of the classic game are wonderfully melancholic), though an involuntary, sarcastic chortle escaped from my throat when I saw the option to increase the background music of the evolved versions, which is little more than a thumping metronome that could have been sampled from Space Invaders. It certainly isn't the kind of epic, space opera composition I generally (and perhaps unreasonably) demand from my sci-fi extravaganzas.Retro evolved has been thoroughly explored by online formats, and Asteroids really isn't the vital addition to Xbox Live Arcade that it could have been. Even though the gameplay of the original has been retained 100 per cent, the evolved aspects are nothing more than colourful, objectionable explosion effects. Perhaps expectations for such classic games are simply too high, but there's little to suggest Stainless Games spent much more than a couple of days evolving Asteroids for Live Arcade - especially considering these are the same guys who once brought us the irrepressible likes of Carmageddon (ah, how the mighty mature).If I could have bought this game using the 100 points that always seem to be leftover in my account, I would have been very happy with the few minutes of simple accessible escapism Asteroids provides. At 400 points, it still doesn't rob your wallet however, and at least it's simple, accessible and briefly entertaining."}